{
  "metadata": {
    "last_updated": "2026-01-19 02:39:57",
    "time_filter": "week",
    "subreddit": "projectmanagement",
    "total_items": 16,
    "total_comments": 204,
    "file_size_bytes": 235311
  },
  "items": [
    {
      "id": "1qdyp72",
      "title": "\"ThIs MeEtInG CoUlD HaVe BeEn aN EmAiL\", unfortunately, no it couldn't b/c YOU DON'T READ MY EMAILS",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1qdyp72/this_meeting_could_have_been_an_email/",
      "author": "candystarjones",
      "created_utc": "2026-01-15 22:56:34",
      "score": 448,
      "num_comments": 49,
      "upvote_ratio": 0.98,
      "text": "Winding down a project where I worked 9a-7p for all of December, and I feel bad about having a meeting that only lasts 15 minutes instead of just sending an update email and meeting with only active participants.\n\nHowever, then I remember that before the holidays I sent an email to the 60+ participants that are part of this project, required a read receipt, and barely 10% (!!) of the participants actually read my Go-Live email. Some even deleted without reading it. \n\nDoes anyone else just presume no one is going to read their emails but still send them anyway? What's your preferred way to get general information to people, weekly cadence with all participants? smaller communications with active participants and only general updates to larger group less frequently? ",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/projectmanagement/comments/1qdyp72/this_meeting_could_have_been_an_email/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "nzu8m8w",
          "author": "Sunnysideuppp123",
          "text": "Regardless of who he is, I saw a clip of Bezos saying he holds executive meetings where the first 30 minutes is everyone reading a brief/memo/report in silence and the rest of the meeting is them having a real discussion because that’s the only way he can get them to actually consume information and have a meaningful meeting, and I felt that in my soul.",
          "score": 33,
          "created_utc": "2026-01-16 01:30:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzyko2l",
              "author": "maroonrice",
              "text": "Can only imagine how that would go in my job… 30 mins off camera on zoom while everyone “reads” and then no questions anyways because off camera means multi tasking",
              "score": 2,
              "created_utc": "2026-01-16 17:52:15",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nzyoxxd",
              "author": "ABeaujolais",
              "text": "Then Bezos has no clue.\n\nThe worst thing you can do in a meeting is hand out reading material at the start. Several things are guaranteed. Everyone will stop looking at your and stop paying attention. All eyes will immediately drop, the person will become disengaged, and they will block you out and will read what you just put in front of them. If Bezos did that the garbage about making them read for 30 minutes is nothing more than trying to clean up a mess he created.\n\n30 minutes of reading time is ten pages, not a \"brief/memo/report.\"\n\nI don't let these situations happen. I send out the agenda beforehand and team members review and bring that agenda to the meeting (they can add agenda items if they want beforehand). We immediately talk about the agenda items, no Kabuki theater or special dances. Reviewing and bringing the agenda to the meeting is a standard, not a suggestion. The first meeting I ever ran I did hand out agendas first and watched every face immediately ignore me and drop to read the sheet I just put in front of them. I figured it out in about two seconds. Now it's no longer a problem.",
              "score": 0,
              "created_utc": "2026-01-16 18:11:11",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzuycwt",
          "author": "MelvinEatsBlubber",
          "text": "The emails I get use 1000 words to communicate what can be done in 100",
          "score": 28,
          "created_utc": "2026-01-16 03:55:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzvckjm",
              "author": "tarrasque",
              "text": "This. And then I get called out for my short emails. At least I have a prayer of people reading them.",
              "score": 4,
              "created_utc": "2026-01-16 05:29:25",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzysl4x",
                  "author": "MelvinEatsBlubber",
                  "text": "There are 2 types. \n\nThose that use too many words like lots of words. \n\nThose that can’t follow the point with so many words prefer less. \n\nWe need a middle ground",
                  "score": 0,
                  "created_utc": "2026-01-16 18:27:17",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nztp0gq",
          "author": "Equivalent_Memory3",
          "text": "I email weekly status reports, maintain a MS Project sheet, update an outline, and give weekly stand ups about progress. And yet, people are still confused about the current status.\n\nSome folk need to be spoonfed information.",
          "score": 21,
          "created_utc": "2026-01-15 23:42:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzwggco",
          "author": "HannahTheArtist",
          "text": "If they do not read it, it's their issue. I document EVERYTHING, every email sent, every read receipt.\n\nIf they pull that MEHHH I DIDNT SEEE ITTTR \"email was sent on Xxx at xxx time describing blah blah\"\n\nThere's no way 60 people have a serious influence on anything anyway, you can't MAKE them see it or understand. To attempt to do that is an over reach and waste of your own time.\n\nFuck em'\n\nI HATE HATE HATE these meetings like this bc I do read ALL and respond to ALL of my emails. So you are making the responsible good ones pay for the stupid ones, and they will resent you for it.\n\nSource: industrial electrical industry pm/sales/Ops experience (me)",
          "score": 22,
          "created_utc": "2026-01-16 11:13:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o04uf8c",
              "author": "Organic-Sebi-1432",
              "text": "Tell em Hannah!",
              "score": 1,
              "created_utc": "2026-01-17 17:04:16",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzuf1b2",
          "author": "analyteprojects",
          "text": "Often when we see the symptom of people not reading our communication it is a signal that they don't find the communication useful. That forces a habit that creates your frustration when you do have something important to convey. A few things I would suggest that may help:  \n1) Think about why you want to communicate in the first place. What is the use/outcome for your audience?  \n2) What channel is most acceptable to the audience you need to reach?  \n3) What is the urgency of the communication?\n\nOften through these questions you can do a few thing:  \n1) Tailor the communication so it is more valuable.   \n2) Reach a smaller audience so the communication is targeted to who needs to receive it.   \n3) Use a channel that will be consulted.   \n4) Use a channel that matches the urgency of the communication. \n\nHappy to chat further if that isn't helpful.",
          "score": 16,
          "created_utc": "2026-01-16 02:06:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o04v891",
              "author": "Organic-Sebi-1432",
              "text": "That’s a lot of stock into people not doing what they’re paid to do. How else can I communicate this action item is due next week? Should I send a messenger pigeon? IMO you hold them accountable, it’s just an email, read it.",
              "score": 1,
              "created_utc": "2026-01-17 17:08:00",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nztwb7j",
          "author": "painterknittersimmer",
          "text": "This is a company culture problem. I have worked for ten years at async-focused companies where calling a meeting was a big deal. If you did, you'd better have a good reason and you'd better not have invited too many people. This current company though? God for I try to send an update over email, or send instructions for a deck on slack... Crickets. If it's not a meeting, it didn't happen. Stupid shit. And every meeting has 10 or 20 people in it. Even simple questions someone will say, \"Can we jump on a quick call?\" \n\n\nIt makes me want to shoot myself in the face.",
          "score": 16,
          "created_utc": "2026-01-16 00:22:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzu0bm7",
              "author": "princesspomway",
              "text": "I've had this too. For the latter, tryna schedule around 10+ people across 5 different time zones is stupidly time consuming.",
              "score": 2,
              "created_utc": "2026-01-16 00:43:45",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzw6wwt",
          "author": "Fantastic-Nerve7068",
          "text": "yep. i send emails knowing they’re mostly for audit, not action.\n\nif it matters, it gets said live and then documented. otherwise it just disappears.",
          "score": 15,
          "created_utc": "2026-01-16 09:49:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzu1sn4",
          "author": "xx-rapunzel-xx",
          "text": "read-receipts aren’t quite accurate. some people choose “no” when they’re asked to send it, and some people choose “yes” even though they don’t read the e-mail. it pops up when you click on the e-mail as “mark as read” (i think).\n\ncan you see who declines a read-receipt and who deletes e-mails right away?",
          "score": 14,
          "created_utc": "2026-01-16 00:51:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzu3syb",
              "author": "xx-rapunzel-xx",
              "text": "another thing: i’m a coordinator. the dept i work for wants us to answer all calls, and that’s anxiety-inducing in general for me. i’m talking about regular phone calls and necessarily group meetings, if someone calls with a question, i hate being put on the spot and telling someone “idk” or “i’ll get back you”. it makes me look bad.\n\ni’m much better with e-mail, but as my manager pointed out, people don’t always read their e-mails since they get a high volume, and calling people makes the issue seem more important.",
              "score": 2,
              "created_utc": "2026-01-16 01:02:59",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzxg7wf",
          "author": "ExtraHarmless",
          "text": "Some email best practices I use;\n\nSubject=(Project Name): (Action Needed with due date/FYI/Notes/Decision/Question)  \n\nWhen someone reads the subject they instantly get the context(project), if something is needed from them and deadline.\n\nBody:\n\nHighlights; 1-2 sentences summary of email if large body of information or summary of meeting results.\n\nAction items with owners and using the @ functionality in Outlook.\n\nNotes from the meeting below(for reference and documentation)\n\nYeah, people still don't read the emails, but I have a huge CYA when Bob in accounting doesn't get the work done.\n\nI hate having weekly status meetings with the teams, but they don't get work done otherwise.\n\nWhen someone complains about meetings, I usually ask why they don't respond to emails in a timely fashion.",
          "score": 13,
          "created_utc": "2026-01-16 14:51:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzu7t4x",
          "author": "dynamicallyallie",
          "text": "I *love* a 15 minute meeting. If you can make 15 minutes for me, I can ask the right questions, get you guys to make a decision that would have been kind of cumbersome to make over email, and bog you down with less busy work.",
          "score": 10,
          "created_utc": "2026-01-16 01:25:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzuep3m",
              "author": "candystarjones",
              "text": "Maybe I should start seeing it that way.  I always feel like I'm missing something when I only go for 15 mins. I generally will talk to my ppl individually then schedule a 30 min just to confirm  in a more formal setting bc my VPs calendars are always crazy and it's better to get a sneak attack conversation in when they have free time.",
              "score": 0,
              "created_utc": "2026-01-16 02:04:14",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzugomr",
                  "author": "99conrad",
                  "text": "Use an other apps like Teams? I’m pushing hard to move project team members away from meetings to have them work right in Teams.",
                  "score": 1,
                  "created_utc": "2026-01-16 02:15:22",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nztxm28",
          "author": "tytrim89",
          "text": "I do both, I do an update meeting, and I send out nice notes with color coded action items. But im also conscious of people's time. I might schedule the meeting for an hour in case we get into discussion, but if it takes 20 minutes, then it takes 20 minutes. \n\nPeople learned early on in my PM career that im going to go out of my way to make sure you have the info you need to do your job. So if you dont do your job, im going to put you on blast in front of everyone in the meeting. I did that to my former manager and he learned very quickly.",
          "score": 11,
          "created_utc": "2026-01-16 00:29:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzufbr2",
              "author": "candystarjones",
              "text": "I think I'm just getting fatigued from making sure everyone had the info they need.  It's absolutely how I work as well but seeing so many ppl not read my simple 3 line email was sad 😔 \nThankfully I haven't had to put anyone on blast but I just know with one of my next projects my finance directors aren't going to like me bc they are the the first it'll happen to I'm sure of it lol",
              "score": 3,
              "created_utc": "2026-01-16 02:07:45",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzuciaz",
          "author": "Total_Literature_809",
          "text": "If it can be an email, I’ll send an email. If they don’t read, not my problem.",
          "score": 9,
          "created_utc": "2026-01-16 01:52:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzuh3rw",
          "author": "bleepbloop1777",
          "text": "Then they complain that they don't know what's going on!",
          "score": 10,
          "created_utc": "2026-01-16 02:17:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzvifir",
              "author": "brye86",
              "text": "That happens whether you hold a meeting or not. They’ll be aware day of. But weeks will go by or months and then they’ll say they were never aware of what you brought up during that meeting.",
              "score": 3,
              "created_utc": "2026-01-16 06:13:19",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nztq6wd",
          "author": "sparkynugnug",
          "text": "I feel like half of project management is reminding people to do what they said they’d do. So yeah I will send the emails as they form part of the project documentation, and you can pull them out to verify that the message was, in fact, delivered. In case there is any doubt.",
          "score": 17,
          "created_utc": "2026-01-15 23:49:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o006g2k",
          "author": "MBILC",
          "text": "I work in IT, people never read our emails and then send in tickets about \"Why is this happening\" which I happily reply \"Read the email IT sent and the Teams company chat it was posted in\"",
          "score": 10,
          "created_utc": "2026-01-16 22:18:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o02xcwb",
              "author": "apple_tech_admin",
              "text": "This is why I demand sign off from the CIO on major initiatives (it got that bad), so when people complain about their system change I send their emails to junk.",
              "score": 2,
              "created_utc": "2026-01-17 09:49:11",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o04y0ow",
              "author": "Total_Literature_809",
              "text": "For me I say to them, if it’s not in Jira/Confluence, it doesn’t exit",
              "score": 2,
              "created_utc": "2026-01-17 17:21:06",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzxzhhb",
          "author": "1z1z2x2x3c3c4v4v",
          "text": ">  What's your preferred way to get general information to people,\n\nYou ask them.  I do not asume that everyone wants an email, or an attachment, or a link, or a weekly update.\n\nThis should be in your communications plan.   Often, I find that my stakeholders do not want to be bombarded with my emails.  Especially status emails.",
          "score": 9,
          "created_utc": "2026-01-16 16:18:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o04twkb",
              "author": "Organic-Sebi-1432",
              "text": "Then that’s when you consult and advise them to shut up but they will receive them for record keeping lol. I really do have fun at work I play no games.",
              "score": 1,
              "created_utc": "2026-01-17 17:01:53",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzuiukd",
          "author": "Williedillo",
          "text": "I don’t invite people to meetings who don’t need to be there. Be respectful of your team’s time and they’ll respect yours. \n\nMy weekly OAC (owner, architect, contractor) meetings typically had 4 - 8 people attending. \n\nAlso, when you send an email, make sure the Subject is very clear what the body of the email is about. That way, if people are interested in your content, they will read it. You can always use a question as your Subject too.",
          "score": 15,
          "created_utc": "2026-01-16 02:27:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzug7py",
          "author": "TheKaizokuSenpai",
          "text": "one of the most infuriating things in Technology Projects lmaooo",
          "score": 6,
          "created_utc": "2026-01-16 02:12:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzzmegv",
          "author": "kaowser",
          "text": "i CC the boss",
          "score": 5,
          "created_utc": "2026-01-16 20:43:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzvunlu",
          "author": "Brodrick_Rolfson",
          "text": "I couldn't agree more !",
          "score": 5,
          "created_utc": "2026-01-16 07:56:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzw3y75",
          "author": "SpecificLie6082",
          "text": "Yes, I always send emails even if most ignore them. it’s the record. I prefer targeted updates for active participants, with broader summaries weekly or biweekly for everyone else.",
          "score": 4,
          "created_utc": "2026-01-16 09:21:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o03y06n",
          "author": "Mozarts-Gh0st",
          "text": "Remember that people receive information in various ways, use a variety of communication channels for announcements; email, all hands, slack, DSU, 5 min before another meeting, sprint planning, newsletters, your department’s wiki, Jira banners, etc. \n\nNot only does this provide your audience options in terms of how they receive information, it’s a good CYA too.",
          "score": 5,
          "created_utc": "2026-01-17 14:25:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o04r4g8",
              "author": "Organic-Sebi-1432",
              "text": "Although I agree, as a PM I draw a line in the sand and it’s served me well. I’m not sending the same message on that many different channels. Slack and email suffices, we are adults. If you don’t engage, I escalate.",
              "score": 6,
              "created_utc": "2026-01-17 16:49:11",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o04saxs",
                  "author": "Mozarts-Gh0st",
                  "text": "I agree w you, just saying that not all people receive information in the same way so using a few channels is helpful in getting the word out. I’d rather people tell me I over communicate than “You didn’t tell me.”",
                  "score": 1,
                  "created_utc": "2026-01-17 16:54:40",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzykm14",
          "author": "weems1974",
          "text": "Working for a fully remote team that uses Slack, I maybe send 3-4 emails a week. The communication is in the timeline. And if someone asks, I can point them back to it. People can set personal reminders for things. Pin or bookmark them.  Certainly it still requires professionalism. But if something has a deadline, I can set a reminder to have the message (or a link to it) pinged in the appropriate channel whenever I want.",
          "score": 3,
          "created_utc": "2026-01-16 17:52:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzui1ci",
          "author": "zomboidgirl",
          "text": "I did read receipts in my last job and I got stuck even after turning them off based on some people's personal outlook settings. I have thought about. Ringing them back, but then I remembered that Teams exists and my company is trash about sorting the important things that require background information and a deadline from one platform to another.",
          "score": 3,
          "created_utc": "2026-01-16 02:22:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzxtk73",
          "author": "ABeaujolais",
          "text": "My preferred way to get general information to people is to establish standards and protocols and hold everyone accountable. That's what a professional manager does in my opinion. No presuming about it. You can do all the weekly cadence you want and go through the dance of smaller communications less frequently or with more aroma and it won't solve anything. People need to be held accountable for reading your emails. I see lots of managers who can't understand why their team members won't do what they're supposed to and I assume that manager is not trained.",
          "score": 4,
          "created_utc": "2026-01-16 15:52:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzxzhdu",
              "author": "Stormshadow1371",
              "text": "What if you’re not the one with the authority to hold them accountable? I have multiple projects but none of the team members are direct reports and each of them have at least four other PMs tasking them with work. What would you recommend when comms breakdown then?",
              "score": 5,
              "created_utc": "2026-01-16 16:18:39",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzymbpp",
                  "author": "ABeaujolais",
                  "text": "Leadership failure. Giving management responsibility but no authority, Having four or five or six PMs all giving team members different instructions.\n\nYou're looking at this as an employee problem. It is not.\n\nI recommend working this out with leadership. I also recommend management and leadership training. You'll get nowhere trying to solve this at the employee level.",
                  "score": 2,
                  "created_utc": "2026-01-16 17:59:33",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzvuw3k",
          "author": "Firm-Wrangler-1178",
          "text": "Concisement of information in an email should be the goal.. people don't have the time to read thoroughly.. also people are rude as well",
          "score": 2,
          "created_utc": "2026-01-16 07:58:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nztpffn",
          "author": "[deleted]",
          "text": "[deleted]",
          "score": -10,
          "created_utc": "2026-01-15 23:44:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzts73w",
              "author": "painterknittersimmer",
              "text": "Buddy I *am* corporate",
              "score": 12,
              "created_utc": "2026-01-15 23:59:49",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qbzrbj",
      "title": "Scope Creep game will make you laugh cry",
      "subreddit": "projectmanagement",
      "url": "https://scope-creep.xyz/",
      "author": "Wait_joey_jojo",
      "created_utc": "2026-01-13 18:53:43",
      "score": 221,
      "num_comments": 20,
      "upvote_ratio": 0.99,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "General",
      "permalink": "https://reddit.com/r/projectmanagement/comments/1qbzrbj/scope_creep_game_will_make_you_laugh_cry/",
      "domain": "scope-creep.xyz",
      "is_self": false,
      "comments": [
        {
          "id": "nzezluf",
          "author": "Ezl",
          "text": "That was fun and funny! I wish they had kept the options realistic with unintended consequences though.  After all my options got silly I lost interest and ended it.",
          "score": 21,
          "created_utc": "2026-01-13 20:33:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzexs7s",
          "author": "littlelorax",
          "text": "I got delirious pretty quickly by choosing the chaos options. I don't have it in me to play again, because some of those scenarios were too real. Is it possible to win?",
          "score": 14,
          "created_utc": "2026-01-13 20:24:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzezgbm",
              "author": "ExtraHarmless",
              "text": "The only winning move is to choose not to play.",
              "score": 18,
              "created_utc": "2026-01-13 20:32:47",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzfo6xw",
                  "author": "rycology",
                  "text": "But.. my bank account?!",
                  "score": 5,
                  "created_utc": "2026-01-13 22:28:25",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nzf0i51",
              "author": "Rosyface_",
              "text": "I got to the end of 14 before giving up. I expect it’s either endless or hundreds of sprints long.",
              "score": 6,
              "created_utc": "2026-01-13 20:37:45",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzgeqmb",
          "author": "kraftcheeseslice",
          "text": "I’m so interested to know what newsletter it was! OP would you mind sharing the deets 👀",
          "score": 14,
          "created_utc": "2026-01-14 00:49:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzh6n4n",
              "author": "Wait_joey_jojo",
              "text": "Smashing Magazine",
              "score": 8,
              "created_utc": "2026-01-14 03:27:56",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzf08ki",
          "author": "Rosyface_",
          "text": "That was really good fun, I’m gonna send it to my entire team tomorrow. I made it to the end of sprint 14 before I just couldn’t go anymore.",
          "score": 12,
          "created_utc": "2026-01-13 20:36:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzis30p",
              "author": "Public_Halir",
              "text": "Is sprint 14 essentially 3 weeks?",
              "score": 1,
              "created_utc": "2026-01-14 11:23:36",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzko8o7",
                  "author": "Rosyface_",
                  "text": "The game doesn’t say how long each sprint is but assuming each sprint is 2 weeks, I made it for about 28 weeks.",
                  "score": 1,
                  "created_utc": "2026-01-14 17:31:52",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzhqni6",
          "author": "SkittishLittleToastr",
          "text": "How dare they",
          "score": 10,
          "created_utc": "2026-01-14 05:44:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzh6w92",
          "author": "ahallber",
          "text": "This is top! 🔥",
          "score": 7,
          "created_utc": "2026-01-14 03:29:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzg2zyc",
          "author": "MarkandMajer",
          "text": "You are a sick man 😭",
          "score": 5,
          "created_utc": "2026-01-13 23:45:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzm6q4u",
          "author": "pmpdaddyio",
          "text": "This is why iterative projects tend to fail. The game is called \"Scope Creep\", but that is exactly what an iterative project is. If programmed correctly, the game should make you succeed with every \"Sure, we can do that\". Bur instead it shows you why you can't.\n\n  \nIn predictive, the scope creep is easily handled by one of two phrases:\n\nHow soon can you approve a change order and approve the new budget and schedule?\n\nor\n\nWouldn't this make sense in version 2.0?",
          "score": 8,
          "created_utc": "2026-01-14 21:36:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "nznroo8",
              "author": "laf0",
              "text": "Your stuck in 2001 man, real agile iterative project done right has way more up than cons versus waterfall/predictive.\n\nIf you can plan everything in advance you’re already late.\n\nTech or anything is moving way too fast and you need constant validation and change to build the best hardware or software product.",
              "score": 2,
              "created_utc": "2026-01-15 02:39:10",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzntg7h",
                  "author": "pmpdaddyio",
                  "text": "FYI Agile isn’t what we are talking about here. Agile isn’t a methodology. It’s a mindset so that already tells me you don’t know what you’re talking about. So your pros/cons list is just not leaning your way. \n\nNow, let’s look at why the way I suggested is different. It’s called revenue. Iterative methods suck profit. Predictive methods generate it. \n\nAs a final comment. You used the term “Waterfall”. The 1960s called and want their methodology back. Waterfall is a stage gated method where one phase starts and must complete before the next one begins. It is a dated term and is not even in the new PMBOk. In fact, it only occurred three times in the last version. \n\nI teach this professionally and I am a senior PMO director and have been for over 30 years.",
                  "score": 2,
                  "created_utc": "2026-01-15 02:49:26",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzga6ma",
          "author": "Big_Assistance2151",
          "text": "Really neat haha",
          "score": 5,
          "created_utc": "2026-01-14 00:24:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzlf8wi",
          "author": "Sorata_Alpha",
          "text": "I became a martyr for owning up to the team. And they said I need to provide Air-support XD",
          "score": 3,
          "created_utc": "2026-01-14 19:32:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzlm2x9",
          "author": "spodergoat",
          "text": "Far 2 spoopy for me",
          "score": 2,
          "created_utc": "2026-01-14 20:03:04",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qemi3e",
      "title": "Most layoffs in my company were PMs. Is it the same in your company?",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1qemi3e/most_layoffs_in_my_company_were_pms_is_it_the/",
      "author": "ImaginaryRea1ity",
      "created_utc": "2026-01-16 17:34:52",
      "score": 93,
      "num_comments": 86,
      "upvote_ratio": 0.98,
      "text": "Wanted to see if PM roles are the most impacted in other tech companies.\n\n",
      "is_original_content": false,
      "link_flair_text": "Career",
      "permalink": "https://reddit.com/r/projectmanagement/comments/1qemi3e/most_layoffs_in_my_company_were_pms_is_it_the/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "nzywibr",
          "author": "1988rx7T2",
          "text": "Nah they kept all the PMs and sent the development work to low cost countries instead.  so it's various technical and non technical management in the HQ and in the target market managing low cost countries' work.",
          "score": 23,
          "created_utc": "2026-01-16 18:44:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzz1epl",
              "author": "Flimsy-Context1714",
              "text": "Yup these seem to be the most resilient due to the profit margin. PMs to handle the comms and outsource technical work.",
              "score": 3,
              "created_utc": "2026-01-16 19:05:57",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o02ajum",
          "author": "Mooseandagoose",
          "text": "Traditional PjMs in my tech org got swept up into the SM/ agile coach/ SAFe RTE hype of 2016-2020 and then laid off during Covid, which sucked because it downgraded a ton of talented people. \n\nWe’re hiring for TPMs, after asking for the past 5 years to replace those we lost back then. Took that long for leadership to realize that no, PjM/PgM cannot be absorbed by product and tech leads. 😠",
          "score": 17,
          "created_utc": "2026-01-17 06:20:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o03orcu",
          "author": "DwinDolvak",
          "text": "Leadership never really understands project management IMO and in times of layoffs being misunderstood or a generalist puts a target on your back. \n\nOnce the dust settles, contractor PMs are usually brought back. Vicious cycle.",
          "score": 15,
          "created_utc": "2026-01-17 13:33:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o05ykhr",
              "author": "squirrel8296",
              "text": "Yep, usually what I have seen that saves PMs is when they are doing a large amount of SME busywork that none of the SMEs actually want to do.",
              "score": 3,
              "created_utc": "2026-01-17 20:14:00",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzz7or8",
          "author": "ConradMurkitt",
          "text": "They get rid of PMs and then wonder why nothing gets done.",
          "score": 44,
          "created_utc": "2026-01-16 19:34:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0100tt",
              "author": "Switch-Cool",
              "text": "Oh! I created a unit that allows for no such roles and the optimization and efficiency sans PM glut are through the roof, never mind the savings.",
              "score": 1,
              "created_utc": "2026-01-17 01:02:19",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o02g9u3",
                  "author": "ConradMurkitt",
                  "text": "That must require some serious cultural change in your org? For the firm I work for 2 years ago I completed a project they tried to complete 10 years ago snd failed at. The failure was because there was no PM involved and in the end people just got distracted  and did other stuff. \n\nId be interested in hearing how you achieved that. In some firms I’m sure it would not be as easy as it sounds.",
                  "score": 1,
                  "created_utc": "2026-01-17 07:09:59",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0112lq",
          "author": "fineboi",
          "text": "I’ve been an independent consultant for 15 years and this is the first time as a freelancer that my phone isn’t ringing off the hook with potential clients. It seems AI is shifting funding and consuming PM roles.   In due time they will realize a PM saves time, money and heartache and have their roles budgeted for again.  Have enough projects fail or delayed and they will see the writing on the wall.",
          "score": 30,
          "created_utc": "2026-01-17 01:08:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o01rf40",
              "author": "tan_phan_vt",
              "text": "Meanwhile my company is laying off so many older gen PMs and starting to hire many new ones and train them to become PMs with strong tech background. At the same time they also convert many employees with excellent domain expertise to become PM. \n\nThey are also trying very hard to figure out which area can AI be applicable and where it should not for a while already. The division manager keeps asking if putting AI in a certain part of our operation is just for \"fun\" or is actually making people's life easier. He's aware of the buzzword.\n\nLooks like they know something's up.",
              "score": 9,
              "created_utc": "2026-01-17 03:57:30",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o022aba",
                  "author": "Venomous_Kiss",
                  "text": "Are they hiring? I have experience as PM and SCRUM Master but I'm not technical I would appreciate so much a place where they invest in technical training for PMs!",
                  "score": 2,
                  "created_utc": "2026-01-17 05:14:26",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o01zvyx",
              "author": "Old-Block-8341",
              "text": "Are you 1099 through a firm or direct to company? \nWhat current 1099 rates you seeing?",
              "score": 3,
              "created_utc": "2026-01-17 04:57:00",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o07cfil",
                  "author": "fineboi",
                  "text": "I have an LLC and accept 1099 or W2.  My last billable was $130 but it really varies by client. I drop the rate significantly for companies that are diverse and have a positive culture.",
                  "score": 3,
                  "created_utc": "2026-01-18 00:29:13",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o03mkgx",
          "author": "Media-Altruistic",
          "text": "Traditional Project Manager titles in tech has evolved to Technical program managers.\n\nOverall same work but just more responsibility on the OPEX side of the business",
          "score": 13,
          "created_utc": "2026-01-17 13:19:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzzjz51",
          "author": "czuczer",
          "text": "PMs, Agile Coaches, Scrum Masters 6 months ago",
          "score": 12,
          "created_utc": "2026-01-16 20:32:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o007ffm",
          "author": "Coldsnap",
          "text": "We have almost no Project Managers is our org now. Their tasks have been given to Product Managers and senior engineers.",
          "score": 10,
          "created_utc": "2026-01-16 22:23:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o01qjpk",
              "author": "Significant_Show_237",
              "text": "How difficult is the shift frol project managers to product managers?",
              "score": 1,
              "created_utc": "2026-01-17 03:51:35",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o02abg6",
                  "author": "Coldsnap",
                  "text": "Difficult for some, less difficult for others. Much of the role is similar, particularly stakeholder management, but a product manager is much more accountable for the success of the product long term. It’s not good enough just execute projects if those projects don’t deliver a good outcome for the product/business.",
                  "score": 2,
                  "created_utc": "2026-01-17 06:18:12",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o01gyns",
          "author": "itslioneltribbey",
          "text": "Yeah they were moved into becoming product managers instead 🪄",
          "score": 11,
          "created_utc": "2026-01-17 02:49:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o017pgd",
          "author": "Jerry_From_Queens",
          "text": "So my three-letter tech firm that you all know decided to cut many many domestic PMs and instead replace them with offshore PMs. But offshore PMs managing an onshore team doesn’t work, so now they’re trying to hire back “Engagement Leads,” which we consider a combination PM and Client Service type of hybrid role.",
          "score": 17,
          "created_utc": "2026-01-17 01:51:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o00ezsz",
          "author": "FlamingOctopi5",
          "text": "We desperately need GOOD PMs. A good PM is worth their weight in gold. The bad ones give us a bad rep. But ive been interviewing for a Sr PM role for 2 months and the amount of mediocre PMs out there is insane.",
          "score": 16,
          "created_utc": "2026-01-16 23:02:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o00lzsp",
              "author": "onelostmartian",
              "text": "How do you know theyre mediocre if you didn't hire them?",
              "score": 9,
              "created_utc": "2026-01-16 23:41:03",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o01qfp6",
                  "author": "Significant_Show_237",
                  "text": "+1",
                  "score": 2,
                  "created_utc": "2026-01-17 03:50:49",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o04pobx",
                  "author": "painterknittersimmer",
                  "text": "Have you ever interviewed people? I understand that sometimes when I interview folks, they are just having a bad day. But the truth is a great many people I've interviewed had no business working anywhere near project or program management, and I have no idea how they got the jobs on their resume. Maybe these people were magically good once they were in seat, but if you can't think on your feet well enough for an interview, I have no faith you'll be anything but mediocre on your feet in the job. ",
                  "score": 1,
                  "created_utc": "2026-01-17 16:42:28",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o00vubr",
              "author": "Account_Wrong",
              "text": "What is your company? I can't find any decent SR PM positions with decent pay bands.",
              "score": 1,
              "created_utc": "2026-01-17 00:37:26",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o00y2js",
              "author": "fineboi",
              "text": "Check me out if ur still on the hunt.[https://www.linkedin.com/in/kennypowers](https://www.linkedin.com/in/kennypowers)",
              "score": -2,
              "created_utc": "2026-01-17 00:50:24",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzz8z0q",
          "author": "ahallber",
          "text": "Yeah 100% pm’s chopped twice in three years lol",
          "score": 7,
          "created_utc": "2026-01-16 19:40:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o00fv91",
              "author": "bob_pipe_layer",
              "text": "-200% staffing, impressive!",
              "score": 1,
              "created_utc": "2026-01-16 23:07:00",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o00zpqh",
          "author": "highdiver_2000",
          "text": "Yes.  I got pushed out when my project completed.  Happy to leave.  Last I heard the customer complained when they tried using the SDM to work as a PM.",
          "score": 7,
          "created_utc": "2026-01-17 01:00:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o019web",
          "author": "EnoughNumbersAlready",
          "text": "There’s only six of us program managers that are active, one who is out on parental leave (6 months). We are overloaded with projects, running operations, implementing an ART, and defining our new programs for the new fiscal year. There was a wave of restructuring that saw about 10% of the workforce redundant but none were program or project related.",
          "score": 6,
          "created_utc": "2026-01-17 02:05:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o02zwla",
              "author": "Dr_momo",
              "text": "Dumb question: What’s an ART?",
              "score": 1,
              "created_utc": "2026-01-17 10:13:19",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o03m8k2",
                  "author": "Media-Altruistic",
                  "text": "Agile Release Train",
                  "score": 2,
                  "created_utc": "2026-01-17 13:17:46",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o03q6rr",
          "author": "Pripyatic",
          "text": "Ah, I’ve been laid off in design and laid off in marketing. I’ve been considering a switch to pm for career stability but it’s really starting to feel like none of these jobs have the appreciation they deserve!",
          "score": 5,
          "created_utc": "2026-01-17 13:42:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o063zun",
          "author": "yippy-dawg",
          "text": "As a former PM, I can confirm they are laying us off right now. I need to find a new job now, it feels a little scary.",
          "score": 6,
          "created_utc": "2026-01-17 20:41:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o06uwnc",
          "author": "Johnma1",
          "text": "Mercado libre (basically Latin American Amazon) just laid off hundreds of content designers to focus on AI content design.",
          "score": 6,
          "created_utc": "2026-01-17 22:57:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzyosqw",
          "author": "littlelorax",
          "text": "I feel like PM is the most underrated skill set in an org. We can navigate between the departments, have the executive's attention, and also know the details of the front-line employees. We can often cut through politics by removing barriers and building strong relationships. We are culture ninjas, silent and invisible, but when done well, devastatingly effective. The best of us know how to make our accomplishments visible, but most of us are more motivated by a job well done than the accolades, so we often just keep working instead of getting credit. \n\nSo unfortunately we are often desperately needed, but also the first on the chopping block. When we are gone, they can't explain why, but we are missed.",
          "score": 18,
          "created_utc": "2026-01-16 18:10:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzyyq0n",
              "author": "therealvitocornelius",
              "text": "confirmation bias. Everybody thinks their job is the most important job",
              "score": 18,
              "created_utc": "2026-01-16 18:54:02",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzz3k4i",
                  "author": "littlelorax",
                  "text": "Too true, but I am speaking both as a former PM, as well as from the perspective of other roles.  I've worn a lot of hats in my career, and I always really appreciated good project managers. So you are definitely right, but I still stand behind my statements.",
                  "score": 6,
                  "created_utc": "2026-01-16 19:15:39",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o00qawx",
                  "author": "benkalam",
                  "text": "To be fair, most underrated is different than most important, but I probably disagree with the commenter anyway.",
                  "score": 1,
                  "created_utc": "2026-01-17 00:05:26",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o00z4m8",
              "author": "DesertMountainLvn",
              "text": "You said we but not all PMs can do the things you listed. Poor project managers don't have relationships, can't influence and connect stakeholders. They don't drive projects, clear blockers and escalate as needed. They can't navigate company politics to procure resources and funds. They set meetings, take notes and and are passive participants. They take no ownership of outcomes. They are the reason why leaders and organizations think PMs are disposable and can be replaced with AI. It's sad and unfortunate. Anyone who has worked with an experienced and effective PM knows we're underrated and worth our salaries. However, when people have only worked with ineffective admin assistants parading as PMs, I can understand why they think there's little impact to letting them go.",
              "score": 5,
              "created_utc": "2026-01-17 00:56:51",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o00f8dl",
          "author": "JapanEngineer",
          "text": "I was hired last year and was the first decent PM the company hired in a long time. I've improved so many of our processes and client communication that our efficiency has increased too much. However I've also taken all the projects my boss had so he can focus on sales now so it's a win win. All our projects are delivering. Our boss is banking new contracts. Which means more projects. Which means more PMs and more engineers. \n\nQuality PMs are here to stay.",
          "score": 10,
          "created_utc": "2026-01-16 23:03:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzyunkw",
          "author": "sadfilthycasual",
          "text": "In last round of layoffs, our PM team cut 7 out of 11 PMs and cut around 10% of the engineering team.",
          "score": 5,
          "created_utc": "2026-01-16 18:36:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o00vm4w",
          "author": "Account_Wrong",
          "text": "There are only five of us. Severely overloaded and can't get any tools approved to help us. Supposedly I have job security with 20 projects in my program open.....and a lot more coming.",
          "score": 5,
          "created_utc": "2026-01-17 00:36:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o05xqf4",
          "author": "squirrel8296",
          "text": "When I left my previous company late last year, there were talks of laying off the entire PM team with several folks in leadership claiming it was a failed 6 year experiment. They recently did a large round of layoffs and laid off \\~10% of the PM department in that round. While that percentage was one of the higher ones, every department had to layoff the same headcount.\n\nThe problem I've seen is while PMs are almost always super undervalued and typically an easy target for layoffs, companies love to dump the busywork no one else wants to do on the PM team even if it is work an SEM should be doing. I would almost guarantee that is what saved the PM team at the company.",
          "score": 6,
          "created_utc": "2026-01-17 20:09:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0661lp",
          "author": "Mysterious_Syrup6639",
          "text": "It’s not universal, of course, but in tech, especially during slowdowns, PMs can be more vulnerable since their work is a bit harder to quantify than dev output. How’s your team handling it?",
          "score": 6,
          "created_utc": "2026-01-17 20:52:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o005iin",
          "author": "doomdance",
          "text": "PMs are last to be hired and first to be fired",
          "score": 7,
          "created_utc": "2026-01-16 22:14:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o00f75p",
              "author": "Firefly10886",
              "text": "LIFO",
              "score": 2,
              "created_utc": "2026-01-16 23:03:24",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzylnzc",
          "author": "KessKielce",
          "text": "It was like 80% PM for mine. 80!!!",
          "score": 5,
          "created_utc": "2026-01-16 17:56:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzz6n5f",
          "author": "Gr8AJ",
          "text": "I was the PMO Manager for an MSP and the dissolved the entire projects team and laid us all off.",
          "score": 6,
          "created_utc": "2026-01-16 19:29:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o00x6wa",
          "author": "DesertMountainLvn",
          "text": "No recent layoffs. In prior wond downs, yes PMs were laid off but all other departments were impacted as well. I was kept on to help close shop. \n\nSorry, not sorry - if your job can be automated, you're not a Project Manager.",
          "score": 8,
          "created_utc": "2026-01-17 00:45:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzyj5cp",
          "author": "gmlvsv",
          "text": "First and foremost, PMs and Scrum Masters, then everyone else.",
          "score": 3,
          "created_utc": "2026-01-16 17:45:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzyli69",
          "author": "[deleted]",
          "text": "[deleted]",
          "score": 3,
          "created_utc": "2026-01-16 17:55:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzyna69",
              "author": "cocoagiant",
              "text": "Seems to be based on OPs initial statement.",
              "score": 2,
              "created_utc": "2026-01-16 18:03:49",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o067uii",
          "author": "HighZ3nBerg",
          "text": "I’m a senior PM but I don’t report to my PMO. Instead, my group gets their own PM but my role is pretty multifaceted as I also do reporting and a ton of ad hoc stuff. \n\nNow, if the rest of my team of engineers ever figures out excel and PowerPoint and how to tie it to business needs I might be SOL…",
          "score": 3,
          "created_utc": "2026-01-17 21:01:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o01qkzf",
          "author": "Significant_Show_237",
          "text": "How difficult is the shift frol project managers to product managers?",
          "score": 7,
          "created_utc": "2026-01-17 03:51:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o060wpa",
              "author": "squirrel8296",
              "text": "I went the opposite direction because my company eliminated all of the product management roles in favor of PM generalists handling the coordination portion and SME leads handling the strategy.\n\nI was a product manager for a team that did large scale custom SaaS-style web work. I landed that role because after I graduated with a design degree I completed a full stack coding bootcamp but realized by the end of it that there was no way in hell I wanted to be a developer. So, I could translate between business, design, tech, and client teams.",
              "score": 2,
              "created_utc": "2026-01-17 20:25:56",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o04c3im",
              "author": "Ogre213",
              "text": "Depends on your background.  If you have a minimal level of technical background or can acquire it, it's pretty straightforward.  I'm talking enough to have an intelligent conversation with a developer and then translate it into business speak, not be your own low-level developer level.",
              "score": 1,
              "created_utc": "2026-01-17 15:38:09",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o00gq5d",
          "author": "Chemical-Ear9126",
          "text": "This suggests either the investment funding has been decreased or deferred, which is likely a financial / profitability decision.\nIf companies are profitable and investing in innovation and improvements to their business to service customers better than the hire PMs.  You may need to consider changing jobs, or it may mean a better role and salary for you.  You need to assess.",
          "score": 2,
          "created_utc": "2026-01-16 23:11:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzze6ad",
          "author": "loopedhuman",
          "text": "We’ve converted all PMs and Designers into engineers and are gutting the engineering team. \n\nHave a core group of senior devs that have set up scalable AI coding pipelines that the designers and PMs can run, and they ensure we keep everything on architecture. \n\nThe designers and PMs are SIGNIFICANTLY more productive. They have far more domain and business knowledge, can interface with the business better and are releasing way more features than the engineers ever did",
          "score": 4,
          "created_utc": "2026-01-16 20:04:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o009hgt",
              "author": "just-dont-panic",
              "text": "Wow. This may be the most egregious example I’ve seen so far of an ai-based reorg. \n\nGood fucking luck!",
              "score": 5,
              "created_utc": "2026-01-16 22:34:03",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nzzr05h",
              "author": "Legitimate_Buddy1922",
              "text": "How do you transform the vibe code into clean and clear code that the dev team can integrate ?",
              "score": 3,
              "created_utc": "2026-01-16 21:05:14",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzzzei0",
                  "author": "loopedhuman",
                  "text": "We have a core backbone that our CTO and senior engineers maintains. This sits on top of our core data and has really clean and stable APIs. \n\nEverything on top of that can be vibe coded and developed by a range of tools and we’re less concerned about long term scalability because we can spin things up and get them in market so quickly. As things get traction and as we learn we continue to refactor and bring them closer into the core. \n\nBut in all honesty 70% of the stiff built over the past 10 years by actual engineers is just as unsalable, has just as much technical debt, and is just as hard for new people to pick up and work on. So the trade off is theoretical anyway. Human code isn’t as good as people make it out to be. \n\nSpeed to market wins",
                  "score": 4,
                  "created_utc": "2026-01-16 21:44:47",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nzzv22v",
                  "author": "NoB0ss",
                  "text": "They don’t. In 1 year when something in their terrible codebase breaks and no one’s able to fix it, they’ll call in some consultants and spend back all the money they think they saved and then some.",
                  "score": 8,
                  "created_utc": "2026-01-16 21:24:18",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nzzsczr",
              "author": "coderqi",
              "text": "What is an AI coding pipeline?",
              "score": 2,
              "created_utc": "2026-01-16 21:11:39",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzzyfd6",
                  "author": "loopedhuman",
                  "text": "A way for non-technical engineers to easily work on and deploy apps using AI coding tools within our environment. We’ve split it into 2 streams.\n\n1. More traditional workflow where they work on features locally in cursor or claude code. We have some base instructions and workflows that ensure the AI follows set TDD processes and has really good context. Then when they merge, it runs through all of our automated tests and if it passes, we have a release manager interface where they can promote it through to staging then production just by clicking buttons. And if they need to rollback they just click a button as well. So the full pipeline can be managed by non-technical engineers. \n\n2. For more rapid feature dev and experiments we can use replit, v0, figma make and easily build apps on top of our existing APIs and deploy them via the same release manager, and they can all exist inside our main app domain alongside our core apps. All without needing to involve the core “engineering” team. \n\nWe basically restructured our infrastructure and tooling to allow anyone in the business to work on and release features and apps, and created a base layer of context and resources that allow them to get up and running really fast.",
                  "score": 2,
                  "created_utc": "2026-01-16 21:40:08",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o03g6a1",
              "author": "cpwreddit1",
              "text": "So multiple jobs in one.",
              "score": 1,
              "created_utc": "2026-01-17 12:35:44",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o00ekjd",
          "author": "CJXBS1",
          "text": "No layoffs, but no open positions. I am actually considering getting another Master's in Systems Engineering to join the technical side.",
          "score": 1,
          "created_utc": "2026-01-16 23:00:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0drsov",
          "author": "eyupjammy",
          "text": "At my husbands plays it was mostly PM’s the only ones safe were duel roles. My husband is not a PM, neither are any of the people he works with. He has been asking me for help nonstop. Happy to do it, to a point. He works for the government and right now I don’t feel like I should be supporting this insanity and making it seem like PM’s were never needed .",
          "score": 1,
          "created_utc": "2026-01-18 23:43:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o00soia",
          "author": "Switch-Cool",
          "text": "Since any PM position is such an easy position to automate - at least at my workplace! - I can see there being layoffs. A few good spreadsheets, communication templates and some solid automation triggers  yield a PM in my organization. The best is setting up the time triggers around deadlines. :-)",
          "score": -4,
          "created_utc": "2026-01-17 00:19:10",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qcqyl7",
      "title": "I realized today that playing Resident Evil in college was actually my first certification in Risk Management.",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1qcqyl7/i_realized_today_that_playing_resident_evil_in/",
      "author": "SmartPessimist_PM",
      "created_utc": "2026-01-14 15:57:22",
      "score": 83,
      "num_comments": 31,
      "upvote_ratio": 0.9,
      "text": "Back in college, I spent countless nights on long gaming marathons playing survival horror games like Resident Evil and Silent Hill. At the time, I thought I was just procrastinating or entertaining myself, but looking back now after 25 years in the corporate world, I realize those games were actually my very first lessons in strict Risk Management.\n\nIn those games, every single assumption you make, whether to turn left into a dark hallway, when to save your limited ammo, or trusting a new character, can backfire immediately. In Project Management terms, those are unmitigated risks waiting to blow up your critical path. I realized that the monsters I face now just look different. Instead of zombies, they are missed deadlines, scope creep, and hidden dependencies, but the mindset required to survive is exactly the same.\n\nYou have to anticipate the risks before they appear around the corner, you have to manage your limited resources because you never know when a boss fight (a steering committee meeting) is coming up, and you always need a contingency plan for when things go sideways. \n\nIt turns out those wasted hours in front of a screen weren't wasted at all; they were training for the chaos I manage today.\n\nI am curious if anyone else has a similar experience where a \"useless\" hobby turned out to be the best training for your career. \n\nDid anyone else learn stakeholder management from Dungeons & Dragons or resource allocation from playing Age of Empires?",
      "is_original_content": false,
      "link_flair_text": "General",
      "permalink": "https://reddit.com/r/projectmanagement/comments/1qcqyl7/i_realized_today_that_playing_resident_evil_in/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "nzk8jg3",
          "author": "Humorous_Chimp",
          "text": "This feels like one of those weird linkedin posts.\n\nHow years of trying not to upset my wife and have her scream at me made me an expert at stakeholder management!",
          "score": 22,
          "created_utc": "2026-01-14 16:20:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzkc049",
          "author": "Brad-Armpit",
          "text": "Does this mean playing Tetris helped me with meeting quick deadlines in uncertainty? ",
          "score": 7,
          "created_utc": "2026-01-14 16:36:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzko7rq",
              "author": "flopperdok",
              "text": "Skyrim helped me to understand to just follow the marker and go on autopilot, since I'm the protagonist anyway.",
              "score": 2,
              "created_utc": "2026-01-14 17:31:45",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nzlpofs",
              "author": "Willing_Economics909",
              "text": "Absolutely, not only with meeting deadlines, but also creating and clearing dead lines. \n\nGet it, because the lines are created.....and then cleared......and once the line is clear...well, it's dead......\n\nI'll see myself out.",
              "score": 2,
              "created_utc": "2026-01-14 20:19:35",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzk6oie",
          "author": "alwayslearning-247",
          "text": "And it also makes you realise that right at the start, everyone runs off and leaves you to do all the work.",
          "score": 7,
          "created_utc": "2026-01-14 16:12:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzk7zqi",
              "author": "SmartPessimist_PM",
              "text": "That is painfully accurate. It is honestly the most realistic part of the simulation. In the game, they run off to chase loot or get kills; in the office, they run off to another “critical meeting\" or they just disappear on Teams. Meanwhile, you are left standing there trying to push the payload (the actual deliverable) by yourself while shouting instructions into the void. It is good to know that the struggle is universal across both worlds.",
              "score": 1,
              "created_utc": "2026-01-14 16:18:07",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzlrleq",
          "author": "lzynjacat",
          "text": "For real, I remember getting a resume and the candidate listed under experience: World of Warcraft Guild Leader. Genuinely valuable experience for a lead position in tech, they got an interview and got hired. Legitimately impressive.",
          "score": 12,
          "created_utc": "2026-01-14 20:28:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzlwqfm",
              "author": "SmartPessimist_PM",
              "text": "That is exactly what I tell the people I mentor because it is the number one rule of a good resume, context is king. A skill is a skill, regardless of where you learned it, but you have to do the work to translate it for the audience.\n\nIf that candidate had just written gamer on their resume, they would have been ignored. But by framing it as guild leader and likely describing the conflict resolution, resource management, and remote team coordination involved, they turned a hobby into a case study on leadership. \n\nI always tell my students that if you can articulate the value of the experience and how it solves my problem as a hiring manager, I honestly don't care if you learned it at Harvard or in a discord server. The fact that they got hired proves that a good story backed by real competence will always beat a generic resume.",
              "score": 4,
              "created_utc": "2026-01-14 20:51:53",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzkaofl",
          "author": "freeleeks",
          "text": "I have learned a lot of stakeholder management from running WoW raiding teams and guilds for years and task allocation/prio. I am actually doing a bit of digging on how top guilds are ran as it’s an interesting few week sprint to the race to world first. It’s high pressure and high optimisations, interesting leadership skills present themselves there.",
          "score": 6,
          "created_utc": "2026-01-14 16:30:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzkd5s3",
              "author": "SmartPessimist_PM",
              "text": "That is a fascinating comparison because from my point of view the race to world first is essentially an agile sprint on steroids. You are dealing with real time data analysis, rapid iteration after failure, and extreme role specialization.\n\nBut honestly, leading a guild is often harder than corporate management because you are managing volunteers. You can't rely on a paycheck to keep people in line; you have to rely entirely on culture, shared purpose, and social influence. If you can get 20+ people to show up on time and execute a complex strategy purely for the love of the game, you have mastered influence without authority, which is arguably the hardest PM skill to teach.",
              "score": 3,
              "created_utc": "2026-01-14 16:41:32",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzpw0ii",
                  "author": "freeleeks",
                  "text": "Yea, I have been looking into how Saturday night live does there weekly release cadence as it’s really agile and loose in an interesting way and then RwF. \n\nThe race also has a long prep phase that is “ more relaxed” then as you described well “ a sprint on steroids” just the amount if moving parts being synced behind the scenes + rapid app development for weak auras ( now add ons ) + analysis, then the micro adjustment the players make every pull. Add in the entire “event/production” side of it and it’s a cool place to find some learnings. \n\nI am a 2 day a week cutting edge kinda player now days. But what I have learned “passively” from doing that I use every day now.",
                  "score": 1,
                  "created_utc": "2026-01-15 12:44:57",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzmniwo",
          "author": "JoseLunaArts",
          "text": "For me it was WWII sims.  The plane that kills you is the plane that you did not see.  Same happens to project risks.",
          "score": 6,
          "created_utc": "2026-01-14 22:56:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzn16rf",
              "author": "PugsandDrugz",
              "text": "Took me 30 seconds to realize this was not a \"The Sims\" expansion I missed out on.",
              "score": 4,
              "created_utc": "2026-01-15 00:09:07",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzpa7wa",
                  "author": "simmyawardwinner",
                  "text": "lmfao me too lol ill see myself out\n\n\\*walks away into r/thesims \\*",
                  "score": 3,
                  "created_utc": "2026-01-15 09:44:19",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nznaff6",
                  "author": "JoseLunaArts",
                  "text": "No it is \"air combat simulators\".",
                  "score": 1,
                  "created_utc": "2026-01-15 00:59:29",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nzmxbjt",
              "author": "Murtz1985",
              "text": "Yeah command and conquer red alert",
              "score": 1,
              "created_utc": "2026-01-14 23:48:12",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzmfyms",
          "author": "Eightstream",
          "text": "FFS can we stop with the AI slop",
          "score": 10,
          "created_utc": "2026-01-14 22:18:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzp5d7n",
          "author": "LDRSHIP24-7",
          "text": "Being a treasurer in a top WoW raiding guild helped",
          "score": 4,
          "created_utc": "2026-01-15 08:56:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzk50im",
          "author": "Enderpierce",
          "text": "I always felt running/explaining raid mechanics in destiny had a ton of overlap with managing and running teams on complicated projects.",
          "score": 3,
          "created_utc": "2026-01-14 16:04:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzk6y92",
              "author": "SmartPessimist_PM",
              "text": "I haven't played Destiny myself, but I have heard from younger engineers that the coordination required for those raids is intense. It sounds like the perfect training ground for stakeholder management, communication and crisis management. If you can explain complex, do or die mechanics to a group of six people and keep them calm enough to execute without wiping, you are already doing better than half the Project Managers I know who struggle to just run a status meeting. That ability to translate chaos into clear roles effectively in real time is the whole job.",
              "score": 2,
              "created_utc": "2026-01-14 16:13:23",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzlyvjw",
          "author": "Total_Literature_809",
          "text": "Being a Dungeons and Dragons DM really taught me a lot of orchestrating engagement from different groups with different interests",
          "score": 3,
          "created_utc": "2026-01-14 21:01:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzo3r6a",
          "author": "DaimonHans",
          "text": "Have you tried XCOM?",
          "score": 3,
          "created_utc": "2026-01-15 03:52:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nztytus",
          "author": "Neither_Text1485",
          "text": "SIMS SIMS SIMS!!!",
          "score": 3,
          "created_utc": "2026-01-16 00:35:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzk7y1k",
          "author": "Low-Illustrator-7844",
          "text": "I never thought i would live to see the day where someone could associate resident evil with project management. I can happily move on to the next life.",
          "score": 4,
          "created_utc": "2026-01-14 16:17:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzk941e",
              "author": "SmartPessimist_PM",
              "text": "Haha, I am glad I could provide that closure before you moved on! Honestly, the more I look back, the more I realize I could write an entire book on the \"accidental\" Project Management lessons I learned just by living life for 50 years. Whether it was gaming, raising kids, or planning a family trip, all those moments were secretly forging the toolbox I use today. We tend to think skills only come from a certification course, but usually, the best ones come from the chaos of just trying to survive the level you are on.",
              "score": 3,
              "created_utc": "2026-01-14 16:23:11",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzl7db7",
                  "author": "Low-Illustrator-7844",
                  "text": "The last sentence is really accurate. I never understood why someone with a certificate but less experience is seen as more valuable than someone with plenty of hands-on experience in any field.",
                  "score": 2,
                  "created_utc": "2026-01-14 18:56:35",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzu1sy8",
          "author": "SkittishLittleToastr",
          "text": "Yep. Now you mention it, this feels true to me too. Resource mgmt, health mgmt, shifting strategy based on what I can afford to carry, and know when to disregard the constraints and just go all out. Video games were my first brush with these approaches and let me hone them.\n\nThis is what I do every day, at work and in life. Assess, adjust, implement, reflect, and sometimes even win!",
          "score": 2,
          "created_utc": "2026-01-16 00:51:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzk3ewo",
          "author": "AutoModerator",
          "text": "Hey there /u/SmartPessimist_PM, have you checked out the [wiki page](https://www.reddit.com/r/projectmanagement/wiki/index) on located on r/ProjectManagement?  We have a few cert related resources, including a list of certs, common requirements, value of certs, etc.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/projectmanagement) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-14 15:57:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzpa5eu",
          "author": "simmyawardwinner",
          "text": "chess helps me be strategic as fuck when it comes to project management",
          "score": 1,
          "created_utc": "2026-01-15 09:43:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzttzzd",
              "author": "SmartPessimist_PM",
              "text": "That is a great callout, though I tend to view chess as the ultimate waterfall simulator. Because in chess, you have perfect information, all the pieces are visible, and the rules never change at the middle of the game. It is fantastic training for rigid industries like construction where the blueprint is law. But I feel like modern PM work, especially in tech or operations, is more like poker or survival horror where you have incomplete data. You have to make decisions without seeing the whole board, which is a different kind of stress entirely.",
              "score": 1,
              "created_utc": "2026-01-16 00:09:38",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qaq7n2",
      "title": "New Job as PM - Lack of Support",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1qaq7n2/new_job_as_pm_lack_of_support/",
      "author": "TheMyzzler",
      "created_utc": "2026-01-12 09:11:04",
      "score": 32,
      "num_comments": 17,
      "upvote_ratio": 0.93,
      "text": "I joined this organization in May of last year as a PM. The past few months was spent on overall onboarding, taking over 2 smaller projects that we've successfully launched and the first stages of exploring a new project that I've been assigned to.\n\nThe project is scheduled to be delivered by Nov/Dec 2026. We've worked on a high level business case that's been approved by management. Now's the time to actually kick it off.\n\nI've had discussions with my manager and our Digital Product Manager (who manages all the Product Owners and essentially coordinates the IT resources for all projects) and I'm kind of stuck: it seems they are expecting me to do PM, BA and FA work while also taking up the role of the business owner. There's no one assigned on the team but me and one Product Owner. I'm being pushed to organize requirements sessions with architects but without the right people on the team (it's a complex large scale project in a large organization) I flagged that these sessions aren't productive and quite simply a risk to the project.\n\nSo I'm kind of stuck and don't know where to go. I checked in with my sponsor last Friday and also raised the issue that we need to onboard the right people in the team to get the project started. She said she was going to look into it.\n\nI'll draft a RACI matrix to try to explain what I believe I need, but I'm very surprised at how larger projects are being managed here. It's stressing me out and it's not very motivating.\n\nIs there anything else I could do according to your experience?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/projectmanagement/comments/1qaq7n2/new_job_as_pm_lack_of_support/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "nz5p20b",
          "author": "pmpdaddyio",
          "text": "I see tons of baby PMs here struggle with this because the fundamental steps in project management have somewhat been pushed aside for a “kinder, gentler, PM” and it just doesn’t work. \n\nNobody can help you here or in your organization because you lack fundamentals and your organization lacks governance. But all is not lost. You need to go and pick up either the PMBOK 6 or the new 8 and run through the stages of a project from initiation to closeout. \n\nIdentify not just the documents required, but the roles, and expected outcome of each. Then grab your SOW and start a WBS and break down the project. Now you know what to do and get it in a schedule. Follow the monitor and control phase and focus on change management. You seem to lack that here from some of your comments. \n\nIt’s not easy because there is a uniqueness to every project and real guidance must come from you, not the people that hired you.",
          "score": 12,
          "created_utc": "2026-01-12 13:25:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "nz5q926",
              "author": "TheMyzzler",
              "text": "Thanks for the very valuable feedback and you're definitely correct.",
              "score": 2,
              "created_utc": "2026-01-12 13:32:13",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nz4zhlw",
          "author": "buildlogic",
          "text": "This is a classic PM as everything trap, and it’s a real risk signal this early. You’re doing the right thing by flagging resourcing and roles now beyond the RACI, I’d focus on documenting risks in writing and pushing for explicit decisions, either staff the team or formally accept the risk, so it doesn’t quietly become your failure later.",
          "score": 6,
          "created_utc": "2026-01-12 10:08:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz6xe5v",
          "author": "Economy_Pin_9254",
          "text": "You’re not wrong to be uneasy — this isn’t a maturity issue on your side, it’s a project establishment and setup issue.\n\nWhat’s happening is the organisation has *“started”* the project because the business case is approved, but they haven’t actually **resourced or governed** it yet. So all the ambiguity is landing on you by default.\n\nA few practical things I’d do:\n\n* Stop framing this as resourcing and start framing it as **decision risk**. Early requirements and architecture done without the right people don’t save time — they just lock in rework later.\n* A RACI is useful, but only if it’s tied to consequences. Be explicit about which decisions are being made without owners and what that means downstream.\n* Be very clear which hats you’re being asked to wear. PM + BA + business owner only works if authority comes with it. Accountability without authority is a problem, not a challenge.\n* Don’t run *“requirements theatre.”*  Workshops without the right people create false confidence. If you’re forced to proceed, label outputs as exploratory, not baseline.\n\nThis isn’t you lacking capability. It’s weak front-end governance. Push calmly, document the risk, and see how leadership responds. Their response will tell you whether this is something that gets fixed — or something you’re expected to absorb.",
          "score": 7,
          "created_utc": "2026-01-12 17:05:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz5ncyu",
          "author": "DwinDolvak",
          "text": "Not that it would help now — or maybe it would — but I like to really lean on a project charter that clearly calls out the roles and importance of those core working group roles. If any are missing I like to reiterate that in the charter every chance I get and remind everyone that the charter is our “agreement” as to how things get done. It’s a bit of smoke and mirrors at times — but I’ve always been surprised and happy how a charter can really flex to convince people of certain indisputable facts.",
          "score": 4,
          "created_utc": "2026-01-12 13:15:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "nz5pev2",
              "author": "TheMyzzler",
              "text": "Good point. I think given the stage the project is in it's still a good move to define team roles in the charter.",
              "score": 1,
              "created_utc": "2026-01-12 13:27:22",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzcuzjs",
          "author": "hasoci",
          "text": "They're treating the PM role as a catch-all because nobody owns the business side and finance side, so it defaults to you.\n\nA RACI helps, but make it tied to deliverables: who owns the business case, who owns requirements sign-off, who owns funding and benefits, who owns solution design, etc. If they still want you to be PM + BA + FA + business owner, ask what you're allowed to drop (scope, timelines, governance) because you can't keep the same dates and quality with that setup.\n\nThe fastest way I've seen this get traction is a resourcing decision meeting with your sponsor where the only agenda is “roles needed by X date or we accept Y slip/risk.”",
          "score": 5,
          "created_utc": "2026-01-13 14:27:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzb5lij",
          "author": "Icy_Acanthisitta7741",
          "text": "Well, just ask if you actually have the authority to sign these off, or whom is the person to do that. \n\nThere, you can offload those, or just sign them off. \n\nReminder to keep an email on black and white delegation of authority on these.",
          "score": 3,
          "created_utc": "2026-01-13 06:21:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz5017h",
          "author": "Oldandveryweary",
          "text": "Yeah, it happens you need to be firm. I’ve been running one project with just me and a PO for 18 months. I’ve had to learn to be an expert as even the PO is not formally on the programme and is doing his own operational work. I’ve documented it all in the lessons learnt log and made that available to senior leaders. But they pay me and i just got on with it, filling the gaps in resources. The problem we have is that my Project Manager role and Product Owner role are from permanent substantive staff and we are here whatever. The PMs and BAs tend to be contingent so they can be good, bad, or just plain absent. Over the last two years I did also a multi million pound deliverable with no BA for half of it, No PM for half of it and then the one I did get was ‘let go’. (TBH didn’t miss him). Fortunately I don’t need to worry about an FA (I assume you’re talking finance) as that’s handled at programme level. So yes I’m working multiple projects, none of which are fully resourced, it’s a challenge.",
          "score": 2,
          "created_utc": "2026-01-12 10:13:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz9fpmo",
          "author": "kewlness",
          "text": "Honestly, I love a RACI matrix, but I also am a firm believer in RAID logs. If you are having meetings with people, ask them if they see any risks (potential project blockers) or assumptions being made about the project. \n\nOne thing I have learned is upper management understands the word \"RISK\" and if you can back up what you are saying like that it might help you.",
          "score": 2,
          "created_utc": "2026-01-13 00:15:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzfv8yr",
          "author": "james-has-redd-it",
          "text": "To put a more positive light on the good advice others have already shared, this is an opportunity for you. You are about to have a lot on your plate explaining the project's need for more resourcing and specifying what you need, but you can learn that and you're starting before it's already too late, which is great. If you get the people you need to deliver well, you can share your newly acquired knowledge and start to effect change in how projects are run more widely in the organisation. That's the absolute best way to get promoted quickly. \n\nWe all sympathise with your situation as is stands right now. I wish I'd known to clearly ask for help/experts when this happened to me the first time, most of us do. You already are. Good luck!",
          "score": 2,
          "created_utc": "2026-01-13 23:04:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz5omih",
          "author": "cpwreddit1",
          "text": "Sounds pretty normal these days.",
          "score": 1,
          "created_utc": "2026-01-12 13:22:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzaw4ia",
          "author": "More_Law6245",
          "text": "Oh! the old PM in the meat sandwich thing again. Can I make a suggest? I would lead with a RACI but a supporting roles and responsibilities matrix that supports the RACI down to the skillset.  It highlights the skills deficit but it also becomes your business case for additional resources. In some cases it also becomes the I told you so document after the bodies start stacking up in the morgue. \n\nI would then suggest that you have your project board, sponsor or executive review the skills matrix then pose the question of who is accepting the risk for not making the appropriate skillsets available to the project, you have technical risks, UI risks but there is also a high probability of organisational reputational risk and that is the one that your executive needs to care about. \n\nI liken it to when you need open heart surgery,  you would expect a cardiothoracic surgeon to do the operation but someone has the bright idea that the general GP can do it instead.",
          "score": 1,
          "created_utc": "2026-01-13 05:09:25",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qdqpp0",
      "title": "Where will you go when MS Projects Online retires in late 2026?",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1qdqpp0/where_will_you_go_when_ms_projects_online_retires/",
      "author": "traemand2",
      "created_utc": "2026-01-15 17:59:41",
      "score": 18,
      "num_comments": 53,
      "upvote_ratio": 0.92,
      "text": "I'm curious. I'm very comfortable with my setup, where I can use desktop MS Projects, update plans, publish to Project Online, and then get a portfolio overview from there. \n\nIve started tinkering with Power BI, to make a portfolio dashboard that collects all projects. I can see that work, although im not sure how scalable, robust and collaborative that can be. \n\nModern WMS like ASANA, Monday etc is not an option. Those are not for serious PM work.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/projectmanagement/comments/1qdqpp0/where_will_you_go_when_ms_projects_online_retires/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "nzs5lus",
          "author": "Connect-Stop7820",
          "text": "Moving to project server on prem. It will be the exact same thing but not SaaS. An expensive move, but few other tools can do what it does as well. Especially for larger organizations who use it, this will be the path for many.",
          "score": 6,
          "created_utc": "2026-01-15 19:17:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzsf9r7",
              "author": "traemand2",
              "text": "That's going to be crazy expensive, as far as i can tell from my contact integrating these things. I'll have to look elsewhere then",
              "score": 1,
              "created_utc": "2026-01-15 20:01:31",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzsk43f",
                  "author": "1z1z2x2x3c3c4v4v",
                  "text": "How expensive, please?",
                  "score": 1,
                  "created_utc": "2026-01-15 20:24:09",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nztgwif",
              "author": "Maro1947",
              "text": "So MS is actually discontinuing a SAAS product?",
              "score": 1,
              "created_utc": "2026-01-15 22:59:22",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzxdpap",
                  "author": "Connect-Stop7820",
                  "text": "Yes. They're putting all of their money into the new Planner and letting their project online offering wither.",
                  "score": 1,
                  "created_utc": "2026-01-16 14:38:57",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzvi6k2",
          "author": "Fantastic-Nerve7068",
          "text": "Project Online filled that awkward but important gap between serious scheduling and portfolio visibility, and there isn’t a clean like for like replacement inside the MS ecosystem yet.\n\nPower BI on top of desktop Project can work for a while, but like you said, it gets brittle fast. versioning, collaboration, governance, it all starts to creak once more people touch it and once the portfolio grows.\n\nif WMS tools are a non starter, the realistic options narrow pretty quickly. you either go heavier with enterprise tools, or you look for something that still respects proper scheduling, dependencies, and portfolio views without turning everything into cards and emojis.\n\ni’ve been using celoxis and honestly it’s one of the more competent replacements i’ve seen for that Project Online style setup. proper plans, real dependencies, portfolio rollups, and reporting without forcing you into a lightweight agile only model. it feels closer to traditional PM thinking, just without being locked into the MS stack.\n\ni don’t think there’s a perfect answer yet, but for people who actually care about schedules and portfolio control, moving to something in that lane feels more realistic than trying to duct tape BI forever.",
          "score": 3,
          "created_utc": "2026-01-16 06:11:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzwgq1l",
              "author": "kranthi_contextmap",
              "text": "What do you think are the biggest limitations when compared to a tool like planner or monday?",
              "score": 2,
              "created_utc": "2026-01-16 11:15:45",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzvo7df",
          "author": "buildlogic",
          "text": "You’re not wrong as there’s no real 1:1 replacement for Project Online yet. Most serious PMs I know are sticking with Project Desktop and owning the portfolio layer via Power BI or a light PMO stack. Less about chasing the next tool, more about controlling your data and standards before 2026 hits.",
          "score": 2,
          "created_utc": "2026-01-16 07:00:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzw2i0n",
              "author": "xXWarMachineRoXx",
              "text": "Is that great?!",
              "score": 1,
              "created_utc": "2026-01-16 09:08:15",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzw3cwq",
                  "author": "buildlogic",
                  "text": "Yes it is because owning your data and standards beats chasing shiny tools every time.",
                  "score": 1,
                  "created_utc": "2026-01-16 09:16:15",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzzt7vo",
          "author": "Sweaty_Ear5457",
          "text": "totally get the struggle with finding something that handles real scheduling without the insane price tag. for portfolio visibility i switched to a canvas approach - i use instaboard and map everything visually. create sections for each project, drop cards with tasks and deadlines, then use arrows to show dependencies across projects. way easier to spot bottlenecks when you can see the whole portfolio laid out instead of digging through gantt charts or dashboards. gives you that big picture view without needing project for the web to actually get useful",
          "score": 2,
          "created_utc": "2026-01-16 21:15:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o07eobi",
          "author": "Wise-Painting5841",
          "text": "My department makes small projects and we don't have a planner so it is a Do Your Own Schedule. We keep it small and simple: 50 to 100 lines max. Super high level.\nWe were using ms project online, without the \"online\" bells and whistles.\nLast week I received and invitation for a demo on Primavera Cloud. I'm scared.\nIt would be so easy to just moved to ms project desktop... Ah, high management and their wisdom.",
          "score": 2,
          "created_utc": "2026-01-18 00:41:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzt13gt",
          "author": "samprotivsetkym",
          "text": "Any experience with oneplan.ai?",
          "score": 4,
          "created_utc": "2026-01-15 21:42:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nztgspr",
          "author": "candystarjones",
          "text": "we'll still be able to use MSP desktop version right?? I prefer the desktop version to the online anyway so I forgot that was happening! also hard agree that ASANA & Monday are not for serious PM work lol. My boss wanted my co-worker and I to explore other options to MSP last year and we did a demonstration of Monday & immediately agreed it wasn't a real replacement lol.",
          "score": 3,
          "created_utc": "2026-01-15 22:58:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzujxne",
              "author": "Htinedine",
              "text": "MSP is not brought up enough as being a gold standard PM tool. We as a PMO are evaluating our options for alternatives and while I like smart sheets and others, I just find myself always comparing it to MSP. \n\nHowever… I don’t like that it is not cloud based and VERY annoying to have multiple project managers working in the same file. Strictly speaking about the desktop version. No auto saving and the occasional file crashing leading to updates being left out… I don’t miss that.",
              "score": 2,
              "created_utc": "2026-01-16 02:33:34",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nztyfny",
              "author": "kennyarnold_ssi",
              "text": "Yes, MS Project desktop is not going away.",
              "score": 1,
              "created_utc": "2026-01-16 00:33:37",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nzwgx49",
              "author": "kranthi_contextmap",
              "text": "Could you tell me why monday is not a good replacement? It seems very popular... I know this is not a popularity contest... but curious to know where it falls short :)",
              "score": 1,
              "created_utc": "2026-01-16 11:17:20",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzsk28y",
          "author": "Ezl",
          "text": "I’ve used smartsheets for years and imo works fine, and maybe better that MS project (though I haven’t used MSP for many years so that product may have developed and also what I want to use a tool like that for has evolved so I use smartsheets more ambitiously now then I did MSP years ago).\n\nI agree re: asana, Monday, etc. but I *do* like them for portfolio management and roadmap planning a lot.",
          "score": 3,
          "created_utc": "2026-01-15 20:23:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "nztapiv",
              "author": "Goggio",
              "text": "Smartsheet is an 85 jeep wrangler but the motor and dash was upgraded for 2025. You can do ANYTHING with it but you'll have to buy the parts and have some mechanical knowledge.\n\nI will die on the hill that SS is the best option if you can dedicate the time and resources to use it fully.\n\nIf you want a honda that you know will run but the seats are cloth, the windows are manual, and it rattles at high speed - If you need something less robust, Monday is great at that price point.",
              "score": 10,
              "created_utc": "2026-01-15 22:28:16",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nztcn9b",
                  "author": "Ezl",
                  "text": "I just commented on how I used it for portfolio management (not my preferred tool) and created a roll-up dashboard based on the schedules of a bunch of other project managers.  I created a transformation sheet that would take the data from the individual schedules, use formulas to manipulate it the way I wanted, then used the native (but somewhat limited) dashboard functionality to report on that transformed data. I was annoyed at the amount of work but Lo impressed with the power and flexibility.",
                  "score": 5,
                  "created_utc": "2026-01-15 22:37:51",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nzszpvy",
              "author": "Bollox-123",
              "text": "Absolutely agree. I stopped using MS project like 8 years and switched to Smartsheet. I LOVE Smartsheet!",
              "score": 3,
              "created_utc": "2026-01-15 21:36:29",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzta0e2",
                  "author": "Ezl",
                  "text": "Did you get to the point where you use a middle-tier data sheet for reporting?  I was managing a portfolio of multiple projects run by individual project managers (say 8-10).  Smartsheets native dashboard capability is pretty limited but you can add sheet between the project schedule(s) and the dashboard to manipulate and transform the raw schedule info using formulas and then have the dashboard report that.  In one way it was a huge pain in the ass but in another I was impressed at the power and flexibility.",
                  "score": 1,
                  "created_utc": "2026-01-15 22:24:49",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o04zvbw",
                  "author": "CorrectMeasurement",
                  "text": "How can I get a good education on using Smarthsheet? Any recommendations?",
                  "score": 1,
                  "created_utc": "2026-01-17 17:29:51",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzrp6zi",
          "author": "Low_Friendship463",
          "text": "Already on SmartSheets",
          "score": 2,
          "created_utc": "2026-01-15 18:04:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzs6b31",
              "author": "ExtraHarmless",
              "text": "We are also, but not as happy as we would like.",
              "score": 2,
              "created_utc": "2026-01-15 19:20:28",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzsfrmc",
                  "author": "traemand2",
                  "text": "Why not?",
                  "score": 0,
                  "created_utc": "2026-01-15 20:03:49",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            },
            {
              "id": "nzsfqrv",
              "author": "traemand2",
              "text": "And how is it?",
              "score": 1,
              "created_utc": "2026-01-15 20:03:42",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzz5mca",
                  "author": "Low_Friendship463",
                  "text": "I like it a lot..makes it easier for reporting too since you can link the sheets to a master list so status updates for individual projects automatically (once linked) publish on our RAG matrix to include key milestones dates and some details..then at our internal group meeting the senior PM can add notes as well",
                  "score": 1,
                  "created_utc": "2026-01-16 19:25:07",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzrswxt",
          "author": "1UP-Rich",
          "text": "We’re transferring to Wrike with around 30 projects each around 300-400 tasks.  Liking it so far.",
          "score": 2,
          "created_utc": "2026-01-15 18:20:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzsfswz",
              "author": "traemand2",
              "text": "Why Wrike over other solutions?",
              "score": 2,
              "created_utc": "2026-01-15 20:03:59",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzro5y6",
          "author": "AutoModerator",
          "text": "Hey there /u/traemand2, have you checked out r/MSProject, r/projectonline, or r/microsoftproject for any questions regarding application?  These may be better suited subreddits to your question.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/projectmanagement) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-15 17:59:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzro5zb",
          "author": "AutoModerator",
          "text": "Hey there /u/traemand2, there may be more focused subreddits for your question. Have you checked out r/mondaydotcom or r/clickup for any questions regarding this application?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/projectmanagement) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-15 17:59:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzswze8",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-15 21:23:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzu2ysb",
              "author": "projectmanagement-ModTeam",
              "text": "We frequently receive recurring career-related questions, such as:\n- How to enter the project management field?\n- How to transition into a different industry?\n- Which certification should I pursue?\n- Educational-related questions\n- Interview and resume advice\n- Salary-related inquiries\n\nFor these types of questions, please refer to r/PMcareers, review our wikis, or search the subreddit using the bar at the top.",
              "score": 1,
              "created_utc": "2026-01-16 00:58:17",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzug3wx",
          "author": "bajabugger",
          "text": "Are clickup or airtable options for you?",
          "score": 1,
          "created_utc": "2026-01-16 02:12:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzyz21c",
          "author": "Ok-Midnight1594",
          "text": "Check SmartSuite. Switched my company from Smartsheet and never been happier",
          "score": 1,
          "created_utc": "2026-01-16 18:55:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o02ren5",
          "author": "Switch-Cool",
          "text": "I build custom tools.",
          "score": 1,
          "created_utc": "2026-01-17 08:52:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzrwb3s",
          "author": "unflabbergasted",
          "text": "Planner Premium (merged with MS Project for the Web), plus an adjusted MS Project Accelerator power app/BI dashboard.",
          "score": 1,
          "created_utc": "2026-01-15 18:35:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzsfncf",
              "author": "traemand2",
              "text": "As far as i can tell theres no mergin with Project for the web yet. It currently runs like a stupid ToDo.  I'm not getting my hopes up for Microsoft to be ready with a industry ready solution in Planner, replacing MS Projects",
              "score": 1,
              "created_utc": "2026-01-15 20:03:15",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzsgyhy",
                  "author": "unflabbergasted",
                  "text": "Project for the Web and Project Online are different things, but sound bizarrely similar. Project for the Web has already been merged with Planner, into Planner Premium. Project Online is being deprecated.\n\nPlanner Premium isn't perfect by any means but it's way more than the basic Planner service that is more like a To Do list. Recommend checking you have the Premium licence and see what you think.\n\nEdit: just to add, Planner Premium has less capability than Project Online so don't expect all of Project Online's functionality.",
                  "score": 2,
                  "created_utc": "2026-01-15 20:09:24",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qel7vb",
      "title": "How to frame a PIP + being let go in interviews when the industry is small?",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1qel7vb/how_to_frame_a_pip_being_let_go_in_interviews/",
      "author": "Turbulent_Run3775",
      "created_utc": "2026-01-16 16:49:22",
      "score": 18,
      "num_comments": 19,
      "upvote_ratio": 1.0,
      "text": "Hi everyone,   \n  \nI’m looking for advice on how to frame a past role in interviews, especially when interviewing with competitors in a small industry where informal reference checks are likely.\n\n  \n**Background**\n\nI joined as PM in mid-sized company whose core platform underpinned most client work, lets call this product X\n\nWhen joining I was assigned a bespoke, high-revenue project (Project A) for the biggest client of the company , that barely used Product X. I had a dedicated team and focused almost entirely on it. The project launched successfully and the client asked for further phases.\n\nAfter launch, I took on a second project (Project B) that ***was*** heavily dependent on Product X. At that point:\n\n* I had limited hands-on exposure to Product X\n* Only one senior engineer had deep platform knowledge\n* That engineer was frequently pulled onto other priorities\n\nI relied too much on the senior engineer’s confidence that work was “easy” and didn’t verify progress or escalate risk early enough. In the final weeks before launch, senior leadership had to step in, reallocate resources, and push hard to get it live. The Project B client was happy, but internally it was painful.\n\nAfter this:\n\n* The senior engineer was let go\n* I was put on a PIP\n* Despite completing the PIP, I was eventually let go\n\n  \nI **fully own** that I should have escalated risk earlier and relied on delivery evidence rather than reassurance. I’m trying to articulate that learning clearly and professionally, especially when interviewing within the same sector.\n\n**What I’m asking:**  \n  \nHow should I frame this experience honestly in interviews without oversharing?\n\n\n\n",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/projectmanagement/comments/1qel7vb/how_to_frame_a_pip_being_let_go_in_interviews/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o01gd3n",
          "author": "DCAnt1379",
          "text": "Under no circumstance do you mention any of this in an interview. If people asked what happened, you simply say you were unfortunately impacted by layoffs. Mention that your teammates were also unfortunately impacted in order to corroborate the story and leave it at that. That’s basically what happened.",
          "score": 29,
          "created_utc": "2026-01-17 02:45:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o02tt7a",
              "author": "Turbulent_Run3775",
              "text": "Totally understood, will go with this thank you.",
              "score": 4,
              "created_utc": "2026-01-17 09:15:19",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o04ovbv",
                  "author": "DCAnt1379",
                  "text": "Happy to help. It’s also worth organically mentioning “…everyone was wonderful to work with and I’m excited to see where the team goes.”\n\nAdapt the wording as you see fit. This is beneficial for protecting reputation in a small industry and showcasing positive leadership qualities (aka: “steward leadership” in the PM/PMP world). \n\nA good adage to remember: “Play chess, not checkers.”\n\nGo get ‘em - let us know where you land!",
                  "score": 5,
                  "created_utc": "2026-01-17 16:38:44",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o001d8p",
          "author": "Ambercapuchin",
          "text": "there's often a question about \"what was a challenge you overcame\" or \"what was a challenge you didn't overcome\". \n\nthe results they want are for you to say start with:\n\n \"i f***ed up. i owned it. i got help. the team made it into a win.\"  \n\n\nor \"someone else f***ed up. i didn't catch it. we were almost f***ed. the team made it into a win.\"\n\n\nand\n\n\n \"i learned from f***ing up that you never trust a sicilian when death is on the line.\" \n\netc.\n\nthere should be nowhere where anyone says \"i was on a pip\".\n\nif you have a recommendation from an old boss and they say \"homie was on a pip\", f*** that rec and that old boss; they aren't your friend.",
          "score": 9,
          "created_utc": "2026-01-16 21:54:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o02tvj2",
              "author": "Turbulent_Run3775",
              "text": "This makes sense, will apply as necessary thank you",
              "score": 1,
              "created_utc": "2026-01-17 09:15:57",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzycuc5",
          "author": "erwos",
          "text": "What is there to frame? You were on a PIP, you got off the PIP, you got laid off for business reasons. Don't bring up the PIP if no one else brings it up or asks.",
          "score": 16,
          "created_utc": "2026-01-16 17:17:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzz3ym5",
              "author": "Turbulent_Run3775",
              "text": "I am probably overthinking it but you are right",
              "score": 1,
              "created_utc": "2026-01-16 19:17:29",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o014yfm",
          "author": "Prestigious-Disk3158",
          "text": "Don’t bring this up in an interview. It only looks bad on you. When you’re competing against candidates of equal or better caliber, it will only look bad. \n\nYou can take perspectives from that failure and talk yourself up but if they point blank ask you, why you decided to leave the company, say “the company made strategic cuts and decided to RIF”.",
          "score": 7,
          "created_utc": "2026-01-17 01:33:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o00z33e",
          "author": "everettmarm",
          "text": "Why would you even discuss that in an interview?  Such a thing as too much honesty.",
          "score": 5,
          "created_utc": "2026-01-17 00:56:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzzwdte",
          "author": "RhesusFactor",
          "text": "\"during poor economic times the company chose to lose some staff and I was included. I understand the need and believe I have the transferable skills to succeed in this role.\"",
          "score": 4,
          "created_utc": "2026-01-16 21:30:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzylwmn",
          "author": "EnvironmentalHope767",
          "text": "Frame it as a valuable learning experience in a way that fits the role you are applying for.",
          "score": 2,
          "created_utc": "2026-01-16 17:57:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzyncc7",
          "author": "jthmniljt",
          "text": "I leaned to follow my gut instead of listening to the “experts”. I learned when you get a general answer that isn’t good enough, ask ask and ask.",
          "score": 2,
          "created_utc": "2026-01-16 18:04:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzz42c6",
              "author": "Turbulent_Run3775",
              "text": "that's for sure, I will definitely do more of that till I am satisfied",
              "score": 1,
              "created_utc": "2026-01-16 19:17:58",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzz1y49",
          "author": "lals80",
          "text": "How long after the PIP was completed were you let go?",
          "score": 1,
          "created_utc": "2026-01-16 19:08:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzz3cd8",
              "author": "Turbulent_Run3775",
              "text": "2/3 weeks after the PIP, was there for year overall",
              "score": 2,
              "created_utc": "2026-01-16 19:14:40",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzz4aoq",
                  "author": "lals80",
                  "text": "Were you told you successfully made it through? Timing seems odd like the plan all along was to exit you.  Also what level and years of experience we talking here?",
                  "score": 3,
                  "created_utc": "2026-01-16 19:19:02",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0coqay",
          "author": "rayfrankenstein",
          "text": "“ they had layoffs”",
          "score": 1,
          "created_utc": "2026-01-18 20:26:05",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qciyk5",
      "title": "Why do so many ERP projects fail?",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1qciyk5/why_do_so_many_erp_projects_fail/",
      "author": "Mrmike86",
      "created_utc": "2026-01-14 09:29:30",
      "score": 13,
      "num_comments": 38,
      "upvote_ratio": 0.79,
      "text": "Maybe it's me having the opposite of \"survivorship bias\", kind of like failure bias, but I feel like that's the case in a lot of small-medium companies.\n\nMy current company launched an ERP implementation last year, it looked to work well at first, but issues started adding up fast - problems with data syncing between departments most of all. \n\nWe also underestimated how much process change this would force. Some teams kept working the old way and then blamed the ERP when their numbers didn't match. And the problem of \"unclear ownership\" where no one really \"owned\" master data or cross-department workflows is another unclear one. \n\nThis is actually why we now have to invest even more and talking to an external ERP advisory firm ([Leverage Technologies](https://www.leveragetech.com.au/solutions/erp/) through a referral) - not to re-implement, but to help untangle ownership, data standards, and cross-team workflows we clearly didn't plan for properly.\n\nEither way, I've seen this happen before in other companies - ERP projects will just fail due to poor planning, lack of training and not customizing enough. But what are the \"steps\" or must-dos for a proper and smooth transition? And when do you know for sure you have to adjust your approach mid-project?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/projectmanagement/comments/1qciyk5/why_do_so_many_erp_projects_fail/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "nzn5wrj",
          "author": "tofer85",
          "text": "Poor capture of business requirements and processes. A good business analyst who can engage the client is worth their weight in gold if they can surface all the necessary detail up front to avoid any surprises and the inevitable changes that fallout from them.",
          "score": 13,
          "created_utc": "2026-01-15 00:34:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzq6cmy",
              "author": "JordanBell4President",
              "text": "“ all the necessary detail up front” is a myth and the thought that this is what “successful” projects do contributes to the dysfunction. \n\nI would suggest that a wayfinding process that expects and is designed around iterative and progressive disclosure of requirements is a better way to go. In that function, a good analyst who owns the continual discovery and realignment of needs is absolutely essential. ",
              "score": 5,
              "created_utc": "2026-01-15 13:46:25",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzrdpw8",
                  "author": "tofer85",
                  "text": "Depends on the project, but for ERP implementations, having a solid handle on the current system and processes ‘as is’ is an absolute fundamental. That’s not as designed, but how it has been bastardised and adapted in use and abuse in real life. This will then inform the baseline functional requirements (the ‘to be’) of the new system…\n\nChange is inevitable, good config control and change management will ensure this is handled correctly.",
                  "score": 2,
                  "created_utc": "2026-01-15 17:12:48",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nzpa22s",
              "author": "Mrmike86",
              "text": "You're right about the BA, we basically treated the requirements as a 'to-do list', not an actual deep dive into how we actually work. Looking back, we def missed lots of details",
              "score": 2,
              "created_utc": "2026-01-15 09:42:45",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzrfjih",
                  "author": "tofer85",
                  "text": "Start with a blank page and document all processes end to end from soup to nuts… verify the process maps with the people who are at the coalface, you will miss things or capture processes incorrectly first time round. End users are great at finding shortcuts to processes as designed and bastardising systems to make their lives easier - embrace it and learn what they do and why they do it to inform the solution design…",
                  "score": 2,
                  "created_utc": "2026-01-15 17:21:03",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzlygoc",
          "author": "phoenix823",
          "text": "ERP projects are organizational change management projects in an IT project disguise. The ERP platform can be \"made\" to run any way you want it to, it just does so a certain way out of the box. Just like the teams involved have existing processes. The challenge is changing processes and getting the people to change along with it. The implementation is otherwise pretty boring. This is exasperated by the fact that finance and HR people don't generally think horizontally across processes, they think about their piece of the functional pie. When nobody is accountable for end to end outcomes, it's all finger pointing.",
          "score": 11,
          "created_utc": "2026-01-14 20:59:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzpa7xv",
              "author": "Mrmike86",
              "text": "That \"IT project disguise\" line is exactly what we fell for because we focused way too much on the software and not enough on the people. Our departments are pretty much still stuck in their own functional silos, which is exactly why the finger-pointing started",
              "score": 4,
              "created_utc": "2026-01-15 09:44:20",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "nzmyoxu",
              "author": "Magnet2025",
              "text": "Every ERP project I’ve seen would have greatly benefited from Adoption and Change Management (ACM) professionals being brought on after technical requirements are firmed up. \n\nACM would begin to map differences between the old way and the new way, preparing users for the change and helping to smooth adoption.",
              "score": 2,
              "created_utc": "2026-01-14 23:55:37",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzq3dq4",
          "author": "cbelt3",
          "text": "Executive ownership. If your C level isn’t driving it, the lower levels can and will sabotage it. Nobody likes change, and organizations reject it.",
          "score": 12,
          "created_utc": "2026-01-15 13:30:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzlzah8",
          "author": "More_Law6245",
          "text": "Your technical and user requirements didn't drill down quite far enough. Your business processes, rules and workflows were not captured as part of those requirements.\n\nI had the luxury of working with a very gifted Senior Business Analyst on a large enterprise software change, when I hired the SBA I was just expecting some wireframes based upon user requirements. What I got was a fully constructed IT system requirements, data storage and flow requirements and business workflows all integrated into the technical design that were actually mapped back to use requirements. I got to ride on the coat tail of this exceptional work as the executive complimented the program because neither KPMG or Deloitte where able to achieve in what my SBA achieved. I essentially got schooled on how software development should be done and it's been one of my most important lessons as a project practitioner.\n\nMy SBA taught me an extremely valuable lesson about how to approach software development and how to capture technical and user requirements. The next major program I worked on I started to roll out the framework that my SBA had developed, and my program board literally said \"Are you shitting us?\", and all I said 'If you want it done properly, I have an example of how things should be done properly or do you want the program to fail?\". It was like watching the tumble weeds blow on through.\n\nI find most software projects fail because they don't drill down fair enough because a PM is not aware of how far to drill down or companies start thinking it's going to cost too much but fail to acknowledge on how much it actually costs when their implementation fails. It's why I bemuse when PM's in this reddit forum ask \"What software do you use?\" It's your business and user requirements will dictate what software to use and you find that out when you map your requirements to an application, not just spray and prey.\n\nJust an armchair perspective.",
          "score": 9,
          "created_utc": "2026-01-14 21:03:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzmnzi6",
              "author": "LJP2010",
              "text": "Woah, that sounds amazing. Any lessons you’re willing to share?",
              "score": 1,
              "created_utc": "2026-01-14 22:58:34",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzsrta9",
                  "author": "More_Law6245",
                  "text": "My most valuable lesson is that in depth planning is the key to success and it's the part that troubles me about agile is the reiterative approach wouldn't have been able to handle the nuances of the interrelationships of the data and business work flows, we would have been going in circles, making changes somewhere and breaking something else.\n\nWhen my SBA and I completed our original analysis of the asset management system, the business unit's  \"system\" comprised of 6 corporate enterprise IT systems, 8 standalone databases and 70 spreadsheets and numerous single points of failure throughout the end to end system.\n\nWith the comprehensive planning we knew if we changed one thing we knew exactly on what it would affect else where because we had documented system, data and workflows. The other success output of the program was to show how inefficient the team was operating as the program also optimised workflows which unexpected benefit realised but also allowed for cross training of staff because each staff member had built their own role and function within the team leaving the single points of failure, especially if someone was sick or on extended leave.\n\nOrganisations sometimes perceives planning a \"waste of time or an excessive cost\" and think just get building and we work from there. Taking the time to plan could turn out more cost effective than paying for all the things that go wrong with a bad deployment.",
                  "score": 3,
                  "created_utc": "2026-01-15 20:59:58",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nzochws",
              "author": "Responsible_Entry_11",
              "text": "Fully agree here. requirements gathering is not a coding/ developer task. It require getting into the details facilitated by a person leading conversations to get at those details. There is a ton of interpersonal work to get an experienced worker to share the critical process details.\nIn practice, I find even the best PMs don’t do this 100% perfectly, and on average PMs don’t do it well at all. This is where agile methods come to play - iterate over time. Waterfall methods are built for a perfect world with 100% of requirements known up front. Very efficient when that happens - nearly impossible in reality.",
              "score": 1,
              "created_utc": "2026-01-15 04:51:29",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzst6lt",
                  "author": "More_Law6245",
                  "text": "I'm actually grateful on being schooled by my SBA on how it should be done. I had delivered software and systems in the past but never as successfully as this program. What my SBA inadvertently showed me was how poorly I was delivering software projects. I was genuinely taken aback on how much face to face time he spent with stakeholders through the interview and workshop processes, to be perfectly honest I initially thought he was yanking my chain in order to extend his contract but after seeing his first draft analysis it hit me like a truck on why and how my SBA intended to deliver. \n\nIt also showed me what a good BA can do, prior to that I had worked with BA's and to be honest I did show a little contempt but walked away totally converted after this experience.",
                  "score": 2,
                  "created_utc": "2026-01-15 21:06:22",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzknlvr",
          "author": "agile_pm",
          "text": "The short answer is that they're not often treated like the organizational change or transformation that they usually are, and decision-makers often believe the vendor even though they haven't performed significant enough discovery to account for the challenges you'll face in the estimates they provide.  Being able to take action under uncertainty is an important skill, but if you're not okay with significant cost increases as you learn new things, ERP implementations are one area where spending a little more time up front can decrease the amount of surprises you'll find during execution.  You can't eliminate ALL surprises in advance, but that doesn't mean you just accept the vendor's word.  Risk identification and establishing management reserves are steps on ERP projects that should be performed early.  Finding the right balance between planning and execution, or at least giving it an honest attempt, is really the way to minimize surprises and failure.\n\nI won't bore you with my \"learning\" experiences.",
          "score": 6,
          "created_utc": "2026-01-14 17:28:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "nznp7nm",
              "author": "Flimsy-Context1714",
              "text": "I for one would love to hear them",
              "score": 2,
              "created_utc": "2026-01-15 02:24:41",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o09wyqs",
                  "author": "I_Am_MrPink",
                  "text": "+1",
                  "score": 1,
                  "created_utc": "2026-01-18 11:29:59",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o058og3",
          "author": "Deep_Repeat5201",
          "text": "I do ERP implementations daily. It's the industry I'm in as the PM. The most common problem I see is lack of training, paying attention in training, or staff trying to make it fail.\n\n\nWe alleviate this by making the entire design process into a \"training\" event for our clients. We conduct hands on virtual training where we sit them down in smaller bite sized sessions to ensure they're catching on. We create report cards during training and submit them to the client's CFO/Controller to let them know if the staff is actually trying to learn this or if they're fighting us. \n\n\nData migration is where we see the worst parts of this all. Mapping the data, importing it, making sure the end user has all the proper new mapping so they don't miscode in the new erp. It's a process, but over 3 years I've done this, we have a 98% success rate.",
          "score": 6,
          "created_utc": "2026-01-17 18:10:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nziue8o",
          "author": "TheCommunistHatake",
          "text": "In my experience it’s poor requirements gathering and training. Sales team will tell the client we are Jesus’s second coming and all his problems will be solved in a plug and play manner and when we actually start implementation you need 300 different customizations for it to work. To solve this I’ll normally have a few meetings with clients to allign expectations, get their approval on what we actually can do in the timeline they need the solution, and showcase the actual capabilities of our software to get their approval. In terms of training I usually build a robust manual and ask the cleint to provide one person per department that can be a trainer after we deliver and we train them to exhaustion. The rest of their teams receive regular training which involves a few tests to check their learning. We usually do 4-5 training sessions for each team and 10-15 for the “chosen” team members.",
          "score": 4,
          "created_utc": "2026-01-14 11:42:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzk2ra0",
          "author": "mohdgame",
          "text": "Oh, as a business owner who has well-thought-out procedures and good documentation, we had different issues.\n\n The main issue boils down to the difference between how a big business works vs a small one. \n\nLet me give you an example:\n1. SMEs don’t need complicated workflows. We don’t have a lot of specialized employees who spend all day inputting information. We need speed and simplicity. \n2. Most systems were not customizable or flexible. \n3. All ERP workflows are about workflows and input and not about getting things done. \n\nAll I need in an ERP is a good way to record information. I don’t need a lot of checks and balances and control because the volume of work is not that big. I need speed and flexibility. \n\nThat’s where most ERP systems fail. The design philosophy is geared toward businesses with a large volume of work, with a large number of dedicated employees.",
          "score": 3,
          "created_utc": "2026-01-14 15:54:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzmqtj7",
              "author": "JoseLunaArts",
              "text": "When there is not a large amount of data, Excel VBA is useful for flexible prototyping if you know how to make your code flexible and encapsulate all Excel object management into simple generic functions.  \n\nThe reason why Excel is not used for company solutions is because Excel VBA code is a local solution. \n\nWhen workflows are not complicated youhave input-process-output, which is basically the workflow of reporting.  The challenge is to adapt the code to validate user inputs because users are very creative when it comes to deliver data to be used by you for reporting.\n\nPeople think Excel VBA is to automate fixed steps of data. They are wrong.  Excel VBA is literally coding software.\n\nThe only limitation is data volume (with lots of data it is better to use Python and a database) and the fact that Excel VBA prototypes are local solutions.",
              "score": 1,
              "created_utc": "2026-01-14 23:13:21",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzj8luq",
          "author": "auyara",
          "text": "I have similar experiences with setting up MES systems ...\n\nWith these systems, there is very often a lack of understanding during requirement gathering fase resulting in discussions and rework later on.\n\nOn top of that, most of these projects are not just replacements, but suddenly users expect solutions to all there problems (wrong expectations) resulting in unneeded complexity. Often these solutions should not even belong in that system, but that is their available path...\n\nFinally, these systems often are heavily integrated and are the point where a lot of issues from the other systems combine and end up visible for the user, creating additional headaches.",
          "score": 3,
          "created_utc": "2026-01-14 13:19:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzl0p9w",
          "author": "AllTheUseCase",
          "text": "Perhaps the assumptions that are made up front are making too risky assumptions about _what works and what is needed; what doesn’t work and what isn’t needed_*. \n\nI often find enterprise IT orgs to be over confident about that type of mapping and generally resistant to working small and incremental (i.e., an ERP change/update/transformation cannot be done incrementally as a process of learning*)",
          "score": 1,
          "created_utc": "2026-01-14 18:27:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzjlshv",
          "author": "ExtraHarmless",
          "text": "I am currently supporting an ERP implementation, focused specifically on integrating external applications with the new ERP platform. As a result, I am somewhat removed from core functional and process work; however, this position provides a clear vantage point into several systemic challenges affecting the program.\n\nThe following issues have materially impacted execution, timeline, and overall program health:\n\n1. **Leadership Experience Gaps** Program leadership lacks prior ERP implementation experience. While there is strong business process and project management expertise, there is no direct ERP transition background.\n2. **Limited Vendor Accountability** The vendor (PWC) is effectively driving program decisions without sufficient oversight or accountability from internal leadership.\n3. **Missed Deliverables and Schedule Slippage** Vendor deliverables have consistently not been met. The program is currently approximately six months behind schedule, with an additional three to six months of delay likely.\n4. **Poor Documentation Practices** Documentation quality is low, with outdated content, weak version control, and insufficient maintenance as work is completed.\n5. **High Vendor Staff Turnover** Frequent vendor roll-offs have required repeated onboarding and retraining by internal teams, slowing progress and reducing efficiency.\n6. **Over-Reliance on External Contractors for Leadership** Key leadership responsibilities have shifted from internal staff to external contractors who will not be present post–go-live.\n7. **Ineffective Defect Resolution** Defect remediation during testing is slow due to poor documentation and low-quality deliverables, including inadequate unit testing by the vendor.\n8. **Ineffective Communications** Communications are neither timely nor comprehensive. Some team members were excluded from key communications for six months or more, with no effective remediation when escalated.\n9. **Reduced Internal Technical Capacity** Internal technical resources, particularly Business Analysts, were reduced by approximately 50% in the five years leading up to the implementation.\n10. **Late-Stage Data Issues** Data challenges were addressed late in the program lifecycle, resulting in avoidable rework and compounding downstream issues.",
          "score": 1,
          "created_utc": "2026-01-14 14:32:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzjlxrb",
              "author": "ExtraHarmless",
              "text": "**Recommended Approach: What to Do Instead**\n\nBased on these observations, the following practices materially increase the likelihood of a successful ERP implementation:\n\n1. **Hire Experienced ERP Leadership** Appoint a full-time internal leader, even if you need to hire externally, with direct ERP transition experience to manage the program from vendor selection through go-live and stabilization.\n2. **Actively Manage the Vendor** If a vendor is engaged, manage strictly to contractual deliverables. Leverage and trust internal teams rather than defaulting to vendor control.\n3. **Enforce Financial Accountability** Missed vendor deliverables should result in financial consequences, as defined in the contract.\n4. **Prioritize High-Quality Documentation** Documentation must be complete, accurate, current, and well-versioned. While this requires significant effort, it is critical for long-term supportability and issue resolution years after go-live.\n5. **Minimize Vendor Turnover** Require continuity in vendor staffing or impose penalties for roll-offs tied to incomplete work.\n6. **Keep Leadership Internal** Program and workstream leadership roles should be filled by full-time employees with relevant experience to ensure continuity beyond go-live.\n7. **Maintain Continuous Testing Rigor** Testing outside formal test cycles should be nearly as rigorous as during planned cycles. The primary difference should be who executes the work (technical teams versus end users), not the quality standard.\n8. **Over-Communicate Consistently** Communicate broadly, frequently, and redundantly. Maintain accurate distribution lists and assume over-communication is preferable to missed communication.\n9. **Staff for Reality, Not Optimism** Accept that ERP transitions require temporary overstaffing—particularly in technical and business process roles. Organizations must sustain daily operations while executing significant transformation work. External support can help, but it cannot fully replace internal capacity.\n10. **Resolve Data Issues First** Address future-state data requirements at the outset. While tedious, this approach prevents extensive downstream rework in both data and code.\n\n \n\n**E**RP implementations are inherently stressful and complex. They do not merely replace technology platforms; they fundamentally reshape business processes across the organization. The upside is that these transformations typically occur once every decade or longer. Executed correctly, the investment in leadership, discipline, and fundamentals pays dividends long after the system goes live.(formatted with AI for readability)",
              "score": 2,
              "created_utc": "2026-01-14 14:32:50",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzmtp89",
          "author": "JoseLunaArts",
          "text": "When it comes to automate processes, my approach is to code Excel VBA prototypes to be used by people.   the key is to encapsulate Excel object management tasks.\n\nPrototyping little by little is far slower than just documenting processes and passing specs to TI. But allows a better dynamic understanding of processes.\n\nFor example, to find if a Workbook is opened I use a boolean function that is called GOTOWORKBOOK(name) where name is a fragment of the name of the workbook. So the whole line in the main program may look like IF GOTOWOKBOOK(\"Book1\") THEN so if the workbook is found, return TRUE and move to that workbook. Else, skip the instructions inside the IF block.\n\nTo write GOTOWORKBOOK function you can use ChatGPT.\n\nOnce you have all the needed generic functions, you can start programming. My experience is that if you encapsulate Excel object management code, you can reduce your main program to up to 20% of the size you would have if you write code from scratch.\n\nThe reason why it works is that by coding small VBA prototypes I learn about how data is managed by users. And if there is a need to change a process, you will find out quickly.  The trick is to be in the shoes of users while you code, as if you had to perform the task.\n\nIt is slower than making general documentation of processes but if you documented macros properly, you will be able to have the whole prototype as a collection of local prototypes with the form of local Excel VBA macros.\n\nThe problem with not prototyping is that you will see the flaws when you already coded the software and released it to the public.\n\nThe advantahe of Excel VBA code is that it allows to create local prototypes for specific users that will increase their productivity on live processes. If the macro fails, they can always go back to manual processing.\n\nVBA macros require Windows settings to be set as \"MM/DD/YYYY\" for short date and dot as decimal symbol. Anything different and macros will suffer weird errors. So when the macro runs, it verifies that and sends me an email if the machine does not have the proper configuration. And then I proactively call the user.  That surprises users because they expected the first chance to claim that the macro did not work so they could not change their ways of doing things.\n\nAlso when there is an error, I make the error handling at the main code, and it sends me an email with information to replicate the error. That way I am ahead of people complaints.",
          "score": -1,
          "created_utc": "2026-01-14 23:28:34",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qedd1s",
      "title": "To do list never done",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1qedd1s/to_do_list_never_done/",
      "author": "Glittering_Guide1977",
      "created_utc": "2026-01-16 11:18:07",
      "score": 11,
      "num_comments": 26,
      "upvote_ratio": 0.87,
      "text": "Hi fellow project managers!\n\nI’m early-ish into my career, but leading on several projects now. To do list is never complete and it can stress me. I potentially am neurodivergent, but never had issues previously. \n\nHow do you deal with never ending to do list and feeling that something constantly needs to get done mentally and work/wise? ",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/projectmanagement/comments/1qedd1s/to_do_list_never_done/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o012m0z",
          "author": "Elleasea",
          "text": "Sounds like you need a mental \"shut down\" routine. You look at your daily list, and move unfinished items to tomorrow's list. Then allow the day to be done. Create a mental break between work/non work, and allow the work to wait for your return.",
          "score": 12,
          "created_utc": "2026-01-17 01:18:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o03xhsn",
              "author": "Capricorn974",
              "text": "This is what I do! And usually about an hour before the end of the day, so I can assess what I can still get done without staying late.",
              "score": 2,
              "created_utc": "2026-01-17 14:22:55",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o08yulk",
              "author": "ashcat2010",
              "text": "This! I’m also early career and have ADHD. I use a number of the things mentioned across this thread to keep myself (somewhat) sane, and this has been one of the most important ones. Especially as someone who mostly works remote. I have a standing calendar block at the end of each work day that’s just for final emails, closing out browser windows, finishing notes, making tomorrow’s list, and then writing out what I accomplished that day (even if it doesn’t feel like much, I often surprise myself with how much it actually is).\n\nSome other things that have been great (many mentioned in this thread):\n\nI set my priorities on a week-to-week basis, not day to day. I’ve found it’s better for me in hitting that sweet spot between staying clear on the long game and pushing through all the random tasks I gotta do. That priority list has 3 items max and only something major can change the order or what’s on it.\n\nI have a running master to-do list that I prioritize like a product backlog. But the only items marked “highest” should contribute to the week’s priorities. It always has at least 30-40 items on it (including some with a priority label that is essentially “probably never”), but I keep that master list in software so that I can easily just stay in filtered views.\n\nFinally, idk if this is applicable for you, but what me helps the most when I get overwhelmed is to remember my actual role is different from my job title. My title is project coordinator, but my most important role is to protect the time and ability of my team to do great work. I focus on my real role and a never ending to-do list becomes easier to ignore. Random stuff that will probably never get done exists on my list so it won’t exist on theirs - and that is a win in itself I can take pride in.",
              "score": 1,
              "created_utc": "2026-01-18 06:20:57",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzzp25f",
          "author": "SmartPessimist_PM",
          "text": "I have been a Project Manager for 25 years, and I can tell you that the never ending list is not a sign that you are failing; it is just the nature of the job. The secret to surviving this career without burning out is realizing that the goal isn't to complete the list, but to ruthlessly prioritize it.\n\nIf you treat every item as equally important, you will drown. My approach has always been to stop worrying about the length of the backlog and start obsessing over the priority of the immediate tasks. I lean heavily on the Scrum mindset for this exact reason. My job isn't to do everything; it is to ensure the team is working on the absolute highest priority for today and that nothing is blocking them from finishing it.\n\nAlso, be careful that your list isn't growing because you are absorbing noise that should be filtered out. A never ending list is often a sign of scope creep. You have to be willing to protect the project boundaries and escalate issues rather than just adding them to your pile. Peace of mind doesn't come from finishing the work, because there is always more work, it comes from knowing that the work you are doing today is the most critical thing for the project's success.",
          "score": 16,
          "created_utc": "2026-01-16 20:56:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o003295",
              "author": "Glittering_Guide1977",
              "text": "Thank you very much for your advice. Incredibly helpful and great to hear of the goal - to make sure the project keeps on going. I particularly appreciate your comment on doing today on what’s most critical. It’s tough to remember that at times, but a great reminder and I truly will take your advice on.",
              "score": 5,
              "created_utc": "2026-01-16 22:02:14",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzwobfa",
          "author": "Fantastic-Nerve7068",
          "text": "emails are for record, not alignment. if something actually matters, assume it won’t land without a live touchpoint.\n\nshort meetings prevent way more confusion than unread updates ever will.",
          "score": 7,
          "created_utc": "2026-01-16 12:13:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o000mhj",
              "author": "SVAuspicious",
              "text": "I strongly disagree. If something isn't documented preferably in email it didn't happen.",
              "score": 2,
              "created_utc": "2026-01-16 21:50:34",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzxalle",
          "author": "Quiet-Arm-641",
          "text": "Eisenhower matrix",
          "score": 6,
          "created_utc": "2026-01-16 14:23:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o005bdw",
              "author": "Glittering_Guide1977",
              "text": "I had a quick read on the matrix and it looks great! Will give that a go.\n\nDo you have any advice on important x not urgent, and keeping up with continuous cycle when trying to schedule time specific to a task. For example, Fridays tend to be my quiet day to finalise larger tasks or minor things that have been missed during the week. However, it also becomes the day by which I have burnt out and struggling to concentrate as I could mid-week.",
              "score": 1,
              "created_utc": "2026-01-16 22:13:17",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o009g65",
                  "author": "Quiet-Arm-641",
                  "text": "I schedule time on my calendar for time to do work including a full agenda. “Do later” in Eisenhower terms.",
                  "score": 1,
                  "created_utc": "2026-01-16 22:33:52",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o079scn",
          "author": "Williedillo",
          "text": "First of all, and I don’t want to sound morbid, but you will die someday with items on your todo list. I can say this because I’m 73 years old and lived through your pain and stress. But here’s how to overcome overwhelm:\n\nNot everything on your list is a top priority. It may seem like it, but you’ll never grow and excel at your career unless you learn how to prioritize the important stuff and ignore the rest. So, how do you know what’s a top priority?\n\nFirst, go through your tasks and decide which ones are urgent and important. And remember; not all urgent tasks are important. Important tasks affect the project success factors like cost, schedule, and quality. Important tasks also include things that increase your company’s profitability and are in your job description.\n\nYou don’t need fancy technology to manage your todo list either. I was in the construction industry for 45+ years, 25 as a construction manager, and used a paper planner most of my work life. And I was always on top of my projects. Here’s what I did…\n\nSit down before you go to bed each night and write down the three top priority tasks you need to complete tomorrow. Yes, I said three. And focus only on those tasks until they are finished or you can’t go any further without information someone else needs to provide.\n\nThen, write down other tasks that you’ll get to after you’ve finished your top three tasks. But learn to ‘procrastinate’ on the tasks that are urgent and not important. They are a waste of time.\n\nAt 73, I still plan my days like this. I’m focused on creating an online course for aspiring construction managers, and I can’t afford to waste my remaining years on trivial crap. I have a lot to pass on to the next generation of construction managers. That’s the reason God keeps me around and gave me such a fantastic career.\n\nTry my system. It works.\n\nBest, Father Time",
          "score": 8,
          "created_utc": "2026-01-18 00:15:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o084ycb",
              "author": "toasted-chestnut",
              "text": "Just to piggy back in this, when I login to work, I put teams status to away/offline for about 30 mins or so. Work through my email from the night (I work across the globe so people email at all sorts of hours), use the 4 D's to organize my inbox and as the person above suggested I prioritize items to close out. I usually get the ball rolling by completing some simple tasks, then work into the detailed stuff. Hope this helps.",
              "score": 2,
              "created_utc": "2026-01-18 03:01:45",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o08e3l7",
                  "author": "Williedillo",
                  "text": "I suggest using your most productive time, which is usually the beginning of your work day, to work on your highest priority activity. And reviewing your email ain’t one of them. Here’s why…\n\nIf you work on your highest priority activity that you identified from the night before and finish it, it’s a productivity and accomplishment rush. You’ve identified and finished your most important task.\n\nWhen you start off reading emails, you are letting other people drive your day. You’ll probably get sidetracked with the, “I’m just going to answer these couple of emails,” and you’ve done two things that are productivity busters:\n\n1. If they are just quick responses to someone else’s email, then they aren’t important. Take an hour later in the day to batch your email, responding using your 4-D’s.\n\n2. All humans only have so much brain power each day. That’s why we’re so tired at the end of the day. Work has sucked the energy out of our brains. That’s why we need sleep at night. If you start your day processing email, you’ve wasted some of that precious brain energy on something that really has little to do with your productivity. And for every actionable email you read, there’s likely 6-10 that are not related to what you said you would do when planning your day the night before.\n\nDon’t believe me? There’s a book I highly recommend called, “Eat That Frog” by Brian Tracy that explains why you should tackle your highest priority and most difficult tasks first.\n\nBecause once you’ve ‘eaten the frog’, the rest of your day is easy.",
                  "score": 2,
                  "created_utc": "2026-01-18 03:54:21",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzy4cma",
          "author": "painterknittersimmer",
          "text": "I consider it an excellent day if I crossed off more things than I added. Most days I just about net out. I don't consider it a rough day unless I add twice as many things as I crossed off. You hate those days. \n\n\nThe list will never end. If it does, something has gone wrong. Use Eisenhower if it helps. Stuff that gets pushed over and over again was probably categorized incorrectly. With time you will learn.",
          "score": 6,
          "created_utc": "2026-01-16 16:40:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o003uq5",
              "author": "Glittering_Guide1977",
              "text": "I have never thought about it that way - of looking at it in terms of number of things added vs crossed off. I typically write out the full list of key things with others at the back of my mind that aren’t as urgent that day. That’s where I likely find it tougher to tell how well it’s going down. Thank you for your advice, and will definitely give Einsenhower a go.",
              "score": 2,
              "created_utc": "2026-01-16 22:06:06",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o00aiwx",
                  "author": "painterknittersimmer",
                  "text": "Yeah, I run off a weekly view. I see the whole list of what needs to happen for a week at any given time. Then I add and cross things off as we go. I like kanban style where I drag things between \"today\" and \"undated.\" That helps me know what to focus on today. Almost everything I add has to happen this week but sometimes I'll tag stuff for next week.",
                  "score": 2,
                  "created_utc": "2026-01-16 22:39:16",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzwhnkf",
          "author": "Intelligent-Boss2289",
          "text": "Ride the wave. Prioritise, estimate, delegate, plan. The list NEVER finishes. Key thing is to hit your milestones.",
          "score": 4,
          "created_utc": "2026-01-16 11:23:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzx86j5",
          "author": "Starterguides_pm",
          "text": "I don’t think a PM to-do list is ever meant to be finished. Once I accepted that, the pressure eased a bit.\n\nWhat helped me most was being clear on what actually needs doing *today*, and letting the rest sit without feeling like I’m failing.\n\nI also try not to hold things in my head. If it’s written down somewhere I trust, I stop mentally carrying it around, which helped more than I expected.",
          "score": 4,
          "created_utc": "2026-01-16 14:10:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o005x4x",
              "author": "Glittering_Guide1977",
              "text": "Yes, such great advice and thank you, especially on writing things down. I personally have found pen and paper can’t be beaten. Digital note taking is a struggle for me, especially to find where I had written it down. \n\nI appreciate the honestly and that really has helped - knowing that there should be something left to do.",
              "score": 2,
              "created_utc": "2026-01-16 22:16:17",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzxgik3",
          "author": "aeroplane187",
          "text": "I made peace with the fact that my to-do list will never ever be complete. Ever since then, my life is easier.\n\nThe to do list always stays at \n1) stuff that is urgent - needs to be done asap\n2) stuff that is not that urgent - can wait\n3) stuff that everyone forgot but will randomly remember one day but noone will question it further because that means theyll have more work\n\nWho said being a PM is hard? ;)",
          "score": 4,
          "created_utc": "2026-01-16 14:52:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o004aw6",
              "author": "Glittering_Guide1977",
              "text": "Yes, that’s so relatable! My manager/team and I have those moments and it’s a blank space for all.\n\nThank you for your advice on prioritising the list. It likely does slip with time as there is more to do and tough to keep the priorities in check.",
              "score": 2,
              "created_utc": "2026-01-16 22:08:19",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o01tay4",
          "author": "Magnet2025",
          "text": "I am a bit OCD and have ADHD that wasn’t diagnosed until I was in my 50s. \n\nBack when I worked in the defense industry I was a big fan of the Day Timer. \n\nLater I switched to a grid notebook and grid notecards (Clairfontaine or Rhodia). The notecards are roughly 3x5 inches and are available in different colors. \n\nI write small(ish) and I figured out that filling out a notecard on one side was about a day’s worth of work. Usually it was about 5 to 7 tasks. \n\nJust a thought.",
          "score": 4,
          "created_utc": "2026-01-17 04:10:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o01p8bb",
          "author": "Shot-Corgi-7717",
          "text": "Divide your to-do list into P1, P2, and P3 (1 is most critical and 3 is least). Then tackle in order as they pertain to your project timeline.\n\nIf your to-do list keeps growing, make sure you are setting boundaries: ‘I can do A, but that means B will have to wait’ and give the person the option.\n\nAlso remember that whatever job you do, the work never ends.",
          "score": 2,
          "created_utc": "2026-01-17 03:42:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o01y0cf",
          "author": "Glittering-Word-161",
          "text": "Been using iNotes for daily lists for 6 years, key word searching is great, it’s \nDate\nDaily notes \nMeetings for the day \nTodo list - usually transfers over to the next day \nParts / material\nUpdates - per project \nService \n\n\nThis along with Monday for tracking per project , and large amounts of SharePoint file folder structure",
          "score": 2,
          "created_utc": "2026-01-17 04:43:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o03qopu",
          "author": "Independent_Terrible",
          "text": "The podcast Stuck to Started is really helping me (ADHD/OCD) with things like this. Sarah Lowell gives practical tools and addresses overwhelm and self talk. It’s been a game changer, but it’s also for neurotypicals.",
          "score": 1,
          "created_utc": "2026-01-17 13:45:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0003y5",
          "author": "SVAuspicious",
          "text": ">I potentially am neurodivergent\n\nNot relevant. You can either do your job or you can't. Ultimately everyone is a minority of one and different tools work for different people regardless of what categorizations may apply. No excuses. \n\nThere are lots of tools and methodologies to manage to-do. There are a few commonalities among the good ones. \n\n* You have to prioritize. Not everything is of equal importance. \n* Schedule and priority are not the same. \n* Whatever you choose and use, the system should be easy and fast to maintain. \n* Delegate.\n\nI use more than one tool. Outlook is the centerpiece since you can populate Tasks from email and calendar. It integrates with Teams and Slack. You can even set and update from Whatsapp with third party software. You'll be hard pressed to find any meaningful software that can't talk to Outlook. If you have some tool that doesn't talk to Outlook it likely doesn't talk to other equally important tools e.g. accounting and HRIS. \n\nI use Apple Reminders on my phone sometimes, mostly for short term to-dos that come from text messages. \n\nI always have a pad of 3x5 Post-It notes in my pocket. If all else fails I take notes there. This is especially helpful if I have to sketch something or block out an architecture or a workflow. \n\nNot really a tool but a great story - right people in the right place at the right time generated a bunch of drawings on cocktail napkins. Those are part of a patent in USPTO. Lesson: perfect is the enemy of good enough. \n\nLearn how to use file references to local and shared storage e.g. file:///H:/ProjA/PM/DetDesign/Risk.xlsx so you can click on the reference and the document opens. This is time efficient, reduces errors, ties into version control, and ties into document management. \n\nIf you're mentally blocked on something move on to something else and get back to it.",
          "score": -3,
          "created_utc": "2026-01-16 21:48:07",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qbrtni",
      "title": "Designing and managing a Product Breakdown Structure",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1qbrtni/designing_and_managing_a_product_breakdown/",
      "author": "santoshasun",
      "created_utc": "2026-01-13 13:51:02",
      "score": 5,
      "num_comments": 17,
      "upvote_ratio": 1.0,
      "text": "Hi all,\n\nI am fairly new to this, so I hope you forgive a perhaps amatuer-ish question.\n\nI would like to design and manage a product breakdown structure for a project involving the construction and installation of scientific components.  Are there software tools that can help with this?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/projectmanagement/comments/1qbrtni/designing_and_managing_a_product_breakdown/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "nzco75k",
          "author": "AutoModerator",
          "text": "Attention everyone, just because this is a post about software or tools, does not mean that you can violate the sub's 'no self-promotion, no advertising, or no soliciting' rule.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/projectmanagement) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-13 13:51:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzct5iz",
          "author": "Ezl",
          "text": "Are developing a new product and so are “creating” or do you want to break an existing product down into components so are “reverse engineering” something that’s already there?",
          "score": 1,
          "created_utc": "2026-01-13 14:17:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzdyj5m",
              "author": "santoshasun",
              "text": "It's a new thing that is very similar to an old thing.  If that makes sense?",
              "score": 1,
              "created_utc": "2026-01-13 17:45:49",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzewy01",
                  "author": "Ezl",
                  "text": "I’m in software development so not familiar with the “construction and installation of scientific components.” Is it just identifying the pieces of work needed based on understanding and decomposing requirements, breaking down the work, assigning to teams, etc. or is there something specific to that field that makes it different?",
                  "score": 1,
                  "created_utc": "2026-01-13 20:20:54",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzcuuzy",
          "author": "Sophie_Doodie",
          "text": "Most people just sketch the PBS in something like Excel, Google Sheets, or a diagram tool, then manage the actual work in whatever PM tool they already use.",
          "score": 1,
          "created_utc": "2026-01-13 14:26:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "nziahu2",
              "author": "santoshasun",
              "text": "OK, thanks.\n\nI am a pretty OK software developer, so I am toying with the idea of building a tool myself, but that will take time that I am not sure I have.  And there is probably something better already out there.",
              "score": 1,
              "created_utc": "2026-01-14 08:40:08",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzh4e9x",
          "author": "ethically-contrarian",
          "text": "Visio",
          "score": 1,
          "created_utc": "2026-01-14 03:14:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzepj4i",
          "author": "YujiHanma",
          "text": "[https://support.microsoft.com/en-us/office/create-an-organization-chart-in-office-by-using-smartart-9b51f667-11b7-4971-a757-a08a36684ee6](https://support.microsoft.com/en-us/office/create-an-organization-chart-in-office-by-using-smartart-9b51f667-11b7-4971-a757-a08a36684ee6)",
          "score": 0,
          "created_utc": "2026-01-13 19:46:30",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qek678",
      "title": "How to divide projects - 2 PMs?",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1qek678/how_to_divide_projects_2_pms/",
      "author": "Ok-Midnight1594",
      "created_utc": "2026-01-16 16:12:07",
      "score": 4,
      "num_comments": 17,
      "upvote_ratio": 0.7,
      "text": "Our company recently hired a second PM because the workload was getting to be too much for 1 person. Anyone have suggestions on how to decide how to determine who should take what projects? If you have a method that works well for you would love to hear it!",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/projectmanagement/comments/1qek678/how_to_divide_projects_2_pms/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "nzz4hrt",
          "author": "Dry_Blackberry2190",
          "text": "I would say, you pick one to do the work and the other to get all the credit for it.",
          "score": 11,
          "created_utc": "2026-01-16 19:19:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzy1lr9",
          "author": "ExtraHarmless",
          "text": "You have provided no detail about the people or the projects. \n\nBased on no information, I would flip a coin to assign.",
          "score": 4,
          "created_utc": "2026-01-16 16:28:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzyymky",
              "author": "Ok-Midnight1594",
              "text": "One is brand new to the company but has pm experience, the other has been with the company for 2 years, no previous pm experience.",
              "score": 1,
              "created_utc": "2026-01-16 18:53:37",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzy1ogz",
          "author": "Milpool_VanHouten",
          "text": "I'd make sure the seasoned employee has more of the high risk and upward facing projects within their capability until the new employee learns the organization. New employee can handle some basic projects to learn process to start, then increase responsibility as they learn the ropes. \n\nJust remember that project value/size doesn't always match effort/workload. Try to build both PMs to have comparable workloads with a mix of project value and complexity.\n\nEdit: spelling.",
          "score": 3,
          "created_utc": "2026-01-16 16:28:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzycl4i",
          "author": "agile_pm",
          "text": "Some considerations might be:\n\n* Level of complexity\n* Project phase\n* Will the project be a good introduction to the company or does it need someone with more internal experience?\n   * On a related note, how difficult are the stakeholders?\n* Does the new PM have significant industry experience that would benefit a specific project?\n\nI don't think there's one best way.",
          "score": 3,
          "created_utc": "2026-01-16 17:16:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzyh3v5",
          "author": "Apart_Ad_9778",
          "text": "We have a 1 euro coin that does it for us.",
          "score": 3,
          "created_utc": "2026-01-16 17:36:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzy22kf",
          "author": "Ambercapuchin",
          "text": "i don't have great solutions, but i have shared pieces or split projects and i have some guidelines that i use.\n\nbe kind. own mistakes.\n\ntreat task ownership with high priority absolutism.\nthis is mine. that is yours. \n\nspend bandwidth defining and clarifying process flow.\n\"since I do abc this one way, it leaves that xyz to follow-up on your side\". \"does that work?\"\n\nmeet offline from any other stakeholders and share your challenges and successes. disagree about the details thoroughly and with pictures until you agree. this is no place for passive acceptance to smooth relationships. build respect by owning mistakes and work through repairing the process together.\n\nespecially when projects intertwine, there needs to be official steering of those intersections. make sure it's heard loud and clear upstream that bandwidth allocation for steering must exist and that you and pm2 voices are heard, funded and actionable.\n\ngood luck!",
          "score": 5,
          "created_utc": "2026-01-16 16:30:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o054krq",
          "author": "Sophie_Doodie",
          "text": "Split ownership cleanly, by product, client type, or lifecycle, so each PM fully owns their lane, instead of both half owning everything and stepping on each other.",
          "score": 2,
          "created_utc": "2026-01-17 17:51:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0067b0",
          "author": "Economy_Pin_9254",
          "text": "I’d avoid splitting purely by *number of projects*. That’s usually how you end up overloaded again.\n\nWhat’s worked best for me is dividing based on **complexity and decision load**, not volume. A few practical ways to think about it:\n\n* **Type of work, not count** Some projects are execution-heavy but predictable. Others are small on paper but full of ambiguity, stakeholders, and decisions. Balance those across PMs.\n* **Lifecycle split (if it fits)** One PM focuses more on front-end work (initiation, scoping, planning, approvals), the other on delivery and close-out. This only works if handovers are clean and decision and accountability are clear.\n* **Stakeholder intensity** Projects with high exec visibility, political risk, or lots of external parties take more PM energy. Don’t stack all of those on one person.\n* **Skill and context fit** If one PM has stronger technical depth and the other is better with change, comms, or vendors, lean into that. Forcing symmetry usually creates friction.\n* **Capacity review, not a one-off split** Make it explicit that allocation gets reviewed monthly or quarterly. Projects change shape, and static splits cause drift.\n\nThe biggest mistake I see is treating PM capacity like a spreadsheet problem. It’s really about **where decisions and uncertainty sit**. Balance *that*, and the workload tends to even out naturally.\n\nHope that helps.",
          "score": 2,
          "created_utc": "2026-01-16 22:17:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzy1gij",
          "author": "theamberlamps",
          "text": "1) interest -- what do they want to work on and will be invested in?\n2) don't have projects exiting planning, delivery, or closing overlap where possible. those are always the most chaotic times for a project and require the most attention.\n3) consider how many cross functional teams need to be involved in each project. if a project is going to take 1000 hours but only involves 2 teams, it's less complex than the one that takes 300 hours but involves resources from 5 different groups. the latter ones are always a clown show and take way more of your PMs time than you think. don't load one PM up with the latter",
          "score": 1,
          "created_utc": "2026-01-16 16:27:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzylz2g",
          "author": "jthmniljt",
          "text": "Yeah. What they said. Give each project a number based on complexity. Distribute so both of you have similar totals.",
          "score": 1,
          "created_utc": "2026-01-16 17:58:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o05hlv1",
          "author": "analyteprojects",
          "text": "I'd just let them decide how to divide the work between them.",
          "score": 1,
          "created_utc": "2026-01-17 18:51:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzxzxki",
          "author": "toobadnosad",
          "text": "1 primary, 1 support. Roles alternating. Until projects are tailored for specific specialties, two chefs are needed in the kitchen for redundancy.",
          "score": 1,
          "created_utc": "2026-01-16 16:20:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzyyuuq",
              "author": "Ok-Midnight1594",
              "text": "I’m finding two cooks makes for a very disorganized and loud kitchen though.",
              "score": 2,
              "created_utc": "2026-01-16 18:54:37",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzxzyx6",
          "author": "Special_Extent6994",
          "text": "Based on their interest? People are naturally more productive when they can work on what they prefer. Or based on their skills, if one is more senior than other- give more complex projects to a more skilled PM. OR- more complex project to the newbie and get some popcorn 🍿 so many options 🤣",
          "score": 1,
          "created_utc": "2026-01-16 16:20:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzypuy3",
          "author": "Sweaty_Ear5457",
          "text": "yeah this is tricky. what worked for us was literally mapping everything out on one board so we could actually see the workload balance. we put all projects as cards then created sections for each pm - but also color coded by complexity. made it way easier to move projects around visually until the load felt right. i use instaboard for this since it lets you drag stuff between sections in real time and you can see who's overloaded at a glance",
          "score": 1,
          "created_utc": "2026-01-16 18:15:15",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qdliod",
      "title": "How do I do this job? (am I using Jira right?)",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1qdliod/how_do_i_do_this_job_am_i_using_jira_right/",
      "author": "superjuane",
      "created_utc": "2026-01-15 14:49:54",
      "score": 4,
      "num_comments": 10,
      "upvote_ratio": 0.67,
      "text": "Hi, I'm 25 yo and I find myself in the role of managing several small/medium projects in a small software consulting firm in Barcelona, but I don't have a lot of experience (I've always been a developer).\n\nAt my job we don't have a standard set of tools for managing projects: resource assignments, tasks, dates... (just some place to write the worked hours so we can bill it to the clients). Normally other consultants that manage developers work just use a Doc or and Excel to write things down, and have mostly everything in their heads.\n\nI've just started using Jira, multiple kanban dashboards and backlogs to keep everything written down, and I assign tickets with as much context as I can to developers, sometimes to devs outside of my small team (4 devs + me for 5 or 6 different projects)\n\nBut, between the meetings with clients, devs calling for help, sometimes developing myself and designing software architecture, I find myself I don't have that much time to maintain the jira, to read every update on every ticket... Much less to really plan and keep track of the projects, segment the work in smaller bits to delegate to other devs outside of my small team.\n\nI want to ask for more resources, but I barelly have time to manage the ones I have (on top of managing the projects).\n\nSimeone more experienced, have some advice? Would be apreciated, thanks",
      "is_original_content": false,
      "link_flair_text": "General",
      "permalink": "https://reddit.com/r/projectmanagement/comments/1qdliod/how_do_i_do_this_job_am_i_using_jira_right/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "nzqiiuq",
          "author": "AutoModerator",
          "text": "Attention everyone, just because this is a post about software or tools, does not mean that you can violate the sub's 'no self-promotion, no advertising, or no soliciting' rule.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/projectmanagement) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-15 14:49:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzqvo6d",
          "author": "Silver-Snow-8946",
          "text": "Project management is a full time job. The problem I see is that you are trying to do it as a afterthought. You need a dedicated person who will do project management and give you time to do dev/architecture work.",
          "score": 5,
          "created_utc": "2026-01-15 15:51:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzr1rcz",
          "author": "SVAuspicious",
          "text": "Jira is a ticketing system. It's fine for operations like helpdesk. No matter what Atlassian says it is not a PM tool. \n\nKanban is not PM either. No baseline, no dependencies, no interface to accounting or HRIS. \n\nIf the only tool you have is a hammer everything looks like a nail. \n\nSoftware can't do your job for you. You have to know what you're doing.",
          "score": 3,
          "created_utc": "2026-01-15 16:19:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzr2sxk",
              "author": "Ezl",
              "text": "Was going to comment on the same.  Jira is for task management, not project management.",
              "score": 4,
              "created_utc": "2026-01-15 16:23:44",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzw49rz",
          "author": "RoughDragonfruit5147",
          "text": "You’re not bad at project management you’re overloaded.\n\nYou’re doing PM + dev + architect + support. That’s the real issue.\n\nMy PM tool is different, but it genuinely helps me, it keeps my work clear and organized.  \nThe tool isn’t the problem. Time and too many roles are.\n\nSo I keep my system simple, make one dev per project a lead, and focus on priorities and blockers.\n\nI need to code less and manage more, or get more PM support.",
          "score": 4,
          "created_utc": "2026-01-16 09:24:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzr53m7",
          "author": "ExtraHarmless",
          "text": "Do you want to be a Project Manager?\n\nIf not, ask to bring one in. \n\nIf you do, ask to bring in another dev with the understanding that you will only be available at 30-50% for dev work with the other 70-50% of the time as a PM. Get that in writing and then you should have more time to plan and manage.",
          "score": 6,
          "created_utc": "2026-01-15 16:34:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzt05om",
          "author": "Commercial_Carob_977",
          "text": "Cant be both a developer and PM/scrum master at the same time so pick one. Also need to assign some accountability to the squad members to get on with it. No need to read every update unless the comment is assigned to you (if you use a task tracker like Briefmatic these comments will land on your todo list as tasks). Daily standups should be enough to keep you across blockers & key updates. Try to maintain Jira by yourself & read every comment will just make you burn out.",
          "score": 2,
          "created_utc": "2026-01-15 21:38:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzvijmm",
          "author": "Fantastic-Nerve7068",
          "text": "short answer, you’re not bad at the job, you’re doing too many jobs at once.\n\nwhat you’re feeling is exactly what happens when a dev becomes a de facto PM without the org changing expectations. jira isn’t the problem. trying to keep perfect jira hygiene while also doing architecture, client meetings, and hands on dev work is.\n\na few practical things that usually help  \nyou don’t need to read every ticket update. set a rule for yourself that jira is for outcomes and blockers, not play by play. if a ticket moves without issues, great. only intervene when something is stuck or unclear.  \nstop over documenting tickets. enough context to start, acceptance criteria, and a clear owner. more than that just creates work for you to maintain.  \nlimit how many projects you actively plan at once. five or six sounds normal on paper but it’s brutal in reality, especially with shared devs. surface that as a risk, not a complaint.  \nhave one lightweight weekly sync per project just to realign scope and priorities. that saves way more time than constantly reacting in slack or ad hoc calls.\n\nasking for more resources won’t help until your role is clearer. what you actually need is protection of time. either less dev work or fewer projects. otherwise you’ll keep feeling underwater no matter the tool.\n\nalso, no, you’re not using jira wrong. you’re using it like someone who cares in a system that hasn’t decided what project management actually is yet. that part usually takes longer to fix than the tooling.",
          "score": 1,
          "created_utc": "2026-01-16 06:14:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzr2m6d",
          "author": "curiousquietly",
          "text": "Jira can help you manage dependencies, roadmaps, timelines along with ticketing. You need time to do that. It seems you have too much on your plate. Either you need to coach other devs in team to own their work on jira or you need a dedicated management resource.",
          "score": 1,
          "created_utc": "2026-01-15 16:22:54",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qgjygh",
      "title": "What do you think of Slack's new Slackbot AI to help keep track of project and context?",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1qgjygh/what_do_you_think_of_slacks_new_slackbot_ai_to/",
      "author": "blue_sky_time",
      "created_utc": "2026-01-18 20:50:57",
      "score": 4,
      "num_comments": 3,
      "upvote_ratio": 1.0,
      "text": "For those who haven't seen, Slack recently released a new feature - Slackbot a more intelligent context-aware AI that can find blockers based on recent conversations.\n\n[https://slack.com/features/slackbot](https://slack.com/features/slackbot)\n\nI am curious for slack heavy teams, does this sound useful?  Do you have any skepticism? Or is this the holy grail you've been looking for?\n\nPersonally - I think it looks pretty good (i haven't used it yet) but there's a lot of nuance and history involved with projects that I am not sure this system will get.  It will probably integrate with Jira, Google Drive etc. down the road, so maybe when it does all of that it will become even more powerful.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/projectmanagement/comments/1qgjygh/what_do_you_think_of_slacks_new_slackbot_ai_to/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o0cu8lk",
          "author": "Cheeseburger2137",
          "text": "I’m not taking my chances on a summary hallucinating, getting things wrong or missing the actually important thing.",
          "score": 5,
          "created_utc": "2026-01-18 20:53:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0cyciz",
              "author": "blue_sky_time",
              "text": "yea i agree that's very scary.. i don't think i'd ever trust something like this 100%.  If it helped to highlight or suggest things and be less \"definitive\" i could perhaps see it helping.  Slack is a sea of hot garbage, so something that can help surface things that maybe I missed is probably more useful",
              "score": 1,
              "created_utc": "2026-01-18 21:16:25",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0czj3s",
          "author": "painterknittersimmer",
          "text": "I'm looking forward to it if my company rolls it out. They are miserly and pretty slow to get on board with stuff. I'm guessing by the time I'm able to use it in 6 or 8 months it'll be pretty good. \n\n\nI'm not really looking to use it for stuff like surfacing blockers. I don't think it's going to be good enough for that. But finding where a conversation happened, or reminding me which threads I opened but never read, or asking who probably got left off a group DM - now that sounds amazing. That's exactly what's missing from Slack. It's goddamn impossible to find anything. ",
          "score": 2,
          "created_utc": "2026-01-18 21:23:07",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qayg3y",
      "title": "EVM use",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1qayg3y/evm_use/",
      "author": "99conrad",
      "created_utc": "2026-01-12 15:50:33",
      "score": 3,
      "num_comments": 15,
      "upvote_ratio": 0.81,
      "text": "How many people use a diagram for EVM (earned value management) like in PMI resources? I see job postings with this listed as a skill. I’ve tracked schedule and budgets, but haven’t needed to develop metrics like cost performance index or schedule performance index. Am I in the minority or PMs that use alternative reporting metrics? ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/projectmanagement/comments/1qayg3y/evm_use/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "nz6qijf",
          "author": "agile_pm",
          "text": "In over 20 years, I have never been required to use EVM.  To clarify, I do not work in defense, aerospace, government, large-scale construction/engineering, energy, utilities, or heavy manufacturing - industries where you are either required or more likely to need it.  My experience has been in software development, marketing/creative work, and business transformation.  EVM proffers predictability.  Speed, adaptability, and outcome flexibility are usually more important on my projects.  Even when predictability is highly important, the business leaders I work with don't speak EVM and aren't interested in the metrics.  I also don't recall ever seeing it on a PM job I've applied to, but I haven't looked in a while.",
          "score": 5,
          "created_utc": "2026-01-12 16:34:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz9euge",
          "author": "SVAuspicious",
          "text": "Yes. I find that with a very simple graph and legend, showing CPI and SPI gives you both current state and trends.\n\nThe first time I used EVM I had to run all the calculations myself. I don't remember if I used Lotus 1-2-3 or Quattro Pro. It's been a while. Today any decent PM tool will run the numbers for you and prepare the graphs. Even the inadequate ones will export the numbers to .xlsx. The calculations themselves are trivial. If you have a solid baseline CPI and SPI are much easier to report than tables of EV and PV. The reflection of trending alone is invaluable. \n\nIf you have a good baseline for cost, schedule, and performance then EVM is trivially easy. If EVM is hard you don't have a good baseline and should focus on fixing that.",
          "score": 3,
          "created_utc": "2026-01-13 00:10:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz7o183",
          "author": "bumada",
          "text": "I'm an EVM analyst primarily monitoring metrics produced by large government programs where it is contractually mandatory to report. As a PM, I don't see it being a standard tracking mechanism for internal projects.",
          "score": 2,
          "created_utc": "2026-01-12 19:06:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz8oli6",
          "author": "tky_phoenix",
          "text": "I use some of it with client facing projects. Most of our projects have allocated hours and I use it to calculate the „burn rate“ via the CPI. It basically shows if we’re using our hours in line with the plan or not. We then calculate EAC. Gives the client comfort to see where we will most likely land at the end of the project. \nThe CPI always needs explanation though.",
          "score": 2,
          "created_utc": "2026-01-12 21:56:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzc836d",
          "author": "adminillustrator",
          "text": "There is an administrative burden but on larger projects it can be invaluable to stakeholders, including PMs if they don’t have direct line of sight over all aspects of project progress.\n\nI am not a fan of ‘lite’ implementations however, despite them becoming more popular. Lite implementations tend to oversimplify and neither instil discipline or provide insight. It’s better to figure out if the overhead of doing it properly is worth it and then either do it, or do not.\n\nNon-project folk will often need educating in how to interpret and visualisations often help in explaining without using unnecessary jargon.",
          "score": 2,
          "created_utc": "2026-01-13 12:09:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzcszp5",
              "author": "Upstairs-Pitch624",
              "text": "I disagree, a lite application is very helpful for construction contractors - I've run tools like this on many projects ranging from 500k-5M. \n\nForeman/superintendents input their daily progress (meters of this installed, quantity of that installed) into a simple sheet and It provides a ton of insight on labour efficiency vs estimated, etc. Extremely useful to find weaknesses and continually improve estimating methods,  field work methods, etc.\n\nIt doesn't need to paint an entire complex picture of every aspect of a project. Even gaining insight into a few elements of the work can be very beneficial if the learnings are actually applied.",
              "score": 1,
              "created_utc": "2026-01-13 14:16:36",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzdc4rm",
                  "author": "adminillustrator",
                  "text": "That’s completely fair - I should probably have worded my point as being more like use lite approaches cautiously. I have seen too many applications of lite on the totality of very large projects, often characterised by overuse of level of effort measures, or confusing contingency handling. I’m fully supportive of proper quantities and measures as you refer!",
                  "score": 2,
                  "created_utc": "2026-01-13 15:51:14",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nze70ti",
          "author": "LeChevrotAuLaitCru",
          "text": "I see critical change orders affecting critical path every month. How do I even rebaseline and stick to any CPI SPI CBM anymore. Even presenting progress at steering committees became useless..",
          "score": 1,
          "created_utc": "2026-01-13 18:23:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzfydqs",
              "author": "99conrad",
              "text": "So that happens to me all the time! There’s a high-level timeline for projects I’m on and I don’t track budgets for many of them so I suppose the EVM is a very variable specific tool.",
              "score": 1,
              "created_utc": "2026-01-13 23:20:48",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nz6k2pg",
          "author": "pmpdaddyio",
          "text": "I don't use a diagram, but I absolutely use the tool as it is core project reporting. It is lost math in our industry and if you learn it, you could probably get a job in any serious project shop.\n\n>I’ve tracked schedule and budgets, but haven’t needed to develop metrics like cost performance index or schedule performance index. \n\nIf you've tracked it, how?\n\n>Am I in the minority or PMs that use alternative reporting metrics?\n\nYou are in the minority that currently use EVM, not sure how other people measure metrics, but if you report RAG authentically, you need EVM.",
          "score": 1,
          "created_utc": "2026-01-12 16:05:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz8hn7w",
          "author": "More_Law6245",
          "text": "This is a project performance indicator that has always gotten under my skin as a project practitioner, using earned value or revenue in projects is a finance function and not a project function, a project should only ever be concerned with forecast and actuals for financial performance, the rest is just noise for a PM. Over the years I have definitely gone toe to toe with the finance team or CFO's over the requirement of use! With that said it's not a common practice because it's an administration overhead.   \n\nI actually got into an argument once with a financial controller where I was passing the additional administration costs on to their cost centre, it got ugly very quickly but I basically said why is our client paying for your functional requirements ...... after the second tumble weed rolled through and watching the cogs tick over, I got a definitive response \"just do it because I told you\"! My next conversation was with the CEO. \n\nJust an armchair perspective",
          "score": 1,
          "created_utc": "2026-01-12 21:24:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzd07ih",
              "author": "highdiver_2000",
              "text": "I have never used EVM before.  It uses financial figures as a gauge of the progress of the project.  In software projects eg SAP, you can finish the hours and not yet go live.",
              "score": 1,
              "created_utc": "2026-01-13 14:53:45",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nz8m2lf",
              "author": "99conrad",
              "text": "Yeah. That’s good to know. I’m talking with a manufacturing/aerospace company and they have that as a skill. I’m familiar with EVM, but never once needed to use it.",
              "score": 1,
              "created_utc": "2026-01-12 21:44:35",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qayu6p",
      "title": "Is enterprise service management software actually worth it for cross-department collaboration?",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1qayu6p/is_enterprise_service_management_software/",
      "author": "mommylaurie",
      "created_utc": "2026-01-12 16:04:38",
      "score": 3,
      "num_comments": 19,
      "upvote_ratio": 0.8,
      "text": "We're a mid-sized company (800 employees) and our service processes are an absolute mess right now. IT uses one ticketing tool, HR has their own request form, facilities literally tracks everything in Excel, and legal lives in email threads.   \n  \nWhen something needs multiple departments, it becomes total chaos. Nothing's connected, there's literally zero visibility into who's doing what, and things fall through the cracks constantly.  \n  \nWe're considering moving to a unified enterprise service management platform where every department runs on the same system but with customized workflows, portals, and SLAs for their specific needs.  \n  \nMy main question is, for those who've made the switch to true enterprise service management (not just ITSM), was it actually worth the investment? Did cross-department collaboration actually improve or not?",
      "is_original_content": false,
      "link_flair_text": "General",
      "permalink": "https://reddit.com/r/projectmanagement/comments/1qayu6p/is_enterprise_service_management_software/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "nz6jzdd",
          "author": "AutoModerator",
          "text": "Attention everyone, just because this is a post about software or tools, does not mean that you can violate the sub's 'no self-promotion, no advertising, or no soliciting' rule.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/projectmanagement) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-12 16:04:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz6mgzd",
          "author": "Obvious_Excuse_3958",
          "text": "Honestly? It helped but wasn't magic. We still have process issues, just now they're visible to everyone. The platform forced us to fix broken workflows we'd been ignoring for years, which was painful but necessary.",
          "score": 4,
          "created_utc": "2026-01-12 16:16:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "nz6pcwq",
              "author": "mommylaurie",
              "text": "I see, thanks!",
              "score": 2,
              "created_utc": "2026-01-12 16:29:12",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nz74vwa",
          "author": "BinturongHoarder",
          "text": "As someone who makes software vaguely resembling your description and having been responsible for implementations of many different software solutions, let me tell you that the biggest problem won't be the software itself but to get people to abandon their own preexisting workflows. It's EXTREMELY hard and basically needs every manager to be 100% onboard. It doesn't matter if the new, central solution is clearly superior and beneficial.\n\nIt's common to find \"personal\" Excel tools that are artifacts from some 1990s previous employer, tools impossible to understand for anyone but the user that still use them.",
          "score": 3,
          "created_utc": "2026-01-12 17:40:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "nz8f6ng",
              "author": "mommylaurie",
              "text": "Duly noted!",
              "score": 1,
              "created_utc": "2026-01-12 21:12:51",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nz6nhay",
          "author": "Agitated_Account4135",
          "text": "We did a phased roll-out and the departments still on old systems create bottlenecks. The tricky is to commit fully or don't bother tbh",
          "score": 2,
          "created_utc": "2026-01-12 16:20:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "nz6pfsg",
              "author": "mommylaurie",
              "text": "We intend to commit fully",
              "score": 1,
              "created_utc": "2026-01-12 16:29:34",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nz6p66h",
          "author": "LongjumpingRub8128",
          "text": "Absolutely worth it if you pick the right platform. Your situation sounds exactly like what we dealt with early last year. The key is finding something that's actually flexible enough for different departments but unified enough to connect everything. We saw immediate improvements in visibility and accountability once everything was in one system. Cross-department requests went from black holes to trackable workflows. The ROI was clear within 6 months. Just make sure whatever you choose can handle the customization",
          "score": 2,
          "created_utc": "2026-01-12 16:28:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "nz6pnze",
              "author": "mommylaurie",
              "text": "This is insightful, and which platform did you move to if you dont mind?",
              "score": 0,
              "created_utc": "2026-01-12 16:30:36",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nz6pzcg",
                  "author": "LongjumpingRub8128",
                  "text": "We're using Monday Service",
                  "score": 0,
                  "created_utc": "2026-01-12 16:32:03",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nz6lsuc",
          "author": "FrameOver9095",
          "text": "Worked great for us, we went from 3-week turnarounds on cross-department requests to under 5 days. The visibility alone justifies the cost. Just budget way more time for training than vendors tell you.",
          "score": 1,
          "created_utc": "2026-01-12 16:13:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzbfstn",
          "author": "Agile_Syrup_4422",
          "text": "Short answer: it can be worth it but only if the problem is actually cross-department visibility, not just tooling.\n\nI’ve seen ESM help when work genuinely flows between teams and you need one shared place to see ownership, status and handoffs. It usually improves transparency and accountability. But it doesn’t magically fix collaboration, if teams keep working in silos, they’ll just recreate the same mess inside a bigger system.",
          "score": 1,
          "created_utc": "2026-01-13 07:51:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzbx9ku",
          "author": "SVAuspicious",
          "text": "In my opinion, information should be pushed and not pulled. One way or another service requests should result in explicit notices to providers and responses should result in explicit notices to those requesting service. Logging into yet another piece of software doesn't do that. \n\nFurther, focus really should be on the need of the service consumer, not on the service provider. \n\nWhile there are alternatives, in my opinion email is the best vector for communication. There is existing infrastructure including archiving and search. There is existing support. There are a ton of tools for aggregation and reporting. \n\nMost companies have an employee web portal. This is the place to access [contact forms](https://www.optimonk.com/website-contact-form-examples/) (no experience with that vendor - result from Google search on 'web contact form'). The big benefit of contact forms is that you can mandate fields, use drop downs to facilitate workflow routing, and integration with email is simple. \n\nOther notification mechanisms are possible, but text often means changing platforms and IM doesn't integrate with other tools as well. \n\nThis starts to look like in-house ESM which isn't my intent. Email is easy to integrate with existing systems on the service side. In your case, facilities can continue using Excel for backlog, scheduling, and resource management while HR uses their HRIS. IT can continue to use Jira or whatever ticketing system You reduce the amount of change people must endure, *especially* the people needing service. Remember that the service providers (facilities, IT, HR, Legal) are overhead functions and those making requests are revenue generators. Talk to the vendors of the systems in use in your company for use cases and sample integrations. You don't have a unique problem. Learn from those who have gone before you. \n\nNote that if an overhead function changes their tool of choice, nothing looks different to the service consumer. \n\nWhatever course you take evaluate based on 1. ease for the person making a request 2. minimum change 3. ROI 4. ongoing cost.",
          "score": 1,
          "created_utc": "2026-01-13 10:38:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzvpdpo",
          "author": "Low-Illustrator-7844",
          "text": "the only tools i use -\nAsana for client project issues items management\nMS Office for obvious reasons\nSmartsheet for project planning\n\nJira and zendesk are used by my tech team. I dont touch it unless i need to put pressure on dev teams and comment on tickets. \nAll other PM tools are just noise to me.",
          "score": 1,
          "created_utc": "2026-01-16 07:10:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzboy9t",
          "author": "Local-Ad6658",
          "text": "Another spam bot advertising for Monday",
          "score": 1,
          "created_utc": "2026-01-13 09:19:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz9zitn",
          "author": "Medical-Cry-5022",
          "text": "The chaos you described (Facilities in Excel, Legal in email) is the classic tipping point for ESM. But reading through the comments, u/BinturongHoarder nailed it: the biggest risk to your ROI isn't the software cost—it's adoption.\n\n​You can buy a 'perfect' unified platform, but if your Legal team finds it clunky, they will just go back to email, and your ROI creates a crater.\n\n​For a company of 800, the highest ROI usually comes from meeting employees where they already work (e.g., Microsoft Teams) rather than forcing them to a new portal. If your staff can just 'chat' to submit a request to HR or IT without learning a new interface, adoption becomes immediate, and you actually get the visibility you're looking for.\n\n​We actually published a deep dive on how to calculate the ROI of GenAI-based Service Management versus traditional portals. It might help you build your business case for the leadership team:\n\nLink to resource:\n https://www.rezolve.ai/blog/genais-roi-for-employee-service-desk\n\n​",
          "score": 0,
          "created_utc": "2026-01-13 02:02:31",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qfu2fv",
      "title": "EV curves with ms project",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1qfu2fv/ev_curves_with_ms_project/",
      "author": "Wise-Painting5841",
      "created_utc": "2026-01-18 00:45:03",
      "score": 3,
      "num_comments": 7,
      "upvote_ratio": 1.0,
      "text": "Can anybody suggest an easy way to create an EV A curve (ideally vs invoicing S curve) in ms project?\n\ncurrently I have an excel on the side and I transfer the dates from ms project to the excel in order to update the curves on monthly basis, but there should be an easier and less manual way to do this, right?",
      "is_original_content": false,
      "link_flair_text": "Software",
      "permalink": "https://reddit.com/r/projectmanagement/comments/1qfu2fv/ev_curves_with_ms_project/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o07sjig",
          "author": "Eylas",
          "text": "You can use the built in report function in MS projects, it exports out an earned value report, but it requires you to have the financial data in the project itself.",
          "score": 2,
          "created_utc": "2026-01-18 01:53:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0ajaa7",
              "author": "SVAuspicious",
              "text": "Why would you not have financial data in MS Project? Project supports APIs to most accounting systems so you don't have any duplicate data entry.",
              "score": 1,
              "created_utc": "2026-01-18 14:10:40",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0b3jy9",
                  "author": "Eylas",
                  "text": "Most folks that I work with aren't going to be able to interact with an API nor are they including their financial data in MS Projects without heavy manual work. \n\nThe user here, for example, is extracting data from MS projects into Excel, so the assumption is that their financials aren't baked in either.\n\nIt's easier for a user to start with just getting the financial data into MS projects, either manually or import, than overwhelmed with an API suggestion immediately which they won't do and probably won't solve their problem right now.",
                  "score": 0,
                  "created_utc": "2026-01-18 15:55:51",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o07fd88",
          "author": "AutoModerator",
          "text": "Hey there /u/Wise-Painting5841, have you checked out r/MSProject, r/projectonline, or r/microsoftproject for any questions regarding application?  These may be better suited subreddits to your question.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/projectmanagement) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-18 00:45:03",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}