{
  "metadata": {
    "last_updated": "2026-02-18 03:09:58",
    "time_filter": "week",
    "subreddit": "projectmanagement",
    "total_items": 20,
    "total_comments": 207,
    "file_size_bytes": 259043
  },
  "items": [
    {
      "id": "1r3x043",
      "title": "tried to document all our processes and realized half of them only exist in people's heads",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1r3x043/tried_to_document_all_our_processes_and_realized/",
      "author": "SideQuestDentist",
      "created_utc": "2026-02-13 18:28:35",
      "score": 171,
      "num_comments": 53,
      "upvote_ratio": 0.98,
      "text": "Started a documentation project thinking it would take a few weeks and here I am three months later understanding why companies hire consultants for this. Every time I ask someone how they do something the answer is \"it depends\" followed by fifteen edge cases, stuff that's supposedly standardized has three different versions depending on who you ask, and critical knowledge lives entirely in the heads of people who could leave tomorrow.\n\nThe scary part is we function fine day to day but if certain people left we'd be scrambling to figure out how basic things even work. Anyone else realized how fragile their operations actually are when you look closely at them?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/projectmanagement/comments/1r3x043/tried_to_document_all_our_processes_and_realized/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o57hdms",
          "author": "OppositeJury2310",
          "text": "Forcing standardization through tools for routine stuff first helped us, like phone intake through sonant means the process is whatever sonant does and scheduling through calendly means availability is whatever the calendar rules allow. There's less to document because the system is the documentation, if that makes sense. Same thing with our intake forms in typeform, the form itself defines what information we collect so there's no \"it depends on who answers\" variation anymore. Harder with judgment based tasks obviously but for the routine repetitive stuff, picking a tool and letting it enforce the process eliminated a ton of tribal knowledge that was impossible to write down anyway.\n\n  \n",
          "score": 35,
          "created_utc": "2026-02-13 18:30:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o57iz7y",
              "author": "Goggio",
              "text": "This is the way. \n\nFocus on \"where is the rework happening and how can we stop it\" ; you'll end up with 90% of your problems solved and people will be happy because almost all of the solves will end up documented with clear steps... fuzzy sops are absolutely fine in small teams of experts and when a true sop is needed you already have buy in and a baseline starting point.",
              "score": 2,
              "created_utc": "2026-02-13 18:37:45",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o595rmp",
          "author": "brye86",
          "text": "The real problem with processes is once they’re documented. Who follows them? People will only read and follow so much. You can have a document on how to make tea and coffee but no one is reading it.  Too much documentation becomes useless.  Too little documentation you become lost.",
          "score": 29,
          "created_utc": "2026-02-13 23:37:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5ba476",
              "author": "Turkishblokeinstraya",
              "text": "Striking a balance is key! Overdocumentation is a massive waste just like underdocumentation.\n\nI usually ask teams what legacy they'd appreciate if they were starting tomorrow. That's the stuff that is worth documenting.",
              "score": 4,
              "created_utc": "2026-02-14 09:03:14",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o5g1gky",
              "author": "nneighbour",
              "text": "I work with a team that has hundreds of pages of documentation. The process of how to create and update the project sheets is 30+ pages. It’s utterly useless because there is no way someone is reading 30 pages for a relatively quick task and it’s for impossible for them to keep up to date.",
              "score": 3,
              "created_utc": "2026-02-15 02:41:04",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o592yz8",
          "author": "shampton1964",
          "text": "As one of those consultants, while it is Very Important to find out how people are doing the job, it is ALSO Important to figure out how they could best be done to eliminate edge conditions, ensure routine function, and so forth. \n\nThat's why us old heads say there is an art to this!",
          "score": 15,
          "created_utc": "2026-02-13 23:20:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o57n1p3",
          "author": "sdarkpaladin",
          "text": "Sir.\n\nMy company is so lean, my projects usually have a bus factor of  one.\n\nAnd it ain't me.",
          "score": 14,
          "created_utc": "2026-02-13 18:57:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o57ppz4",
              "author": "ExtraHarmless",
              "text": "I love the name \"bus factor\"",
              "score": 5,
              "created_utc": "2026-02-13 19:09:55",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o588rbh",
                  "author": "tofer85",
                  "text": "Could be the lottery factor if you are a glass half full kind of person…",
                  "score": 2,
                  "created_utc": "2026-02-13 20:44:38",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o581hga",
          "author": "PplPrcssPrgrss_Pod",
          "text": "That's not good. Need to get that knowledge onto a workflow diagram or other document. Also good to build into your systems.\n\nWhat I've found helpful is that we capture the processes aligned to positions or skillsets, not individual people. People leave and mostly positions stay in place.\n\nGodspeed.",
          "score": 13,
          "created_utc": "2026-02-13 20:08:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o57jfjq",
          "author": "tubaleiter",
          "text": "Absolutely - we’re on an automation kick, and then you realise the “standard” is an exception, and myriad exceptions are the rule. How the fuck do you automate that clusterfuck?",
          "score": 12,
          "created_utc": "2026-02-13 18:39:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o57movb",
              "author": "joseph_sith",
              "text": "In my experience the team owning the process has to be willing to re-evaluate it from the ground up, and try to shift away from accommodating edge cases. Sometimes edge cases are valid, but I find that many in my organization exist due to technology limitations, or because “that’s just how we do it” and no one has re-validated the process in over a decade. I’m a big believer that transitioning any manual process to automation should include uplift to the process itself (but maybe my org is unique in the insanity of our manual processes lol)",
              "score": 3,
              "created_utc": "2026-02-13 18:55:19",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o57o46n",
                  "author": "tubaleiter",
                  "text": "Totally makes sense - we’re still stuck in the fun of fighting over who owns each process, too.",
                  "score": 3,
                  "created_utc": "2026-02-13 19:02:04",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o57m2qm",
              "author": "Defy_Gravity_147",
              "text": "By keeping every variable coherent to its scope.",
              "score": 0,
              "created_utc": "2026-02-13 18:52:26",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o581836",
          "author": "SVAuspicious",
          "text": "Some people are afraid that documenting what they do puts their jobs at risk. I put requests for documentation in terms of \"what if you get hit by a bus?\" \n\nThe problem is not time critical. The product is not supposed to win a Pulitzer prize. Often bullet lists are fine. \n\nI've been through this several times. I haven't needed consultants. A long timeline is fine. ",
          "score": 12,
          "created_utc": "2026-02-13 20:06:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o582k7x",
              "author": "kawasaki03",
              "text": "I frame it like, \"What if you win the lottery and leave?!\" Makes them a bit more enthusiastic to document, for whatever reason!",
              "score": 5,
              "created_utc": "2026-02-13 20:13:26",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o58kel5",
                  "author": "RhesusFactor",
                  "text": "Ah the old lotto bus",
                  "score": 5,
                  "created_utc": "2026-02-13 21:42:16",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o591cp6",
              "author": "Desert_Fairy",
              "text": "I like to frame it as “what if you get offered your dream job in Hawaii?  How long do you want to take to do a handover before moving on?”\n\nThat way it is less guilt for leaving problems behind and more “it will be a hassle for you and be a barrier between you and your happiness.”",
              "score": 3,
              "created_utc": "2026-02-13 23:11:28",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o57zxk6",
          "author": "painterknittersimmer",
          "text": "So half of them are actually documented!? Damn, I'd kill for that. ",
          "score": 10,
          "created_utc": "2026-02-13 20:00:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o58kwzo",
              "author": "RhesusFactor",
              "text": "Yeah. I was at a place that wanted to get some process. But they did Agile and believed in people over process, products over documents. So when their key people left they had none of the above. And I was asked to reinvent the processes without knowing what they did.",
              "score": 3,
              "created_utc": "2026-02-13 21:44:45",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o58p0fu",
                  "author": "painterknittersimmer",
                  "text": "Ah, gotta love Agile",
                  "score": 2,
                  "created_utc": "2026-02-13 22:04:53",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o57nkrk",
          "author": "timevil-",
          "text": "Tribal Knowledge = Deadly",
          "score": 10,
          "created_utc": "2026-02-13 18:59:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o57o28x",
          "author": "Equivalent_Memory3",
          "text": "I'm three years into attempting to document and revise our processes. When I started, the SOPs referenced processes and forms that didn't exist.\n\nSometimes ya just gotta start with a very simple processes just to get it on the books for people to review.",
          "score": 9,
          "created_utc": "2026-02-13 19:01:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o57htjq",
          "author": "Sea_Weather5428",
          "text": "The \"it depends\" thing is where the actual complexity lives and it's genuinely hard to write down in a way that covers all the scenarios.\n\n  \n",
          "score": 9,
          "created_utc": "2026-02-13 18:32:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o58pesl",
          "author": "todfish",
          "text": "Yeah but in reality how thoroughly can documented and enforced processes actually inform the real life day to day work? \n\nI feel like I come up against this issue all the time: \n\nA lack of documented processes is identified and this scares everyone (mostly management) > There’s an effort to establish set processes > Experienced pm’s resist that effort because it doesn’t perfectly fit what they know to be effective (for them) > The processes put in place are incomplete and not really fit for purpose > Experienced pm’s continue to ignore them and do their own thing > Inexperienced pm’s try to follow the processes / framework but frequently miss the point and get tripped up by all the gaps (win the battles but lose the war). \n\nUnless you’re in an industry / organisation that only uses their pm framework to deliver a narrow range of project types, I just don’t think you can feasibly process your way out of the need to have high performing pm’s who are given the freedom to **do what needs to be done, in order to deliver the desired outcome.**\n\nAt the end of the day, project management can be extremely complex and varied. The best pm’s I’ve worked with take the time and make the effort to understand the mission, then build the project accordingly. That means the project is structured in a way that fits their style of project management. No one is ever going to be more across the needs of a project than the pm, so if they’re forced into a process that doesn’t suit their style or the needs of the project then things will fall apart fast.\n\nTLDR: Establishing processes can provide useful guidelines, but they can also stymie the work of good pm’s and create a false sense of security for bad pm’s and management. There are often good reasons why certain processes are not set in stone and why some pm’s and some projects do things differently.",
          "score": 8,
          "created_utc": "2026-02-13 22:06:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o57vdqm",
          "author": "eredinso",
          "text": "I worked as a Knowledge Manager for years and then consulted in the space (my heart goes out to you for taking this on hahaha), and every company without a KM or at least a long-time consultant has this problem. All of them.\n\nSo many aspects of business operate with ambiguity and nuance and those are the things that kill effective documentation.\n\nBecause of that, effective documentation **cannot** happen in a silo by someone who only has the ability to document. If processes need to be documented, some processes will inevitably need to be *changed* in order to be documented. Not every process can be a massive decision tree, so not every edge case can be catered to. Process optimization should happen first, documentation after.",
          "score": 7,
          "created_utc": "2026-02-13 19:37:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o58e4ts",
          "author": "More_Law6245",
          "text": "I remember doing a consultancy gig, I was auditing and assessing PMO organisational performance and when I first turned up the team handed over all of their organisational policy process and procedures for review and assessment. It was like seeing my client  like a 5 year old on their first day of school and when I had finished my initial audit it was like seeing a high school teenager with a month of detentions. \n\nWhat the organisation thought they knew and what they actually did where actually completely two different things, what they had done was document a version of reality that reflected nothing like what they actually did.  It was the biggest organisational disconnect I'd actually seen in the corporate space and what made it worse was it was a federal public service organisation.  So OP, you're not alone but I would suggest be careful not to follow the rabbit down the hole, keep every thing high level and let the respective teams drill down on their own and you just set a framework for them to work towards. ",
          "score": 7,
          "created_utc": "2026-02-13 21:11:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o58jyha",
          "author": "Rosyface_",
          "text": "Yeah my org is running into this over the past year or so. Multiple single points of failure and all those people are retiring. Massive problems incoming, I predict. Especially when one of the data engineers is the only person holding together an entire legacy system the entire place relies on for literally everything. That system goes down and we’re fucked. He’s retiring in May.",
          "score": 8,
          "created_utc": "2026-02-13 21:40:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5humtu",
              "author": "Salkha786",
              "text": "Just curious, do you job hunt in a situation like this?",
              "score": 1,
              "created_utc": "2026-02-15 12:07:21",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5huxr3",
                  "author": "Rosyface_",
                  "text": "I’m not planning to, I like my job and have no reason to job hunt. These things are not my problem to solve. I show up, progress my projects, log these things as risks, but I can’t fix staffing and documentation issues in other departments. If it affected me to the extent that I hated going to work or similar, then I’d look for something new.",
                  "score": 2,
                  "created_utc": "2026-02-15 12:09:55",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o59uzpm",
          "author": "Ok-Pair8384",
          "text": "These AI posts are getting subtler, but still ends the prompt with an open ended question.",
          "score": 27,
          "created_utc": "2026-02-14 02:13:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o58vxu1",
          "author": "PickleNick1987",
          "text": "Stop focusing on how things get done. A process should define what happens. More specifically, what is supposed to happen, what roles interact with it, what triggers it to start, what triggers it to end (likely the action is a handoff) and what are metrics in place to evaluate to measure/validate success. If someone new steps into the role or you switch systems, it does not change what the process is. \n\nHow it gets done only matters if some internal or external factor requires it, and in most cases, regulatory or compliance requirements.\n\nWent thru the same thing recently and that mindset shift has really helped simplify things for me and others",
          "score": 16,
          "created_utc": "2026-02-13 22:41:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o58yt25",
              "author": "dapper_pom",
              "text": "...if someone does twice the amount of work that is needed to do the thing, you don't think it is something that should be adressed? I think it absolutely matters how things get done.",
              "score": 10,
              "created_utc": "2026-02-13 22:56:58",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o59v5hn",
                  "author": "PickleNick1987",
                  "text": "That’s why you have measurable expectations (metrics) in place to evaluate if someone’s way of doing things is working",
                  "score": 1,
                  "created_utc": "2026-02-14 02:14:14",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o57moc9",
          "author": "Brodrick_Rolfson",
          "text": "Any good process has room for flex but not ambiguity. I complety feel this and its frustrates me to no end.",
          "score": 4,
          "created_utc": "2026-02-13 18:55:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o57xclt",
          "author": "Childish_Tycoon_Ship",
          "text": "I like to call that, \"Job security\"",
          "score": 5,
          "created_utc": "2026-02-13 19:47:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o58plne",
          "author": "jd2004user",
          "text": "It’s not PC to say but tribal knowledge is unfortunately something a great many orgs rely on. So much is lost when key individuals leave though the orgs have only themselves to blame.",
          "score": 4,
          "created_utc": "2026-02-13 22:07:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5bgieu",
              "author": "claracolt",
              "text": "implicit knowledge is the phrase you want, as in understood widely but not documented explicitly.",
              "score": 4,
              "created_utc": "2026-02-14 10:06:33",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o5cc8jo",
              "author": "SeaManaenamah",
              "text": "Are you saying the word \"tribal\" is not politically correct?",
              "score": 1,
              "created_utc": "2026-02-14 14:17:49",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5ciaw2",
                  "author": "jd2004user",
                  "text": "“\"Tribal knowledge\"—referring to undocumented,,,, institutional knowledge shared by word-of-mouth—is considered by some to be offensive, as it can be seen as disrespectful to Indigenous peoples and their cultural practices. \n\nWhile often used in business to describe team camaraderie, or knowledge silos, many organizations are replacing it with more inclusive terms like \"shared knowledge\" or \"institutional knowledge\". \n\nKey considerations regarding the phrase:\nCultural Sensitivity: Using \"tribe\" in a business context can be offensive to Indigenous peoples.\nAlternative Terminology: \n\nTo promote inclusivity, consider using alternatives such as:\nInstitutional knowledge\nAssumed knowledge\nUnwritten knowledge\nTeam knowledge\n\nBusiness Context: In manufacturing and IT sectors, the term describes informal, undocumented information that poses risks of inefficiency, such as relying on a single employee's, experience or , potential knowledge gaps.\n\nAlternative View: Some, debate exists on whether it is inherently offensive, as it does not explicitly target a specific, demographic group.”",
                  "score": 5,
                  "created_utc": "2026-02-14 14:52:58",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o57yvk4",
          "author": "therealvitocornelius",
          "text": "see this is the fun part though, processes aren’t defined by analysts, they’re defined by the people doing the work. I’m not saying that’s necessarily the right way to do the work, but edge cases are still use case cases and still need to be documented. You’re just getting into the meet of the problem. The more you simplify these processes down, the more on the same page the people doing the work will be. As somebody else mentioned this is job security for you",
          "score": 3,
          "created_utc": "2026-02-13 19:55:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o58lp3j",
          "author": "RhesusFactor",
          "text": "Yeah. Some places are just an oral tradition and do nothing repeatable. I had to stop my director once and risk my job to say 'you don't need a pmo, you need a business plan'",
          "score": 4,
          "created_utc": "2026-02-13 21:48:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5g72p5",
          "author": "Adventurous-Dog-6158",
          "text": "I worked at an org where they managed by exception because they usually caved in to customer demands so just about every product X sold was customized for each customer. Every time they brought on a new customer, it was a scramble to customize the product. The product was not designed to have that much customization. And of course documentation was usually the last thing on anyone's to do list. \n\nMost people think that the terms complex and complicated are synonymous, but they are not. It's not complex to reverse engineer a process, but it can be complicated and take a lot of time. Basically anything that any human has done, some other human or group of humans can reverse engineer it. So if the shitz hit the fan, the org can call in high priced consultants to figure things out.",
          "score": 4,
          "created_utc": "2026-02-15 03:20:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o591lb4",
          "author": "Naive-Apartment-521",
          "text": "You've discovered what most orgs don't want to admit: they're running on institutional memory, not systems. It depends is the sound of undocumented decision trees, and three different versions means process drift with no governance. You're not behind schedule, you're doing archaeology.\n\n**What's actually happening**: Your processes evolved organically (which works) but never got codified (which doesn't scale). People built workarounds, edge cases became standard practice, and no one had authority or time to reconcile the versions. Now you're trying to document a living system that's still mutating.\n\n**Framework to tame this (without hiring consultants):**\n\nStop trying to document everything at once\n\nPrioritize by risk: What breaks if \\[key person\\] leaves tomorrow? Start there. Document the top 5 critical processes first, then expand.\n\nUse the **decision tree** method for **it depends** answers\n\nWhen someone says **it depends**, ask: What are you checking to decide?\n\nMap it as: IF \\[condition\\], THEN \\[action\\]. ELSE \\[alternative action\\].\n\nExample:\n\nIF client is under contract, THEN route to Account Manager\n\nELSE IF inbound lead, THEN route to Sales\n\nELSE route to Support\n\nCreate a **source of truth owner** for each process\n\nAssign one person as the authority for each process. When versions conflict, that person decides. Update the doc, notify the team, archive old versions.\n\n**Build a process changelog**\n\nEvery time a process changes, log: What changed | Why | Who approved | Date\n\nThis prevents I thought we still did it the old way confusion.\n\n**Run a knowledge transfer audit**\n\nList your top 10 critical processes. For each, ask: If \\[owner\\] left, who could do this? If the answer is no one, that's your red flag list.  If you'd like some additional ideas, I'm happy to share.",
          "score": 3,
          "created_utc": "2026-02-13 23:12:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o580b35",
          "author": "Low_Friendship463",
          "text": "Yup that's fairly typical...I've been at my company for a year and any time I think of something I ask \"do we...\" Or \"where is...\" And usually get a response of yeah we need to get that more aligned...and we do as a PM team do work on it but they were a small team, building up as the business has grown so we're in the beginning stages.. I've already suggested that we start building towards a PMO level repository of documents just in case we need something heavier than an email confirmation from a sponsor.",
          "score": 2,
          "created_utc": "2026-02-13 20:02:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o58irbm",
          "author": "040422",
          "text": "My fave is when they say how standardized the org is, rigor, processes and the actuality is no one is doing the same thing…the standard doesn’t exist except in the mind of the PMO manager. Heaven help you when you ask about this….ask me how I know",
          "score": 2,
          "created_utc": "2026-02-13 21:34:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o57h32h",
          "author": "AutoModerator",
          "text": "Hey there /u/SideQuestDentist, have you checked out the [wiki page](https://www.reddit.com/r/projectmanagement/wiki/index) on located on r/ProjectManagement?  We have a few cert related resources, including a list of certs, common requirements, value of certs, etc.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/projectmanagement) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-13 18:28:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o57ygo1",
          "author": "pmpdaddyio",
          "text": "Then create and document your own process.",
          "score": 1,
          "created_utc": "2026-02-13 19:53:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5nfsxc",
          "author": "[deleted]",
          "text": "[removed]",
          "score": -5,
          "created_utc": "2026-02-16 08:19:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5r6a6h",
              "author": "projectmanagement-ModTeam",
              "text": "Thanks for your post/comment.  \n\nWe removed this post because it's in direct violation of our \"solicitation / self-promotion” rule.  \n\nPlease review these rules, which can be found in the sidebar.\n\nThanks,\nMod Team",
              "score": 1,
              "created_utc": "2026-02-16 21:21:53",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r74np4",
      "title": "There's a word for what toxic PM orgs kill first",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1r74np4/theres_a_word_for_what_toxic_pm_orgs_kill_first/",
      "author": "Gronax_au",
      "created_utc": "2026-02-17 12:26:48",
      "score": 82,
      "num_comments": 14,
      "upvote_ratio": 0.96,
      "text": "There's a word for the opposite of schadenfreude: confelicity. Joy in someone else's success.\n\nMost people have never heard it. I hadn't until recently. Which says something about what we've normalised.\n\nI spent 20 plus years in enterprise programme delivery. Somewhere along the way I noticed I'd stopped being happy for colleagues. A peer would land a great assignment and my first thought was \"why not me?\" Someone would share a win and I'd feel nothing. Or worse — a flicker of resentment.\n\nNot because I'm a bad person. Because the environment had trained it out of me. Years of zero-sum recognition, political promotion, and cultures where success is invisible but failure follows you for years.\n\nThe dangerous part is how slowly it happens. You don't notice the erosion. You just wake up one day and realise you can't remember the last time you felt genuinely happy about someone else's success.\n\nAnyone else noticed this in themselves?\n",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/projectmanagement/comments/1r74np4/theres_a_word_for_what_toxic_pm_orgs_kill_first/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o5usw2c",
          "author": "Fantastic-Nerve7068",
          "text": "i felt this. it’s wild how fast you go from cheering people on to just… shutting off. not cuz you’re bitter, but cuz the system teaches you that their win probably came at your cost. the zero sum vibes, the quiet promotions, the praise that never reaches your desk. eventually you stop clapping for others just to protect yourself. it’s not who we are, it’s what the job turns us into.",
          "score": 16,
          "created_utc": "2026-02-17 12:31:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5utc1c",
              "author": "Gronax_au",
              "text": "Yeah exactly — it's not bitterness, it's learned behaviour. The zero-sum framing is the bit that gets you. Once you internalise \"their win = my loss\" it's really hard to unlearn, even after you leave that environment.",
              "score": 5,
              "created_utc": "2026-02-17 12:34:42",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5uw4d2",
          "author": "_eMBe_",
          "text": "It is frustrating when significant recognition is given to someone who you personally know is doing poor work, especially when they only receive credit because their tasks are visible to higher executives.\n\nWhat always irritates me is that senior leadership tends to say \"good job to the team\" or \"good job to Adam's team\" for an achievement, even if a specific individual did all the work. Apparently, once you reach a certain level, you no longer feel the need to personally mention people with whom you are not familiar.\n\nBut yeah, it is what it is :) ",
          "score": 13,
          "created_utc": "2026-02-17 12:53:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5uxv4l",
              "author": "Gronax_au",
              "text": "The visibility thing is huge. I've seen people do genuinely transformative work that nobody above them ever knew about, while someone else gets recognised for a well-timed slide deck. And the \"good job to Adam's team\" pattern teaches you that credit flows up, not to where the work happened. The good news is once you see the pattern for what it is, it loses some of its power over you. It's the system that's broken, not you.",
              "score": 8,
              "created_utc": "2026-02-17 13:04:07",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5vgu0g",
          "author": "vhalember",
          "text": "I'd say the worst part is after the system has jacked you around enough?\n\nYou start playing the system in your favor.  You begin to realize you aren't evaluated on the work you perform/lead, you're evaluated on the work you are -perceived- to perform/lead.\n\nThis isn't maleficence, it's a learned behavior.  You see others getting rewarded for doing little of true value, you notice, and then slowly you adapt toward that behavior yourself.\n\nI'm not going to be rewarded for getting hard project xyz done well, but if I do it average... but market the shit out of it.  I'm now a miracle worker.\n\nFrustrating.",
          "score": 13,
          "created_utc": "2026-02-17 14:49:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5vqnfn",
              "author": "Cuddlejam",
              "text": "The more somebody yaps, the less I trust their status. Sadly, yapping is what gets rewarded.",
              "score": 8,
              "created_utc": "2026-02-17 15:38:19",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5wnq39",
                  "author": "CrackSammiches",
                  "text": "The further I get up the food chain, the less I see yapping rewarded.  There's a certain brand of corporate speak and branding that you need to have mastered to truly climb the ladder, sure. \n\nBut most execs go from meeting to meeting to meeting all day and they just want you to get to the point. Drop the platitudes, the quotes from famous people, the slides that don't tell anything.  Just tell me what you want/need and I'll give you your answer.",
                  "score": 3,
                  "created_utc": "2026-02-17 18:19:29",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o5y50vd",
                  "author": "tarrasque",
                  "text": "I’m a fan of the whole brevity thing, both because I have things to do and because early in my career I wrote emails that were too long and never got read. \n\nIn my last position I was punished heavily for it. Absolutely ridiculous.",
                  "score": 1,
                  "created_utc": "2026-02-17 22:30:59",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o5xv0it",
              "author": "Gronax_au",
              "text": "That's the part that really gets you. You don't decide to start playing the game, you just slowly notice that you already are. And then you have to decide whether you're ok with that or not. For me it took leaving entirely before I realised how much energy I'd been spending on perception management instead of actual work.",
              "score": 2,
              "created_utc": "2026-02-17 21:42:28",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5vbh4u",
          "author": "Upstairs-Pitch624",
          "text": "We have a group chat for management where \"wins\" are celebrated, but it's more like an individual effort football spike for one person at a time. I tried to reflect on why I've started to resent this; I think it's because it totally negates the team effort involved in getting that win, and the team effort involved in managing that win going forward.",
          "score": 7,
          "created_utc": "2026-02-17 14:21:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5wxwiq",
          "author": "LessonStudio",
          "text": "I did consulting work for a company where your pay was almost entirely connected to performance. \n\nEach concluded task resulted in getting points. Then the points determined your portion of a huge bonus pool. \n\nThere was a leaderboard of where everyone stood. This was hands down the most happy and productive place I've ever experienced. The only people who didn't flourish were those who came, sucked, and then left. That churn was high for new employees, but within a month or less most people knew if this was for them or not.\n\nThis could have resulted in a cutthroat Machivellian nightmare as people clawed and stabbed their way to the top of that leaderboard. But this wonderful term \"Confelicity\" definitely ruled. Once you showed that you were going to be a contributor, people wanted you to succeed. One simple reason was that everyone was given a clear view of the \"big picture\", meaning they saw the bonus pool size as coming from company success. So, if billy bob cooked up a killer feature and sales went up 5% because of that; people didn't care that billy bob got a huge bonus, as everyone else got a slightly bigger bonus as well. Fighting with billy bob would end up hurting everyone in the long run. Like the other baseball players begrudging the homerun king for \"taking too many home runs, he should share them. I hate my growing collection of world series rings.\"\n\nYou would now support billy bob in all his future endeavors, hoping he would hit another home run.\n\nI've explained, (as have the people who work there) how the system was completely amazing; and a huge number of people think they can point out endless flaws. But, the reality is that pointing out that it is impossible for bumblebees to fly. I won't argue aerodynamics, I will just point to the bees.\n\nThe only people for whom this place sucked were crappy programmers who, in most companies would rapidly become managers because they sucked so hard at programming. And just to shoot a common misconception. Junior programmers did find a home here as people would see their potential and mentor them. Also, the churn was so high, that they didn't select from \"top schools\" or any other BS. The programming interview was short, harsh, and was open to almost all takers. By harsh, I don't mean pedantic. But, had questions like, \"If you wanted to start a project with the most technical debt possible, what measures would you take?\" \"How does techncial debt present itself at the end of a project.\" \"What makes a good code review?\" and then they would often roast a person on their answer to this by asking, \"How does that add value and what would happen if you removed that from a code review?\" to nearly ever part of their answer.\n\nMy favourite on this one was when people almost always answered, \"Style guide, the code must follow a style guide or it is unreadable.\" \n\nThen, they would move on to the \"Find the bug\" portion of the interview where they would hand them a bunch of code with wildly varying styles. The bugs were generally easy to find, and not finding them would be a death cookie for the candidate. Then, they would ask, \"Did you have any trouble finding those bugs?\" The answer was usually no. And then they would ask, \"would you like to revisit your answer about style guides required to make code readable?\"\n\nWhile, the company did have a vague style guide, if the person rigidly held to the style guide as an important part of a code review, they were done as a candidate; as this clearly indicated the person had no idea how to work with others in a fluid give and take environment and required rigid rules to make communications possible. They clearly thought other people should have to follow those rules to communicate with them.\n\nThis last is the exact sort of person who would persist in arguing that bees can't fly. Also the sort of person who is technically capable of doing a thing, but will invariably do the wrong thing and make those around them miserable while doing it. No cofelicity to be found from that sort of person.\n\n\nVery little of the interview would confuse a junior programmer with any common sense.\n\nTo the somewhat subreddit topic. This company didn't have managers or PMs. There were the founders who provided a vision, and leadership; also through the points system, the incentive to work on what they wanted done. Then, under that it was a mob of over 200 people who followed that leadership. Within that mob some people worked reasonably independently, others were natural leaders and organized people who followed their lead as a team. This was all very fluid, but tended to form into little treehouses which were individually productive in their own way.\n\n\nI've seen the opposite. Not so much schadenfreude within the company, but it was such a cesspool of micromanagement, that when they have another round of layoffs, everyone who long ago left will ask, \"Did they finally fire James?\" or some other micromanager they hated. In this company there was no room for cofelicity as the managers stole all the successes, and nobody would congratulate them on their stolen valor.",
          "score": 6,
          "created_utc": "2026-02-17 19:06:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5xv5g4",
              "author": "Gronax_au",
              "text": "This is a great counterexample. The key difference is the incentive structure made success non-zero-sum. Billy bob's home run grew the pool for everyone, so celebrating him was rational, not just generous. That's the bit most orgs get wrong, they want the culture of confelicity but build incentive structures that punish it. Your example proves it's not about hiring nicer people, it's about designing systems where other people's success actually helps you.",
              "score": 2,
              "created_utc": "2026-02-17 21:43:05",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5yvmqu",
                  "author": "LessonStudio",
                  "text": "I watched a video once where some CEO was joking about how his people would wake up and ask, \"How can I create shareholder value today?\"\n\nHe was joking, but also serious about how it was wildly flawed that those who would benefit were just frustrating those below by holding them to account in the same way.\n\nI worked for a company where bonuses were pretty much even across the company. They were almost the equivalent of a year's salary. \n\nThen, one year everyone got something like 5k. Yet, the company profits were just as good as usual.\n\nIt turned out the managers had convinced the new head that they should allot bonus more for merit. In the months of planning who would get what, the managers just kept rationalizing giving themselves more and more and more. \n\nThe end result was the managers were told to hand the money back, and that maybe they would keep their jobs. If they quit and didn't hand it back, there would be a coming legal battle for them.\n\nThis didn't get most of the many employees who quit to come back. The relationship with the managers was now dead.\n\nIn this company, managers weren't paid more than those they managed. The company merged not long after, and then the whole merger died a dot com death.\n\nHad they not lost those people, and had they not merged; I'm not sure this company would have even seen a financial hiccup from the dot com bust.\n\nI think in most companies the problem is that people at the top really think they are the ones who make it rain. It is usually the team, with the occasional person who everyone knows is super valuable. A sales person who must be a jedi, a tech person who should be teaching at MIT, etc. But the reality is the bulk of people at all levels are helping, yet, managers on up are the ones taking as much credit as possible, and then rewarding themselves with as much money, privileges, etc as they can. There is no confelicity, in that too many accolades to other people might make them want more money, privileges, etc.\n\nA zillion years ago I knew the guy who built the entire computer system for a power company. (late 70s and early 80s). He was the guy. He invented, installed, configured, programmed, etc everything from scratch. He directly reported to the president, and was given a huge amount of leeway to do what he wanted, how he wanted. \n\nThen, the president changed, and annoited his son as head of engineering or CTO or something. The first day the son was there, he had this guy's office torn out. His \"office\" was beside the server room, which had to have their own clean cool environment. It was maybe 200 square feet. This guy showed up on Monday to discover the servers all sitting there on tables as the whole two rooms were an independent construction. He asked what the hell had happened when the son said, \"Only executives get offices, you are not an executive.\"\n\nHe did two things starting that morning. He reconfigured the power system so it would continue to function, but be 100% unmaintainable. He then started a company to sell all the things he had invented, created, etc to other power companies. Prior to that, they had been giving it away for free, as a free exchange. We give you this, you give us that, sort of thing. \n\nHe was minting it within months, and who knows how many millions it cost to replace all his unmaintainable stuff with GE gear? At least 10s of millions in 1980 dollars. It took him a week or two to make his mess and copy his work. He left without notice, or training anyone, the one person who did work with him as his apprentice (and backup) joined his new company.\n\nCompany culture comes from the very top.",
                  "score": 1,
                  "created_utc": "2026-02-18 00:55:59",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5xbf90",
          "author": "Responsible_Entry_11",
          "text": "Here’s the reality behind this - no one knows what others are going through; success is already subjective - process is far more so.\n\nSending a smile and a congratulations to someone who has done well by your own measure is great, but feeling excited is understandably strange. \nWe don’t know how that person got to “there”, whatever it is we think is there.\n\nThis is different than being a manager / direct supervisor / coach for someone. You know exactly what their goals are and how the person accomplished them. In that scenario, I see people all the time get plenty excited. Management is mostly about helping people get to where they want to go. That is the prime reward (beyond comp) for a manager.",
          "score": 5,
          "created_utc": "2026-02-17 20:09:49",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r3eg3c",
      "title": "Looking for use cases for AI as project manager",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1r3eg3c/looking_for_use_cases_for_ai_as_project_manager/",
      "author": "One-Clue4444",
      "created_utc": "2026-02-13 03:30:58",
      "score": 54,
      "num_comments": 77,
      "upvote_ratio": 0.82,
      "text": "I am looking for ideas or use cases to implement AI - genAI or agentic or just automation using ms copilot/ GitHub copilot/ ChatGPT. \n\nCurrently, I actively use ms copilot to do ppt, documentation,MoM,  to find emails etc. ",
      "is_original_content": false,
      "link_flair_text": "General",
      "permalink": "https://reddit.com/r/projectmanagement/comments/1r3eg3c/looking_for_use_cases_for_ai_as_project_manager/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o58v43q",
          "author": "reallychilliguana",
          "text": "Why don't you ask the AI for ideas.",
          "score": 30,
          "created_utc": "2026-02-13 22:36:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5aqtpu",
              "author": "DaimonHans",
              "text": "LMAO 🤣",
              "score": 6,
              "created_utc": "2026-02-14 06:02:51",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o5opqr8",
              "author": "One-Clue4444",
              "text": "I have… looking for what other are doing in terms of using it to manage projects.",
              "score": 2,
              "created_utc": "2026-02-16 14:17:56",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o541r6p",
          "author": "[deleted]",
          "text": "[deleted]",
          "score": 29,
          "created_utc": "2026-02-13 04:53:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o545blc",
              "author": "heebs387",
              "text": "Man, I need to get on this train.",
              "score": 3,
              "created_utc": "2026-02-13 05:19:31",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o543jwh",
              "author": "AOmnist",
              "text": "Awesome! Have you considered Claude Code vs Claude we \n(which I assume you are using for the Claude Projects)?",
              "score": 2,
              "created_utc": "2026-02-13 05:06:15",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o54dup2",
              "author": "tardiskey1021",
              "text": "How did you get it to link to your in confluence? Does your organization have Enterprise security in the way ?",
              "score": 2,
              "created_utc": "2026-02-13 06:28:26",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o56mu9r",
                  "author": "collije",
                  "text": "I would be very very wary of linking company NDA items as a direct connection to a 3rd party tool or service, like GenAI.",
                  "score": 1,
                  "created_utc": "2026-02-13 16:03:51",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o54nggu",
              "author": "clickographer_",
              "text": "Looks interesting, Can you please help me if I DM you?",
              "score": 1,
              "created_utc": "2026-02-13 07:53:52",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o54ngi5",
                  "author": "AutoModerator",
                  "text": "Hey there /u/clickographer_, why not join the public conversation? Signaling a DM publicly is redundant\".\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/projectmanagement) if you have any questions or concerns.*",
                  "score": 0,
                  "created_utc": "2026-02-13 07:53:52",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o556w79",
              "author": "BlazedAndConfused",
              "text": "How does it “updates JIRA”?",
              "score": 1,
              "created_utc": "2026-02-13 10:55:29",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o55ncbq",
                  "author": "Smooth-Trainer3940",
                  "text": "Was wondering the same",
                  "score": 1,
                  "created_utc": "2026-02-13 12:58:42",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o5699uo",
              "author": "dude1995aa",
              "text": "Funny your flow,  will be releasing a product soon with outlook add-ins that will automatically upload teams transcripts for rag access, will have Jira and Lucidchart functionality, access to all project documentation through rag, ai testing tool, plus generation of sap related objects.  Chat tool based on ChatGPT reading all that project documentation.  Will have some data cleansing tools and ai automated template fillers with this tool.  The world is changing fast my friends.",
              "score": 1,
              "created_utc": "2026-02-13 14:58:19",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5657j2",
          "author": "Palegic516",
          "text": "I use it all the time to simulate executive questions and scrutiny and then help me come up with responses. I use it to draft emails a lot. read through contracts, and leases and pretty much any legal document and summarize, cite and evaluate risk. It’s great for calculating lots of numbers via screenshot or paste, if the documents aren’t in excel format. It can do some fairly complex math quickly to find where missing numbers are or errors in calculations. The list goes on",
          "score": 13,
          "created_utc": "2026-02-13 14:37:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5801zd",
          "author": "pmpdaddyio",
          "text": "I use it for a few things. \n\nI have a script that matches my project status reports. I use RAG status indicators and I explain in my prompt how they are calculated. \n\nI add in an iterative Q&A as part of the prompt so it will ask clarifications as it processes. I run the prompt against my Trams transcripts. \n\nI save at the very minimum two hours a week on my big projects. \n\nI have another prompt that uses the same transcript and it builds my RAIDD log entries. \n\nWhen I hold the meeting I use purposeful comments like “add a risk to the RAID for the following assignment Peter, due date June\n\nI also ask it to update the log and use the same cadence. Being intent full and not just jabbering in the meetings helps. \n\nI also use it to determine tone and feedback of meetings which I rate. We have tons of high stress projects and I use it to coach me on topics to pay closer attention to and be more delicate with. \n\nI do a Teams and outlook assessment weekly that uses my categories to help me look at my meeting schedule and provide feedback to my staff. \n\nI also compile standup meeting notes into my leadership meetings. Saves a ton of time.",
          "score": 11,
          "created_utc": "2026-02-13 20:00:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5asa0p",
              "author": "ArpanMaster",
              "text": "Can you share the rag? And prompts?",
              "score": 4,
              "created_utc": "2026-02-14 06:15:30",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5p09pq",
                  "author": "pmpdaddyio",
                  "text": "I tried to paste it, but it is too long. Happy to do so, but you need to message the mods to allow it.",
                  "score": 2,
                  "created_utc": "2026-02-16 15:12:49",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o5oq18h",
              "author": "One-Clue4444",
              "text": "Great ideas.. I am going for to steal them.. thanks",
              "score": 2,
              "created_utc": "2026-02-16 14:19:29",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o55hp54",
          "author": "surrealcrow",
          "text": "I use it to vibe code full project features, I show my team of senior developers that their estimates are too high, they love it",
          "score": 11,
          "created_utc": "2026-02-13 12:21:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o55i3bk",
              "author": "picobar",
              "text": "Curious, missing a /s perhaps?",
              "score": 6,
              "created_utc": "2026-02-13 12:24:06",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o55ugq5",
                  "author": "surrealcrow",
                  "text": "Hehe yeah",
                  "score": 6,
                  "created_utc": "2026-02-13 13:40:10",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o53zdgu",
          "author": "cyeph",
          "text": "Try mapping out the activities you perform as a PM currently and then look at which of those use cases can be streamlined using AI",
          "score": 9,
          "created_utc": "2026-02-13 04:36:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o54m4av",
              "author": "rnathani91",
              "text": "This. Also you wont be able to do the parts with Emotional Intelligent duties like motivation, momentum shifts based on non-data climates, or org changes before they become formalized. Simulations could be added in. Just not the execution.",
              "score": 2,
              "created_utc": "2026-02-13 07:41:32",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o54p8q7",
          "author": "Eightstream",
          "text": "Make your emails even more empty and soulless",
          "score": 8,
          "created_utc": "2026-02-13 08:10:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o556kzr",
          "author": "CreativeAsFuuu",
          "text": "I use AI for reports but remain the primary decision maker for what goes in them.\n\n\nI start with two AI tools: an AI note taker (Otter, Copilot, Fireflies) and a GPT (like Claude, Chat, Perplexity); and a human-led tracker (ike Monday, Asana, or Jira).\n\n\nThe note taker transcribes and summarizes my meetings with my teams or stakeholders. I still manually take notes, but the AI captures more robust information since it can transcribe faster than I can type. I also cannot type and employ active listening at the same time; the note taker allows me to pay attention to what's being said so I can get a full understanding with context.\n\n\nThe GPT has a project folder and generic project knowledge instructions. In the knowledge base, I include all relevant project documents, like the scope of work, past reports, past work, and a report template.\n\n\nMy team gives detailed updates in their trackers: every stakeholder interaction, every project status change, every iteration of a project, tasks, points of contact, etc. You get the idea: if it can be defined, quantified, classified, or described, my team includes it as a variable or an update in the tracker.\n\n\nFor each report, I export all data from the tracker as Excel or .csv and upload it to my GPT. I prompt the GPT to create a report based on the template, and tell it to include all requirements for the report from the scope of work.\n\n\nI compare the output from the GPT to my tracker and note taker's notes. I, the human, manually add any risks, context, or notes I took from daily interactions. I remove hallucinations or anything stupid the GPT included. After some formatting and proofreading, I fire that puppy off to the project owner. \n\n\nCaveat: This application of AI is highly dependent on my teams putting detailed updates in their trackers; my having precise instructions in my prompts, clear project instructions, and the experience and emotional intelligence to identify threats, challenges, and risks that my team is too junior to identify as such.",
          "score": 10,
          "created_utc": "2026-02-13 10:52:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o56kzp2",
              "author": "collije",
              "text": "Another approach and tool for meeting transcribe and meeting notes: take voice recording (one with transcribe/export feature) and upload the transcription to your GenAI of choice (I use Gemini) to a draft of meeting minutes and tweak as needed (sometimes adding additional context in the AI chat, or simply making my remaining edits or rewrite directly)",
              "score": 2,
              "created_utc": "2026-02-13 15:55:08",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o56luz5",
                  "author": "CreativeAsFuuu",
                  "text": "Good idea! My note taker already does this! It records, transcribes, and summarizes into meeting minutes :)",
                  "score": 1,
                  "created_utc": "2026-02-13 15:59:13",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o55rskl",
          "author": "dude1995aa",
          "text": "Throw away copilot-use Claude for office 365 type work.  I hand it a company deck and tell it the content I need.  It adds the slides, knows the color scheme and format, amazing job with graphics.  Won’t touch copilot.  GPT is a great tool with word…just not PowerPoint.  Was just handed a task of putting together a quarterly deck for the project that would have taken weeks before.  Now I’ll have a meeting with 3 or 4 key people, record it, submit all the transcripts, have Claude put it together.",
          "score": 8,
          "created_utc": "2026-02-13 13:25:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o56bxsb",
              "author": "ArpanMaster",
              "text": "Recently discovered that Claude is so much better than cgpt",
              "score": 2,
              "created_utc": "2026-02-13 15:11:24",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o5625qd",
              "author": "obviouslybait",
              "text": "Claude does seem to really do well in the tooling category, the number of integrations and skills is truly impressive. GPT does well with reasoning and spitting out best practices and offering additional solutions, but misses on the productive output in my opinion.",
              "score": 1,
              "created_utc": "2026-02-13 14:21:47",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o57t58b",
              "author": "Seattlehepcat",
              "text": "Unfortunately in our org we're bought in 100% on MSFT, and our Copilot instance combs our internal resources so we're kind of stuck with it.",
              "score": 1,
              "created_utc": "2026-02-13 19:26:47",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o56c22z",
          "author": "ArpanMaster",
          "text": "Good question to post. Lots of handy tips in the comments.\nThanks",
          "score": 6,
          "created_utc": "2026-02-13 15:12:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o53w0t9",
          "author": "summetg",
          "text": "Meeting summaries are a given, finding project dependencies, pulling insights from your artifacts",
          "score": 4,
          "created_utc": "2026-02-13 04:12:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o55qbj4",
          "author": "the__accidentist",
          "text": "Use Gamma for your PPTs. \n\nSet up an N8N feeding data from your project plan, schedule, ooo team time, milestone related calls in the schedule, etc. \n\nHave Gamma made an update deck every week",
          "score": 5,
          "created_utc": "2026-02-13 13:16:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o56qety",
          "author": "agile_pm",
          "text": "My team uses it to help with coding, peer review, and QA testing.  I use it to help stakeholders with identifying user stories, use cases, risks and mitigations, and strategic considerations, among other things.  The thing to watch out for is stakeholders rubber stamping AI-generated documentation they're supposed to be preparing.  AI is supposed to be a time-saver, not a decision-maker.",
          "score": 5,
          "created_utc": "2026-02-13 16:20:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5oqtuh",
              "author": "One-Clue4444",
              "text": "Absolutely agreed. My team is already using git copilot to code, test and BAs use internal tool build on Claude to create user stories, BRDs and FSDs but key is to run refinements and not blindly use AI.",
              "score": 1,
              "created_utc": "2026-02-16 14:23:39",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o53xhda",
          "author": "marizul24",
          "text": "Recently started using Claude code + jira MCP. I can pull down sprint insights instantly, send it all to confluence. Bulk create tickets directly from my terminal, all using natural language. It’s been awesome, huge time saver.",
          "score": 9,
          "created_utc": "2026-02-13 04:22:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o542mds",
              "author": "Spare-Day-4007",
              "text": "This is the play here. \n\nCreating tickets, create a markdown file for it to read that is acting like you and have it use a template to answer questions for what you want in tickets",
              "score": 1,
              "created_utc": "2026-02-13 04:59:24",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o54gwkm",
                  "author": "Gandzilla",
                  "text": "Any ressources or how-to's to share on how to do this?",
                  "score": 2,
                  "created_utc": "2026-02-13 06:54:43",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o54dm0t",
          "author": "PlasProb",
          "text": "Manage notes, todos and day schedule. I use Saner AI every day to prioritize my schedule and get reminded on tasks I may forget",
          "score": 4,
          "created_utc": "2026-02-13 06:26:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o55knsu",
          "author": "Sophie_Doodie",
          "text": "If you’re already using it for decks and MoMs, next level is using it to think for you, not just write for you. I use it to draft risk logs from messy notes, turn status updates into exec summaries, simulate stakeholder objections before big meetings, break vague goals into task lists with dependencies, and sanity check timelines (“what’s likely to slip here?”). You can also feed it past project data and ask for pattern analysis, where delays usually happen, which tasks create bottlenecks, etc. The real win isn’t prettier docs, it’s faster clarity and better decisions.",
          "score": 8,
          "created_utc": "2026-02-13 12:41:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o56jzqi",
              "author": "collije",
              "text": "That's the real use case. It's like peer review from a fellow sr PM, Program Manager, or PMO chief",
              "score": 2,
              "created_utc": "2026-02-13 15:50:24",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o53tpim",
          "author": "WololoWanderer",
          "text": "I am trying to figure out the same, so confused which tools to start with",
          "score": 3,
          "created_utc": "2026-02-13 03:56:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o55k123",
          "author": "ConstructionNo1511",
          "text": "I used copilot to generate python code for a macro that reformatted, removed columns, and renamed a monthly distribution of 40 files.",
          "score": 3,
          "created_utc": "2026-02-13 12:37:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o53rrbd",
          "author": "bluealien78",
          "text": "I have dozens of agents deployed doing many “PMO”-centric repeatable work. Charter authoring, initial WBS building, deck building, Slack autoresponders, incoming request routing, status reports. The humans in the loop are the last 10% now. It’s awesome. Our throughput is way higher than it was a couple of years ago.",
          "score": 4,
          "created_utc": "2026-02-13 03:43:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o545qer",
              "author": "Available-Budget-735",
              "text": "What does the slack autoresponder do? Have you had any issues arise due to the agents being wrong?",
              "score": 2,
              "created_utc": "2026-02-13 05:22:40",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o53sfmi",
              "author": "Daisy_InAJar",
              "text": "Do you use agents all from one core tool or many different ones? I’d love to hear more about request routing and status reporting.",
              "score": 1,
              "created_utc": "2026-02-13 03:48:25",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o53u1mq",
                  "author": "bluealien78",
                  "text": "Glean, Cursor, Gemini, and an in-house LLM are all used.",
                  "score": 0,
                  "created_utc": "2026-02-13 03:59:13",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o54syuv",
              "author": "speedypuma",
              "text": "Any examples of prompts you use? Company just rolled out Gemini and wondering if I can set up custom Gems to do similar",
              "score": 1,
              "created_utc": "2026-02-13 08:45:16",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o53vzx2",
          "author": "Trickycoolj",
          "text": "I use our command line AI to connect to our Jira and confluence instances (locally hosted not the cloud based versions). It’s killer to have open during meetings when someone says “when was X ticket completed?” Or “we need to do Y” and I can search “what ticket completed Y task worked by ABC engineer” and boom link to the ticket “we completed that work back in November and it was deployed right away”",
          "score": 2,
          "created_utc": "2026-02-13 04:12:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o564vlt",
          "author": "Ok_Jello9448",
          "text": "Hey, did the use of co pilot or Claude fundamentally change how you do things? I get that emails are written faster or slide decks are made faster, but did anything change wrt what you essentially do as a project manager i.e hearding a group of people, and make them work towards 1 single goal. Of course besides all the jazz of scope, timelines, cost, reporting etc.  \n\nGenuinely curious.",
          "score": 2,
          "created_utc": "2026-02-13 14:36:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5tbvmi",
              "author": "One-Clue4444",
              "text": "It has helped reduce a lot of time in doing redundant things. Most benefits I have found is with creating a simple agent which we all use to answer product related questions. We have not extended this agent to non tech teams as well.  \n\nFrom project management perspective, referencing has become easier, I use it to create timelines, do work breakdowns etc",
              "score": 1,
              "created_utc": "2026-02-17 04:53:42",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o555ifh",
          "author": "Mammoth_Ad3712",
          "text": "You’re already using it the way most PMs start: notes, decks, and email cleanup. That’s solid.\n\nWhere I’ve seen it go from “nice to have” to actually useful:\n\n• Turning messy meeting notes into structured action logs with owners and due dates  \n• Scanning long email threads and extracting risks, blockers, and decisions  \n• Drafting stakeholder updates based on raw status inputs  \n• Comparing scope changes against original requirements to highlight deltas  \n• Reviewing schedules for obvious dependency gaps or overallocations\n\nIf you want to go deeper, start experimenting with lightweight “agents” that:  \n– Pull task data from your PM tool  \n– Flag overdue or at-risk items  \n– Draft a weekly summary automatically\n\nJust be careful with data privacy and hallucinations. Always review before sending anything external.",
          "score": 2,
          "created_utc": "2026-02-13 10:43:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o55n9v1",
              "author": "Smooth-Trainer3940",
              "text": "I like using it for the first thing you mentioned. I am a messy note-taker so I like that it can rewrite to format it for me. I think the use case of 'take this unstructured thing and make it structured' is a good use case. For the last few things you mentioned, I would be interested to see how AI could handle that. They seem more like workflow automation / data transfer use cases, which I haven't seen many AI tools do (or do well). I use Text Blaze for those kinds of things right now and I'm happy with it. Also agree to be careful with hallucinations. I have pretty detailed prompts that mention preserving my original ideas/meaning, etc.",
              "score": 1,
              "created_utc": "2026-02-13 12:58:17",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o55l6gi",
          "author": "TheRoseMerlot",
          "text": "Why not, not?",
          "score": 2,
          "created_utc": "2026-02-13 12:44:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o54pu2x",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-13 08:15:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o556krd",
              "author": "projectmanagement-ModTeam",
              "text": "Thanks for your post/comment.  \n\nWe removed this post because it's in direct violation of our \"solicitation / self-promotion” rule.  \n\nPlease review these rules, which can be found in the sidebar.\n\nThanks,\nMod Team",
              "score": 1,
              "created_utc": "2026-02-13 10:52:42",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o55jjnq",
          "author": "jche2",
          "text": "GitHub action to automate code review QA via copilot and block build if it doesn’t have green light via custom prompt with your org specific standards",
          "score": 1,
          "created_utc": "2026-02-13 12:34:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5b4x13",
          "author": "NoDig7080",
          "text": "I have my pet peeves that I need AI to solve:\n\n1. Improve planning & estimation - currently everyone has their own method and most are usually wrong. \n\n2.  As team manager tell  me  what needs my attention.  So I don’t spend enormous time  digging and in meetings  \n\n3. Automate stand ups - they take too much efforts.  Some days it’s pulling teeth. \n\n4. Surface performance of each person.  Lot of it driven by managers memory and good upward management of person rather than reality.",
          "score": 1,
          "created_utc": "2026-02-14 08:12:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5tbdmo",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-17 04:50:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5tshoe",
              "author": "projectmanagement-ModTeam",
              "text": "Thanks for your post/comment.  \n\nWe removed this post because it's in direct violation of our \"solicitation / self-promotion” rule.  \n\nPlease review these rules, which can be found in the sidebar.\n\nThanks,\nMod Team",
              "score": 1,
              "created_utc": "2026-02-17 07:08:30",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o56ky1k",
          "author": "essmithsd",
          "text": "This question is asked weekly, use the search bar ffs",
          "score": 0,
          "created_utc": "2026-02-13 15:54:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o53qt9m",
          "author": "Robenever",
          "text": "Recently got approach by a top MBA school about one of their executive programs that was basically selling this exact thing as a course. AI use cases are pretty new and there’s a high demand for this knowledge as far as I can tell.",
          "score": 1,
          "created_utc": "2026-02-13 03:37:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o542pb7",
          "author": "Aggressive-Low3956",
          "text": "Project managers can use AI to gauge project data, assess team performance, automate scheduling, forecast hazards, and produce real-time insights. ",
          "score": 0,
          "created_utc": "2026-02-13 05:00:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o54hvjq",
          "author": "WoodpeckerNo5214",
          "text": "Beyond docs and decks, AI is great for risk prediction, sprint planning, dependency mapping, and auto-generating stakeholder updates from project data. You can also use it to simulate scenarios, draft mitigation plans, and spot scope creep early.",
          "score": 0,
          "created_utc": "2026-02-13 07:03:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o553qh9",
          "author": "adelarenal",
          "text": "I use Claude Code + VSC for all my PM. I am not coding.",
          "score": 0,
          "created_utc": "2026-02-13 10:27:12",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r4m0ha",
      "title": "How do you distance yourself from the job?",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1r4m0ha/how_do_you_distance_yourself_from_the_job/",
      "author": "tjommee",
      "created_utc": "2026-02-14 14:29:06",
      "score": 46,
      "num_comments": 24,
      "upvote_ratio": 0.99,
      "text": "I began a new job as a PM a few weeks ago and got to take over a project in its early stages. Quite short time plan of a total of 12 months, but at the handover they made it clear it was already 2 months late. Time which will not be able to compensated for due to external deliveries.\n\nThe client is not aware but is noticing deliveries are slipping. For them it is a very high stake project with a lot of external financing linked to the time plan. So all meetings with them consist of them shouting and demanding things to be done that are at least 4-6 weeks away.\n\nI don’t know how to deal with this. I inherited this mess and I’m stuck with it now and can’t really do much about it. And it is extremely stressful.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/projectmanagement/comments/1r4m0ha/how_do_you_distance_yourself_from_the_job/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o5cioc0",
          "author": "wm313",
          "text": "You reset expectations. First, update them on the true status and where you go from here. Do it once now so you don’t have to later when it really hits the fan. Transparency builds trust. They don’t want to hear it but you don’t want to backtrack later. \n\nI inherited a project where promises were made by my predecessor that never happened. I explained that I couldn’t do anything about that now but here we are today. I provided a plan going forward and gave them timelines. I looked at it as it not being my fault for our current situation. It helped and things got done. I built trust with them and I was thanked later for my guidance. \n\nThat was as a new PM working in data center construction. The pace there was fast, and we had half of the team my company promised, but we had a couple engineers who were all stars. I was stressed out daily. It was stressful but we met the deadline in the end with some caveats. \n\nYour customers will respect your transparency more than you trying to fix things behind the scenes. Rip the bandaid off and get the issues out there. They will be more helpful with that approach after the initial shock wears off. In the meantime, if possible, talk to your management about getting more people to work on the project. Maybe they can do something, maybe not but you’ve got to up-channel the things that keep you up at night. Otherwise, it’s self-induced stress until you relieve the weight on your shoulders.\n\nPrepare for longer days if that’s an option. Plan *with* your team, not just for them. Let them know what’s going on. It makes that part easier as well. It builds trust when everyone knows where things sit.",
          "score": 25,
          "created_utc": "2026-02-14 14:55:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5daber",
              "author": "icysandstone",
              "text": ">Rip the bandaid off and get the issues out there. They will be more helpful with that approach after the initial shock wears off.\n\nAgree with everything you’ve said, and I’d like to add some tactical wisdom from Chris Voss on how to actually deliver bad news. As he says, people are remarkably resilient… it’s all about the delivery.\n\nHere are some clips for anyone who stumbles on this thread:\n\n“Say it as concisely and as negatively as you can.” https://youtube.com/shorts/7dyF1vjxEkA\n\n“Calling the elephant out in the room is the good way to do it. https://youtube.com/shorts/WhagYNlKwDE\n\n“People are remarkably resilient if you give them a second to brace themselves.”\nhttps://youtube.com/shorts/7qKVGC0knQs\n\n“It’s how you give the warning… you’re going to react negatively to this. You’re not going to like this.” https://youtube.com/shorts/O8_7rshZ0y4\n\n\n“I’ll let you brace yourself and you’re going to appreciate the warning” https://youtube.com/shorts/uvhDq9XfKrM\n\n“Wait a second and deliver the news” https://youtube.com/shorts/BhzSxr20YpE\n\n\nIf you watch all those Shorts you’ll be an expert at delivering bad news. 😬\n\nCc’ing OP: /u/tjommee",
              "score": 5,
              "created_utc": "2026-02-14 17:17:11",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o5d5v5o",
              "author": "14erMustClimbAll",
              "text": "This person has it 100% correct. Be honest that the schedule is delayed. Ideally you can share ideas about what you're trying to do to speed up, but it is better to be upfront about the delay vs coming to the end of the project and then telling then it's late. \n\n\nIf you tell them now, they can take steps to adjust expectations on their side. If you wait too long to admit the delay, they will truly be pissed at you and your company.",
              "score": 3,
              "created_utc": "2026-02-14 16:54:38",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5dc2rz",
                  "author": "tcumber",
                  "text": "I agree with all above with caveat that you should check with your management on messaging.",
                  "score": 3,
                  "created_utc": "2026-02-14 17:26:08",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5chodc",
          "author": "Immediate-Actuator85",
          "text": "Ok you are the new guy on the block.  The company is probably testing your intestinal fortitude by giving you this mess. If it’s really a high stakes project, then why is it 2 months late ? Why would they put a new pm from outside on it as opposed to one that was already familiar and versed with the project to begin with? Or why not put an outside high cost consultant it on it who is familiar with this type of project? They Shouting at meetings ?  This sounds like a very dysfunctional organization. \n\nJust do your best with it and remember you did not create the mess, you inherited it. You got the project nobody else wanted because they knew it was a mess with dysfunctional people involved in it.  They had to resort to an outsider (you) to take it on. If you stick it out, the company should realize they have a valuable performer that can handle tough projects. If you turn it around, that’s an extra feather in your cap. This can be an opportunity to/ blessing in disguise. Try to look at it that way",
          "score": 13,
          "created_utc": "2026-02-14 14:49:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5cs2bk",
              "author": "tjommee",
              "text": "That’s a good way to look at it. The organisation is somewhat immature but with good people. I’m trying my best to promote transparency and I’ll just have to see how it goes.",
              "score": 2,
              "created_utc": "2026-02-14 15:45:05",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5cslwn",
                  "author": "Immediate-Actuator85",
                  "text": "I’ve been there and done it . Best of luck",
                  "score": 1,
                  "created_utc": "2026-02-14 15:47:53",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5cg8rr",
          "author": "PineappleChanclas",
          "text": "The client not knowing is issue #1.\n\nYou didn’t inherit something mid-stream. You inherited something that never actually launched and is now drifting toward dumpster fire territory, if it’s not already there. That’s trial by fire.\n\nIf they’re unaware but starting to sense it, step one is internal:\n\nFigure out what actually broke down. Was it ownership? Scope clarity? Resourcing? Avoidance? Get the real story.\n\nThen plan the external conversation. Don’t “confess and hope for the best.” Show up with:\n\n1. What happened (clean, factual)\n2. Why it happened (without throwing anyone under the bus)\n3. What changes immediately\n4. A concrete recovery plan with dates and owners\n\nMost reasonable clients can handle bad news. What they can’t handle is ambiguity or spin. Transparency + a credible path forward buys you more goodwill than pretending everything’s fine.\n\nI remind myself all the time: the job is the job. We’re accountable for outcomes. But we’re also humans working with humans. Most people will meet you halfway if you’re honest and decisive.\n\nThe ones who won’t? They’re usually the ones their own teams struggle with too.",
          "score": 13,
          "created_utc": "2026-02-14 14:41:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5chn0g",
              "author": "UsernameHasBeenLost",
              "text": "Very well said.\n\n\n>I remind myself all the time: the job is the job. We’re accountable for outcomes\n\n\nFrom a \"how do you personally handle clients getting pissed off\" perspective I will add to this that for 99.99% of project management, the stakes aren't that high. I've been in roles where mistakes or delays can lead to injury or death. In my industry (manufacturing automation), the worst that happens is a massive company loses some productivity/money. It's not that serious, don't take it personally. Do the job to the best of your ability, but keep things in perspective",
              "score": 3,
              "created_utc": "2026-02-14 14:49:15",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o5ch5ji",
              "author": "tjommee",
              "text": "Thanks mate! Fully agree with you, I believe transparency is key. However the management here doesn’t fully agree. They are more inclined towards not changing the time plan towards the client and try to deal with the outcome at latest possible moment. But I think it just raises the stakes…",
              "score": 2,
              "created_utc": "2026-02-14 14:46:30",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5chvwx",
                  "author": "ErikGoesBoomski",
                  "text": "Then find a new place to work. The person who commented gave excellent advice, and honestly the only way to move forward with the project at all unless by some miracle you can pull a rabbit out of your butt. You're the PM, you need to take control of this thing before you get burned and end up with a shit reputation.",
                  "score": 3,
                  "created_utc": "2026-02-14 14:50:39",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o5cjjnw",
                  "author": "hadbadadhdstillhave",
                  "text": "Seems like you'll have to convince them otherwise or find out if they are right. Really need to chat to whoever has the most power here and understand their position.",
                  "score": 1,
                  "created_utc": "2026-02-14 14:59:53",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o5chskj",
              "author": "c1rcu1tb0y",
              "text": "This is good advice. Stick to the facts of the reality of the situation, do what you can do, make a concrete plan for what needs to be done, monitor as it goes and make sure everyone is informed, and then try to rest in the comfort of you did all that can be done. It’s just a job and there’s more important things in the world to actually stress over.",
              "score": 1,
              "created_utc": "2026-02-14 14:50:07",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5furpb",
          "author": "Quick-Reputation9040",
          "text": "I’m late to this discussion.  Let me add a comment, though, OP, in case you see this before your next client-facing meeting.\n\nEveryone telling you to alert the client to the problem are right,  You definitely should do that, after telling your leadership about the situation and your messaging approach.\n\nBefore doing either, however, I would advise going thru another round of what-ifs to determine what, if anything, your org and suppliers could possibly do to reduce the schedule.  Can your client pay more to your org, to pay your suppliers to crash the schedule?  If your suppliers are late, can other suppliers meet the (or at least get closer to) the original schedule?\n\nEven if your suppliers can’t do anything, and alternative suppliers can’t be used for whatever reason, can your org crash the schedule in other ways (e.g. bring in contractors to reduce timelines later?). \n\nAlternatively, can your org deliver less at first, then iteratively deliver the rest of the solution?\n\nLong story short: We typically work with three constraints.  The schedule is currently cooked.  Work with your teams and leadership to determine what, if anything can be done if the client can pay more or reduce the scope needed by the deadline.  Look for alternatives and present what you find and let the client determine what’s really most important in the triple constraint.",
          "score": 9,
          "created_utc": "2026-02-15 01:55:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ggffh",
          "author": "Logical-Bookkeeper77",
          "text": "Facts gathering, assess the situation, make alternatives and recommendation.\n\nSometimes, delay is inevitable.\n\nThink of it like a real life kobayashi maru without the ability to reprogram the scenario.\n\nBut it’s usually gets more sticky because your company may not want to disclose any possibility of lateness due to clauses in contract and sometimes expect the PM to be the scapegoat and just fire an rehire when shit happens. \n\nAnd just leave the things when you leave office. Don’t carry the burden with you to home. Do some winding down like have a HH or a quiet coffee whatnot.\n\nGood luck~",
          "score": 8,
          "created_utc": "2026-02-15 04:28:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ez3a6",
          "author": "More_Law6245",
          "text": "When taking over an inflight project you must as a professional practitioner undertake your own due diligence on the project prior to acceptance because you need to ensure the business case, plan and schedule and map back your deliverables, products and milestones and more importantly understand if the project has been baselined. You also need to understand that your business case is actually fit for purpose along with your project plan and schedule.  You also need to map your relevant project document artefacts to see if they have been delivered, reviewed and approved.  This is to ensure that you're not getting a dead cat that is being thrown over the fence and making sure that you're left holding the cat. \n\nAnything that falls short should be immediately escalated to your project board, sponsor or executive. You also should be raising additional risks and issues and informally socialise them with your project board then formally raise them, so they're not surprised. I would also suggest you have a plan for a way forward e.g re-baselining your project schedule, placing the project on hold or worse case scenario  recommend abandonment.  \n\nYourself, your executive or account manager (urgently) need to sit down with the client in order to reset expectations because if you don't do anything outlined above it will end up in your lap at the end of the project, rightly or wrongly.  At some point once you become the PM it becomes your responsibility and if you fail to escalate the current position it becomes your problem regardless of what state the project is in. Hence why it's so important for the new encumbered PM to audit the project carefully prior to acceptance. \n\nJust an armchair perspective. ",
          "score": 7,
          "created_utc": "2026-02-14 22:37:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5h2u3d",
          "author": "pmpdaddyio",
          "text": "Do you want to fix that problem or just not give a fu(k about it?",
          "score": 6,
          "created_utc": "2026-02-15 07:43:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5gvxm9",
          "author": "danarchyx",
          "text": "Realize your job is an ends to a mean. That mean is funding your ideal life.",
          "score": 8,
          "created_utc": "2026-02-15 06:38:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5gltcd",
          "author": "DaimonHans",
          "text": "Take yourself out of the equation. You cannot change the outcome.",
          "score": 6,
          "created_utc": "2026-02-15 05:10:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5cfkcd",
          "author": "Ordinary_Musician_76",
          "text": "Lexapro",
          "score": 2,
          "created_utc": "2026-02-14 14:37:27",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r4idwk",
      "title": "I feel like a glorified note-taker",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1r4idwk/i_feel_like_a_glorified_notetaker/",
      "author": "Kind_bite91",
      "created_utc": "2026-02-14 11:31:15",
      "score": 42,
      "num_comments": 19,
      "upvote_ratio": 0.98,
      "text": "For the past year I have worked as a junior project manager in SaaS company. Mind you, there is no senior PM in the company but since I came in fresh in the role with little to no actual previous experience I have been titled as Junior. \n\nThe CEO of the company moonlights as a dev with just enough knowledge to be more of a hindrance rather than useful. For the past year he has been building products with the help of AI coding assistants and then offloading thousands of lines of code to the dev team to sort out and transform fit for production. From the very beginning requirements gathering has been non existent. Market research, client needs… these are like curse words in our company. CEO has an idea. He vibe-codes it for a month and then leaves a steaming pile of mess for the rest of the team to sort out. We scramble for days to make sense of it and then over the weekend he drops a v2 of his initial product and the scrambling begins all over again. Last year we spent more than 8 dev months on a product, we managed to onboard one client and now it’s getting decommissioned in favor of his newest idea. \n\nFor one of our other products I tried to bring structure into it, established a timeline, he went on the Sales team chat, said the product is “ready” and they can put client on it. I piped in to say that internal testing isn’t finished, we have 4 more weeks on the timeline and I wouldn’t define the product as “ready”. For which I got a chewing directly from the CEO that I “need to understand my role better” and that I can’t keep blocking sales. Which, I swallowed as feedback and rolled with it. The problem is that, 2 days later he was supposed to demo this specific product to a prospective client and some things didn’t work as expected. Then I got another chewing that “this is badly broken and whatever testing plan you put in place was clearly inadequate”. That’s the point I checked out of the job and nowadays I just do the bare minimum. \n\nIt’s hard to put a testing plan together - I don’t have QA testers, I have no requirements, and every time I mention “acceptance criteria” he looks at me like I just cursed his mothers. \n\nI’m allowed to ask him concrete questions on priorities but I have to “spare him the general chitchat” \n\nSales team have meetings with prospective clients, they pass down client needs and market gaps that need filling and I prioritise features based on that. On the next morning, CEO completely overturns priorities because he just spoke to one client and that one client absolutely has to have that one feature this instant. \n\nOn one morning standup he tells me “prioritise this project” and I do - assign resources, draw timelines to the best of my ability, try and chase him to sign off on the plan. And then I learn that 2 out of the 3 resources I assigned have been pulled in other “urgent tasks” and my timeline gets delayed by certain amount of time. And then I get blamed for the delays and insufficient planning. Head of Engineering chewed me once in front of the whole dev+sales team for putting in buffers in my timelines and how that’s misleading and “hurting transparent communication between departments” \n\nMy dev team is just spitting out code to the bare minimum of standards because they are tired of the mess. \n\nWhen I try to enforce change control the CEO goes behind my back straight to devs and wrested them into doing what they want. \n\nMVP is a dirty word and “we can’t expect to turn a profit selling people the bare minimum”. \n\nAnd on and on I can talk about the inadequacy of the whole company. \n\nI have tried all kinds of approaches to stabilise things. But for most of the time nobody listens to me or follows the processes I try to implement - I have been undermined so many times, I have no real authority or voice anymore. \n\nI don’t manage projects - I scramble to write documentation after the fact. I sit in awkward calls where I have to tell stakeholders that what they see demoed in the CEO’s local environment is really nowhere near an accurate representation of the current status of the project. \n\nHow do you deal with a situation like this? I’m burnt out and lost all motivation to try and change things. I’m ready to throw in the towel but can’t afford to remain without a job at the moment. So any coping mechanisms and suggestions would be very very appreciated ",
      "is_original_content": false,
      "link_flair_text": "General",
      "permalink": "https://reddit.com/r/projectmanagement/comments/1r4idwk/i_feel_like_a_glorified_notetaker/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o5c4jmg",
          "author": "ApantosMithe",
          "text": "Sorry you’re in this situation, I’d set time aside to look for other roles - even if the company doesn’t go bust, you don’t deserve to be in this situation.\n\nYou have some experience from this role now, look for another",
          "score": 13,
          "created_utc": "2026-02-14 13:30:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5ci1ea",
              "author": "Kind_bite91",
              "text": "Yeah, I’ve been looking for another role. As soon as I line something up, I’ll be out that door like a dream.",
              "score": 3,
              "created_utc": "2026-02-14 14:51:30",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5bvc0k",
          "author": "Rosyface_",
          "text": "To be perfectly frank, leave. Find something else immediately and get out. There’s no changing what this absolute fuckwit is doing and you’re gonna go down with the ship unless you get out.",
          "score": 11,
          "created_utc": "2026-02-14 12:23:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5h6oeh",
          "author": "karlitooo",
          "text": "This is my experience with startup life also. Founders who can get from zero to one through sales tend to be chaos agents.\n\nYou have to win trust. That means being honest and not defensive. Consider radical candor the book. Don’t challenge, just give them information and ask for decisions. \n\nYou cannot rely on documentation. Plans reflect conversations not conversations about plans. Have the current plan in a simple visual format ready to go whenever a conversation turns to an impact on the plan, show the picture and ask for a decision on trade-offs.\n\nKeep spamming the plan into slack, consider having your own channel for and forward it to other channels. You have to keep the plan visible and simple. \n\nKeep buffering. Fuck the cto. Call it something else.\n\nOnce you have trust start the conversations about one plan vs secret work. Suggest ways to reduce chaos but don’t try to own them, let the cto drive change, try to make it so they’re his ideas.\n\nYou will never learn good project management form at this company but you will learn how to live in chaos without having a breakdown. Own the plan, communicate the changes, don’t be stressed about everything being on fire. It will always be on fire.\n\nEventually they will hire you a boss who will stand up to your ceo. That will never be you because you are pigeonholed. Stay until you find something better",
          "score": 12,
          "created_utc": "2026-02-15 08:21:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5hbjgw",
              "author": "Kind_bite91",
              "text": "I hear you and I agree with you on many points. To an extent I have tried doing what you suggest. I have published and tagged people to the project plans multiple times in the past. In the beginning, there was more trust between us all I think. Then I started calling the CEO out more and more on the things that cause problems. And now we are in the situation where I am a big thorn in his side. I’m under the impression that the more I try to do my job adequately the worse it gets. \nThe only thing I have to add is that eventually, I will be the third PM to leave the place.",
              "score": 3,
              "created_utc": "2026-02-15 09:08:06",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5dkgxq",
          "author": "Kombucha-Papi",
          "text": "Get out of there.",
          "score": 8,
          "created_utc": "2026-02-14 18:08:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5c323z",
          "author": "whiskeywannabe",
          "text": "No advice, just here to commiserate. Also dealing with a similar problem but within a multibillion dollar matrix organization with 7000+ employees. We are trying our best in the PMO, but some days I ask myself if I’m a masochist because trying to implement a discipline that helps execute major transformation initiatives has been PAINFUL.",
          "score": 6,
          "created_utc": "2026-02-14 13:20:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5eupp8",
              "author": "More_Law6245",
              "text": "The reason on why it's painful is because you're a professional practitioner who takes pride in their work, every PM (and PMO practitioners) goes through feeling this because they want to the do the best job they can but it can be very difficult when the organisation doesn't appreciate the governance needed in delivering an on time, on budget and fit for purpose project but yet these are very people who are the first to scream blue murder when it doesn't happen. Just take the satisfaction that you care about what you do because it wouldn't be so difficult if you didn't.",
              "score": 7,
              "created_utc": "2026-02-14 22:12:48",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5gfpvz",
                  "author": "whiskeywannabe",
                  "text": "Wow, I feel like you are inside my head. I appreciate the kind words of wisdom!",
                  "score": 3,
                  "created_utc": "2026-02-15 04:23:26",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5bqsqw",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 5,
          "created_utc": "2026-02-14 11:44:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5cphwe",
              "author": "projectmanagement-ModTeam",
              "text": "Thanks for your post/comment.  \n\nWe removed this post because it's in direct violation of our \"solicitation / self-promotion” rule.  \n\nPlease review these rules, which can be found in the sidebar.\n\nThanks,\nMod Team",
              "score": 1,
              "created_utc": "2026-02-14 15:31:42",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5ethx5",
          "author": "More_Law6245",
          "text": "This is your Kobayashi Maru test! You're in a no win scenario! To be brutally honest unless you're actually willing to hold your CEO to account, it's the only way that you're coming out of this with your reputation in tact.\n\nThese type of situations is where you earn your stripes (experience) as a PM, you just need to ask a simple and difficult question of your CEO, what is his priorities because you can only deal in the triple constraints of a project's time, cost and scope and all you have to ask is which constraint does your CEO want to change.  It's blunt, it's to the point and it's his decision, he just has to deal with and take responsibility for his decision. To be perfectly honest by confronting your CEO this is how you earn your seniority as a project practitioner and experience in handling difficult project stakeholders.\n\nHere is a reflection point for your consideration, if you keep capitulating to his over riding demands, you will be perceived as incompetent because you can never deliver on time but if you start placing the responsibilities back on to your CEO it becomes his issue and not yours. Remember decisions have consequences, you just need to highlight that your CEO with the impact of what he is doing but you need be pointed and ask if he is willing to accept the responsibility of those decisions. Something to keep in the back of your mind, if you don't learn to control or stand up to your CEO to hold him accountable, how are you going to go with your next role and you have the same type of personality to deal with, are you changing jobs again? Just a thought. Either way I hope you find the right solution to your situation but remember to look after yourself because you're in a very stressful situation, it's really up to you on how you want to approach this difficult stakeholder.\n\nJust an armchair perspective.",
          "score": 3,
          "created_utc": "2026-02-14 22:06:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5gh5az",
              "author": "Logical-Bookkeeper77",
              "text": "May be ask for a 5-10 mins after meeting to seek his advice say after a meeting just the 2 of you. \n\nAnd ask there’s a previous comment on XXXX, should we still proceed with it?",
              "score": 2,
              "created_utc": "2026-02-15 04:34:23",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5miiqk",
          "author": "sdarkpaladin",
          "text": "Sounds like the captain of the ship don't know how to steer.\n\nAbandon ship",
          "score": 6,
          "created_utc": "2026-02-16 03:46:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5q583u",
          "author": "alfa_omega",
          "text": "https://preview.redd.it/ynv92maxfwjg1.jpeg?width=792&format=pjpg&auto=webp&s=0036852c90e1fd8d837d5abdcec8901d507944e5",
          "score": 2,
          "created_utc": "2026-02-16 18:23:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5bpar9",
          "author": "AutoModerator",
          "text": "Hey there /u/Kind_bite91, have you checked out the [wiki page](https://www.reddit.com/r/projectmanagement/wiki/index) on located on r/ProjectManagement?  We have a few cert related resources, including a list of certs, common requirements, value of certs, etc.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/projectmanagement) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-14 11:31:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5shx8s",
          "author": "bleucrayons",
          "text": "All of this is a 🚩\n\nI don’t even need to read the entire thing in detail. When the CEO is that disorganized with competing priorities, it’s nothing but trouble. \n\nI’d jump ship. Seek out a company that is larger or has a PMO.",
          "score": 1,
          "created_utc": "2026-02-17 01:42:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5t3juu",
          "author": "working-dads-SaaS",
          "text": "Man how are companies like this able to exist.  Is their simply an endless amount of money being distributed to these software teams?  Its like I just read a tech version of the office.\n\nIt's time to leave the company.  Its going down hill quickly.  Unless this guys vib coded tools are radically unique and you are working for an Einstein.  Odds are, your just working for a guy who doesn't realize if HE can vibe code it, then someone else will...putting your tool out in the trash.",
          "score": 1,
          "created_utc": "2026-02-17 03:55:45",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r7dr5i",
      "title": "Project management tools ranked + comparison table (2026 update)",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1r7dr5i/project_management_tools_ranked_comparison_table/",
      "author": "jpreddituser1",
      "created_utc": "2026-02-17 18:09:13",
      "score": 38,
      "num_comments": 29,
      "upvote_ratio": 0.91,
      "text": "Hey all, at the start of the year my team started looking for a new project management solution to track all of our work and act as a single source of truth and I was asked to look at what’s out there and put together a pros/cons list of each so we can make an informed decision. I ended up going pretty deep and felt like it might be useful to other teams.\n\nOur team lives in Slack (and we don’t want that to change) so I specifically focused on solutions with great Slack integrations. The dream was that we could keep working in Slack, but while having a one-stop-shop outside of Slack where you could see/manage everyone’s work. Sorry if you don't use Slack. Probably not relevant for you!\n\nThere are 100s of tools out there so I just focused on the top ones. Let me know if I missed anything important.\n\n# Summary Table\n\n|**Overall**|Overall|Ease of Use|Feature Depth|Slack Integration Quality|\n|:-|:-|:-|:-|:-|\n|[Trello](https://trello.com/)|**4.3**|5|3.5|4.5|\n|[Asana](https://asana.com/)|**4.2**|4|5|3.5|\n|[Slack Lists](https://slack.com/blog/news/introducing-slack-lists)|**4**|4.5|2.5|5|\n|[Linear](https://linear.app/) (for dev teams)|**4**|4|3.5|4.5|\n|[Monday](https://monday.com/)|**3.8**|4|4|3.5|\n|[Jira](https://www.atlassian.com/software/jira) (for dev teams)|**3.8**|2.5|5|4|\n|[Todoist](https://www.todoist.com/)|**3.7**|5|2.5|3.5|\n|[Airtable](https://www.airtable.com/)|**3.7**|3|5|3|\n\n# Breakdown\n\n# [**Asana**](https://asana.com/)\n\n**Ease of Use: 4 / 5**\n\nAsana is easy once your team agrees on a simple “how we use it” pattern (projects, sections, owners, due dates). The friction shows up when people try to use every view/feature at once - you’ll want a lightweight default workflow and templates.\n\n**Feature Depth: 5 / 5**\n\nAsana is built for *structured project execution*, not just tracking tasks: dependencies, milestones, approvals, and multi-homing (same task in multiple projects) are first-class concepts. \n\nExample: if “Client approval” slips by 3 days, dependency chains make it obvious what downstream work gets pushed, and approvals keep “approved/rejected” explicit instead of buried in comments. \n\n**Slack Integration Quality: 3.5 / 5**\n\nStrong for capture + basic action: you can create tasks from Slack, and use /asana to list/create/complete/comment on tasks from inside Slack. \n\nBut it still behaves like “Slack is where tasks are born; Asana is where tasks are managed” - people will click through when work gets real.\n\n# [**Monday.com**](https://monday.com/)\n\n**Ease of Use: 4 / 5**\n\nTeams often like it immediately because it feels like a visual spreadsheet with statuses. The downside is consistency - if every client board is configured differently, adoption drops because nobody knows where to look.\n\n**Feature Depth: 4 / 5**\n\nMonday can absolutely do PM fundamentals like dependencies and critical path, but some of the more “true PM” features (milestones/critical path in Gantt) are plan-gated, and the system is more board/column-centric than project-logic-centric. \n\nExample: you *can* run a launch chain in a Gantt view with dependencies, but keeping that chain clean across lots of client boards usually turns into more setup/maintenance (columns, views, and rules per board) than in a tool that treats dependencies/approvals as core workflow primitives. \n\n**Slack Integration Quality: 3.5 / 5**\n\nThe integration supports “create items from Slack messages” and “send updates to Slack” patterns, which is the minimum viable Slack workflow. \n\nIn practice, it’s solid for notifications + capture, but not a “run the project in Slack” experience.\n\n# [**Trello**](https://trello.com/)\n\n**Ease of Use: 5 / 5**\n\nThis is the easiest tool here to get a team actually using, because it matches how people already think: “to do / doing / review / done.” If adoption is your #1 constraint, Trello is hard to beat.\n\n**Feature Depth: 3.5 / 5**\n\nGreat for lightweight workflows; less great when you need real sequencing, cross-project visibility, or lots of interdependent deliverables. Example: “Launch date is March 15 so creative must be approved by March 8” can be represented, but it’s not naturally enforced the way dependency-first tools handle it (you’ll rely more on conventions, checklists, and discipline).\n\n**Slack Integration Quality: 4.5 / 5**\n\nTrello is very Slack-friendly: create cards from Slack, preview links, and save Slack messages into Trello (including an Inbox flow). \n\nExample: a client drops feedback in a Slack thread - you can turn that message into a card immediately, then the PM sorts it to the right board/list later. \n\n# [**Todoist**](https://www.todoist.com/)\n\n**Ease of Use: 5 / 5**\n\nFast, clean, and extremely low friction. People will actually use it - but mostly for *their own* tasks.\n\n**Feature Depth: 2.5 / 5**\n\nTodoist is excellent for personal productivity and light coordination, but it’s not a full team PM system (limited portfolio reporting, dependencies, multi-stage approvals, capacity planning). Example: it’s great for “rewrite homepage headline by Thursday,” weak for “manage a 30-asset campaign launch with reviews, handoffs, and client approvals.”\n\n**Slack Integration Quality: 3.5 / 5**\n\nVery good at capture: you can convert Slack messages into Todoist tasks via the message menu, and complete tasks from Slack via /todoist. \n\nBut it won’t give you a shared “project heartbeat” inside Slack - it’s more “turn Slack into a personal inbox.”\n\n# [**Airtable**](https://www.airtable.com/)\n\n**Ease of Use: 3 / 5**\n\nAirtable is easy to *use* once built, but harder to *design* well. Most teams need an owner (ops/PM) to keep the base clean, otherwise it becomes “power-user magic” that nobody else touches.\n\n**Feature Depth: 5 / 5**\n\nThis is the most flexible system here: you can model clients, campaigns, assets, revisions, approvals, and link them together like a database. Example: one campaign record can relate to 40 deliverable records, each with status, owner, due date, and client approval state - that’s Airtable’s superpower.\n\n**Slack Integration Quality: 3 / 5**\n\nThe native Airtable ↔ Slack story is mainly “send updates/notifications into Slack via Airtable automations” plus link previews - not “turn Slack messages into structured records” out of the box. \n\nExample: “when status changes to ‘Needs client approval,’ post to #client-approvals” is straightforward, but the actual work still lives in Airtable.  \n\n# [**Slack Lists**](https://slack.com/blog/news/introducing-slack-lists)\n\n**Ease of Use: 4.5 / 5**\n\nIt’s native to where your team already works, so adoption is naturally higher than any external PM tool. Example: you can turn a message into a list item and keep the context in the same channel/thread instead of asking people to “go update the PM tool.” \n\n**Feature Depth: 2.5 / 5**\n\nLists cover the basics well (task, status, assignee, due date, custom fields, subtasks), but they’re still “lightweight tracking,” not full project management. \n\nExample: you can track a launch checklist and assign owners, but you won’t get the same depth as Asana/Monday around dependency graphs, portfolio-level management, workload/capacity, advanced reporting, or complex multi-project governance - and you can hit list size limits (e.g., 1,000 items on Pro/Business+; higher on Enterprise) that external tools don’t typically constrain in the same way. \n\n**Slack Integration Quality: 5 / 5**\n\nIt *is* Slack, so the integration is perfect and everyone already has access.\n\nYou can also add automation via Workflow Builder (e.g., remind assignees about upcoming/overdue tasks, or post periodic status digests into a channel), which is exactly what a Slack-first team usually needs.  \n\nMy one complaint is that the tabs of Lists, Canvasses, pinned comments etc. can become a little messy and disorganized.\n\n# Dev Tools\n\nI included these for completeness but really Linear and Jira are meant for developer teams (which isn’t us).\n\n# [**Linear**](https://linear.app/)\n\n**Ease of Use: 4.5 / 5**\n\nLinear is opinionated and fast - most teams can be productive quickly because the workflow is largely “pre-decided” (issues + projects + cycles). Example: you can convert a Slack message into an issue in a couple clicks, and it can keep a synced thread so stakeholders stay in Slack while work progresses. \n\n**Feature Depth: 3.5 / 5**\n\nDeep for *software execution* (issues, projects/roadmaps, cycle planning), but less of a general “team PM swiss army knife” than Asana/Monday. \n\nExample: Linear excels at “track bugs + ship features” workflows, but if you want highly customized approval stages per client, elaborate request-intake forms, or heavily tailored reporting for non-technical stakeholders, you’ll feel the limits of its intentionally simpler model.\n\n**Slack Integration Quality: 4.5 / 5**\n\nOne of the best “Slack capture → real tracking” integrations: create issues from Slack messages, keep comment threads synced both ways, and post channel updates (including notifications driven by custom views). \n\nExample: a client drops a bug report in #client-acme - you create a Linear issue from that message and the Slack thread stays synced as the issue gets updated/closed, so your account team doesn’t need a Linear account just to stay in the loop. \n\n# [**Jira**](https://www.atlassian.com/software/jira)\n\n**Ease of Use: 2.5 / 5**\n\nJira is powerful but heavy - it’s easy for creative/ops teams to bounce off because there are many concepts (issue/work types, workflows, fields) and the UI assumes process maturity. \n\nExample: two teams can have totally different “Done” definitions because workflows are configurable - great for control, bad for adoption if your team just needs “track work without ceremony.” \n\n**Feature Depth: 5 / 5**\n\nIf you need enterprise-grade process control, Jira is top tier: configurable workflows, rich work categorization, and hierarchy (work items → epics → broader planning), plus advanced planning/roadmapping for multi-team programs. \n\nExample: you can enforce that “Client Approval” cannot move to “Scheduled” unless required fields are filled and an approval step happened - Jira can make that policy unskippable, whereas lighter tools rely more on human discipline. \n\n**Slack Integration Quality: 4 / 5**\n\nJira’s Slack app is legitimately capable: notifications, link previews, and the ability to interact with work items from Slack (assign, transition, comment) and create work items from Slack messages/threads. \n\nExample: you can keep a channel subscribed to updates for a Jira project and let teammates transition an issue (e.g., “In Progress” → “In Review”) directly from Slack without opening Jira. \n\nThe catch is adoption: even with strong Slack controls, Jira only works if your team buys into Jira-style process and hygiene.\n\nIf I missed any big ones let me know and I'll add it",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/projectmanagement/comments/1r7dr5i/project_management_tools_ranked_comparison_table/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o5wlh8d",
          "author": "AutoModerator",
          "text": "Attention everyone, just because this is a post about software or tools, does not mean that you can violate the sub's 'no self-promotion, no advertising, or no soliciting' rule.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/projectmanagement) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-17 18:09:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5x0t2o",
          "author": "Menium",
          "text": "What about: Microsoft Teams + Microsoft Planner + Loop + Whiteboard",
          "score": 14,
          "created_utc": "2026-02-17 19:19:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5xecx9",
              "author": "jpreddituser1",
              "text": "Sorry, since we use Slack I excluded everything Teams related. Maybe someone using Teams can do an equivalent analysis",
              "score": 1,
              "created_utc": "2026-02-17 20:23:54",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5wtozv",
          "author": "kwanbix",
          "text": "I stoped reading at \"trello feature depth 5\".",
          "score": 9,
          "created_utc": "2026-02-17 18:46:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5x63we",
              "author": "jpreddituser1",
              "text": "Ah, that was a typo in the table. It was listed as 3.5 in the actual writeup, fixing now.",
              "score": 1,
              "created_utc": "2026-02-17 19:44:53",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5x9zo9",
                  "author": "kwanbix",
                  "text": "Now it makes more sense.",
                  "score": 2,
                  "created_utc": "2026-02-17 20:03:02",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5x9803",
          "author": "DaaashZhang",
          "text": "So this is a pure software project team I suppose?",
          "score": 9,
          "created_utc": "2026-02-17 19:59:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5wx1zn",
          "author": "PplPrcssPrgrss_Pod",
          "text": "Very nice list. I would add ServiceNow to this. Not as much for the project level features, but for the portfolio and program level visibility and resource planning.",
          "score": 3,
          "created_utc": "2026-02-17 19:02:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5x0vl3",
              "author": "MichaelLynch13",
              "text": "We use ServiceNow for PM but would love to know how to use it for portfolio / resource management as we’re really struggling. Would appreciate any help as we find it so difficult to use! Thanks",
              "score": 2,
              "created_utc": "2026-02-17 19:20:18",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5wvs6a",
          "author": "chaipglu28",
          "text": "jira assessment is spot on. Great for dev teams but getting marketing to use it is painful. The slack integration is closer to 3.5 than 4 because even though it works, nobody actually uses it.",
          "score": 2,
          "created_utc": "2026-02-17 18:56:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5wvwn5",
          "author": "JosephPRO_",
          "text": "How much of the slack integration scores are based on actual usage vs what they claim? I've found these integrations look great but fall apart in practice. Notifications become overwhelming fast.",
          "score": 2,
          "created_utc": "2026-02-17 18:56:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ww273",
          "author": "cafefrio22",
          "text": "Did you look at ClickUp? Seems like it would fit between Monday and Asana. Also what's your team size? That matters a lot for which tool makes sense.",
          "score": 2,
          "created_utc": "2026-02-17 18:57:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5xdsf5",
              "author": "jpreddituser1",
              "text": "Didn't look at ClickUp because they're really positioned as a Slack replacement moreso than a Slack add-on. That said you're probably right since I'm pretty sure a lot of people use ClickUp and Slack (and ignore ClickUp's chat features).",
              "score": 1,
              "created_utc": "2026-02-17 20:21:09",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5yucqk",
          "author": "eastwindtoday",
          "text": "Solid breakdown. The one gap I keep running into with all of these is that none of them solve what happens between the ticket and the code, especially once agents are doing the execution. Linear comes closest for dev teams but it still treats the spec as a comment field.\n\nCurious what kind of team you're evaluating for, happy to share what we landed on if it's relevant.",
          "score": 2,
          "created_utc": "2026-02-18 00:48:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5ywiq0",
              "author": "jpreddituser1",
              "text": "We're pretty cross-functional including a bunch of client-facing roles, not dev-focused. Curious what you found though!",
              "score": 1,
              "created_utc": "2026-02-18 01:00:59",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5z1xxu",
          "author": "walkietokie",
          "text": "I see some using smart sheets, what is your take on this?",
          "score": 2,
          "created_utc": "2026-02-18 01:29:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5zh2iq",
              "author": "Ezl",
              "text": "I like smar sheets more than any of those I’ve use for project management (asana, Monday and the like). Jira isn’t a project management tool, it’s a task management tool so I’m not sure what’s going on there.\n\nI like Monday, asa, etc. for higher granularity tracking for portfolio management , etc.",
              "score": 1,
              "created_utc": "2026-02-18 02:49:04",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5wlhad",
          "author": "AutoModerator",
          "text": "Hey there /u/jpreddituser1, there may be more focused subreddits for your question. Have you checked out r/mondaydotcom or r/clickup for any questions regarding this application?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/projectmanagement) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-17 18:09:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5wmpzg",
              "author": "jpreddituser1",
              "text": "Not sure if i'm supposed to reply to automod lol, but just in case: I actually did post this to r/Slack already a few weeks ago and thought it would be relevant here too. Hopefully there isn't much crossover between the subreddits, I thought there wouldnt be.\n\nI don't think this is super relevant for tool-specific subreddits since this is a tool comparison chart, and people in those subreddits are probably mostly already committed to a specific tool.",
              "score": 0,
              "created_utc": "2026-02-17 18:14:56",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5wq2hr",
          "author": "Material_Doctor9612",
          "text": "Surprised Blocpad didn't make the list — we switched to it a couple months ago and it's been solid for cross-functional project tracking. Modern UI, handles dependencies well, and the team actually adopted it without the usual resistance. Might be worth adding to the comparison.",
          "score": 1,
          "created_utc": "2026-02-17 18:30:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5xdiz0",
              "author": "jpreddituser1",
              "text": "Will take a look!",
              "score": 1,
              "created_utc": "2026-02-17 20:19:56",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5ww84w",
          "author": "Bulky_lenda_",
          "text": "This is helpful. The feature depth vs ease of use tradeoff is real. We use monday and the \"every board configured differently\" problem is legit.",
          "score": 1,
          "created_utc": "2026-02-17 18:58:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5z9gdr",
          "author": "nborders",
          "text": "All project management devolves to a spreadsheet and a presentation.",
          "score": 1,
          "created_utc": "2026-02-18 02:07:34",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r1zc7c",
      "title": "(User based Recommendation) Apps that I’m using in 2026",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1r1zc7c/user_based_recommendation_apps_that_im_using_in/",
      "author": "anonymous5090",
      "created_utc": "2026-02-11 14:48:52",
      "score": 26,
      "num_comments": 17,
      "upvote_ratio": 0.91,
      "text": "New year so figured I'd share the tools that actually stuck around after trying way too much stuff last year. These are the ones I genuinely use not just installed once and forgot about.\n\n* Claude directly in the app for quick scripts. Faster than spinning up a project for something I'll run once.\n* n8n for automations. I know a majority of you have used this. Self hosted it and forgot about it which is exactly what I want.\n* Thinklistapp with their AI features for docs. Not groundbreaking but having everything in one place matters. Helps alot when it comes to executing tasks daily. Although it's a paid app, and I could potentially do the same thing with ChatGPT.\n* Langsmith for tracing LLM calls. Saved me so many times when something breaks and I need to see what happened. \n\nWhat tools survived your 2025 culling? ",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/projectmanagement/comments/1r1zc7c/user_based_recommendation_apps_that_im_using_in/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o4t29qr",
          "author": "AutoModerator",
          "text": "Attention everyone, just because this is a post about software or tools, does not mean that you can violate the sub's 'no self-promotion, no advertising, or no soliciting' rule.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/projectmanagement) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-11 14:48:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ujrzt",
          "author": "Available-Budget-735",
          "text": "This is all for project management?",
          "score": 5,
          "created_utc": "2026-02-11 19:01:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4thn4o",
          "author": "Consistent_Voice_732",
          "text": "Langsmith-style LLM tracing is a game changer-wish I used it sooner  ",
          "score": 2,
          "created_utc": "2026-02-11 16:03:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4tt0qo",
          "author": "Comfortable-Garage77",
          "text": "Gpt for the win, but now gradually switching to gemini. Also use grammarly extensively for my writing and saner to manage my tasks via chat. But that's all, all roads lead to Google sheet finally lol",
          "score": 1,
          "created_utc": "2026-02-11 16:56:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o51nxqo",
          "author": "More_Law6245",
          "text": "OP I have a question, so what skills are you learning in the advent you suddenly don't have systems at your disposal? \n\nAs a program director I'm starting to witness PM's skills coming up short because they have become too reliant on systems or tools, they come unstuck because they have either forgotten or they didn't learn underlying project management principles",
          "score": 1,
          "created_utc": "2026-02-12 20:40:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o522dag",
          "author": "erilysse",
          "text": "Notion for managing my todolist, projects and OKRs.\n\n\nI'm currently trying to make some task easier so using Claude Code and n8n yes. (For data analysis, and automatic reminders for people so i don't have to remind each month everyone what's they're accountable for). \n\n\nI could not use it but I try to understand the cases where it could be useful and where It's not. Like being less in AI FOMO and more in.. knowing what' it's actually capable?\n\n\nM365 is always there lurking in the shadows for some easy collaborative work (I'm in a tech-adverse company).",
          "score": 1,
          "created_utc": "2026-02-12 21:48:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o544da6",
          "author": "Fantastic-Nerve7068",
          "text": "Celoxis is the one platform that’s still holding strong in my stack. It’s not flashy but ridiculously reliable for cross team project visibility, resource capacity planning and actual delivery tracking without me babysitting everything. Bonus points for the built in timesheets and reporting I don’t have to manually build every week.\n\nAlso still using Notion for internal docs and meeting notes (paired with an AI summary agent now), Slack for team comms, and Raycast for speeding up damn near everything on the Mac.\n\nChopped a lot of “productivity” stuff last year that turned out to be more aesthetic than useful. What stayed either automates something painful or keeps my team moving without me needing to micromanage it.",
          "score": 1,
          "created_utc": "2026-02-13 05:12:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4t46k8",
          "author": "subtlesub29",
          "text": "🤮🤮🤮🤮🤮",
          "score": -3,
          "created_utc": "2026-02-11 14:58:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4t5oiy",
              "author": "Suspicious-Camera489",
              "text": "Do you think you can manage to elaborate your comment a bit more?",
              "score": 1,
              "created_utc": "2026-02-11 15:06:18",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4wywiq",
                  "author": "karlitooo",
                  "text": "Because it’s spam: https://www.google.com/search?q=thinklistapp+%22anonymous5090%22+site:www.reddit.com&sca_esv=04aa8d85dd72ea04&rlz=1CDGOYI_enGB771GB771&hl=en-GB&prmd=ivsn&sxsrf=ANbL-n7kSso3x1jOorfybwPcyBUnWevYPg:1770864084554&sa=X&ved=2ahUKEwiG_9Hl9tKSAxXgumMGHZQ6IwMQrQJ6BAggEAY&biw=375&bih=634&dpr=3",
                  "score": 2,
                  "created_utc": "2026-02-12 02:42:13",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o5e0si3",
                  "author": "subtlesub29",
                  "text": "https://techpolicy.press/how-ice-uses-ai-to-automate-authoritarianism",
                  "score": 1,
                  "created_utc": "2026-02-14 19:30:16",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4u49it",
          "author": "Smooth-Trainer3940",
          "text": "Never heard of Thinklistapp, seems cool. I might check it out. I use Text Blaze instead of n8n and it works well enough for me. Thanks for sharing!",
          "score": 0,
          "created_utc": "2026-02-11 17:49:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4u3k15",
          "author": "Papyrusblack",
          "text": "ChatGPT for content strategy \nOboard OKR software for goal tracking\nBase44 for spinning up apps to solve my unique problems\nGoogle Docs for everything note taking",
          "score": -1,
          "created_utc": "2026-02-11 17:46:11",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r2i6fs",
      "title": "Tough stakeholders- how to work with difficult people?",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1r2i6fs/tough_stakeholders_how_to_work_with_difficult/",
      "author": "apfrkf",
      "created_utc": "2026-02-12 03:03:53",
      "score": 19,
      "num_comments": 13,
      "upvote_ratio": 1.0,
      "text": "I need some help to figure out this situation. \n\nFor context: I am a newer PM- 3 years in project coordinator role, and coming up on 6 months as a PM in a new company and a new industry. \n\nI work with an engineer who is their own worst enemy and stresses themselves out to the max because they’re “overworked”. I don’t doubt they have a lot of work that could be done, but he’s actively managing a lot less work than other coworkers of similar skills/tenure. He also publicly talks badly of his boss, and anyone else around him that doesn’t give him slack.  He’s in general unwilling to communicate his problems to find a resolve and doesn’t seem able to manage his time or emotions. \n\nI have been slowly onboarding into the role, primarily assisting with other projects currently underway and recently received my first three full time projects. Along with projects I also work on quoting future projects for labor and materials. \n\nThe issue is due to the aforementioned engineer being his own worst enemy, he tends to mail things in without looking into them as he should. Now, my PMO team I’m now working with is not a strong PMO team and also has been stretched thin over the last year. They haven’t been checking bill of materials like they should leading to a surge of internal (ie non-billable) request forms being filled out for replacement materials.\n\nI happened to catch over 30 missing items on a BOM for a repeat build, that was missed on the BOM. AND- it was also missing on the previous BOM from the same engineer. Why? Because he didn’t review the change request forms from the previous project. \n\nHe’s now very upset with me that I dared bring this up and actually asked him to fix the issue, and not continue to kick the can down the road. He tried to continue to kick the can down the road, but I had a hard deadline and eventually had to loop in his boss. The boss he hates. \n\nQuestion posed: how do you work with stakeholders who are their own worst enemies/ don’t get things done? I fear he’s the kind of worker who will not improve ever- so, building a relationship with him and giving him tools may not be effective. I’m okay with not being liked by him. He’s not especially likable to be honest. However, I worry him expressly disliking me will harm his ability to get work done. Advice? Thoughts?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/projectmanagement/comments/1r2i6fs/tough_stakeholders_how_to_work_with_difficult/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o4x2j0c",
          "author": "AutoModerator",
          "text": "Attention everyone, just because this is a post about software or tools, does not mean that you can violate the sub's 'no self-promotion, no advertising, or no soliciting' rule.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/projectmanagement) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-12 03:03:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4xk1se",
          "author": "Neither_Cover_4330",
          "text": "What I've learned over the years is that we are actually dealing with people, not robots. And these people all have feelings about yiu, your project, their workload, the company... everything. And those feelings can impact the project work.\n\nWhat's worked for me is that I \"mirror\" what I hear from them - to make them feel understood and to gain trust and a path to a successful working relationship. I usually try to get them on their own, and I'll start off with something like, \"So, Bob, how do you feel about our project? How do you feel about what you'll have to deliver?\" Notice I didn't ask him what he THOUGHT, but how he FELT. I take the time and give them the space to gripe... and I listen.\n\nI've learned a lot from people when I do this. One guy's coworker had quit, and he was trying to figure out fhow to juggle all the extra work. One young, new supervisor was a real bltch, and I found out it wss her first project, and she was afraid of failing because it had a lot of visibility.\n\nAnd then I let them know that I'm concerned - that I'm worried about them. And I ask them if they see any way I can help. Sometimes I can (maybe help get an additional resource assigned or create an extra report to track the project, for example). But I communicate that I care about their issues.... and that I know we both want the project to go well. And I ask them how I can help.\n\nI do this on a continuous basis throughout my projects. I keep asking people how thet FEEL, because that's a much better barometer of how things are going than if you ask them what they THINK. You'll hear that they're stressed or overworked or whatever, but your job is to assist however yoh can and to BUILD TRUST. Trust gains cooperation. If people like you, that gains cooperation, too.\n\nIt's a really rare thing that I have to bring out the \"big guns.\" I really don't need to. And if you polish your skills on how to build trust, how to develop relationships, and how to help people solve THEIR problems (not just have them solve yours) your projects will be much more successful.\n\nGood luck.",
          "score": 22,
          "created_utc": "2026-02-12 05:04:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4zo162",
              "author": "Wild_Instance_1323",
              "text": "good pm are good parents.",
              "score": 8,
              "created_utc": "2026-02-12 15:00:34",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o50pvot",
                  "author": "Soggy-Car-4548",
                  "text": "Yes. Parenting has been excellent prep for project management and management in general. As a parent, I learned quickly to identify root causes of issues where a stakeholder (child) is unable or unwilling to articulate the problem while screaming and crying in public. Adults that are difficult or melting down trigger my automatic slowdown and soften responses where I focus on listening and learning what the human needs. At the end of the day, empathy is the bridge. (FWIW, empathy is a trait that AI will not be replacing any time soon.)",
                  "score": 3,
                  "created_utc": "2026-02-12 17:59:11",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o4zxnj2",
              "author": "nborders",
              "text": "This is the way.  \n\nBut I would also keep your supervisor abreast of your plans. Good ones will back you up.",
              "score": 4,
              "created_utc": "2026-02-12 15:47:20",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o5c6atx",
              "author": "EatTheRich0",
              "text": "Best advice on this thread. Some of the most effective PM/Engineer relationships I’ve built over the years started at a very unproductive place. From my personal experience, anyone can be “flipped”, if you meet them where they are and work outwards. A skill that pays huge dividends.",
              "score": 3,
              "created_utc": "2026-02-14 13:41:31",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o51ld04",
          "author": "More_Law6245",
          "text": "The reality of being a project manager is that you can't be worried about what people think of you and over the years I have worked with many people as you have described and being in IT it would be fair to say when it comes to engineers you get to deal with some big egotistical personalities, especially when you start working in the enterprise space.\n\nThe way I approach these types of situations is I first have an informal 1:1 meeting and discuss the impact of their behaviour and how they affect project delivery (I always have supporting facts to highlight, so to not make it or have it perceived as an personal attack) what you outline is the impact of their behaviour and outline their responsibilities. You need to convey your expectation of what is and isn't acceptable behaviour to you as  you're the person who is responsible for delivering the project.\n\nYour next step if there is no change to the behaviour is to document and present to their immediate manager, highlight the impact of the individual's behaviour (again with verified facts) but this is where you start outlining the type of costs the project is incurring e.g days lost, time lost, additional unscheduled project costs but where you focus in on is the organisational reputational risk to the company and how this individual behaviour passes through to the client.\n\nIf you still don't get any assistance in the management of the unacceptable behaviour then you need to escalate through to your project board, sponsor or executive. This is the drawback from a PM perspective, because you don't own the resource you can't HR manage the individual. All you can do is highlight the unprofessional behaviour and the risks and impact of the individual's behaviour. Based upon my experience over the years sometimes you do need to have to have confrontation or conflict resolution management intervention, for me I'm sure as hell not going to be held accountable for someone's unprofessional behaviour but that's a \"me thing\". I've been around the block a few times and to be honest I refuse to accept behaviour like this because I have been really impacted in the pasts because of this type of behaviour and If I had the same attitude as a PM, I wouldn't be very successful and be out of a job very quickly, so why is this individual getting a hall pass?\n\nHere's a reflection point for your consideration, do think that it's fair that this individual isn't held accountable for their actions and you are as the PM? This comes down to the fundamental management skill, holding people accountable for their actions and to be perfectly honest I hold CEO's down to project support staff accountable because that is MY responsibility as a PM.  Good luck and I hope things work out for you.\n\nJust an armchair perspective",
          "score": 8,
          "created_utc": "2026-02-12 20:28:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5447dn",
          "author": "Fantastic-Nerve7068",
          "text": "yeah it’s rough dealing with someone who refuses accountability and punishes others for holding the line but here’s the thing your job isn’t to make everyone happy it’s to make sure the work gets done right especially when timelines and budget are on the line\n\nwhat helped me in a similar spot was treating these folks like unstable systems keep documentation tight escalate through the right channels early not emotionally just factually and always bring things back to impact not blame like “we missed 30 items which delayed production by x days and cost us y” not “you screwed this up again”\n\nalso build alignment with their boss whether or not they dislike each other because if leadership supports your clarity it gives you air cover to do your job you’re not there to babysit you’re there to deliver and if someone’s consistently undermining that let the record show it\n\nyou might not fix him but you can build enough structure that his chaos doesn’t wreck your ship good luck fr you're handling this better than most new PMs would",
          "score": 9,
          "created_utc": "2026-02-13 05:11:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4x9au2",
          "author": "choclatelabguy",
          "text": "Are you in the AV industry by chance?",
          "score": 1,
          "created_utc": "2026-02-12 03:47:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o52syx0",
              "author": "apfrkf",
              "text": "Audio visual? I am not.",
              "score": 1,
              "created_utc": "2026-02-13 00:11:12",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5cpua2",
                  "author": "wm313",
                  "text": "Are you in the controls industry? This sounds like controls engineers.",
                  "score": 2,
                  "created_utc": "2026-02-14 15:33:31",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1r4vo72",
      "title": "What are the methodologies you mostly use in project management?",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1r4vo72/what_are_the_methodologies_you_mostly_use_in/",
      "author": "Ok_Contribution_5709",
      "created_utc": "2026-02-14 20:55:37",
      "score": 12,
      "num_comments": 35,
      "upvote_ratio": 0.82,
      "text": "1. Alright So I’ve worked in smaller scale startups and we’ve usually used Waterfall or Agile. How often do you all use the other methods like Lean, SAFe, LeSS, XP etc?\n\n2. In your daily speaking, how much textbook jargon is actually used in daily language?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/projectmanagement/comments/1r4vo72/what_are_the_methodologies_you_mostly_use_in/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o5h4x23",
          "author": "H0moludens",
          "text": "Never in my life has any single framework held up for long. In the end it is a mixture of ma y of those, which propagate the same thing with different terminology. \n\nI try to pick the most effective parts of what i currently need and get the team onboard. Keep it simple. ",
          "score": 13,
          "created_utc": "2026-02-15 08:03:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ehytz",
          "author": "Unicycldev",
          "text": "Honestly over time: none. \n\nThe agile manifesto itself says it well in its first line. \n\nIndividuals and interactions over process.",
          "score": 11,
          "created_utc": "2026-02-14 21:02:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5ek5ed",
              "author": "UnArgentoPorElMundo",
              "text": "And tools",
              "score": 2,
              "created_utc": "2026-02-14 21:14:55",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5k1ccg",
          "author": "dakrath",
          "text": "The ones that keep me under the radar whilst delivering what needs to be delivered.",
          "score": 7,
          "created_utc": "2026-02-15 19:15:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5eizco",
          "author": "Suspicious-Camera489",
          "text": "Scrum/Lean/SAFe… it doesn’t matter at the end to me. I need to know:\n- any off days in the upcoming two weeks\n- what is left to do how from the last two weeks\n\nWe need to know what we want to achieve in this 2 weeks so we need to specify it and make sure we understand and have all info. \nPlanning/grooming/refining/stand-ups… what brings  results is what I use but over the years I cut it down to basics, specifically if you have capable teams.\nOlder I get less jargon I use.",
          "score": 6,
          "created_utc": "2026-02-14 21:08:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5ejaf1",
              "author": "Ok_Contribution_5709",
              "text": "Very helpful, thank you!",
              "score": 1,
              "created_utc": "2026-02-14 21:10:12",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5gwowb",
          "author": "SuperTed321",
          "text": "JFDI",
          "score": 6,
          "created_utc": "2026-02-15 06:45:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5h00u9",
          "author": "karlitooo",
          "text": "In all cases: Define a plan, monitor against the plan.\n\nUnder SAFe we used a lot of jargon naturally. A bit less in startups running mostly kanban-ish. Marketing agencies were pretty PM jargon heavy internally but processes way looser than they pretended.\n\nCurrently I am not using specific methodology but defaulting to lightweight wagile mostly. Low jargon environments.",
          "score": 6,
          "created_utc": "2026-02-15 07:16:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5hnmy2",
          "author": "LeChevrotAuLaitCru",
          "text": "I learned that software project management methodology is the right way to build nuclear plants, refineries, chemicals and all that. I like it when bad, incomplete scoping is rebranded as agile. \n\nTo top it off, I am confident that folks ~3 years out of college in consulting with titles program managers or directors are far better suited to know how to build such facilities than those who spent decades learning the crafts..",
          "score": 6,
          "created_utc": "2026-02-15 11:04:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5hpz4v",
              "author": "icezar1",
              "text": "O approve this message.",
              "score": 2,
              "created_utc": "2026-02-15 11:26:30",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5htmxu",
                  "author": "LeChevrotAuLaitCru",
                  "text": "Also, yelling kicking and cursing get the job done",
                  "score": 2,
                  "created_utc": "2026-02-15 11:58:59",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5jzu06",
          "author": "bjd533",
          "text": "I met my Sponsor, we had a timeline and a budget. I forget the rest.\n\nEdit - referencing the famous Walt Whitman quote about love - just realised this comment can seem a little obnoxious  without getting the (obscure?!) reference.",
          "score": 7,
          "created_utc": "2026-02-15 19:08:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5f9z7e",
          "author": "Chicken_Savings",
          "text": "Meaningless question unless you consider the industry.\n\nNobody constructs a power station following Agile principles.",
          "score": 9,
          "created_utc": "2026-02-14 23:43:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5fgh81",
              "author": "tcumber",
              "text": "Welll...about that.  \"Agile\" is really iterative Just in time (JIT) quality manufacturing adapted to software delivery.",
              "score": -3,
              "created_utc": "2026-02-15 00:23:32",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5gh9nt",
                  "author": "Logical-Bookkeeper77",
                  "text": "It’s MUCH MORE THAN THAT.\n\nPleas at least read the manifesto. It’s not that long.",
                  "score": 2,
                  "created_utc": "2026-02-15 04:35:19",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5gukkf",
          "author": "Maro1947",
          "text": "Whatever alignment the business stakeholders want\n\nI've never, ever used one single methodology in Project land\n\nConsultancies and businesses are always \"Aligned\", not locked into a methodology\n\nBeing flexible is the key",
          "score": 4,
          "created_utc": "2026-02-15 06:25:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5h4y7b",
              "author": "H0moludens",
              "text": "+1\n\nMost frameworks are made to suck money from the companies rather than providing useful support. I have seen SAfE being implemented at places that were not ready for this… you can imagine the outcome and the emotional damage of the person who sponsored safe. ",
              "score": 2,
              "created_utc": "2026-02-15 08:04:15",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5jdd13",
          "author": "c0ncept",
          "text": "My brain is hard coded in Lean just because that was the work environment I was immersed in during the early stages of my career. \n\nStill to this day, I’ll be doing something mundane at home and think to myself “oh, this is totally motion waste right now.” It’s helpful in just about anything you do, though.",
          "score": 3,
          "created_utc": "2026-02-15 17:19:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5lpabs",
          "author": "Any-Oven-9389",
          "text": "p3 express all day homey",
          "score": 3,
          "created_utc": "2026-02-16 00:38:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ehbng",
          "author": "ArpanMaster",
          "text": "Controlled breathing. Mindfulness.",
          "score": 3,
          "created_utc": "2026-02-14 20:59:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5expfy",
          "author": "cbelt3",
          "text": "Manage by walking around. Or having quick working sessions…. My meetings last LESS than 15 minutes or are via email or teams IM’s.",
          "score": 2,
          "created_utc": "2026-02-14 22:29:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5f8chh",
          "author": "PhaseMatch",
          "text": "Agility requires:\n\n\\- Theory-Y management and learning organsiation culture  \n\\- change is cheap, easy, fast and safe (no new defects)  \n\\- fast feedback from users on the value change is creating  \n  \nWithout that, it will NOT control your business risk in a lightweight way, so you should use increasingly \"heavyweight\" stage-gate project controls to prevent anyone being scapegoated for failure.  \n\nLean and agile are not alternatives;  XP draws on lean ideas (\"build quality in\");  use both.  \n  \nXP is the only really effective agile framework.  \n  \nPrior to 2010 or so \"agile\" meant \"XP\", and deals to those last two requirements. It is mainly technological in nature - if you have a legacy code base where change is expensive, hard, slow and risky then either build the need to upskill and refactor into your programme of work, or move on.\n\nScrum adds \"investing one Sprint at a time\" as a business-level risk control, to prevent sunk costs and give the option to exit the programme at any Sprint boundary.  If your can't break your programme down into mini-projects/experiments and get the stakeholders to \"Shark tank\" with you a Sprint at a time, forget Scrum and move on.\n\nSAFe, Less and the wider Kanban method are more **long term plays for organisational change than short-term product delivery approaches**.   Again, they work if you have a Theory-Y management approach and evolve, but with Theory-X and a \"transformation\" mindset they **fail in an expensive, stressful, slow and risky way.**    \n  \n**Kanban Method** \\- start where you are, agree to evolve through data-driven experiments, build leadership at all levels - is my general advice.  Create a \"pull\" from teams and management rather than \"pushing\" a method. ",
          "score": 2,
          "created_utc": "2026-02-14 23:32:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5j5k42",
          "author": "GibsonLP93",
          "text": "In my experience, everything is hybrid. Sure, some things lean more towards agile and others more towards waterfall. But at the end of the day it’s very rarely ever purely one of those disciplines. Like others have said, you just tailor the approach to the project demands. But then call it whatever the hell the sponsor wants to call it.",
          "score": 2,
          "created_utc": "2026-02-15 16:41:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5lnfgb",
          "author": "More_Law6245",
          "text": "Personally for me it genuinely depends on the the type of project and the approach that is needed which will dictate my methodology approach, being in the IT infrastructure space it tends to be predominantly waterfall but I've been known to run hybrid models to ensure that I deliver the project in the most expedited way but in a very controlled manner.\n\nWhen planning projects I always tell my project stakeholders that \"dumpster fires\" is not a preferred project methodology or framework that I prescribe to.\n\nTo be perfectly honest, if I have a fault in my project deliver is making an assumption that everyone knows PM jargon because I have been doing it for so long, I just rattle it off and think nothing of it but If I see someone who looks like there are seeing tumbleweeds passing or they kind of look like their constipated, it means I forgot that I'm using too much jargon. It's definitely one of \"my bad\" things that I do need to keep checking myself on, especially with the senior executive. To be honest it's more of a reflection on me because I'm the one that is making the assumptions.\n\nJust an armchair perspective.",
          "score": 2,
          "created_utc": "2026-02-16 00:27:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5egmwb",
          "author": "AutoModerator",
          "text": "Hey there /u/Ok_Contribution_5709, Have you looked at our \"Top 100 books post\"? Find it [here](https://www.reddit.com/r/projectmanagement/wiki/index/books).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/projectmanagement) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-14 20:55:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ghmbc",
          "author": "Logical-Bookkeeper77",
          "text": "There isn’t that much jargon in project management.\n\nExcept some easily understand things like sprints, task, dev / prod … and some industry / project  specific code names.\n\n…. In general the best method is a mix, as you usually need a waterfall style to forecast / business case drafting.\nThen you run the parts agile and update periodically.",
          "score": 1,
          "created_utc": "2026-02-15 04:38:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5j9mrb",
          "author": "PplPrcssPrgrss_Pod",
          "text": "Almost every project I've worked on is truly Hybrid. Even companies or teams that say they are all this or all that sprinkle in or dump in elements of other methodologies.",
          "score": 1,
          "created_utc": "2026-02-15 17:00:44",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r7d4o8",
      "title": "RFQs, RFPs, PE rollups, and endless delays",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1r7d4o8/rfqs_rfps_pe_rollups_and_endless_delays/",
      "author": "shampton1964",
      "created_utc": "2026-02-17 17:47:55",
      "score": 12,
      "num_comments": 8,
      "upvote_ratio": 0.88,
      "text": "The fun part of PM is the part where you lay out a schedule and a budget up front based on reasonable historicals, and then managmeent cuts out all the slack you know is necessary and two years later flogs you for being late and over budget. Because that's how so many of us got burnt out and went independent. \n\nOf lates, though, here in the USSA I'm dealing with an entirely different bullshit PITA problem. \n\nI went back and checked some notes in an ancient notebook, and confidently state that in this, the Year of Our Lord 2026, vendors take longer to respond to RFQs and RFPs than they did when we had to use telephones, FAXes, and the post office to get biz done. \n\nExample: A packaging manufacturer of specialty glass for medical devices would turn a quote request in 2 weeks in the early '90s. I'm 4 weeks out now, and they are making excuses and asking for two more weeks. \n\nExample: A custom corrugated company that I've used for a long time used to flip quotes around in 3 to 5 days. Now I'm waiting 2 weeks or 3 for the same information. \n\nExample: A material reprocessor that I've used a few times over the last ten years used to quote in 2 weeks. Now they require 4. \n\nCommon denominator: Thanks to Raygun's successful demolition of the Sherman Antitrust Act, each of the companies I mentioned has been rolled up into every larger companies and then finally merged into huge single-owner Private Equity nightmares. Ferinstance, there used to be about 50 distributors from which I could source packaging for medical devices and cosmetics. There are now 3, and for shits and giggles they've also locked the direct sourcing option out through contractual means.  \n\nIt ain't the people at the companies. They've just been reduced, right sized, reorganized, and de-skilled to the point that they can't do the job. I expect in the next round of \"efficiency\" the last skilled humans will be replaced with an AI chatbot. \n\nAnyway, my friends in China can get a complex device fully quoted in a week or two. Germany might take a few more. I'm *two* fucking months into trying to get numbers for a simple line of cosmetics. \n\nThank you for attending my TED Rant. \n\nAnybody else losing hair around these delays? \n\n",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/projectmanagement/comments/1r7d4o8/rfqs_rfps_pe_rollups_and_endless_delays/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o5xwmeq",
          "author": "RhesusFactor",
          "text": "Everything has, indeed, turned to shit. Mergers and optimisations have made all options into incapable omnishambles.",
          "score": 7,
          "created_utc": "2026-02-17 21:49:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5yiunp",
              "author": "shampton1964",
              "text": "It's a fucking shit show here. \n\nAbout twenty years ago I had meetings w/ some nice people in S. Korea. They said, to paraphrase, \"America is turning into a nation of lawyers and accountants. China is a nation of engineers. Korea is a nation of merchants. How much longer do you think your systems will last?\" ",
              "score": 3,
              "created_utc": "2026-02-17 23:45:37",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5yvvo3",
                  "author": "RhesusFactor",
                  "text": "Where did I hear that recently... [https://www.lowyinstitute.org/the-interpreter/china-vs-america-dan-wang-his-sceptics](https://www.lowyinstitute.org/the-interpreter/china-vs-america-dan-wang-his-sceptics)\n\n[https://www.penguin.co.uk/books/465161/breakneck-by-wang-dan/9780241729175](https://www.penguin.co.uk/books/465161/breakneck-by-wang-dan/9780241729175)",
                  "score": 2,
                  "created_utc": "2026-02-18 00:57:22",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5ymnny",
          "author": "14erMustClimbAll",
          "text": "Holy shit this resonates so much with me. But my damn leadership team still thinks everything with suppliers should take a couple days max.",
          "score": 3,
          "created_utc": "2026-02-18 00:06:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5yzph4",
              "author": "shampton1964",
              "text": "Yup. \n\nMy clients expect things to work they used to. And ... fml ... no amount of evidence gets them to understand that THOSE WERE THE GOOD OLD DAYS. ",
              "score": 1,
              "created_utc": "2026-02-18 01:18:07",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5zfuh4",
          "author": "west-egg",
          "text": "Even as recently as pre-COVID, I feel like things were easier. Vendors & contractors weren't stretched so thin, and for the most part followed through on promises. Now I feel like I spend all day every day just chasing people around for stuff. ",
          "score": 1,
          "created_utc": "2026-02-18 02:42:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5wh0fg",
          "author": "AutoModerator",
          "text": "Hey there /u/shampton1964, Have you looked at our \"Top 100 books post\"? Find it [here](https://www.reddit.com/r/projectmanagement/wiki/index/books).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/projectmanagement) if you have any questions or concerns.*",
          "score": 0,
          "created_utc": "2026-02-17 17:48:41",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r6t4fp",
      "title": "Help!! One month in & drowning",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1r6t4fp/help_one_month_in_drowning/",
      "author": "Motogirl247",
      "created_utc": "2026-02-17 01:59:08",
      "score": 11,
      "num_comments": 7,
      "upvote_ratio": 0.87,
      "text": "I’m currently on my first project management rotation. The extent of my knowledge involves a handful of Coursera courses and assisting with small projects. My org sees how driven I am to get things done.. but I feel like I’m in way over my head.\n\nThere’s a lot of pressure on everyone to consolidate teams and re-structure in multiple regions. I spent the first month mapping out the plan and lining up the logistics for a soft launch that’s kicking off this week. Now they want me to map out the entire timeline through the full end-state. I’m basically both the program AND project manager. My team consists of 3 people that aren’t PM’s.. and have other responsibilities and can help as needed.\n\nI tried asking what their goal is for the full rollout, and they half jokingly said “yesterday”. In addition to keeping track of this pilot, I need to figure out a timeline dependent on other teams for:\n\n\\- A hefty overhaul of procedure updates (est 6 months)\n\n\\- New routing & skill creation (roughly 6 weeks)\n\n\\- Communication plan (March)\n\n\\- Training for both internal & vendors\n\n\\- Forecasting headcount\n\n\\- Partnering with HR to discuss posting a req and planning interviews for existing employees in the org\n\nWhat’s a realistic timeframe to accomplish all of this considering my limited support?\n\nAny advice in general to help me get through this?",
      "is_original_content": false,
      "link_flair_text": "General",
      "permalink": "https://reddit.com/r/projectmanagement/comments/1r6t4fp/help_one_month_in_drowning/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o5syu68",
          "author": "Hungry_Raccoon_4364",
          "text": "Okay… question: where did u get the phases, tasks to “map things out”. Did you gather requirements? Did you talk to SMEs. As the PM your job is not to “come up with the plan” your job is to get the “team to come up with the plan”, you document, gather estimates and from there come up with your artifacts… implementation plan, timeline, etc…. I say this because I am in IT and every PM that “maps things out” on their own has zero team confidence and misses in all fronts… remember, you are not doing this alone. \n\nHow do I know what I am talking about? I am managing a tech refresh project for 5 hospitals and 60 medical office buildings in preparation for an Epic implementation.",
          "score": 14,
          "created_utc": "2026-02-17 03:25:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5t77y8",
              "author": "Motogirl247",
              "text": "Yes, in partnership with a senior manager, I gathered the requirements of what they wanted to accomplish during the first 30-60 days of the soft launch.. and the workflow variables we would be testing in two different regions. In the process, I mapped out the 60-day timeline of milestones factoring in employee roundtables to gather feedback and assess what to start, stop, continue as we refine the workflow for the broader rollout. I communicated the request for managers to gather our initial round of 20 employees, sent out communication regarding what to expect during the soft launch and upcoming training. \n\nSo far, I’ve been solely focused on this quick turnaround time for the soft launch, I haven’t had time to partner with other teams on timeline variables other than the 6-week routing estimate.",
              "score": 2,
              "created_utc": "2026-02-17 04:20:43",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5tn0lm",
          "author": "fineboi",
          "text": "Sounds like you should lean on your team.  Discuss the main deliverables and ask the team the milestones needed to reach each deliverable.  Add in a discussion on risk and issues.   N you will be halve way there.",
          "score": 9,
          "created_utc": "2026-02-17 06:20:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5smnor",
          "author": "EchoedPost",
          "text": "Sounds like you have limited foundation. \n\nChatGPT is your new best friend.  Good Luck",
          "score": 6,
          "created_utc": "2026-02-17 02:10:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5tqwke",
              "author": "LeChevrotAuLaitCru",
              "text": "I was going to say.. OP should just copy paste the whole question to chatgpt and add.. “give me a framework. where should I start?”",
              "score": 1,
              "created_utc": "2026-02-17 06:54:22",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5vezl9",
                  "author": "Motogirl247",
                  "text": "Thank you! I have been using ChatGPT a lot lately, but didn’t think to use it for the entire framework piece. I think i was focusing too much on trying to have an exact timeline instead of a rough projection.",
                  "score": 1,
                  "created_utc": "2026-02-17 14:40:03",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1r5lpqc",
      "title": "Project Expediting… what is it?",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1r5lpqc/project_expediting_what_is_it/",
      "author": "Balvin_Janders",
      "created_utc": "2026-02-15 18:17:22",
      "score": 8,
      "num_comments": 21,
      "upvote_ratio": 0.9,
      "text": "Hi there (hey mod! I read the rules and I hope you’d allow this post)\n\nI am a project planning and control professional. I may jump to a managerial promotion in another organization soon.\n\nThe title is “Project Expediting Manager”.\n\nTo be honest, I’ve been salivating over leadership roles for awhile. But as an engineer who takes pride in their chops and the hard work done to earn a degree and deliver safe and cost-effective results; I CRINGE and DETEST administrative roles and doing follow up for a living!\n\nEven in PM, I go out of my way to review drawings, technical proposals, mfg schedules etc…\n\nTLDR: what is “project expediting”? Am I just following up over emails and the phone with suppliers?\n\nEdit: I believe this is project MRO material expediting. Not project scope expediting.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/projectmanagement/comments/1r5lpqc/project_expediting_what_is_it/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o5oqq4s",
          "author": "PplPrcssPrgrss_Pod",
          "text": "Less details focused. More team flow enablement.",
          "score": 3,
          "created_utc": "2026-02-16 14:23:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5js6kn",
          "author": "LeChevrotAuLaitCru",
          "text": "Expediting in my usual old ways is procurement expediting ie literally tracking and chasing vendors for equipment and material delivery..\n\nAlso these days companies tend to tag on the word manager to everything… ends up nobody does nothing since everyone just strokes the dicks to their right (or left)",
          "score": 2,
          "created_utc": "2026-02-15 18:31:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5jswf0",
              "author": "Balvin_Janders",
              "text": "Lol… anything technical? Do you work your brain at all at expediting (not to offend anyone who is in it)?",
              "score": 1,
              "created_utc": "2026-02-15 18:34:41",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5jucko",
                  "author": "LeChevrotAuLaitCru",
                  "text": "I think things are only technical if you’re actually interested and curious to learn what the hell it is you’re expediting. That unfortunately becomes your homework outside of work hours.. once you know what you’re expediting and, if you have access to read any relevant engineering documents or vendor documents or gannt chart or payment milestones, among others, only then you can put two and two together and understand why your job is so important.\n\n(Hint: the seasoned Project directors, project managers, project engineers and engineering managers know the pain of this job since they also had to deal with it expediting themselves when they did their own projects…)",
                  "score": 1,
                  "created_utc": "2026-02-15 18:41:40",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5k5kms",
          "author": "Magnet2025",
          "text": "I consider expediting projects in a couple of ways: \n\n1. Speed up delivery (projects) by examining each element of the project to determine gaps, funnels and roadblocks and designing process solutions to streamline the project. \n\n2. Jumping into a project that is considered “troubled” and figuring out the fastest and most efficient/least cost solution to fix the project and hit the triple constraint. Or at least two of them. \n\n3. When a troubled project continues to devolve, then it can take drastic action to fix it, lest the project becomes “failed” and you risk customer relationships. This is when the original PM begins to reconsider professions and the team realizes that “evenings and weekends” are coming up. Sometimes people say that this is when you “crash” a project. Crashing a project is very intensive review of all ongoing and any remaining tasks to find opportunities to make the work get done faster. Bringing in more people, cutting tasks that risk project success, bringing in cots. Usually referred to as a “death march” project. \n\nI’ve done the first two and they can be fun challenges. I’ve been involved in a death march but not as project management (thank God). It isn’t fun. It isn’t pretty. I got fired over a conference call when I pointed out that a project was hitting the lacing of boots part of a death march. Luckily, the PM (who was a contractor - always a bad sign when you are *undertaking the single largest project the company has taken on, impacting sales, delivery and billing*) didn’t have the authority to fire me. \n\nIt sounds as if you have the right combination of technical skills, PM skills and desire to be successful.",
          "score": 2,
          "created_utc": "2026-02-15 19:36:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5noqb9",
              "author": "Balvin_Janders",
              "text": "It’s mote like a project material expediting… does that really mean following up with suppliers?",
              "score": 2,
              "created_utc": "2026-02-16 09:45:02",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5re4g7",
                  "author": "Magnet2025",
                  "text": "I think that if your supply chain is effecting performance, then yes it does. If a late delivery or incomplete delivery from a supplier causes a delay then you can either include some contingency time in the schedule or you work with procurement have them work with the supplier to establish specific delivery criteria that is to be met or the supplier will suffer financial penalty.",
                  "score": 1,
                  "created_utc": "2026-02-16 22:00:11",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5n5m0g",
          "author": "wittgensteins-boat",
          "text": "Leadership is administration.   \nManagement is administration.   \nYour concerns are mutually exclusive, not wanting to do administration and desiring to be leadership.",
          "score": 2,
          "created_utc": "2026-02-16 06:46:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5nbdxu",
              "author": "Balvin_Janders",
              "text": "Surely you see a difference between a document controller and a design manager",
              "score": -1,
              "created_utc": "2026-02-16 07:38:38",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5npro9",
          "author": "WhiteChili",
          "text": "in most orgs, expediting is basically making sure stuff shows up when it’s supposed to. that means chasing suppliers, tracking fabrication, clearing bottlenecks, and flagging delays before they hit site.\n\nimo it’s less about reviewing drawings and more about schedule pressure and coordination. if you hate follow-ups, be honest with yourself… expediting is structured follow-up with teeth tbh.",
          "score": 2,
          "created_utc": "2026-02-16 09:54:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5nvadu",
              "author": "Balvin_Janders",
              "text": "Let me ask you directly: would I feel like I wasted an engineering degree if I took this job? Or would I be utilizing my engineering knowledge? Abd if so, how?",
              "score": 1,
              "created_utc": "2026-02-16 10:46:08",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5nwrne",
                  "author": "WhiteChili",
                  "text": "i would say, you won’t waste it, but you won’t use it the same way.\n\nyou won’t be designing or deep in calculations, but your engineering background helps you spot unrealistic lead times, understand fabrication risks, read schedules properly, and challenge suppliers when something smells off. you know what good expeditors aren’t just chasing emails, they know what 'late' actually means technically.",
                  "score": 2,
                  "created_utc": "2026-02-16 10:59:19",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5oaeo4",
          "author": "Oldandveryweary",
          "text": "It’s like Captain Picard says to his number 1- ‘make it so’.",
          "score": 2,
          "created_utc": "2026-02-16 12:47:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5jqgxy",
          "author": "Old_Cry1308",
          "text": "sounds like a lot of chasing and following up to me. might want to brace yourself for those admin tasks.",
          "score": 1,
          "created_utc": "2026-02-15 18:22:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5jypid",
          "author": "SVAuspicious",
          "text": "I'm a turnaround guy which is called expediting in some places. I consider it walking into a dumpster fire on purpose. Often the big problems don't have clear causes until you get into the details so I spend a lot of time in working level reviews. \n\nDepending on your scope expediting could be figuring out why some IT roll out is stalled by a vendor hardware delivery. Not much technical detail there. A team that has broken down because the new DSP imaging remote sensor is clearly way behind but all the PM metrics look good. Lots of process AND lots of technical detail there. Very often with big problems even when process is the issue you have to get in the technical weeds to fix the process so it addresses the need. ",
          "score": 1,
          "created_utc": "2026-02-15 19:02:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5mx4ao",
          "author": "iamright_youarent",
          "text": "I’m in the same spot. the position is to willfully dive into a hellfire and try to save any salvageable assets.  should call it a project rescue special force or something but that implies the project is fxxked and no one wants to acknowledge that lol.   \n \npositions like this are valuable and have job security cuz most people rather quit from the projects with undesirable outcomes.  stakeholders can worry less as there’s a dedicated person to do what they might do to expedite the projects.",
          "score": 1,
          "created_utc": "2026-02-16 05:34:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5np30d",
              "author": "Balvin_Janders",
              "text": "I think it’s project material expediting. Which in itself asks the question: is it just follow up and nagging? Or do you actually apply engineering skills?",
              "score": 1,
              "created_utc": "2026-02-16 09:48:24",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5tdbup",
          "author": "Huge_Brush9484",
          "text": "Short answer, yes, a big part of project expediting is follow-ups, but it is a lot more operationally critical than it sounds on paper.\n\nIn most orgs, expediting sits between procurement, vendors, and project delivery. You are tracking long-lead materials, fabrication progress, documentation, inspections, and shipment timelines. The goal is to make sure what the project needs shows up when it is supposed to, not three weeks after the crew is already mobilized and burning cost.",
          "score": 1,
          "created_utc": "2026-02-17 05:04:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5uq0p5",
          "author": "Fantastic-Nerve7068",
          "text": "Yeah you’re pretty much on the money expediting in this context usually refers to making sure materials or equipment show up on time, especially for MRO or capital projects. It’s not about accelerating the *scope* or project delivery in the broader PM sense. It’s vendor follow ups, checking on manufacturing progress, shipping timelines, customs holds, all that good stuff.\n\nIn reality, a lot of expediting is glorified chasing. Calling suppliers, reviewing logistics trackers, resolving weird delays like 'the crate was missing a customs form' or 'paint wasn’t dry before shipping.' It’s essential work, especially in capital heavy industries where a late valve or skidded unit can hold up a big commissioning date, but it’s rarely glamorous.\n\nThat said, if the role is manager level, it might give you visibility into supply chain risk at the portfolio level and let you build influence across engineering, procurement, and construction. Could be a decent stepping stone if you want to climb the PM ladder but still want to stay close to execution. Just don’t expect a lot of technical depth in the day to day it’s much more about persistence, logistics fluency, and communication.",
          "score": 1,
          "created_utc": "2026-02-17 12:11:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5l64xe",
          "author": "pmpdaddyio",
          "text": "The terms are \n\nCrashing, meaning adding additional staff to the team to finish the effort. This can work when you aren’t trying to make a baby in a month with 9 women. \n\nFast tracking means to remove extraneous tasks and run the others in sequence. Essentially doing more with less.",
          "score": 0,
          "created_utc": "2026-02-15 22:46:22",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r5fz3s",
      "title": "How to see the detailed inside of mega projects / huge film sets?",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1r5fz3s/how_to_see_the_detailed_inside_of_mega_projects/",
      "author": "Hydrozy",
      "created_utc": "2026-02-15 14:29:04",
      "score": 7,
      "num_comments": 7,
      "upvote_ratio": 0.82,
      "text": "I know there is probably nowhere something like this out there, but imagine a full-detailed documentary of even the hiring process of a film, the post-production — what they edit and why — and even what the editors had to learn.\n\nShort looks into every single step and what is required when producing, for example, movies like Avatar or how Tesla Gigafactories work.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/projectmanagement/comments/1r5fz3s/how_to_see_the_detailed_inside_of_mega_projects/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o5ih3yv",
          "author": "LameBMX",
          "text": "https://youtube.com/@animagraffs?si=tbyM9x8P_HsUOJ1u\n\nfor a few megaproject builds.",
          "score": 2,
          "created_utc": "2026-02-15 14:38:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5il79z",
              "author": "Hydrozy",
              "text": "Hm, I searched for animagraffs project management / megaprojects but could not find much. Would you be so kind and post an example?",
              "score": 1,
              "created_utc": "2026-02-15 15:00:18",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5ih7tk",
          "author": "Old_Cry1308",
          "text": "try checking out behind-the-scenes featurettes on blu-rays or dvds. sometimes they have more details.",
          "score": 2,
          "created_utc": "2026-02-15 14:38:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5igi9v",
          "author": "Total_Literature_809",
          "text": "About movie production I can talk a little bit better. It’s hard to find in depth material, but for me the best example are the ~14h of documentaries showing how The Lord of the Rings was made. \n\nLord of the Rings was the best example of a project with a huge scope, limited budget and no understanding if there would be a return on investment.",
          "score": 1,
          "created_utc": "2026-02-15 14:34:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5ilxlf",
              "author": "Hydrozy",
              "text": "Thanks! Do you mean this playlist? https://m.youtube.com/playlist?list=PLRzqXH8K0HzHLIkb6g9PcXtaKBpFpomPB",
              "score": 1,
              "created_utc": "2026-02-15 15:04:12",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5isr5x",
                  "author": "Total_Literature_809",
                  "text": "Yup. This one. It came from the DVD/Blu-ray, but they are AMAZING",
                  "score": 1,
                  "created_utc": "2026-02-15 15:38:55",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5ogysr",
          "author": "EAB04",
          "text": "Yeah I always wonder about this- when I see the credits of big films it blows my mind how many different studios / people are involved",
          "score": 1,
          "created_utc": "2026-02-16 13:29:38",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r72klv",
      "title": "Cross functional team coordination through Slack is why projects run late",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1r72klv/cross_functional_team_coordination_through_slack/",
      "author": "Ok-Strain6080",
      "created_utc": "2026-02-17 10:32:44",
      "score": 7,
      "num_comments": 14,
      "upvote_ratio": 0.82,
      "text": "PM coordinating between engineering, design, marketing, and sales. Each team has their own channels, their own tools, their own processes. Slack is the only common denominator so that's where cross functional coordination happens. And it's a disaster.\n\nLaunch requires engineering to finish the feature, design to create launch assets, marketing to write messaging, sales to train on positioning. Each team is managing their part in their own tools (Jira, Figma, HubSpot, Salesforce) but the dependencies between teams all live in random Slack threads.\n\nDesigner says \"waiting on final specs from engineering\" in Slack. Engineering finished specs yesterday but posted in a different channel. Designer doesn't see it, asks again 3 days later. Engineering is like \"we already posted it\" but now they have to re-explain where. Meanwhile marketing is blocked waiting on assets from design.\n\nThe handoffs between teams are where everything falls apart because Slack is terrible for tracking dependencies. Everyone is doing their part but nobody has visibility into the critical path so we don't realize we're off track until the launch date arrives and we're not ready.\n\nTried using project management software but getting 4 different teams to all maintain the same tool is impossible. Engineering wants Jira, design wants Notion, marketing wants Asana. So PM tool becomes my personal tool that nobody else touches.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/projectmanagement/comments/1r72klv/cross_functional_team_coordination_through_slack/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o5ue547",
          "author": "AutoModerator",
          "text": "Attention everyone, just because this is a post about software or tools, does not mean that you can violate the sub's 'no self-promotion, no advertising, or no soliciting' rule.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/projectmanagement) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-17 10:32:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5w0iuy",
          "author": "painterknittersimmer",
          "text": "Slack is not the source of truth. Pick a tool and commit to it. IT will be grateful to pay for fewer subscriptions and manage less overhead. Use a spreadsheet if no one can agree on anything. ",
          "score": 7,
          "created_utc": "2026-02-17 16:26:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5y5sgy",
          "author": "eastwindtoday",
          "text": "The \"getting 4 teams into one tool\" thing is a trap. I wasted months on that. Nobody switches off what they already use, and you end up maintaining a board only you look at.\n\nWhat actually helped was giving up on that and focusing on making the handoffs not need Slack in the first place. Biggest one was specs. If the spec is thorough and lands in Jira before anyone asks for it, half those threads don't happen because nobody's waiting on clarification that should've been there from the start.\n\nThe rest I still haven't figured out honestly. If anyone's cracked cross-functional visibility without forcing a single tool I'd love to hear it.",
          "score": 7,
          "created_utc": "2026-02-17 22:34:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ujfmh",
          "author": "Significant_Pop_6543",
          "text": "I’ve got no advice but came to say it’s the same at my work and I hate it. Except instead of slack, it’s Teams. I spend 50% of my time chasing updates across multiple channels and platforms and then providing updates on the updates. It’s so dumb. But the pay is decent and I WFH so I stay.",
          "score": 5,
          "created_utc": "2026-02-17 11:19:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5um125",
          "author": "Maro1947",
          "text": "You need structure. Whether it is stand-ups or status update meetings until the chaos is brought under control.....you need to get your key Stakeholders to agree and support this \n\nOtherwise, walk away, there is usually no middle ground",
          "score": 7,
          "created_utc": "2026-02-17 11:40:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5uthi9",
          "author": "Kempeth",
          "text": "I am not seeing this \"cross functional team\" you're alluding to in your post title.\n\nBy your own admission you don't have that. You have 4 silo'd teams all doing their own thing in their own tools with zero fucks given to the overall outcome.\n\nThis isn't a tool-problem. This is a nobody-talking-to-each-other-problem.",
          "score": 9,
          "created_utc": "2026-02-17 12:35:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5vv99m",
          "author": "Erocdotusa",
          "text": "I use Jira (or tool of your choice) as my source of truth and create deliverables for different departments. Host regular status meetings to get updates and document what is needed / what is blocked. Assign to engineering when ready.",
          "score": 3,
          "created_utc": "2026-02-17 16:00:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5uoxsm",
          "author": "Daisy_InAJar",
          "text": "Status meetings. As the PM, let the PM tool be yours if it keeps you aware of the timeline and dependencies. Outline clear owners & make owners accountable - “Engineering Sue, when X is done, notify Designer Bob and me, this will need to be complete by 2/16 to stay on track.” \n\n“Designer Bob, Sue delivered X, confirm receipt. You need to complete X by 2/20, notify Marketing Alex and me when complete” \n\nAnd update your plan as each thing is complete & handed off to the next.",
          "score": 2,
          "created_utc": "2026-02-17 12:03:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5v4hqh",
              "author": "cbelt3",
              "text": "THIS. In a split up silo project your project is suffering from “over the transom engineering”. Some of us have been doing this before computer based tools, and even know what a transom window is.\n\nThe PM Is the integrator. It’s a key part of the role. You can fight and demand organizational change, or just stand in the middle, grab your conductors baton, and direct the orchestra .",
              "score": 6,
              "created_utc": "2026-02-17 13:42:50",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5uz4gj",
          "author": "Narrow-Employee-824",
          "text": "We use chaser for cross functional work. Tasks live in the Slack channels where teams coordinate so engineering sees design dependencies, design sees marketing dependencies, etc. Way better visibility into the critical path.",
          "score": 1,
          "created_utc": "2026-02-17 13:11:47",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r3qwxj",
      "title": "Genuinely Curious! Did the AI change anything about the project manager's fundamentally responsibility? If yes, how?",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1r3qwxj/genuinely_curious_did_the_ai_change_anything/",
      "author": "Ok_Jello9448",
      "created_utc": "2026-02-13 14:41:21",
      "score": 6,
      "num_comments": 20,
      "upvote_ratio": 0.75,
      "text": "We keep hearing that using copilot or Claude helps me write my emails, or create decks faster. I get it. But beyond creating reports, emails or decks, how did AI change the fundamental responsibility of the Project Manager - i.e herding a group of disjointed people and departments and make them work towards 1 single goal.? if it did for you, how? I am reflecting on this myself but would love to hear others opinions as well. ",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/projectmanagement/comments/1r3qwxj/genuinely_curious_did_the_ai_change_anything/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o58hsf7",
          "author": "sinistar914",
          "text": "Being a PM is alot like being a juggler - you need to keep a lot of balls up in the air and they have to keep moving. If you drop one you need to pick it up and get it moving again. Sometimes the balls are going to drop into a pile of poop and you dont want to pick it up but you have to. If you dont keep the balls up in the air noone is going to pickup the ball for you.  If you are a really good juggler you will make it look easy but its really years of study and practice that make you a bad ass juggler. I dont ever see AI being a responsible juggler. The question that you didnt ask - does AI help us do our jobs? Absolutely, but everything still needs to be checked and vetted with current AI models. In addition, I have been spending time building up my prompts to get AI to do what I need it to do. AI is another tool in my tool belt currently and it is definitely helpful. ",
          "score": 12,
          "created_utc": "2026-02-13 21:29:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o592ptz",
              "author": "Ok_Jello9448",
              "text": "Yes. PMs have balls of steel 😄",
              "score": 5,
              "created_utc": "2026-02-13 23:19:27",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o56aj5m",
          "author": "Old_Cry1308",
          "text": "ai tools are just faster at the busywork. still need a human to herd the cats and keep things moving.",
          "score": 5,
          "created_utc": "2026-02-13 15:04:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o56ay6l",
              "author": "Ok_Jello9448",
              "text": "Agreed!",
              "score": 1,
              "created_utc": "2026-02-13 15:06:35",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o56f03g",
          "author": "Aggravating_Hippo546",
          "text": "If anything, it gives me more time to focus on actual project success, caring for the team and ensuring they do their work, having hard conversation, etc. by eliminating my busywork. I do utilize it to give me a start for the risk conversation/development, as it can usually pull some stuff out of my project documents.",
          "score": 3,
          "created_utc": "2026-02-13 15:26:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o56kax9",
              "author": "Ok_Jello9448",
              "text": "This is a great perspective.  Can you share your tool stack and the system in place to make the management a bit easier?",
              "score": 1,
              "created_utc": "2026-02-13 15:51:53",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o58hr11",
          "author": "More_Law6245",
          "text": "Interesting statement but AI by the very defnition can't change a project manager's responsibilities, AI is only a tool to support a project manager in the delivery of their project. As an example if you had AI create a project schedule and it goes horribly wrong? Who is responsible for it? The project manager who used it? Was it the organisation's for implementing the mandatory use of AI or do you blame an inanimate coded program? How do you explain that one to a client? Not a very professional look to be conveying of the company. \n\nI find project managers are relinquishing their responsibility to technology yet others voice concerns that it's taking their over their livelihoods. AI is a tool to support the PM, not take on the PM's responsibilities. ",
          "score": 3,
          "created_utc": "2026-02-13 21:29:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5dvdac",
          "author": "hippydidoda",
          "text": "Project manager role is to heard cats.  AI will only take away make easier the repetitive task of taking and writing minutes. Cat Hearding no computer can do.",
          "score": 3,
          "created_utc": "2026-02-14 19:02:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5ghxgv",
              "author": "Logical-Bookkeeper77",
              "text": "This. Although some “projects” like application development, the process can be simplified, but not the PM aspect except finding rooms and sending regular message and minutes whatnot.",
              "score": 1,
              "created_utc": "2026-02-15 04:40:28",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o57r84i",
          "author": "AldronProjectLab",
          "text": "Good question.\nFor me, AI hasn't changed the PM's fundamental role and responsibility, but it has changed the speed at which I get certain things done.\nIt helps me write better and faster, and structure thoughts and reports. But the real work remains creating alignment where it isn't there, managing tensions, dealing with ambiguity, and all the other power that requires soft skills.\nAI can support the form, but the substance (people, conflict, pressure) is still entirely ours.",
          "score": 2,
          "created_utc": "2026-02-13 19:17:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o58fplx",
          "author": "agile_pm",
          "text": "When you say AI, which type are you talking about?\n\n* Generative AI - planning, documentation, communication, analysis\n* Agentic AI - monitor tasks and risks, notifications, workflow automation\n* Predictive AI - forecasting and estimating things like delivery dates, cost overruns, and workload bottlenecks\n* Prescriptive AI - scenario modeling, resource allocation recommendations\n\nSome project/work management tools have some of these built-in and some of these are standalone.  But the real question is... \"Does any of this change anything about the project manager's fundamental responsibilities?\"\n\nI'm leaning toward no.  Enhance deliverables?  Sometimes.  Make some things easier?  Sure.  Change my core responsibilities as a project manager?  That might be a bit of an overstatement.  At least for now, at most companies.\n\nUsed together, they can help you with executive framing, tradeoff analysis, making decision-making easier, etc., which can, eventually, lead to more responsibility and possibly even promotion.  This is advisable even if the opportunities aren't there with your current employer.  What will likely have more impact on a project manager's fundamental responsibilities is changing leadership's attitude toward project managers and what they expect from them.  Once this expectation is changed, the bar is effectively raised.  Until then, the project manager is assuming greater responsibility that the organization might need, but hasn't granted, yet.",
          "score": 2,
          "created_utc": "2026-02-13 21:19:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o566zdw",
          "author": "yarffff",
          "text": "The only thing AI has changed for me is note taking in meetings and revising emails. I am not sure we are at the point where AI is going to fundamentally change project management, maybe in a few years when we have real AI rather than LLMs.",
          "score": 2,
          "created_utc": "2026-02-13 14:46:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o57gcpi",
              "author": "Stebben84",
              "text": "It can do much more than notes and emails. I can draft charters, come up with project plans, develop risk mitigation strategies, create executive summaries, do data analysis, and much more. It still takes vetting, but tasks that could take me a day, two or even more, take an hour or two. \n\nDid it fundamentally change? Not sure yet, but it saves me so much time to focus on the people part and less on the busy, administrative work.",
              "score": 1,
              "created_utc": "2026-02-13 18:25:06",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o56smmv",
          "author": "Coneptune",
          "text": "Project management is all about communication and that is where I would say AI can fundamentally change a PMs responsibilities. It allows you to work effectively with highly variable and unstructured data. In practice this means less friction when trying to get information out of the team. \n\nFor example, AI can extract the data you need from the teams own reports, written notes, meeting minutes, emails, etc and output in the format you need as a PM. So the team just has to do a quick review of the generated output, saving hours and they will appreciate that you are meeting them where they are. \n\nThat is just the beginning though. Most projects are well defined workflows and that means you can can automate end to end using multi-agents. That was the first thing I built with AI (a system that builds a complete project plan from a charter) and I haven't looked back since. ",
          "score": 1,
          "created_utc": "2026-02-13 16:31:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o56wwaf",
              "author": "Ok_Jello9448",
              "text": "Oh this is great. Do you mind sharing a bit more about your system or show me how it works?",
              "score": 1,
              "created_utc": "2026-02-13 16:51:20",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o57a6py",
                  "author": "Coneptune",
                  "text": "Sure, search for \"proagentic\" there is a free public version. \n\nFastest way to start is to click on customise button on one of the template projects, generate a charter and then start the project. It will create 8 PM plan dashboards in about a min. Once dashboard are generated there is an agent mode where you can ask for project info and agile mode which is my attempt at an \"agile converter\" and more\n\nPS - It is built as a SaaS product, but not commercialising it.  It is actually more of a side project on steroids.  \n\n\n  ",
                  "score": 3,
                  "created_utc": "2026-02-13 17:55:52",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1r7dtms",
      "title": "Working with technical teams",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1r7dtms/working_with_technical_teams/",
      "author": "Low-Illustrator-7844",
      "created_utc": "2026-02-17 18:11:34",
      "score": 5,
      "num_comments": 20,
      "upvote_ratio": 1.0,
      "text": "Does anyone experience issues when understanding what actions are required from the client when discussing overall project progress with your internal teams?\n\nThey start talking at 1000miles per hour and don't explain exactly what they need properly. I don't want to look clueless but sometimes I have ask them to peer review whatever important emails I am sending to my customer. They often say everything is fine even in a joint call and then right after the email is sent i get a message from them saying we need to be more specific or that maybe something was missing.\n\nIt's quite a common - and frustrating- trend when i speak to technical people.\n\nDo you have the same problem? If yes, how do you handle this?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/projectmanagement/comments/1r7dtms/working_with_technical_teams/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o5wt3wc",
          "author": "bstrauss3",
          "text": "Cultivate a \"native guide\" -- somebody friendly you can ask to 'splain things. May cost you beers after dinner or deliveries of donuts. Cheap price to pay.",
          "score": 3,
          "created_utc": "2026-02-17 18:44:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5wveg3",
          "author": "Unicycldev",
          "text": "Your goal should be to identify key technical mentors and get up to speed on areas you need to focus on as soon as possible. \n\n\nI rarely have met good project managers who don’t come a place of strong technical chops. Even if they don’t have the knowledge initially, they have demonstrated the capabilities to get up to speed quickly when engaging technical experts. \n\nIn the same way we wouldn’t claim a silicon hardware project manager be responsible for wedding event project, there exists key expertise pre-requisites to lead projects.",
          "score": 4,
          "created_utc": "2026-02-17 18:54:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5x2y53",
          "author": "Immediate-Actuator85",
          "text": "gotta ask questions or clarification.  what i say is \" Ok in plain english you want to,,,,,\" and have them confirm it",
          "score": 4,
          "created_utc": "2026-02-17 19:30:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5yr4y0",
          "author": "fineboi",
          "text": "Keep asking questions until you understand the answer.",
          "score": 3,
          "created_utc": "2026-02-18 00:31:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5wnu1k",
          "author": "woahwoahwoah28",
          "text": "I don't have that exact problem. But I have faced the similar struggle of not grasping all the technical terms.\n\nI will either ask while meeting or seek clarity from the group. If it's extremely complex, I typically identify a \"point person\" who is an expert--not a high level exec. But someone with enough knowledge to explain who has also indicated they are patient. \n\nThen have them explain terminology or workflows offline. That way I don't hold up meetings but I do get necessary information for deliverables to be the best they can be.",
          "score": 3,
          "created_utc": "2026-02-17 18:19:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5wu1fy",
              "author": "Low-Illustrator-7844",
              "text": "good call. I think i'm just mostly afraid that my credibility as a leader might get affected if i have to get them to explain things 😢",
              "score": 1,
              "created_utc": "2026-02-17 18:48:22",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5ww6jt",
                  "author": "woahwoahwoah28",
                  "text": "I will often phrases like \"since you're the expert.\" Or \"this isn't my field of expertise so I want to rely on your knowledge to make sure we're conveying this correctly.\" \n\nIt helps build rapport in my experience because you're paying them a compliment, acknowledging they know more than you, and asking for help. \n\nAnd if it's any consolation, I've rarely found that folks expect the PM to be the SME on anything beyond PM activities.",
                  "score": 3,
                  "created_utc": "2026-02-17 18:58:09",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o5wzmbc",
                  "author": "teramu",
                  "text": "Trust me, your credibility as a leader will be much better if you admit your limitations and don’t pretend to know what you don’t know! I agree with identifying people who are able to help you offline, just takes developing some relationships. Is it possible to develop templates for specific situations so depending on the meeting you have a framework to work off of and can then just run it by the technical team?",
                  "score": 2,
                  "created_utc": "2026-02-17 19:14:20",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5x1f5y",
          "author": "jthmniljt",
          "text": "Don’t be afraid to ask questions until you understand. Don’t feel lost but in order to do your job so everything you need. Also upload transcripts to ai and ask it questions. That’s been a game changer to me.",
          "score": 3,
          "created_utc": "2026-02-17 19:22:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5x1ob5",
              "author": "Low-Illustrator-7844",
              "text": "True! AI has been a life saver for me at times.",
              "score": 1,
              "created_utc": "2026-02-17 19:24:02",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5yokm2",
          "author": "ttsoldier",
          "text": "If I don’t understand something technical, I will ask the developers for clarification. I rather look “stupid” infront the devs than embarrass the entire company (especially if the client has a technical background ). Sometimes if I think I understand but not 100% sure I’ll paste my email to the devs and ask them to read it and let me know if it makes sense. Sometimes they say it’s good and sometimes they tweak it. \n\nThe more projects we do the more up to speed I get on the jargon but I know my limitations and there are some things that I know I’ll never truly be able to understand. Eg I’ve been in meetings where devs are sharing the code base and rattling out things to each other. Way out to my pocket.",
          "score": 3,
          "created_utc": "2026-02-18 00:17:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5wxtot",
          "author": "bluealien78",
          "text": "This is why strong technical acumen is *required* to be effective in managing technical projects. Time to renew that Udemy subscription and get up to speed.",
          "score": 2,
          "created_utc": "2026-02-17 19:05:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5wyty1",
              "author": "Low-Illustrator-7844",
              "text": "The problem isnt the general technical knowledge, it's more to do with how the company i work for deliver and implement or own software. Our onboarding and technical documentation is horrendous, and several newer PM have struggled with it. 😥",
              "score": 1,
              "created_utc": "2026-02-17 19:10:37",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5xkhnm",
          "author": "Awkward_Blueberry740",
          "text": "I will often get technical people to review key paragraphs or sentences from an email to make sure I'm summarising an issue correctly. I couch this as \"I'm the PM, you're the expert, I want to make sure this is accurate\". I'm not asking them to review the whole email of course, just the bit of the email where I'm summarising the technical issue into less tech speak. Sometimes they change a few words, add a thing here or there. I have found most really appreciate the collaborative approach. \n\nWhen I legit just don't understand something, I find one person I trust and ask them to teach me. In meetings, I write down words and Google them haha. \n\nI work in infrastructure and construction projects but I've moved between lots of sectors so there's no way I would know about the technical details of each and every speciality sector when I first start, like laboratories, prisons, power and transmission lines, roads, temperature controlled storage facilities etc.",
          "score": 2,
          "created_utc": "2026-02-17 20:53:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5xktye",
              "author": "Awkward_Blueberry740",
              "text": "oh and I'm not embarrassed about not knowing stuff. My job is not necessarily to know the answers. My job is to bring the right people together and to ask the right questions.",
              "score": 5,
              "created_utc": "2026-02-17 20:54:49",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5xnnoi",
                  "author": "Low-Illustrator-7844",
                  "text": "I think that's where im having issues. Im happy to be honest about my lack of knowledge but the lack of internal documentation really makes self-learning a challenge.",
                  "score": 1,
                  "created_utc": "2026-02-17 21:08:20",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5zfmdw",
          "author": "MealZealousideal9927",
          "text": "i’ve seen this a lot, especially when the technical team is deep in the details and forgets the client only needs the next clear action, not the whole backstory. the pain is real because you’re the one accountable for the message, but you’re translating in real time. what’s helped me is building a simple habit into the workflow, before any client email goes out, i ask them to state in one or two plain sentences what exactly the client needs to decide, approve, or deliver next. not a summary of the project, just the specific action. then i’ll draft the email around that and read it back to them focusing only on the “ask.” it also helps to set the expectation that silence in a meeting means agreement on the wording, so post email edits are the exception, not the norm. over time it trains the team to think in terms of client-facing clarity. are you working mostly with engineers, or a mix of technical roles?",
          "score": 1,
          "created_utc": "2026-02-18 02:41:00",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r6z4cr",
      "title": "Not the PM but PM Duties",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1r6z4cr/not_the_pm_but_pm_duties/",
      "author": "minawu",
      "created_utc": "2026-02-17 06:57:57",
      "score": 4,
      "num_comments": 7,
      "upvote_ratio": 0.75,
      "text": "I've been supporting a project with a new PM. I have experience managing larger projects and was managing the team and workload with the agreed upon understanding that they would be taking back the project management duties. I've tried to hand back the project several times over calls and conversations but the PM continues to give excuses why they will not assume the role and responsibilities on their own project. To further complicate the issue, we share a supervisor and I'd like to maintain a good working relationship with all parties, but I'm growing frustrated.\n\nHas anyone encountered this, or have advice on how I should address the issue? ",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/projectmanagement/comments/1r6z4cr/not_the_pm_but_pm_duties/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o5uop1n",
          "author": "buildlogic",
          "text": "This is a boundaries problem dressed up as a workload problem, the PM isn't taking over because there's no cost to not taking over while you keep catching everything. Have one direct conversation where you name a specific handoff date, put it in writing, and then actually stop catching the ball after that date, because no supervisor meeting will fix what a clear boundary can.",
          "score": 4,
          "created_utc": "2026-02-17 12:01:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5vn1yp",
          "author": "pmpdaddyio",
          "text": ">I've tried to hand back the project several times over calls and conversations\n\nThat is not the way to hand over a project. You run a full status report, baseline your schedule, make sure all of your documentation and PPM artifacts are up to date. You write up a final handover roadmap, then set up a project handover call. Invite your shared leadership and formally turn it over. If he balks, it's an issue for leadership.",
          "score": 3,
          "created_utc": "2026-02-17 15:20:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ts7d9",
          "author": "empyrean1",
          "text": "What's your role in this project, and what is your role in the company?\n\nAlso, was the PM set as the dedicated PM of the project? If yes and he's not taking ownership then you need to let your manager / project stakeholder know since, beside affecting your capacity, they'd be expecting the PM to be the point of contact for the project.",
          "score": 2,
          "created_utc": "2026-02-17 07:05:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5tthpq",
              "author": "minawu",
              "text": "I'm new to the company and am just another of the staff level members. As part of the project, I act in a more senior support staff role. The PM is the dedicated PM. I'll discuss it with my manager.",
              "score": 0,
              "created_utc": "2026-02-17 07:17:33",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5u47g8",
          "author": "Outrageous-Pizza-66",
          "text": "I see two paths here:\n\n1) you can continue to assume the duties, likely not getting credit for them or worse yet, having the named \"PM\" get all the credit.  This is good for experience, but does little for your resume.\n\n2) you can escalate this to your supervisor or leadership team.  You should have some proof of the duties, what you've accomplished, a RACI Matrix would be helpful here for your duties and the PM duties.  This path assumes you will want to become the new and real PM.  Be prepared for some conflict, and potential hurt 'feelings', as the named PM may not necessarily relinquish control of the project. ",
          "score": 2,
          "created_utc": "2026-02-17 08:58:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5vlgco",
          "author": "bstrauss3",
          "text": "I'm sorry, you need to contact X, they're the PM.\n\nSay it, email it, remind your supervisor.\n\nNow depending on your relationship with your joint supervisor I might say to them \"If X ain't doing the PM job, why the AF are we paying them?\"",
          "score": 2,
          "created_utc": "2026-02-17 15:12:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5unhvi",
          "author": "Fine_Design9777",
          "text": "What is the industry & what tasks are they handing off to you?",
          "score": 1,
          "created_utc": "2026-02-17 11:52:34",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r31boh",
      "title": "How do you make tamplate for specification document and what should one contain?",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1r31boh/how_do_you_make_tamplate_for_specification/",
      "author": "doli-loli",
      "created_utc": "2026-02-12 18:30:42",
      "score": 4,
      "num_comments": 10,
      "upvote_ratio": 0.75,
      "text": "I am begginer PM and I have a task to make specification document that team for development will fill out with specification. Does this document have to contain introduction, pitpos of the document. I don't know what I should type in this document myself. \n\nIt shouldn't be onepager or table, it has to be in depth specification.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/projectmanagement/comments/1r31boh/how_do_you_make_tamplate_for_specification/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o51e4v3",
          "author": "More_Law6245",
          "text": "As a PM you should be asking those who will be using the document and determining what information needs to be captured. This is what a PM does is leverage those people around them to help deliver something because you may or may not have the skills yourself.  This is about understanding roles and responsibilities and how to engage resources for assistance in delivering something. \n\nMaking assumption as a PM is the worst thing you can do and to be honest it wastes everyone's time and money. There is an approach that I always take, if I'm unsure I will pull something together of what I think needs to be in the document then I send it out for review and feedback, it's a quick way to get buy in from the relevant stakeholders. ",
          "score": 3,
          "created_utc": "2026-02-12 19:53:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o52idlv",
          "author": "pmpdaddyio",
          "text": "Why would you or your team develop specifications. This is entirely customer driven. It can come in the form of an RFI or RFP, or just straight up spec sheet. \n\nI think you mean requirements.\n\nBusiness requirements - mapping to the SOW or specs telling the client you understand their specs and mapping them to a business need.  Usually usually contains a problem statement, an as is, to be portion, and any understood client concerns. \n\nFunctional requirements - internal mostly where you address how it will work. Usually contains high level process info in the form of flow charts, maybe some DB schemas, etc. \n\nTechnical requirements - internal only. It’s the guts of the system. Maybe your code structure, libraries, testing scripts, etc.",
          "score": 3,
          "created_utc": "2026-02-12 23:11:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o51mvhf",
          "author": "agile_pm",
          "text": "I agree that AI can be good for templates.  Just keep in mind that you might end up with more or less than you need.\n\nIf you're a member of PMI, you can also log into [projectmanagement.com](http://projectmanagement.com) and download templates for free.  I believe these are user contributed, so don't just assume they're perfect, either.\n\nI've had a book on my shelf for years - Software Requirements, 2nd edition, by Karl Wiegers.  At the back of the book he provides a detailed specification template.  It's more than I've ever needed, but if you want a deep understanding of what can be included, it's a good reference.",
          "score": 2,
          "created_utc": "2026-02-12 20:35:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o54c7dm",
          "author": "dhemantech",
          "text": "You can find many online as a start. Adding details may help you get better answers. With “development” I am assuming IT development activities. Are you a firm providing services to external customers or do you provide IT services to other departments of your own business/organisation.",
          "score": 2,
          "created_utc": "2026-02-13 06:14:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o54q0gy",
              "author": "doli-loli",
              "text": "We provide services to external customers.",
              "score": 1,
              "created_utc": "2026-02-13 08:17:25",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o54zuh8",
                  "author": "dhemantech",
                  "text": "Someone else already mentioned it, just repeating. Many organisations who come to you will have their own templates.",
                  "score": 1,
                  "created_utc": "2026-02-13 09:50:57",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o51lrqc",
          "author": "Suchiko",
          "text": "A non exhaustive list, but: who is the customer, what are the deliverables, quality expectations, expected activities, dates, budget, who approves the spec, who are the stakeholders, who approved delivery acceptance, what is cadence of meetings?",
          "score": 1,
          "created_utc": "2026-02-12 20:30:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5inzx2",
          "author": "SinkPsychological676",
          "text": "For an in-depth specification document, it helps to include sections like an introduction, purpose, scope, detailed requirements, and any assumptions or constraints. Using a tool that guides you through these sections step-by-step can make the process smoother, especially if you want to keep the structure clear and consistent. Take a look at Rakenne for that. ",
          "score": 1,
          "created_utc": "2026-02-15 15:14:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o51dupu",
          "author": "ntufar",
          "text": "Honestly, these days if there is no template ready in the organization, I use AI. Just describe what you want to the AI tool of your choice and it will generate you a good enough template.",
          "score": 1,
          "created_utc": "2026-02-12 19:52:12",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r2oa84",
      "title": "MS Planner Goals capped at 10",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1r2oa84/ms_planner_goals_capped_at_10/",
      "author": "legitmonk",
      "created_utc": "2026-02-12 08:40:50",
      "score": 3,
      "num_comments": 8,
      "upvote_ratio": 1.0,
      "text": "I'm posting this to find out if I'm understanding this correctly. I understand that Goals on MS Planner are capped at 10; would be nice to configure this manually but they're trying to enforce focus, gotcha. But I noticed that closing out a Goal still counts towards the cap, meaning that if I closed 10 goals, I'll *still* not be able to create new Goals and will be forced to create a new Project. Is this correct? That doesn't make sense. Copilot is suggesting I take screenshots of closed Goals and then delete them. Are we cavemen",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/projectmanagement/comments/1r2oa84/ms_planner_goals_capped_at_10/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o5301wy",
          "author": "timevil-",
          "text": "I laugh in one hand (splendidly articulated btw), and cry in another as I was going to configure Goals soon. But after reading your post, I'm now leaning towards aligning with strategic goals. Ramifications for not closing goals...?",
          "score": 1,
          "created_utc": "2026-02-13 00:52:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o536vjj",
          "author": "Magnet2025",
          "text": "One of the reasons, as a  Microsoft Project Online/Server consultant, I decided to reskill as Adoption and Change Management. \n\nI had little confidence that the new tools would support PMs as much as much it would support sales.",
          "score": 1,
          "created_utc": "2026-02-13 01:33:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5469cm",
              "author": "legitmonk",
              "text": "This is sad to hear, closest to the truth are those that work within the company to promote the tools they find issues with themselves and are powerless to change it. I've been there too in another company",
              "score": 2,
              "created_utc": "2026-02-13 05:26:41",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5404ms",
          "author": "Fantastic-Nerve7068",
          "text": "yep ran into this too and it’s honestly wild that closed goals still count toward the cap like what’s the point of finishing work if the system punishes you for it moved our team to celoxis partly because of stuff like this the way it handles goals milestones and reporting is actually built for grown up project tracking not just lightweight task lists",
          "score": 1,
          "created_utc": "2026-02-13 04:41:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o54mnjr",
          "author": "Maro1947",
          "text": "Is that in advanced ?",
          "score": 1,
          "created_utc": "2026-02-13 07:46:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o54q04b",
              "author": "legitmonk",
              "text": "I went to MS documentation now to understand what \"Advanced\" entails, are you refering to the paid plan? The templates I see are different than their documentation, so I'm thinking the recent changes might still be very new and they're working on updating and improving it. I selected \"Project Manager\" which is in Preview, so assuming it's Premium but also very new. Goals appear in this template.\n\nMS Documentation: [Advanced capabilities with premium plans in Planner - Microsoft Support](https://support.microsoft.com/en-us/office/advanced-capabilities-with-premium-plans-in-planner-6cdba2aa-da06-4e08-be4c-baaa4fda17ba)\n\nhttps://preview.redd.it/pll3c4vx08jg1.png?width=1014&format=png&auto=webp&s=4da22d9b57f69144469a1efee47dec5529b18041\n\n",
              "score": 1,
              "created_utc": "2026-02-13 08:17:20",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o59l9m4",
                  "author": "Maro1947",
                  "text": "Yeah. It's premium \n\nTBH, I create a master schedule and Timeline view in Project for high level review then do my tasks allocation in Planner basic\n\nIt works really well and isn't a lot of work to maintain\n\nI generally run 3 - 10 projects this way at a time",
                  "score": 1,
                  "created_utc": "2026-02-14 01:11:19",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1r1mzad",
      "title": "Contract/RFx process mapping or flow charts",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1r1mzad/contractrfx_process_mapping_or_flow_charts/",
      "author": "GroundZer0o",
      "created_utc": "2026-02-11 03:56:55",
      "score": 3,
      "num_comments": 1,
      "upvote_ratio": 1.0,
      "text": "I'm looking for process maps or flow charts for various RFx documents. \n\nIs anybody able to share some that they currently use for RFP, RFT and RFQ? ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/projectmanagement/comments/1r1mzad/contractrfx_process_mapping_or_flow_charts/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o4saxqf",
          "author": "evangelicalfuturist",
          "text": "My partners and I have built and reviewed a lot of RFx documentation over the years on both sides of the table (buyer and supplier), and the most common gap isn’t the document itself, but the decision gates around it. \n\nAt a high level, most effective RFx processes follow a structure like this:\n\n\t1.\tDemand validation (why are we issuing this?)\n\t2.\tScope clarity checkpoint\n\t3.\tMarket engagement strategy (RFP vs RFQ vs RFT decision)\n\t4.\tEvaluation criteria definition before release\n\t5.\tStructured Q&A governance\n\t6.\tCommercial + delivery risk assessment (not just price scoring)\n\t7.\tPre-award execution feasibility review\n\t8.\tExecutive decision gate with documented assumptions\n\nThe biggest failures we see happen at steps 2, 4, and 6.\n\nIf helpful, more than happy to chat!",
          "score": 2,
          "created_utc": "2026-02-11 12:06:33",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}