{
  "metadata": {
    "last_updated": "2026-02-04 17:09:57",
    "time_filter": "week",
    "subreddit": "projectmanagement",
    "total_items": 20,
    "total_comments": 249,
    "file_size_bytes": 272973
  },
  "items": [
    {
      "id": "1qtev5a",
      "title": "Anyone here just completely faked their way into being a PM?",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1qtev5a/anyone_here_just_completely_faked_their_way_into/",
      "author": "Gandalf-and-Frodo",
      "created_utc": "2026-02-01 23:45:46",
      "score": 201,
      "num_comments": 97,
      "upvote_ratio": 0.95,
      "text": "Anyone here just completely faked their way into being a PM?\n\nOr known someone who did?\n\nHow did it go?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/projectmanagement/comments/1qtev5a/anyone_here_just_completely_faked_their_way_into/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o3666dd",
          "author": "Fantastic-Nerve7068",
          "text": "most PMs i know didn’t wake up one day fully qualified. they were a dev, analyst, ops person, consultant, whoever, and just started doing PM shaped work until the title caught up. lots of googling, copying patterns, learning in public, and quietly panicking.\n\nhow it goes usually depends on humility. the ones who survive ask dumb questions early, listen a lot, and don’t pretend they know everything. the ones who crash burn are the ones who try to cosplay confidence without doing the learning.\n\nif you feel like you’re winging it, congrats. you’re very much on the normal path.",
          "score": 104,
          "created_utc": "2026-02-02 15:40:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o38y94x",
              "author": "leighton1033",
              "text": "The only real answer here.",
              "score": 5,
              "created_utc": "2026-02-02 23:34:29",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o32fjtb",
          "author": "ReflectionAble4694",
          "text": "Everyone fakes it because it’s learning on the job through a procedural framework that is specific to each industry unless you already have direct experience working on the production line or floor. PM is hard because it’s all synthesized, soft skills of a generalist who can work in intra/interdisciplinary role on a specific task that has domain knowledge and specific skill knowledge on the production side.",
          "score": 42,
          "created_utc": "2026-02-02 00:12:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o32lq73",
              "author": "VasDifferential",
              "text": "I've \"managed\" projects in my past experiences as a scientist. Always managing and executing the scientific aspect of projects. I got hired a few months ago for my first official PM role and my 5 clients combined have a contract value close to $20M. I was astonished my manager felt confident in my abilities to fully handoff the projects to me after a month. \n\nAm I faking it? Somewhat, I ask the necessary questions to succeed. Impostor syndrome? All the time. Like you said, it's very much a learn on the job type of role. My biggest challenge is not trying to manage the scientific team because of all the gaps I identify. Escalating my concerns and providing process improvement inputs, and letting the team manage themselves.",
              "score": 9,
              "created_utc": "2026-02-02 00:46:04",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o331kji",
                  "author": "ReflectionAble4694",
                  "text": "Yeah that tracks as a management style and background. Everything in life and business start out as projects and grow into something more. I mean everyone has science projects in high school or class projects in North America, at least.",
                  "score": 3,
                  "created_utc": "2026-02-02 02:16:24",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o333yay",
              "author": "Ravintolavaunu",
              "text": "\"unless you already have direct experience working on the production line or floor.\"  \nThat's an interesting statement.   \nMy history, I knew everything from bottom up and became PM. After years and decades with a lot of projects now I changed industry. And, of course, dont know anything in the new industry from the production line or floor. Except the typical things that happen i.e. process and requirement discussions and topics.  \nDo I fake anything. No.  \nI tell people that they are the expert in doing their work, I am the expert in managing the project. If you think something wrong is going on to your tasks or role, come to me and I will clarify. With you and the respective key-user, process owner, product owner, manager, whatever needed.  \nAlways works.  \nI dont like the idea that some companies have that the PM needs to know all details of the work done by the people on the floor an needs to know everything in detail of the tool and needs to be able to program it and configer json files and whatsoever.  \nNo. I am the project manager. Not the summary of all the project members.",
              "score": 2,
              "created_utc": "2026-02-02 02:29:49",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o334oeh",
                  "author": "ReflectionAble4694",
                  "text": "Yeah, I mean yeah it depends on the people and place. That tracks.",
                  "score": 1,
                  "created_utc": "2026-02-02 02:33:54",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o33hb7w",
          "author": "pbrandpearls",
          "text": "I mean, define faked? No experience and a fake resume?   \n\nMost PMs feel like we “faked” our way in because there isn’t a clear path to PM. Just look at all the posts here asking how to become a PM, new grads wanting to be a PM, or people asking about a PM degree.   \n\nI went sales > support > people operations > management > operations management > project management. I feel like I’m fake all the time, but that path does make some sense. Everything after my support job has been “I have no idea what I’m doing haha but things seem to be working!”",
          "score": 41,
          "created_utc": "2026-02-02 03:48:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o33tubb",
              "author": "SheIsOnAStride",
              "text": "Yeah, I don't actually know any PMs that have been certified of gone to school for it. It seems like a circular path.  Every time I've asked if it's worth it or advice on how to progress my career I get a simple answer that everyone's just kind of faking it till they make it and just keep going.",
              "score": 3,
              "created_utc": "2026-02-02 05:11:18",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o35vnnv",
          "author": "Spiritual_Quiet_8327",
          "text": "I think you can if you have the following qualities:\n\n1.  Are inquisitive.\n\n2.  Are good at analytical work.\n\n3.  Do not have an ego, but do have confidence.\n\n4.  Can communicate well orally and in writing.\n\n5.  Can get all type of people to buy-in and participate in providing feedback, making the lowest level employee to the executive feel that they are being listened to.\n\n6.  Put the project above everything . . . including your own ego, and pressure from powerful stakeholders that are wrong.\n\n7.  Balance your company's and the client's best interests in a way that does not betray either one.",
          "score": 25,
          "created_utc": "2026-02-02 14:48:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o32w5p6",
          "author": "localsonlynokooks",
          "text": "Yup. Years later, the SVP of delivery told me “yeah we knew you were green and full of shit, but you had all the right soft skills and I knew we could develop you”.",
          "score": 20,
          "created_utc": "2026-02-02 01:45:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o331ksm",
              "author": "WaveEnvironmental420",
              "text": "Similar. I was hired with practically no experience into a freelance mid level pharma PM role. The man who hired me became my mentor. Ten years later, when I’d worked my way up to a Group Vice President of Delivery, I asked what on earth he’d been thinking when he hired me. He said, “I just had a feeling. And besides, you were freelance! If you were awful we could just let you go!” Lol",
              "score": 13,
              "created_utc": "2026-02-02 02:16:27",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o35yzc6",
          "author": "kreepert",
          "text": "At a certain point you realize everyone is faking it -  I think part of maturing is realizing everyone is flawed, nobody is an expert at everything, and the real winner is confident and rigorous handling of complex problems. Making a decision is something many struggle with. Being confident in that and also sharing your input and questions about a situation help everyone in the room also. The PEs sitting in the corner need examples and need to hear serious conversations and problems be solved to learn from, not only specific things but also the process. My degree is science but I grew up remodeling and flipping houses with my single mother, I got a 4 year degree but ended up in construction just because of the money. I thought I would be ill equipped and have to learn a lot, but it turns out I knew more than most of these people ever will already just growing up living in essentially a job site. I learned the processed and estimating etc, that all came easy as a stem major. The biggest skill I use every day is problem solving and just bullshitting and finding common ground with people, building relationships. The construction world is built on relationships. Build them wide and far. It's a small world and you'll always need to know a guy. Having a solid contact book is massive in this industry.",
          "score": 21,
          "created_utc": "2026-02-02 15:05:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o39w8zg",
          "author": "Banana_Ranger",
          "text": "I went from being a park ranger to PM work. Weird jump.  Public sector PM work building parks infrastructure. \n\nDidn't know everything in the interview but my strong suits was my adeptness at knowing my way around our Procurement policies and had enough \"helper\" roles with planners and PMs on projects at my sites to have barely qualified.\n\n\nLearned a LOT over the past few years and I am really enjoying this.",
          "score": 18,
          "created_utc": "2026-02-03 02:44:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o32o3w7",
          "author": "Seattlehepcat",
          "text": "I did. I was on a contract and the PM that hired me (as an analyst) quit 2 days after I started. After about a week of nothing to do I figured I'd better organize this thing and got the teams going and moving forward. About a month of doing this and I went to my boss and say, \"Hey, I've been doing the PM job for a month, why don't you just make me the PM?\" Which he did, got a 15% raise to boot. That was 2005, I've been a PM since.   \n    \nNow to be fair, I had taken the PMP boot camp a few years prior, and had also managed some construction projects, so I wasn't 100% green. But I also didn't have a HS diploma (just got my GED a couple of years ago).",
          "score": 16,
          "created_utc": "2026-02-02 00:59:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o33g90z",
          "author": "Colbymac92",
          "text": "Yup! Went from warehouse coordinator to sr. PM. it’s been 8 years since. I sit on a throne of lies. But you figure it out as you go, fake it till you make it, then one day you’re a PM I guess",
          "score": 17,
          "created_utc": "2026-02-02 03:41:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o33hdv5",
              "author": "Gandalf-and-Frodo",
              "text": "How bad/stressful was the first couple months of being a PM?",
              "score": 2,
              "created_utc": "2026-02-02 03:48:30",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o395u7f",
          "author": "pepper07",
          "text": "Completely applied for a PM role on a tropical island. Accepted for interview got  offered job.\nNow I live on a tropical island working as a PM projects up to 10m.",
          "score": 17,
          "created_utc": "2026-02-03 00:16:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o32eezj",
          "author": "DeliciousBuilder0489",
          "text": "Yup. Faked it 8 years ago to get a job and been faking it  ever since.",
          "score": 16,
          "created_utc": "2026-02-02 00:06:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o34u4od",
          "author": "Weisheit_Ape",
          "text": "As an experienced project manager I would like to say there is a reason why the PMI requires you to have certain hours of experience on the job (and some formal hours of training) before doing the certification, and it is because the PM skills are formed by experience and not by learning.\n\nYes you can read a lot about methodologies and so, but unlike hard sciences where there are natural laws, PM is more about knowing what to do in the moment and looking ahead.\n\nSo in my experience mostly all PM's have faked it till they made it. Of course you need somehow experience in the field you work for if you dont wanna look like an idiot answering basic industry questions with an unrelated topic. But once you know an industry, becoming a PM comes naturally if you are good at planning, taking accountability and manage people and their interests.\n\nSo like in ratatouille, not everyone will be a great PM, but a great PM can come from everywhere. ",
          "score": 15,
          "created_utc": "2026-02-02 10:37:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o32x8fy",
          "author": "MurkyComfortable8769",
          "text": "Yes, 5 years ago. I put in the work to learn the company's framework and have done a lot of research. I was honest with my employer from day 1. I have grown immensely in consulting since.",
          "score": 13,
          "created_utc": "2026-02-02 01:51:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o33ba7g",
          "author": "TsWonderBoobs",
          "text": "Everyone’s idea of a PM vs what an actual PM according to PMI is, are totally different. That’s why there is a PMP certification.",
          "score": 14,
          "created_utc": "2026-02-02 03:11:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o34ejkx",
              "author": "TheMyzzler",
              "text": "Or maybe it’s a difference between theory and reality instead. ",
              "score": 2,
              "created_utc": "2026-02-02 08:07:11",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o343zcw",
          "author": "Good_Posture",
          "text": "Finance degree. Worked mostly in operations. Now I'm a PM.\n\nI don't have any sort of PM qualifications, but I understand my industry from the ground up. I've plotted delivery routes. I've stood on the back of a truck and unloaded equipment. I've installed equipment. I've networked equipment. I've done troubleshooting with technicians and network engineers. I've learned softwarwe. I've spoken to CTOs and IT Managers about what they need/expect/want. I know what my own technical and IT teams are capable of because I have pretty much been in their shoes, and I know when Sales are promising the client the undeliverable because I have seen how things play out on the ground. All this before becoming a PM.\n\nI have a deep technical understanding of my industry, but the PM stuff I have just winged and learned as I go.",
          "score": 12,
          "created_utc": "2026-02-02 06:32:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o32cqls",
          "author": "modestcat",
          "text": "Faked my way? No. \n\nReframed past experience in organizational development chaos as “projects”? Absolutely. \n\nWhat do you mean by fake? Like zero related experience -> PM?",
          "score": 26,
          "created_utc": "2026-02-01 23:56:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o32d71w",
              "author": "codemstr",
              "text": "Exactly, I wasn’t labeled a PM in my past life but I managed many projects… keep in mind: a project is anything that has a start and a finish.",
              "score": 8,
              "created_utc": "2026-02-01 23:59:23",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o32drwj",
              "author": "Latter_Inspector_711",
              "text": "this is perfection lol take my \"award\" because im too cheap to put money into reddit",
              "score": 6,
              "created_utc": "2026-02-02 00:02:35",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o32ngar",
          "author": "ThysGraiden",
          "text": "I did. Lied on applications until I got an interview and lied my way through that too. This was 5 years ago. Worked for that company for 2 years while making connections and building rapport. Then quit and now I've been freelancing for the past 3 years, mostly for the company that hired me originally. Work half as much and earn double now. This is in corporate AV btw",
          "score": 12,
          "created_utc": "2026-02-02 00:55:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o32ooeg",
              "author": "LSossy16",
              "text": "How did you get into freelancing? The corporate world is killing my soul.",
              "score": 1,
              "created_utc": "2026-02-02 01:02:41",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o32r0qb",
                  "author": "ThysGraiden",
                  "text": "I simply quit my FT gig. Though knowing what the temperature was in my market (las vegas-conventions) and that I was often requested by name for big ticket events + had a number of yearly reoccurring gigs, I knew that I'd get booked despite having a freelance rate. So even despite my old company trying their best to fill PMs internally to save $$, I still get enough work to stay busy yet comfortable. \n\nI'm considering going full-time with another big name company for the sole purpose of duplicating the experience: network and build trust with their hiring managers that book PMs both internally/freelance, then quitting on good terms after 6-12 months. This is next move because I like their events + work style better than my current employers.",
                  "score": 3,
                  "created_utc": "2026-02-02 01:16:11",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o32psq9",
              "author": "Imaginary-Let6277",
              "text": "Can I pm you? I'm in AV as well.",
              "score": 1,
              "created_utc": "2026-02-02 01:09:08",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o32q4b7",
                  "author": "ThysGraiden",
                  "text": "sure\\~",
                  "score": 1,
                  "created_utc": "2026-02-02 01:11:00",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o354di7",
          "author": "FortyTwoDonkeyBalls",
          "text": "Imposter syndrome isn’t a bug. It’s a feature.\n\nI’ve learned to embrace it because I’ve often found myself in roles I didn’t feel fully qualified for. Yet, time and again, my leadership has asked me to step into more prominent positions in nearly every job I’ve held. It wasn’t until well into my 30s that I accepted there was something my leaders consistently saw in me that I hadn’t yet learned to see in myself.\n\nToday, I’m a project manager in the defense industry after spending most of my career as a field-level technician and in regional management roles. I was recruited into my first, and current, PM role by our prime contract holder to manage the very programs I had worked under for three years. I don’t have a college degree, but I do have decades of experience in my field, much of it in leadership positions. I'm currently surrounded by team members that have graduate level degrees and many years of PM experience. I have neither and I could let those delinators cloud my self reflection or I can put my head down, emulate those around me that I respect, and do my best which has almost always been good enough to succeed.\n\nThe most important lesson I’ve learned is that I have very little to lose by “faking it,” because most people are stumbling their way through their jobs anyway. What separates those who get tapped for leadership roles is a willingness to figure things out, an aptitude for learning, and the creativity to try new approaches when the first solution doesn’t work.\n\nWhen you look around at your team, it’s usually clear who wants more responsibility and who truly cares about the deliverable. Time and again, I’ve seen the person who shows up on time, does the work they’re supposed to do, and consistently delivers results earn the promotion. I’ve learned to be that person. Often, simply doing your job is enough to stand out because so many people can’t even get that much right.",
          "score": 11,
          "created_utc": "2026-02-02 12:03:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o36rkyi",
              "author": "Wallh4m",
              "text": "I’d be curious to hear what you felt your biggest hurdle was transitioning from field to a PM role?",
              "score": 1,
              "created_utc": "2026-02-02 17:20:04",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o38saup",
                  "author": "FortyTwoDonkeyBalls",
                  "text": "Understanding the politics and relationships I need to foster to achieve objectives. Responding to questions and statements with the appropriate tone, often the tone I wish the other person had used with me. Setting aside embarrassment over mistakes or gaps in knowledge, because I don’t have time to be embarrassed. Knowing when to guide a conversation and when to let others air their grievances. Accepting that my role is now to facilitate, not necessarily to execute. Projecting confidence in my process even when I don’t fully understand what’s happening.",
                  "score": 3,
                  "created_utc": "2026-02-02 23:02:12",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o32vhlu",
          "author": "tower_crane",
          "text": "Not only that, but sales my way to director of operations role. People skills and being annoying until you get what you need.",
          "score": 11,
          "created_utc": "2026-02-02 01:42:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o339rjf",
          "author": "InterYuG1oCard",
          "text": "I just winging it",
          "score": 10,
          "created_utc": "2026-02-02 03:02:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o33xv9t",
          "author": "joeycraig",
          "text": "Been a PM for 4 years and still faking it lol. Taking my PMP next month and going through it like , \"wow is that how it's supposed to be done?\"",
          "score": 10,
          "created_utc": "2026-02-02 05:41:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o34gzv3",
          "author": "dgeniesse",
          "text": "I started faking in 1980. I’m not faking anymore - I’m retired.",
          "score": 10,
          "created_utc": "2026-02-02 08:30:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o35rxow",
          "author": "HippieHighNoon",
          "text": "Waaayyy back in my career I was a yield management analyst at a company. The company was working on revamping their  inventory, crm, sap, and ad server platforms, and I was one of the SMEs. The project manager quit about 3 months into the project. At that point they asked if I wanted to take it over (on top of my other job), and I said yes. That night I went home and got books from Barnes and nobles on being a PM. \nI faked it till I made it. At the company I'm at now, I've been ranked #1 out of the PMO for the past 3 years.\nIt's a lot easier now to fake it till you make it.",
          "score": 11,
          "created_utc": "2026-02-02 14:29:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o37t3z6",
          "author": "locke314",
          "text": "Better than the alternative: PMing yourself into being a fake.  I see that more than I’d like.",
          "score": 9,
          "created_utc": "2026-02-02 20:12:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o39jx6f",
          "author": "RoyalRRn",
          "text": "I think the PM at my company did...it's going well for them, though. All about the connections and the ass kissing.",
          "score": 9,
          "created_utc": "2026-02-03 01:34:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o32pxgn",
          "author": "AaronMichael726",
          "text": "Literally every PM.",
          "score": 28,
          "created_utc": "2026-02-02 01:09:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o32ejy0",
          "author": "spectrumofanyhting",
          "text": "Being a PM is just having common sense. If you have common sense, you can be a good PM. There isn't a 10-year roadmap to be able to manage some random projects. You just start doing it and either get better or worse over time.",
          "score": 21,
          "created_utc": "2026-02-02 00:06:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o32u5z9",
              "author": "RW_A",
              "text": "I agree with this, but also knowing the trade helps, I’m a concrete PM and came from a mechanical/plumbing background with no college degree. Learning everyday about concrete but like you said common sense and building relationships is 90% of the job, other 10% is change orders and schedules that will never be met haha.",
              "score": 1,
              "created_utc": "2026-02-02 01:34:33",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o37nhe7",
          "author": "Headphones1775",
          "text": "Senior PM here..... Hell yea",
          "score": 8,
          "created_utc": "2026-02-02 19:45:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o32hcx4",
          "author": "exWiFi69",
          "text": "6 years in and I still feel like I’m faking it. I went from managing projects $10-25k to $2.5mil",
          "score": 15,
          "created_utc": "2026-02-02 00:22:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o35cptu",
          "author": "cjcottell79",
          "text": "Borris Johnson?",
          "score": 8,
          "created_utc": "2026-02-02 13:02:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o35dzu8",
          "author": "Smooth-Trainer3940",
          "text": "'Fake it till you make it' is a popular term for a reason",
          "score": 9,
          "created_utc": "2026-02-02 13:10:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o341aug",
          "author": "ED061984",
          "text": "Went into PM business without a cert and started learning by doing. But turned out that a lot of PM tasks fitted well with my tasks on previous (scientific) projects and the way that I had studied...\n\nNot faking, but transitioning.",
          "score": 7,
          "created_utc": "2026-02-02 06:09:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o336z8i",
          "author": "Born4One",
          "text": "I was hired as a PM in a lateral move from my previous company with no experience with the exception of a college project in grad school. I leveraged that project and my management experience to land the job.",
          "score": 6,
          "created_utc": "2026-02-02 02:46:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o346ck3",
          "author": "Low-Illustrator-7844",
          "text": "Yep, went from customer assistant in a superstore to technical support assistant in a call center and then became a project manager for a consultancy firm.",
          "score": 6,
          "created_utc": "2026-02-02 06:52:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o34b3kn",
          "author": "kowalski_82",
          "text": "Yeah pretty much me, 4 years into the role, was in an ops role in my business before then. Told I have the right people/soft skills and the rest can be developed and here I am. Still have days where stuff goes over my head, always learning.",
          "score": 7,
          "created_utc": "2026-02-02 07:34:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o34t5lz",
          "author": "BuffaloJealous2958",
          "text": "I’ve seen people stumble into it from ops, QA, support, even dev, then one day someone goes “hey, you’re basically the PM now”. The first months are usually impostor syndrome + googling acronyms + copying whatever template the last PM used.\n\nHow it goes depends less on credentials and more on whether they learn fast, ask dumb questions early and don’t pretend they know everything. The ones who try to bluff forever usually get exposed. The ones who admit “I’m figuring this out” tend to be… fine, even good.",
          "score": 7,
          "created_utc": "2026-02-02 10:27:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o32va5i",
          "author": "justtoaskthisq",
          "text": "Lol, yep I had no business getting my first PM role and then getting the PMP as quickly as I did, but whatever.",
          "score": 10,
          "created_utc": "2026-02-02 01:40:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3354ej",
              "author": "deemo101_",
              "text": "How were you able to quickly get the PMP? Don’t you need to have PM experience for a few years before even taking the test? Genuinely asking because I am approaching 2 years in my role soon and I want to take the test when I can. Thanks so much for any info you provide.",
              "score": 1,
              "created_utc": "2026-02-02 02:36:25",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o338yan",
          "author": "meestermanager",
          "text": "Yerp. Started as a temp but just kept doing more and more organizey things as I got new jobs til it was officially part of my title. \n\nI think it went: some tech and internet stuff when I was in school, then office temp, office admin (at a college), web and comms job, unemployed web/comms freelancing (ugh), consultant related to what I was doing in grad school, then PM job. Then product manager! I am great at what I do but I don’t look great on paper compared to “real” PMs, I think, since I just learned along the way. At least, I’m guessing that’s a small part of why it’s been hard to find work right now.",
          "score": 5,
          "created_utc": "2026-02-02 02:58:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o344qpy",
          "author": "FunkiGato",
          "text": "Yes me. Just started this role. No experience in project management. I am more s junior project manager and just learning on the job. I see this a highly paid internship lol",
          "score": 5,
          "created_utc": "2026-02-02 06:38:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o34coxk",
              "author": "Wiggydor",
              "text": "You sound teachable. You will be fine. ",
              "score": 2,
              "created_utc": "2026-02-02 07:49:56",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o37gh8f",
                  "author": "FunkiGato",
                  "text": "I believe I am. Its very stressfull, since the bar is pretty high.  When I mess up, or do things not so well, I get critism and I take it to heart and it will bother me mentally and makes me not wanna go to my job and I fear I will get burn again. I had plenty of moments my supervisor straight up burns me. I think during those moments he also had a stressful day and took it out on me.\n\n  \nYeah, so far I am trying to survive and hope this will make me a better project manager.",
                  "score": 2,
                  "created_utc": "2026-02-02 19:12:50",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o34j4zn",
              "author": "here_to_hate",
              "text": "How did you get your foot in the door? I would love to start by doing something similar. I have 10 years of experience in another highly specialized field but would be willing to start as an entry-level PM just to get into the field.",
              "score": 2,
              "created_utc": "2026-02-02 08:51:09",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o37l3yu",
                  "author": "FunkiGato",
                  "text": "I contacted a recruiter of an engineering company. We talked and she said what I wanted to do, I said I wanted to do Engineering and would love to go into PM one day. She talked internally and couldn't offer me an Engineering role, but said they were searching for a PM with experience, and since I dont have any experience, they couldn't give me that role. \n\nBut they needed more PM in general, so they offered me a junior role where I would get paid less. So I agreed, since I saw this as a paid internship, or a paid training to get my foot in the door at a well respected company. It would look good on my resume and in general it was a good choice I think.",
                  "score": 3,
                  "created_utc": "2026-02-02 19:34:22",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3d24es",
          "author": "CJXBS1",
          "text": "I didn't fake it. I was thrown into the role as an \"opportunity\" as a \"broadening\" assignment. Turns out I was actually pretty darn good at it and I liked it. I later got my Master's in Project Management along with the PSM, CAPM, and PMP certs. Unfortunately, I am not getting promoted but did receive several pay bumps increasing my salary by 50% in 3 years, for which I am grateful. Ironically, I am being offered a promotion (and a nice 15-20% increase) to return as an individual contributor of what I used to do in a different sector. \n\n  \nI guess is bye bye PM. It was a great 3-4 years.",
          "score": 5,
          "created_utc": "2026-02-03 16:09:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3dygae",
          "author": "GlitteringAid35877",
          "text": "I didn't fake my way in, I was in a completely different role at my current company and the PMO manager gave me an \"opportunity\" (that I didn't want but was voluntold).  I fake being good at it now though, I wing it most days.",
          "score": 5,
          "created_utc": "2026-02-03 18:37:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3gkhxl",
          "author": "NihilisticMacaron",
          "text": "I was 38 when I moved into PM. No formal PM experience, but I had significant industry knowledge. Is that faking it? Maybe. IMO PM is easily learned but industry knowledge is built over time and through several successes and failures.",
          "score": 6,
          "created_utc": "2026-02-04 02:32:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o35blap",
          "author": "Aggravating_Hippo546",
          "text": "I think we’re all faking our way through PM. Just kidding. But the feeling that you suck at everything and are clueless has a name, impostor syndrome. Very real. \n\nAlso, if you are managing projects without the PM title or all the certs, you are still a PM.",
          "score": 9,
          "created_utc": "2026-02-02 12:55:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o32s8qq",
          "author": "SeatownCooks",
          "text": "Yeah! How'd it go? I fucked up. I'm a program manager now and I have 8 project managers that report to me. I way overshot the landing on my ability to fake it. \"White Knuckle\" is my middle name.  The pay is good but it's stressful AF. And now they are asking me to be a Director. Hell no. ",
          "score": 11,
          "created_utc": "2026-02-02 01:23:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o32szqk",
              "author": "More_Law6245",
              "text": "Funny thing, I said the same.... my last title was Program Director and I still don't know where I screwed up to earn that title. ",
              "score": 5,
              "created_utc": "2026-02-02 01:27:44",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o330jyc",
              "author": "straycrayons1",
              "text": "Lmao I jumped over project manager roles right into a program manager position. Military. Fml.",
              "score": 3,
              "created_utc": "2026-02-02 02:10:38",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o33yo64",
          "author": "TylertheDouche",
          "text": "what does this mean",
          "score": 4,
          "created_utc": "2026-02-02 05:48:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o32y913",
          "author": "JapanEngineer",
          "text": "My coworker",
          "score": 6,
          "created_utc": "2026-02-02 01:57:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o34l9ln",
          "author": "hippydidoda",
          "text": "Best university is the University of Life. All these PM courses is teach you 3 letter acronyms. Learn on the job.",
          "score": 8,
          "created_utc": "2026-02-02 09:11:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o35dycb",
          "author": "bugeyebugged",
          "text": "Over the past 10 years, I've surveyed over 2K project managers. Only 1 out of nine had any kind of training before taking on their first PM job. One in fifteen have any kind of certification or degree in the field. The vast majority of us are what I call \"accidental\" project managers, most of whom have had to learn on the job. The trick is acknowledging it--and then doing somethign about it, including training.",
          "score": 8,
          "created_utc": "2026-02-02 13:10:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o32i68r",
          "author": "Robenever",
          "text": " I Think I did. I mean, I was in charge of a few guys, then a bit more then more. The longer I was in the military the more I relied on my subordinates. Lucky for me they did what I asked. I kinda just took that with me, folks will do what you ask if you treat them like your people.",
          "score": 6,
          "created_utc": "2026-02-02 00:26:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o32cifh",
          "author": "Total_Literature_809",
          "text": "Me. Two years and counting",
          "score": 3,
          "created_utc": "2026-02-01 23:55:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o337us1",
          "author": "1988rx7T2",
          "text": "I sort of did. I had some non formal project management experience in my old job, on a small scale, without any formal training. They figured I was competent on the technical side enough and could figure the other aspects out.",
          "score": 3,
          "created_utc": "2026-02-02 02:51:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o34e8lt",
          "author": "TheMyzzler",
          "text": "Me. Certifications aren’t really a major thing in my country and I’ve got this job because of my organizational skills, soft skills and analytical skills. \n\nLearning a lot every day. Some things I do very well naturally, others I struggle with and I have to get better at. \n\nThe company is happy so there’s at least that. \n\nI wouldn’t say I faked it though. More like i took an atypical path to the job:\nData Analyst > Category Manager > Head of Product > CPO for a smaller firm > PM in a big corporate multinational. ",
          "score": 3,
          "created_utc": "2026-02-02 08:04:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o34kqlr",
          "author": "Rosyface_",
          "text": "Yeah I feel like I did often. I was a team leader in a callcentre and the centre manager wanted someone to “just handle a couple of projects” for 6-9 months. I’d been on a couple of projects as a resource before but had no formal learning or experience. \n\nThat was in 2016, I’m now about to hit 10 years as a PM. I learned as I went and from making mistakes, and tacked on e-learnings and other bits of learning on as I went. That company made me redundant in 2024 and I was desirable enough to be picked up without any certifications by a public sector organisation within 2 weeks of finishing. \n\nI’ve been at my org now almost 2 years and now have two certifications; my first year I did agilePM and last year I did Prince2. I feel like an imposter almost every single working day of my life despite a decade of experience because I got here in a strange way. My teammates in the PMO all have far more formal experience than my “whatever works” approach, but I’m deployed onto things as a fixer and they’re put onto large scale, multiple workstream, huge pieces of work. So although I feel like I faked my way here, on paper I’m qualified now, and the imposter syndrome never really leaves. I was faking for a solid 8 years before I had a single certificate to prove I could do it.",
          "score": 3,
          "created_utc": "2026-02-02 09:06:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3frokj",
          "author": "LaCarsa",
          "text": "A good PM is someone who knows the context of the business well. Rarely has someone with all the qualifications actually been that useful as a PM unless they have the business context.\n\nSo to answer your Q, if by faking it you mean someone without formal PM qualifications - then yes.",
          "score": 3,
          "created_utc": "2026-02-03 23:52:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o32v7re",
          "author": "DesertMountainLvn",
          "text": "Intentionally? No. Lied? No. However, my manager at the org I was working at basically said hey we fired our PM, you want to do it? I had no prior experience. Just so happened I was good at it and was able to leverage that opportunity into a career. Worked out. That was 10 yrs ago.",
          "score": 4,
          "created_utc": "2026-02-02 01:40:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o35l606",
          "author": "Spinach_Lucky",
          "text": "I was hired on as a PM in the electrical field... when I was previously a project coordinator for telecom. I 100% did not have any experience as a true PM. \nBut, I think the skill set required for project management can be developed through many roles. Multitasking, shifting quickly, communication, organization, all of these skills are transferable. For me, it was a matter of learning the proper steps for RFI's, shop drawings, approvals, reading IFC's, etc. Oh, and learning not to hate public speaking. The amount of meetings I must host is wild. I used to avoid speaking in meetings, never called customers, etc., in my prior role. Now? I'm always on my phone. Always chairing meetings... haha who am I?!",
          "score": 5,
          "created_utc": "2026-02-02 13:52:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o32ej1m",
          "author": "iamright_youarent",
          "text": "every management role is kind of fake because you don’t really create intuitive productions. it’s all soft intangible skills.   even if someone faked their way, meaning I assume without proper credentials or experiences, as long as they know how to manage, that’s what’s required.  this subreddit named projectmanagement does not do any service to most people because depending on the industry you belong, experiences vary a lot.",
          "score": 5,
          "created_utc": "2026-02-02 00:06:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o34gxnq",
          "author": "dgeniesse",
          "text": "I started faking in 1980. I’m not faking anymore - I’m retired.",
          "score": 2,
          "created_utc": "2026-02-02 08:29:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o32ekpp",
          "author": "Kayge",
          "text": "Yup, I know someone who faked out an exec who vouched for him.  \n\n\nIt was obvious about 1 hour into their first day.  ",
          "score": 4,
          "created_utc": "2026-02-02 00:06:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o32ebo3",
          "author": "Ozymandius21",
          "text": "Was doing a bunch of onboarding work working with software vendor. Before that, developing a website etc.\n\nPhrased as project experience (because it was kind of a project) to get into Project Coordinator role.\n\nBeen there for 7 months. Never felt out of place. Might even be ready for a PM role soon!\n\nSo, yes, kind of rephrased past experiences. And, doing proper PC work now to hopefully get into PM role one day.",
          "score": 3,
          "created_utc": "2026-02-02 00:05:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o331l7s",
          "author": "Fun_Ladder_3934",
          "text": "There's a normal non fake way?",
          "score": 1,
          "created_utc": "2026-02-02 02:16:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o34gd3d",
          "author": "lloydthelloyd",
          "text": "You mean like scott morrison?",
          "score": 1,
          "created_utc": "2026-02-02 08:24:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o34hes1",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-02 08:34:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o35nxeq",
              "author": "projectmanagement-ModTeam",
              "text": "\"I would allow any post for love, but not that\" - Meatloaf 1947-2022\n\nWe ask that all topics in this sub be related to professional project management.",
              "score": 1,
              "created_utc": "2026-02-02 14:07:56",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o34kyht",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-02 09:08:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o35nuzv",
              "author": "projectmanagement-ModTeam",
              "text": "\"I would allow any post for love, but not that\" - Meatloaf 1947-2022\n\nWe ask that all topics in this sub be related to professional project management.",
              "score": 1,
              "created_utc": "2026-02-02 14:07:34",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o34q33j",
          "author": "braini_",
          "text": "Most PM I know (me included) had no formal education on the first job and kinda learned while walking. Most of them (me included) do very well for themselves at this point.",
          "score": 1,
          "created_utc": "2026-02-02 09:58:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o33ub9z",
          "author": "coolzebra5",
          "text": "Worked with a few of this type. Would not recommend.",
          "score": 1,
          "created_utc": "2026-02-02 05:14:48",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qpln1n",
      "title": "Realized most of my project meetings were performing the act of project management.",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1qpln1n/realized_most_of_my_project_meetings_were/",
      "author": "Zephpyr",
      "created_utc": "2026-01-28 19:39:38",
      "score": 79,
      "num_comments": 17,
      "upvote_ratio": 0.95,
      "text": "I had a moment of clarity these weeks after sitting through back to back status meetings. I think meetings were performing the act of project management. Everyone leaves feeling like work happened because we talked about work. But the actual decisions either got made before in side conversations or got pushed to after because we ran out of time. The worst part is when conflicts surface. Two teams disagree on scope. What happens? The PM collects both sides then escalates to leadership. Now the PM looks like a messenger. \n\nI talked to a senior PM friend and he said that proficient PMs do most of their work before the meeting even starts. They already know where the disagreements are. They already talked to key stakeholders one on one. The meeting itself is just the final alignment not the discovery phase. If you are finding out about problems for the first time in the meeting you have already lost. Also, if you felt like the meeting is going nowhere, you are the one responsible to steer around. He would use a real-time meeting assistant to take notes and focus on the real flow, so that when discussions are going in circles he can intervene in time. I am going to try that along with doing more prep work before meetings, although it still feels like fighting against a culture that measures productivity by calendar density.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/projectmanagement/comments/1qpln1n/realized_most_of_my_project_meetings_were/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o2azqg6",
          "author": "More_Law6245",
          "text": "I myself operate like your colleague and  call it my \"final nail in the coffin\" approach, I ensure I know the positioning of the relevant stakeholders prior to the meeting, I just want to formalise it through the meeting and deliberately lead the respective stakeholders on \"that decision journey\". Firstly I ensure that I fully understand the issue and constraints of the outcome needed myself and guide the stakeholders to a suitable outcome for the project or program not what they think or want. The key objective is not individual or team preferences, it's what is best for the project or program.\n\nThe key here is to get the respective stakeholders to clearly and simply articulate their positioning with fact and reasoning within the meeting forum and I use the \"speak to me like I'm four\" statement. I have found from experience if they can't easily articulate a simple point of view, then there is more behind their positioning and I generally find there is other intent, biases or agenda that sits behind it but I have managed to capture that in a open forum.\n\nJust an armchair perspective.",
          "score": 8,
          "created_utc": "2026-01-28 22:40:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2gjlyt",
          "author": "Adventurous-Dog-6158",
          "text": "If there are clear due dates and people are held accountable, there is really no need for project status meetings. A simple project status e-mail can be sent out. Meetings are helpful for working sessions to solve a problem, but that would be for specific tasks within the project, not for the project as a whole.",
          "score": 6,
          "created_utc": "2026-01-29 18:44:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2joita",
              "author": "therealsheriff",
              "text": "Agreed but unfortunately at some organizations it becomes commonplace to have the meeting for the sake of the meeting. Drives me crazy but it does happen.",
              "score": 1,
              "created_utc": "2026-01-30 04:34:20",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2ah34o",
          "author": "FunkiGato",
          "text": "Still a junior PM here. What I am noticing, I am just the scribe, writing down action points with due dates and just say \"Guys, we are not talking about the topic at hand. Lets focus back, and lets plan seperate meeting to discuss this other issue okay? David, will you plan something after this meeting? Okay, thank you. Yes I will also join.\"",
          "score": 5,
          "created_utc": "2026-01-28 21:17:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ag0la",
          "author": "CrackSammiches",
          "text": "Nah, you're performing the act of Meeting Scheduler and Scribe.  \n\nThose roles are sometimes part of the job, but they are not The Job. Your job is to get the project done. Meetings will very quickly blot out the sun if you let them.",
          "score": 3,
          "created_utc": "2026-01-28 21:12:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2a5z63",
          "author": "Medium_Let_7559",
          "text": "This hits hard because it’s true.\nA lot of meetings feel productive because they look like work — updates, discussions, alignment — but nothing actually moves.\nOne small shift that helped me:\nEvery meeting must answer one question by the end:\n“What changed because we met?”\nIf the answer is “nothing concrete,” the meeting probably shouldn’t exist — or should’ve been async.\nActivity creates comfort. Decisions create progress.",
          "score": 2,
          "created_utc": "2026-01-28 20:28:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2alewt",
          "author": "ethically-contrarian",
          "text": "What are your meetings about? \n\nOutside of stand up, we have greatly reduced meeting cadence by creating an accountability matrix and escalation within our processes. \n\nIf you want less meetings, get the work done OUTSIDE of meetings.",
          "score": 2,
          "created_utc": "2026-01-28 21:36:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2aq02s",
          "author": "Magnet2025",
          "text": "I would agree, especially with your friend’s insight. \n\nThere should be no surprises in a project team meeting. It is an exercise in confirming what the PM already knows and letting the team know of potential problems coming up. \n\nAlso a good exercise to clean up the schedule. In Project I made views for meetings. One showed the week or two weeks past and one showed the upcoming two weeks. \n\nThe view included the standard fields plus: % work complete (this is important, since % complete is schedule based on- it’s saying if you two weeks into a four week project, you are 50% complete). \n\nIn addition, I would have scheduled and actual work (hours) as recorded in the time sheet, and remaining work. \n\nI would filter the tasks based on who was reporting and we would validate the work and remaining work. In Project, if you manually set a task to be 100 % complete (or work complete) then Project assumes you used all the hours. If you completed 40 hours of scheduled work in 32 hours then you have 8 hours of remaining work. Reduce that to zero hours remaining and you now have an extra 8 hours if you need it. \n\nThe look ahead confirmed the work to be done and the resources are ready. In some cases, the team would say that a certain task doesn’t need to be done and I would mark it for deletion, saving the planned work. \n\nMy meetings were always time boxed so we kept the meeting’s flow pretty brisk. \n\nIf the Account Manager or other non-core team member wanted to join, they could. But if they were not on the agenda I discouraged them from participating/speaking. \n\nMeetings like that felt like real work and definitely contributed to everyone’s sense of progress.",
          "score": 2,
          "created_utc": "2026-01-28 21:56:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2avapy",
              "author": "halfcabheartattack",
              "text": "I disagree with this but maybe it's a difference in how PM works in different industries.  In my world (hardware development) if most of your meeting is confirming what you already know then that meeting is a waste of time.\n\nI want me team members to tell me the latest and greatest in a team meeting.  Tell us (the team, not just me) what tests we failed, tell us what risks they're seeing that I'm not, tell us about the latest challenges.\n\nI hate environments where any bad news has to be communicated one-on-one, off-to-the-side etc etc.",
              "score": 9,
              "created_utc": "2026-01-28 22:19:20",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2fvfpc",
          "author": "Ok-Plane-9384",
          "text": "Oh, I really appreciate your phrase \"...fighting against a culture that measures productivity by calendar density.\" I felt that way to deeply.",
          "score": 2,
          "created_utc": "2026-01-29 16:56:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ah1xs",
          "author": "Economy_Pin_9254",
          "text": "Thanks. This has been happening for years, and I see it accelerating as organisations lean harder into frameworks — *“we’re Agile”, “I’m a Scrum Master”, SAFe everywhere*.\n\nA lot of meetings now exist to create the **theatre** of delivery. Work gets discussed, slides get shown, people nod — and everyone leaves feeling like progress was made. But no decisions actually moved. Anything difficult either happened beforehand in side conversations or got kicked to “offline” when time ran out.\n\nThe PM then captures all of this in a report. At that point they’re not delivering a project — they’re reporting on the performance of one - and lets face it we know a lot of those reports dont get read.\n\nGood PMs don’t use meetings to discover problems. They already know where the tension is, who disagrees, and what decision is required. The meeting is there to close it out, not surface it for the first time - good PM's find a way to make the decision happen.\n\nIf you’re finding out about issues in the room, you’re already late. And if the meeting is drifting, steering it isn’t optional — that *is* the job.",
          "score": 4,
          "created_utc": "2026-01-28 21:17:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2e09k4",
          "author": "Geminii27",
          "text": "Pretty much every meeting in every job is performance.",
          "score": 3,
          "created_utc": "2026-01-29 10:43:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2fgc9m",
          "author": "kreepert",
          "text": "Meetings are just to inform all supporting roles of decisions already made. Some meetings are just ceremonial ie weekly oac etc. Me and a buddy used to see how short we could make OACs on smooth jobs/weird clients  - if you are running the show it's your show. We had many 10 minute oac meetings all agenda no bs poof out the door. Clients don't always like to sit through the bs either if they have other shit on fire. \n\nSome do though. I've also had clients who kept weekly OACs on the calendar just so we could all bull shit for an hour and talk shop. One owner once reeled me in on one of those, \"hey I don't care about how the sausage is made, I trust you, let's talk about something fun\". He was the head of an entire division, he didn't even need to be at the oac with his PM but he liked us so much it was his break every week from his real work. We would talk about whore houses in Asia, beef tartar, he would tell us wild business stories, etc. The project part of it was high level skim and less than 5 minutes. That man gave me so much work.",
          "score": 4,
          "created_utc": "2026-01-29 15:49:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ey21k",
          "author": "Sophie_Doodie",
          "text": "real PM work happens before the meeting, not during it. Most status meetings are just theater so everyone feels busy, while decisions either already happened or get kicked down the road.",
          "score": 1,
          "created_utc": "2026-01-29 14:22:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2x5cgd",
          "author": "jd2004user",
          "text": "It’s a shame the role of Project Manager ever had to be created in the first place",
          "score": 1,
          "created_utc": "2026-02-01 05:04:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2g3m4n",
          "author": "Spiritual_Quiet_8327",
          "text": "A project manager does not define scope of a project.  Scope is given to them from **Product** Management who has gone through an iterative discovery, evaluation, validation and prioritization process with regards to a product's requirements.  It's the Project Manager's role, in combination with input from **Product** Management and Technical Resources to take the scope of work and make the project plan with deadlines, resources, etc.  If there is disagreement as to the scope of work, that is not the Project Manager's problem or fault, and they should punt that dilemma back to Product Management to solve.",
          "score": 1,
          "created_utc": "2026-01-29 17:33:18",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qt1qad",
      "title": "I stopped chasing 100% certainty and my projects got better",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1qt1qad/i_stopped_chasing_100_certainty_and_my_projects/",
      "author": "ueggenthies",
      "created_utc": "2026-02-01 15:41:06",
      "score": 62,
      "num_comments": 12,
      "upvote_ratio": 0.96,
      "text": "Hi everyone!\n\nEarly in my PM career I thought good planning meant answering every question up front. I’d delay kickoff just to tighten one more dependency or risk. Eventually I realized that waiting for certainty just meant starting late. Now I focus on getting alignment on the next decision, not the whole roadmap. Things still go sideways, but at least they go sideways earlier.\n\nAnyone else make this shift, or am I just coping?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/projectmanagement/comments/1qt1qad/i_stopped_chasing_100_certainty_and_my_projects/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o366nnf",
          "author": "Fantastic-Nerve7068",
          "text": "you’re not coping, you’re maturing as a PM.\n\n100% certainty is a trap. it feels responsible, but it usually just delays learning. the shift from “answer everything” to “answer the next thing” is huge. you trade false confidence for real feedback.\n\nmost strong PMs i know made this switch at some point. projects don’t get cleaner, they get clearer sooner. and that’s what actually makes them better.",
          "score": 14,
          "created_utc": "2026-02-02 15:43:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o30dcae",
          "author": "bluealien78",
          "text": "“Perfection is the enemy of great”",
          "score": 9,
          "created_utc": "2026-02-01 18:06:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o35nrfh",
          "author": "Sophie_Doodie",
          "text": "You’re not coping, you leveled up. Good PMs manage uncertainty, they don’t eliminate it, and starting earlier is how you surface real risks instead of imaginary ones. The shift from “perfect plan” to “next best decision” is usually when projects actually start moving.",
          "score": 9,
          "created_utc": "2026-02-02 14:07:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o302l70",
          "author": "nborders",
          "text": "Welcome to agility.",
          "score": 12,
          "created_utc": "2026-02-01 17:17:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2zoofm",
          "author": "pmpdaddyio",
          "text": "Perfection is the enemy of great. I have always said that when staff struggle making things \"just so\". i prefer to iterate.",
          "score": 5,
          "created_utc": "2026-02-01 16:14:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2zudiu",
          "author": "More_Law6245",
          "text": "It really comes down to the size and complexity of the project but also the level of risk that the organisational change brings.\n\nAs a program director when you start getting into the larger more complex project and programs you don't need to list every task as part of your planning stage, you start looking at contingency for either the task, work package, product, deliverable or your place a nominal % on the entire project or program.\n\nThe key thing to remember is to baseline the project because that allows you to successfully manage the exception to your triple constraint and in the event that you have missed something you raise change in a controlled manner.",
          "score": 6,
          "created_utc": "2026-02-01 16:40:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2zpp38",
          "author": "jmlovs",
          "text": "It really depends on the type of projects you are running. Sometimes you just have to start and accept a tolerable degree of uncertainty and risk so things actually get done.",
          "score": 4,
          "created_utc": "2026-02-01 16:18:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2zx2u0",
          "author": "cbelt3",
          "text": "“Best is the enemy of good”. Live it.",
          "score": 5,
          "created_utc": "2026-02-01 16:52:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o34jyem",
          "author": "Agile_Syrup_4422",
          "text": "I went through the same shift. Early on I treated uncertainty like a personal failure, so everything had to be locked before moving. All that did was delay feedback and make the eventual surprises more expensive.\n\nAt some point you realize planning isn’t about certainty, it’s about creating fast learning loops. Start with what’s true enough, make the next decision explicit and let reality correct you early. Projects still go sideways, they just do it sooner, when you can still steer.",
          "score": 2,
          "created_utc": "2026-02-02 08:58:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2zhmt5",
          "author": "AutoModerator",
          "text": "Hey there /u/ueggenthies, have you checked out the [wiki page](https://www.reddit.com/r/projectmanagement/wiki/index) on located on r/ProjectManagement?  We have a few cert related resources, including a list of certs, common requirements, value of certs, etc.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/projectmanagement) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-01 15:41:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o347s8m",
          "author": "BeebsGaming",
          "text": "Im trying to do this and getting better at it as i get older. \n\nYou sound exactly like me although i havent fully stopped the certainty train. Im doing my best to get there tho. Trying to reframe how i think by using the below phrase. \n\n“Good and done is better than perfect and unfinished.” \n\nI think keeping things in motion and getting them moving earlier is healthy. Especially in construction (where i work). Theres time for perfection and its not usually the first 10% of a project.",
          "score": 1,
          "created_utc": "2026-02-02 07:05:04",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qqnels",
      "title": "After project planning one day, the next day I am mentally drained and seem unable to do another plan that day",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1qqnels/after_project_planning_one_day_the_next_day_i_am/",
      "author": "Critical-Promise4984",
      "created_utc": "2026-01-29 22:35:07",
      "score": 45,
      "num_comments": 13,
      "upvote_ratio": 0.94,
      "text": "I heard this might be planning fatigue. I have a burst of energy on one day, creating a thorough, defensible project plan for one of my projects. The next day, I seem to have flatlined and can’t even open the documents to work on a plan for another project. So I spend that day doing light coordination and project maintenance. Then, usually I feel like I have the mental energy to tackle another project plan the following day.\n\n  \nDo you experience this? I’m curious whether others intentionally alternate heavy planning days with lighter days. ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/projectmanagement/comments/1qqnels/after_project_planning_one_day_the_next_day_i_am/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o2i5rwz",
          "author": "PhaseMatch",
          "text": "I do.\n\nI have now found out I am actually autistic.\n\nI am high functioning and what they call \"high masking\" - I can do (large) group facilitation, planning and so on, but it takes a much greater cognitive toll down to neurological differences in my brain.\n\nIt also applies generally to any cognitive heavy lifting you do, not just people with slightly different brain physiology like me.\n\nThings like Pomodoro Technique help - ao scheduling down/quiet time on a shorter cadence (30-40 minutes) to give the brain time to recharge from the heavy lift.  (It is gird strongly to brain chemistry and the \"ultraradian rhythm\" cycles if you what to go down the neuroscience rabbit hole\"\n\nExercise resets help too - holy trinity of sleep, food and exercise lowers the overall stress, and stress impacts on \"working memory\" and cognitive load.",
          "score": 22,
          "created_utc": "2026-01-29 23:26:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2i8s9g",
              "author": "RemotePersimmon678",
              "text": "I have my assessment next month but I know what it's gonna tell me. It seems counterintuitive, but I think a lot of (especially female) project managers are neurodivergent. We love organizing, details, and accountability. \n\nUnfortunately it's also a job that requires a lot of comfort with change and a lot of nuanced socializing, and that is HARD for us.",
              "score": 10,
              "created_utc": "2026-01-29 23:42:48",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2j3f3i",
                  "author": "Main_Significance617",
                  "text": "Yup! Same here! I tried to start r/autisticPMs but in classic autistic adhd fashion, I’ve let it fall off lol",
                  "score": 3,
                  "created_utc": "2026-01-30 02:30:39",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o2ihmgo",
                  "author": "PhaseMatch",
                  "text": "Hope all goes well for you;  it's been an interesting 18 months for me to say the least.  The whole \"masking\" concept can be very challenging in particular.   \n  \nI had a fair amount of \"well I don't have trait X\" and then suddenly identifying what I saw as a \"preference\" was, in fact, just me explaining away a trait. \n\nIt's a bit trippy (especially as I am closer to retirement than starting my career)",
                  "score": 2,
                  "created_utc": "2026-01-30 00:30:34",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o2ipzp8",
                  "author": "Augoctapr",
                  "text": "This definitely me! It’s so hard because within the context of my job I can function very well 1:1 and with groups of people when I feel confident about what my role and the dynamic is. What I find so draining is the unstructured socializing: chit chat before the meeting starts, mingling at a networking or team building event, etc. ",
                  "score": 1,
                  "created_utc": "2026-01-30 01:15:43",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2illbg",
          "author": "lasaventuras",
          "text": "100%\nI am that way with meetings… I like talking to people but am an introvert and need peace and quiet to recharge. Otherwise I’m in bed at like 7:30 to scroll and watch tv.",
          "score": 21,
          "created_utc": "2026-01-30 00:51:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2lgjh6",
              "author": "Smooth-Trainer3940",
              "text": "Relatable",
              "score": 2,
              "created_utc": "2026-01-30 13:03:48",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2iur61",
          "author": "LameBMX",
          "text": "learning your own ebb and flow is key in any work.",
          "score": 13,
          "created_utc": "2026-01-30 01:42:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2knl20",
          "author": "Longjumping-Cat-2988",
          "text": "I’ve learned to stop fighting it and plan around it. I stack heavy planning on specific days, then deliberately leave the next day for lighter stuff: follow-ups, coordination, cleanup, updating boards. Trying to force back-to-back planning days just leads to worse plans anyway.",
          "score": 13,
          "created_utc": "2026-01-30 09:15:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2hz8hv",
          "author": "ethically-contrarian",
          "text": "A former Scrum Master and PMO manager here. I encouraged my team to block off time every week, whether it’s 2 hours 2 days a week or a “no meetings” Friday for this exact thing. \n\nIt is true, it takes a lot of work to create these plans and documents, in addition to meetings that interrupt the planning process. \n\nQuestion: (hate to say it) but have you leaned into any AI agents to assist. I have and took project planning from 2 days to about 6 hours.",
          "score": 12,
          "created_utc": "2026-01-29 22:52:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2iu17r",
              "author": "ReedRyter",
              "text": "I would love to know what you are using for project planning if you can share? Are they specific agents you wrote to help your planning?",
              "score": 3,
              "created_utc": "2026-01-30 01:38:26",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2l3o2e",
                  "author": "ethically-contrarian",
                  "text": "We rely on MS Planner (premium option as it allows for dependencies, sprint planning and portfolio view)\n\nWays we’ve leverage AI:\n1. In your planning sessions be sure to record or transcribe. This will allow you to use an efficient prompt to know all task that have been identified, which are missing, dependencies and a baseline of task estimation.\n\n2. We have built a few custom agents within CoPilot for our WBS and automated tasks being sent to proper owners for updates and reminders.",
                  "score": 3,
                  "created_utc": "2026-01-30 11:35:37",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2kfj18",
          "author": "Starterguides_pm",
          "text": "I’d say this is very normal, especially if you’re working across multiple projects. The way you’re handling it, even if unintentionally, is actually a balanced approach as the work is still getting done. Just because some days feel less productive or less intense doesn’t mean they’re bad or unhelpful.\n\nPersonally, I’ve found splitting the type of work into AM/PM slots works better for me. I try to do more intense, deep planning work in the morning, then lighter coordination or admin in the afternoon. Overall, that gives me a much better mental balance.",
          "score": 6,
          "created_utc": "2026-01-30 08:01:58",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qslpws",
      "title": "Spending 60% of my week \"task gardening\" instead of managing delivery",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1qslpws/spending_60_of_my_week_task_gardening_instead_of/",
      "author": "oscarnyc1",
      "created_utc": "2026-02-01 02:16:53",
      "score": 40,
      "num_comments": 15,
      "upvote_ratio": 0.96,
      "text": "I’ve been running software projects for 15 years, and hit a wall. Realized most of my job had become manually reshuffling Jira/Asana bars every time a client asked for a \"small favor\" or a dev got sick.\n\nIt feels like we’re using digital paper. If the \"physics\" of the project changes, I’m the one who has to manually calculate the damage and move 50 due dates.\nI’ve started using a deterministic engine that treats delivery like a simulation (if I add a task or move a dev, the entire forecast recalculates instantly and shows me the new bottleneck). It has basically killed the 'Friday afternoon reshuffle\" and cut my meeting time by 90% because the trade-offs are now math, not opinions.\nIs anyone else moving away from \"static trackers\" toward actual simulation/predictive engines, or are we all just committed to task gardening until we burn out?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/projectmanagement/comments/1qslpws/spending_60_of_my_week_task_gardening_instead_of/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o2wfak6",
          "author": "AutoModerator",
          "text": "Attention everyone, just because this is a post about software or tools, does not mean that you can violate the sub's 'no self-promotion, no advertising, or no soliciting' rule.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/projectmanagement) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-01 02:16:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2wkxzm",
          "author": "PhaseMatch",
          "text": "Been using cycle time and Monte Carlo for a few years now, but the mean and standard deviation of any \"throughput\" measure works when it comes to forecasting.  GetNave has a Jira plugin, but I'll just do it Excel.   \n  \nYou can apply Monte Carlo and statistics to modelling anything, so it's useful for unplanned work (incidents, defects, pebbles-and-sand small things), and having a \"roadmap\" delivery \"budget\" that takes that into account.  \n  \nFor larger feature \"rocks\" it's generally a lean canvas, to a (ranged) estimate from a few SMEs;  main thing there is an estimate without the uncertainty, risks and assumptions is a piss-poor communication tool and will get you into conflict.    \n  \nYou either pass the cost/benefit threshold or at that point or it doesn't.  To get a more precise estimate you typically need to do some spikes to test the biggest risks/assumptions, recheck cost/benefit and then triage (now, next, kill) depending on the overall strategy.",
          "score": 6,
          "created_utc": "2026-02-01 02:50:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2x4kww",
              "author": "Eightstream",
              "text": "So I’m not sure I’d call that Monte Carlo simulation - you’re not modelling the system, you’re just bootstrapping with some heavy assumptions (i.e. all tasks are independent and past tasks predict future tasks). Which may be okay but it’s not a given and requires some validation.\n\nI would also not use SD as it assumes a symmetric distribution and estimates are right skewed. Quantiles or something would be better.",
              "score": 2,
              "created_utc": "2026-02-01 04:59:03",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2xdzfa",
                  "author": "PhaseMatch",
                  "text": "I was kind of surprised when a \"full\" Monte Carlo gave results similar to mean and StDev throughout when it came to forecasting 3-6 months ahead, when you were looking at +/- a couple of weeks kind of precision.  \n\nI was expecting the same as you - the symmetrical assumption would blow things up, but in practice it's been close enough over the last few years when I run them in parallel. \n\nMain thing it's better than sitting around with the team arguing if a give work item will take 5 days or 8 days, and you can focus the team's efforts onto addressing the largest uncertainties/risks.\n\nIn practice I'll do both, and take the team's \"gut feel\" into account as well.  if you get wildly different answers then it's time to do some digging. \n\nI'll often present the simplest model with the most transparent assumptions;  overly complex models can drive discussions with stakeholders over minutia rather than putting the focus on the fuzzily known stuff.   \n  \nOr as my renovator quoted : \"No allowance made for discovered rot or asbestos\"",
                  "score": 2,
                  "created_utc": "2026-02-01 06:09:44",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2yz2zi",
          "author": "SVAuspicious",
          "text": "We know you aren't using project management. \n\n1. Jira is not a PM tool, no matter what Atlassian says. It's task management. Fine for operations like help desk or anything else suitable for SLAs. \n2. The amount of churn you describe (every Friday?!) says you don't have a cost, schedule, and performance baseline and certainly aren't managing scope. \n3. I infer you didn't do complete discovery before starting development. Your use of simulations^(1) supports this inference. No baseline means you're guessing. GIGO. \n\nAnswer: Do PM. What does your contract say? \n\nTL;DR: You're doing it wrong. \n\n1) There is a place for simulations in PM. Risk management comes to mind. Running all your risks with probability of occurrence and impact through a Monte Carlo or similar algorithm is a good way to generate defensible estimates for management reserve aka slack.",
          "score": 10,
          "created_utc": "2026-02-01 14:04:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3671uk",
          "author": "Fantastic-Nerve7068",
          "text": "this resonates hard. most tools are just fancy spreadsheets with nicer fonts. they record reality after it already broke.\n\nonce you move from static tracking to anything that recalculates impact automatically, it’s hard to go back. the biggest win isn’t speed, it’s removing opinion wars. when the plan updates itself and shows the bottleneck, the conversation changes completely. less gardening, more actual management.",
          "score": 5,
          "created_utc": "2026-02-02 15:45:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o36ecrx",
              "author": "oscarnyc1",
              "text": "You're spot on about tools just recording a broken reality. I recorded a quick 60-second side-by-side to show the difference when a client asks for \"just one more thing done ASAP\".\n\nIn a typical task tracker (like Asana), it’s manual gardening to fix the dates; in a delivery engine, the system just does the math so the PM can actually manage the delivery instead of the tool.\n\nVideo link: [https://vimeo.com/1161120328](https://vimeo.com/1161120328)",
              "score": 2,
              "created_utc": "2026-02-02 16:19:02",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2xx3si",
          "author": "karlitooo",
          "text": "That would be a sick demo if you felt like recording something for YouTube ",
          "score": 3,
          "created_utc": "2026-02-01 09:00:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2zi3u2",
              "author": "oscarnyc1",
              "text": "I appreciate the deep dive into Monte Carlo vs. deterministic models. I think we’re all touching on the same problem: how do we stop \"gardening\" and do engineering delivery?\n@karlitooo, since you asked for a look at the logic I’ll DM you a link to a project I’m currently simulating. It’s a lab environment, but I'd be curious to see if this makes more sense than jira or spreadsheets.",
              "score": 2,
              "created_utc": "2026-02-01 15:43:23",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o32r5z4",
                  "author": "karlitooo",
                  "text": "Thanks for sharing this. It’s interesting poc, I think for a kanban team or at program level, it would be pretty sweet to have access to. How did you factor in task estimation inaccuracy ?",
                  "score": 2,
                  "created_utc": "2026-02-02 01:17:03",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o2zi3v1",
                  "author": "AutoModerator",
                  "text": "Hey there /u/oscarnyc1, why not join the public conversation? Signaling a DM publicly is redundant\".\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/projectmanagement) if you have any questions or concerns.*",
                  "score": 1,
                  "created_utc": "2026-02-01 15:43:23",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o35e61s",
          "author": "Smooth-Trainer3940",
          "text": "Never heard of task gardening. Good point",
          "score": 3,
          "created_utc": "2026-02-02 13:12:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o36ew8s",
              "author": "oscarnyc1",
              "text": "I didn't have a name for it for years, I just knew I was exhausted from reshuffling dates. I actually just recorded a quick 60-second clip showing what \"gardening\" looks like in a typical tracker vs. letting an engine handle the math. [https://vimeo.com/1161120328](https://vimeo.com/1161120328)",
              "score": 3,
              "created_utc": "2026-02-02 16:21:31",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qplj79",
      "title": "Is it still 'Quiet Quitting' if you’ve literally programmed a bot to do your job for you? I’m currently at 5 hours of real work per week and the anxiety of being found out is finally gone.",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1qplj79/is_it_still_quiet_quitting_if_youve_literally/",
      "author": "RateTurbulent8681",
      "created_utc": "2026-01-28 19:35:46",
      "score": 37,
      "num_comments": 26,
      "upvote_ratio": 0.77,
      "text": "Hi to the current burnout culture and people who feel they’ve won the \"work-life balance\" game.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/projectmanagement/comments/1qplj79/is_it_still_quiet_quitting_if_youve_literally/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o2bfkkh",
          "author": "phoenix823",
          "text": "You can't say that you've automated a PM job down to 5 hours of work per week without going into detail about what the bot does, how it works, etc!",
          "score": 56,
          "created_utc": "2026-01-29 00:01:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2de0b0",
              "author": "speedypuma",
              "text": "Yes!! 👏",
              "score": 1,
              "created_utc": "2026-01-29 07:19:47",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2d2rnj",
          "author": "surfsnower",
          "text": "I had a guy who for whatever reason, his job was assembling the dashboard and daily meeting slides. All he did was crunch data and fill in the blanks. He moved on and a new guy with significant computer skills came in. He created an automated dashboard and slideshow that pulled straight from the files each person was already using. No forcing new templates or anything. Adjusted for like 10 different formats. It updated at the click of a button he did the coding for on the master sheet. He brought his home laptop to his office and hooked it up to his monitors and keyboards with his work laptop sitting next to him standalone. He would play games and work on personal projects all day and took crazy long lunches. He would simply turn to his work laptop and click the button half hour before the meeting and then verify the slides,  maybe 5 minutes tops. He did this for 2 years. His replacement inherited the easiest job on earth but ran his mouth and ended up with more work and broke the template messing with it in an attempt to reverse engineer it. Ended up fired and they brought the new guy back to fix it and turn it over. \n\nMoral of the story: Automate what you can. Verify it is working daily. Keep it close hold. Enjoy the easy life.",
          "score": 25,
          "created_utc": "2026-01-29 05:48:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2deqbo",
              "author": "tcumber",
              "text": "Yep...even easier to do now with AI",
              "score": 5,
              "created_utc": "2026-01-29 07:26:08",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o29ve4q",
          "author": "Goggio",
          "text": "You are paid to deliver results not to sit in a seat.\n\nIf you are getting your work done (and not billing fraudulently), who cares? \n\nThey purchased your labor and set the expectation for ROI. You are just meeting the terms of a contract.",
          "score": 17,
          "created_utc": "2026-01-28 19:41:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2a3qhb",
          "author": "justtoaskthisq",
          "text": "What did you do to get this setup? I automated teams meetings to print out minutes in a format my company likes. But that's about it.",
          "score": 14,
          "created_utc": "2026-01-28 20:18:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2cdx7t",
          "author": "cbelt3",
          "text": "I did that some years ago. Took 2 weeks of analysis and reporting and data entry down to 1 day. And made the mistake of telling my boss I was bored. Then got all kinds of new projects. And finally ended up in IT.",
          "score": 13,
          "created_utc": "2026-01-29 03:06:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2bl4iq",
          "author": "ErikaNaumann",
          "text": "This is not quiet quitting. This is being intelligent and working smart. You should be proud! ",
          "score": 29,
          "created_utc": "2026-01-29 00:29:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2bbs8d",
          "author": "Defy_Gravity_147",
          "text": "No. Sit back and enjoy it. \n\nIf it looks like you're not busy enough, do it again.\n\nAlso recognize that this should be the ultimate mastery of the business analysts who work on projects with you. \n\nWho does the programming, reporting, decisionmaking, or work doesn't even matter. \n\nWhat matters is that we can take an entire system and make it smaller. The bigger the system, the better. And it all begins with those pesky requirements...",
          "score": 12,
          "created_utc": "2026-01-28 23:41:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2a1tu4",
          "author": "Ninesect",
          "text": "Teach me your ways?",
          "score": 10,
          "created_utc": "2026-01-28 20:09:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2boz0u",
              "author": "Reach_Beyond",
              "text": "I’m not OP. But right now I’m working on a legit way to get some automation to reply to teams messages. Just telling people general info that is found in a one note or linking project folders will save me an hour a day some days.\n\nSo I’d suggest start small with something that can actually save you 10 minutes a day and move from there.",
              "score": 6,
              "created_utc": "2026-01-29 00:49:59",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2c8c1r",
          "author": "Elegant-Tart-3341",
          "text": "I'm afraid of my boss finding out i automate 60% of my work after he told me he hates AI.",
          "score": 10,
          "created_utc": "2026-01-29 02:36:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2cfvqz",
              "author": "Ok_Journalist5290",
              "text": "Could i ask how? Am curious. Or just direct me to some topics and i will try to go from there.",
              "score": 7,
              "created_utc": "2026-01-29 03:17:56",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2cmg0a",
                  "author": "Throwaway1098590",
                  "text": "^ yes, same",
                  "score": 2,
                  "created_utc": "2026-01-29 03:57:14",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2c4l1w",
          "author": "MurkyComfortable8769",
          "text": "Spill the tea 🍵 We must know what you're doing.",
          "score": 18,
          "created_utc": "2026-01-29 02:15:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2d66t9",
              "author": "exWiFi69",
              "text": "Yes. It’s can’t be asana lol",
              "score": 1,
              "created_utc": "2026-01-29 06:14:40",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o29yb2h",
          "author": "Htinedine",
          "text": "Join the overemployed subreddit lol \n\nEither enjoy your life or get a second job and maximize income.",
          "score": 9,
          "created_utc": "2026-01-28 19:54:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2c2fit",
          "author": "vessel_for_the_soul",
          "text": "You should be rewarded and moved onto better things ",
          "score": 9,
          "created_utc": "2026-01-29 02:04:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2c4d40",
              "author": "blackcatpandora",
              "text": "lol",
              "score": 3,
              "created_utc": "2026-01-29 02:14:39",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2bbkgl",
          "author": "SheIsOnAStride",
          "text": "I'm so envious ",
          "score": 6,
          "created_utc": "2026-01-28 23:40:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2c6ttw",
          "author": "djangokill",
          "text": "You'll be CEO in no time!",
          "score": 8,
          "created_utc": "2026-01-29 02:27:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o29ytay",
          "author": "pmpdaddyio",
          "text": "Why is this a PM topic?",
          "score": 16,
          "created_utc": "2026-01-28 19:56:29",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qt9vkm",
      "title": "Agile loses the big picture, Waterfall fights every change — is there a middle ground?",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1qt9vkm/agile_loses_the_big_picture_waterfall_fights/",
      "author": "Neo772",
      "created_utc": "2026-02-01 20:32:06",
      "score": 32,
      "num_comments": 43,
      "upvote_ratio": 0.89,
      "text": "Agile focuses on short-term execution but often loses sight of where we actually want to get. \"We'll figure it out along the way.\" And the agile mindset rarely extends to budget and timeline, just scope.\n\nWaterfall is the opposite problem: everything is fixated on documents written months ago. Every deviation becomes a change request. Reality moves, but the plan most often doesn't.\n\nBoth lead to the same place: you either lack the big picture or you're fighting to keep it alive.\n\nAfter many years as a project manager across both agile and waterfall environments, I keep running into this issue. So I started thinking about what could solve this.\n\nThe idea: treat your project context, the sum of all valid project information, as a living single source of truth. Think of it like a git repository, but for project information instead of code.\n\nIn a nutshell:\n\n* External signals (client emails, meeting decisions, new requirements) get broken down into small, concrete updates before merging into the context\n* A human project manager / gatekeeper decides what gets merged, no auto-pilot\n* Every change explicitly shows its effect on time, budget, and scope together, no hiding behind one dimension\n* All stakeholders work from the same basis, breaking silo perspectives\n* AI can support with what-if scenarios, forecasting, and preparing updates, but the human decides\n\n**Example:** Vendor emails API will be 2 weeks late. This gets broken down into: +14 days on Milestone 3, +15k budget, option A (cut feature) or B (extend timeline). Visible before the next standup.\n\nThis is essentially what I call context-driven project management: it solves stale plans from Waterfall, limited view from Agile.\n\n**What's your current approach to keeping project context alive between planning cycles?**",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/projectmanagement/comments/1qt9vkm/agile_loses_the_big_picture_waterfall_fights/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o31jz2f",
          "author": "TheOneRatajczak",
          "text": "Develop in agile, deliver in waterfall is the best approach IMO",
          "score": 25,
          "created_utc": "2026-02-01 21:27:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o365y8j",
              "author": "Unusual_Ad5663",
              "text": "good reminder!",
              "score": 1,
              "created_utc": "2026-02-02 15:39:54",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o31n10r",
          "author": "PplPrcssPrgrss_Pod",
          "text": "All methodologies work. It's the people who make things efficient or inefficient.",
          "score": 15,
          "created_utc": "2026-02-01 21:42:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o33u5bx",
          "author": "pac_71",
          "text": "I love pointing out agile is just waterfall done small, fast and offen. Unfortunately poor execution trumps both every time.",
          "score": 14,
          "created_utc": "2026-02-02 05:13:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o326tit",
          "author": "PoutineFairy",
          "text": "WAGILE",
          "score": 11,
          "created_utc": "2026-02-01 23:24:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o32jsrl",
              "author": "OhItsBeenBroughten",
              "text": "Agifall?",
              "score": 3,
              "created_utc": "2026-02-02 00:35:35",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3aglxt",
                  "author": "mleroir",
                  "text": "Hopefully not Agifail",
                  "score": 1,
                  "created_utc": "2026-02-03 04:53:08",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o31g5eu",
          "author": "FlintHillsSky",
          "text": "Our dev teams work in Agile but we plan our projects in a more waterfall mode. We need to coordinate with multiple groups, some of which we don’t control. We have contractually mandated delivery dates.  It is a type of hybrid.",
          "score": 10,
          "created_utc": "2026-02-01 21:09:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o31hbxm",
              "author": "Neo772",
              "text": "That's a great example. When you coordinate across groups you don't control with fixed delivery dates, how do  you keep the project context current when external dependencies shift? That's where I see the biggest gap: the moment something outside your control changes, how fast does that impact become visible across all dimensions?",
              "score": 1,
              "created_utc": "2026-02-01 21:15:02",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o31ice8",
                  "author": "FlintHillsSky",
                  "text": "We need to get commitment from those outside groups well in advance. That is part of why we are working outside agile sprints.\n\nOf course you always have the problem of them not meeting their committed delivery dates but that‘s why you need an executive sponsor to reach out to their higher ups and apply pressure to meet the dates.\n\nThis is not new product development so we have a pretty good idea of how much time things will take. It’s more about customization for a particular customer. That is why we can live with contractually mandated launch dates.",
                  "score": 1,
                  "created_utc": "2026-02-01 21:19:54",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o31b42o",
          "author": "SadDoughnut1073",
          "text": "I think the biggest issue I see when it comes to the “Agile or Waterfall” argument is that all too often teams want to cherry pick instead of committing to a framework. I used to tell teams Adopt the Framework before you Adapt the Framework. \n\nHere’s what I mean… I was working with an Engineer who insisted that he didn’t want to do Agile, only Waterfall. I said okay, let’s work together to make a discrete plan. “No, I need opportunities for change”. Okay no biggie, let’s do the Agile thing and we can iteratively change things. “No, the ceremonies are stupid.” So now, we have a team that wants no plan/predictability for customers but also no constant communication, too. \n\nIn the end, I’ve noticed the best practice is to focus on the basics: delivery and communication. Then master fundamentals. Not as an attack, but Agile still has predictable long term solutions, and Waterfall can be a bit more rapid to response than you describe. But that requires teams remain faithful and disciplined to the whole framework not just the parts we like.",
          "score": 9,
          "created_utc": "2026-02-01 20:44:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o31e9st",
              "author": "Neo772",
              "text": "Fully agree on discipline and committing to a framework. What I'm describing isn't a replacement for either, it's the layer underneath. Whether you run Agile or Waterfall, both need a living project context that stays up to date. That's what reduces the friction you're describing, no matter which method the team commits to.",
              "score": 1,
              "created_utc": "2026-02-01 21:00:02",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o31fgy9",
                  "author": "SadDoughnut1073",
                  "text": "But the layer underneath you’re describing is still adherence to fundamentals. Like this context you’re describing is things the PM or a cognizant adult in charge should be doing. \n\nExternal signals - you’re describing communication, documentation, and stakeholder management. I mean what PM isn’t communicating and logging client emails, meeting decisions, and requirement changes?\n\nA human gatekeeper - so like a Chief Engineer and Configuration Management?\n\nBreaking down stakeholder silos - PMs job.",
                  "score": 3,
                  "created_utc": "2026-02-01 21:06:01",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o35t4i5",
          "author": "Kempeth",
          "text": "Agile and Waterfall are just two different answers to the same fundamental dilemma: ***lots of changes + lots of planning = LOTS of effort***\n\n1. You can be stingy with changes (waterfall)\n2. You can be stingy with planning (Agile)\n3. Or can throw the necessary man power at being generous with both\n\nNowhere in this dilemma is ANY reason why you would necessarily have the problem stated in your title. Unless you're conflating Big Picture with Big *Prediction*.\n\nThe reason why Agile doesn't do deep, long term predictions is because it knows them to be false. Nothing you propose gets around that. You're just pretending every cycle that you have a clearer view of the future than you actually have.\n\nAs for the Big *Picture:*\n\n>External signals (client emails, meeting decisions, new requirements) get broken down into small, concrete updates before merging into the context\n\n>A human project manager / gatekeeper decides what gets merged, no auto-pilot\n\nThis for example is the literal job description of a product owner.",
          "score": 7,
          "created_utc": "2026-02-02 14:35:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3194nc",
          "author": "Gadshill",
          "text": "Hybrid.",
          "score": 6,
          "created_utc": "2026-02-01 20:34:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o319q5b",
              "author": "Neo772",
              "text": "Hybrid is usually the first answer, and I get why.   \nBut in my experience most hybrid setups just combine the artifacts of both worlds without solving the core issue: there's still no single living source of truth that everyone works from. You end up maintaining a backlog AND a project plan AND a status deck AND reporting, and they drift apart continuously. The question is less about mixing methods and more about what holds the project context together.",
              "score": 1,
              "created_utc": "2026-02-01 20:37:31",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o31a9bv",
                  "author": "painterknittersimmer",
                  "text": "Sure, but that's a knowledge management problem, not a question of waterfall, hybrid, or agile.",
                  "score": 3,
                  "created_utc": "2026-02-01 20:40:08",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o31dbeo",
          "author": "Wndrunner",
          "text": "I feel Agile doesn't lose the big picture if you have people doing the right things. The big picture should be maintained in the roadmap. For that you have to have good Product people that actually own the product and have a vision and don't act like Business Analysts. They need to be able to have the difficult conversations with stakeholders.\n\nI don't feel Waterfall fights every change, but I do feel it advocates for a lot more overhead/admin work that gets in the way of delivery.",
          "score": 6,
          "created_utc": "2026-02-01 20:55:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o31faum",
              "author": "Neo772",
              "text": "Agreed, with strong product/project people the bigger picture is maintened. But the roadmap is just one piece. What about budget impact, risk changes, dependency shifts? Those usually live somewhere else. The real question is: when something changes, is there a clear process that ensures all dimensions of the project stay current? In most setups I've seen, that relies on the right person doing the right thing at the right time, not on a defined process. Are project updates really directly impacting all other factors?",
              "score": 1,
              "created_utc": "2026-02-01 21:05:11",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o31gidf",
                  "author": "Wndrunner",
                  "text": "IMO risks should be tracked by the Scrum Master. Not necessarily OWNED but I feel that's an SM task.\n\nAre you talking about multiple teams working on one product that has dependencies on each other? Or one team that has risks and dependencies on the work itself? Like task 1 has to be done before task 3? If the latter then I think that can be solved by how the team is writing stories and doing Sprint Goals.\n\nThis is just so dependent on how the company is set up. I'm not a fan of hybrid set up. That's just holding the team, and ultimately the company, back from delivering as often as it could.\n\nI would automate as much as possible or build this tracking into the process some how.",
                  "score": 1,
                  "created_utc": "2026-02-01 21:11:06",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o31hiqs",
              "author": "hala_mass",
              "text": "2nding this. Good product owners, analysts and leaders will provide the background admin work to make sure it's all going in the right direction, with scrum masters doing everything they can to shield the team from that admin chaos.",
              "score": 1,
              "created_utc": "2026-02-01 21:15:56",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o34e53f",
          "author": "WorkingWafer1653",
          "text": "The point is that there is no single perfect framework because each project/team/company is different, but I would also say that the 80% of PM totally misunderstands Agile. Usually I see PM thinking that using Scrum = Agile, which is very damaging in the long run.\n\nFirst, I think we need to clarify that projects happen in 3 macro contexts: \n\n- Discovery: no long term plan can be done since there are a lot of unknowns.\n- Execution: the majority of the unknowns have been dealt with so it is possible to plan reliably.\n- The pain zone between them: what you have to figure out as a PM.\n\nAs biased human beings, we wanted to achieve visibility, predictability and control, which quickly became THE incentives behind the PM. This brings us to create work systems that are suited to the needs and anxieties of Stakeholders and PMs, not of the actual people doing the work. \n\nThis is what led to the creation of Agile, where the intent was TO IMPROVE team efficacy by focusing on clarity over process, on the right goals that brought real value and on environment changes.\n\nAgile is about leadership and constant improvement, not 2 week sprints without plans.\n\nHaving said that, in order to set clear expectations with everyone involved in the project and understand the context in which it happens I use these six parameters: \n\n- Innovation needed \n- Uncertainty of the outcome\n- Rate of change\n- Cost of change \n- Controllability of the environment (how much the market/regulations/whatever is expected to change)\n- Impact of failure\n\nThe first three tells you if you're in the Discovery phase, while the last 3 tells you if you're in the execution phase. \n\nBy using these, I've been able to negotiate more realistic goals and timelines and create better processes overall since they allow you, and most importantly stakeholders, on what the context of the project really is and what is needed to deliver value.",
          "score": 5,
          "created_utc": "2026-02-02 08:03:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o31ah4b",
          "author": "featurist",
          "text": "Agree that a Hybrid approach is the answer. \n\nAlso, I disagree with the idea that waterfall is not able to change. \nBut an experienced PM will be able to understand the size of that change and determine if a CR is needed - or if the change still fits into the planned work.",
          "score": 4,
          "created_utc": "2026-02-01 20:41:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o31ba41",
              "author": "Neo772",
              "text": "The question is: where does the assessment of that change happen? In my experience it's often in someone's head or a meeting, and the impact on timeline and budget only becomes visible weeks later in a report. The idea here is to make that effect explicit and visible the moment the change comes in, not after the next steering committee.",
              "score": 1,
              "created_utc": "2026-02-01 20:45:11",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o31roly",
                  "author": "Steyene",
                  "text": "If no one is able to articulate what a change being proposed will do to schedule/cost/scope regardless of approach there are bigger problems.\n\nIf waterfall, the Project Manager should be articulating that potential risk/impact to the sponsors.\n\nIf Agile and the team is self empowered to make decisions those should be getting socialised, as again there are stakeholders involved.\n\nIf I need to pivot with my projects (agile/waterfall/wagile) while the specifics may be fuzzy, the broad strokes should be evident.\n\nThis change will cost \\~X days/weeks of effort and comes with A/B/C new risks.",
                  "score": 3,
                  "created_utc": "2026-02-01 22:05:06",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o325nx9",
          "author": "kytsym",
          "text": "In my experience as the work (project or otherwise) ages and as you move through sprint after sprint, gate after gate and if the team are behind schedule, pressure is building up in the system the \"why\" becomes secondary and focus shifts to delivery, time, cost, scope questions, more resources, stressful reporting & governance. \"We got to hit this milestone, change means time/cost\" etc.\n\nI've found that keeping context and the why to the fore using moments like our showcase/retro ceremonies, formal test cycles with end user, sprint and quarterly planning, and the inspection/interrogation meetings have provided BEST way to keep returning to the \"why\". \n\nEach one of those moments is an opportunity to anchor back to the why. It then enables decisions about cost, scope, people, dates to be about that. When we open our showcase, first slide/talking points are the why, each sprint plan we remind the team of the why, and the governance forums/meetings again we preface with the why. \n\n9/10 of my stakeholders, funding approvers, managers already have 10 other things on their plate, so context for them is CRITICAL - and by amplifying it in all of those opportunities has smoothed out all of those bumps along the way.",
          "score": 4,
          "created_utc": "2026-02-01 23:17:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o31fqrw",
          "author": "Unicycldev",
          "text": "Frameworks are a distraction. Agile and Waterfall are non-productive jargon.",
          "score": 6,
          "created_utc": "2026-02-01 21:07:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o31h9ek",
              "author": "Neo772",
              "text": "I agree",
              "score": 0,
              "created_utc": "2026-02-01 21:14:42",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o32nxqw",
          "author": "TomOwens",
          "text": "I don't agree that \"Agile focuses on short-term execution but often loses sight of where we actually want to get.\" Maybe implementations do, but agile methods themselves don't. [Scrum](https://scrumguides.org/) is an Agile method - the Product Goal is where we want to get, and [Evidence-Based Management](https://www.scrum.org/resources/evidence-based-management) pairs nicely with Scrum to add vision and mission statements and a Strategic Goal. [DSDM](https://www.agilebusiness.org/dsdm-project-framework.html) is another Agile method - the Business Visionary and Technical Coordinator roles exist explicitly to keep the focus on the project or product vision and ensure that the architecture supports it. The inability to focus on the long term while taking short-term steps is not a failing of agile, but of how organizations become agile.\n\nBut it's also important to recognize that it's not a binary choice between agile and waterfall. I wouldn't even use \"agile\" for the name of one end of that spectrum. The PMI uses \"adaptive\" and \"predictive\" as the ends, which seem like reasonable names. The question is how much adaptivity or predictability makes sense for your context. Every context is different - some can plan for many months ahead, and only the most drastic events will invalidate those plans, while others have so much uncertainty and ambiguity that planning more than a few days is wasteful.\n\nThe challenge is determining your planning horizon, given the risks, assumptions, and ambiguities. Even within your planning horizon, the level of uncertainty affects how much you can plan up front versus how much you can plan iteratively or incrementally, and stakeholder involvement determines how frequently you can synchronize and reevaluate your plans. But this is how I keep the context alive - carefully considering how long the team can dive into their work before resurfacing to sync with stakeholders.",
          "score": 3,
          "created_utc": "2026-02-02 00:58:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o333rho",
          "author": "Unusual_Ad5663",
          "text": "Been using the ROPE framework to run projects for years. It is less about artifacts and rituals, and more about living controls you use every day as you work through the project cycle. It’s a hybrid.\n\nThe intent is to help PMs reduce admin work and improve project flow, not add more admin, meetings, and overhead. Might not be your fit, but it works well for us.",
          "score": 3,
          "created_utc": "2026-02-02 02:28:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3anbav",
          "author": "Fantastic-Nerve7068",
          "text": "yeah this is the tension a lot of teams feel but don’t have words for. agile vs waterfall is usually framed as process, but the real gap is shared context. plans go stale or get chopped into pieces and no one sees the whole thing anymore.\n\nwhat you’re describing makes sense because it forces every change to answer the same questions upfront. what moved, why, and what it costs us. when teams do this informally it works, the problem is it’s rarely written down in one place people trust.\n\ni’ve seen this work best when there’s a single owner who curates reality and keeps it honest. tools and AI help with scenarios, but the discipline of updating context is what actually keeps the big picture alive.",
          "score": 3,
          "created_utc": "2026-02-03 05:42:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o31ad73",
          "author": "thepminyourdms",
          "text": "Shape Up",
          "score": 0,
          "created_utc": "2026-02-01 20:40:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o32pcds",
          "author": "pmpdaddyio",
          "text": "Well, waterfall has not been in use since the seventies, but predictive on the other hand works very well with a solid change control process. You plan, then iterate. It also drives ROI.",
          "score": -8,
          "created_utc": "2026-02-02 01:06:29",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1quiyut",
      "title": "Overwhelmed.",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1quiyut/overwhelmed/",
      "author": "JerrycurlSquirrel",
      "created_utc": "2026-02-03 05:03:21",
      "score": 29,
      "num_comments": 17,
      "upvote_ratio": 0.95,
      "text": "I have a 20+ year history if being handed a pile of shit and fixing it.  I fight my way out and fix it.  (I.T.).  Now I have taken a role where I' the architect of moving a 300 person org from Lotus Notes to M365. \n250 in the US, 25 in India, 25 in China. AND we are doing mergers and acquisitions AND we are a working with defense contractors and sensitive data between multiple divisions AND an existing GCCH tenant at another 300 man division (720 ppl total) AND... The CEO ans CISO are asking for a level of collab between them that is very unrealistic given security.   I'm pissed off the scale keepa changing, the directives, desires, wants. It was out of control day 1. Im 2 months in and with a family to depend on me.  I've laid a lot of ground work but analysis paralysis has been baked right into the position - we dont know what we dont know about the sensitivity of this data.  I shoot now and \"ask for forgiveness\" later and its been ruffling feathers.\n\nI am not a PM. There are too many fucking moving parts. \n\nI woukd just say lets migrate the mailboxes and tackle the next part - best case. I migrated the first  mailbox only today because of bureacracy, delays and shitty vendors.  The boss is understanding.\n\nEveryone wants to cross all bridges at once.  \n\nI say piecemeal the hell out of this and get it done fast but what I need is a formal presentation to set expectations and focus but leadership cant stop changing the focus to look into how it can serve a brand new consolidation effort for example.  Everytime i turn around its this nuke and pave attitude.\n\nChange everything everywhere. Like building the winchester mansion out of quicksand.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/projectmanagement/comments/1quiyut/overwhelmed/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o3ak829",
          "author": "Mechanical_Monkey",
          "text": "How do you eat an elephant? Piece by piece. Don't be overwhelmed. Follow good PM practices. They exist for a reason. Start with proper planning: scope, budgets, resources, timing. Go to management / your sponsor to get their official buy-in. That sets the right expectations. Then kick it off with the team. You can't do it all alone  you will need to delegate and get your team involved, define work packages and track them. Think large scale waterfall, execution agile (or however you call it). Don't forget to have fun doing it, we don't get time back. ",
          "score": 20,
          "created_utc": "2026-02-03 05:19:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3akm0x",
              "author": "JerrycurlSquirrel",
              "text": "Thank you",
              "score": 3,
              "created_utc": "2026-02-03 05:22:06",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3bxv42",
                  "author": "wittgensteins-boat",
                  "text": "\n\nYour task in large part is to educate the people who want stuff done who haven't got the slightest idea how complicated the  desire will be to accomplish. \n\nDelegate and document. Ask for aid in documenting, so you begin to have a basis for constucting an incremental plan.  \n\n\nGet onto a document all of the security concerns, and company killing consequences of breaches of security.  \n\nThis aids in creating a partial outline of why incremental steps and verification are required.\n\nDescribe how these legacy applications have been relied on for years, for reasons, and the need to verify the new applications accomplish what is being used now. \n\n\nShiny new scope changes require time, effort, attention of many participants, money, coordination, checking for fit of purpose, data migration and security.  \n\nNone of that occurs in a day, week or month.  \n\nChecking that each step is working as intended takes time. \n\nIncremental success and verification  is your defense from \"do it all now\" urgency.\n\nHave an ongoing status list / database / report, for your own benefit,  of what blocks and delays each incremental step.  This is the basis for your weekly newsletter on next steps, and explanation as to why it takes time.",
                  "score": 5,
                  "created_utc": "2026-02-03 12:33:56",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3b4a8p",
          "author": "dhemantech",
          "text": "Sounds like a fun project. Stating the obvious here. Decompose and wbs the hell out it.",
          "score": 11,
          "created_utc": "2026-02-03 08:11:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3e93ub",
          "author": "More_Law6245",
          "text": "I too for a very long time was thrown to wolves for all the dumpster fire projects and programs, I became the pinch hitter for all the projects and programs that had gone off the rails and to be honest there have been a few that left me scratching my head. \n\nMy rules are 1. Just breathe 2. Remember no one is going to die in a ditch over a project (unless it's you putting them in one) 3. Go back to project management 101 principles of time, cost and scope. \n\nGo back and ensure the business case is fit for purpose, if you don't have a proper business case then ensure one is developed but here is the key ensure your executive has approved it. Saying \"we want to upgrade\" is not a business case, a business case is required to ensure they understand the business value and describing its purpose of implementing and how the project will generate it's value. \n\nThen start with your technical requirements, user requirements and business workflows (conduct your 1:1 meetings, workshops, requirement gathering work groups etc.) and map those to a design and the key here again, have the executive sign and approve the requirements.  Focus on roles and responsibilities along with accountability, if the organisation can't provide the information you need then your project board or executive carry the risk of not reaching benefits realisation and end up in project failure.  Not being a PM, you need to follow this principle workflow because if you don't you're being set up to fail but as the \"responsible person\" it's the path that you need to take to avoid a shit show and get out of the quicksand requirements. Hold people accountable or push back, those are the choices you have and if you don't you will be held as the scapegoat at the end of a failed project. \n\nHere is the reality, if you can't get the requirements and design approved then you need to keep on pushing out the end date of delivery, or you place the risk at the feet of your executive to except. You as the default PM need to provide the clarity needed in order to make the decisions needed and the only way you can do that is develop the design and requirements mapping as your primary focus because you need a clear plan and have it approved. Good luck \n\nJust an armchair perspective \n\n",
          "score": 7,
          "created_utc": "2026-02-03 19:26:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3f2pkl",
          "author": "RedactedSoul1",
          "text": "Yeah, this just straight up sucks. Anyone who’s been in the trenches knows this isn’t a “migration,” it’s a constantly moving target with zero stable decisions and way too many damn cooks. The scope creep, the “oh and also…” requests, and leadership wanting everything changed at once is exhausting as hell.\n\nYou’re not wrong for being pissed. This is what happens when no one wants to make hard calls but everyone wants results yesterday. Total shit show.",
          "score": 5,
          "created_utc": "2026-02-03 21:44:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3f9za5",
          "author": "moochao",
          "text": "HOLY SHIT LOTUS NOTES!!! Good christ I haven't thought about that absolute shitshow of a solution from my first jobs in well over a decade.\n\nThanks\\* for that painful gross nostalgia.",
          "score": 5,
          "created_utc": "2026-02-03 22:19:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3d9q5j",
          "author": "Daywalker85",
          "text": "I quit yesterday. Put my 2 weeks in. Taking a leap of faith.",
          "score": 3,
          "created_utc": "2026-02-03 16:45:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3di3zn",
              "author": "JerrycurlSquirrel",
              "text": "If my boss said my new job was sucking dick I'd have to do it until I landed a new job because I have a family. (US)\n\nYes i know, lawsuits, Im paraphrasing",
              "score": 1,
              "created_utc": "2026-02-03 17:23:58",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3gucoj",
                  "author": "0ldRoger",
                  "text": "\nFirst of all take a deep breath. Nobody’s going to die here, it’s not a moon landin, human life is not at stake.\n\nMake them understand that they can not treat everything as one giant problem, and remember that you are talking to executives, they are drowning under a constant flow of information at any given moment, so be concise, linear and decisive. Follow this simple framework : here’s the problem, here’s my solution, here’s what I need from you. \n\nRemember YOU are the expert, it’s your call.\n\nIf you can’t fix the scope, you need at least hard boundaries. Freeze the goalposts, move one inch at a time, slice by slice, show some wins, even exaggerated ones.",
                  "score": 1,
                  "created_utc": "2026-02-04 03:29:29",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3dyl3s",
          "author": "Magnet2025",
          "text": "Do you know anyone at EY? They did the big transition from Lotus Notes + a hodge podge of applications a few years ago. \n\nA good friend of mine is fairly senior at E&Y and said it was fairly smooth behind the scenes. I worked for Microsoft at the time and was reading internal reports about the project. \n\nI looked up a couple of things that might help. \n\nAlso, and I can’t stress this enough: get an Adoption and Change Management (ACM) person involved **now.** Some people are very attached to Notes and have performed unsupported customizations that give them their data in specific ways. Give the users a voice or the project will not be successful. \n\nThere are tools that will make it much easier. Transfer the risk to the tools (and consultants). Way back when, working for a Microsoft partner, we had a client who decided they could do the migration on their own through some scripting and manual effort. And….boom, Notes crashed with huge data loss because they hadn’t planned on customizations that people had done with Notes. We were able to recover the data from a backup and did the rest work after attending a farewell party for the CIO. \n\nhttps://www.google.com/gasearch?q=ernst%26yoing%20migration%20from%20lotus%20notes%20to%20microsoft%20365&source=sh/x/gs/m2/5#lfId=ChxjMe\n\nhttps://learn.microsoft.com/en-us/exchange/mailbox-migration/migrate-from-lotus-notes\n\nHope this helped.",
          "score": 3,
          "created_utc": "2026-02-03 18:38:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3glsfl",
          "author": "dearcamus",
          "text": "Do you have a team or can you create a working group that can eventually become a committee? Or are you a team of 1? I’d say start with the governance and delegate the scoping tasks to different experts, even if it’s just a few people. What you are expected to do does sound very overwhelming and if working solo, it’d take months and months to only find the scope to be constantly changing by the leadership.",
          "score": 2,
          "created_utc": "2026-02-04 02:40:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3gnnve",
          "author": "allaboutcharlotte",
          "text": "Lordy… I’m come to realize that most projects fail or fail badly. My goodness.., I wish you luck",
          "score": 2,
          "created_utc": "2026-02-04 02:50:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3gvs0z",
          "author": "Independent-Diver929",
          "text": "This does not sound like a technical problem. It sounds like an unbounded decision problem disguised as a migration.\n\nWhat you are describing is what happens when sequencing is never agreed on. Everything becomes critical, everything feels coupled, and the role quietly turns into absorbing organizational anxiety instead of moving work forward.\n\nFrom the outside, your instinct to migrate mail first and defer the rest is not reckless. It is one of the few moves that actually creates a stable surface to stand on. The paralysis you are feeling is what happens when leadership wants certainty about risks that cannot be fully known until something exists.\n\nThe tension with security and collaboration is also familiar. Executives often ask for “maximum collaboration” and “maximum protection” as if they are independent knobs. They are not. Someone has to name the tradeoffs, or the work never converges.\n\nWhat usually helps in situations like this is not another technical plan, but a reset of expectations. A clear articulation of phases, what questions can only be answered later, and what decisions are intentionally deferred. Without that, every new initiative will keep reentering the conversation and reshaping the scope.\n\nYou are not wrong to feel frustrated. You are being asked to build forward while the target keeps moving. That is not a failure of execution. It is a failure of alignment.",
          "score": 2,
          "created_utc": "2026-02-04 03:38:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3htajp",
          "author": "Economy_Pin_9254",
          "text": "This isn’t a delivery problem. It’s a decision problem that’s been handed to you and labelled “project”.\n\nThe issue isn’t the tech — it’s that leadership is trying to solve strategy, security posture, M&A, and consolidation inside a single migration. That guarantees paralysis. You can’t design a target state when the target keeps moving.\n\nYour instinct to sequence this is right. Mailboxes first isn’t cutting corners, it’s containment. The fact one mailbox took two months tells you how misaligned the system is.\n\nWhat’s missing isn’t a better plan, it’s a boundary. Until someone above you owns what is *in* and what is *out*, the problem will keep expanding and you’ll keep absorbing it.",
          "score": 2,
          "created_utc": "2026-02-04 07:51:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3b7npg",
          "author": "New-Ad2331",
          "text": "This sounds overwhelming! Sorry you are dealing with this.",
          "score": 1,
          "created_utc": "2026-02-03 08:44:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3bq6h6",
          "author": "JobsiteSignals",
          "text": "I sincerely wish you luck.  That is a ton of moving parts.",
          "score": 1,
          "created_utc": "2026-02-03 11:36:35",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qu4gsm",
      "title": "Tips to engage with c suite",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1qu4gsm/tips_to_engage_with_c_suite/",
      "author": "captn03",
      "created_utc": "2026-02-02 19:11:27",
      "score": 26,
      "num_comments": 31,
      "upvote_ratio": 0.96,
      "text": "I am struggling to connect with the executive sponsor for my project. I dont know why but I seem to understand things more clearly when speaking to the Director for this project. I dont have much experience dealing with c suite but it feels like they speak a different language. Stuff they say goes over my head and having a hard time to connect the dots. I would like to have an engaging dialogue but I feel like Im behind or lacking when it comes to \"strategy\" conversations. Also Im afraid of asking so many questions since it will make me look inexperienced or not ready for this project.\n\nWhat are some tips to start thinking and being able to converse intelligently with my executive sponsor. Am I overthinking this?",
      "is_original_content": false,
      "link_flair_text": "General",
      "permalink": "https://reddit.com/r/projectmanagement/comments/1qu4gsm/tips_to_engage_with_c_suite/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o3alzzt",
          "author": "Fantastic-Nerve7068",
          "text": "execs talk in outcomes, risk, money, and trade offs, not steps or details. before the convo, translate your project into 2 or 3 bullets like what decision is needed, what could go wrong, and what happens if we do nothing. asking clarifying questions framed around impact doesn’t make you look junior, it makes you look like someone who’s trying to land the plane.",
          "score": 19,
          "created_utc": "2026-02-03 05:32:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3goqxv",
              "author": "captn03",
              "text": "Great points.ill keep this in mind.",
              "score": 1,
              "created_utc": "2026-02-04 02:56:52",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o37nlt4",
          "author": "bluealien78",
          "text": "One thing I've learned through experience is that every piece of info you put in front of an exec should be clear enough that they understand what they're supposed to do with that info. \"JFYI\"s aren't a good use of their time. \"This is important because \\[we need to celebrate/we need more funding/we need to rebaseline/we need an escalation/we need messaging from you\\]\" has always been far and away more effective for me. Once there's a decision needed or an action taken, they engage.",
          "score": 13,
          "created_utc": "2026-02-02 19:46:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o38e20g",
              "author": "mf0723",
              "text": "I second this. The more \"FYIs\" you put in front of them (whether they are *actually* FYIs or they *feel* like they're FYIs) the less they will look at your input as helpful. \n\nTailoring communication for c-suite will most likely require more direct, \"active\" communication; but really you have to know your audience and what they need, expect, and desire from you and your interactions, which is helpful for interacting with anyone at any level.",
              "score": 2,
              "created_utc": "2026-02-02 21:51:02",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o38exl4",
                  "author": "bluealien78",
                  "text": "I'm not a C-level, but I am in upper management. I recently received a status report email that took 3 paragraphs to describe the what and the why of a program being renamed from \"name A\" to \"name B\". It was 3 paragraphs of FYI. I found it so deeply irritating. I don't need to know how or why such an inconsequential decision has been made. Just tell me the change in a single line.\n\nIf my level of irritation at that was so high, I can't imagine how our CISO and CTO reacted (they were on the To: line also).",
                  "score": 3,
                  "created_utc": "2026-02-02 21:55:11",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o3grebd",
              "author": "captn03",
              "text": "I definitely needed to hear this. I'll avoid the fyis without context.",
              "score": 1,
              "created_utc": "2026-02-04 03:12:10",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3ajyim",
          "author": "Chicken_Savings",
          "text": "4 tips:\n\n1. Understand what you want from the conversation / presentation.  Approval to do something?  Decision on something?  Inform them on something?  Showcase your own success?  Frame the conversation / presentation to achieve that objective - if you need a decision, get to that point quite early.\n\n2. Conclusion first, explanation after.  Tell them the conclusion first - they may not have time or attention to hear your lengthy argument and logic.  They can assign someone else to check your work later, or just trust you.  The worst situation is when you carefully explain your logic and argument, then the audience unexpectedly has to cut the meeting short and walk out before you got to your conclusion (or someone talks too much and drags it out, and you run out of time before the conclusion).\n\n3. Focus on the positives.  A C-level told me to my face: \"We spend all day listening to problems, I don't want to hear every problem you have as well.\"  So, focus on your positives and successes.  Construct it as a shit sandwich - good news first, put the bad news in the middle, then end with more good news.  Don't hide the bad news, risks, issues, but don't make that the focus of your presentation.\n\nLooping back to the first point, consider what you want to achieve with presenting the bad news - just informing them, covering your ass, asking for approval to do something, asking for decision to do something.  If it's just informing them, keep it crisp and clear and don't let it take too much time.\n\n4. Execs like to show their success to others.  Create your presentation in a way that Execs can forward to others showcasing success, even if it is a shit sandwich.  Add some context in appendix for outsiders to better understand the project.  Place your name prominently on the first slide.  When your Exec forwards your presentation to other execs, in order to showcase \"his\" success in \"his\" project, some of the glory also drips down on you.",
          "score": 13,
          "created_utc": "2026-02-03 05:17:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3bjk0r",
              "author": "vespatic",
              "text": "all of these are very good points. about #1, keep in mind you are not making small talk, you are making a request/giving an update. get straight to the point. if you cannot frame what you are going to say as clearly as that, then you don't really have something to say...\n\nabout #2, my rule of thumb is to go entirely top-down and only provide details if they ask for them. top-level description would be \"we cannot do this because \\[single sentence reason\\], so we need \\[request\\]\". keep in mind the \\[reason\\] is not an explanation!",
              "score": 2,
              "created_utc": "2026-02-03 10:38:57",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o3gpdnv",
              "author": "captn03",
              "text": "Appreciate the advice. This is very helpful.",
              "score": 1,
              "created_utc": "2026-02-04 03:00:29",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3fvc74",
          "author": "ButterscotchNo7232",
          "text": "Remember that the project you spent months managing is likely just one point on a report the exec sees once a week. Frame the update or request with that in mind.",
          "score": 7,
          "created_utc": "2026-02-04 00:12:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o39mtmf",
          "author": "Lereas",
          "text": "I don't know specifically what you are struggling with, but whenever I talk to anyone in the C-Suite, I start with \"DAYS & DOLLARS\" only. Are we on track to the most recently announced milestones, and are we on track to keep to the budget? If so, I just say we are and that's it. If we have a problem, I give a very high level reason. \n\nI always have stuff in my back pocket with details in case more questions are asked, and I'm also never afraid to say \"let me get back to you later today or tomorrow with that answer.\"\n\nI'll also occasionally send emails that are maybe 4-5 lines long with the days & dollars, but then have something like \"If you are interested in the additional details, see below the line. And then I do a few dashes and put a \"manager level\" summary that has further details. This helps prevent a bunch of back and forth emails with clarifications since they can just read them, and then ask questions about the details if necessary.",
          "score": 4,
          "created_utc": "2026-02-03 01:51:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3gqocy",
              "author": "captn03",
              "text": "Thank you. Im lacking the additional details that are being asked so I'll need to work on that.",
              "score": 1,
              "created_utc": "2026-02-04 03:07:57",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3gr3od",
                  "author": "Lereas",
                  "text": "If you're being told to communicate to c-suite and they have specific expectations that are NOT given to you ahead of Time, that's a serious issue.\n\nIn that case I'd email the execs you're presenting to before the next one and say that you want to be sure you cover all the details they will need so if they could give you a quick list of what they need in the presentation, you'd appreciate it.",
                  "score": 1,
                  "created_utc": "2026-02-04 03:10:26",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o37si81",
          "author": "pmpdaddyio",
          "text": "I would take what you are presenting, discussing, or even your agenda and run it through AI. \n\nRole - I need you to advise me on approach, topics, and key discussion points for presenting data to the following C Suite Executive \\[enter CEO, CFO, etc here\\].\n\nAsk - Please review my \\[fill in project artifact such as report, etc\\] and provide me with key talking points appropriate to the executive mentioned above\n\nContext - My goal is to create more appropriate messaging to this level of executive in order to determine future messaging.\n\nFormat - \\[this is on you, here is a suggestion\\] - provide me with a simple bulleted list with talking points and summaries. Add some time structure to them and concentrate on the key topics identified in the \\[artifact you listed\\]. The meeting is \\[x hours/minutes, etc.\\] long.\n\nThis script should start helping you get acclimated to the type of communication a C Suite person want to hear.\n\nAlways think thousand foot view, not ten foot view.",
          "score": 7,
          "created_utc": "2026-02-02 20:09:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3gr86g",
              "author": "captn03",
              "text": "Ill give this a try. Thank you",
              "score": 1,
              "created_utc": "2026-02-04 03:11:10",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3952gd",
          "author": "More_Law6245",
          "text": "Something for your consideration and reflection, I might suggest that you focus on the way that you communicate and who your target audience is (you should be doing this with every project stakeholder and tailor accordingly), you need to understand is that a c-suite doesn't need to be technical or be in the weeds on any given subject, what they need is high level concepts, strategy and any risk or impact to them or the organisation, anything else to them is just noise in which they don't want or need.\n\nI would also bode the question, do you think you would look any sillier by not asking questions then making an assumption and getting it wrong? There is nothing wrong in asking questions, what is wrong is when you don't and it bites you in the behind, that is when you do look inexperienced and as they say there are no stupid questions!  This is purely a confidence thing and a good project practitioner pushes through their comfort zone in order to successfully deliver their projects.\n\nI would also suggest seeking out two mentors firstly a senior project or program manager (and not your immediate manager) and the other is seeking out an executive to help you develop your business acumen (business savvy).\n\nWhen communicating with the c-suite, it needs to be short, concise and to the point and ensure that you communicate in what you need from them. Bullet points is your friend but think in terms of current problem, impact and what do you need from them, simple.\n\nJust an armchair perspective.",
          "score": 3,
          "created_utc": "2026-02-03 00:11:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3gr3k6",
              "author": "captn03",
              "text": "Very good advice about getting out of my comfort zone and just asking the questions!\n\nAlso the mentorship is really what I need to elevate my experience in program management.",
              "score": 1,
              "created_utc": "2026-02-04 03:10:25",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o39q9i9",
          "author": "luvnuts80",
          "text": "When working with execs, who often have the attention span of fleas, KEEP IT SIMPLE.\n\nIf they want more details, they'll ask. And if you don't know, never ever say you do not know.  Rather, go with something like, you'll get back to them.\n\nFrom \\*\\*my\\*\\* experience, they often aren't going to know the real details of the project, and often they won't care.  They may babble in corporate speak to sound informed.  Your expertise is to get into the weeds, know the weeds, and love the weeds.  You are not responsible for communicating the details of the weeds to them.  That probably should go with your immediate supervisor.  Again, keep it simple.\n\nWhen I present project status to the execs, I make it monkey proof.  I have the main project drivers lit up in three colors.  Green equals its on track.  Yellow means I have concerns, but no issues yet.  Red means we have serious problems and the sky is falling.  It should never get to red, and if it does, they know about it before the presentation.\n\nHope that helps.  Consider taking Toastmasters if you really wanna upgrade your public speaking skills.",
          "score": 3,
          "created_utc": "2026-02-03 02:10:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3enc0b",
              "author": "Low-Illustrator-7844",
              "text": "A friend of mine recommended toastmasters to me before. Is it really worth it?",
              "score": 2,
              "created_utc": "2026-02-03 20:33:48",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3er5ak",
                  "author": "luvnuts80",
                  "text": "Heck yeah it is.\n\nI did it for a few years.  It will transform your life.  It builds confidence, especially when speaking in front of a large audience.  \n\nI can’t recommend it enough.",
                  "score": 2,
                  "created_utc": "2026-02-03 20:51:34",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o3gqd04",
              "author": "captn03",
              "text": "The exec im dealing with is the complete opposite from my usual experience they want to get into all the details. At my org PMs dont typically get into all the weeds and are dependent on the Business/IT leads or SMEs. I guess im just struggling to provide all the details that are being asked.",
              "score": 1,
              "created_utc": "2026-02-04 03:06:07",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3gyy63",
                  "author": "luvnuts80",
                  "text": "Got it.  You might consider meeting with that exec in a one on one dynamic as that might be easier than in a meeting with a bigger audience. \n\nI’ve had execs who like to get into the weeds in front of other execs to show off and to basically flex.  Then they eventually lose interest once they see the project is running smoothly.",
                  "score": 1,
                  "created_utc": "2026-02-04 03:57:43",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o39usij",
          "author": "mrskljackson",
          "text": "Execs like elevator speeches- something you can update them on as short as the elevator ride up a few floors. Keep conversations short and high level. If they need details, they’ll ask.",
          "score": 3,
          "created_utc": "2026-02-03 02:36:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o37hzh6",
          "author": "lals80",
          "text": "It all starts at the beginning of the project and ensuring you know their requirements and expectations of the project. That is a foundation you can go back to as you discuss status with them. Keep in mind most at that level will have no idea what it really takes to complete the project. Understanding their expectations allows you to just get in and get out which should be your goal with the c-suite. I would also prep with your lead before going in to get coaching on what they will want to hear.",
          "score": 2,
          "created_utc": "2026-02-02 19:19:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3grx8z",
              "author": "captn03",
              "text": "Thank you, theres a ton of ambiguity and sensitivity so this makes sense.I dont have the proper mentorship and coaching at this org so trying to navigate best as I can.",
              "score": 1,
              "created_utc": "2026-02-04 03:15:11",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o39mihq",
          "author": "highdiver_2000",
          "text": "Who, What When How in as little slides as possible.",
          "score": 1,
          "created_utc": "2026-02-03 01:49:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3gluxi",
          "author": "Agreeable_Emotion163",
          "text": "You should always be solution-oriented when interacting with leadership.\n\nA few quick, very rudimentary templates\n\n\\- \"I did \\[your approach\\] because \\[the rationale\\] to achieve \\[the outcome\\].\"  \n\\- \"\\[your proposed solution\\] works because it will lead to \\[the outcome\\] through \\[the rationale\\]\"\n\nthe general rule of thumb here is just make sure to always revolve about the solution and impact. I genuinely think this is just a good way to interact with busy people overall.\n\nIf you do have questions, provide thorough context as to why these questions matter and what the impacts are. People generally don't get bothered by questions unless the questions don't really lead to anything.",
          "score": 1,
          "created_utc": "2026-02-04 02:40:36",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qpstpo",
      "title": "Companies actually pay PMs to share their knowledge?",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1qpstpo/companies_actually_pay_pms_to_share_their/",
      "author": "Designer-Jacket-5111",
      "created_utc": "2026-01-29 00:13:47",
      "score": 25,
      "num_comments": 8,
      "upvote_ratio": 0.93,
      "text": "A colleague told me she makes extra income doing paid consultations where companies interview her about project management processes, tools, methodologies, and so on. It sounded unusual, but she says it's legitimate.\n\nApparently, market research firms and consulting companies pay to talk to actual practitioners instead of just reading case studies or vendor materials. She's making anywhere from $100-300 per call and does maybe 5-6 per quarter.\n\nIs this a real thing, or is she in some unique situation? It feels like if companies were actually paying for this kind of knowledge, more people would be doing it. But it also makes sense that they'd want to talk to people who actually do the work versus consultants who've never implemented anything.\n\nHas anyone here done this?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/projectmanagement/comments/1qpstpo/companies_actually_pay_pms_to_share_their/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o2bhzvt",
          "author": "AutoModerator",
          "text": "Attention everyone, just because this is a post about software or tools, does not mean that you can violate the sub's 'no self-promotion, no advertising, or no soliciting' rule.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/projectmanagement) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-29 00:13:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2blf5z",
          "author": "Lurcher99",
          "text": "r/expertnetworks\n\nPM me if anyone needs a referral to almost all of them",
          "score": 11,
          "created_utc": "2026-01-29 00:31:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2boui6",
          "author": "MattyFettuccine",
          "text": "I do it a ton but for specific software vs general PM’ing. Usually charge $450/hr, sometimes up to $750. I know an engineer who charges like $1,600 per call, it’s insane.",
          "score": 10,
          "created_utc": "2026-01-29 00:49:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2bi5jn",
          "author": "Latter-Giraffe-5858",
          "text": "Yes, it's real. I'm on NewtonX and get requests fairly regularly. Companies doing market research want to talk to PMs about tool evaluation, implementation challenges, and what actually works versus what's just marketing hype. Pay varies from $50-250 depending on the session length and topic. Reasonable compensation if you don't mind discussing your work for an hour.",
          "score": 9,
          "created_utc": "2026-01-29 00:14:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2fnay7",
              "author": "Flaky_Value6753",
              "text": "Do you have a full tiem job? If so, are you providing information on that job and is that allowed?",
              "score": 3,
              "created_utc": "2026-01-29 16:20:12",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2p2nef",
                  "author": "afici0nad0",
                  "text": "Asking for forgiveness v asking for permission\n\nRisk acceptance...  approve / reject....",
                  "score": 1,
                  "created_utc": "2026-01-30 23:19:30",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2klrw0",
          "author": "Curiousman1911",
          "text": "There is some consultation service agency to connect experts with orgs, you can make money on that",
          "score": 2,
          "created_utc": "2026-01-30 08:58:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2h2psx",
          "author": "More_Law6245",
          "text": "Yes, I consult as part of my business service offering in which I conduct P3M3 audit and project performance review services.  ",
          "score": 1,
          "created_utc": "2026-01-29 20:14:43",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qpqpdq",
      "title": "I get that clients can be difficult, but some dev agencies' client and project management is absolutely infuriating",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1qpqpdq/i_get_that_clients_can_be_difficult_but_some_dev/",
      "author": "Rude_Taro_9572",
      "created_utc": "2026-01-28 22:48:16",
      "score": 21,
      "num_comments": 2,
      "upvote_ratio": 0.63,
      "text": "I've worked in tech development my entire career, both agency-side and client-side, so I understand how draining client work can be. Clients asking questions they won't listen to the answers for, blaming you for scope creep they caused, demanding changes outside the contract—I get it. I'm not some clueless client complaining that devs won't work weekends for free.\n\n\n\nThat said, agency communication has gone to hell the last few years. I'm consistently dealing with dev teams who won't engage when it's literally their job. I'm not asking them to read my mind—I'm talking basic questions like \"what's the timeline for this feature?\" Complete radio silence. Last week I had a project manager who wouldn't respond to Slack messages for days, then acted annoyed when I followed up. No updates, no \"we're working on it,\" nothing. Just to get a status update on work we're paying for, I have to endure passive-aggressive responses.\n\n\n\nI know burnout is real and the industry is tough right now. I get that some people think corporate pleasantries are fake, but basic professionalism has always been expected. Maybe they're going through a rough sprint or hate the project, and I respect that, but I don't know you personally. I'm just trying to get deliverables, understand blockers, or coordinate timelines. I don't think it's too much to ask for someone to be responsive and professional, or at minimum just not be dismissive about it.\n\n\n\nWhat do you all think about client-agency relationships nowadays? Any advice for managing these dynamics without it turning toxic?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/projectmanagement/comments/1qpqpdq/i_get_that_clients_can_be_difficult_but_some_dev/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o2b3l4p",
          "author": "Longjumping-Wafer102",
          "text": "I've been in tech since I graduated, and any agency I worked at early in my career would have fired people for the way some dev teams communicate with clients now. Client management was DRILLED into us—both from senior devs and leadership.\n\n\n\nThe longer I work in this industry, the less patience I have for poor client communication. If you can't even send a status update or acknowledge a message, I'm going to escalate it.\n\n\n\nI'm so sick of hearing about \"how difficult it is to deal with clients.\" It's not rocket science. Is it taxing? Yes. Can clients be frustrating? Absolutely. But managing basic professional communication isn't some impossible task. There are even many AI tools now like Chatvisor can help handle most client communication. So sometimes when it's done poorly, isn't it really just laziness?\n\n\n\nWhen I started out, having agency experience on your resume meant employers knew you could handle pressure and communicate professionally. A couple years ago when I was hiring, I actively avoided candidates from certain agencies because their client-facing skills were terrible: couldn't manage expectations, got defensive at feedback, no initiative in communication. Some are fantastic of course, but I wasn't taking chances.",
          "score": 7,
          "created_utc": "2026-01-28 22:59:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2edarm",
          "author": "DrStarBeast",
          "text": "Tech is dying. Mass outsourcing and h1bs started it and AI will finish it.  Devs will soon largely be replaced with ai. Frankly it's a good thing because software devs are some of the biggest princesses you'll ever have the misfortune to work with. We'll probably live in a future where software will never be, \"upgraded\" it'll largely be disposable. \n\n\nI'm glad I got out before the mass layoffs. Those who work in this industry's days are numbered. ",
          "score": 3,
          "created_utc": "2026-01-29 12:23:56",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qr4m1m",
      "title": "PM 101",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1qr4m1m/pm_101/",
      "author": "More-Energy-5993",
      "created_utc": "2026-01-30 12:51:45",
      "score": 17,
      "num_comments": 9,
      "upvote_ratio": 0.71,
      "text": "I’ve reached a point where I’m fed up and burnt out - everyone genuinely pisses me off. I’m known to be capable of delivering projects under tight time constraints, so essentially all the urgent projects with fixed delivery dates get assigned to me. \n\nWhen giving cadenced reports to seniors or PMO; I’ve taken the approach that you either take what I say as gospel or I will jargon the hell out of you, that you’re left with two options - ask what you deem to be be stupid questions or say ok. Thankfully most are prideful and choose the latter. \n\nJust a tip for those out there who are tired of over explaining - technical jargon is your best friend. ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/projectmanagement/comments/1qr4m1m/pm_101/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o2na2hb",
          "author": "moochao",
          "text": ">I’ve reached a point where I’m fed up and burnt out - everyone genuinely pisses me off.\n\nMy guy, you just described being alive in 2026.",
          "score": 28,
          "created_utc": "2026-01-30 18:13:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2m33xd",
          "author": "Unusual_Ad5663",
          "text": "That must feel good for you to be able to put others in their place when they question your report out.  What about shutting them down is important to you?",
          "score": 23,
          "created_utc": "2026-01-30 15:01:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2p12ld",
          "author": "More_Law6245",
          "text": "It's something that a lot of project practitioners don't realise, one people soft skill that you should possess is being able to teach. By no means am I disagreeing with your mindset and approach because there's nothing worse than having to answer ridiculous and stupid questions whilst under pressure to deliver on time, trust me I get it but there is also a time and place for it.\n\nI had an interesting experience once where my program board where crazier than a racoon backed into a corner with a shotgun, after I did some digging it turns out that they where not confident technically or making technical decisions and they where struggling to understand what I was delivering despite it being their own IT system. So I got creative and started sending out information packages \"about the technology\" being used, essentially it was a disguised 101 guide about the infrastructure being delivered. Was it inconvenient? Yes, extremely but It made my life a lot easier but the thing was that it also helped with the racoon problem, at least I now had a safety on the shot gun.\n\nWhilst it may seem inconvenient at the time you have to ask yourself what is driving the behaviour? Work back from there. If you start educating stakeholders, particularly in project management principles and frameworks as most have a misconception of what it actually is and how it's applied properly, it definitely leads to having better working relationships. Just a reflection point for your consideration.\n\nJust an armchair perspective.",
          "score": 6,
          "created_utc": "2026-01-30 23:10:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2stuaf",
          "author": "RedactedSoul1",
          "text": "Jargon can be a useful shield in the moment, but managing up is what actually shifts the pattern so everything urgent doesn’t automatically become yours. Just my two cents.",
          "score": 3,
          "created_utc": "2026-01-31 15:16:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2m0a9p",
          "author": "Lita_in_Lieu",
          "text": "I’m sure you’re great at what you do, and I’d say I almost envy it. Tell me how you would react if you had a junior PO underneath you surface an impediment during your tight deadline, would you technical jargon them so that you can pursue the project the way you want or would you adjust your delivery plan? how do you weigh the opportunity cost of past experience? I have a senior p.m. that’s leading a project and myself, and the dev leads are explaining that they are blocked, and they insist there is no wiggle room, and essentially I will need to wait two weeks to make any progress on unblocking themselves bc resources are so tight elsewhere in the project.",
          "score": 5,
          "created_utc": "2026-01-30 14:47:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2mifbg",
              "author": "More-Energy-5993",
              "text": "Make friends my friend, people are more likely to fit your request in if you have a good relationship with them. If this Impeding request isn’t part of the original scope then let them go through the governance CR process. The key to quick delivery is identify what the MVP is and only focusing on the tasks necessary to achieve that. There’s nothing spectacular or ingenious about what I do, I’ve just learnt to block out the noise and focus on good, not perfection.",
              "score": 0,
              "created_utc": "2026-01-30 16:11:09",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2mp095",
                  "author": "sausageandbeer1",
                  "text": "I’m starting to think this is a sh*t post meant as bait.\n\nYour post starts with a complaint about being fed up and burnt out because of others, but the last line of your comment here says you’re able to block out the noise.\n\nIt’s Friday, go out and have a good weekend.",
                  "score": 9,
                  "created_utc": "2026-01-30 16:40:24",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qsbgjz",
      "title": "Inexperience",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1qsbgjz/inexperience/",
      "author": "RevolutionaryFly2500",
      "created_utc": "2026-01-31 19:18:28",
      "score": 17,
      "num_comments": 9,
      "upvote_ratio": 0.95,
      "text": "Hello all,\n\nLong story short, I’ve been in program management for a couple years now. I like to think I have the operation side, team building, planning, and other generalities in a good spot.\n\nThe financial stuff is what gives me trouble. Budget, EAC, EVM, etc \n\nAre there any good YouTube channels you recommend that could help me out?\n\nThank you! ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/projectmanagement/comments/1qsbgjz/inexperience/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o2udvf1",
          "author": "RedactedSoul1",
          "text": "Totally normal gap. A lot of PMs grow up strong on delivery and people, and only really learn the financial side once they’re in it.\n\nAR is really good at breaking down EVM, EAC, CPI/SPI without overcomplicating it. Very practical, very PM-focused. DM walk-throughs of earned value concepts and exam style examples that actually make the math click.\n\nPMI also has great resources.\n\nOne tip that helps me is not to try to master finance. Start with how EVM tells a story about performance, then layer in the formulas. Once you see EAC and CPI as signals instead of math problems it gets way easier. Promise!!! lol this is coming from someone who does not have a finance brain either.",
          "score": 11,
          "created_utc": "2026-01-31 19:44:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2um66d",
              "author": "RevolutionaryFly2500",
              "text": "This was so helpful. I will check this out. Thank you for taking your time to type this out!",
              "score": 2,
              "created_utc": "2026-01-31 20:25:42",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o31hhq7",
              "author": "SVAuspicious",
              "text": "EVM includes financial but it is PM, not finance.",
              "score": 1,
              "created_utc": "2026-02-01 21:15:48",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2uo7je",
          "author": "ethically-contrarian",
          "text": "Do you have a Director or Finance or someone similar who handles the overall corporate OpEx/CapEx and business budgets. I had a few sessions with this person at my job to understand as it applied to our workplace and our guardrails. Then they created a simple spreadsheet for me to manage the PMO/Scrum Team for Cost Outlay, Cost Measures, Unit Cost and expected ROI for projects being submitted.\n\nIn the event it was a contract or SOW from a vendor, I was able to apply it as well for monitoring buckets.",
          "score": 7,
          "created_utc": "2026-01-31 20:35:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2urwlo",
              "author": "RevolutionaryFly2500",
              "text": "I do and I was thinking maybe doing some sessions with him as part of my development plan. Thanks for the advice  friend !",
              "score": 5,
              "created_utc": "2026-01-31 20:54:11",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2v37hn",
                  "author": "ethically-contrarian",
                  "text": "Of course!! I did several courses and trainings but never proved effective or relatable, because none of these working environments are “strong matrix” and if you leave where you are you’ll need to figure it out again. \n\nSo for today, understand your company’s needs and processes and apply that to the projects. \n\nThis was the one thing that really pushed our PMO forward in terms of gauging ROI and CBA.",
                  "score": 1,
                  "created_utc": "2026-01-31 21:49:50",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2ulw5o",
          "author": "ConstructionNo1511",
          "text": "Same. I’m totally lost on ROI so i feel you.",
          "score": 3,
          "created_utc": "2026-01-31 20:24:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o31h76p",
          "author": "SVAuspicious",
          "text": "You can't do EVM without a plan. Perhaps you aren't as good at that as you think. \n\nWBS? RBS? WBS to charge number mapping? Tasks at bottom of WBS with accountable leads, instructions, resources, predecessors, successors? Quantified risk management that drives management reserve? EVM with PV (from your plan) and EV (from your plan and status) and AC (from accounting using your charge numbers mapped to your WBS), SPI, CPI? Risk management includes mitigation AND contingencies? Your PM tool integrates with email or browser forms for status, with accounting for financials, and with HRIS for resources? Integration with purchasing, receiving, and warehousing? Can you develop that integration if someone changes a tool on you? Document management? Change management and scope control? Good grip on business law? Contracts management? System engineering (vee and spiral)? You know the difference between requirements and specifications? Where architecture leaves off and design begins? How do you account for LOE tasks like PM under EVM? EVM is like a practicum or dissertation that is built on a very wide foundation. \n\nI could keep this up but Reddit has a 10,000 character limit. \n\nYou're going to need a lot more than some YouTube videos. [Start here](https://www.google.com/search?client=firefox-b-1-e&q=mit+opencourseware+project+management). You'll want the ones in both the business school and system engineering. That should keep you busy for a couple of years.",
          "score": 1,
          "created_utc": "2026-02-01 21:14:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o31hpj4",
              "author": "RevolutionaryFly2500",
              "text": "👍",
              "score": 2,
              "created_utc": "2026-02-01 21:16:50",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qqiaib",
      "title": "How often do you have to do formal presentations?",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1qqiaib/how_often_do_you_have_to_do_formal_presentations/",
      "author": "Gandalf-and-Frodo",
      "created_utc": "2026-01-29 19:24:18",
      "score": 16,
      "num_comments": 27,
      "upvote_ratio": 0.95,
      "text": "How often do you have to do formal presentations (preparing a nice powerpoint and making it somewhat engaging)? And what industry are you in?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/projectmanagement/comments/1qqiaib/how_often_do_you_have_to_do_formal_presentations/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o2gxmvj",
          "author": "Useful_Act_5017",
          "text": "Often enough that my 20 year old self would be incredibly impressed at my outstanding bravery. \n\nIn reality of course it’s not bravery, just practice and the loss of all previously given fucks that gets me through it. But I really did once have a full on fear of public speaking and now I don’t think twice about it.\n\nI’m a project manager for an ISP.",
          "score": 11,
          "created_utc": "2026-01-29 19:50:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2hr4g6",
              "author": "Own_Abies_8660",
              "text": "How long did it take to get to the loss of effs given bit? Asking for a friend",
              "score": 2,
              "created_utc": "2026-01-29 22:11:30",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2hualt",
                  "author": "Useful_Act_5017",
                  "text": "Yeah longer than I would have liked actually, but hard to pinpoint it. All I can say with confidence right now is you could put me in front of a room full of strangers and I could talk for an hour without stuttering.\n\nI had a terrible experience with a panic attack during a presentation at university and had a phobia of them for years after that. I remember the lecturer asked me to stay behind afterwards and told me that I was being judged on the content of the presentation and not on the actual act of presenting it. Which was her way of saying “Jesus Christ son what the fuck happened there? Send me the slides and I’ll read them myself” 😂 but also she was just being a nice person. \n\nSo yeah I mean it was a real phobia and somehow through doing it many times I really did get completely over it. Sorry I can’t offer more advice but I certainly wish that I’d gotten over it sooner! So much worrying and anxiety over absolutely nothing - the secret I suppose is that… nobody’s really fucking listening to you anyway, they’re all just trying not to be noticed themselves.",
                  "score": 3,
                  "created_utc": "2026-01-29 22:27:09",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2peor1",
          "author": "alicat777777",
          "text": "Every week and sometimes a couple of times a week. In IT.",
          "score": 7,
          "created_utc": "2026-01-31 00:25:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2h7viw",
          "author": "Outrageous-Pizza-66",
          "text": "for larger IT projects, it would be at least once a month.  Presenting to Steering Committee.   Project Health, Issues, Financials, etc.\n\n",
          "score": 5,
          "created_utc": "2026-01-29 20:39:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2hebl2",
          "author": "AceySpacy8",
          "text": "IT PM in Healthcare - A handful of times per month? It depends on how many things we are launching. EOY push I’m doing more mainly because of contract claims submissions prior to 12/31. Aka how much money we made from claims for different contracts",
          "score": 5,
          "created_utc": "2026-01-29 21:10:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2i2vss",
          "author": "Maro1947",
          "text": "I've had a charmed career where I limit the amount of PowerPoint I use to the bare minimum - probably less than once a month once a project is in flight\n\nIt's an awful piece of software \n\nWhen I do use it, it's bare bones with key information/graphics\n\nBelieve it or not, a lot of Execs hate it as well and prefer a couple of slides and more discussion rather than Wat and Piece in Slide form",
          "score": 4,
          "created_utc": "2026-01-29 23:11:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2kibu5",
          "author": "SmartPessimist_PM",
          "text": "I have been a project manager for 25 years across multiple industries, and based on my experience the frequency of formal presentations usually spikes during the initiation (to get the money) and closing (to prove you spent it correctly) phases. \n\nHowever, regarding the execution phase, I have a strong bias against static documentation like ppts or spreadsheets because they are effectively outdated the moment you hit save. \n\nMy philosophy is that if I am building a slide deck for a status update, I am wasting time. I prefer to build real time dashboards (using tools like jira or powerbi) so the project data is live and accessible to everyone 24/7. It reduces the need for those performance theater meetings and shifts the culture from reporting on work to visualizing the work.",
          "score": 4,
          "created_utc": "2026-01-30 08:27:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2nh2cj",
              "author": "Philoscifi",
              "text": "You *do* have 25 years across multiple industries. Real-time dashboards are a great way to shift the context to visualizing the work and keeping that easily available to ppl who need to see it.",
              "score": 1,
              "created_utc": "2026-01-30 18:44:19",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2kiy6k",
          "author": "buildlogic",
          "text": "Tech/SaaS - formal decks maybe once a month for stakeholder reviews or exec updates, but the somewhat engaging part is key because nobody wants another 40 slide snoozefest. I've found that spending 80% of prep time on making 10 really clear slides with actual visuals beats spending that time on 30 bullet point heavy ones execs especially just want the headline, the data that matters, and what you need from them.",
          "score": 4,
          "created_utc": "2026-01-30 08:32:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2lgmls",
              "author": "Smooth-Trainer3940",
              "text": "Agreed, too many slides is just not necessary",
              "score": 1,
              "created_utc": "2026-01-30 13:04:19",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2h0r82",
          "author": "ConstructionNo1511",
          "text": "2-4 times a month. Health insurance",
          "score": 3,
          "created_utc": "2026-01-29 20:05:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2hjbs2",
          "author": "ExtraHarmless",
          "text": "I build at least 3 decks a week, with one major presentation to Stake Holders. The other 2 are emails, which is nice.\n\nI have had more projects in flight that required monthly Senor Management input, weekly team meetings, one off meetings as well. The most decks/presentations I had regularly in a week was 8. It was 2 compliance projects, 2 infra projects, 1 pmo update, 2 post go live defect resolution meetings, and a weekly vendor performance summary for overlapping efforts.\n\nIt will really vary based on the company, stakeholders, and desire to make the presentation tight. With enough experience, building and gathering information takes the most time. If you can build tools and process to support data gathering and deck building life gets much easier.\n\nEdit to add, this does not include general meeting facilitation and meetings that don't have large inputs. Typically half my week or more is running meetings.",
          "score": 3,
          "created_utc": "2026-01-29 21:34:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2i2zek",
          "author": "SVAuspicious",
          "text": "Control gates one to three times per year that go on for days. Maybe a couple of times a year for a few hours for special presentations. All hands once or twice a year. I've been doing this a long time (I date back to Harvard Graphics) and do training in-house as \"other duty as assigned.\" That's maybe six times per year. \n\nTemplates are key and not allowing people to fiddle with individual slides and override the template. Bullets, not walls of text. Graphics and pictures are even better.",
          "score": 3,
          "created_utc": "2026-01-29 23:11:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2inqn4",
          "author": "karlitooo",
          "text": "A couple a week, consulting.",
          "score": 3,
          "created_utc": "2026-01-30 01:03:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2l0ekw",
          "author": "foxystoat1980",
          "text": "Once a month for project steering committee.\n\nAdhoc otherwise.\n\nI work in IT for an airline.",
          "score": 3,
          "created_utc": "2026-01-30 11:09:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2paex1",
          "author": "tcumber",
          "text": "Long 30 page presentation, but first page is a consolidated summary and status slide which is updated ans sent weekly as a 1 pager status report.",
          "score": 3,
          "created_utc": "2026-01-31 00:02:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2harpr",
          "author": "CeeceeATL",
          "text": "Depending on the project…if critical/getting ramped up then 1x week. If stable/monitoring - 1x month. I typically do 4-7 per month.",
          "score": 2,
          "created_utc": "2026-01-29 20:53:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2iex0a",
          "author": "VasDifferential",
          "text": "About 2-3 times a week for joint technical meetings with clients. All different clients on a biweekly basis.",
          "score": 2,
          "created_utc": "2026-01-30 00:16:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2o9iwb",
          "author": "wm313",
          "text": "Never. I assume this is more of a tech thing.",
          "score": 2,
          "created_utc": "2026-01-30 20:55:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2pt0nf",
          "author": "SoberSilo",
          "text": "Usually only for gate reviews and IPRs. So once per month or so. I work in navigation and timing for commercial and defense industries",
          "score": 2,
          "created_utc": "2026-01-31 01:47:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2yy2qg",
          "author": "Low-Illustrator-7844",
          "text": "Do you mean project kickoff presentations? If yes, i keep them simple with high-level points on scope, assumptions, timeline, risks and out of scope.\nIf more focused, it depends on the topic, but i do not put a lot of information on decks for presentation. Human brain these days does not handle large volumes of info during presentations.",
          "score": 2,
          "created_utc": "2026-02-01 13:58:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2gxqlu",
          "author": "PhotoActive2160",
          "text": "Depends on the work load but sometimes I have at least once a week.\nEvery kick off meeting there is a presentation. \nEvery workshop (but I don’t always lead them)\nEvery monthly meeting with one client.\n\nI don’t put a lot of effort into them because I’m gonna talk about the content so the actual PowerPoint isn’t crucial.\n\nI’m a project manager in a consultancy firm.\n\nWhat about you",
          "score": 1,
          "created_utc": "2026-01-29 19:50:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2yjtda",
          "author": "dhemantech",
          "text": "Kickoff, major milestones, closure presentations were standard. \n\nCOE’s would need their own presentations post closure",
          "score": 1,
          "created_utc": "2026-02-01 12:22:44",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qts8mu",
      "title": "What workflows actually justify the cost of Monday.com or Asana?",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1qts8mu/what_workflows_actually_justify_the_cost_of/",
      "author": "Tkamer01",
      "created_utc": "2026-02-02 11:11:24",
      "score": 15,
      "num_comments": 17,
      "upvote_ratio": 1.0,
      "text": "I’m trying to understand the real value behind tools like Monday.com and Asana relative to their price points.\n\nMy company recently went through an evaluation while considering a change to our project and portfolio management (PPM) tooling. As part of that process, we looked at platforms like Monday.com and Asana alongside more traditional PPM solutions. Our conclusion was that these tools felt like overkill for enterprise-level PPM, strong at task and team-level execution, but less compelling when evaluated through an enterprise portfolio lens relative to cost.\n\nThat said, the hype and adoption are hard to ignore, which makes me think there are workflows or contexts where the value is much clearer than what we observed.\n\nFor those who actively use one of these platforms:\n\n\t•\tWhat specific workflows or operating models make the price worth it?\n\n\t•\tAt what team size or organizational maturity does the ROI become clear?\n\n\t•\tAre you using advanced automation, cross-team dependencies, portfolio views, or integrations in ways that materially improve outcomes?\n\n\t•\tWhere do these tools shine and where do they start to feel like overkill or underutilized?\n\nI’m not trying to knock either platform. I’m genuinely interested in understanding where they fit best, and what types of organizations or workflows get the most value relative to the cost.\n\nWould appreciate real-world perspectives, especially from PMs, ops leaders, or portfolio leaders who’ve evaluated or lived with these tools long enough to see both the benefits and the tradeoffs.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/projectmanagement/comments/1qts8mu/what_workflows_actually_justify_the_cost_of/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o38e8cl",
          "author": "Commercial_Carob_977",
          "text": "I think Asana in particular is really well suited to an enterprise portfolio and Monday is slightly less so an dprobably targets a slightly smaller business. I think the mid sized market for task & team productivity tools is served by the likes of Clickup and then the smaller orgs are probably best suited to the likes of Briefmatic and Basecamp.",
          "score": 5,
          "created_utc": "2026-02-02 21:51:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3bgsw3",
          "author": "buildlogic",
          "text": "The ROI sweet spot is honestly 20-200 person companies doing cross functional work where visibility into who's blocked by what across teams is worth more than the per seat cost. Below that you're overpaying for Trello with makeup, above that you need actual PPM like you said, but in that middle zone the automation, dependencies, and real time dashboards genuinely prevent the weekly status meeting dumpster fires that waste way more than the subscription cost.",
          "score": 5,
          "created_utc": "2026-02-03 10:13:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o39cd0l",
          "author": "scooby_d000",
          "text": "I use Monday.com in my current role. Our PMO is made up of 12 project managers & coordinators.\n\nI manage the team. I like Monday.com because I can create dashboards and views to have simple visibility into the entire portfolio. Our teams can slim down their views/board to only see their projects. \n\nWe are a software company focused on implementations. I wish they had better customer-facing options to easily share progress. \n\nWe do use advanced automations and integrations. The integration with SFDC is great, as well as Outlook.",
          "score": 3,
          "created_utc": "2026-02-03 00:51:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o39o1m2",
          "author": "analyteprojects",
          "text": "This sounds more like a problem of what's causing this move in the first place? What is your current PPM missing that you need a change in tooling? Most traditional PPM tools I've been exposed to cost way more than Asana. Also, tough to advise without knowing how big your team is and how many projects you are running at a given time.",
          "score": 2,
          "created_utc": "2026-02-03 01:58:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3amhrc",
          "author": "Fantastic-Nerve7068",
          "text": "i’ve used asana in the past and imo it earns its keep when you’re running cross functional work where visibility and lightweight coordination matter more than true portfolio control. marketing ops, launches, enablement, agency style teams. once you lean into automations and views, it can cut a lot of status chasing, but you’re still paying a premium for task orchestration, not decision support.\n\nwe eventually shifted to celoxis when the conversation moved to capacity, dependencies, forecasting, and portfolio trade offs. that’s where tools like monday and asana started to feel expensive for what they actually gave us. great for team level execution, less convincing when leadership wants answers about impact, load, and risk instead of just task progress.",
          "score": 2,
          "created_utc": "2026-02-03 05:36:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o39f44u",
          "author": "SVAuspicious",
          "text": "I have trouble with [Monday.com](http://Monday.com) or Asana being considered overkill for anything. They're so busy trying to be all things they don't do PM well.",
          "score": 3,
          "created_utc": "2026-02-03 01:07:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o39mphb",
              "author": "Tkamer01",
              "text": "Good to know, they have a great marketing team. 😊",
              "score": 1,
              "created_utc": "2026-02-03 01:50:43",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3atbor",
          "author": "Neo772",
          "text": "I am not sure, why people use it. I am happy with TensorPM and it’s free",
          "score": 2,
          "created_utc": "2026-02-03 06:32:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o36ju8c",
          "author": "UnArgentoPorElMundo",
          "text": "What do you use that is cheaper than asana or monday.com? Jetbrain's youtrack is free for 10 users, and 4.50 from 11 users. \n\n[https://www.jetbrains.com/youtrack/buy/](https://www.jetbrains.com/youtrack/buy/)",
          "score": 1,
          "created_utc": "2026-02-02 16:44:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o38fj0p",
          "author": "Andy_WORK_BOLD",
          "text": "Have you explored Smartsheet?",
          "score": 1,
          "created_utc": "2026-02-02 21:58:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o39m8dv",
              "author": "Tkamer01",
              "text": "Was on Smartsheet but the price jump for 375 users was mind blowing, as well as the platform requires far too much management.",
              "score": 1,
              "created_utc": "2026-02-03 01:48:02",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3a8smf",
          "author": "mckeeno",
          "text": "Look at Rocketlane",
          "score": 1,
          "created_utc": "2026-02-03 04:00:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3h2wub",
          "author": "grumpy_toast",
          "text": "I am a technical resource that sometimes manages small projects. We moved to Monday last summer and now I spend lots of time searching for messages and my clients get so frustrated they give up and just email me. I assume it’s working for someone a few levels higher. ",
          "score": 1,
          "created_utc": "2026-02-04 04:23:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3h5jog",
          "author": "CombatAnthropologist",
          "text": "Avoid Monday",
          "score": 1,
          "created_utc": "2026-02-04 04:41:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3hdtxz",
          "author": "surfsnower",
          "text": "Asana only works for smaller teams with a micromanagre running them. It's useful but not worth the price point. Free JIRA works about the same",
          "score": 1,
          "created_utc": "2026-02-04 05:40:37",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qq440v",
      "title": "When do you usually turn meeting discussions into tasks?",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1qq440v/when_do_you_usually_turn_meeting_discussions_into/",
      "author": "voss_steven",
      "created_utc": "2026-01-29 09:33:36",
      "score": 10,
      "num_comments": 51,
      "upvote_ratio": 0.92,
      "text": "During the meeting, right after, or later, when there’s time?\n\nWhat timing has actually worked best for you, especially on busy days?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/projectmanagement/comments/1qq440v/when_do_you_usually_turn_meeting_discussions_into/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o2eif1t",
          "author": "dhemantech",
          "text": "During the meeting",
          "score": 6,
          "created_utc": "2026-01-29 12:57:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2k1vx3",
              "author": "voss_steven",
              "text": "Do you usually capture that yourself, or does someone else in the meeting own it?",
              "score": 1,
              "created_utc": "2026-01-30 06:08:42",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2mprzd",
                  "author": "dhemantech",
                  "text": "> Do you usually capture that yourself, or does someone else in the meeting own it?\n\nDo you have meeting roles ?",
                  "score": 1,
                  "created_utc": "2026-01-30 16:43:48",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2h13v0",
          "author": "bluealien78",
          "text": "I have a rule for my team with regard to meetings: If there isn’t a decision made or an action item assigned coming out of that meeting, it was a waste of everyone’s time and it “should have been an email”. So to answer your question, tasks are identified and assigned **in** the meeting.",
          "score": 7,
          "created_utc": "2026-01-29 20:06:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2k2cn5",
              "author": "voss_steven",
              "text": "That’s a strict rule. How do you enforce it when meetings drift, or people hesitate to commit in the moment?",
              "score": 1,
              "created_utc": "2026-01-30 06:12:19",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2lf5m9",
                  "author": "bluealien78",
                  "text": "It's a trust model. The standard is made clear, just like any other team standard. \"Smart time management\" is a stated soft skill in the career rubric used for performance management.",
                  "score": 2,
                  "created_utc": "2026-01-30 12:55:22",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o2qdhw4",
                  "author": "DesertMountainLvn",
                  "text": "When people meander on meetings ask them to take it offline or redirect bacm to the agenda. If no one owns an action in the moment, I would ask again after the meeting, if no change it goes to the project sponsor or executive sponsor to drive ownership among other leaders.",
                  "score": 1,
                  "created_utc": "2026-01-31 03:52:15",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2j2avh",
          "author": "Sophie_Doodie",
          "text": "During the meeting if possible, or immediately after while everything’s still fresh. If I wait “until later,” it usually turns into vague notes and missed context. Even rough action items in the moment beat perfect tasks created hours later, especially on busy days.",
          "score": 6,
          "created_utc": "2026-01-30 02:24:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2k1unv",
              "author": "voss_steven",
              "text": "That makes sense, context seems to decay really fast. What usually causes the delay when it *does* happen later?",
              "score": 1,
              "created_utc": "2026-01-30 06:08:25",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2h6164",
          "author": "Commercial_Carob_977",
          "text": "You need to agree its a task right then and there and then just assign the task later using a google doc or email or Slack or whatever task tracker your using - Briefmatic, clickup, trello, asana etc etc, otherwise work just disappears into the ether!",
          "score": 5,
          "created_utc": "2026-01-29 20:30:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2k1xxs",
              "author": "voss_steven",
              "text": "Interesting, is the agreement part usually the hard part, or is it more about remembering to assign it afterward?",
              "score": 1,
              "created_utc": "2026-01-30 06:09:07",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o2qd47c",
              "author": "DesertMountainLvn",
              "text": "Agree with this. At the end of the meeting you repeat back action items and owners and confirm who owns them. I formally record them using org tool as soon as possible depending on how urgent the action is and how busy I am. However, if it's already agreed upon and in minutes, ideally stakeholders are already holding themselves accountable to complete the action in the needed time frame. We all know which stakeholders are not self motivated and need nudging though.",
              "score": 1,
              "created_utc": "2026-01-31 03:49:47",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2kmyet",
          "author": "Longjumping-Cat-2988",
          "text": "During the meeting, whenever possible.\n\nIf something sounds actionable, I’ll quickly capture it while it’s being discussed, even as a rough task with a placeholder owner or date. That way, everyone’s aligned before we move on and nothing gets lost in notes.",
          "score": 5,
          "created_utc": "2026-01-30 09:09:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2lesxy",
              "author": "voss_steven",
              "text": "Thanks for sharing.",
              "score": 1,
              "created_utc": "2026-01-30 12:53:13",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2eskf8",
          "author": "PplPrcssPrgrss_Pod",
          "text": "When the conversations result in actions that will help the project move forward.",
          "score": 3,
          "created_utc": "2026-01-29 13:54:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2k28ba",
              "author": "voss_steven",
              "text": "How do you usually decide in the moment whether something is an action versus just a discussion?",
              "score": 1,
              "created_utc": "2026-01-30 06:11:21",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2fogwy",
          "author": "Paulina8097",
          "text": "I turn meeting notes into tasks right after the meeting if possible:\n\n\\- The less time there is between when the meeting happened and when I jot down everything, the fewer things I forget.  \n\\- It takes less time to create tasks because everything's fresh.  \n\\- It gives more time to the team/client to take action on the tasks.  \n\\- Sometimes, while creating tasks, I can notice something that I overlook during the meeting. And if I need to clarify something I can do it right away before the client forgets.",
          "score": 5,
          "created_utc": "2026-01-29 16:25:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2k2auz",
              "author": "voss_steven",
              "text": "That’s a great breakdown. Do you ever notice things getting lost when meetings are back-to-back, even with that process in place?",
              "score": 1,
              "created_utc": "2026-01-30 06:11:55",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2duj2y",
          "author": "Wait_joey_jojo",
          "text": "In between meetings. Lol",
          "score": 2,
          "created_utc": "2026-01-29 09:52:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2k2dwv",
              "author": "voss_steven",
              "text": "Haha, relatable. Does that window ever get squeezed when the day fills up?",
              "score": 1,
              "created_utc": "2026-01-30 06:12:35",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2ffyjl",
          "author": "Rina_81",
          "text": "I jot it down IMMEDIATELY as we are discussing the topic and action item. I ask for clarification on the action if not clearly understood. I repeat action items at the conclusion of the meeting.\n\nAfter meeting, i send out notes with action items and update my PMIS to track the newly identified tasks within the business day.\n\nThe majority of the time, you should have tasks identified before you jump into the meeting. If a new task just popped up during a meeting, that means it is a newly identified issue/blocker/dependency.",
          "score": 2,
          "created_utc": "2026-01-29 15:47:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2k2hhr",
              "author": "voss_steven",
              "text": "Repeating action items at the end sounds key. Does that ever slow the meeting down, or has it been worth it?",
              "score": 1,
              "created_utc": "2026-01-30 06:13:21",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2laxji",
                  "author": "Rina_81",
                  "text": "It doesn’t slow the meeting down. Doesn’t take long. It ensures all stakeholders are aligned at the end of meeting.",
                  "score": 1,
                  "created_utc": "2026-01-30 12:28:12",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2gtuau",
          "author": "SVAuspicious",
          "text": "Vocabulary:\n\nTasks describe work that needs to be done in order to deliver what is specified. In PM tasks are defined in the baseline. If you are defining new tasks than you've lost control of scope and adding work that is not in the baseline. \n\nAction items are work that is in scope of existing tasks that refine what is needed to complete the task. You should easily be able to define the charge number for execution. LOE tasks e.g. PM, most admin, should not be a dumping ground for \"good ideas.\" You still have a budget. \n\nAll that said, my programs have a standard to release meeting minutes (go to document management in shared storage) day of with action items (go to action item log) and decisions (goes to scope management and change control and to line people affected). WBS, RBS, and charge numbers all identified. \"Day of\" gets a couple of hours of grace for end of day meetings. \n\nKey: have fewer meetings. Most work can be done by email and often faster.",
          "score": 2,
          "created_utc": "2026-01-29 19:32:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2k2o9o",
              "author": "voss_steven",
              "text": "Appreciate this distinction; it’s rare to see it explained clearly. Do you find that this rigor holds up in fast-moving or cross-functional meetings as well?",
              "score": 1,
              "created_utc": "2026-01-30 06:14:50",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2nsd7j",
                  "author": "SVAuspicious",
                  "text": "It holds up if you have or grow good people who know what you're doing. [System engineering](https://ocw.mit.edu/courses/16-842-fundamentals-of-systems-engineering-fall-2015/) is critical to delivering just about anything. Real system engineering, not what IT people call system engineering. It doesn't matter if you use a vee or a design spiral. Discovery > requirements > conceptual design > architecture and preliminary design (different things) > detailed design > implementation > test > delivery. PM and SE overhead of scope management, change control, document management, performance management are important layers on top of that. \n\nA common vocabulary is critical to moving fast. To you have any idea how many disciplines are involved in design/build of an aircraft carrier? Or a satellite? Or a global high volume, high rate document authoring and dissemination system? Even a deployed remote sensing system has a huge number of disciplines. Language is all we have to communicate with so vocabulary is MORE critical to cross-functional activity. Even if you maintain a project glossary people are unlikely to look because they don't realize they are using words differently. If you think cross-functional is hard, try multiple languages with team members using their second, third, or seventh language. Even common languages are not a guarantee. I (American) brought a room of mostly Brits and Aussies to their knees using \"pissed\" wrong. \n\nQuestion assumptions, and vocabulary is tantamount to an assumption.",
                  "score": 1,
                  "created_utc": "2026-01-30 19:34:49",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3cogr3",
          "author": "bettermeets",
          "text": "I think a lot of the AI note takers help here, but something I've done before they became super popular (and still do) is to share a blank Google doc during the meeting. Every time I think there's an action I'll say \"OK, let's capture that\" and write it down on the screen. Of course, sharing only really works when it's your meeting but you can still do it. This usually prompts the group to assign an owner, clarify the action, and determine when it should be done by.",
          "score": 2,
          "created_utc": "2026-02-03 15:04:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2dylyd",
          "author": "Sydneypoopmanager",
          "text": "Immediately after posting minutes to summarise the discussion and actions for stakeholders.",
          "score": 3,
          "created_utc": "2026-01-29 10:28:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2k2ese",
              "author": "voss_steven",
              "text": "Do stakeholders ever come back with changes or clarifications once the minutes are out?",
              "score": 1,
              "created_utc": "2026-01-30 06:12:46",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2ka90y",
                  "author": "Sydneypoopmanager",
                  "text": "Sometimes but its mainly for accountability and responsibility. E.g. one of the meeting attendees wants to make a change, they will have to reply all to the email chain. Its harder to change what you said if its all in writing. If they said nothing during the meeting then they cant just raise it willy nilly later to throw the project off course because i will resend the minutes.",
                  "score": 1,
                  "created_utc": "2026-01-30 07:16:10",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2etw8p",
          "author": "WasabiWolf",
          "text": "It depends on the call flow. If there’s a moment for something discussed where a sprint, project, or further information needed to proactively work ahead of a foreseeable blocker, then I’ll make it an action item in my notes to come back to usually within 24 hours. Some weeks I have over 19 meetings, with compliance making AI not an option with the accounts held under me. Those are hard weeks.",
          "score": 1,
          "created_utc": "2026-01-29 14:01:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2k2kx0",
              "author": "voss_steven",
              "text": "That sounds tough. Without AI, which part of the follow-up process is most painful during heavy meeting weeks?",
              "score": 1,
              "created_utc": "2026-01-30 06:14:07",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2mvtfp",
                  "author": "WasabiWolf",
                  "text": "It is. Add to the non-stop chat communications as people expect, even while in meetings, you to be available while trying to handle everything within the meeting too. \n\nI know plenty here have suggested or outright declared just using my personal device to run an AI to make my job easier. But the compliance penalty for a breach of contract isn’t anything to sneeze at.",
                  "score": 1,
                  "created_utc": "2026-01-30 17:10:45",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o2mznya",
                  "author": "WasabiWolf",
                  "text": "Sorry. Spaced. The worst part is making sure I have every action item and summarized notes for the recap email. If it’s not enough, it’ll lead to more questions and requests for additional ad-hoc meetings to “ensure we’re all on the same page”. I’m pretty good at “no”, protecting my team’s time, but others within the company are not and will slot in more meetings if there’s any gap. This causes me to make sure I have very meticulous notes because everyone gets zoom fatigued and meetings blur together.",
                  "score": 1,
                  "created_utc": "2026-01-30 17:28:00",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2fifpj",
          "author": "Tom__Toad",
          "text": "Take notes and then follow up with action points.\n\nIf there are some key and obvious ones then highlight it at the end of the meeting.",
          "score": 1,
          "created_utc": "2026-01-29 15:58:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2k2mhf",
              "author": "voss_steven",
              "text": "Do you usually get alignment on those action points during the meeting, or after they’re shared?",
              "score": 1,
              "created_utc": "2026-01-30 06:14:27",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o2k30v7",
              "author": "Tom__Toad",
              "text": "Obvious ones  in the meeting, so if someone said “I’ll share this quarters numbers”, make sure they know that’s on them in the meeting and then say that you will share a complete list straight after the meeting",
              "score": 1,
              "created_utc": "2026-01-30 06:17:38",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2hnx8u",
          "author": "Medium_Let_7559",
          "text": "For me, waiting until “after” the meeting almost never worked.\nThe most effective shift was capturing actions during the meeting, even if they were rough, and confirming ownership before moving on.\nIt reduced follow-ups and the “I thought someone else had it” problem.",
          "score": 1,
          "created_utc": "2026-01-29 21:56:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2l97es",
          "author": "Sean-at-Alteris",
          "text": "For me, the timing matters less than *how much thinking I still have to do*.\n\nIf a task is obvious and low-judgment (“schedule follow-up”, etc.), I’ll capture it during or immediately after the meeting. That avoids the classic “I’ll remember this” lie we all tell ourselves on busy days.\n\nWhere I’ve been burned is turning a fuzzy discussion into tasks too fast. In a lot of meetings, the real work is actually deciding what the task even is. When I rush that part, I end up with a to-do list that’s long but misaligned, which creates more drag later.\n\nWhat’s worked better is a quick pass right after the meeting to capture *decisions and open questions*, then a short reflection window (even 5–10 minutes later that day) to turn those into tasks once priorities are clearer. On chaotic days, having some system that helps you pause and ask “what’s the right next action here?” has been way more valuable than just dumping everything into a task manager. AI tools can help a lot with this as well!\n\nCurious to see what others do, but I’ve found consistency comes less from perfect timing and more from having a way to think clearly before committing to action.",
          "score": 1,
          "created_utc": "2026-01-30 12:16:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ssxt3",
          "author": "RedactedSoul1",
          "text": "What I do is call out tasks during the meeting as they come up so everyone is clear on who’s doing what and then turning them into actual tasks right after the meeting. I notice waiting to sort it out later usually doesn’t work. I get oh I thought Jane doe was gonna do that task etc. lol",
          "score": 1,
          "created_utc": "2026-01-31 15:12:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o34ad6n",
              "author": "voss_steven",
              "text": "Thanks for sharing.",
              "score": 1,
              "created_utc": "2026-02-02 07:28:09",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2dtl3a",
          "author": "DTLow",
          "text": "Later, when there’s time    \nwhen I review/process the meeting notes/minutes",
          "score": 1,
          "created_utc": "2026-01-29 09:43:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2k2ifn",
              "author": "voss_steven",
              "text": "Does “later” usually mean the same day, or does it sometimes slip further out?",
              "score": 1,
              "created_utc": "2026-01-30 06:13:34",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2k2nni",
                  "author": "DTLow",
                  "text": "I practice zero inbox; cleared daily",
                  "score": 2,
                  "created_utc": "2026-01-30 06:14:42",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2e4lkw",
          "author": "OlenaFromProWorkflow",
          "text": "Add AI into the meeting to take notes and summarize them into the tasks. If you have meetings on Zoom, they have integrated AI and tasks. Teams has AI as well and can come up with the summary, and you can turn it into a list of tasks in the Copilot. This way you don't need to take notes during the meeting and you can add these tasks into the to do list right after the meeting of when you have some time later.",
          "score": -1,
          "created_utc": "2026-01-29 11:19:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2k2jof",
              "author": "voss_steven",
              "text": "Have you found that the AI-generated tasks usually match what the team *actually* commits to, or do they still need cleanup?",
              "score": 1,
              "created_utc": "2026-01-30 06:13:51",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o2fci24",
              "author": "ExtraHarmless",
              "text": "Do not trust AI to capture all of the action items. It is good, but not as good as you.   \nIf you take no notes in a meeting due to recordings/ai transcriptions at least take down action items, owners, and due dates. \n\nAlways validate AI output. Always.",
              "score": 1,
              "created_utc": "2026-01-29 15:32:08",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qu0n3p",
      "title": "Task tracking in slack threads keeps context that boards lose.",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1qu0n3p/task_tracking_in_slack_threads_keeps_context_that/",
      "author": "AncientPomelo5450",
      "created_utc": "2026-02-02 16:59:24",
      "score": 9,
      "num_comments": 4,
      "upvote_ratio": 0.77,
      "text": "Switched from jira to chaser for non engineering work and the difference in context retention is massive. in jira you have a task description that's always out of date and missing the nuance from original conversations.\n\nWith task tracking in slack threads, the task is literally attached to the conversation where it was created. someone forgets why they're doing something or what the requirements were, they just click into the source thread and have full context.\n\nThis is especially helpful for client work where requirements evolve through discussion. the task updates as the thread continues instead of having someone manually update a jira ticket that nobody reads anyway.\n\nNot saying this replaces jira for engineering. but for everything else like content creation, design requests, client deliverables, ops work, having tasks connected to conversation threads is way more useful than abstract tickets in a board.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/projectmanagement/comments/1qu0n3p/task_tracking_in_slack_threads_keeps_context_that/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o3almoj",
          "author": "Fantastic-Nerve7068",
          "text": "this matches what ive seen too. boards are good for structure but they strip away the why. once the convo moves on, the ticket becomes a zombie that technically exists but has no soul.\n\nthread based tasks keep intent alive. the only thing id add is you still need some higher level view once volume grows. we ended up using slack threads for capture and discussion, then rolling outcomes into something like celoxis so timelines, ownership and dependencies didnt live only in chat history. convo for context, system for memory. that combo has held up pretty well for non engineering work.",
          "score": 3,
          "created_utc": "2026-02-03 05:29:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3eww8n",
              "author": "Solmyrop",
              "text": "Can this also be done in Teams?",
              "score": 1,
              "created_utc": "2026-02-03 21:18:02",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3d0rkp",
          "author": "CompetitivePop-6001",
          "text": "Totally feel this... Context gets lost the moment work is ripped out of the convo and dropped into a board. We’ve seen teams use siit.io for this exact reason, tasks stay tied to the Slack thread, so the “why” doesn’t disappear. Way better for client work and evolving requirements than chasing stale Jira descriptions.",
          "score": 3,
          "created_utc": "2026-02-03 16:03:27",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qr3kg7",
      "title": "How to Manage Project Delays | Advice needed",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1qr3kg7/how_to_manage_project_delays_advice_needed/",
      "author": "LetsChangeNow",
      "created_utc": "2026-01-30 12:02:20",
      "score": 9,
      "num_comments": 26,
      "upvote_ratio": 0.85,
      "text": "Hi everyone,\n\nI’m currently managing a project and running into a very challenging situation, and I’d really appreciate some advice.\n\nWe have a part-time subject matter expert (SME) whose approval is required for almost everything. Unfortunately, this person consistently delays the project. In meetings, they make big commitments and speak very confidently, but afterward he would completely disappear for next 24-48 hours, no responses to message or calls. \n\nIf anyone else takes the initiative or moves forward in their absence, he later criticises the work or tries to prove it wrong, resulting in rework and further delays. He has a very high-ego personality, and replacing him isn’t an option because he is the main face to the client and senior management.\n\nI also feel that he may have developed a personal grudge against me, possibly due to frequent follow-ups or escalations when he doesn’t respond. At this point, it’s becoming a nightmare to manage. Even when I guide developers or make decisions to keep things moving, those decisions are later challenged, and more time is lost.\n\nHas anyone dealt with a similar situation? How do you manage a critical stakeholder who blocks progress but cannot be removed? Any practical strategies would be greatly appreciated.\n\nThanks in advance.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/projectmanagement/comments/1qr3kg7/how_to_manage_project_delays_advice_needed/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o2pfrzl",
          "author": "More_Law6245",
          "text": "In the past I have worked with ICT network security engineers and architects who where/are literally at the top of their field (and no, not just because I worked with them), so I'm extremely familiar with this behaviour and  it was a place where ego wasn't a dirty word.  I was constantly involved in ego pissing matches between SME's.\n\nWhen I first started out as a PM I would have these individuals behave in the same manner but when I became a bit more seasoned I started holding them to account and calling out their behaviour with fact. I would suggest the escalation process as follows:\n\n* Informally speak with them 1:1 and use fact to highlight the impact that they have by their behaviour and if you find no resolution then escalate to their team lead. Set your expectation if they are to provide subject matter expertise they are bound to the project schedule and if they fail to meet the agreed date then the matter gets escalated.\n* After the informal conversation with the SME and if the behaviour continues then escalate the matter\n* Whilst the escalation is underway informally speak with the SME's  team lead and provide documented evidence of the behaviour and how it's directly impact your project delivery.\n* If there is no adequate outcome with the team lead then you need to formally escalate it to your project board/sponsor/executive because your triple constraint is constantly being put at risk at the expense of your SME's unprofessional and unacceptable behaviour. Start showing how much time and money is being wasted because of their inability to deliver or playing hardball you start pushing out delivery dates because your triple constraint is being impacted.\n\nAt the end of the day if this individual likes you or not, you shouldn't take it personally, all it shows is how unprofessional and insecure they are as an individual.  Drive home your triple constraint and if they impede the delivery of your triple constraint then call the behaviour out and let the team lead, project board, executive or worse case scenario HR deal with the issue. It's not a project problem, it's a culture issue and that lies with your executive.\n\nBy using documented facts and evidence it's hard for the SME to take it personally because it's their action that is being highlighted and it can't come back at you because all you do is point to the facts and leave it at that.\n\nJust an armchair perspective.",
          "score": 7,
          "created_utc": "2026-01-31 00:31:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2lbd2i",
          "author": "Upset-Cauliflower115",
          "text": "I think every now and then a PM faces a situation like this, but how to approach it it really depends. There are a few things that can be done (not mutually exclusive):\n- You should have a 1:1 with him first to talk about it and align expectations. There may be something you're missing thats important. Be brave as he may be defensive. Approach it from a problem solving perspective.\n- You can increase transparency. I don't know what works best in your organization, but log the things and timestamps of when they are handed over to this person and when they are reviewed and complete. If necessary make it into a regular report.\n- You could also completely ignore his reviews and take the risk/rework. I only recommend it if your sponsor really trusts you and you know what you're doing.\n\nFinally, becareful with how you do these things. If you cowboy your way tagging him in emails saying he's the rootcause of your problems will create more friction and create a bad attitude. It's possible he's an asshole and is trying to be political. You as a PM need to create evidence and facts that make clear what is happening.",
          "score": 6,
          "created_utc": "2026-01-30 12:31:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2ldun3",
              "author": "LetsChangeNow",
              "text": "Thank you for the response and insight.\n\nThere is already enough evidence and facts that he is causing the delay, my supervisor also knows it, but my supervisor would just say it is your job to get work done from him and close the conversation. No matter what I do, he just wont respond. We work remotely, so I try to maintain as much transparency as possible.",
              "score": 3,
              "created_utc": "2026-01-30 12:47:14",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2mxdpl",
                  "author": "ExtraHarmless",
                  "text": "You might need to go above your supervisor to the internal project sponsor or that persons manager. This really is a challenging position to be in.  \nDO NOT GO TO THE CLIENT SPONSOR.",
                  "score": 3,
                  "created_utc": "2026-01-30 17:17:46",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o2lgh5e",
              "author": "Smooth-Trainer3940",
              "text": "Agree with increased transparency",
              "score": 2,
              "created_utc": "2026-01-30 13:03:24",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2oj6cr",
          "author": "EnvironmentalRate853",
          "text": "You allow 4 weeks in the schedule for each of their approvals (and potential rework). When your boss asks why your project takes so long, you point at the person. \n\nAfter decades doing PM, I’m so sick of carrying the weight of organisational issues. I just now add the stupidity and constraints to the schedule.",
          "score": 6,
          "created_utc": "2026-01-30 21:41:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2xr4cs",
              "author": "LetsChangeNow",
              "text": "Does it work?",
              "score": 1,
              "created_utc": "2026-02-01 08:05:04",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2y4lyj",
                  "author": "EnvironmentalRate853",
                  "text": "Yes - at best it gives me the slack. At worst it gives me a hill to die on. It helps me make th point in any case.",
                  "score": 3,
                  "created_utc": "2026-02-01 10:10:13",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2ls1sq",
          "author": "bluealien78",
          "text": "Do you have “Ways of Working” defined for the project so that everyone is aware of expectation? If yes, what’s the backend consequence for not meeting those ways of working?",
          "score": 4,
          "created_utc": "2026-01-30 14:06:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2mbeks",
              "author": "LetsChangeNow",
              "text": "Nope, thats not defined. Let me look into this. Thank you so much for the insight.",
              "score": 3,
              "created_utc": "2026-01-30 15:39:34",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2mh9mb",
                  "author": "bluealien78",
                  "text": "I highly recommend it. I have my team define it as part of kick-off and discovery, and we have a baseline set of ways of working that apply to every project and program without exception. Things like “action items or decisions in every meeting”, “comms within 24 hours”, “acknowledgement and responses to comms within 48 hours” “status in email, blog, and Slack” etc. It makes things SO much smoother on the back end and keeps every project and program participant on the same page with the same understanding of expectations.",
                  "score": 4,
                  "created_utc": "2026-01-30 16:05:56",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2u9diy",
          "author": "RedactedSoul1",
          "text": "This is common unfortunately. Document the pattern but not the person. Track all the delays, rework etc. This will keep things objective if escalation ever becomes necessary & helps shift the conversation away from emotion and towards delivery RISK.  \n\nYOur're not failing at this. You're dealing with a single point of failure who also needs their ego managed.",
          "score": 3,
          "created_utc": "2026-01-31 19:23:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2lpsmc",
          "author": "Renovateandremodel",
          "text": "You need a contractually obligated SME to stop the bottleneck flow of the project. \n\nCan they be let go? \n\nIf not, then make them contractually bonded. Have them get a performance bond with verifiable evidence they have performed their duties with delay, and it’s costing the project scope, time, cost.",
          "score": 2,
          "created_utc": "2026-01-30 13:54:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2oxfjb",
          "author": "Ravintolavaunu",
          "text": "I can feel your pain.  \nNo meeting without documentation of the agreements and action points!  \nDo you assign and track the action points in a tool like Jira, Asena, Trello, whatever? I would do that as part of the meeting minutes. You can any time request an update, etc. then via the tool, no need to wait for the person to show up.  \nAnd it can then be followed up via the tool and reported to his line management without emotions, just based on facts that actions were agreed on this and that date and this is the status. With nice bar charts, pie charts, etc. when it gets more.",
          "score": 2,
          "created_utc": "2026-01-30 22:51:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2rwyfe",
          "author": "Party_Camera_6588",
          "text": "Couldn't it just be an allocation problem where the EMS has different priorities than you?",
          "score": 2,
          "created_utc": "2026-01-31 11:46:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2xra1g",
              "author": "LetsChangeNow",
              "text": "Yes, EMS has different priorities, but he committed to the project. And replacing him hasn't been easy",
              "score": 1,
              "created_utc": "2026-02-01 08:06:33",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2yhl3w",
          "author": "somethingweirder",
          "text": "i mean this doesn’t apply to most of yr complaints but him not responding is at least partially due to being part time.",
          "score": 2,
          "created_utc": "2026-02-01 12:04:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o367d99",
          "author": "Fantastic-Nerve7068",
          "text": "yeah this is a rough spot, and sadly it’s more common than people admit.\n\na few things that tend to work in the real world, not the textbook one.\n\nfirst, stop relying on verbal commitments. after every meeting, send a short written recap with clear asks. something like “to keep us moving, we’ll proceed with option B unless we hear otherwise by Thursday 3pm.” this does two things. it creates a paper trail, and it shifts silence into implicit approval instead of a blocker.\n\nsecond, change the approval shape. instead of asking for open ended approval on everything, give constrained choices. “please confirm A or B” or “flag any blockers, otherwise we’ll implement as proposed.” high ego SMEs often like reacting more than creating. use that.\n\nthird, make the cost of delay visible without making it personal. don’t say “you’re blocking us.” say “this decision slipped 3 days, which pushed testing and now risks the client date.” repeat this calmly and consistently. over time, leadership starts to see the pattern even if you never accuse him directly.\n\nfourth, protect the team from rework. when you move forward in his absence, document the assumption. “based on last discussion and no objections, we proceeded with X.” if he later criticizes, bring it back to that assumption and ask what would have been different if he had responded earlier. keep it factual, not emotional.\n\nfinally, loop your manager in early and frame it as a delivery risk, not a people issue. you’re not escalating a person, you’re escalating a dependency that’s unstable.\n\nyou’re not doing anything wrong here. this is classic single point of failure mixed with ego. the goal isn’t to fix him, it’s to build enough structure around him that the project can survive his behavior.",
          "score": 2,
          "created_utc": "2026-02-02 15:46:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3acm9f",
              "author": "LetsChangeNow",
              "text": "That's really good insight. Thank you so much 🙏",
              "score": 2,
              "created_utc": "2026-02-03 04:25:34",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2m4i0h",
          "author": "InfluenceTrue4121",
          "text": "Does your schedule have a specific approval task assigned to the SME? In my experience, that works super well. If you are off schedule, open an issue- Decision Delay impacting schedule and budget. That’s how you fix this: very transparent accountability.",
          "score": 2,
          "created_utc": "2026-01-30 15:07:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2n4tcg",
              "author": "homemadedrew",
              "text": "I’d like more guidance on the issue decision delay.\n\nThis is a huge issue for one of my ERP projects, a bloody laundry list of outstanding decisions required from leadership that are constantly delaying the project.",
              "score": 2,
              "created_utc": "2026-01-30 17:51:08",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2ocerp",
                  "author": "InfluenceTrue4121",
                  "text": "I’d open a project issue and documenting the following: \n\nAdd a “Decision Point” task to your schedule. Baseline it in your meeting w the SME. Explain to him that the baseline is a set of dates against which you measure whether or not the project is delivered on time. Maintain the schedule and share that schedule with all stakeholders. Once the schedule start slipping, you open an issue. You document that a slippage has moved your go live date by x number of days. I hope that you have a regular risk/issue review meetings. Look up risk management for more details and examples. But basically, your SMEs bad behavior will hopefully trigger a review of his work habits.",
                  "score": 2,
                  "created_utc": "2026-01-30 21:09:20",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3bmbm5",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-03 11:03:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3e13y8",
              "author": "projectmanagement-ModTeam",
              "text": "Thanks for your post/comment.  \n\nWe removed this post because it's in direct violation of our \"solicitation / self-promotion” rule.  \n\nPlease review these rules, which can be found in the sidebar.\n\nThanks,\nMod Team",
              "score": 1,
              "created_utc": "2026-02-03 18:49:45",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qq100t",
      "title": "Humble Bundle pack",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1qq100t/humble_bundle_pack/",
      "author": "De_Arca",
      "created_utc": "2026-01-29 06:28:04",
      "score": 8,
      "num_comments": 4,
      "upvote_ratio": 0.79,
      "text": "just found this on humble bundle. \n\nonly 12 hours left. \n\nhttps://www.humblebundle.com/software/managers-toolkit-packt-software?hmb\\_source=&hmb\\_medium=product\\_tile&hmb\\_campaign=mosaic\\_section\\_1\\_layout\\_index\\_3\\_layout\\_type\\_threes\\_tile\\_index\\_2\\_c\\_managerstoolkitpackt\\_softwarebundle\n\nthought it might be worth passing on!\n\nnot affiliated or self promoting, just resource sharing. ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/projectmanagement/comments/1qq100t/humble_bundle_pack/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o2d7ue2",
          "author": "AutoModerator",
          "text": "Attention everyone, just because this is a post about software or tools, does not mean that you can violate the sub's 'no self-promotion, no advertising, or no soliciting' rule.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/projectmanagement) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-01-29 06:28:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2dcil5",
          "author": "PersonBlanco",
          "text": "Thank you!!! My first humble bundle purchase to date",
          "score": 5,
          "created_utc": "2026-01-29 07:06:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2dcnde",
              "author": "De_Arca",
              "text": "I haven't used humble bundle in years! I dunno why I decided to have a look at it today. I'll be making sure to keep an eye on it from now on.",
              "score": 3,
              "created_utc": "2026-01-29 07:08:04",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2fvtsl",
          "author": "sadfilthycasual",
          "text": "Great find! Thank you for sharing!",
          "score": 3,
          "created_utc": "2026-01-29 16:58:09",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qprjgp",
      "title": "Need Advice: Newly appointed to become the team's hybrid PM / Engineer and feel totally out of depth",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1qprjgp/need_advice_newly_appointed_to_become_the_teams/",
      "author": "luthiel-the-elf",
      "created_utc": "2026-01-28 23:21:28",
      "score": 8,
      "num_comments": 3,
      "upvote_ratio": 1.0,
      "text": "Hello everyone,\n\nI would really appreciate your advice on what to do as a new Project Manager stepping into projects much larger in scale than anything I’ve managed before.\n\nI’m a 36F engineer in high-tech manufacturing with 10 years of total experience, including 7 years in my current industry. In my previous role, I was an R&D Project Manager, managing 5–10 small, highly similar technical projects in parallel. These projects were handled by the same team and resources (mostly technicians) in a highly regulated industry with well-defined standard procedures.\n\nMy role mainly involved allocating and juggling team resources, tracking tasks and following up, building and maintaining basic planning (Gantt, PERT), removing obstacles, managing priorities, and ensuring on-time delivery and continuity (holidays, backups, etc.). The people I worked with were lab technicians, factory workers, and engineers.\n\nI joined my current, much larger company six months ago as an Industrialization Engineer. Things have gone well, and I received very positive feedback from my manager, who previously worked as a Project Manager and was part of the PMO team.\n\nDuring my annual review preparation last week, one question was: “Where do you see yourself in the company in three years?” I wrote that I would like to become an official Project Manager, fully aware that the PM role here has a much broader scope than my previous experience.\n\nMy manager was very supportive and suggested that the best path would be to start taking on PM responsibilities and learn on the job. Within one week, he obtained approval from the department director and the PM team lead for me to take over the PM function for all projects in my current team, part-time, while continuing my Industrialization Engineer role for the other half of my time.\n\nI will be taking over these projects from an official PM who was previously assigned to us. For now, I remain within the Industrialization Engineering team, which suits me well.\n\nI know my engineering teammates well and understand the technical work they do (developing and industrializing new products across sites and ramping up production). However, project management in this company is on a completely different level from my past experience. It involves coordination across multiple manufacturing sites as well as finance, business units, compliance, legal, marketing, business development, and sales. There are also many documents and deliverables I’m not familiar with, and the projects vary widely in strategy and industrialization approach depending on the site.\n\nI accepted this opportunity yesterday. Today, it was announced to the Industrialization team, the PM team, and management. My manager expected a gradual handover over three weeks, but the outgoing PM made it clear in a one-on-one discussion that she will provide a single one-hour handover for all projects. After that, it will be up to me to ask the right questions and figure things out on my own. She stated clearly that she will not provide further explanations or support.\n\nI’m very excited about this opportunity, but also very nervous. It’s clearly a step in the right direction, yet I don’t fully understand how everything works or who all my stakeholders are. My manager is extremely supportive and did a lot to make this happen, but I still feel out of my depth and quite lost.\n\nDo you have any advice for me?",
      "is_original_content": false,
      "link_flair_text": "Career",
      "permalink": "https://reddit.com/r/projectmanagement/comments/1qprjgp/need_advice_newly_appointed_to_become_the_teams/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o2brt5c",
          "author": "More_Law6245",
          "text": "Congratulations on your promotion, you have been given a great opportunity to further your career. I question  the incumbent PM's behaviour and her position in only providing a 1 hour handover meeting, not only does it show that they're uncooperative but also not a team player.  To be honest based upon past experience, you have  \"dead cats\" in your projects and they're about to be thrown over the fence to you. Not trying to scare you but the behaviour makes me question the intent behind what has been stated. \n\nWhen taking over any inflight project I strongly suggest that you under take the following: \n\n* Understand that you have the right to review and audit the project prior to accepting any or all responsibility and any issues or problems you have, raise them prior to accepting responsibility because if you don't then that falls on you.\n* You need to review the original business case, ensure that it's fit for purpose e.g. ensure the project can actually deliver in what has been outlined and will the benefits can actually be realised. \n* Undertake a project artefact review, ensure you have an approved project mandate, project plan and project schedule and that schedule has been baselined. You need to clearly understand the project's triple constraints of time, cost and scope. If not that is your first red flag for the current incumbent PM to rectify prior to handing over or you escalate the matter.   \n* I would also suggest reviewing the project decisions, issues and risk logs to see if there is anything concerning or outstanding, if so raise it with the incumbent PM to explain or raise it with your project board, sponsor or executive accordingly. \n* Request a top 5 check list from your incumbent PM, this can be a one pager outlining project scope, financial position (eg forecast cost vs actuals), project objectives, top 5 issues and risks and what are the immediate deliverables that are due and need to be your priority. This is just considered a professional handover and anything less is considered unprofessional. \n* You also need to understand who your project stakeholders are (primary and secondary), this is one of the questions that you ask the incumbent PM to provide but what is the nature of the relationship as well and how do the impact the project. This also helps you identify and foster working relationships off the bat. \n\nThis all might seem a little overwhelming at first and also I appreciate that you're new to the company but may I suggest that don't just walk blindly into an inflight project, ask the hard and difficult questions to make sure you're comfortable in accepting responsibility and if it inconveniences the incumbent PM, then that is their issue and not yours. Good luck in your new role! \n\nJust an armchair perspective. ",
          "score": 5,
          "created_utc": "2026-01-29 01:05:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2dfomw",
              "author": "luthiel-the-elf",
              "text": "Thank you, I will do this. The one hour handover is today, I will try asking all the questions you put there. This is happening so quick that I was told about the new role two days ago, handed the documents yesterday evening for handover first thing this morning.\n\nI do think there are dead cats yes. My feeling is that there is something happening behind the scene I am not aware of. The current PM says she is now assigned to the shiny new strategic major new project and has no more time for what she considers less important projects like the one managed in our team. I do feel this is the reason my manager wants a PM managing just the projects in our engineering team. My feeling is that he wants someone the team can talk to and would be available on site 😅\n\nThe better news is that while I don't know who the stakeholders are I know the project well from engineering perspective and the people who will do the real product development and industrializing this and this is doable although there are technical risks. One of my engineering team mates are also in the steering committee meetings since the beginning and I get along with her well so I do hope she can at least fill me in about stakeholder and risks. \n\nRight now I do expect major issues not from technical perspective but from stakeholder / other part of this project beyond engineering's side yes.",
              "score": 1,
              "created_utc": "2026-01-29 07:34:39",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2bbawb",
          "author": "happyrhubarbpie",
          "text": "Have you raised the disparity in handover to your manager? If not, I suggest starting there. Since they're being so supportive, they'll be able to A) temper expectations about your ramp-up into the role, B) possibly provide more guidance. \n\nThe good news? You sound both organized and smart with a clear understanding of the baseline of the kinds of projects you'll be managing... that will take you far. Your ability to assess your current lack of knowledge, combined with your ability to ask questions, will also mean you're going to do excellent!",
          "score": 2,
          "created_utc": "2026-01-28 23:38:57",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}