{
  "metadata": {
    "last_updated": "2026-02-14 02:59:58",
    "time_filter": "week",
    "subreddit": "projectmanagement",
    "total_items": 18,
    "total_comments": 191,
    "file_size_bytes": 220290
  },
  "items": [
    {
      "id": "1r3x043",
      "title": "tried to document all our processes and realized half of them only exist in people's heads",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1r3x043/tried_to_document_all_our_processes_and_realized/",
      "author": "SideQuestDentist",
      "created_utc": "2026-02-13 18:28:35",
      "score": 110,
      "num_comments": 41,
      "upvote_ratio": 0.98,
      "text": "Started a documentation project thinking it would take a few weeks and here I am three months later understanding why companies hire consultants for this. Every time I ask someone how they do something the answer is \"it depends\" followed by fifteen edge cases, stuff that's supposedly standardized has three different versions depending on who you ask, and critical knowledge lives entirely in the heads of people who could leave tomorrow.\n\nThe scary part is we function fine day to day but if certain people left we'd be scrambling to figure out how basic things even work. Anyone else realized how fragile their operations actually are when you look closely at them?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/projectmanagement/comments/1r3x043/tried_to_document_all_our_processes_and_realized/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o595rmp",
          "author": "brye86",
          "text": "The real problem with processes is once they’re documented. Who follows them? People will only read and follow so much. You can have a document on how to make tea and coffee but no one is reading it.  Too much documentation becomes useless.  Too little documentation you become lost.",
          "score": 16,
          "created_utc": "2026-02-13 23:37:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o57n1p3",
          "author": "sdarkpaladin",
          "text": "Sir.\n\nMy company is so lean, my projects usually have a bus factor of  one.\n\nAnd it ain't me.",
          "score": 12,
          "created_utc": "2026-02-13 18:57:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o57ppz4",
              "author": "ExtraHarmless",
              "text": "I love the name \"bus factor\"",
              "score": 4,
              "created_utc": "2026-02-13 19:09:55",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o588rbh",
                  "author": "tofer85",
                  "text": "Could be the lottery factor if you are a glass half full kind of person…",
                  "score": 1,
                  "created_utc": "2026-02-13 20:44:38",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o57jfjq",
          "author": "tubaleiter",
          "text": "Absolutely - we’re on an automation kick, and then you realise the “standard” is an exception, and myriad exceptions are the rule. How the fuck do you automate that clusterfuck?",
          "score": 11,
          "created_utc": "2026-02-13 18:39:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o57movb",
              "author": "joseph_sith",
              "text": "In my experience the team owning the process has to be willing to re-evaluate it from the ground up, and try to shift away from accommodating edge cases. Sometimes edge cases are valid, but I find that many in my organization exist due to technology limitations, or because “that’s just how we do it” and no one has re-validated the process in over a decade. I’m a big believer that transitioning any manual process to automation should include uplift to the process itself (but maybe my org is unique in the insanity of our manual processes lol)",
              "score": 3,
              "created_utc": "2026-02-13 18:55:19",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o57o46n",
                  "author": "tubaleiter",
                  "text": "Totally makes sense - we’re still stuck in the fun of fighting over who owns each process, too.",
                  "score": 2,
                  "created_utc": "2026-02-13 19:02:04",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o57m2qm",
              "author": "Defy_Gravity_147",
              "text": "By keeping every variable coherent to its scope.",
              "score": 0,
              "created_utc": "2026-02-13 18:52:26",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o57zxk6",
          "author": "painterknittersimmer",
          "text": "So half of them are actually documented!? Damn, I'd kill for that. ",
          "score": 11,
          "created_utc": "2026-02-13 20:00:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o58kwzo",
              "author": "RhesusFactor",
              "text": "Yeah. I was at a place that wanted to get some process. But they did Agile and believed in people over process, products over documents. So when their key people left they had none of the above. And I was asked to reinvent the processes without knowing what they did.",
              "score": 2,
              "created_utc": "2026-02-13 21:44:45",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o58p0fu",
                  "author": "painterknittersimmer",
                  "text": "Ah, gotta love Agile",
                  "score": 1,
                  "created_utc": "2026-02-13 22:04:53",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o581hga",
          "author": "PplPrcssPrgrss_Pod",
          "text": "That's not good. Need to get that knowledge onto a workflow diagram or other document. Also good to build into your systems.\n\nWhat I've found helpful is that we capture the processes aligned to positions or skillsets, not individual people. People leave and mostly positions stay in place.\n\nGodspeed.",
          "score": 10,
          "created_utc": "2026-02-13 20:08:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o581836",
          "author": "SVAuspicious",
          "text": "Some people are afraid that documenting what they do puts their jobs at risk. I put requests for documentation in terms of \"what if you get hit by a bus?\" \n\nThe problem is not time critical. The product is not supposed to win a Pulitzer prize. Often bullet lists are fine. \n\nI've been through this several times. I haven't needed consultants. A long timeline is fine. ",
          "score": 8,
          "created_utc": "2026-02-13 20:06:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o582k7x",
              "author": "kawasaki03",
              "text": "I frame it like, \"What if you win the lottery and leave?!\" Makes them a bit more enthusiastic to document, for whatever reason!",
              "score": 6,
              "created_utc": "2026-02-13 20:13:26",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o58kel5",
                  "author": "RhesusFactor",
                  "text": "Ah the old lotto bus",
                  "score": 3,
                  "created_utc": "2026-02-13 21:42:16",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o591cp6",
              "author": "Desert_Fairy",
              "text": "I like to frame it as “what if you get offered your dream job in Hawaii?  How long do you want to take to do a handover before moving on?”\n\nThat way it is less guilt for leaving problems behind and more “it will be a hassle for you and be a barrier between you and your happiness.”",
              "score": 2,
              "created_utc": "2026-02-13 23:11:28",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o57nkrk",
          "author": "timevil-",
          "text": "Tribal Knowledge = Deadly",
          "score": 8,
          "created_utc": "2026-02-13 18:59:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o57o28x",
          "author": "Equivalent_Memory3",
          "text": "I'm three years into attempting to document and revise our processes. When I started, the SOPs referenced processes and forms that didn't exist.\n\nSometimes ya just gotta start with a very simple processes just to get it on the books for people to review.",
          "score": 8,
          "created_utc": "2026-02-13 19:01:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o57htjq",
          "author": "Sea_Weather5428",
          "text": "The \"it depends\" thing is where the actual complexity lives and it's genuinely hard to write down in a way that covers all the scenarios.\n\n  \n",
          "score": 7,
          "created_utc": "2026-02-13 18:32:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o592yz8",
          "author": "shampton1964",
          "text": "As one of those consultants, while it is Very Important to find out how people are doing the job, it is ALSO Important to figure out how they could best be done to eliminate edge conditions, ensure routine function, and so forth. \n\nThat's why us old heads say there is an art to this!",
          "score": 7,
          "created_utc": "2026-02-13 23:20:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o57vdqm",
          "author": "eredinso",
          "text": "I worked as a Knowledge Manager for years and then consulted in the space (my heart goes out to you for taking this on hahaha), and every company without a KM or at least a long-time consultant has this problem. All of them.\n\nSo many aspects of business operate with ambiguity and nuance and those are the things that kill effective documentation.\n\nBecause of that, effective documentation **cannot** happen in a silo by someone who only has the ability to document. If processes need to be documented, some processes will inevitably need to be *changed* in order to be documented. Not every process can be a massive decision tree, so not every edge case can be catered to. Process optimization should happen first, documentation after.",
          "score": 6,
          "created_utc": "2026-02-13 19:37:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o57xclt",
          "author": "Childish_Tycoon_Ship",
          "text": "I like to call that, \"Job security\"",
          "score": 6,
          "created_utc": "2026-02-13 19:47:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o58jyha",
          "author": "Rosyface_",
          "text": "Yeah my org is running into this over the past year or so. Multiple single points of failure and all those people are retiring. Massive problems incoming, I predict. Especially when one of the data engineers is the only person holding together an entire legacy system the entire place relies on for literally everything. That system goes down and we’re fucked. He’s retiring in May.",
          "score": 5,
          "created_utc": "2026-02-13 21:40:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o58vxu1",
          "author": "PickleNick1987",
          "text": "Stop focusing on how things get done. A process should define what happens. More specifically, what is supposed to happen, what roles interact with it, what triggers it to start, what triggers it to end (likely the action is a handoff) and what are metrics in place to evaluate to measure/validate success. If someone new steps into the role or you switch systems, it does not change what the process is. \n\nHow it gets done only matters if some internal or external factor requires it, and in most cases, regulatory or compliance requirements.\n\nWent thru the same thing recently and that mindset shift has really helped simplify things for me and others",
          "score": 9,
          "created_utc": "2026-02-13 22:41:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o58yt25",
              "author": "dapper_pom",
              "text": "...if someone does twice the amount of work that is needed to do the thing, you don't think it is something that should be adressed? I think it absolutely matters how things get done.",
              "score": 5,
              "created_utc": "2026-02-13 22:56:58",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o59v5hn",
                  "author": "PickleNick1987",
                  "text": "That’s why you have measurable expectations (metrics) in place to evaluate if someone’s way of doing things is working",
                  "score": 1,
                  "created_utc": "2026-02-14 02:14:14",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o57hdms",
          "author": "OppositeJury2310",
          "text": "Forcing standardization through tools for routine stuff first helped us, like phone intake through sonant means the process is whatever sonant does and scheduling through calendly means availability is whatever the calendar rules allow. There's less to document because the system is the documentation, if that makes sense. Same thing with our intake forms in typeform, the form itself defines what information we collect so there's no \"it depends on who answers\" variation anymore. Harder with judgment based tasks obviously but for the routine repetitive stuff, picking a tool and letting it enforce the process eliminated a ton of tribal knowledge that was impossible to write down anyway.\n\n  \n",
          "score": 4,
          "created_utc": "2026-02-13 18:30:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o57iz7y",
              "author": "Goggio",
              "text": "This is the way. \n\nFocus on \"where is the rework happening and how can we stop it\" ; you'll end up with 90% of your problems solved and people will be happy because almost all of the solves will end up documented with clear steps... fuzzy sops are absolutely fine in small teams of experts and when a true sop is needed you already have buy in and a baseline starting point.",
              "score": 2,
              "created_utc": "2026-02-13 18:37:45",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o57moc9",
          "author": "Brodrick_Rolfson",
          "text": "Any good process has room for flex but not ambiguity. I complety feel this and its frustrates me to no end.",
          "score": 3,
          "created_utc": "2026-02-13 18:55:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o58e4ts",
          "author": "More_Law6245",
          "text": "I remember doing a consultancy gig, I was auditing and assessing PMO organisational performance and when I first turned up the team handed over all of their organisational policy process and procedures for review and assessment. It was like seeing my client  like a 5 year old on their first day of school and when I had finished my initial audit it was like seeing a high school teenager with a month of detentions. \n\nWhat the organisation thought they knew and what they actually did where actually completely two different things, what they had done was document a version of reality that reflected nothing like what they actually did.  It was the biggest organisational disconnect I'd actually seen in the corporate space and what made it worse was it was a federal public service organisation.  So OP, you're not alone but I would suggest be careful not to follow the rabbit down the hole, keep every thing high level and let the respective teams drill down on their own and you just set a framework for them to work towards. ",
          "score": 5,
          "created_utc": "2026-02-13 21:11:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o58lp3j",
          "author": "RhesusFactor",
          "text": "Yeah. Some places are just an oral tradition and do nothing repeatable. I had to stop my director once and risk my job to say 'you don't need a pmo, you need a business plan'",
          "score": 4,
          "created_utc": "2026-02-13 21:48:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o58pesl",
          "author": "todfish",
          "text": "Yeah but in reality how thoroughly can documented and enforced processes actually inform the real life day to day work? \n\nI feel like I come up against this issue all the time: \n\nA lack of documented processes is identified and this scares everyone (mostly management) > There’s an effort to establish set processes > Experienced pm’s resist that effort because it doesn’t perfectly fit what they know to be effective (for them) > The processes put in place are incomplete and not really fit for purpose > Experienced pm’s continue to ignore them and do their own thing > Inexperienced pm’s try to follow the processes / framework but frequently miss the point and get tripped up by all the gaps (win the battles but lose the war). \n\nUnless you’re in an industry / organisation that only uses their pm framework to deliver a narrow range of project types, I just don’t think you can feasibly process your way out of the need to have high performing pm’s who are given the freedom to **do what needs to be done, in order to deliver the desired outcome.**\n\nAt the end of the day, project management can be extremely complex and varied. The best pm’s I’ve worked with take the time and make the effort to understand the mission, then build the project accordingly. That means the project is structured in a way that fits their style of project management. No one is ever going to be more across the needs of a project than the pm, so if they’re forced into a process that doesn’t suit their style or the needs of the project then things will fall apart fast.\n\nTLDR: Establishing processes can provide useful guidelines, but they can also stymie the work of good pm’s and create a false sense of security for bad pm’s and management. There are often good reasons why certain processes are not set in stone and why some pm’s and some projects do things differently.",
          "score": 5,
          "created_utc": "2026-02-13 22:06:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o59uzpm",
          "author": "Ok-Pair8384",
          "text": "These AI posts are getting subtler, but still ends the prompt with an open ended question.",
          "score": 4,
          "created_utc": "2026-02-14 02:13:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o58plne",
          "author": "jd2004user",
          "text": "It’s not PC to say but tribal knowledge is unfortunately something a great many orgs rely on. So much is lost when key individuals leave though the orgs have only themselves to blame.",
          "score": 3,
          "created_utc": "2026-02-13 22:07:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o57yvk4",
          "author": "therealvitocornelius",
          "text": "see this is the fun part though, processes aren’t defined by analysts, they’re defined by the people doing the work. I’m not saying that’s necessarily the right way to do the work, but edge cases are still use case cases and still need to be documented. You’re just getting into the meet of the problem. The more you simplify these processes down, the more on the same page the people doing the work will be. As somebody else mentioned this is job security for you",
          "score": 2,
          "created_utc": "2026-02-13 19:55:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o580b35",
          "author": "Low_Friendship463",
          "text": "Yup that's fairly typical...I've been at my company for a year and any time I think of something I ask \"do we...\" Or \"where is...\" And usually get a response of yeah we need to get that more aligned...and we do as a PM team do work on it but they were a small team, building up as the business has grown so we're in the beginning stages.. I've already suggested that we start building towards a PMO level repository of documents just in case we need something heavier than an email confirmation from a sponsor.",
          "score": 2,
          "created_utc": "2026-02-13 20:02:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o57h32h",
          "author": "AutoModerator",
          "text": "Hey there /u/SideQuestDentist, have you checked out the [wiki page](https://www.reddit.com/r/projectmanagement/wiki/index) on located on r/ProjectManagement?  We have a few cert related resources, including a list of certs, common requirements, value of certs, etc.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/projectmanagement) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-13 18:28:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o57ygo1",
          "author": "pmpdaddyio",
          "text": "Then create and document your own process.",
          "score": 1,
          "created_utc": "2026-02-13 19:53:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o58irbm",
          "author": "040422",
          "text": "My fave is when they say how standardized the org is, rigor, processes and the actuality is no one is doing the same thing…the standard doesn’t exist except in the mind of the PMO manager. Heaven help you when you ask about this….ask me how I know",
          "score": 1,
          "created_utc": "2026-02-13 21:34:17",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r1f1b2",
      "title": "Anyone using project management software that shows real burn vs budget?",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1r1f1b2/anyone_using_project_management_software_that/",
      "author": "Papito24",
      "created_utc": "2026-02-10 22:15:30",
      "score": 43,
      "num_comments": 23,
      "upvote_ratio": 0.77,
      "text": "PM at a professional services firm and this keeps bugging me. Schedules look green, clients are happy, but finance is constantly flagging billing issues after the fact. Right now delivery tools and billing live in totally different worlds, so PMs don’t really see burn vs budget in real time. What do other PMs use to get visibility into project financials without living in spreadsheets??",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/projectmanagement/comments/1r1f1b2/anyone_using_project_management_software_that/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o4p2ueb",
          "author": "AutoModerator",
          "text": "Attention everyone, just because this is a post about software or tools, does not mean that you can violate the sub's 'no self-promotion, no advertising, or no soliciting' rule.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/projectmanagement) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-10 22:15:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4p6j9a",
          "author": "cbelt3",
          "text": "It’s all about how you do project accounting. That’s what you need to interface. PM software won’t magically fix that for you, you have to find an integration point.",
          "score": 8,
          "created_utc": "2026-02-10 22:34:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4pp85c",
          "author": "oscarnyc1",
          "text": "Take a look at Motionode. It tracks cost, sow, and updates dates automatically. It also shows weekly capacity versus tasks requirements.",
          "score": 6,
          "created_utc": "2026-02-11 00:17:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4sb0im",
          "author": "SVAuspicious",
          "text": "You use \"burn\" differently than I do. \n\nFor good information you have to collect good labor and expense information. Weekly timesheets is good periodicity synchronized with status input. \n\nActual costs come from accounting into PM through an API and show up as actual costs (AC). The baseline in PM and status show earned value (EV). The baseline shows planned value (PV). I report this as CPI and SPI with LOE tasks excluded. \n\nOn contracts with progress payments instead of periodic (usually monthly) billing I get and include two other artifacts. First is AC v. billing as a line graph. If the customer is slow pay we add a \"paid\" line. I get reports from accounting of outstanding invoices (ours to customers and vendors to us). Second is a report of incomplete tasks to the next two progress payments. \n\nThe data flows from accounting to one of my BAs who generates reporting to me and for outgoing reporting. Everyone gets the same information. No tailored reporting. The BA has spreadsheet templates formatted to look like the ones from the PM tool to avoid confusion. Accounting provides data as .xlsx files. It's all very automated so work is in analysis, not generation. We also get an allocated cost from finance for interest charges for running costs (labor and expenses) from our corporate line of credit that shows up as a charge in our data from accounting through the API. If we see something big (big materials usually) on the horizon we generate an exception report as a heads up to finance. \n\nPM tools I've had this work with include MS Project, Scitor Project Scheduler (RIP), and Primavera. The new generation of PM \"tools\" are deficient. I have yet to encounter an accounting tool (or HRIS for that matter) without good API support. \n\nMS Project doesn't scale well when project size gets exponential, say 10 x 10^(7) USD. \\*grin\\* \n\nIn my experience, building systems to avoid duplicate data entry and for the long term is worth marginal cost in capex to minimize opex. Remember - all this stuff (except my BA) is overhead. \n\nDave's rant #374: Software can't do your job for you. You have to know what you're doing. \n\nPM, SE, accounting, finance, HR, IT, and legal form a team. We meet as needed (no periodic meetings - as needed) when anyone sees a bump in the road. We have an email distribution list as most bumps can be avoided through communication. If accounting software is getting an upgrade we all know. If some SaaS contract (ugh) is being renewed we all know. If HR is responding to new reporting requirements that change data formats we all know. If IT is doing a desktop refresh or changing cell phone plans we all know. ",
          "score": 5,
          "created_utc": "2026-02-11 12:07:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4pb5hy",
          "author": "NewZealandTemp",
          "text": "Based on what I’ve seen discussed here and in PM-focused reviews, BigTime is often mentioned when people look for tools that surface burn rate and budget alignment during delivery, not just at invoicing. It’s usually framed as helpful for PMs who want financial signals alongside timelines, especially in services environments.",
          "score": 5,
          "created_utc": "2026-02-10 22:58:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4rogwo",
          "author": "Present_Nerve7871",
          "text": "Most of the accounts posting in here are AI, just fyi.",
          "score": 4,
          "created_utc": "2026-02-11 08:48:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4u4cbq",
              "author": "Smooth-Trainer3940",
              "text": "Unfortunately",
              "score": 1,
              "created_utc": "2026-02-11 17:49:49",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4uodfg",
          "author": "baggins1717",
          "text": "Excel and PowerPoint, literally",
          "score": 4,
          "created_utc": "2026-02-11 19:22:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4vg361",
          "author": "More_Law6245",
          "text": "In reality most company's don't have the luxury of data lakes/pools as most companies are still working with disparate IT systems and data stores, a PM is the unfortunate administration bridge between the two because it's the PM who needs the information. \n\nTo be honest it's a fact of life for a PM, the only way they can do forecast and actually is with the tools that they have, what they can leverage and to be honest a spreadsheet is fine for this. I would suggest setting up a standard template and all you have to do is import your relevant data stores for analysis. In the past I have even been able to automate the raw data imports for MS Excel. \n\nTo be perfectly frank, a PM should be doing their own import and data manipulation in order to find micro tends in the data e.g. a task or work package supposedly being finished because you see time attributed but no deliverable, or you can start baselining tasks or work packages for future projects etc. It's also a skill that a PM must possess in knowing how to complete a trend analysis on forecast and actuals. \n\nAlso another consideration, forecast and actuals is not considered a realtime transactions because the forecast is a future state and actuals is a past state because you record the effort or expenditure after the fact. Also it's highly unlikely you will have resources submitting daily timesheets, your finance team providing you financial transactions against your project and you running a report after these transactions have occurred, it's not feasible to conceive that project transactions can be measured in realtime. \n\nThe reality is that a PM is the stop gap for decentralised information and every PM must have the skills to be able to assimilate, analyse and disseminate the disparate data stores in order to understand how their project is truely performing against the schedule and must be considered your primary quality indicator. Off loading through automation (which I've seen many PM's wanting to do) runs the risk of really not understanding how your project is truly progressing and performing. ",
          "score": 5,
          "created_utc": "2026-02-11 21:36:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4rwcxg",
          "author": "ConstructionPM_Pro",
          "text": "The disconnect between delivery tools and billing is the eternal PM struggle. You don't necessarily need fancy software — the key is having a consistent workflow for tracking hours/costs as work happens, not after the fact. I've found that simple templates (weekly burn reports, project cost trackers) that feed into a single dashboard solve 80% of this. The problem is usually process, not tools. Get your team logging costs consistently first, then pick software that fits your workflow — not the other way around.",
          "score": 3,
          "created_utc": "2026-02-11 10:02:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4p4yqf",
          "author": "RemotePersimmon678",
          "text": "Harvest does this",
          "score": 2,
          "created_utc": "2026-02-10 22:26:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4rzr3d",
          "author": "arina_katz",
          "text": "We use actitime to see the project budget burn, you can track the budget by client, project and even task, very convenient ",
          "score": 2,
          "created_utc": "2026-02-11 10:33:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o544kvq",
          "author": "Fantastic-Nerve7068",
          "text": "we switched to Celoxis. It actually shows real time burn against budget inside the project view itself not just hours but actual cost tracking. You can tie in billable rates, see how much has been logged, what’s left, and whether you're overrunning before finance sends that dreaded email.\n\nIt’s not just a reporting tool either we use it for planning, approvals, timesheets, everything. Having delivery and financials in the same system means way fewer surprises and way less back and forth with accounting. If budget visibility is your pain point, definitely worth checking out.",
          "score": 2,
          "created_utc": "2026-02-13 05:13:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4qd6nr",
          "author": "DeliciousBuilder0489",
          "text": "Check out RocketLane. We just switched and it should suffice your use case.",
          "score": 1,
          "created_utc": "2026-02-11 02:39:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4rcxrx",
          "author": "HastaLaVistaDonkey",
          "text": "Klient.com",
          "score": 1,
          "created_utc": "2026-02-11 07:00:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4rji9g",
          "author": "Low-Illustrator-7844",
          "text": "Does the software you use to raise invoices not give you that option?",
          "score": 1,
          "created_utc": "2026-02-11 08:00:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4rofex",
          "author": "Murky_Cow_2555",
          "text": "What’s helped in my experience is tying time tracking directly to tasks and having budget fields at the project level that roll up automatically. So instead of hours logged somewhere else, you see planned vs actual hours and cost variance right on the project dashboard. That alone changes behavior because PMs stop managing just scope and start managing burn in real time.\n\nWe’ve used Teamhood in one setup where budget and estimation fields were locked at the workspace level and time rolled up to the project, so PMs could see burn vs estimate without exporting to Excel every week. ",
          "score": 1,
          "created_utc": "2026-02-11 08:48:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4su3c6",
          "author": "pmpdaddyio",
          "text": "This should be stock in most tools assuming you configure it properly. I always recommend you work with finance, and work on your integration method. Most organizations know how to break down the budget into various categories, this goes in your budget line, then you integrate data from your finance group and these go into your actuals.\n\nIn MS Project, SmartSheet, Jira, and many of the Gartner upper right tools, you have this built in, you may need to slightly adjust your reporting, but this isn't complicated.",
          "score": 1,
          "created_utc": "2026-02-11 14:05:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4zbkj8",
          "author": "Genomak-",
          "text": "Anything will do so long as estimates are close and work is accurately recorded. That’s always the hard part.",
          "score": 1,
          "created_utc": "2026-02-12 13:54:37",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r3eg3c",
      "title": "Looking for use cases for AI as project manager",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1r3eg3c/looking_for_use_cases_for_ai_as_project_manager/",
      "author": "One-Clue4444",
      "created_utc": "2026-02-13 03:30:58",
      "score": 36,
      "num_comments": 61,
      "upvote_ratio": 0.8,
      "text": "I am looking for ideas or use cases to implement AI - genAI or agentic or just automation using ms copilot/ GitHub copilot/ ChatGPT. \n\nCurrently, I actively use ms copilot to do ppt, documentation,MoM,  to find emails etc. ",
      "is_original_content": false,
      "link_flair_text": "General",
      "permalink": "https://reddit.com/r/projectmanagement/comments/1r3eg3c/looking_for_use_cases_for_ai_as_project_manager/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o541r6p",
          "author": "[deleted]",
          "text": "[deleted]",
          "score": 30,
          "created_utc": "2026-02-13 04:53:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o545blc",
              "author": "heebs387",
              "text": "Man, I need to get on this train.",
              "score": 3,
              "created_utc": "2026-02-13 05:19:31",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o543jwh",
              "author": "AOmnist",
              "text": "Awesome! Have you considered Claude Code vs Claude we \n(which I assume you are using for the Claude Projects)?",
              "score": 2,
              "created_utc": "2026-02-13 05:06:15",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o54dup2",
              "author": "tardiskey1021",
              "text": "How did you get it to link to your in confluence? Does your organization have Enterprise security in the way ?",
              "score": 2,
              "created_utc": "2026-02-13 06:28:26",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o56mu9r",
                  "author": "collije",
                  "text": "I would be very very wary of linking company NDA items as a direct connection to a 3rd party tool or service, like GenAI.",
                  "score": 1,
                  "created_utc": "2026-02-13 16:03:51",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o54nggu",
              "author": "clickographer_",
              "text": "Looks interesting, Can you please help me if I DM you?",
              "score": 1,
              "created_utc": "2026-02-13 07:53:52",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o54ngi5",
                  "author": "AutoModerator",
                  "text": "Hey there /u/clickographer_, why not join the public conversation? Signaling a DM publicly is redundant\".\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/projectmanagement) if you have any questions or concerns.*",
                  "score": -1,
                  "created_utc": "2026-02-13 07:53:52",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o556w79",
              "author": "BlazedAndConfused",
              "text": "How does it “updates JIRA”?",
              "score": 1,
              "created_utc": "2026-02-13 10:55:29",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o55ncbq",
                  "author": "Smooth-Trainer3940",
                  "text": "Was wondering the same",
                  "score": 1,
                  "created_utc": "2026-02-13 12:58:42",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o5699uo",
              "author": "dude1995aa",
              "text": "Funny your flow,  will be releasing a product soon with outlook add-ins that will automatically upload teams transcripts for rag access, will have Jira and Lucidchart functionality, access to all project documentation through rag, ai testing tool, plus generation of sap related objects.  Chat tool based on ChatGPT reading all that project documentation.  Will have some data cleansing tools and ai automated template fillers with this tool.  The world is changing fast my friends.",
              "score": 1,
              "created_utc": "2026-02-13 14:58:19",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o55hp54",
          "author": "surrealcrow",
          "text": "I use it to vibe code full project features, I show my team of senior developers that their estimates are too high, they love it",
          "score": 11,
          "created_utc": "2026-02-13 12:21:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o55i3bk",
              "author": "picobar",
              "text": "Curious, missing a /s perhaps?",
              "score": 4,
              "created_utc": "2026-02-13 12:24:06",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o55ugq5",
                  "author": "surrealcrow",
                  "text": "Hehe yeah",
                  "score": 6,
                  "created_utc": "2026-02-13 13:40:10",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o53zdgu",
          "author": "cyeph",
          "text": "Try mapping out the activities you perform as a PM currently and then look at which of those use cases can be streamlined using AI",
          "score": 11,
          "created_utc": "2026-02-13 04:36:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o54m4av",
              "author": "rnathani91",
              "text": "This. Also you wont be able to do the parts with Emotional Intelligent duties like motivation, momentum shifts based on non-data climates, or org changes before they become formalized. Simulations could be added in. Just not the execution.",
              "score": 2,
              "created_utc": "2026-02-13 07:41:32",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5657j2",
          "author": "Palegic516",
          "text": "I use it all the time to simulate executive questions and scrutiny and then help me come up with responses. I use it to draft emails a lot. read through contracts, and leases and pretty much any legal document and summarize, cite and evaluate risk. It’s great for calculating lots of numbers via screenshot or paste, if the documents aren’t in excel format. It can do some fairly complex math quickly to find where missing numbers are or errors in calculations. The list goes on",
          "score": 9,
          "created_utc": "2026-02-13 14:37:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o54p8q7",
          "author": "Eightstream",
          "text": "Make your emails even more empty and soulless",
          "score": 8,
          "created_utc": "2026-02-13 08:10:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o556kzr",
          "author": "CreativeAsFuuu",
          "text": "I use AI for reports but remain the primary decision maker for what goes in them.\n\n\nI start with two AI tools: an AI note taker (Otter, Copilot, Fireflies) and a GPT (like Claude, Chat, Perplexity); and a human-led tracker (ike Monday, Asana, or Jira).\n\n\nThe note taker transcribes and summarizes my meetings with my teams or stakeholders. I still manually take notes, but the AI captures more robust information since it can transcribe faster than I can type. I also cannot type and employ active listening at the same time; the note taker allows me to pay attention to what's being said so I can get a full understanding with context.\n\n\nThe GPT has a project folder and generic project knowledge instructions. In the knowledge base, I include all relevant project documents, like the scope of work, past reports, past work, and a report template.\n\n\nMy team gives detailed updates in their trackers: every stakeholder interaction, every project status change, every iteration of a project, tasks, points of contact, etc. You get the idea: if it can be defined, quantified, classified, or described, my team includes it as a variable or an update in the tracker.\n\n\nFor each report, I export all data from the tracker as Excel or .csv and upload it to my GPT. I prompt the GPT to create a report based on the template, and tell it to include all requirements for the report from the scope of work.\n\n\nI compare the output from the GPT to my tracker and note taker's notes. I, the human, manually add any risks, context, or notes I took from daily interactions. I remove hallucinations or anything stupid the GPT included. After some formatting and proofreading, I fire that puppy off to the project owner. \n\n\nCaveat: This application of AI is highly dependent on my teams putting detailed updates in their trackers; my having precise instructions in my prompts, clear project instructions, and the experience and emotional intelligence to identify threats, challenges, and risks that my team is too junior to identify as such.",
          "score": 8,
          "created_utc": "2026-02-13 10:52:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o56kzp2",
              "author": "collije",
              "text": "Another approach and tool for meeting transcribe and meeting notes: take voice recording (one with transcribe/export feature) and upload the transcription to your GenAI of choice (I use Gemini) to a draft of meeting minutes and tweak as needed (sometimes adding additional context in the AI chat, or simply making my remaining edits or rewrite directly)",
              "score": 2,
              "created_utc": "2026-02-13 15:55:08",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o56luz5",
                  "author": "CreativeAsFuuu",
                  "text": "Good idea! My note taker already does this! It records, transcribes, and summarizes into meeting minutes :)",
                  "score": 1,
                  "created_utc": "2026-02-13 15:59:13",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o58v43q",
          "author": "reallychilliguana",
          "text": "Why don't you ask the AI for ideas.",
          "score": 7,
          "created_utc": "2026-02-13 22:36:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o55rskl",
          "author": "dude1995aa",
          "text": "Throw away copilot-use Claude for office 365 type work.  I hand it a company deck and tell it the content I need.  It adds the slides, knows the color scheme and format, amazing job with graphics.  Won’t touch copilot.  GPT is a great tool with word…just not PowerPoint.  Was just handed a task of putting together a quarterly deck for the project that would have taken weeks before.  Now I’ll have a meeting with 3 or 4 key people, record it, submit all the transcripts, have Claude put it together.",
          "score": 5,
          "created_utc": "2026-02-13 13:25:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5625qd",
              "author": "obviouslybait",
              "text": "Claude does seem to really do well in the tooling category, the number of integrations and skills is truly impressive. GPT does well with reasoning and spitting out best practices and offering additional solutions, but misses on the productive output in my opinion.",
              "score": 1,
              "created_utc": "2026-02-13 14:21:47",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o56bxsb",
              "author": "ArpanMaster",
              "text": "Recently discovered that Claude is so much better than cgpt",
              "score": 1,
              "created_utc": "2026-02-13 15:11:24",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o57t58b",
              "author": "Seattlehepcat",
              "text": "Unfortunately in our org we're bought in 100% on MSFT, and our Copilot instance combs our internal resources so we're kind of stuck with it.",
              "score": 1,
              "created_utc": "2026-02-13 19:26:47",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o53w0t9",
          "author": "summetg",
          "text": "Meeting summaries are a given, finding project dependencies, pulling insights from your artifacts",
          "score": 5,
          "created_utc": "2026-02-13 04:12:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5801zd",
          "author": "pmpdaddyio",
          "text": "I use it for a few things. \n\nI have a script that matches my project status reports. I use RAG status indicators and I explain in my prompt how they are calculated. \n\nI add in an iterative Q&A as part of the prompt so it will ask clarifications as it processes. I run the prompt against my Trams transcripts. \n\nI save at the very minimum two hours a week on my big projects. \n\nI have another prompt that uses the same transcript and it builds my RAIDD log entries. \n\nWhen I hold the meeting I use purposeful comments like “add a risk to the RAID for the following assignment Peter, due date June\n\nI also ask it to update the log and use the same cadence. Being intent full and not just jabbering in the meetings helps. \n\nI also use it to determine tone and feedback of meetings which I rate. We have tons of high stress projects and I use it to coach me on topics to pay closer attention to and be more delicate with. \n\nI do a Teams and outlook assessment weekly that uses my categories to help me look at my meeting schedule and provide feedback to my staff. \n\nI also compile standup meeting notes into my leadership meetings. Saves a ton of time.",
          "score": 5,
          "created_utc": "2026-02-13 20:00:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o53xhda",
          "author": "marizul24",
          "text": "Recently started using Claude code + jira MCP. I can pull down sprint insights instantly, send it all to confluence. Bulk create tickets directly from my terminal, all using natural language. It’s been awesome, huge time saver.",
          "score": 7,
          "created_utc": "2026-02-13 04:22:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o542mds",
              "author": "Spare-Day-4007",
              "text": "This is the play here. \n\nCreating tickets, create a markdown file for it to read that is acting like you and have it use a template to answer questions for what you want in tickets",
              "score": 1,
              "created_utc": "2026-02-13 04:59:24",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o54gwkm",
                  "author": "Gandzilla",
                  "text": "Any ressources or how-to's to share on how to do this?",
                  "score": 2,
                  "created_utc": "2026-02-13 06:54:43",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o54dm0t",
          "author": "PlasProb",
          "text": "Manage notes, todos and day schedule. I use Saner AI every day to prioritize my schedule and get reminded on tasks I may forget",
          "score": 3,
          "created_utc": "2026-02-13 06:26:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o55qbj4",
          "author": "the__accidentist",
          "text": "Use Gamma for your PPTs. \n\nSet up an N8N feeding data from your project plan, schedule, ooo team time, milestone related calls in the schedule, etc. \n\nHave Gamma made an update deck every week",
          "score": 4,
          "created_utc": "2026-02-13 13:16:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o56c22z",
          "author": "ArpanMaster",
          "text": "Good question to post. Lots of handy tips in the comments.\nThanks",
          "score": 5,
          "created_utc": "2026-02-13 15:12:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o53tpim",
          "author": "WololoWanderer",
          "text": "I am trying to figure out the same, so confused which tools to start with",
          "score": 3,
          "created_utc": "2026-02-13 03:56:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o56qety",
          "author": "agile_pm",
          "text": "My team uses it to help with coding, peer review, and QA testing.  I use it to help stakeholders with identifying user stories, use cases, risks and mitigations, and strategic considerations, among other things.  The thing to watch out for is stakeholders rubber stamping AI-generated documentation they're supposed to be preparing.  AI is supposed to be a time-saver, not a decision-maker.",
          "score": 3,
          "created_utc": "2026-02-13 16:20:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o55knsu",
          "author": "Sophie_Doodie",
          "text": "If you’re already using it for decks and MoMs, next level is using it to think for you, not just write for you. I use it to draft risk logs from messy notes, turn status updates into exec summaries, simulate stakeholder objections before big meetings, break vague goals into task lists with dependencies, and sanity check timelines (“what’s likely to slip here?”). You can also feed it past project data and ask for pattern analysis, where delays usually happen, which tasks create bottlenecks, etc. The real win isn’t prettier docs, it’s faster clarity and better decisions.",
          "score": 8,
          "created_utc": "2026-02-13 12:41:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o56jzqi",
              "author": "collije",
              "text": "That's the real use case. It's like peer review from a fellow sr PM, Program Manager, or PMO chief",
              "score": 2,
              "created_utc": "2026-02-13 15:50:24",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o53rrbd",
          "author": "bluealien78",
          "text": "I have dozens of agents deployed doing many “PMO”-centric repeatable work. Charter authoring, initial WBS building, deck building, Slack autoresponders, incoming request routing, status reports. The humans in the loop are the last 10% now. It’s awesome. Our throughput is way higher than it was a couple of years ago.",
          "score": 4,
          "created_utc": "2026-02-13 03:43:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o545qer",
              "author": "Available-Budget-735",
              "text": "What does the slack autoresponder do? Have you had any issues arise due to the agents being wrong?",
              "score": 2,
              "created_utc": "2026-02-13 05:22:40",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o53sfmi",
              "author": "Daisy_InAJar",
              "text": "Do you use agents all from one core tool or many different ones? I’d love to hear more about request routing and status reporting.",
              "score": 1,
              "created_utc": "2026-02-13 03:48:25",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o53u1mq",
                  "author": "bluealien78",
                  "text": "Glean, Cursor, Gemini, and an in-house LLM are all used.",
                  "score": 0,
                  "created_utc": "2026-02-13 03:59:13",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o54syuv",
              "author": "speedypuma",
              "text": "Any examples of prompts you use? Company just rolled out Gemini and wondering if I can set up custom Gems to do similar",
              "score": 1,
              "created_utc": "2026-02-13 08:45:16",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o53vzx2",
          "author": "Trickycoolj",
          "text": "I use our command line AI to connect to our Jira and confluence instances (locally hosted not the cloud based versions). It’s killer to have open during meetings when someone says “when was X ticket completed?” Or “we need to do Y” and I can search “what ticket completed Y task worked by ABC engineer” and boom link to the ticket “we completed that work back in November and it was deployed right away”",
          "score": 2,
          "created_utc": "2026-02-13 04:12:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o55k123",
          "author": "ConstructionNo1511",
          "text": "I used copilot to generate python code for a macro that reformatted, removed columns, and renamed a monthly distribution of 40 files.",
          "score": 2,
          "created_utc": "2026-02-13 12:37:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o564vlt",
          "author": "Ok_Jello9448",
          "text": "Hey, did the use of co pilot or Claude fundamentally change how you do things? I get that emails are written faster or slide decks are made faster, but did anything change wrt what you essentially do as a project manager i.e hearding a group of people, and make them work towards 1 single goal. Of course besides all the jazz of scope, timelines, cost, reporting etc.  \n\nGenuinely curious.",
          "score": 2,
          "created_utc": "2026-02-13 14:36:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o555ifh",
          "author": "Mammoth_Ad3712",
          "text": "You’re already using it the way most PMs start: notes, decks, and email cleanup. That’s solid.\n\nWhere I’ve seen it go from “nice to have” to actually useful:\n\n• Turning messy meeting notes into structured action logs with owners and due dates  \n• Scanning long email threads and extracting risks, blockers, and decisions  \n• Drafting stakeholder updates based on raw status inputs  \n• Comparing scope changes against original requirements to highlight deltas  \n• Reviewing schedules for obvious dependency gaps or overallocations\n\nIf you want to go deeper, start experimenting with lightweight “agents” that:  \n– Pull task data from your PM tool  \n– Flag overdue or at-risk items  \n– Draft a weekly summary automatically\n\nJust be careful with data privacy and hallucinations. Always review before sending anything external.",
          "score": 2,
          "created_utc": "2026-02-13 10:43:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o55n9v1",
              "author": "Smooth-Trainer3940",
              "text": "I like using it for the first thing you mentioned. I am a messy note-taker so I like that it can rewrite to format it for me. I think the use case of 'take this unstructured thing and make it structured' is a good use case. For the last few things you mentioned, I would be interested to see how AI could handle that. They seem more like workflow automation / data transfer use cases, which I haven't seen many AI tools do (or do well). I use Text Blaze for those kinds of things right now and I'm happy with it. Also agree to be careful with hallucinations. I have pretty detailed prompts that mention preserving my original ideas/meaning, etc.",
              "score": 1,
              "created_utc": "2026-02-13 12:58:17",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o55l6gi",
          "author": "TheRoseMerlot",
          "text": "Why not, not?",
          "score": 2,
          "created_utc": "2026-02-13 12:44:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o54pu2x",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-13 08:15:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o556krd",
              "author": "projectmanagement-ModTeam",
              "text": "Thanks for your post/comment.  \n\nWe removed this post because it's in direct violation of our \"solicitation / self-promotion” rule.  \n\nPlease review these rules, which can be found in the sidebar.\n\nThanks,\nMod Team",
              "score": 1,
              "created_utc": "2026-02-13 10:52:42",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o55jjnq",
          "author": "jche2",
          "text": "GitHub action to automate code review QA via copilot and block build if it doesn’t have green light via custom prompt with your org specific standards",
          "score": 1,
          "created_utc": "2026-02-13 12:34:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o53qt9m",
          "author": "Robenever",
          "text": "Recently got approach by a top MBA school about one of their executive programs that was basically selling this exact thing as a course. AI use cases are pretty new and there’s a high demand for this knowledge as far as I can tell.",
          "score": 1,
          "created_utc": "2026-02-13 03:37:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o56ky1k",
          "author": "essmithsd",
          "text": "This question is asked weekly, use the search bar ffs",
          "score": -3,
          "created_utc": "2026-02-13 15:54:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o542pb7",
          "author": "Aggressive-Low3956",
          "text": "Project managers can use AI to gauge project data, assess team performance, automate scheduling, forecast hazards, and produce real-time insights. ",
          "score": 0,
          "created_utc": "2026-02-13 05:00:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o54hvjq",
          "author": "WoodpeckerNo5214",
          "text": "Beyond docs and decks, AI is great for risk prediction, sprint planning, dependency mapping, and auto-generating stakeholder updates from project data. You can also use it to simulate scenarios, draft mitigation plans, and spot scope creep early.",
          "score": 0,
          "created_utc": "2026-02-13 07:03:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o553qh9",
          "author": "adelarenal",
          "text": "I use Claude Code + VSC for all my PM. I am not coding.",
          "score": 0,
          "created_utc": "2026-02-13 10:27:12",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r0jnw3",
      "title": "Client who cancels a lot, but within the required window—how do I let them know it's disruptive without being too pushy?",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1r0jnw3/client_who_cancels_a_lot_but_within_the_required/",
      "author": "Longjumping-Wafer102",
      "created_utc": "2026-02-09 23:02:14",
      "score": 34,
      "num_comments": 19,
      "upvote_ratio": 0.9,
      "text": "I work in a client-facing service role with booked sessions\n\n\n\nI have a slightly limited schedule (baby) with 5 slots a day, 4 days a week. I don't like to take on too many clients if I can't service them as needed.\n\n\n\nI have a client who frequently cancels and I think they think it's fine because they do let me know before the 24-hour late cancel fee kicks in. They've rescheduled at least 50% of our scheduled meetings due to work and social obligations.\n\n\n\nMy question is: how can I word this via email or in person so that they don't feel bad or embarrassed, but that they understand that despite being in \"compliance\" of my policy, the amount they cancel is a huge disruption to my schedule?\n\n\n\nHere's my issue: I'm not great at putting pressure on clients. I tend to be emotionally soft and struggle with confrontation. I don't want to come across as demanding, but I also can't keep accommodating this constant rescheduling. How do I communicate this professionally without getting emotional or backing down?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/projectmanagement/comments/1r0jnw3/client_who_cancels_a_lot_but_within_the_required/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o4itzsn",
          "author": "MattyFettuccine",
          "text": "When they cancel, you ask them to rebook quickly as this will affect their project schedule.\n\nOr you update your policy for a longer cancellation notice.",
          "score": 31,
          "created_utc": "2026-02-09 23:35:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4l5rig",
          "author": "EconomistFar666",
          "text": "I’d frame it as an impact conversation, not a policy one. Something like “I want to make sure we’re getting the most value out of our time together. When sessions are frequently rescheduled, it’s hard for me to hold space for you and other clients since my schedule is pretty fixed. If weekly timing is tricky right now, we can look at less frequent bookings or a different cadence that’s easier to keep”.",
          "score": 19,
          "created_utc": "2026-02-10 09:27:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4n2m1s",
              "author": "A-n-o-v-a",
              "text": "This! And also, confront any situation that you are not comfortable with, because at the end of the day, it's your time. Don't let it get wasted.",
              "score": 5,
              "created_utc": "2026-02-10 16:41:12",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4it0un",
          "author": "JohnnyWeapon",
          "text": "I’d put it on my RAID and call it out through that avenue. It’s a good talking point and relevant to the project as a risk to the timeline. \n\nThey should have a vested interest in keeping the project on track. \n\nI’ve been a client-facing PM and my style is more empathetic and collaborative (sounds like you) and while I’m not shy to be confrontational, I’ve always found that keeping things in the context of the project helps a TON.",
          "score": 13,
          "created_utc": "2026-02-09 23:30:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4kyp4s",
          "author": "dhemantech",
          "text": "I did trainings a decade back and faced the exact same problem. To all communication I just added a simple caveat- first cancellation is free, post that booking would need advance payment. Second cancel meant a 50% fee. Third cancellation onwards there would be no refunds. It impacted the bookings in that many customers feel it’s acceptable to book as long as they don’t have to pay upfront because they can always cancel. My priority was certainty for my time.",
          "score": 11,
          "created_utc": "2026-02-10 08:17:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4qb2q7",
              "author": "Glass-Ad-2731",
              "text": "This is excellent. As someone who relates to OP, thank you for this advice!",
              "score": 2,
              "created_utc": "2026-02-11 02:27:03",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4io3sr",
          "author": "Rude_Taro_9572",
          "text": "I'm generally pretty direct. Try having a conversation along the lines of: \"I've noticed you're frequently cancelling/rescheduling our appointments and I was wondering if we could work together to figure out a different day/time that would work better for your schedule?\"\n\n\n\nDon't be afraid to communicate directly with the client—it's the most efficient approach. If you struggle with emotional control during these conversations, use negotiation sims like chαtvisor, or have a colleague role-play as the client. Practice the conversation multiple times until you can stay calm and composed throughout. Then you'll be ready to address it professionally.",
          "score": 10,
          "created_utc": "2026-02-09 23:03:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4iv1lg",
              "author": "InfluenceTrue4121",
              "text": "I agree wholeheartedly. This is the best approach from a client management perspective.",
              "score": 3,
              "created_utc": "2026-02-09 23:41:37",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4oyt8g",
          "author": "Additional_Owl_6332",
          "text": "not everyone is a customer and if you can't make a profit then they aren't your customer and just walk away, \n\n",
          "score": 8,
          "created_utc": "2026-02-10 21:56:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4p1cvs",
          "author": "More_Law6245",
          "text": "There are two aspects to or post, firstly if the client keeps on cancelling then have them rebook immediately because their next engagement may not meet their expectations. Place the ounce and responsibility on the client, the client isn't always right nor should they have the expectation for you to bend over backwards every time to accommodate them. You're a service and not a door mat because at the end of the day it's costing you as a business not them. \n\nSecondly you have acknowledged your position in relation to your behaviour about confrontation, what are you doing to address your behaviour? In reality when running a business you need to be able to be firm with your client, negotiation is a two way street and not you just saying \"yes\" because it creates more problems than it should (this is a confidence and professional maturity thing), as you also have needs that must be met as well. By the very definition of them using your services means there is a professional relationship, hence you should also have expectations of your clients as well. \n\nI would also suggest really consider the terms and conditions of service within your contract and address your cancellation policy, being a smaller business there is no reason on why you can't push the cancellation time and the use of cancellation fees.  The key thing to remember is that you need to remain profitable in order to viable as a business. \n\nI would also suggest seeking out a small business mentor as well, there are many forums available that you could possibly leverage to help you grow professionally. Just a reflection point for your consideration. \n\nJust an armchair perspective. ",
          "score": 9,
          "created_utc": "2026-02-10 22:08:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ip9te",
          "author": "bstrauss3",
          "text": "I realize scheduling can be difficult, but I work a limited schedule and cancelations -- even though within policy -- have a large impact on me. Please work with the front desk to schedule with another therapist.\n\nThen next time(s) you see them on your schedule, you cancel them as far ahead as possible. \n\nYou are only a doormat if you let yourself be one.",
          "score": 12,
          "created_utc": "2026-02-09 23:09:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4is8cx",
              "author": "RhesusFactor",
              "text": "Lol therapist.\nSeems like your instance of Copilot/GPT you have been using for therapy has bled into your other requests to answer reddit questions.",
              "score": 4,
              "created_utc": "2026-02-09 23:26:05",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4ivfcl",
                  "author": "moochao",
                  "text": "thatsthejoke.jpg",
                  "score": 1,
                  "created_utc": "2026-02-09 23:43:45",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4kliqd",
          "author": "hotheadnchickn",
          "text": "You could say you notice them cancelling a lot and ask them if there’s a different time that works better for their schedule. \n\nWhen it comes down to it, they are behaving in a way that respects your policy. If it doesn’t work, it sounds like you may need to change your policy.",
          "score": 4,
          "created_utc": "2026-02-10 06:17:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4kxd5c",
          "author": "BedRoomSenses",
          "text": "This might not directly apple but my work is client based. A lot of them are on a recurring schedule (once a week) and the soft policy is no more than 3 client cancelations in a row. After that we review together to see why there are so many cancelations. It doesn’t make sense for me to hold that spot for them and it doesn’t make sense for them to be charged for sessions they’ll just cancel.",
          "score": 3,
          "created_utc": "2026-02-10 08:05:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4kcdkk",
          "author": "Fantastic-Nerve7068",
          "text": "totally feel you on this one especially with a tight schedule and a baby in the mix the best approach i’ve found is framing it around predictability and availability not blame something like\n\n“hey i totally understand life gets busy and i appreciate the heads up when you need to reschedule that said just wanted to flag that the frequency of changes makes it harder for me to manage my availability and support all my clients effectively if it continues at this pace i might have to relook at how we schedule or whether a recurring slot still works for us”\n\nit’s kind honest and puts the impact on your side not making them feel attacked plus it gives you a boundary without sounding rigid",
          "score": 3,
          "created_utc": "2026-02-10 05:05:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4klrez",
          "author": "ZiKyooc",
          "text": "That problem should be solved by itself. Stick to your schedule and offer client alternative existing open slots. If you have room and the client is ok with late minutes available open slots then what is the issue? If the client is unhappy that the late minute change of plans leads to a few days delay, then you explain. If you are willing to make some adjustments to your schedule to accommodate, you can consider, if this interests you, to offer some late minute time slots that impact on your personal schedule with a 50% (or whatever) additional cost.",
          "score": 3,
          "created_utc": "2026-02-10 06:19:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4int9m",
          "author": "AutoModerator",
          "text": "Hey there /u/Longjumping-Wafer102, Have you looked at our \"Top 100 books post\"? Find it [here](https://www.reddit.com/r/projectmanagement/wiki/index/books).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/projectmanagement) if you have any questions or concerns.*",
          "score": 0,
          "created_utc": "2026-02-09 23:02:14",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r1zc7c",
      "title": "(User based Recommendation) Apps that I’m using in 2026",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1r1zc7c/user_based_recommendation_apps_that_im_using_in/",
      "author": "anonymous5090",
      "created_utc": "2026-02-11 14:48:52",
      "score": 27,
      "num_comments": 13,
      "upvote_ratio": 0.91,
      "text": "New year so figured I'd share the tools that actually stuck around after trying way too much stuff last year. These are the ones I genuinely use not just installed once and forgot about.\n\n* Claude directly in the app for quick scripts. Faster than spinning up a project for something I'll run once.\n* n8n for automations. I know a majority of you have used this. Self hosted it and forgot about it which is exactly what I want.\n* Thinklistapp with their AI features for docs. Not groundbreaking but having everything in one place matters. Helps alot when it comes to executing tasks daily. Although it's a paid app, and I could potentially do the same thing with ChatGPT.\n* Langsmith for tracing LLM calls. Saved me so many times when something breaks and I need to see what happened. \n\nWhat tools survived your 2025 culling? ",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/projectmanagement/comments/1r1zc7c/user_based_recommendation_apps_that_im_using_in/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o4t29qr",
          "author": "AutoModerator",
          "text": "Attention everyone, just because this is a post about software or tools, does not mean that you can violate the sub's 'no self-promotion, no advertising, or no soliciting' rule.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/projectmanagement) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-11 14:48:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ujrzt",
          "author": "Available-Budget-735",
          "text": "This is all for project management?",
          "score": 5,
          "created_utc": "2026-02-11 19:01:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4thn4o",
          "author": "Consistent_Voice_732",
          "text": "Langsmith-style LLM tracing is a game changer-wish I used it sooner  ",
          "score": 2,
          "created_utc": "2026-02-11 16:03:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4tt0qo",
          "author": "Comfortable-Garage77",
          "text": "Gpt for the win, but now gradually switching to gemini. Also use grammarly extensively for my writing and saner to manage my tasks via chat. But that's all, all roads lead to Google sheet finally lol",
          "score": 1,
          "created_utc": "2026-02-11 16:56:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o51nxqo",
          "author": "More_Law6245",
          "text": "OP I have a question, so what skills are you learning in the advent you suddenly don't have systems at your disposal? \n\nAs a program director I'm starting to witness PM's skills coming up short because they have become too reliant on systems or tools, they come unstuck because they have either forgotten or they didn't learn underlying project management principles",
          "score": 1,
          "created_utc": "2026-02-12 20:40:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o522dag",
          "author": "erilysse",
          "text": "Notion for managing my todolist, projects and OKRs.\n\n\nI'm currently trying to make some task easier so using Claude Code and n8n yes. (For data analysis, and automatic reminders for people so i don't have to remind each month everyone what's they're accountable for). \n\n\nI could not use it but I try to understand the cases where it could be useful and where It's not. Like being less in AI FOMO and more in.. knowing what' it's actually capable?\n\n\nM365 is always there lurking in the shadows for some easy collaborative work (I'm in a tech-adverse company).",
          "score": 1,
          "created_utc": "2026-02-12 21:48:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o544da6",
          "author": "Fantastic-Nerve7068",
          "text": "Celoxis is the one platform that’s still holding strong in my stack. It’s not flashy but ridiculously reliable for cross team project visibility, resource capacity planning and actual delivery tracking without me babysitting everything. Bonus points for the built in timesheets and reporting I don’t have to manually build every week.\n\nAlso still using Notion for internal docs and meeting notes (paired with an AI summary agent now), Slack for team comms, and Raycast for speeding up damn near everything on the Mac.\n\nChopped a lot of “productivity” stuff last year that turned out to be more aesthetic than useful. What stayed either automates something painful or keeps my team moving without me needing to micromanage it.",
          "score": 1,
          "created_utc": "2026-02-13 05:12:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4t46k8",
          "author": "subtlesub29",
          "text": "🤮🤮🤮🤮🤮",
          "score": -2,
          "created_utc": "2026-02-11 14:58:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4t5oiy",
              "author": "Suspicious-Camera489",
              "text": "Do you think you can manage to elaborate your comment a bit more?",
              "score": 2,
              "created_utc": "2026-02-11 15:06:18",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4wywiq",
                  "author": "karlitooo",
                  "text": "Because it’s spam: https://www.google.com/search?q=thinklistapp+%22anonymous5090%22+site:www.reddit.com&sca_esv=04aa8d85dd72ea04&rlz=1CDGOYI_enGB771GB771&hl=en-GB&prmd=ivsn&sxsrf=ANbL-n7kSso3x1jOorfybwPcyBUnWevYPg:1770864084554&sa=X&ved=2ahUKEwiG_9Hl9tKSAxXgumMGHZQ6IwMQrQJ6BAggEAY&biw=375&bih=634&dpr=3",
                  "score": 1,
                  "created_utc": "2026-02-12 02:42:13",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4u49it",
          "author": "Smooth-Trainer3940",
          "text": "Never heard of Thinklistapp, seems cool. I might check it out. I use Text Blaze instead of n8n and it works well enough for me. Thanks for sharing!",
          "score": 0,
          "created_utc": "2026-02-11 17:49:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4u3k15",
          "author": "Papyrusblack",
          "text": "ChatGPT for content strategy \nOboard OKR software for goal tracking\nBase44 for spinning up apps to solve my unique problems\nGoogle Docs for everything note taking",
          "score": -1,
          "created_utc": "2026-02-11 17:46:11",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r0h4pe",
      "title": "If I’ve flagged something everyday for 3 months. Is this a leadership issue?",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1r0h4pe/if_ive_flagged_something_everyday_for_3_months_is/",
      "author": "the-anonymous-ghost",
      "created_utc": "2026-02-09 21:27:00",
      "score": 25,
      "num_comments": 13,
      "upvote_ratio": 0.91,
      "text": "Basically this, If we are delayed and I’ve continuously flagged something everyday day for 3 months as it relates to our Tech projects. I’ve reached out to management almost every week about it. I’ve reached out to the specific person that hasn’t been doing their job.\n\nI’ve went on calls. I’ve tried to make things easier to transfer data. Made various docs. And to no avail we are 1 day before we make updates to which we will have to push.\n\nAm I to blame or does our company need to work on situations like this. If we don’t update it’s not my fault and its not on me to know specialized info that my peer knows and evaluates for.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/projectmanagement/comments/1r0h4pe/if_ive_flagged_something_everyday_for_3_months_is/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o4iaa12",
          "author": "pmpdaddyio",
          "text": "You've over documented the issue. Let the individual fail, and subsequently the project if that is an outcome. You are covered by your notifications and documentation. Hopefully you logged this as a risk, then an issue with the assignments.",
          "score": 21,
          "created_utc": "2026-02-09 21:52:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ib2e4",
              "author": "InfluenceTrue4121",
              "text": "Spot on. It’s so easy to ignore endless emails but way more tricky to ignore a big, fat risk with your name all over it.",
              "score": 9,
              "created_utc": "2026-02-09 21:56:44",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4i69ej",
          "author": "wittgensteins-boat",
          "text": "Leadership does not care to act. \n\n\nFor apparently undisclosed and undiscussed, and undiscussible  reasons.  \n\n\nYou have made your report.  \n\n\nIf the blame game is played, you have the documentation trail and notified warning about  failure to act indicated.  \n\n\nIs there a report about consequences to failing to act?  What also will occur, at what cost, and project completion time period delay, and follow-on target deadlines, and reputational loss, for failure to comply with the plan?\n\n\nYou could, if you so desire, discuss in person with senior people to understand why there is no intent to act.  Start with Senior people nearest to you on the project  organization chart.\n\n\nUnclear if your job is at risk for raising undiscussible plans for failure according to the current plan.",
          "score": 10,
          "created_utc": "2026-02-09 21:32:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4kcmkg",
          "author": "Fantastic-Nerve7068",
          "text": "not your fault at all you did the right thing by flagging the risk early and consistently if leadership didn’t act on it for three months that’s not a comms issue that’s a prioritization and accountability issue on their side at some point it’s not about how loud or often you raise the flag it’s about whether the system is set up to respond and clearly it’s not this is absolutely a leadership gap not a delivery one",
          "score": 9,
          "created_utc": "2026-02-10 05:07:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4j40na",
          "author": "More_Law6245",
          "text": "Throwing your hands up and saying \"it's not my fault\" is not a professional look you want, especially when you're left holding the bag (rightly or wrongly). It's why you have your project controls for your issues and risk log and it actually assists you in matters like this. You should be formally presenting these issues and risks to your project board/sponsor/executive and clearly articulate with a problem statement and the impact. In addition you should have ready a proposed plan or mitigation strategy to support the problem statement. Then you need to articulate what you're expecting from the relevant stakeholders (e.g. a decision on course of action or additional time, cost or scope etc.) and highlighted the impact if they fail to support you. This is about your maturity as a project practitioner, this is actually your responsibility being the PM to the project, this is also about you understanding roles and responsibilities within a project structure.  \n\nIF and only if your project board/sponsor/executive fails to address any of your issues or perceived risks then it becomes their problem under roles and responsibilities because you have covered your professional standing with documented evidence that can't be disputed and if any issue or risks that come to fruition that is at the organisation's peril. As the PM you can only highlight the risk and issues, you have formally asked for assistance and guidance through the project controls and if the appropriate stakeholders fail to act it's on them and not you. \n\nYour statement of \"you tried\" but the reality is that you haven't formally enacted your project controls and the associated reporting mechanisms, do you have written problem statement (issue, risk or white paper etc.)? Do you have a proposed course of action? Do you have a responsible person (s) or team who understands that they own the issue or risk? Do you have an agreed due date or a mitigation strategy initiation date? These are all the things you get when you formally escalate through your project controls, speaking up in forums and making various documents doesn't constitute to holding people to account! \n\nJust an armchair perspective. ",
          "score": 20,
          "created_utc": "2026-02-10 00:31:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4kz734",
              "author": "Chicken_Savings",
              "text": "I think you are spot on.\n\nSometimes as PM, we can see that it's going to crash, and with our subject matter understanding / expertise, we try to work with the team member to fix it, and we keep telling our leadership informally that it's a risk that's building towards a crash. May even write that in emails.\n\nBut we may be so focused on trying to do something that we fail to execute the formal project controls.\n\nIt shouldn't be told to management every day. It should formally be escalated to project sponsor and / or steerco, with formal project status report, risk description, suggestions for actions, request for a decision.\n\nI have once failed myself by doing exactly this - telling management several times a week, trying to help fixing it myself, watching the train drive towards the crash... and crash. That was a major lesson learned for me, and I now activate the formal controls instead of endless informal emails and calls.",
              "score": 3,
              "created_utc": "2026-02-10 08:22:46",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4o9tpo",
                  "author": "More_Law6245",
                  "text": "A good PM only needs to experience this type of situation once, I'm also a member of this club and we even have T-shirts too.  To be honest it was one of my more harsh lessons when I was first starting out, the concept of roles and responsibilities hadn't really sunk in and I was trying to \"fix everything\" and taking on other's responsibilities. ",
                  "score": 3,
                  "created_utc": "2026-02-10 19:59:51",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o4lyifd",
              "author": "maninkka4",
              "text": "This helps,  thank you. I am no PM but actually trying to do the work of one in a subjectively rather informal setting, but this is sth I should do anyway - going to \"proper channels\" even though no one would blame me for the outcome.. I want it to succeed. \n\n\nArmchair perspective eh? Seems like you know what you are taking about to me :)",
              "score": 3,
              "created_utc": "2026-02-10 13:17:58",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4ocga5",
                  "author": "More_Law6245",
                  "text": "You have a great professional attitude and maybe you should actually consider formalise your standing as an accredited PM, it's definitely a very portable skillset and makes you a little more attractive to a potential employer.  Just as a reflection point, being in your situation it does become really important to understand roles and responsibilities (particularly the latter) when you're not formally assigned as a \"project manager\" because what you're actually doing is being \"trusted to take on responsibilities\" but not having a professional standing or acknowledgment of your role, it does leave you a little exposed (good and bad).  Just something for you to consider.  \n\n  \nhuh, me know what I'm talking about .... I'm pretty sure I read this stuff on the back of a toilet stall door somewhere ;)\n\n\n\n ",
                  "score": 2,
                  "created_utc": "2026-02-10 20:12:11",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4ihswh",
          "author": "DrStarBeast",
          "text": "You've done everything you're able to do. Keep your CYA paper trail close and if anyone tries to pin this on you, point to the issues that you raised and kept going on as the reason it failed. \n\n\nDo not apologize or accept blame for this. Be ready to step up when someone tries to blame it on you. ",
          "score": 9,
          "created_utc": "2026-02-09 22:31:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4i8d1k",
          "author": "DesertMountainLvn",
          "text": "Do you have leadership within PMO that is positioned to raise the risk to execute leadership? That would be my move. If executive leadership is aware and has not engaged, then you've done all you can. Wash your hands and move on. \n\nWhen I worked in a position where there was not a PMO and I needed a VP to encourage work I was unable to influence, I reached out to the project sponsor and encouraged them to engage their VP. That VP called the VP for the party responsible for the work (happened to also be my VP) and explained the risk (loss in the millions for the org). Blocker was removed immediately. It was much more effective than if I were to have made the call myself.",
          "score": 5,
          "created_utc": "2026-02-09 21:43:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4inkd8",
          "author": "Longjumping-Wafer102",
          "text": "you already do all your best",
          "score": 5,
          "created_utc": "2026-02-09 23:00:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ikplp",
          "author": "Stebben84",
          "text": "If it was a risk, was a mitigation plan put in place. If so, how will that be executed. If that did not work, it becomes an issue to log and document how that will addressed. That all you can do. This is your work and hence not your fault. If it fails it fails. Success relies on the team and not solely on the PM.",
          "score": 1,
          "created_utc": "2026-02-09 22:46:05",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r06sqy",
      "title": "Selling team members on the benefits of a project plan",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1r06sqy/selling_team_members_on_the_benefits_of_a_project/",
      "author": "BreakNo7825",
      "created_utc": "2026-02-09 15:14:42",
      "score": 19,
      "num_comments": 25,
      "upvote_ratio": 1.0,
      "text": "Looking for any lessons learned or recommendations on getting team members on board with the idea of developing project management plans for our projects.\n\nI work for an organization that has historically performed very little planning prior to jumping into execution and the project managers have typically held a more reactive approach to issues in the projects. I’ve sold the idea of implementing formal PMPs with functional managers but at the end of the day, it’s the project team members, invluding our PMs, who need to adopt the idea wholeheartedly for it to be useful and successful. Has anyone else led such an adoption?\n\nIndustry is custom equipment design and manufacturing and lends itself to a waterfall approach. ",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/projectmanagement/comments/1r06sqy/selling_team_members_on_the_benefits_of_a_project/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o4gu07t",
          "author": "AldronProjectLab",
          "text": "I've been there. The key point is this: no one is convinced by a \"well-done PMP,\" but only by the pain it avoids. You have to create value.\n\nIn environments accustomed to starting immediately, the plan is perceived as unnecessary bureaucracy until you explicitly connect it to real problems already experienced: rework, late changes, stalled suppliers, decisions made too late, unclear responsibilities. The plan must serve to protect the team.\nIt works much better to start light: a few clear elements (scope, milestones, dependencies, obvious risks), built together with the team and not \"delivered.\" If the plan is conceived as something that helps us work better tomorrow, it is used and can evolve. If it is conceived as a document \"to keep things in order,\" it is circumvented.\n\nLast thing: don't call it a \"PMP.\" Call it a way of working, an initial agreement, a project map. Change the name, change the perception 😉",
          "score": 10,
          "created_utc": "2026-02-09 17:38:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4g1ph4",
          "author": "DrStarBeast",
          "text": "It's easy when you don't try and force the entire PMI tool kit down a small company's throat. \n\n\nInstead, sell a \"right sized \" process that adds necessary checks and balances while maintaining the agility your company expects.\n\n\n Only you know what this is from the issues you faced previously ",
          "score": 6,
          "created_utc": "2026-02-09 15:23:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4g4o7t",
              "author": "BreakNo7825",
              "text": "That is a valid point and I completely agree. I’m definitely encouraging our group to scale it to the size and importance of the project.",
              "score": 3,
              "created_utc": "2026-02-09 15:38:12",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4g670y",
          "author": "cbelt3",
          "text": "Someone IS doing project planning. They just call it production planning. Unfortunately you need to get senior management to own it.\n\nHaving been on that space, I will advise this:\n\nDo NOT use the whole model for every project. Multi year large projects need more control. Short one month projects … you can manage with a checklist. \n\nToo many people insist on applying the whole toolset to all projects. That’s not what PM Is about. It’s not a bureaucratic control system. It’s a framework that is sized to fit what word right.\n\nI once got called into a division to recommend a PM approach for their projects. I listened. Went to an office supply store. Came back with a package of index cards and a card box. Because that’s all they needed.",
          "score": 5,
          "created_utc": "2026-02-09 15:45:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4hx9v5",
          "author": "More_Law6245",
          "text": "This is not a \"team issue\" this is an organisational culture issue and realistically needs to be support from the executive down with the relevant support from change champions and agents. Most people don't see the relevance with corporate governance and generally perceive it to be an overhead in their daily working lives but the simple matter of the fact is that it's a cost effective measure, it helps delivery quality and ensure the company remains profitable and keeping these very people who are change resistant employed but most of all it assists with organisational reputation which even some PM's don't actually realise the importance of when delivering a project.  When you have a project that runs over time, budget or is not delivered cleanly, that is the impression your client gets and that is the image that is being projected by the organisation, unplanned projects is a bad image for the organisation, planning projects shows a professional organisation.  The key thing to remember your organisation is only as good as its last project!\n\nJust an armchair perspective.",
          "score": 4,
          "created_utc": "2026-02-09 20:48:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4kcqk7",
          "author": "Fantastic-Nerve7068",
          "text": "it’s tough shifting a reactive culture into one that values upfront planning especially when people see plans as “extra work” or “slowing things down” the thing that helped most was framing the plan not as a doc but as a painkiller literally say something like look this is how we stop chasing our tails in month three or how we avoid those last-minute redesigns that wreck our margins when people see it as a shield not paperwork they lean in also get quick wins like a short risk section that actually helped dodge a delay once and suddenly folks start asking “is that in the plan” instead of rolling their eyes just gotta show that it reduces their headaches not adds to them",
          "score": 3,
          "created_utc": "2026-02-10 05:08:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4hvkp0",
          "author": "Revolutionary-Can680",
          "text": "Gotta test it. The proof will be in the data. Pick 1-2 projects and provide a PP for those. Monitor hours/budget, timeline adjustments and general team sentiment. Do a retrospective for those projects and find out what needs to be tweaked. Present to stakeholders for buy in if data is positive.",
          "score": 3,
          "created_utc": "2026-02-09 20:39:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4le6ls",
          "author": "buildlogic",
          "text": "You can start with one visible project that's currently a dumpster fire and use the plan to solve their actual pain points, show them how 15 minutes of planning prevents the 3-hour emergency meeting they all hate. But don't sell it as formal PMPs, sell it as \"so we stop getting blindsided by the same issues every single project\", make the plan solve their problems, not yours, and they'll adopt it because it makes their lives easier.",
          "score": 3,
          "created_utc": "2026-02-10 10:47:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4goqwk",
          "author": "pmpdaddyio",
          "text": "Tell them that without a project plan you need to grab gasoline and find a dumpster. Light it on fire and all of you jump in.",
          "score": 2,
          "created_utc": "2026-02-09 17:13:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4h5ihq",
          "author": "Chicken_Savings",
          "text": "They already do production planning, which is different from project management. It's not like every worker just rock up each morning, produce something random based on whatever raw materials and WIP materials are lying around.\n\nYou can try to identify frequent occurring problems that would likely be avoided by investing in the administrative burden of PM. If you can't find any, then maybe PM isn't the right answer.\n\nMay I suggest to look up MRP2 and see if you can steal some ideas from that, or Production Planning Methodologies.\n\nI'm not saying that you can't implement PMBOK, just saying that perhaps it is not the right toolkit.\n\nMaybe something like this would be helpful:\n\nhttps://www.odoo.com/app/manufacturing",
          "score": 2,
          "created_utc": "2026-02-09 18:32:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4h5mhg",
          "author": "TylertheDouche",
          "text": "I’m kind of confused by this. The pushback is they don’t want to plan? What is the actual pushback? Too many checkpoints?",
          "score": 2,
          "created_utc": "2026-02-09 18:33:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4humvy",
              "author": "More_Law6245",
              "text": "Resistance to change itself and there is no immediate benefit realised or answering the question of what's in it for me from individuals. This is where having change champions and agents becomes very important when invoking organisational change. At the moment, planning is perceived as an overhead because it hasn't been done in the past, so having no experience with project plans leads to the change resistance. This is important in showing how planning will improve or benefit both the organisation and individuals with the myriad of problems they currently experience now with an unplanned approach.\n\nJust an armchair perspective.",
              "score": 3,
              "created_utc": "2026-02-09 20:35:16",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o4hkvuy",
              "author": "BreakNo7825",
              "text": "I’d say one argument is that it’s added work. Or at least some will perceive that to be a major hurdle.",
              "score": 1,
              "created_utc": "2026-02-09 19:46:05",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4hlrig",
                  "author": "TylertheDouche",
                  "text": "What is the added work though? Like what is the literal thing now that they will have to do that they aren’t doing? That’s what i would want to know to see if there’s any compromise. \n\nIf they don’t want to plan, that’s one thing. But if they just don’t want 47 checkpoints and you can minimize that then that’s something you can probably do.",
                  "score": 1,
                  "created_utc": "2026-02-09 19:50:26",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4hju8r",
          "author": "LowSkyOrbit",
          "text": "Change comes from failures and lessons learned. Buy in won't happen without some results or clear vision. That can't come from someone saying we need to document more and align our mythology.\n\n Look at the current projects and check in to see what issues they are having. Don't ask them how you would fix it. Ask them what they would do to make their jobs easier. Find the pain points and present to leadership. Suggest what might be course for improvement. Have examples.",
          "score": 2,
          "created_utc": "2026-02-09 19:40:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4l0pmp",
          "author": "impossible2fix",
          "text": "Don’t start with a full PMP or big docs. Start with just enough planning to answer the questions people already care about: what’s coming, what’s blocked and who’s overloaded. When teams see fewer surprises, less rework and clearer handoffs, buy-in follows pretty naturally.",
          "score": 2,
          "created_utc": "2026-02-10 08:37:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4g5dxq",
          "author": "Victorsarethechamps",
          "text": "Baby steps, for sure. Try to implement one small, beneficial change. Make that the norm, and then work on the next one. I did this with my current company with medium success. Strongly encourage the full buy-in, though. Once they see the small changes, they may see the light for the big changes.",
          "score": 1,
          "created_utc": "2026-02-09 15:41:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4gbsj5",
          "author": "ConfectionOver3951",
          "text": "Following this thread because my department is the same way. Everyone in the division is doing one off projects and nobody is keeping track of them. I will pitch that we need a program manager/ product manager to help execute this ideas and projects",
          "score": 1,
          "created_utc": "2026-02-09 16:12:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4gi7bj",
          "author": "thatburghfan",
          "text": "Are there ever any external conflicts about scope or milestones? ",
          "score": 1,
          "created_utc": "2026-02-09 16:42:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4gjfz9",
          "author": "1z1z2x2x3c3c4v4v",
          "text": "Why do you want to do this?  What do you expect to get at the end?  What problem are you trying to solve?   And what is the ROI for all the effort one must put into your plan?",
          "score": 1,
          "created_utc": "2026-02-09 16:48:38",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r2i6fs",
      "title": "Tough stakeholders- how to work with difficult people?",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1r2i6fs/tough_stakeholders_how_to_work_with_difficult/",
      "author": "apfrkf",
      "created_utc": "2026-02-12 03:03:53",
      "score": 19,
      "num_comments": 11,
      "upvote_ratio": 1.0,
      "text": "I need some help to figure out this situation. \n\nFor context: I am a newer PM- 3 years in project coordinator role, and coming up on 6 months as a PM in a new company and a new industry. \n\nI work with an engineer who is their own worst enemy and stresses themselves out to the max because they’re “overworked”. I don’t doubt they have a lot of work that could be done, but he’s actively managing a lot less work than other coworkers of similar skills/tenure. He also publicly talks badly of his boss, and anyone else around him that doesn’t give him slack.  He’s in general unwilling to communicate his problems to find a resolve and doesn’t seem able to manage his time or emotions. \n\nI have been slowly onboarding into the role, primarily assisting with other projects currently underway and recently received my first three full time projects. Along with projects I also work on quoting future projects for labor and materials. \n\nThe issue is due to the aforementioned engineer being his own worst enemy, he tends to mail things in without looking into them as he should. Now, my PMO team I’m now working with is not a strong PMO team and also has been stretched thin over the last year. They haven’t been checking bill of materials like they should leading to a surge of internal (ie non-billable) request forms being filled out for replacement materials.\n\nI happened to catch over 30 missing items on a BOM for a repeat build, that was missed on the BOM. AND- it was also missing on the previous BOM from the same engineer. Why? Because he didn’t review the change request forms from the previous project. \n\nHe’s now very upset with me that I dared bring this up and actually asked him to fix the issue, and not continue to kick the can down the road. He tried to continue to kick the can down the road, but I had a hard deadline and eventually had to loop in his boss. The boss he hates. \n\nQuestion posed: how do you work with stakeholders who are their own worst enemies/ don’t get things done? I fear he’s the kind of worker who will not improve ever- so, building a relationship with him and giving him tools may not be effective. I’m okay with not being liked by him. He’s not especially likable to be honest. However, I worry him expressly disliking me will harm his ability to get work done. Advice? Thoughts?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/projectmanagement/comments/1r2i6fs/tough_stakeholders_how_to_work_with_difficult/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o4x2j0c",
          "author": "AutoModerator",
          "text": "Attention everyone, just because this is a post about software or tools, does not mean that you can violate the sub's 'no self-promotion, no advertising, or no soliciting' rule.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/projectmanagement) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-12 03:03:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4xk1se",
          "author": "Neither_Cover_4330",
          "text": "What I've learned over the years is that we are actually dealing with people, not robots. And these people all have feelings about yiu, your project, their workload, the company... everything. And those feelings can impact the project work.\n\nWhat's worked for me is that I \"mirror\" what I hear from them - to make them feel understood and to gain trust and a path to a successful working relationship. I usually try to get them on their own, and I'll start off with something like, \"So, Bob, how do you feel about our project? How do you feel about what you'll have to deliver?\" Notice I didn't ask him what he THOUGHT, but how he FELT. I take the time and give them the space to gripe... and I listen.\n\nI've learned a lot from people when I do this. One guy's coworker had quit, and he was trying to figure out fhow to juggle all the extra work. One young, new supervisor was a real bltch, and I found out it wss her first project, and she was afraid of failing because it had a lot of visibility.\n\nAnd then I let them know that I'm concerned - that I'm worried about them. And I ask them if they see any way I can help. Sometimes I can (maybe help get an additional resource assigned or create an extra report to track the project, for example). But I communicate that I care about their issues.... and that I know we both want the project to go well. And I ask them how I can help.\n\nI do this on a continuous basis throughout my projects. I keep asking people how thet FEEL, because that's a much better barometer of how things are going than if you ask them what they THINK. You'll hear that they're stressed or overworked or whatever, but your job is to assist however yoh can and to BUILD TRUST. Trust gains cooperation. If people like you, that gains cooperation, too.\n\nIt's a really rare thing that I have to bring out the \"big guns.\" I really don't need to. And if you polish your skills on how to build trust, how to develop relationships, and how to help people solve THEIR problems (not just have them solve yours) your projects will be much more successful.\n\nGood luck.",
          "score": 21,
          "created_utc": "2026-02-12 05:04:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4zo162",
              "author": "Wild_Instance_1323",
              "text": "good pm are good parents.",
              "score": 6,
              "created_utc": "2026-02-12 15:00:34",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o50pvot",
                  "author": "Soggy-Car-4548",
                  "text": "Yes. Parenting has been excellent prep for project management and management in general. As a parent, I learned quickly to identify root causes of issues where a stakeholder (child) is unable or unwilling to articulate the problem while screaming and crying in public. Adults that are difficult or melting down trigger my automatic slowdown and soften responses where I focus on listening and learning what the human needs. At the end of the day, empathy is the bridge. (FWIW, empathy is a trait that AI will not be replacing any time soon.)",
                  "score": 2,
                  "created_utc": "2026-02-12 17:59:11",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o4zxnj2",
              "author": "nborders",
              "text": "This is the way.  \n\nBut I would also keep your supervisor abreast of your plans. Good ones will back you up.",
              "score": 4,
              "created_utc": "2026-02-12 15:47:20",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o51ld04",
          "author": "More_Law6245",
          "text": "The reality of being a project manager is that you can't be worried about what people think of you and over the years I have worked with many people as you have described and being in IT it would be fair to say when it comes to engineers you get to deal with some big egotistical personalities, especially when you start working in the enterprise space.\n\nThe way I approach these types of situations is I first have an informal 1:1 meeting and discuss the impact of their behaviour and how they affect project delivery (I always have supporting facts to highlight, so to not make it or have it perceived as an personal attack) what you outline is the impact of their behaviour and outline their responsibilities. You need to convey your expectation of what is and isn't acceptable behaviour to you as  you're the person who is responsible for delivering the project.\n\nYour next step if there is no change to the behaviour is to document and present to their immediate manager, highlight the impact of the individual's behaviour (again with verified facts) but this is where you start outlining the type of costs the project is incurring e.g days lost, time lost, additional unscheduled project costs but where you focus in on is the organisational reputational risk to the company and how this individual behaviour passes through to the client.\n\nIf you still don't get any assistance in the management of the unacceptable behaviour then you need to escalate through to your project board, sponsor or executive. This is the drawback from a PM perspective, because you don't own the resource you can't HR manage the individual. All you can do is highlight the unprofessional behaviour and the risks and impact of the individual's behaviour. Based upon my experience over the years sometimes you do need to have to have confrontation or conflict resolution management intervention, for me I'm sure as hell not going to be held accountable for someone's unprofessional behaviour but that's a \"me thing\". I've been around the block a few times and to be honest I refuse to accept behaviour like this because I have been really impacted in the pasts because of this type of behaviour and If I had the same attitude as a PM, I wouldn't be very successful and be out of a job very quickly, so why is this individual getting a hall pass?\n\nHere's a reflection point for your consideration, do think that it's fair that this individual isn't held accountable for their actions and you are as the PM? This comes down to the fundamental management skill, holding people accountable for their actions and to be perfectly honest I hold CEO's down to project support staff accountable because that is MY responsibility as a PM.  Good luck and I hope things work out for you.\n\nJust an armchair perspective",
          "score": 5,
          "created_utc": "2026-02-12 20:28:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5447dn",
          "author": "Fantastic-Nerve7068",
          "text": "yeah it’s rough dealing with someone who refuses accountability and punishes others for holding the line but here’s the thing your job isn’t to make everyone happy it’s to make sure the work gets done right especially when timelines and budget are on the line\n\nwhat helped me in a similar spot was treating these folks like unstable systems keep documentation tight escalate through the right channels early not emotionally just factually and always bring things back to impact not blame like “we missed 30 items which delayed production by x days and cost us y” not “you screwed this up again”\n\nalso build alignment with their boss whether or not they dislike each other because if leadership supports your clarity it gives you air cover to do your job you’re not there to babysit you’re there to deliver and if someone’s consistently undermining that let the record show it\n\nyou might not fix him but you can build enough structure that his chaos doesn’t wreck your ship good luck fr you're handling this better than most new PMs would",
          "score": 5,
          "created_utc": "2026-02-13 05:11:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4x9au2",
          "author": "choclatelabguy",
          "text": "Are you in the AV industry by chance?",
          "score": 1,
          "created_utc": "2026-02-12 03:47:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o52syx0",
              "author": "apfrkf",
              "text": "Audio visual? I am not.",
              "score": 1,
              "created_utc": "2026-02-13 00:11:12",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qz6trm",
      "title": "Critique my Portfolio Management Setup",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1qz6trm/critique_my_portfolio_management_setup/",
      "author": "tky_phoenix",
      "created_utc": "2026-02-08 11:41:25",
      "score": 18,
      "num_comments": 28,
      "upvote_ratio": 0.95,
      "text": "I’m a delivery manager at a consulting company, currently managing <10 concurrent client projects.\n\nContext:\n\n* Sales wins the work and hands it over to delivery\n* Delivery owns execution\n* A separate talent team manages resourcing\n* Internal users only (no external client access)\n* Mixed tool maturity across teams (delivery is strong, sales less so)\n\nWhat we were trying to solve:\n\n* No consistent way to track deliverables, dependencies, and blockers across projects\n* Poor portfolio visibility (everything lived in emails, decks, or ad-hoc trackers)\n* Too much manual status chasing\n* Difficulty separating “we’re late” vs “we’re blocked externally”\n* Difficulty seeing the health of our engagements in one single source of truth\n\nWhat we’re experimenting with now:\n\n* **One Microsoft Planner plan for all projects**\n   * One bucket per project\n   * Tasks are labeled (deliverables, internal admin, on hold, dependency)\n* **Microsoft Teams**\n   * One team, one channel per project\n   * Planner tab filtered to that project\n   * Teams used for discussion; Planner is the system of record\n* **Power Automate**\n   * Project provisioning (channels, folders, Planner buckets)\n   * Daily automation posting overdue + due-soon tasks\n   * Weekly automated project health summary\n* **Power BI**\n   * Portfolio + project health\n   * Health based on:\n      * Deliverables completed vs time elapsed\n      * Budgeted hours vs actual hours\n      * Overdue / at-risk deliverables\n   * Explicit handling of external blockers\n\nDesign principles:\n\n* Delivery owns structure and task creation\n* Sales only responds to tasks assigned to them, they don't need to create tasks themselves\n* Automation replaces manual discipline as much as possible\n* Optimized for low admin overhead and scale\n\nWhat I’d like feedback on:\n\n* Where do you see this breaking in practice?\n* “One plan for all projects”: good idea or future regret?\n* Failure modes you’ve experienced with Planner / Teams-based setups\n* Anything you’d simplify or remove based on real-world scars\n\nNot looking for tool evangelism or “use Jira instead” answers. We are deep in the Microsoft eco-system and I can't easily change that. My goal is to make the most of the tools I have access to. Genuinely interested in what has worked or failed for people managing multiple projects with lightweight tooling. I can share more details if needed.\n\nThanks in advance.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/projectmanagement/comments/1qz6trm/critique_my_portfolio_management_setup/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o48kwiu",
          "author": "AutoModerator",
          "text": "Attention everyone, just because this is a post about software or tools, does not mean that you can violate the sub's 'no self-promotion, no advertising, or no soliciting' rule.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/projectmanagement) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-08 11:41:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o48le0l",
          "author": "Old_Cry1308",
          "text": "sounds like a lot of moving parts, might get messy. one plan for all projects could lead to chaos, seen it before.",
          "score": 5,
          "created_utc": "2026-02-08 11:45:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o48oq6s",
              "author": "tky_phoenix",
              "text": "I get what you mean. My instinct was also to have one per project. Comes with tradeoffs. One plan for each project has people flipping between different plans and potentially missing a task.",
              "score": 1,
              "created_utc": "2026-02-08 12:14:19",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o48p2he",
                  "author": "Thirstythursday00",
                  "text": "People can have their personal tasks from different plans in a single view in Planner, you can do this for sure if the tasks are assigned, pretty sure you can do this via tags as well. So that shouldn’t really be a tool issue, more of a user issue",
                  "score": 2,
                  "created_utc": "2026-02-08 12:17:06",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o48pklo",
                  "author": "Maro1947",
                  "text": "They also get email reminders so shouldn't miss tasks",
                  "score": 1,
                  "created_utc": "2026-02-08 12:21:12",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o49djw7",
          "author": "Correct-Ship-581",
          "text": "One option is set up Outlook folders per project (Project ID). Setup Outlook rule for each project to move email to the correct folder.  This way each project can have its own plan.",
          "score": 2,
          "created_utc": "2026-02-08 14:55:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4a5exo",
          "author": "weareabassi",
          "text": "I like a lot of what you are doing, but I question why you are rigging a single plan with buckets for your entire portfolio. Planner has a built in portfolio function that you can just  use instead of buckets. Plus, if you use the portfolio version instead of buckets, you can templatize similar projects, and use the buckets for a different purpose. \n\nI like your teams setup, and I do the same for the large program I'm running. However, I think it will all depend on buy in from sales in using it. My teams site struggles with adoption because people just message me or other teammates instead of using the channel. I will be stealing your power automate ideas though :). \n\nAnother idea if you have good traction with this setup, set up a SharePoint site with a quick overview of knowledge, key files, and even a high level critical path view of the higher profile projects for non-core team members",
          "score": 2,
          "created_utc": "2026-02-08 17:14:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4f0cot",
              "author": "tky_phoenix",
              "text": "Thanks for the feedback! I have not explored the portfolio feature yet. I played around with Planner Premium last year but stopped because PowerAutomate automations were too complicated.\n\nWe currently use OneNote for all our manuals and Miro for process maps but I want to move it to Sharepoint in the future so we can more conveniently use agents with it. \n\nThe one challenge I asked our data team to solve is how to get the Planner data into PowerBI. I know you can export to Excel and feed the Excel file to PowerBI but I want it automated.",
              "score": 1,
              "created_utc": "2026-02-09 11:27:59",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4g242u",
                  "author": "weareabassi",
                  "text": "What are you solving with the powerbi data? Sounds like youre using a bazooka on a molehill, or however that saying goes",
                  "score": 1,
                  "created_utc": "2026-02-09 15:25:28",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4b7jaw",
          "author": "rsbi",
          "text": "I like your setup already. The one thing I like to suggest is to maintain Portfolio Management within Sharepoint Lists / Microsoft Lists and add that to the Power BI.\n\nIn the SharePoint list, we register information such as: \n• Original delivery date\n• Current delivery date\n• Registration date\n• Short business case\n• Phase\n• Description\n• Business Lead\n• Sponsor\n• Technical Lead\n• Project Manager\n• Budget\n• Forecast*\n• Spent*\n• Committed Cost*\n• Cost RAG*\n• Time RAG*\n• Resource RAG*\n• Next Milestone*\n• Milestone Date*\n• Recent Update*\n\nWe also have a separate RAID Microsoft List that uses a selector for projects that exist in the portfolio. It will allow raising RAID entries against a project ID which we can centralize in Power Bi to see all risks over all projects in the portfolio. \n\nProject managers are meant to update all entries with a * weekly.",
          "score": 2,
          "created_utc": "2026-02-08 20:16:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4f01vj",
              "author": "tky_phoenix",
              "text": "That's a great point. We have a PowerApp that contains most of those data points exept RAID and that is what feeds into the PowerBI report in addition to the Planner data.",
              "score": 1,
              "created_utc": "2026-02-09 11:25:22",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4f7egu",
          "author": "More_Law6245",
          "text": "As a consultant I see this consistently when auditing organisations, your perspective in this thread is you're looking at end game, where you want to be but the key question here is what is your strategy to deliver a baselined delivery model? consistency in policy, process and procedures to ensure organisational portfolio, program and project delivery. Having a consistant organisational engagement model is the key to success that all stakeholders engage in.  \n\nI'm going to go out on a limb here and I'm going to say that you're not getting consistency in your project, program and portfolio schedule and plans because you should have a top to bottom and bottom to top view of all projects, programs and portfolios within a single view and yes it's actually achievable as it's how I actually deliver program and portfolios. Most of what you outlined can be drawn from the schedules themselves and all we do is redefine the view depending on what level you're looking at.  Also I feel that you may not be taking into consideration in how all teams operate differently and place different priorities around what they think is or isn't important to deliver, have you engaged these teams in workshops to map out business and workflows etc.? \n\nYour other constraint is your enterprise workforce planning model, in its current form you will always have a struggle, until you have a single source resource pool tracking genuine forecast and actuals, you will always run the risk of conflicting priorities within the organisation.  I must admit this has always been my challenge in the past, particularly from the senior execs especially when I ask for them to put a hand in their pocket to pay for an enterprise system. \n\nBased upon experience you need to look at your fundamental basics, refine them and ensure they have been embedded within the organisation, then you start becoming more strategic with different systems, governance, information management, data stores and information dissemination which leads to better strategic and performance outcomes.  Tools are the last thing to look at in addressing something like this, it's the requirements that dictate this, so what does the organisation need? \n\n  \nJust an armchair perspective",
          "score": 2,
          "created_utc": "2026-02-09 12:24:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4a1k8m",
          "author": "Fantastic-Nerve7068",
          "text": "yo this is honestly one of the cleaner Planner based setups i’ve seen. love how you’re squeezing value out of Power Automate without drowning in admin. the “one plan for all projects” thing can hold up if you’ve got <10, but once things grow it might start feeling noisy real fast. i’d just keep an eye on how many “overdue” tasks pile up and whether folks start ignoring the summaries. also planner’s lack of dependencies might bite you later when deliverables start overlapping. but for a MS first org, this is solid. respect.",
          "score": 1,
          "created_utc": "2026-02-08 16:56:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ezw7z",
              "author": "tky_phoenix",
              "text": "Thank you! Yeah the \"one planner to rule them all\" had me skeptical as well but it seems to be the most reasonable given our current scale. We could then break out into additional planners depending on theme, industry, sales team etc.",
              "score": 1,
              "created_utc": "2026-02-09 11:23:59",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4b0g3t",
          "author": "Economy_Pin_9254",
          "text": "Where I’ve seen things like this start to hurt isn’t Planner itself — it’s when projects begin to compete with each other in real ways. While you’re under \\~10 projects and priorities mostly align, one plan works fine. The moment two projects both “need to move” and share the same people, the system will show you the problem but won’t help you resolve it. You’ll feel that gap pretty quickly.\n\nAnother thing to watch is labels. “Blocked externally” is great in theory, but over time people get softer with it. Things quietly shift to “in progress” because no one wants their project to look stuck. Automation then just reports whatever it’s given. That’s not a tooling flaw — it’s just human behaviour once visibility exists.\n\nSame with the automations. They’re useful at first, then they fade into background noise. Once that happens, you’re back to status theatre, just without the manual work. The difference-maker is whether there’s a clear moment where “still blocked” stops being information and turns into a conversation with someone senior.\n\nThe parts I like are the obvious ones: delivery owning structure, sales not being dragged into tools, and BI sitting above it all instead of adding more noise. That’s sensible.\n\nIf this setup struggles later, it won’t be because Planner can’t scale. It’ll be because you’ve solved visibility but not yet solved how decisions get forced when projects clash. Most portfolio setups die right there.\n\nOverall, you’re on the right track — just don’t let it become a very efficient way of reporting problems without actually resolving them.",
          "score": 1,
          "created_utc": "2026-02-08 19:41:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ezqms",
              "author": "tky_phoenix",
              "text": "Thank you for the great feedback.\n\nLuckily our delivery team is only two people at this point. So consistency when it comes to tool use is stil fairly easy to manage, at least better than when there are more than 10 people involved.\n\nWe have weekly delivery pulse meetings to look at the whole portfolio and then drill down on the ones that need attention. That is also where we discuss and solve or escalate.",
              "score": 2,
              "created_utc": "2026-02-09 11:22:36",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4dhxcm",
          "author": "WhiteChili",
          "text": "this is honestly a pretty sane setup for where you are. you’ve solved visibility without drowning people in process, which is rare.\n\nwhere i’ve seen this strain is when projects start competing for the same people and dates. planner shows the conflict, but it can’t help arbitrate it. that’s where teams either add a thin portfolio layer (lists/sharepoint) or eventually reach for tools that handle cross-project dependencies and capacity a bit better, like celoxis or wrike. not because planner failed, but because the decision pressure moved up a level.\n\nsame risk with labels and automations… they work until humans soften them. dashboards don’t break, behavior does. the difference is having a clear point where “still blocked” forces a leadership call instead of becoming background noise.\n\nfor <10 projects, this is clean and pragmatic. just watch that you don’t end up with a very efficient system for reporting problems without a mechanism to resolve tradeoffs.",
          "score": 1,
          "created_utc": "2026-02-09 03:41:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ezhgp",
              "author": "tky_phoenix",
              "text": "Thank you, great feedback. I completely agree with your points. The system only works if people work within it and not around it.\n\nWe have a weekly delivery pulse where we look at the projects first at a macro level and then drill down on the ones that need attention. That's where the discussions and decisions then take place. At least that is the idea for now.",
              "score": 1,
              "created_utc": "2026-02-09 11:20:22",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4ek3dt",
          "author": "mandevillelove",
          "text": "Looks solid 1 plan works for <10 projects. but watch for resource conflicts and make sure you build in a clear way to prioritize and resolve trade offs, not just report them",
          "score": 1,
          "created_utc": "2026-02-09 08:51:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4f0fb0",
              "author": "tky_phoenix",
              "text": "Thank you, yeah I agree. The key take away is that it only works if people work in the system and not around it and secondly, issues are not only signaled but also then resolved instead of ignored.",
              "score": 1,
              "created_utc": "2026-02-09 11:28:38",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4fd59x",
          "author": "surrealcrow",
          "text": "Start super simple, automate as much as posible, then start adding where the process needs it, I've been on bot sides and no one likes to receive a bunch of nonsense extra work  on day one \n\nStart with",
          "score": 1,
          "created_utc": "2026-02-09 13:04:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4fdihq",
          "author": "pmpdaddyio",
          "text": "This is a consultant level ask. But my 1,000 foot view on where to address this is as follows:\n\n* No consistent way to track deliverables, dependencies, and blockers across projects\n   * *Planner has some cross over for projects, but it is mostly tied to the individual resource. I think you need to have separate projects per plan and use the buckets as intended, which is for project phase. Set up project phases and then set up PowerAutomate to pull these into an enterprise report.*\n* Poor portfolio visibility (everything lived in emails, decks, or ad-hoc trackers)\n   * *You need one source of truth. Your communications plan should outline where and how to communicate and for what reason. For instance, long term comms go in email, and are categorized in a project bucket and tagged. My day to day non tracked info is in Teams, and task/project specific comms goes in Planner. The hard part is socializing it. The more you ignore out of band comms, the better. I get people saying, \"I mailed my updates\" for instance and I just respond \"Hmmmm...didn't see those because the comms plan requires it.\". Then I send out the entire comms plan to the entire team and \"remind\" them. I only have to do this once or twice.*\n* Too much manual status chasing\n   * *This is accountability and you need to take the blame for this. If people are not updating tasks, you need to make it very clear that it is their responsibility. During status calls, I let them hang \"John, I don't see updates for your tasks, we'll skip you for this meeting, but I want all of your tasks updated by COB, and send me a status I can share with the team.\"*\n* Difficulty separating “we’re late” vs “we’re blocked externally”\n   * *This is where the progress field is best. You should not use the stock nomenclature, add what works, \"Blocked, waiting, on hold, delayed,\" etc. can all feed back into your reporting with PA.*\n* Difficulty seeing the health of our engagements in one single source of truth\n   * *Why? You have PowerBI, this is exactly what this tool does. It allows you to view all, or just a task. I'd start looking there. PBI has some great program and project resources.*\n\n",
          "score": 1,
          "created_utc": "2026-02-09 13:06:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4gj6w1",
          "author": "ninjapapi",
          "text": "your setup sounds pretty thoughtful but i've seen similar Planner-based approaches hit a wall when you need to correlate project data with actual financial or resource data from other systems. The \"\"one plan for all projects\"\" thing can work until you need to slice data differently or integrate with ERP/finance tools. From what I've read, Scaylor is built for exactly this kind of scenario - it unifies data from Microsoft tools, ERPs, and even spreadsheets into one queryable warehouse without replacing your existing stack.\n\nThat way your Power BI dashboards can pull from actual resourcing and budget systems instead of just task metadata. One thing I'd watch for: as you scale, you might spend more time maintaining teh automations than they save you, especially if data sources drift or someone changes a field name.",
          "score": 1,
          "created_utc": "2026-02-09 16:47:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ibni7",
          "author": "busote",
          "text": "Yeah, this unorganized mix of tools is always a problem. What worked for me is using a simple, easy-to-share Startpage. We're using it as a common ground for all co-workers where we collect all the tools and projects we are using.",
          "score": 1,
          "created_utc": "2026-02-09 21:59:40",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qy8fxo",
      "title": "Tips on setting up Project Portfolio Management",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1qy8fxo/tips_on_setting_up_project_portfolio_management/",
      "author": "akash738",
      "created_utc": "2026-02-07 08:22:31",
      "score": 17,
      "num_comments": 17,
      "upvote_ratio": 0.92,
      "text": "Hi everyone, I’ve been running some coordination and managing workload for my branch for some months now and have realized the lack of proper portfolio management is hurting. Our current version is basically too reactive and I’m trying to move towards bit of an organized chaos. \n\nAs an added context, we do have an intake process currently and and excel tracker I created that basically sums up all projects and their statuses but it’s more like record log and does not help with scheduling, coordination, and proper workload balance. Moreover, this sheet is becoming the sum total of all things that higher ups want to know and have shown increased interest in expanding it to include various aspects of project management that does not help (25 columns is PITA tbh for anyone to fill out regularly) \n\nIf someone has setup their organizational PPM or are part of it, what helped the initial setup and what are some biggest lessons learned? ",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/projectmanagement/comments/1qy8fxo/tips_on_setting_up_project_portfolio_management/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o44bae8",
          "author": "WhiteChili",
          "text": "this is where a lot of teams go wrong… ppm turns into a Frankenstein excel instead of a decision system. more columns never fix reactivity, they just hide it better.\n\nwhat helped us was killing most fields and forcing a few hard views: priority, capacity, and timing. once leaders saw demand vs actual people, the chaos calmed down fast. tools like celoxis or wrike helped because they show portfolio load and tradeoffs without becoming report hell. lesson learned: if ppm can’t help you say “not now” or “no,” it’s just busywork dressed up as governance imo.",
          "score": 5,
          "created_utc": "2026-02-07 18:17:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o44lnu3",
              "author": "akash738",
              "text": "Spot on for my situation friend. I’ve had this nagging feeling that even with some software or different setup, without actual leadership support and involvement to change our “We can fit this in” stance every single time a new project pops up, will only send me to same existing situation with only a new fancy tool in my hands this time as the difference. \n\nTrying to implement some small wins on my end first without involving more people first. Once I can provide some answers like “we can fit this in after xx weeks due to these xx projects”, it might be time to start the bigger conversation when people have already seen some small wins.",
              "score": 2,
              "created_utc": "2026-02-07 19:08:58",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o431te0",
          "author": "timevil-",
          "text": "we are implementing Sensei...",
          "score": 3,
          "created_utc": "2026-02-07 14:29:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o41vdj9",
          "author": "Old_Cry1308",
          "text": "moving from excel to a real ppm tool was a game changer for us. too many columns is a mess. less is more. good luck",
          "score": 2,
          "created_utc": "2026-02-07 08:47:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o41zb8w",
              "author": "akash738",
              "text": "“One more column” has now dethroned my hatred for “One more lane”. What tool did you end up using?",
              "score": 1,
              "created_utc": "2026-02-07 09:26:43",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o42mzhy",
                  "author": "tubaleiter",
                  "text": "In a “real” tool it just becomes “one more custom field”. And then everybody complains the tool it too complex.\n\nNo tool will fix lack of discipline/process adherence, only leadership and culture can do that.",
                  "score": 3,
                  "created_utc": "2026-02-07 12:59:15",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o42r07x",
              "author": "Panda9903",
              "text": "What is a real PPM tool you are using, is it one that tracks all projects and resources used at once shown in a dashboard?",
              "score": 1,
              "created_utc": "2026-02-07 13:25:30",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o42rm6z",
                  "author": "ExpatPhD",
                  "text": "In my organization we use Smartsheet.",
                  "score": 2,
                  "created_utc": "2026-02-07 13:29:20",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4a273l",
          "author": "Fantastic-Nerve7068",
          "text": "one thing that helped us was separating reporting from actual execution tools early on we were trying to cram planning tracking resource load and status updates into one excel beast and it collapsed under its own weight shifting to a proper ppm platform gave us version control real timelines and portfolio level insights without turning everyone into spreadsheet slaves if you can get even a lightweight tool in place with roles workflows and dashboards it’ll save so much pain later even celoxis did a solid job letting us grow without overwhelming folks up front",
          "score": 2,
          "created_utc": "2026-02-08 16:59:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4avum8",
              "author": "akash738",
              "text": "💯. This was my pitch for 2026 and why we should stop relying on one single excel sheet for everything we do. Not only it takes mental toil on people updating the 20+ columns but it also start getting more messier to manage any sort of reporting except a very generic active, completed or on hold projects list. My current sheet takes so much time at end of every month from my workload due to constant reminder to people so they can update it and I genuinely understand why it’s not the most important thing for them when they are tacking 10+ design projects any single time. \n\nHopefully with some small changes, I can change their mind to start looking towards PPM and change organizational culture to be more provocative on our projects.",
              "score": 1,
              "created_utc": "2026-02-08 19:19:07",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4470xu",
          "author": "Magnet2025",
          "text": "I’ve used portfolio management software (part of Project Server) that took into account a complex ranking systems that included:\n\n- estimates of the cost and duration of the suggested project. In a well defined process we would collect the resource types (generics) so at the end, we’d see “PM 100%” “Business Analyst 150%” “Developer 550%” meaning 1 PM, 1.5 BA and 5.5 Devs. The resource estimate is important because most orgs can’t do all the projects and even with some projects they need to know the resource impact? Will you need to bring in contractors? Hire? \n\n- Then you have a portfolio of, say, 18 projects with the capacity of 12 projects. So the tool enable pair-wise comparison based on company direction and priorities. \n\nAt the end, you have your portfolio. Then the CIO says, “You eliminated project 7 and that’s a hard requirement” so you have to force out and force in projects. \n\nIn Project Server, the Portfolio process became an option I think. But it was a powerful tool with a lot of calculations running in the background. A colleague reverse engineered the process in Excel. I think it was about 25MB and many tabs. \n\nYou could lay the projects out against a calendar to see the resource load and change start dates to help reduce peaks and valleys.",
          "score": 1,
          "created_utc": "2026-02-07 17:56:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o44koi1",
              "author": "akash738",
              "text": "Thank you for sharing this. This is actually resembles something close to what I need on the workload balancing side and it’s lot easier to say “We can prioritize this thing but something from existing list needs to be delayed” with data in hand. I’ve gotten the usual “oh we can fit this in schedule” when clearly I’ve voiced we can’t (but with only rough numbers on active projects and their estimated time frames)",
              "score": 2,
              "created_utc": "2026-02-07 19:04:00",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4501kg",
                  "author": "Magnet2025",
                  "text": "You are welcome. \n\nI have that Excel somewhere if you would like to have it. \n\nI think the resource management part of the portfolio is very powerful part of the tool. When you compare the planned vs actual, you start to see the impact of delays as resources needed on another project are still critically engaged on a delayed project. \n\nI used to become fairly upset when told “You can get it done, just manage the team, that’s what we hired you for.” \n\nMy response would be: “I don’t own any of the resources and you hired me to deliver successful projects that comply with the triple constraint, not to browbeat team members into working a bunch of uncompensated overtime in order to work a project that was not in the portfolio.” \n\nI could usually get away with that. Not always, but usually.",
                  "score": 1,
                  "created_utc": "2026-02-07 20:24:20",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1r0zy8h",
      "title": "Self-learning practical project management?",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1r0zy8h/selflearning_practical_project_management/",
      "author": "VladimiroPudding",
      "created_utc": "2026-02-10 12:54:30",
      "score": 17,
      "num_comments": 7,
      "upvote_ratio": 0.95,
      "text": "Hello all,\n\nI am currently in a weird spot. I recently went back to school to change gears and succeeded striking in last year, even with this horrid job market. I have some management experience under my belt from my previous career, including managing a small team and mentoring, and have made a project from scratch which, at the time, was in broad demand in the company. Meaning, I was just there to connect the dots and make a stuff everybody wanted. People were cooperative.\n\nNow, I am in a path that is totally new to me and... the company is a *brutal mess*. My boss doesn't know what the end goal/deliverable of their projects are, much less how to manage them (I mean, how can you manage the development of something you don't know what it is) and the senior managers under them are as oblivious. Everything is an amorphous blob. I feel like people are not jumping off ship because the company is in this limbo that deadlines don't matter much (think of something like public projects that take years to complete), so it is a comfortable place to be. \n\nHowever, because of some life planning of mine, I need to have a portfolio in this new career I have chosen, and I need it kinda fast, so I decided to create and manage my own projects. But because I am new in this career, and also because of the ethos of my company, I don't know exactly how to manage these projects. I did a course of project management and learned a bunch of fishbone diagrams and GANTT charts but they're all useless if I don't know exactly which steps to take and how much time to dedicate to them. Nobody will come to my rescue (no tutoring, coaching or learning where I am right now due to aforementioned reasons).\n\nSo, my question is: how to best be a self-learner and make my projects happen, in this environment? Thank you!",
      "is_original_content": false,
      "link_flair_text": "General",
      "permalink": "https://reddit.com/r/projectmanagement/comments/1r0zy8h/selflearning_practical_project_management/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o4oj5xa",
          "author": "More_Law6245",
          "text": "I commend you on your professionalism but there is a sailor's warning in your approach because one of the challenges you will experience is that you will have a difficult time enforcing organisational roles and responsibilities when there is no formal organisational project engagement model.\n\nI would highly suggest as part of your approach of getting off the ground is that you need to start seeking out change champions and agents and looking to influence your senior executive in the benefits of what you're doing e.g. being more cost effective and not wasting money off the company's bottom line. Also the other challenge you will face is change resistance, you need to be able to sell the benefits of your approach and answer a fundamental question from a work colleague perspective is \"how does this help me and what is in it for me?\". If you can't answer or demonstrate this you will be pushing a big rock up a hill. \n\nOne consideration is raising a white paper or business case to your senior executive and highlight the need for an organisational framework and a project engagement model, it has a two fold outcome. Firstly it shows the need for the business case and it potentially puts in you in a position to drive the organisational changes needed.  \n\nIn terms for you personally, I do recommend undertaking more formal accreditation to start providing you more context of project management frameworks an principles because by nature project management is an extremely broad discipline and there are many different ways to approach the same problem.  Your lack of experience may leave you will some challenges, having accreditation may just give you a bit more insight in how to approach the discipline holistically. Also keep in mind project management experience \"doesn't happen fast\" experience happens over time through failures and wins and it doesn't happen overnight. Good luck in your role \n\nJust an armchair perspective. ",
          "score": 7,
          "created_utc": "2026-02-10 20:43:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4lzzbi",
          "author": "pmpdaddyio",
          "text": "The first thing you need to do is grab the book [Bare Knuckled Project Manager.](https://www.amazon.com/Bare-Knuckled-Project-Management-Succeed/dp/0615813941) Tony Gruebel is a bit of a legend in project turn around. His company is brought in to fix projects and rerail them.\n\nNext, you need to take a step back and act like you are in the project initiation phase. Look at your team and figure out who you need active and who you need benched. Look at the SOW, then your requirements. If either is weak, you need to fix it. The requirements are easier but if you point out to the client the project is in the shitter, you might be able to convince them to provide an addendum.\n\nNow baseline everything. That way you can measure \"time now\" versus just restarting the project. Review all project artifacts, the project plan, RACI, RAIDD log, etc. Pull this information in when you rebuild. Come up with a new plan that builds off the baseline and a path to green. Determine the new definition of done, and along with that a new budget and schedule to present to the stakeholders and sponsor.\n\nNow the hard part. You need two recommendations, one is the fiscal impact of the sunk cost and project abandonment. This may be cheaper than you expect. The second is your new baseline plan. Get it in writing which path the stakeholders and sponsors want to take, and proceed.\n\nThis whole thing is not a PM issue, it is a leadership issue. Your role is to deliver the facts, not the assumptions.",
          "score": 4,
          "created_utc": "2026-02-10 13:26:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4m19bj",
          "author": "Old_Cry1308",
          "text": "honestly just treat it like you’re the only adult in the room write your own charter, define the deliverable yourself, break it down into tasks, guess timelines, track in a simple board and refine as you go it’s rough building experience in a place that chaotic but job hopping out is not easy with how hiring is right now",
          "score": 5,
          "created_utc": "2026-02-10 13:33:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4u4fso",
              "author": "Smooth-Trainer3940",
              "text": "This is good advice! \\^",
              "score": 1,
              "created_utc": "2026-02-11 17:50:16",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4lzdeo",
          "author": "Deflocks",
          "text": "I was self-learning PM, but it’s damn hard to make a “plan” if you don’t know what the “end game” looks like. Prior to becoming a PM (I was “borrowed” from a different team) I was in leadership for a large retail organization, so the soft people skills are easy enough. But the PM skills, I had no idea what to do.\n\nWhat I did: Took two courses through Coursera (Google Project Management & IBM Project Management) that offered certifications. Took the info I learned for both and applied it to my current role. Those courses helped me “map a path” for my projects, setup milestones, and prepare my projects.\n\n\nBut I have more information than you have… so YMMV.",
          "score": 1,
          "created_utc": "2026-02-10 13:23:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4n1sbm",
          "author": "A-n-o-v-a",
          "text": "Real world experiences thru internships or workshops should help. I only understood management science thru hands-on",
          "score": 1,
          "created_utc": "2026-02-10 16:37:28",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qza69j",
      "title": "For those who are contract PMs, is it common to have a gig supporting more than one project?",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1qza69j/for_those_who_are_contract_pms_is_it_common_to/",
      "author": "NuttyBrewnet",
      "created_utc": "2026-02-08 14:22:58",
      "score": 14,
      "num_comments": 16,
      "upvote_ratio": 0.95,
      "text": "After about 15 years in PM, I’m considering making the switch from FTE to contract work. Is it realistic to think that taking a contract only turns out to be just that one project I was contracted for? Or do you typically get more projects or responsibilities added over time? TBH I’m burned out on always having to juggle multiple projects and want to see how much more effective I could be if I just had one objective to focus on.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/projectmanagement/comments/1qza69j/for_those_who_are_contract_pms_is_it_common_to/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o499il2",
          "author": "Old_Cry1308",
          "text": "contract work often means juggling multiple projects. rarely just one. brace yourself, might not be the relief you’re seeking.",
          "score": 6,
          "created_utc": "2026-02-08 14:32:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ijfos",
          "author": "moochao",
          "text": "Depends on the contract, depends on the project size, depends on client PMO leadership. There's no flat answer to that. \n\n  \nI've been on contract for one single project 3 times. I've supported other projects to assist the PMO director & keep the client org happy during all 3, because that's how you build a reputation in your professional network. ",
          "score": 5,
          "created_utc": "2026-02-09 22:39:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4d821q",
          "author": "fineboi",
          "text": "The main difference in contracting vs FTE is your paid handsomely for your knowledge.   Other than the way they use your energy is the same.",
          "score": 5,
          "created_utc": "2026-02-09 02:47:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4fodir",
              "author": "NuttyBrewnet",
              "text": "Good point! Never thought about it that way.",
              "score": 1,
              "created_utc": "2026-02-09 14:11:54",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4cm4oc",
          "author": "Efficient-County2382",
          "text": "I find them pretty much the same, you may be hired for a particular project, but also you may be hired as a genric PM that has to manage multiple projects",
          "score": 3,
          "created_utc": "2026-02-09 00:48:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4g4dsm",
          "author": "JoshSamBob",
          "text": "After fifteen years of juggling multiple projects as an employee, the idea of a single focus is a great way to beat burnout. In the contract world, your scope is usually tied to a specific project defined in your agreement. While scope creep can happen, you have much more leverage to push back than an fte. If you want to talk about vetting contracts for stability, feel free to shoot me a dm.",
          "score": 3,
          "created_utc": "2026-02-09 15:36:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4i2hbg",
          "author": "More_Law6245",
          "text": "At the end of the day, contract owners see you as an organisational resource and use you as they see fit as you're actually cheaper than an FTE on the hourly rate and have lower HR administration burdens e.g. if the work dries up or you're seen as a temporary supplement to the organisational workforce\n\nOn the rare occasion you can be employed under contract for a specific project or program because it was how the business case for the role was raised because the workload is exceeding the organisation's ability to deliver an it will have a finite period of delivery cycle or the organisation doesn't have the necessary skillset needed for a particular type of project delivery.\n\nThe problem I have with contracting is that I was employed under a contract but contract owners keep on wanting to extending my contract because I was delivering value for money (not to sound like a twat, I'm good at what I do). This makes planning difficult sometimes because A) I have already lined up another contract B) I didn't want to stay with the same contract owner because I had already delivered the contract C) I didn't like contracting with the organisation.\n\nSometimes that means managing multiple projects as a contractor and is a common practice,  I had one in particularly on where I was coming to an end of a contract and was asked to review a program of work and I essentially canned it because standard governance had not been met, so I got the foundation of the program back on track but the contract owner got their noses out of joint because it suddenly it turned into a two year program and I wasn't staying to run it. I was already out the door when they got me to review and assess the program.\n\nIt's the very reason why I became a contractor, I want to control how and when I work.  I've been fortunate enough to be able to pick and choose the contracts I want but I will make this very clear, don't get me wrong there has been a lot of hard yards and a lot of grinding but it's now the very thing that affords me the luxury to pick and choose and sometimes you have to do things that you may not want to. In contracting you're only as good as your last delivery! Reputation is everything when contracting.\n\nA reflection point for your consideration at the end of the day being either an FTE or Contractor it's going to be much the same, it's just what you're willing to put up with but personally I found that contracting gave me more flexibility but there are trade offs.\n\nJust an armchair perspective",
          "score": 3,
          "created_utc": "2026-02-09 21:13:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o498ez8",
          "author": "MattyFettuccine",
          "text": "It depends on your contract terms, of course, but that sounds like scope creep. My contracts are usually for a single project.",
          "score": 2,
          "created_utc": "2026-02-08 14:26:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4c1ua6",
          "author": "Neither_Cover_4330",
          "text": "This really depends on your contract. I've been a contract PM supporting tla PMO when someone is on leave, so I picked up their projects. Same thing for a new PMO. Just depends.",
          "score": 2,
          "created_utc": "2026-02-08 22:51:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4c3p09",
          "author": "FedExpress2020",
          "text": "Ive done both but mostly now its an entire program with PMs and leaders running their workstreams",
          "score": 2,
          "created_utc": "2026-02-08 23:02:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4earbp",
          "author": "Maro1947",
          "text": "Usually. Currently, I'm working on three, sometimes one and the most was around 20\n\nObviously it depends on the size of the project/program",
          "score": 2,
          "created_utc": "2026-02-09 07:21:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4eqh5s",
          "author": "Chicken_Savings",
          "text": "If you're in construction, you'll most likely need to frequently be on site, and it will be very difficult to handle multiple customers unless it's very small projects in the same city.  I'm in oil & gas, I may do a bundle of multiple very similar projects, or just one bigger project.  My colleague in office next to mine manages 1 big project for 3-4 years.",
          "score": 2,
          "created_utc": "2026-02-09 09:55:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4fs8t0",
          "author": "ExtraHarmless",
          "text": "Yes, unless it is one really big one like an ERP deployment.\n\nMany contracts are to replace FTE's when the business won't pay for them on a permanent basis and want the fliexibility to let you go when there is not enough work to keep you busy.\n\nJust make sure if you need to go over the number of contract hours you have(usually 40) to complete the work, talk to your contracting company about how to handle it. Sometimes you should bill for more than 40(go live etc) and sometimes they will want you to eat the extra hours. Try not to eat the hours whenever possible as it reduces your average hourly by a ton really quickly. 4 extra hours a week is \\~10% pay cut per hour. \n\nAfter discussing with your agency, talk to your contract holder about how they want you to handle it. Sometimes they will reduce work load, sometime they will want you to bill more.",
          "score": 2,
          "created_utc": "2026-02-09 14:33:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4h97kg",
          "author": "Correct-Smile-5080",
          "text": "By contract work, do you mean you’re an independent contractor? If so. You should dictate the projects based on the SOW’s you execute.  It’s all contract based.  I’m being hired for project A and I charge XYZ to carry out the scope of work, if they want me to work on Project B then that’s a whole new SOW with it’s own commercial terms. If I don’t want to take it I dont take it.",
          "score": 2,
          "created_utc": "2026-02-09 18:50:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4c3i27",
          "author": "karlitooo",
          "text": "It’s industry dependeeeeeeeeeeeent ",
          "score": 1,
          "created_utc": "2026-02-08 23:00:58",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qy8m74",
      "title": "Doing a Project Planning & Control course (MSc level) without any formal experience. Help?!",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1qy8m74/doing_a_project_planning_control_course_msc_level/",
      "author": "unrolledblueprint",
      "created_utc": "2026-02-07 08:33:24",
      "score": 12,
      "num_comments": 17,
      "upvote_ratio": 0.94,
      "text": "Hello everyone, \n\nSo instead of going for the full MSc, I had the option of taking one course to test the waters before committing and I chose to do Project Planning & Control. I have no formal, professional experience working in the project management field. My background is in construction & i was introduced to construction management courses during my undergrad studies. My goal is to work in construction management eventually. \n\nI love being a student and studying so I don't mind the workload at all, but I realize that I'm at a little disadvantage compared to my peers due to the lack of professional experience (not that it deters me!) I'm doing a ton of reading articles, research papers, watching videos, but I'm wondering what else I can do to gain a practical understanding that comes from actual experience. \n\nI would appreciate any advice you can share, I'm practically a sponge right now trying to absorb any knowledge, advice, or suggestion that comes my way. ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/projectmanagement/comments/1qy8m74/doing_a_project_planning_control_course_msc_level/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o420bw5",
          "author": "Build_higher",
          "text": " Be a site labourer for a bit. Understand the reality of what happens on construction sites, and how things are negotiated on the ground. Shit goes wrong all the time, it’s great to see that first hand.",
          "score": 3,
          "created_utc": "2026-02-07 09:36:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o41yw31",
          "author": "The_Chef_Raekwon",
          "text": "Depending on where you are, but there are definitely planning jobs that don’t require field experience. \n\nImo it depends on how companies view planning. If you want a planner who, on his or her own, owns a multidisciplinary planning and knows about all nuts and bolts, you do need that field experience and there’s no simple way to bypass that requirement as far as I know.\n\nAt my company, planners work together with subject matter experts. Those experts provide input for that planning and the planner makes sure it all comes together. \n\nI work with a female planner and she’s kick ass btw. I’m fortunate to work with pretty diverse teams, including women in a traditionally male dominated field. I’ve yet to hear any demeaning jokes or general unpleasantness towards women. \n\nConstruction adjacent (high voltage power grid), not based in US for what it’s worth.",
          "score": 2,
          "created_utc": "2026-02-07 09:22:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o420m60",
              "author": "unrolledblueprint",
              "text": "I'm not trying to bypass gaining experience at all, I'm very keen on getting that experience & am willing to start from the beginning. Like I said, it's a little hard trying to convince employers that I can be an asset without any experience to back me up. \n\nJust trying to get through this course as best I can without the experience bit ",
              "score": 1,
              "created_utc": "2026-02-07 09:39:50",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o420wae",
                  "author": "The_Chef_Raekwon",
                  "text": "Yeah no worries, doesn’t read like you want to. Just saying I see multiple options to move forward. Best of luck",
                  "score": 1,
                  "created_utc": "2026-02-07 09:42:38",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o450fg7",
          "author": "mostrengo",
          "text": ">I would appreciate any advice you can share\n\nA project is a series of things that need to be done. Each of those things:\n\n- Takes some time\n- Costs some money\n- Has some expected quality level\n- Needs to be done by someone or something (that logically will not be doing some *other* thing during that time)\n- May be an input for another thing that follows\n- May need the input of a thing that came before\n- Is subject to risks (some of which may be addressed proactively)\n- Should be checked during or after to see if things are developing as expected\n\n**Project management is the skill of gathering all of these inputs - which often conflict - and planning them within their constraints and monitoring the plan as it is being executed.**\n\nSo if you are able to:\n\n- Break down the final product into progressively smaller things that need doing\n- Sequence those things based on what is input for what\n- Answer all the points I touched on above for each of those things\n\nYou will be half way to being a PM.\n\n____________\n\nA note on having practical experience: what practical experience does for you is it increases the quality of your inputs (you will think of more risks and more strategies, you will be able to challenge or even perform estimates) and you will deal with people better. but fundamentally the subject matter is similar. \n\nThere also the whole human aspect of being a PM who deals with humans which I did not touch on because in my opinion that is only relevant for those wanting to become senior PMs - this also gets improved with practical experience, but it's far from a given.",
          "score": 2,
          "created_utc": "2026-02-07 20:26:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ejqx0",
              "author": "unrolledblueprint",
              "text": "This is great, thank you for taking the time to break it down! Thinking of these inputs in terms of a construction project is so exciting. I appreciate your help!",
              "score": 1,
              "created_utc": "2026-02-09 08:48:12",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4a1vt1",
          "author": "Fantastic-Nerve7068",
          "text": "Love your attitude toward learning because honestly that's half the battle. Since you're aiming for construction management I’d suggest shadowing real project managers if possible or volunteering on small projects even unpaid ones. Tools like MS Project or Celoxis are good to get familiar with because scheduling and resource planning are key in that field. Also try breaking down real world projects into work breakdown structures or mock Gantt charts on your own. It helps bridge the theory with execution and builds intuition fast. Keep going you’re on the right path.",
          "score": 2,
          "created_utc": "2026-02-08 16:57:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ehr9l",
              "author": "unrolledblueprint",
              "text": "Thank you, i really appreciate your advice and will definitely start incorporating this in my day to day. ",
              "score": 1,
              "created_utc": "2026-02-09 08:28:25",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o41upo8",
          "author": "RemyOregon",
          "text": "If that’s your question, you need to spend some time in the field. Are you what, 21?\n\nMy genuine advice, what I say to most ppl, you don’t know shit until you do 5 years in the field. It sounds like a long time, but it’s not. You’re not much help in the office if you can’t picture the work. The actual labor it requires.\n\nEvery problem I run into is the office thinking things just happen in quants. I did 12 in the field and I am now beginning my estimator/APM time. I add like 25% to whatever the others think. Simply because they don’t account for field error and/or time to move equipment. You have to see it happen.",
          "score": 1,
          "created_utc": "2026-02-07 08:41:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o41v66b",
              "author": "unrolledblueprint",
              "text": "That would be very ideal, I've been trying to get a job but getting entry level roles is pretty tough anywhere & terrible job markets don't make it any easier, but trying! \n\nI'm 25",
              "score": 2,
              "created_utc": "2026-02-07 08:45:56",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o41w0cf",
                  "author": "RemyOregon",
                  "text": "Brutal question, but male or female? Do you feel excited about any aspect of construction yet? Paperwork? Design?",
                  "score": 1,
                  "created_utc": "2026-02-07 08:53:58",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o41wd23",
              "author": "unrolledblueprint",
              "text": "I completely agree with you. My dad has been working in the construction field as estimating manager for a very long time now and he tells me a lot of the same things. Experience is the best teacher for sure. \n\nWhile I am on the job hunt, the whole reason of doing further studies is to get a job!! Employers don't like taking chances on people with no experience (rightfully so, i guess?), so I need to upgrade in other ways to show what I can bring to the table. \n\nThanks for your advice & good look in your new estimating role! ",
              "score": 1,
              "created_utc": "2026-02-07 08:57:22",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o41yqdw",
          "author": "vhagar123",
          "text": "The thing with project management is you could apply the techniques to almost any change. Although they may not be professional examples, things like hosting a party, moving home, making an elaborate dinner etc can all work as examples.",
          "score": 1,
          "created_utc": "2026-02-07 09:20:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4i3qnw",
          "author": "Sophie_Doodie",
          "text": "construction background already gives you real-world context. Treat everything you study as if it’s a live project: map it to jobs you’ve seen, decisions you’ve watched, problems you recognize. Case studies, mock schedules, and planning tools matter more than theory, and honestly a lot of PM “experience” is just learning to think in tradeoffs and constraints. You’re doing the right things already.",
          "score": 1,
          "created_utc": "2026-02-09 21:20:00",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qz0cvi",
      "title": "As a new PM am I doing setting things up the correct way?",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1qz0cvi/as_a_new_pm_am_i_doing_setting_things_up_the/",
      "author": "moderatenerd",
      "created_utc": "2026-02-08 05:20:25",
      "score": 9,
      "num_comments": 6,
      "upvote_ratio": 0.85,
      "text": "Hi All,\n\n   \nI believe this is the proper sub to post on. I just started as a PM for an IT asset management project sorting out issues inside servicenow. Currently the team is heavily reactive, excel, email, and teams based. My very first job in IT in 2014 I worked two years without a help desk system and I never want to go back to that. I have been here six months just doing basic trainings, excel projects like sorting data and testing scripts for people who need it done. There is no structure to really any of this and often I don't even get a date when the thing is due or why I am working on it. I do have clear goals set like test this project. But sometimes I get little duties to clean or fix datasheets in excel etc... \n\n**The Avalanche of Emails Friday Afternoon:**\n\nThis past week I had to work on three projects and it got down to the wire. Friday afternoon I was still updating code, scripts, and testing a feature with constant pushback from stakeholders and leadership (if something changed in the excel after approval etc). Different parties sending me different emails with different results. This happens often and then we have meetings to clarify.\n\nSo after I finished all my work at 3 PM I decided to look around the agency's tools to see what was being underutilized and not up to date. I live in the intersection of IT and dev so I have some admin rights to a lot of the cloud software jira, servicenow etc... \n\n**What I have done/working on:**\n\nWe had project boards in jira and wikis that haven't been updated since 2023. We don't utilize tasks or time tracking in jira. I started doing this on friday and showed my leadership who was pleased to see this functionality. Before the tracking board I would send my boss a report of what I did each day. \n\n**What we don't have:**\n\nWe don't have approvals or workflows for my team set up in servicenow (mostly because nobody knows how but i certainly can build it with the right research). I have also requested to work with the development team to get this access or even to work with the team more.\n\n**Tasks are discussed and done via memory and hardly any documentation:**  \n\nMy question is is this often what happens on the PM track? We are a small team consisting of two division chiefs and myself. We work with a few other teams like dev, and various branches of IT. I don't believe they have a centralized system or trusted source of knowledge either. A lot of things are done on the fly based on memory. Most of the teams meetings are about remembering what they did years ago with scattered documentation nobody knows exists.\n\n**What's the best way to setup a formalized intake process for the team?**\n\nIs there anything else I should focus on? I am thinking that I need to have a formalized intake process each of these teams need to utilize when they request something or change something that relates to our team. This for better auditing and tracking. \n\nAny other tips or suggestions would be very useful and appreciated. ",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/projectmanagement/comments/1qz0cvi/as_a_new_pm_am_i_doing_setting_things_up_the/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o47f9ll",
          "author": "AutoModerator",
          "text": "Attention everyone, just because this is a post about software or tools, does not mean that you can violate the sub's 'no self-promotion, no advertising, or no soliciting' rule.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/projectmanagement) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-08 05:20:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o47grci",
          "author": "Old_Cry1308",
          "text": "sounds chaotic. set up a simple intake form for requests. track everything in jira. documentation is your friend. revisit processes and keep stakeholders in the loop.",
          "score": 3,
          "created_utc": "2026-02-08 05:32:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o47h8ie",
              "author": "moderatenerd",
              "text": "Yes It was manageable when all I had to do was a simple chart or training a week, but now I guess my leadership knows I am capable so they are dumping more in my lap. I know they want me more on the development side (promotion hopefully) of things anyway so that sounds good. I hope I can create a good intake form (guessing this can be done in jira), and show the other teams not to be afraid of it either. Basically in my It jobs I would be the person to ignore everything that wasn't in the ticketing system. I love telling people to put it in the system and I will look at it then.",
              "score": 0,
              "created_utc": "2026-02-08 05:36:06",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4b0wmw",
          "author": "Economy_Pin_9254",
          "text": "What you’re describing is pretty normal in teams that never really had structure to begin with. And yes, this *is* often what the start of a PM role looks like in places like this.\n\nThe problem isn’t Jira vs ServiceNow vs Excel. It’s that work is coming at you with no clear why, no real deadline, and no one actually owning the decision. That’s why everything blows up late on Fridays — urgency gets manufactured at the end because it was never framed properly at the start.\n\nWhat you did by reviving boards and tracking work is fine, but be careful here. The fastest way to burn out is becoming the person who builds structure *for everyone* without the authority to enforce it. That turns you into the system instead of the system doing the work.\n\nOn intake — your instinct is right. But keep it simple. You don’t need a heavy process. You just need a gate. \n\nEvery request should answer:\n\n* what’s being asked, \n* why it matters, \n* when it’s needed, and \n* what happens if it doesn’t get done. \n\nIf it can’t answer those, it’s not ready. Full stop.\n\nI’d hold off on building fancy workflows for now. Not because they’re bad, but because automating chaos just makes chaos faster. Until there’s agreement on how decisions get made, tooling won’t fix much.\n\nA lot of what you’re feeling is just seeing the mess clearly for the first time. That’s not failure — that’s awareness. The trick is deciding which problems you surface and which ones you don’t try to personally absorb.\n\nFocus on fixing how work *enters* the system. If you get that right, everything downstream gets easier. If you don’t, no tool will save you.",
          "score": 2,
          "created_utc": "2026-02-08 19:43:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o47f9ml",
          "author": "AutoModerator",
          "text": "Hey there /u/moderatenerd, have you checked out the [wiki page](https://www.reddit.com/r/projectmanagement/wiki/index) on located on r/ProjectManagement?  We have a few cert related resources, including a list of certs, common requirements, value of certs, etc.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/projectmanagement) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-08 05:20:25",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r0k8r2",
      "title": "Program Managing a Tech Transformation",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1r0k8r2/program_managing_a_tech_transformation/",
      "author": "Spiritual_Mistake579",
      "created_utc": "2026-02-09 23:25:17",
      "score": 7,
      "num_comments": 9,
      "upvote_ratio": 0.9,
      "text": "I have been in a program manager role for our cloud native transformation. This has been easily the most challenging year of my life and every day I feel like I am failing. Anyone else running a program like this? How are you surviving? Biggest challenging is not being able to keep up with how fast things move, and constant disconnects at the leadership level also very difficult to keep up with. ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/projectmanagement/comments/1r0k8r2/program_managing_a_tech_transformation/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o4j9k8s",
          "author": "More_Law6245",
          "text": "Firstly, take a breath as this is pretty typical for some program manager roles and it may also be further complicated by low organisational maturity in the project delivery framework, particularly when it comes to roles and responsibilities within the program. I have found in the past when I've auditing organisations the key disconnect was the communication paths along with expectations around when and what was being communicated. \n\nI might suggest is work with your leadership team and find out what is and is not working for them and work backwards from there to see if it's a process or procedure issue. Assess the communication paths and the right information being conveyed in the appropriate format and frequency.  As an example I had audited one program where the program manager was literally cutting an pasting from technical resource documentation for executive reporting and the executive where not reading or responding because A) it was too technical for them B) the exec were unsure on what the PM was communicating and what he was expecting C) the exec where to embarrassed to say anything and that they didn't understand it and to cap it off all under a compressed timeframe. Long story short a total disconnect and the impact was key decision were not being made on the program's critical path.  \n\nSimplification is your answer, if things are moving quickly you need understand why, was the business case fit for purpose? The golden rule is the amount of variation is a quality indicator on the business case (and  project plan) focus on the control your triple constraint of time, cost and scope. If there are a lot of changes then you need to ask why? Was the scope and requirements captured correctly? Are you rushing to meet a timeline or expectation? Who is accepting the risk of that? If there is scope change you need to ultimately understand and control it. Also understanding why and who is making changes, start setting expectations and enforcing the triple constraint e.g. if scope changes, then so does time and cost! It's also a very simple litmus test to see if the change is really warranted if you highlight it's impact of it's going to take more time and money on a whim, you find out very quickly if a RFC is really needed or not. \n\nYour project controls of issues and risk coupled with your status reporting should realistically be painting a very clear picture and highlight the amount of variation or change that is occurring. But with that said you also need to enforce roles and responsibilities in order to control the unscheduled changes. I suppose the key question I have, did you have an approved baseline program of work? and are you only just managing the exceptions?  \n\nJust an armchair perspective.  ",
          "score": 5,
          "created_utc": "2026-02-10 01:03:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4j19n4",
          "author": "Unusual_Ad5663",
          "text": "Complex programs have caused a lot of sleepless nights. You said you’re having trouble keeping up. Been there. What helped was shifting from “keep up” mode to getting ahead of leadership disconnects. The big aha was realizing the disconnect was ours, not theirs. Once we owned that, it changed how, what, and when we communicated, and we became much more intentional about the role we needed them to play.\n\nI learned a lot from the ROPE framework on managing up.",
          "score": 4,
          "created_utc": "2026-02-10 00:16:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ofvz6",
              "author": "weareabassi",
              "text": "Where can I learn more about this framework?",
              "score": 1,
              "created_utc": "2026-02-10 20:28:10",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4oddgd",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 5,
          "created_utc": "2026-02-10 20:16:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4qjnp5",
              "author": "Passionfruit4Life",
              "text": "This is an absolutely incredible comment and gave me such hope and perspective as I am managing a similar project to OP, and constantly feel like I’m drowning and failing. But every time I am able to drive a decision, I see the light.  So this really resonates. It’s less about managing the delivery as you said, which feels so counter intuitive as I’m so execution focused, but this requires a heavier level of governance and oversight, and less on the actual delivery managing.",
              "score": 2,
              "created_utc": "2026-02-11 03:19:37",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4nvu6b",
          "author": "Magnet2025",
          "text": "Have there been any analysis of the impact to the users of this transformation? \n\nThis is something that needs to be addressed to avoid post-implementation challenges.",
          "score": 1,
          "created_utc": "2026-02-10 18:55:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4vaen1",
          "author": "Live-Gift-731",
          "text": "Did one for 2.5 years and almost felt like smashing my laptop.\n\nDelivered it finally and became a plain simple scrum master,life is easier now..",
          "score": 1,
          "created_utc": "2026-02-11 21:09:04",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r2oa84",
      "title": "MS Planner Goals capped at 10",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1r2oa84/ms_planner_goals_capped_at_10/",
      "author": "legitmonk",
      "created_utc": "2026-02-12 08:40:50",
      "score": 3,
      "num_comments": 7,
      "upvote_ratio": 1.0,
      "text": "I'm posting this to find out if I'm understanding this correctly. I understand that Goals on MS Planner are capped at 10; would be nice to configure this manually but they're trying to enforce focus, gotcha. But I noticed that closing out a Goal still counts towards the cap, meaning that if I closed 10 goals, I'll *still* not be able to create new Goals and will be forced to create a new Project. Is this correct? That doesn't make sense. Copilot is suggesting I take screenshots of closed Goals and then delete them. Are we cavemen",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/projectmanagement/comments/1r2oa84/ms_planner_goals_capped_at_10/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o5301wy",
          "author": "timevil-",
          "text": "I laugh in one hand (splendidly articulated btw), and cry in another as I was going to configure Goals soon. But after reading your post, I'm now leaning towards aligning with strategic goals. Ramifications for not closing goals...?",
          "score": 1,
          "created_utc": "2026-02-13 00:52:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o536vjj",
          "author": "Magnet2025",
          "text": "One of the reasons, as a  Microsoft Project Online/Server consultant, I decided to reskill as Adoption and Change Management. \n\nI had little confidence that the new tools would support PMs as much as much it would support sales.",
          "score": 1,
          "created_utc": "2026-02-13 01:33:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5469cm",
              "author": "legitmonk",
              "text": "This is sad to hear, closest to the truth are those that work within the company to promote the tools they find issues with themselves and are powerless to change it. I've been there too in another company",
              "score": 1,
              "created_utc": "2026-02-13 05:26:41",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5404ms",
          "author": "Fantastic-Nerve7068",
          "text": "yep ran into this too and it’s honestly wild that closed goals still count toward the cap like what’s the point of finishing work if the system punishes you for it moved our team to celoxis partly because of stuff like this the way it handles goals milestones and reporting is actually built for grown up project tracking not just lightweight task lists",
          "score": 1,
          "created_utc": "2026-02-13 04:41:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o54mnjr",
          "author": "Maro1947",
          "text": "Is that in advanced ?",
          "score": 1,
          "created_utc": "2026-02-13 07:46:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o54q04b",
              "author": "legitmonk",
              "text": "I went to MS documentation now to understand what \"Advanced\" entails, are you refering to the paid plan? The templates I see are different than their documentation, so I'm thinking the recent changes might still be very new and they're working on updating and improving it. I selected \"Project Manager\" which is in Preview, so assuming it's Premium but also very new. Goals appear in this template.\n\nMS Documentation: [Advanced capabilities with premium plans in Planner - Microsoft Support](https://support.microsoft.com/en-us/office/advanced-capabilities-with-premium-plans-in-planner-6cdba2aa-da06-4e08-be4c-baaa4fda17ba)\n\nhttps://preview.redd.it/pll3c4vx08jg1.png?width=1014&format=png&auto=webp&s=4da22d9b57f69144469a1efee47dec5529b18041\n\n",
              "score": 1,
              "created_utc": "2026-02-13 08:17:20",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o59l9m4",
                  "author": "Maro1947",
                  "text": "Yeah. It's premium \n\nTBH, I create a master schedule and Timeline view in Project for high level review then do my tasks allocation in Planner basic\n\nIt works really well and isn't a lot of work to maintain\n\nI generally run 3 - 10 projects this way at a time",
                  "score": 1,
                  "created_utc": "2026-02-14 01:11:19",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1r31boh",
      "title": "How do you make tamplate for specification document and what should one contain?",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1r31boh/how_do_you_make_tamplate_for_specification/",
      "author": "doli-loli",
      "created_utc": "2026-02-12 18:30:42",
      "score": 3,
      "num_comments": 8,
      "upvote_ratio": 0.71,
      "text": "I am begginer PM and I have a task to make specification document that team for development will fill out with specification. Does this document have to contain introduction, pitpos of the document. I don't know what I should type in this document myself. \n\nIt shouldn't be onepager or table, it has to be in depth specification.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/projectmanagement/comments/1r31boh/how_do_you_make_tamplate_for_specification/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o51e4v3",
          "author": "More_Law6245",
          "text": "As a PM you should be asking those who will be using the document and determining what information needs to be captured. This is what a PM does is leverage those people around them to help deliver something because you may or may not have the skills yourself.  This is about understanding roles and responsibilities and how to engage resources for assistance in delivering something. \n\nMaking assumption as a PM is the worst thing you can do and to be honest it wastes everyone's time and money. There is an approach that I always take, if I'm unsure I will pull something together of what I think needs to be in the document then I send it out for review and feedback, it's a quick way to get buy in from the relevant stakeholders. ",
          "score": 3,
          "created_utc": "2026-02-12 19:53:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o52idlv",
          "author": "pmpdaddyio",
          "text": "Why would you or your team develop specifications. This is entirely customer driven. It can come in the form of an RFI or RFP, or just straight up spec sheet. \n\nI think you mean requirements.\n\nBusiness requirements - mapping to the SOW or specs telling the client you understand their specs and mapping them to a business need.  Usually usually contains a problem statement, an as is, to be portion, and any understood client concerns. \n\nFunctional requirements - internal mostly where you address how it will work. Usually contains high level process info in the form of flow charts, maybe some DB schemas, etc. \n\nTechnical requirements - internal only. It’s the guts of the system. Maybe your code structure, libraries, testing scripts, etc.",
          "score": 3,
          "created_utc": "2026-02-12 23:11:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o51mvhf",
          "author": "agile_pm",
          "text": "I agree that AI can be good for templates.  Just keep in mind that you might end up with more or less than you need.\n\nIf you're a member of PMI, you can also log into [projectmanagement.com](http://projectmanagement.com) and download templates for free.  I believe these are user contributed, so don't just assume they're perfect, either.\n\nI've had a book on my shelf for years - Software Requirements, 2nd edition, by Karl Wiegers.  At the back of the book he provides a detailed specification template.  It's more than I've ever needed, but if you want a deep understanding of what can be included, it's a good reference.",
          "score": 2,
          "created_utc": "2026-02-12 20:35:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o54c7dm",
          "author": "dhemantech",
          "text": "You can find many online as a start. Adding details may help you get better answers. With “development” I am assuming IT development activities. Are you a firm providing services to external customers or do you provide IT services to other departments of your own business/organisation.",
          "score": 2,
          "created_utc": "2026-02-13 06:14:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o54q0gy",
              "author": "doli-loli",
              "text": "We provide services to external customers.",
              "score": 1,
              "created_utc": "2026-02-13 08:17:25",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o54zuh8",
                  "author": "dhemantech",
                  "text": "Someone else already mentioned it, just repeating. Many organisations who come to you will have their own templates.",
                  "score": 1,
                  "created_utc": "2026-02-13 09:50:57",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o51lrqc",
          "author": "Suchiko",
          "text": "A non exhaustive list, but: who is the customer, what are the deliverables, quality expectations, expected activities, dates, budget, who approves the spec, who are the stakeholders, who approved delivery acceptance, what is cadence of meetings?",
          "score": 1,
          "created_utc": "2026-02-12 20:30:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o51dupu",
          "author": "ntufar",
          "text": "Honestly, these days if there is no template ready in the organization, I use AI. Just describe what you want to the AI tool of your choice and it will generate you a good enough template.",
          "score": 1,
          "created_utc": "2026-02-12 19:52:12",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r1mzad",
      "title": "Contract/RFx process mapping or flow charts",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1r1mzad/contractrfx_process_mapping_or_flow_charts/",
      "author": "GroundZer0o",
      "created_utc": "2026-02-11 03:56:55",
      "score": 3,
      "num_comments": 1,
      "upvote_ratio": 1.0,
      "text": "I'm looking for process maps or flow charts for various RFx documents. \n\nIs anybody able to share some that they currently use for RFP, RFT and RFQ? ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/projectmanagement/comments/1r1mzad/contractrfx_process_mapping_or_flow_charts/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o4saxqf",
          "author": "evangelicalfuturist",
          "text": "My partners and I have built and reviewed a lot of RFx documentation over the years on both sides of the table (buyer and supplier), and the most common gap isn’t the document itself, but the decision gates around it. \n\nAt a high level, most effective RFx processes follow a structure like this:\n\n\t1.\tDemand validation (why are we issuing this?)\n\t2.\tScope clarity checkpoint\n\t3.\tMarket engagement strategy (RFP vs RFQ vs RFT decision)\n\t4.\tEvaluation criteria definition before release\n\t5.\tStructured Q&A governance\n\t6.\tCommercial + delivery risk assessment (not just price scoring)\n\t7.\tPre-award execution feasibility review\n\t8.\tExecutive decision gate with documented assumptions\n\nThe biggest failures we see happen at steps 2, 4, and 6.\n\nIf helpful, more than happy to chat!",
          "score": 2,
          "created_utc": "2026-02-11 12:06:33",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}