{
  "metadata": {
    "last_updated": "2026-02-16 09:18:16",
    "time_filter": "week",
    "subreddit": "projectmanagement",
    "total_items": 20,
    "total_comments": 218,
    "file_size_bytes": 246953
  },
  "items": [
    {
      "id": "1r3x043",
      "title": "tried to document all our processes and realized half of them only exist in people's heads",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1r3x043/tried_to_document_all_our_processes_and_realized/",
      "author": "SideQuestDentist",
      "created_utc": "2026-02-13 18:28:35",
      "score": 158,
      "num_comments": 51,
      "upvote_ratio": 0.98,
      "text": "Started a documentation project thinking it would take a few weeks and here I am three months later understanding why companies hire consultants for this. Every time I ask someone how they do something the answer is \"it depends\" followed by fifteen edge cases, stuff that's supposedly standardized has three different versions depending on who you ask, and critical knowledge lives entirely in the heads of people who could leave tomorrow.\n\nThe scary part is we function fine day to day but if certain people left we'd be scrambling to figure out how basic things even work. Anyone else realized how fragile their operations actually are when you look closely at them?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/projectmanagement/comments/1r3x043/tried_to_document_all_our_processes_and_realized/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o595rmp",
          "author": "brye86",
          "text": "The real problem with processes is once they’re documented. Who follows them? People will only read and follow so much. You can have a document on how to make tea and coffee but no one is reading it.  Too much documentation becomes useless.  Too little documentation you become lost.",
          "score": 29,
          "created_utc": "2026-02-13 23:37:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5ba476",
              "author": "Turkishblokeinstraya",
              "text": "Striking a balance is key! Overdocumentation is a massive waste just like underdocumentation.\n\nI usually ask teams what legacy they'd appreciate if they were starting tomorrow. That's the stuff that is worth documenting.",
              "score": 4,
              "created_utc": "2026-02-14 09:03:14",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o5g1gky",
              "author": "nneighbour",
              "text": "I work with a team that has hundreds of pages of documentation. The process of how to create and update the project sheets is 30+ pages. It’s utterly useless because there is no way someone is reading 30 pages for a relatively quick task and it’s for impossible for them to keep up to date.",
              "score": 2,
              "created_utc": "2026-02-15 02:41:04",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o592yz8",
          "author": "shampton1964",
          "text": "As one of those consultants, while it is Very Important to find out how people are doing the job, it is ALSO Important to figure out how they could best be done to eliminate edge conditions, ensure routine function, and so forth. \n\nThat's why us old heads say there is an art to this!",
          "score": 16,
          "created_utc": "2026-02-13 23:20:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o57n1p3",
          "author": "sdarkpaladin",
          "text": "Sir.\n\nMy company is so lean, my projects usually have a bus factor of  one.\n\nAnd it ain't me.",
          "score": 14,
          "created_utc": "2026-02-13 18:57:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o57ppz4",
              "author": "ExtraHarmless",
              "text": "I love the name \"bus factor\"",
              "score": 5,
              "created_utc": "2026-02-13 19:09:55",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o588rbh",
                  "author": "tofer85",
                  "text": "Could be the lottery factor if you are a glass half full kind of person…",
                  "score": 2,
                  "created_utc": "2026-02-13 20:44:38",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o581hga",
          "author": "PplPrcssPrgrss_Pod",
          "text": "That's not good. Need to get that knowledge onto a workflow diagram or other document. Also good to build into your systems.\n\nWhat I've found helpful is that we capture the processes aligned to positions or skillsets, not individual people. People leave and mostly positions stay in place.\n\nGodspeed.",
          "score": 14,
          "created_utc": "2026-02-13 20:08:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o57jfjq",
          "author": "tubaleiter",
          "text": "Absolutely - we’re on an automation kick, and then you realise the “standard” is an exception, and myriad exceptions are the rule. How the fuck do you automate that clusterfuck?",
          "score": 12,
          "created_utc": "2026-02-13 18:39:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o57movb",
              "author": "joseph_sith",
              "text": "In my experience the team owning the process has to be willing to re-evaluate it from the ground up, and try to shift away from accommodating edge cases. Sometimes edge cases are valid, but I find that many in my organization exist due to technology limitations, or because “that’s just how we do it” and no one has re-validated the process in over a decade. I’m a big believer that transitioning any manual process to automation should include uplift to the process itself (but maybe my org is unique in the insanity of our manual processes lol)",
              "score": 3,
              "created_utc": "2026-02-13 18:55:19",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o57o46n",
                  "author": "tubaleiter",
                  "text": "Totally makes sense - we’re still stuck in the fun of fighting over who owns each process, too.",
                  "score": 3,
                  "created_utc": "2026-02-13 19:02:04",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o57m2qm",
              "author": "Defy_Gravity_147",
              "text": "By keeping every variable coherent to its scope.",
              "score": 0,
              "created_utc": "2026-02-13 18:52:26",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o57zxk6",
          "author": "painterknittersimmer",
          "text": "So half of them are actually documented!? Damn, I'd kill for that. ",
          "score": 10,
          "created_utc": "2026-02-13 20:00:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o58kwzo",
              "author": "RhesusFactor",
              "text": "Yeah. I was at a place that wanted to get some process. But they did Agile and believed in people over process, products over documents. So when their key people left they had none of the above. And I was asked to reinvent the processes without knowing what they did.",
              "score": 3,
              "created_utc": "2026-02-13 21:44:45",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o58p0fu",
                  "author": "painterknittersimmer",
                  "text": "Ah, gotta love Agile",
                  "score": 2,
                  "created_utc": "2026-02-13 22:04:53",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o581836",
          "author": "SVAuspicious",
          "text": "Some people are afraid that documenting what they do puts their jobs at risk. I put requests for documentation in terms of \"what if you get hit by a bus?\" \n\nThe problem is not time critical. The product is not supposed to win a Pulitzer prize. Often bullet lists are fine. \n\nI've been through this several times. I haven't needed consultants. A long timeline is fine. ",
          "score": 12,
          "created_utc": "2026-02-13 20:06:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o582k7x",
              "author": "kawasaki03",
              "text": "I frame it like, \"What if you win the lottery and leave?!\" Makes them a bit more enthusiastic to document, for whatever reason!",
              "score": 5,
              "created_utc": "2026-02-13 20:13:26",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o58kel5",
                  "author": "RhesusFactor",
                  "text": "Ah the old lotto bus",
                  "score": 3,
                  "created_utc": "2026-02-13 21:42:16",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o591cp6",
              "author": "Desert_Fairy",
              "text": "I like to frame it as “what if you get offered your dream job in Hawaii?  How long do you want to take to do a handover before moving on?”\n\nThat way it is less guilt for leaving problems behind and more “it will be a hassle for you and be a barrier between you and your happiness.”",
              "score": 3,
              "created_utc": "2026-02-13 23:11:28",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o57nkrk",
          "author": "timevil-",
          "text": "Tribal Knowledge = Deadly",
          "score": 9,
          "created_utc": "2026-02-13 18:59:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o57o28x",
          "author": "Equivalent_Memory3",
          "text": "I'm three years into attempting to document and revise our processes. When I started, the SOPs referenced processes and forms that didn't exist.\n\nSometimes ya just gotta start with a very simple processes just to get it on the books for people to review.",
          "score": 9,
          "created_utc": "2026-02-13 19:01:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o58pesl",
          "author": "todfish",
          "text": "Yeah but in reality how thoroughly can documented and enforced processes actually inform the real life day to day work? \n\nI feel like I come up against this issue all the time: \n\nA lack of documented processes is identified and this scares everyone (mostly management) > There’s an effort to establish set processes > Experienced pm’s resist that effort because it doesn’t perfectly fit what they know to be effective (for them) > The processes put in place are incomplete and not really fit for purpose > Experienced pm’s continue to ignore them and do their own thing > Inexperienced pm’s try to follow the processes / framework but frequently miss the point and get tripped up by all the gaps (win the battles but lose the war). \n\nUnless you’re in an industry / organisation that only uses their pm framework to deliver a narrow range of project types, I just don’t think you can feasibly process your way out of the need to have high performing pm’s who are given the freedom to **do what needs to be done, in order to deliver the desired outcome.**\n\nAt the end of the day, project management can be extremely complex and varied. The best pm’s I’ve worked with take the time and make the effort to understand the mission, then build the project accordingly. That means the project is structured in a way that fits their style of project management. No one is ever going to be more across the needs of a project than the pm, so if they’re forced into a process that doesn’t suit their style or the needs of the project then things will fall apart fast.\n\nTLDR: Establishing processes can provide useful guidelines, but they can also stymie the work of good pm’s and create a false sense of security for bad pm’s and management. There are often good reasons why certain processes are not set in stone and why some pm’s and some projects do things differently.",
          "score": 8,
          "created_utc": "2026-02-13 22:06:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o57htjq",
          "author": "Sea_Weather5428",
          "text": "The \"it depends\" thing is where the actual complexity lives and it's genuinely hard to write down in a way that covers all the scenarios.\n\n  \n",
          "score": 8,
          "created_utc": "2026-02-13 18:32:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o57vdqm",
          "author": "eredinso",
          "text": "I worked as a Knowledge Manager for years and then consulted in the space (my heart goes out to you for taking this on hahaha), and every company without a KM or at least a long-time consultant has this problem. All of them.\n\nSo many aspects of business operate with ambiguity and nuance and those are the things that kill effective documentation.\n\nBecause of that, effective documentation **cannot** happen in a silo by someone who only has the ability to document. If processes need to be documented, some processes will inevitably need to be *changed* in order to be documented. Not every process can be a massive decision tree, so not every edge case can be catered to. Process optimization should happen first, documentation after.",
          "score": 6,
          "created_utc": "2026-02-13 19:37:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o58e4ts",
          "author": "More_Law6245",
          "text": "I remember doing a consultancy gig, I was auditing and assessing PMO organisational performance and when I first turned up the team handed over all of their organisational policy process and procedures for review and assessment. It was like seeing my client  like a 5 year old on their first day of school and when I had finished my initial audit it was like seeing a high school teenager with a month of detentions. \n\nWhat the organisation thought they knew and what they actually did where actually completely two different things, what they had done was document a version of reality that reflected nothing like what they actually did.  It was the biggest organisational disconnect I'd actually seen in the corporate space and what made it worse was it was a federal public service organisation.  So OP, you're not alone but I would suggest be careful not to follow the rabbit down the hole, keep every thing high level and let the respective teams drill down on their own and you just set a framework for them to work towards. ",
          "score": 6,
          "created_utc": "2026-02-13 21:11:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o58jyha",
          "author": "Rosyface_",
          "text": "Yeah my org is running into this over the past year or so. Multiple single points of failure and all those people are retiring. Massive problems incoming, I predict. Especially when one of the data engineers is the only person holding together an entire legacy system the entire place relies on for literally everything. That system goes down and we’re fucked. He’s retiring in May.",
          "score": 7,
          "created_utc": "2026-02-13 21:40:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5humtu",
              "author": "Salkha786",
              "text": "Just curious, do you job hunt in a situation like this?",
              "score": 1,
              "created_utc": "2026-02-15 12:07:21",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5huxr3",
                  "author": "Rosyface_",
                  "text": "I’m not planning to, I like my job and have no reason to job hunt. These things are not my problem to solve. I show up, progress my projects, log these things as risks, but I can’t fix staffing and documentation issues in other departments. If it affected me to the extent that I hated going to work or similar, then I’d look for something new.",
                  "score": 2,
                  "created_utc": "2026-02-15 12:09:55",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o59uzpm",
          "author": "Ok-Pair8384",
          "text": "These AI posts are getting subtler, but still ends the prompt with an open ended question.",
          "score": 24,
          "created_utc": "2026-02-14 02:13:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o58vxu1",
          "author": "PickleNick1987",
          "text": "Stop focusing on how things get done. A process should define what happens. More specifically, what is supposed to happen, what roles interact with it, what triggers it to start, what triggers it to end (likely the action is a handoff) and what are metrics in place to evaluate to measure/validate success. If someone new steps into the role or you switch systems, it does not change what the process is. \n\nHow it gets done only matters if some internal or external factor requires it, and in most cases, regulatory or compliance requirements.\n\nWent thru the same thing recently and that mindset shift has really helped simplify things for me and others",
          "score": 14,
          "created_utc": "2026-02-13 22:41:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o58yt25",
              "author": "dapper_pom",
              "text": "...if someone does twice the amount of work that is needed to do the thing, you don't think it is something that should be adressed? I think it absolutely matters how things get done.",
              "score": 9,
              "created_utc": "2026-02-13 22:56:58",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o59v5hn",
                  "author": "PickleNick1987",
                  "text": "That’s why you have measurable expectations (metrics) in place to evaluate if someone’s way of doing things is working",
                  "score": 1,
                  "created_utc": "2026-02-14 02:14:14",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o57moc9",
          "author": "Brodrick_Rolfson",
          "text": "Any good process has room for flex but not ambiguity. I complety feel this and its frustrates me to no end.",
          "score": 5,
          "created_utc": "2026-02-13 18:55:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o57xclt",
          "author": "Childish_Tycoon_Ship",
          "text": "I like to call that, \"Job security\"",
          "score": 5,
          "created_utc": "2026-02-13 19:47:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o58plne",
          "author": "jd2004user",
          "text": "It’s not PC to say but tribal knowledge is unfortunately something a great many orgs rely on. So much is lost when key individuals leave though the orgs have only themselves to blame.",
          "score": 4,
          "created_utc": "2026-02-13 22:07:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5bgieu",
              "author": "claracolt",
              "text": "implicit knowledge is the phrase you want, as in understood widely but not documented explicitly.",
              "score": 4,
              "created_utc": "2026-02-14 10:06:33",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o5cc8jo",
              "author": "SeaManaenamah",
              "text": "Are you saying the word \"tribal\" is not politically correct?",
              "score": 1,
              "created_utc": "2026-02-14 14:17:49",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5ciaw2",
                  "author": "jd2004user",
                  "text": "“\"Tribal knowledge\"—referring to undocumented,,,, institutional knowledge shared by word-of-mouth—is considered by some to be offensive, as it can be seen as disrespectful to Indigenous peoples and their cultural practices. \n\nWhile often used in business to describe team camaraderie, or knowledge silos, many organizations are replacing it with more inclusive terms like \"shared knowledge\" or \"institutional knowledge\". \n\nKey considerations regarding the phrase:\nCultural Sensitivity: Using \"tribe\" in a business context can be offensive to Indigenous peoples.\nAlternative Terminology: \n\nTo promote inclusivity, consider using alternatives such as:\nInstitutional knowledge\nAssumed knowledge\nUnwritten knowledge\nTeam knowledge\n\nBusiness Context: In manufacturing and IT sectors, the term describes informal, undocumented information that poses risks of inefficiency, such as relying on a single employee's, experience or , potential knowledge gaps.\n\nAlternative View: Some, debate exists on whether it is inherently offensive, as it does not explicitly target a specific, demographic group.”",
                  "score": 4,
                  "created_utc": "2026-02-14 14:52:58",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o57hdms",
          "author": "OppositeJury2310",
          "text": "Forcing standardization through tools for routine stuff first helped us, like phone intake through sonant means the process is whatever sonant does and scheduling through calendly means availability is whatever the calendar rules allow. There's less to document because the system is the documentation, if that makes sense. Same thing with our intake forms in typeform, the form itself defines what information we collect so there's no \"it depends on who answers\" variation anymore. Harder with judgment based tasks obviously but for the routine repetitive stuff, picking a tool and letting it enforce the process eliminated a ton of tribal knowledge that was impossible to write down anyway.\n\n  \n",
          "score": 4,
          "created_utc": "2026-02-13 18:30:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o57iz7y",
              "author": "Goggio",
              "text": "This is the way. \n\nFocus on \"where is the rework happening and how can we stop it\" ; you'll end up with 90% of your problems solved and people will be happy because almost all of the solves will end up documented with clear steps... fuzzy sops are absolutely fine in small teams of experts and when a true sop is needed you already have buy in and a baseline starting point.",
              "score": 2,
              "created_utc": "2026-02-13 18:37:45",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o57yvk4",
          "author": "therealvitocornelius",
          "text": "see this is the fun part though, processes aren’t defined by analysts, they’re defined by the people doing the work. I’m not saying that’s necessarily the right way to do the work, but edge cases are still use case cases and still need to be documented. You’re just getting into the meet of the problem. The more you simplify these processes down, the more on the same page the people doing the work will be. As somebody else mentioned this is job security for you",
          "score": 5,
          "created_utc": "2026-02-13 19:55:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o58lp3j",
          "author": "RhesusFactor",
          "text": "Yeah. Some places are just an oral tradition and do nothing repeatable. I had to stop my director once and risk my job to say 'you don't need a pmo, you need a business plan'",
          "score": 3,
          "created_utc": "2026-02-13 21:48:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o580b35",
          "author": "Low_Friendship463",
          "text": "Yup that's fairly typical...I've been at my company for a year and any time I think of something I ask \"do we...\" Or \"where is...\" And usually get a response of yeah we need to get that more aligned...and we do as a PM team do work on it but they were a small team, building up as the business has grown so we're in the beginning stages.. I've already suggested that we start building towards a PMO level repository of documents just in case we need something heavier than an email confirmation from a sponsor.",
          "score": 2,
          "created_utc": "2026-02-13 20:02:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o58irbm",
          "author": "040422",
          "text": "My fave is when they say how standardized the org is, rigor, processes and the actuality is no one is doing the same thing…the standard doesn’t exist except in the mind of the PMO manager. Heaven help you when you ask about this….ask me how I know",
          "score": 2,
          "created_utc": "2026-02-13 21:34:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5g72p5",
          "author": "Adventurous-Dog-6158",
          "text": "I worked at an org where they managed by exception because they usually caved in to customer demands so just about every product X sold was customized for each customer. Every time they brought on a new customer, it was a scramble to customize the product. The product was not designed to have that much customization. And of course documentation was usually the last thing on anyone's to do list. \n\nMost people think that the terms complex and complicated are synonymous, but they are not. It's not complex to reverse engineer a process, but it can be complicated and take a lot of time. Basically anything that any human has done, some other human or group of humans can reverse engineer it. So if the shitz hit the fan, the org can call in high priced consultants to figure things out.",
          "score": 2,
          "created_utc": "2026-02-15 03:20:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o57h32h",
          "author": "AutoModerator",
          "text": "Hey there /u/SideQuestDentist, have you checked out the [wiki page](https://www.reddit.com/r/projectmanagement/wiki/index) on located on r/ProjectManagement?  We have a few cert related resources, including a list of certs, common requirements, value of certs, etc.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/projectmanagement) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-13 18:28:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o57ygo1",
          "author": "pmpdaddyio",
          "text": "Then create and document your own process.",
          "score": 1,
          "created_utc": "2026-02-13 19:53:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o591lb4",
          "author": "Naive-Apartment-521",
          "text": "You've discovered what most orgs don't want to admit: they're running on institutional memory, not systems. It depends is the sound of undocumented decision trees, and three different versions means process drift with no governance. You're not behind schedule, you're doing archaeology.\n\n**What's actually happening**: Your processes evolved organically (which works) but never got codified (which doesn't scale). People built workarounds, edge cases became standard practice, and no one had authority or time to reconcile the versions. Now you're trying to document a living system that's still mutating.\n\n**Framework to tame this (without hiring consultants):**\n\nStop trying to document everything at once\n\nPrioritize by risk: What breaks if \\[key person\\] leaves tomorrow? Start there. Document the top 5 critical processes first, then expand.\n\nUse the **decision tree** method for **it depends** answers\n\nWhen someone says **it depends**, ask: What are you checking to decide?\n\nMap it as: IF \\[condition\\], THEN \\[action\\]. ELSE \\[alternative action\\].\n\nExample:\n\nIF client is under contract, THEN route to Account Manager\n\nELSE IF inbound lead, THEN route to Sales\n\nELSE route to Support\n\nCreate a **source of truth owner** for each process\n\nAssign one person as the authority for each process. When versions conflict, that person decides. Update the doc, notify the team, archive old versions.\n\n**Build a process changelog**\n\nEvery time a process changes, log: What changed | Why | Who approved | Date\n\nThis prevents I thought we still did it the old way confusion.\n\n**Run a knowledge transfer audit**\n\nList your top 10 critical processes. For each, ask: If \\[owner\\] left, who could do this? If the answer is no one, that's your red flag list.  If you'd like some additional ideas, I'm happy to share.",
          "score": 1,
          "created_utc": "2026-02-13 23:12:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5nfsxc",
          "author": "FishingSuitable2475",
          "text": "The realization that your operations are held together by \"tribal knowledge\" rather than documented systems is the moment most companies transition from a \"scrappy startup\" to a professional organization. When critical processes exist only in people's heads, you aren't just facing a documentation debt you're carrying a massive hidden risk that scales with every new hire.  \n  \nThe most effective way to solve this in 2026 isn't to hire a consultant for a three-month audit, but to implement a \"digital concierge\" that forces your processes into a standard logic. This is precisely why meetergo is so powerful for project managers; it doesn't just \"schedule meetings,\" it acts as a lead capture and qualification flow that encodes your business logic into every interaction. By defining the specific questions a lead must answer before they can even touch a calendar, you're effectively documenting your qualification criteria in real-time. Because it is 100% EU-hosted and GDPR-compliant, it ensures that your most sensitive operational data who you talk to and why is handled with a level of sovereignty and speed that legacy US-based tools simply can't match.",
          "score": 1,
          "created_utc": "2026-02-16 08:19:45",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r3eg3c",
      "title": "Looking for use cases for AI as project manager",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1r3eg3c/looking_for_use_cases_for_ai_as_project_manager/",
      "author": "One-Clue4444",
      "created_utc": "2026-02-13 03:30:58",
      "score": 52,
      "num_comments": 65,
      "upvote_ratio": 0.82,
      "text": "I am looking for ideas or use cases to implement AI - genAI or agentic or just automation using ms copilot/ GitHub copilot/ ChatGPT. \n\nCurrently, I actively use ms copilot to do ppt, documentation,MoM,  to find emails etc. ",
      "is_original_content": false,
      "link_flair_text": "General",
      "permalink": "https://reddit.com/r/projectmanagement/comments/1r3eg3c/looking_for_use_cases_for_ai_as_project_manager/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o58v43q",
          "author": "reallychilliguana",
          "text": "Why don't you ask the AI for ideas.",
          "score": 31,
          "created_utc": "2026-02-13 22:36:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5aqtpu",
              "author": "DaimonHans",
              "text": "LMAO 🤣",
              "score": 6,
              "created_utc": "2026-02-14 06:02:51",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o541r6p",
          "author": "[deleted]",
          "text": "[deleted]",
          "score": 30,
          "created_utc": "2026-02-13 04:53:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o545blc",
              "author": "heebs387",
              "text": "Man, I need to get on this train.",
              "score": 3,
              "created_utc": "2026-02-13 05:19:31",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o543jwh",
              "author": "AOmnist",
              "text": "Awesome! Have you considered Claude Code vs Claude we \n(which I assume you are using for the Claude Projects)?",
              "score": 2,
              "created_utc": "2026-02-13 05:06:15",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o54dup2",
              "author": "tardiskey1021",
              "text": "How did you get it to link to your in confluence? Does your organization have Enterprise security in the way ?",
              "score": 2,
              "created_utc": "2026-02-13 06:28:26",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o56mu9r",
                  "author": "collije",
                  "text": "I would be very very wary of linking company NDA items as a direct connection to a 3rd party tool or service, like GenAI.",
                  "score": 1,
                  "created_utc": "2026-02-13 16:03:51",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o54nggu",
              "author": "clickographer_",
              "text": "Looks interesting, Can you please help me if I DM you?",
              "score": 1,
              "created_utc": "2026-02-13 07:53:52",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o54ngi5",
                  "author": "AutoModerator",
                  "text": "Hey there /u/clickographer_, why not join the public conversation? Signaling a DM publicly is redundant\".\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/projectmanagement) if you have any questions or concerns.*",
                  "score": -1,
                  "created_utc": "2026-02-13 07:53:52",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o556w79",
              "author": "BlazedAndConfused",
              "text": "How does it “updates JIRA”?",
              "score": 1,
              "created_utc": "2026-02-13 10:55:29",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o55ncbq",
                  "author": "Smooth-Trainer3940",
                  "text": "Was wondering the same",
                  "score": 1,
                  "created_utc": "2026-02-13 12:58:42",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o5699uo",
              "author": "dude1995aa",
              "text": "Funny your flow,  will be releasing a product soon with outlook add-ins that will automatically upload teams transcripts for rag access, will have Jira and Lucidchart functionality, access to all project documentation through rag, ai testing tool, plus generation of sap related objects.  Chat tool based on ChatGPT reading all that project documentation.  Will have some data cleansing tools and ai automated template fillers with this tool.  The world is changing fast my friends.",
              "score": 1,
              "created_utc": "2026-02-13 14:58:19",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o55hp54",
          "author": "surrealcrow",
          "text": "I use it to vibe code full project features, I show my team of senior developers that their estimates are too high, they love it",
          "score": 11,
          "created_utc": "2026-02-13 12:21:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o55i3bk",
              "author": "picobar",
              "text": "Curious, missing a /s perhaps?",
              "score": 4,
              "created_utc": "2026-02-13 12:24:06",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o55ugq5",
                  "author": "surrealcrow",
                  "text": "Hehe yeah",
                  "score": 6,
                  "created_utc": "2026-02-13 13:40:10",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5657j2",
          "author": "Palegic516",
          "text": "I use it all the time to simulate executive questions and scrutiny and then help me come up with responses. I use it to draft emails a lot. read through contracts, and leases and pretty much any legal document and summarize, cite and evaluate risk. It’s great for calculating lots of numbers via screenshot or paste, if the documents aren’t in excel format. It can do some fairly complex math quickly to find where missing numbers are or errors in calculations. The list goes on",
          "score": 12,
          "created_utc": "2026-02-13 14:37:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o53zdgu",
          "author": "cyeph",
          "text": "Try mapping out the activities you perform as a PM currently and then look at which of those use cases can be streamlined using AI",
          "score": 11,
          "created_utc": "2026-02-13 04:36:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o54m4av",
              "author": "rnathani91",
              "text": "This. Also you wont be able to do the parts with Emotional Intelligent duties like motivation, momentum shifts based on non-data climates, or org changes before they become formalized. Simulations could be added in. Just not the execution.",
              "score": 2,
              "created_utc": "2026-02-13 07:41:32",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5801zd",
          "author": "pmpdaddyio",
          "text": "I use it for a few things. \n\nI have a script that matches my project status reports. I use RAG status indicators and I explain in my prompt how they are calculated. \n\nI add in an iterative Q&A as part of the prompt so it will ask clarifications as it processes. I run the prompt against my Trams transcripts. \n\nI save at the very minimum two hours a week on my big projects. \n\nI have another prompt that uses the same transcript and it builds my RAIDD log entries. \n\nWhen I hold the meeting I use purposeful comments like “add a risk to the RAID for the following assignment Peter, due date June\n\nI also ask it to update the log and use the same cadence. Being intent full and not just jabbering in the meetings helps. \n\nI also use it to determine tone and feedback of meetings which I rate. We have tons of high stress projects and I use it to coach me on topics to pay closer attention to and be more delicate with. \n\nI do a Teams and outlook assessment weekly that uses my categories to help me look at my meeting schedule and provide feedback to my staff. \n\nI also compile standup meeting notes into my leadership meetings. Saves a ton of time.",
          "score": 10,
          "created_utc": "2026-02-13 20:00:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5asa0p",
              "author": "ArpanMaster",
              "text": "Can you share the rag? And prompts?",
              "score": 3,
              "created_utc": "2026-02-14 06:15:30",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o54p8q7",
          "author": "Eightstream",
          "text": "Make your emails even more empty and soulless",
          "score": 9,
          "created_utc": "2026-02-13 08:10:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o556kzr",
          "author": "CreativeAsFuuu",
          "text": "I use AI for reports but remain the primary decision maker for what goes in them.\n\n\nI start with two AI tools: an AI note taker (Otter, Copilot, Fireflies) and a GPT (like Claude, Chat, Perplexity); and a human-led tracker (ike Monday, Asana, or Jira).\n\n\nThe note taker transcribes and summarizes my meetings with my teams or stakeholders. I still manually take notes, but the AI captures more robust information since it can transcribe faster than I can type. I also cannot type and employ active listening at the same time; the note taker allows me to pay attention to what's being said so I can get a full understanding with context.\n\n\nThe GPT has a project folder and generic project knowledge instructions. In the knowledge base, I include all relevant project documents, like the scope of work, past reports, past work, and a report template.\n\n\nMy team gives detailed updates in their trackers: every stakeholder interaction, every project status change, every iteration of a project, tasks, points of contact, etc. You get the idea: if it can be defined, quantified, classified, or described, my team includes it as a variable or an update in the tracker.\n\n\nFor each report, I export all data from the tracker as Excel or .csv and upload it to my GPT. I prompt the GPT to create a report based on the template, and tell it to include all requirements for the report from the scope of work.\n\n\nI compare the output from the GPT to my tracker and note taker's notes. I, the human, manually add any risks, context, or notes I took from daily interactions. I remove hallucinations or anything stupid the GPT included. After some formatting and proofreading, I fire that puppy off to the project owner. \n\n\nCaveat: This application of AI is highly dependent on my teams putting detailed updates in their trackers; my having precise instructions in my prompts, clear project instructions, and the experience and emotional intelligence to identify threats, challenges, and risks that my team is too junior to identify as such.",
          "score": 7,
          "created_utc": "2026-02-13 10:52:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o56kzp2",
              "author": "collije",
              "text": "Another approach and tool for meeting transcribe and meeting notes: take voice recording (one with transcribe/export feature) and upload the transcription to your GenAI of choice (I use Gemini) to a draft of meeting minutes and tweak as needed (sometimes adding additional context in the AI chat, or simply making my remaining edits or rewrite directly)",
              "score": 2,
              "created_utc": "2026-02-13 15:55:08",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o56luz5",
                  "author": "CreativeAsFuuu",
                  "text": "Good idea! My note taker already does this! It records, transcribes, and summarizes into meeting minutes :)",
                  "score": 1,
                  "created_utc": "2026-02-13 15:59:13",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o55rskl",
          "author": "dude1995aa",
          "text": "Throw away copilot-use Claude for office 365 type work.  I hand it a company deck and tell it the content I need.  It adds the slides, knows the color scheme and format, amazing job with graphics.  Won’t touch copilot.  GPT is a great tool with word…just not PowerPoint.  Was just handed a task of putting together a quarterly deck for the project that would have taken weeks before.  Now I’ll have a meeting with 3 or 4 key people, record it, submit all the transcripts, have Claude put it together.",
          "score": 9,
          "created_utc": "2026-02-13 13:25:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o56bxsb",
              "author": "ArpanMaster",
              "text": "Recently discovered that Claude is so much better than cgpt",
              "score": 2,
              "created_utc": "2026-02-13 15:11:24",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o5625qd",
              "author": "obviouslybait",
              "text": "Claude does seem to really do well in the tooling category, the number of integrations and skills is truly impressive. GPT does well with reasoning and spitting out best practices and offering additional solutions, but misses on the productive output in my opinion.",
              "score": 1,
              "created_utc": "2026-02-13 14:21:47",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o57t58b",
              "author": "Seattlehepcat",
              "text": "Unfortunately in our org we're bought in 100% on MSFT, and our Copilot instance combs our internal resources so we're kind of stuck with it.",
              "score": 1,
              "created_utc": "2026-02-13 19:26:47",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o53w0t9",
          "author": "summetg",
          "text": "Meeting summaries are a given, finding project dependencies, pulling insights from your artifacts",
          "score": 6,
          "created_utc": "2026-02-13 04:12:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o55qbj4",
          "author": "the__accidentist",
          "text": "Use Gamma for your PPTs. \n\nSet up an N8N feeding data from your project plan, schedule, ooo team time, milestone related calls in the schedule, etc. \n\nHave Gamma made an update deck every week",
          "score": 5,
          "created_utc": "2026-02-13 13:16:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o56c22z",
          "author": "ArpanMaster",
          "text": "Good question to post. Lots of handy tips in the comments.\nThanks",
          "score": 5,
          "created_utc": "2026-02-13 15:12:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o53xhda",
          "author": "marizul24",
          "text": "Recently started using Claude code + jira MCP. I can pull down sprint insights instantly, send it all to confluence. Bulk create tickets directly from my terminal, all using natural language. It’s been awesome, huge time saver.",
          "score": 8,
          "created_utc": "2026-02-13 04:22:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o542mds",
              "author": "Spare-Day-4007",
              "text": "This is the play here. \n\nCreating tickets, create a markdown file for it to read that is acting like you and have it use a template to answer questions for what you want in tickets",
              "score": 1,
              "created_utc": "2026-02-13 04:59:24",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o54gwkm",
                  "author": "Gandzilla",
                  "text": "Any ressources or how-to's to share on how to do this?",
                  "score": 2,
                  "created_utc": "2026-02-13 06:54:43",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o54dm0t",
          "author": "PlasProb",
          "text": "Manage notes, todos and day schedule. I use Saner AI every day to prioritize my schedule and get reminded on tasks I may forget",
          "score": 3,
          "created_utc": "2026-02-13 06:26:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o56qety",
          "author": "agile_pm",
          "text": "My team uses it to help with coding, peer review, and QA testing.  I use it to help stakeholders with identifying user stories, use cases, risks and mitigations, and strategic considerations, among other things.  The thing to watch out for is stakeholders rubber stamping AI-generated documentation they're supposed to be preparing.  AI is supposed to be a time-saver, not a decision-maker.",
          "score": 4,
          "created_utc": "2026-02-13 16:20:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o53tpim",
          "author": "WololoWanderer",
          "text": "I am trying to figure out the same, so confused which tools to start with",
          "score": 3,
          "created_utc": "2026-02-13 03:56:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o55knsu",
          "author": "Sophie_Doodie",
          "text": "If you’re already using it for decks and MoMs, next level is using it to think for you, not just write for you. I use it to draft risk logs from messy notes, turn status updates into exec summaries, simulate stakeholder objections before big meetings, break vague goals into task lists with dependencies, and sanity check timelines (“what’s likely to slip here?”). You can also feed it past project data and ask for pattern analysis, where delays usually happen, which tasks create bottlenecks, etc. The real win isn’t prettier docs, it’s faster clarity and better decisions.",
          "score": 8,
          "created_utc": "2026-02-13 12:41:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o56jzqi",
              "author": "collije",
              "text": "That's the real use case. It's like peer review from a fellow sr PM, Program Manager, or PMO chief",
              "score": 2,
              "created_utc": "2026-02-13 15:50:24",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o53rrbd",
          "author": "bluealien78",
          "text": "I have dozens of agents deployed doing many “PMO”-centric repeatable work. Charter authoring, initial WBS building, deck building, Slack autoresponders, incoming request routing, status reports. The humans in the loop are the last 10% now. It’s awesome. Our throughput is way higher than it was a couple of years ago.",
          "score": 5,
          "created_utc": "2026-02-13 03:43:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o545qer",
              "author": "Available-Budget-735",
              "text": "What does the slack autoresponder do? Have you had any issues arise due to the agents being wrong?",
              "score": 2,
              "created_utc": "2026-02-13 05:22:40",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o53sfmi",
              "author": "Daisy_InAJar",
              "text": "Do you use agents all from one core tool or many different ones? I’d love to hear more about request routing and status reporting.",
              "score": 1,
              "created_utc": "2026-02-13 03:48:25",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o53u1mq",
                  "author": "bluealien78",
                  "text": "Glean, Cursor, Gemini, and an in-house LLM are all used.",
                  "score": 0,
                  "created_utc": "2026-02-13 03:59:13",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o54syuv",
              "author": "speedypuma",
              "text": "Any examples of prompts you use? Company just rolled out Gemini and wondering if I can set up custom Gems to do similar",
              "score": 1,
              "created_utc": "2026-02-13 08:45:16",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o53vzx2",
          "author": "Trickycoolj",
          "text": "I use our command line AI to connect to our Jira and confluence instances (locally hosted not the cloud based versions). It’s killer to have open during meetings when someone says “when was X ticket completed?” Or “we need to do Y” and I can search “what ticket completed Y task worked by ABC engineer” and boom link to the ticket “we completed that work back in November and it was deployed right away”",
          "score": 2,
          "created_utc": "2026-02-13 04:12:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o55k123",
          "author": "ConstructionNo1511",
          "text": "I used copilot to generate python code for a macro that reformatted, removed columns, and renamed a monthly distribution of 40 files.",
          "score": 2,
          "created_utc": "2026-02-13 12:37:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o564vlt",
          "author": "Ok_Jello9448",
          "text": "Hey, did the use of co pilot or Claude fundamentally change how you do things? I get that emails are written faster or slide decks are made faster, but did anything change wrt what you essentially do as a project manager i.e hearding a group of people, and make them work towards 1 single goal. Of course besides all the jazz of scope, timelines, cost, reporting etc.  \n\nGenuinely curious.",
          "score": 2,
          "created_utc": "2026-02-13 14:36:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o555ifh",
          "author": "Mammoth_Ad3712",
          "text": "You’re already using it the way most PMs start: notes, decks, and email cleanup. That’s solid.\n\nWhere I’ve seen it go from “nice to have” to actually useful:\n\n• Turning messy meeting notes into structured action logs with owners and due dates  \n• Scanning long email threads and extracting risks, blockers, and decisions  \n• Drafting stakeholder updates based on raw status inputs  \n• Comparing scope changes against original requirements to highlight deltas  \n• Reviewing schedules for obvious dependency gaps or overallocations\n\nIf you want to go deeper, start experimenting with lightweight “agents” that:  \n– Pull task data from your PM tool  \n– Flag overdue or at-risk items  \n– Draft a weekly summary automatically\n\nJust be careful with data privacy and hallucinations. Always review before sending anything external.",
          "score": 2,
          "created_utc": "2026-02-13 10:43:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o55n9v1",
              "author": "Smooth-Trainer3940",
              "text": "I like using it for the first thing you mentioned. I am a messy note-taker so I like that it can rewrite to format it for me. I think the use case of 'take this unstructured thing and make it structured' is a good use case. For the last few things you mentioned, I would be interested to see how AI could handle that. They seem more like workflow automation / data transfer use cases, which I haven't seen many AI tools do (or do well). I use Text Blaze for those kinds of things right now and I'm happy with it. Also agree to be careful with hallucinations. I have pretty detailed prompts that mention preserving my original ideas/meaning, etc.",
              "score": 1,
              "created_utc": "2026-02-13 12:58:17",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o55l6gi",
          "author": "TheRoseMerlot",
          "text": "Why not, not?",
          "score": 2,
          "created_utc": "2026-02-13 12:44:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o54pu2x",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-13 08:15:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o556krd",
              "author": "projectmanagement-ModTeam",
              "text": "Thanks for your post/comment.  \n\nWe removed this post because it's in direct violation of our \"solicitation / self-promotion” rule.  \n\nPlease review these rules, which can be found in the sidebar.\n\nThanks,\nMod Team",
              "score": 1,
              "created_utc": "2026-02-13 10:52:42",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o55jjnq",
          "author": "jche2",
          "text": "GitHub action to automate code review QA via copilot and block build if it doesn’t have green light via custom prompt with your org specific standards",
          "score": 1,
          "created_utc": "2026-02-13 12:34:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o56ky1k",
          "author": "essmithsd",
          "text": "This question is asked weekly, use the search bar ffs",
          "score": 0,
          "created_utc": "2026-02-13 15:54:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o53qt9m",
          "author": "Robenever",
          "text": "Recently got approach by a top MBA school about one of their executive programs that was basically selling this exact thing as a course. AI use cases are pretty new and there’s a high demand for this knowledge as far as I can tell.",
          "score": 1,
          "created_utc": "2026-02-13 03:37:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o542pb7",
          "author": "Aggressive-Low3956",
          "text": "Project managers can use AI to gauge project data, assess team performance, automate scheduling, forecast hazards, and produce real-time insights. ",
          "score": 0,
          "created_utc": "2026-02-13 05:00:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o54hvjq",
          "author": "WoodpeckerNo5214",
          "text": "Beyond docs and decks, AI is great for risk prediction, sprint planning, dependency mapping, and auto-generating stakeholder updates from project data. You can also use it to simulate scenarios, draft mitigation plans, and spot scope creep early.",
          "score": 0,
          "created_utc": "2026-02-13 07:03:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o553qh9",
          "author": "adelarenal",
          "text": "I use Claude Code + VSC for all my PM. I am not coding.",
          "score": 0,
          "created_utc": "2026-02-13 10:27:12",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r4m0ha",
      "title": "How do you distance yourself from the job?",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1r4m0ha/how_do_you_distance_yourself_from_the_job/",
      "author": "tjommee",
      "created_utc": "2026-02-14 14:29:06",
      "score": 44,
      "num_comments": 24,
      "upvote_ratio": 1.0,
      "text": "I began a new job as a PM a few weeks ago and got to take over a project in its early stages. Quite short time plan of a total of 12 months, but at the handover they made it clear it was already 2 months late. Time which will not be able to compensated for due to external deliveries.\n\nThe client is not aware but is noticing deliveries are slipping. For them it is a very high stake project with a lot of external financing linked to the time plan. So all meetings with them consist of them shouting and demanding things to be done that are at least 4-6 weeks away.\n\nI don’t know how to deal with this. I inherited this mess and I’m stuck with it now and can’t really do much about it. And it is extremely stressful.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/projectmanagement/comments/1r4m0ha/how_do_you_distance_yourself_from_the_job/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o5cioc0",
          "author": "wm313",
          "text": "You reset expectations. First, update them on the true status and where you go from here. Do it once now so you don’t have to later when it really hits the fan. Transparency builds trust. They don’t want to hear it but you don’t want to backtrack later. \n\nI inherited a project where promises were made by my predecessor that never happened. I explained that I couldn’t do anything about that now but here we are today. I provided a plan going forward and gave them timelines. I looked at it as it not being my fault for our current situation. It helped and things got done. I built trust with them and I was thanked later for my guidance. \n\nThat was as a new PM working in data center construction. The pace there was fast, and we had half of the team my company promised, but we had a couple engineers who were all stars. I was stressed out daily. It was stressful but we met the deadline in the end with some caveats. \n\nYour customers will respect your transparency more than you trying to fix things behind the scenes. Rip the bandaid off and get the issues out there. They will be more helpful with that approach after the initial shock wears off. In the meantime, if possible, talk to your management about getting more people to work on the project. Maybe they can do something, maybe not but you’ve got to up-channel the things that keep you up at night. Otherwise, it’s self-induced stress until you relieve the weight on your shoulders.\n\nPrepare for longer days if that’s an option. Plan *with* your team, not just for them. Let them know what’s going on. It makes that part easier as well. It builds trust when everyone knows where things sit.",
          "score": 25,
          "created_utc": "2026-02-14 14:55:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5daber",
              "author": "icysandstone",
              "text": ">Rip the bandaid off and get the issues out there. They will be more helpful with that approach after the initial shock wears off.\n\nAgree with everything you’ve said, and I’d like to add some tactical wisdom from Chris Voss on how to actually deliver bad news. As he says, people are remarkably resilient… it’s all about the delivery.\n\nHere are some clips for anyone who stumbles on this thread:\n\n“Say it as concisely and as negatively as you can.” https://youtube.com/shorts/7dyF1vjxEkA\n\n“Calling the elephant out in the room is the good way to do it. https://youtube.com/shorts/WhagYNlKwDE\n\n“People are remarkably resilient if you give them a second to brace themselves.”\nhttps://youtube.com/shorts/7qKVGC0knQs\n\n“It’s how you give the warning… you’re going to react negatively to this. You’re not going to like this.” https://youtube.com/shorts/O8_7rshZ0y4\n\n\n“I’ll let you brace yourself and you’re going to appreciate the warning” https://youtube.com/shorts/uvhDq9XfKrM\n\n“Wait a second and deliver the news” https://youtube.com/shorts/BhzSxr20YpE\n\n\nIf you watch all those Shorts you’ll be an expert at delivering bad news. 😬\n\nCc’ing OP: /u/tjommee",
              "score": 6,
              "created_utc": "2026-02-14 17:17:11",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o5d5v5o",
              "author": "14erMustClimbAll",
              "text": "This person has it 100% correct. Be honest that the schedule is delayed. Ideally you can share ideas about what you're trying to do to speed up, but it is better to be upfront about the delay vs coming to the end of the project and then telling then it's late. \n\n\nIf you tell them now, they can take steps to adjust expectations on their side. If you wait too long to admit the delay, they will truly be pissed at you and your company.",
              "score": 3,
              "created_utc": "2026-02-14 16:54:38",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5dc2rz",
                  "author": "tcumber",
                  "text": "I agree with all above with caveat that you should check with your management on messaging.",
                  "score": 3,
                  "created_utc": "2026-02-14 17:26:08",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5chodc",
          "author": "Immediate-Actuator85",
          "text": "Ok you are the new guy on the block.  The company is probably testing your intestinal fortitude by giving you this mess. If it’s really a high stakes project, then why is it 2 months late ? Why would they put a new pm from outside on it as opposed to one that was already familiar and versed with the project to begin with? Or why not put an outside high cost consultant it on it who is familiar with this type of project? They Shouting at meetings ?  This sounds like a very dysfunctional organization. \n\nJust do your best with it and remember you did not create the mess, you inherited it. You got the project nobody else wanted because they knew it was a mess with dysfunctional people involved in it.  They had to resort to an outsider (you) to take it on. If you stick it out, the company should realize they have a valuable performer that can handle tough projects. If you turn it around, that’s an extra feather in your cap. This can be an opportunity to/ blessing in disguise. Try to look at it that way",
          "score": 12,
          "created_utc": "2026-02-14 14:49:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5cs2bk",
              "author": "tjommee",
              "text": "That’s a good way to look at it. The organisation is somewhat immature but with good people. I’m trying my best to promote transparency and I’ll just have to see how it goes.",
              "score": 2,
              "created_utc": "2026-02-14 15:45:05",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5cslwn",
                  "author": "Immediate-Actuator85",
                  "text": "I’ve been there and done it . Best of luck",
                  "score": 1,
                  "created_utc": "2026-02-14 15:47:53",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5cg8rr",
          "author": "PineappleChanclas",
          "text": "The client not knowing is issue #1.\n\nYou didn’t inherit something mid-stream. You inherited something that never actually launched and is now drifting toward dumpster fire territory, if it’s not already there. That’s trial by fire.\n\nIf they’re unaware but starting to sense it, step one is internal:\n\nFigure out what actually broke down. Was it ownership? Scope clarity? Resourcing? Avoidance? Get the real story.\n\nThen plan the external conversation. Don’t “confess and hope for the best.” Show up with:\n\n1. What happened (clean, factual)\n2. Why it happened (without throwing anyone under the bus)\n3. What changes immediately\n4. A concrete recovery plan with dates and owners\n\nMost reasonable clients can handle bad news. What they can’t handle is ambiguity or spin. Transparency + a credible path forward buys you more goodwill than pretending everything’s fine.\n\nI remind myself all the time: the job is the job. We’re accountable for outcomes. But we’re also humans working with humans. Most people will meet you halfway if you’re honest and decisive.\n\nThe ones who won’t? They’re usually the ones their own teams struggle with too.",
          "score": 11,
          "created_utc": "2026-02-14 14:41:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5chn0g",
              "author": "UsernameHasBeenLost",
              "text": "Very well said.\n\n\n>I remind myself all the time: the job is the job. We’re accountable for outcomes\n\n\nFrom a \"how do you personally handle clients getting pissed off\" perspective I will add to this that for 99.99% of project management, the stakes aren't that high. I've been in roles where mistakes or delays can lead to injury or death. In my industry (manufacturing automation), the worst that happens is a massive company loses some productivity/money. It's not that serious, don't take it personally. Do the job to the best of your ability, but keep things in perspective",
              "score": 3,
              "created_utc": "2026-02-14 14:49:15",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o5ch5ji",
              "author": "tjommee",
              "text": "Thanks mate! Fully agree with you, I believe transparency is key. However the management here doesn’t fully agree. They are more inclined towards not changing the time plan towards the client and try to deal with the outcome at latest possible moment. But I think it just raises the stakes…",
              "score": 2,
              "created_utc": "2026-02-14 14:46:30",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5chvwx",
                  "author": "ErikGoesBoomski",
                  "text": "Then find a new place to work. The person who commented gave excellent advice, and honestly the only way to move forward with the project at all unless by some miracle you can pull a rabbit out of your butt. You're the PM, you need to take control of this thing before you get burned and end up with a shit reputation.",
                  "score": 3,
                  "created_utc": "2026-02-14 14:50:39",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o5cjjnw",
                  "author": "hadbadadhdstillhave",
                  "text": "Seems like you'll have to convince them otherwise or find out if they are right. Really need to chat to whoever has the most power here and understand their position.",
                  "score": 1,
                  "created_utc": "2026-02-14 14:59:53",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o5chskj",
              "author": "c1rcu1tb0y",
              "text": "This is good advice. Stick to the facts of the reality of the situation, do what you can do, make a concrete plan for what needs to be done, monitor as it goes and make sure everyone is informed, and then try to rest in the comfort of you did all that can be done. It’s just a job and there’s more important things in the world to actually stress over.",
              "score": 1,
              "created_utc": "2026-02-14 14:50:07",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5furpb",
          "author": "Quick-Reputation9040",
          "text": "I’m late to this discussion.  Let me add a comment, though, OP, in case you see this before your next client-facing meeting.\n\nEveryone telling you to alert the client to the problem are right,  You definitely should do that, after telling your leadership about the situation and your messaging approach.\n\nBefore doing either, however, I would advise going thru another round of what-ifs to determine what, if anything, your org and suppliers could possibly do to reduce the schedule.  Can your client pay more to your org, to pay your suppliers to crash the schedule?  If your suppliers are late, can other suppliers meet the (or at least get closer to) the original schedule?\n\nEven if your suppliers can’t do anything, and alternative suppliers can’t be used for whatever reason, can your org crash the schedule in other ways (e.g. bring in contractors to reduce timelines later?). \n\nAlternatively, can your org deliver less at first, then iteratively deliver the rest of the solution?\n\nLong story short: We typically work with three constraints.  The schedule is currently cooked.  Work with your teams and leadership to determine what, if anything can be done if the client can pay more or reduce the scope needed by the deadline.  Look for alternatives and present what you find and let the client determine what’s really most important in the triple constraint.",
          "score": 7,
          "created_utc": "2026-02-15 01:55:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ggffh",
          "author": "Logical-Bookkeeper77",
          "text": "Facts gathering, assess the situation, make alternatives and recommendation.\n\nSometimes, delay is inevitable.\n\nThink of it like a real life kobayashi maru without the ability to reprogram the scenario.\n\nBut it’s usually gets more sticky because your company may not want to disclose any possibility of lateness due to clauses in contract and sometimes expect the PM to be the scapegoat and just fire an rehire when shit happens. \n\nAnd just leave the things when you leave office. Don’t carry the burden with you to home. Do some winding down like have a HH or a quiet coffee whatnot.\n\nGood luck~",
          "score": 6,
          "created_utc": "2026-02-15 04:28:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ez3a6",
          "author": "More_Law6245",
          "text": "When taking over an inflight project you must as a professional practitioner undertake your own due diligence on the project prior to acceptance because you need to ensure the business case, plan and schedule and map back your deliverables, products and milestones and more importantly understand if the project has been baselined. You also need to understand that your business case is actually fit for purpose along with your project plan and schedule.  You also need to map your relevant project document artefacts to see if they have been delivered, reviewed and approved.  This is to ensure that you're not getting a dead cat that is being thrown over the fence and making sure that you're left holding the cat. \n\nAnything that falls short should be immediately escalated to your project board, sponsor or executive. You also should be raising additional risks and issues and informally socialise them with your project board then formally raise them, so they're not surprised. I would also suggest you have a plan for a way forward e.g re-baselining your project schedule, placing the project on hold or worse case scenario  recommend abandonment.  \n\nYourself, your executive or account manager (urgently) need to sit down with the client in order to reset expectations because if you don't do anything outlined above it will end up in your lap at the end of the project, rightly or wrongly.  At some point once you become the PM it becomes your responsibility and if you fail to escalate the current position it becomes your problem regardless of what state the project is in. Hence why it's so important for the new encumbered PM to audit the project carefully prior to acceptance. \n\nJust an armchair perspective. ",
          "score": 7,
          "created_utc": "2026-02-14 22:37:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5gvxm9",
          "author": "danarchyx",
          "text": "Realize your job is an ends to a mean. That mean is funding your ideal life.",
          "score": 5,
          "created_utc": "2026-02-15 06:38:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5h2u3d",
          "author": "pmpdaddyio",
          "text": "Do you want to fix that problem or just not give a fu(k about it?",
          "score": 3,
          "created_utc": "2026-02-15 07:43:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5gltcd",
          "author": "DaimonHans",
          "text": "Take yourself out of the equation. You cannot change the outcome.",
          "score": 4,
          "created_utc": "2026-02-15 05:10:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5cfkcd",
          "author": "Ordinary_Musician_76",
          "text": "Lexapro",
          "score": 2,
          "created_utc": "2026-02-14 14:37:27",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r1f1b2",
      "title": "Anyone using project management software that shows real burn vs budget?",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1r1f1b2/anyone_using_project_management_software_that/",
      "author": "Papito24",
      "created_utc": "2026-02-10 22:15:30",
      "score": 40,
      "num_comments": 24,
      "upvote_ratio": 0.76,
      "text": "PM at a professional services firm and this keeps bugging me. Schedules look green, clients are happy, but finance is constantly flagging billing issues after the fact. Right now delivery tools and billing live in totally different worlds, so PMs don’t really see burn vs budget in real time. What do other PMs use to get visibility into project financials without living in spreadsheets??",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/projectmanagement/comments/1r1f1b2/anyone_using_project_management_software_that/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o4p2ueb",
          "author": "AutoModerator",
          "text": "Attention everyone, just because this is a post about software or tools, does not mean that you can violate the sub's 'no self-promotion, no advertising, or no soliciting' rule.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/projectmanagement) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-10 22:15:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4p6j9a",
          "author": "cbelt3",
          "text": "It’s all about how you do project accounting. That’s what you need to interface. PM software won’t magically fix that for you, you have to find an integration point.",
          "score": 10,
          "created_utc": "2026-02-10 22:34:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4pp85c",
          "author": "oscarnyc1",
          "text": "Take a look at Motionode. It tracks cost, sow, and updates dates automatically. It also shows weekly capacity versus tasks requirements.",
          "score": 6,
          "created_utc": "2026-02-11 00:17:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4sb0im",
          "author": "SVAuspicious",
          "text": "You use \"burn\" differently than I do. \n\nFor good information you have to collect good labor and expense information. Weekly timesheets is good periodicity synchronized with status input. \n\nActual costs come from accounting into PM through an API and show up as actual costs (AC). The baseline in PM and status show earned value (EV). The baseline shows planned value (PV). I report this as CPI and SPI with LOE tasks excluded. \n\nOn contracts with progress payments instead of periodic (usually monthly) billing I get and include two other artifacts. First is AC v. billing as a line graph. If the customer is slow pay we add a \"paid\" line. I get reports from accounting of outstanding invoices (ours to customers and vendors to us). Second is a report of incomplete tasks to the next two progress payments. \n\nThe data flows from accounting to one of my BAs who generates reporting to me and for outgoing reporting. Everyone gets the same information. No tailored reporting. The BA has spreadsheet templates formatted to look like the ones from the PM tool to avoid confusion. Accounting provides data as .xlsx files. It's all very automated so work is in analysis, not generation. We also get an allocated cost from finance for interest charges for running costs (labor and expenses) from our corporate line of credit that shows up as a charge in our data from accounting through the API. If we see something big (big materials usually) on the horizon we generate an exception report as a heads up to finance. \n\nPM tools I've had this work with include MS Project, Scitor Project Scheduler (RIP), and Primavera. The new generation of PM \"tools\" are deficient. I have yet to encounter an accounting tool (or HRIS for that matter) without good API support. \n\nMS Project doesn't scale well when project size gets exponential, say 10 x 10^(7) USD. \\*grin\\* \n\nIn my experience, building systems to avoid duplicate data entry and for the long term is worth marginal cost in capex to minimize opex. Remember - all this stuff (except my BA) is overhead. \n\nDave's rant #374: Software can't do your job for you. You have to know what you're doing. \n\nPM, SE, accounting, finance, HR, IT, and legal form a team. We meet as needed (no periodic meetings - as needed) when anyone sees a bump in the road. We have an email distribution list as most bumps can be avoided through communication. If accounting software is getting an upgrade we all know. If some SaaS contract (ugh) is being renewed we all know. If HR is responding to new reporting requirements that change data formats we all know. If IT is doing a desktop refresh or changing cell phone plans we all know. ",
          "score": 6,
          "created_utc": "2026-02-11 12:07:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4pb5hy",
          "author": "NewZealandTemp",
          "text": "Based on what I’ve seen discussed here and in PM-focused reviews, BigTime is often mentioned when people look for tools that surface burn rate and budget alignment during delivery, not just at invoicing. It’s usually framed as helpful for PMs who want financial signals alongside timelines, especially in services environments.",
          "score": 4,
          "created_utc": "2026-02-10 22:58:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4rogwo",
          "author": "Present_Nerve7871",
          "text": "Most of the accounts posting in here are AI, just fyi.",
          "score": 5,
          "created_utc": "2026-02-11 08:48:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4u4cbq",
              "author": "Smooth-Trainer3940",
              "text": "Unfortunately",
              "score": 1,
              "created_utc": "2026-02-11 17:49:49",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4uodfg",
          "author": "baggins1717",
          "text": "Excel and PowerPoint, literally",
          "score": 3,
          "created_utc": "2026-02-11 19:22:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4vg361",
          "author": "More_Law6245",
          "text": "In reality most company's don't have the luxury of data lakes/pools as most companies are still working with disparate IT systems and data stores, a PM is the unfortunate administration bridge between the two because it's the PM who needs the information. \n\nTo be honest it's a fact of life for a PM, the only way they can do forecast and actually is with the tools that they have, what they can leverage and to be honest a spreadsheet is fine for this. I would suggest setting up a standard template and all you have to do is import your relevant data stores for analysis. In the past I have even been able to automate the raw data imports for MS Excel. \n\nTo be perfectly frank, a PM should be doing their own import and data manipulation in order to find micro tends in the data e.g. a task or work package supposedly being finished because you see time attributed but no deliverable, or you can start baselining tasks or work packages for future projects etc. It's also a skill that a PM must possess in knowing how to complete a trend analysis on forecast and actuals. \n\nAlso another consideration, forecast and actuals is not considered a realtime transactions because the forecast is a future state and actuals is a past state because you record the effort or expenditure after the fact. Also it's highly unlikely you will have resources submitting daily timesheets, your finance team providing you financial transactions against your project and you running a report after these transactions have occurred, it's not feasible to conceive that project transactions can be measured in realtime. \n\nThe reality is that a PM is the stop gap for decentralised information and every PM must have the skills to be able to assimilate, analyse and disseminate the disparate data stores in order to understand how their project is truely performing against the schedule and must be considered your primary quality indicator. Off loading through automation (which I've seen many PM's wanting to do) runs the risk of really not understanding how your project is truly progressing and performing. ",
          "score": 4,
          "created_utc": "2026-02-11 21:36:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4rwcxg",
          "author": "ConstructionPM_Pro",
          "text": "The disconnect between delivery tools and billing is the eternal PM struggle. You don't necessarily need fancy software — the key is having a consistent workflow for tracking hours/costs as work happens, not after the fact. I've found that simple templates (weekly burn reports, project cost trackers) that feed into a single dashboard solve 80% of this. The problem is usually process, not tools. Get your team logging costs consistently first, then pick software that fits your workflow — not the other way around.",
          "score": 3,
          "created_utc": "2026-02-11 10:02:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4p4yqf",
          "author": "RemotePersimmon678",
          "text": "Harvest does this",
          "score": 2,
          "created_utc": "2026-02-10 22:26:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4rzr3d",
          "author": "arina_katz",
          "text": "We use actitime to see the project budget burn, you can track the budget by client, project and even task, very convenient ",
          "score": 2,
          "created_utc": "2026-02-11 10:33:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o544kvq",
          "author": "Fantastic-Nerve7068",
          "text": "we switched to Celoxis. It actually shows real time burn against budget inside the project view itself not just hours but actual cost tracking. You can tie in billable rates, see how much has been logged, what’s left, and whether you're overrunning before finance sends that dreaded email.\n\nIt’s not just a reporting tool either we use it for planning, approvals, timesheets, everything. Having delivery and financials in the same system means way fewer surprises and way less back and forth with accounting. If budget visibility is your pain point, definitely worth checking out.",
          "score": 2,
          "created_utc": "2026-02-13 05:13:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4qd6nr",
          "author": "DeliciousBuilder0489",
          "text": "Check out RocketLane. We just switched and it should suffice your use case.",
          "score": 1,
          "created_utc": "2026-02-11 02:39:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4rcxrx",
          "author": "HastaLaVistaDonkey",
          "text": "Klient.com",
          "score": 1,
          "created_utc": "2026-02-11 07:00:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4rji9g",
          "author": "Low-Illustrator-7844",
          "text": "Does the software you use to raise invoices not give you that option?",
          "score": 1,
          "created_utc": "2026-02-11 08:00:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4rofex",
          "author": "Murky_Cow_2555",
          "text": "What’s helped in my experience is tying time tracking directly to tasks and having budget fields at the project level that roll up automatically. So instead of hours logged somewhere else, you see planned vs actual hours and cost variance right on the project dashboard. That alone changes behavior because PMs stop managing just scope and start managing burn in real time.\n\nWe’ve used Teamhood in one setup where budget and estimation fields were locked at the workspace level and time rolled up to the project, so PMs could see burn vs estimate without exporting to Excel every week. ",
          "score": 1,
          "created_utc": "2026-02-11 08:48:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4su3c6",
          "author": "pmpdaddyio",
          "text": "This should be stock in most tools assuming you configure it properly. I always recommend you work with finance, and work on your integration method. Most organizations know how to break down the budget into various categories, this goes in your budget line, then you integrate data from your finance group and these go into your actuals.\n\nIn MS Project, SmartSheet, Jira, and many of the Gartner upper right tools, you have this built in, you may need to slightly adjust your reporting, but this isn't complicated.",
          "score": 1,
          "created_utc": "2026-02-11 14:05:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4zbkj8",
          "author": "Genomak-",
          "text": "Anything will do so long as estimates are close and work is accurately recorded. That’s always the hard part.",
          "score": 1,
          "created_utc": "2026-02-12 13:54:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5gmht6",
          "author": "Logical-Bookkeeper77",
          "text": "It depends on project and if you can correctly measure “burn” quantitatively.\n\nSay if it’s a project of “writing 100 words” where you can count each word as 1% completion. Then no problem, if it’s a more complex project with some single point of blockage where it doesn’t matter if you’ve done everything else, it gets a bit more complex.",
          "score": 1,
          "created_utc": "2026-02-15 05:16:11",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r0jnw3",
      "title": "Client who cancels a lot, but within the required window—how do I let them know it's disruptive without being too pushy?",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1r0jnw3/client_who_cancels_a_lot_but_within_the_required/",
      "author": "Longjumping-Wafer102",
      "created_utc": "2026-02-09 23:02:14",
      "score": 37,
      "num_comments": 19,
      "upvote_ratio": 0.93,
      "text": "I work in a client-facing service role with booked sessions\n\n\n\nI have a slightly limited schedule (baby) with 5 slots a day, 4 days a week. I don't like to take on too many clients if I can't service them as needed.\n\n\n\nI have a client who frequently cancels and I think they think it's fine because they do let me know before the 24-hour late cancel fee kicks in. They've rescheduled at least 50% of our scheduled meetings due to work and social obligations.\n\n\n\nMy question is: how can I word this via email or in person so that they don't feel bad or embarrassed, but that they understand that despite being in \"compliance\" of my policy, the amount they cancel is a huge disruption to my schedule?\n\n\n\nHere's my issue: I'm not great at putting pressure on clients. I tend to be emotionally soft and struggle with confrontation. I don't want to come across as demanding, but I also can't keep accommodating this constant rescheduling. How do I communicate this professionally without getting emotional or backing down?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/projectmanagement/comments/1r0jnw3/client_who_cancels_a_lot_but_within_the_required/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o4itzsn",
          "author": "MattyFettuccine",
          "text": "When they cancel, you ask them to rebook quickly as this will affect their project schedule.\n\nOr you update your policy for a longer cancellation notice.",
          "score": 31,
          "created_utc": "2026-02-09 23:35:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4l5rig",
          "author": "EconomistFar666",
          "text": "I’d frame it as an impact conversation, not a policy one. Something like “I want to make sure we’re getting the most value out of our time together. When sessions are frequently rescheduled, it’s hard for me to hold space for you and other clients since my schedule is pretty fixed. If weekly timing is tricky right now, we can look at less frequent bookings or a different cadence that’s easier to keep”.",
          "score": 20,
          "created_utc": "2026-02-10 09:27:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4n2m1s",
              "author": "A-n-o-v-a",
              "text": "This! And also, confront any situation that you are not comfortable with, because at the end of the day, it's your time. Don't let it get wasted.",
              "score": 4,
              "created_utc": "2026-02-10 16:41:12",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4it0un",
          "author": "JohnnyWeapon",
          "text": "I’d put it on my RAID and call it out through that avenue. It’s a good talking point and relevant to the project as a risk to the timeline. \n\nThey should have a vested interest in keeping the project on track. \n\nI’ve been a client-facing PM and my style is more empathetic and collaborative (sounds like you) and while I’m not shy to be confrontational, I’ve always found that keeping things in the context of the project helps a TON.",
          "score": 12,
          "created_utc": "2026-02-09 23:30:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4kyp4s",
          "author": "dhemantech",
          "text": "I did trainings a decade back and faced the exact same problem. To all communication I just added a simple caveat- first cancellation is free, post that booking would need advance payment. Second cancel meant a 50% fee. Third cancellation onwards there would be no refunds. It impacted the bookings in that many customers feel it’s acceptable to book as long as they don’t have to pay upfront because they can always cancel. My priority was certainty for my time.",
          "score": 13,
          "created_utc": "2026-02-10 08:17:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4qb2q7",
              "author": "Glass-Ad-2731",
              "text": "This is excellent. As someone who relates to OP, thank you for this advice!",
              "score": 2,
              "created_utc": "2026-02-11 02:27:03",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4io3sr",
          "author": "Rude_Taro_9572",
          "text": "I'm generally pretty direct. Try having a conversation along the lines of: \"I've noticed you're frequently cancelling/rescheduling our appointments and I was wondering if we could work together to figure out a different day/time that would work better for your schedule?\"\n\n\n\nDon't be afraid to communicate directly with the client—it's the most efficient approach. If you struggle with emotional control during these conversations, use negotiation sims like chαtvisor, or have a colleague role-play as the client. Practice the conversation multiple times until you can stay calm and composed throughout. Then you'll be ready to address it professionally.",
          "score": 10,
          "created_utc": "2026-02-09 23:03:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4iv1lg",
              "author": "InfluenceTrue4121",
              "text": "I agree wholeheartedly. This is the best approach from a client management perspective.",
              "score": 3,
              "created_utc": "2026-02-09 23:41:37",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4oyt8g",
          "author": "Additional_Owl_6332",
          "text": "not everyone is a customer and if you can't make a profit then they aren't your customer and just walk away, \n\n",
          "score": 8,
          "created_utc": "2026-02-10 21:56:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4p1cvs",
          "author": "More_Law6245",
          "text": "There are two aspects to or post, firstly if the client keeps on cancelling then have them rebook immediately because their next engagement may not meet their expectations. Place the ounce and responsibility on the client, the client isn't always right nor should they have the expectation for you to bend over backwards every time to accommodate them. You're a service and not a door mat because at the end of the day it's costing you as a business not them. \n\nSecondly you have acknowledged your position in relation to your behaviour about confrontation, what are you doing to address your behaviour? In reality when running a business you need to be able to be firm with your client, negotiation is a two way street and not you just saying \"yes\" because it creates more problems than it should (this is a confidence and professional maturity thing), as you also have needs that must be met as well. By the very definition of them using your services means there is a professional relationship, hence you should also have expectations of your clients as well. \n\nI would also suggest really consider the terms and conditions of service within your contract and address your cancellation policy, being a smaller business there is no reason on why you can't push the cancellation time and the use of cancellation fees.  The key thing to remember is that you need to remain profitable in order to viable as a business. \n\nI would also suggest seeking out a small business mentor as well, there are many forums available that you could possibly leverage to help you grow professionally. Just a reflection point for your consideration. \n\nJust an armchair perspective. ",
          "score": 7,
          "created_utc": "2026-02-10 22:08:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ip9te",
          "author": "bstrauss3",
          "text": "I realize scheduling can be difficult, but I work a limited schedule and cancelations -- even though within policy -- have a large impact on me. Please work with the front desk to schedule with another therapist.\n\nThen next time(s) you see them on your schedule, you cancel them as far ahead as possible. \n\nYou are only a doormat if you let yourself be one.",
          "score": 12,
          "created_utc": "2026-02-09 23:09:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4is8cx",
              "author": "RhesusFactor",
              "text": "Lol therapist.\nSeems like your instance of Copilot/GPT you have been using for therapy has bled into your other requests to answer reddit questions.",
              "score": 3,
              "created_utc": "2026-02-09 23:26:05",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4ivfcl",
                  "author": "moochao",
                  "text": "thatsthejoke.jpg",
                  "score": 1,
                  "created_utc": "2026-02-09 23:43:45",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4kliqd",
          "author": "hotheadnchickn",
          "text": "You could say you notice them cancelling a lot and ask them if there’s a different time that works better for their schedule. \n\nWhen it comes down to it, they are behaving in a way that respects your policy. If it doesn’t work, it sounds like you may need to change your policy.",
          "score": 4,
          "created_utc": "2026-02-10 06:17:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4kxd5c",
          "author": "BedRoomSenses",
          "text": "This might not directly apple but my work is client based. A lot of them are on a recurring schedule (once a week) and the soft policy is no more than 3 client cancelations in a row. After that we review together to see why there are so many cancelations. It doesn’t make sense for me to hold that spot for them and it doesn’t make sense for them to be charged for sessions they’ll just cancel.",
          "score": 3,
          "created_utc": "2026-02-10 08:05:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4kcdkk",
          "author": "Fantastic-Nerve7068",
          "text": "totally feel you on this one especially with a tight schedule and a baby in the mix the best approach i’ve found is framing it around predictability and availability not blame something like\n\n“hey i totally understand life gets busy and i appreciate the heads up when you need to reschedule that said just wanted to flag that the frequency of changes makes it harder for me to manage my availability and support all my clients effectively if it continues at this pace i might have to relook at how we schedule or whether a recurring slot still works for us”\n\nit’s kind honest and puts the impact on your side not making them feel attacked plus it gives you a boundary without sounding rigid",
          "score": 3,
          "created_utc": "2026-02-10 05:05:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4klrez",
          "author": "ZiKyooc",
          "text": "That problem should be solved by itself. Stick to your schedule and offer client alternative existing open slots. If you have room and the client is ok with late minutes available open slots then what is the issue? If the client is unhappy that the late minute change of plans leads to a few days delay, then you explain. If you are willing to make some adjustments to your schedule to accommodate, you can consider, if this interests you, to offer some late minute time slots that impact on your personal schedule with a 50% (or whatever) additional cost.",
          "score": 3,
          "created_utc": "2026-02-10 06:19:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4int9m",
          "author": "AutoModerator",
          "text": "Hey there /u/Longjumping-Wafer102, Have you looked at our \"Top 100 books post\"? Find it [here](https://www.reddit.com/r/projectmanagement/wiki/index/books).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/projectmanagement) if you have any questions or concerns.*",
          "score": 0,
          "created_utc": "2026-02-09 23:02:14",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r4idwk",
      "title": "I feel like a glorified note-taker",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1r4idwk/i_feel_like_a_glorified_notetaker/",
      "author": "Kind_bite91",
      "created_utc": "2026-02-14 11:31:15",
      "score": 33,
      "num_comments": 15,
      "upvote_ratio": 0.97,
      "text": "For the past year I have worked as a junior project manager in SaaS company. Mind you, there is no senior PM in the company but since I came in fresh in the role with little to no actual previous experience I have been titled as Junior. \n\nThe CEO of the company moonlights as a dev with just enough knowledge to be more of a hindrance rather than useful. For the past year he has been building products with the help of AI coding assistants and then offloading thousands of lines of code to the dev team to sort out and transform fit for production. From the very beginning requirements gathering has been non existent. Market research, client needs… these are like curse words in our company. CEO has an idea. He vibe-codes it for a month and then leaves a steaming pile of mess for the rest of the team to sort out. We scramble for days to make sense of it and then over the weekend he drops a v2 of his initial product and the scrambling begins all over again. Last year we spent more than 8 dev months on a product, we managed to onboard one client and now it’s getting decommissioned in favor of his newest idea. \n\nFor one of our other products I tried to bring structure into it, established a timeline, he went on the Sales team chat, said the product is “ready” and they can put client on it. I piped in to say that internal testing isn’t finished, we have 4 more weeks on the timeline and I wouldn’t define the product as “ready”. For which I got a chewing directly from the CEO that I “need to understand my role better” and that I can’t keep blocking sales. Which, I swallowed as feedback and rolled with it. The problem is that, 2 days later he was supposed to demo this specific product to a prospective client and some things didn’t work as expected. Then I got another chewing that “this is badly broken and whatever testing plan you put in place was clearly inadequate”. That’s the point I checked out of the job and nowadays I just do the bare minimum. \n\nIt’s hard to put a testing plan together - I don’t have QA testers, I have no requirements, and every time I mention “acceptance criteria” he looks at me like I just cursed his mothers. \n\nI’m allowed to ask him concrete questions on priorities but I have to “spare him the general chitchat” \n\nSales team have meetings with prospective clients, they pass down client needs and market gaps that need filling and I prioritise features based on that. On the next morning, CEO completely overturns priorities because he just spoke to one client and that one client absolutely has to have that one feature this instant. \n\nOn one morning standup he tells me “prioritise this project” and I do - assign resources, draw timelines to the best of my ability, try and chase him to sign off on the plan. And then I learn that 2 out of the 3 resources I assigned have been pulled in other “urgent tasks” and my timeline gets delayed by certain amount of time. And then I get blamed for the delays and insufficient planning. Head of Engineering chewed me once in front of the whole dev+sales team for putting in buffers in my timelines and how that’s misleading and “hurting transparent communication between departments” \n\nMy dev team is just spitting out code to the bare minimum of standards because they are tired of the mess. \n\nWhen I try to enforce change control the CEO goes behind my back straight to devs and wrested them into doing what they want. \n\nMVP is a dirty word and “we can’t expect to turn a profit selling people the bare minimum”. \n\nAnd on and on I can talk about the inadequacy of the whole company. \n\nI have tried all kinds of approaches to stabilise things. But for most of the time nobody listens to me or follows the processes I try to implement - I have been undermined so many times, I have no real authority or voice anymore. \n\nI don’t manage projects - I scramble to write documentation after the fact. I sit in awkward calls where I have to tell stakeholders that what they see demoed in the CEO’s local environment is really nowhere near an accurate representation of the current status of the project. \n\nHow do you deal with a situation like this? I’m burnt out and lost all motivation to try and change things. I’m ready to throw in the towel but can’t afford to remain without a job at the moment. So any coping mechanisms and suggestions would be very very appreciated ",
      "is_original_content": false,
      "link_flair_text": "General",
      "permalink": "https://reddit.com/r/projectmanagement/comments/1r4idwk/i_feel_like_a_glorified_notetaker/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o5c4jmg",
          "author": "ApantosMithe",
          "text": "Sorry you’re in this situation, I’d set time aside to look for other roles - even if the company doesn’t go bust, you don’t deserve to be in this situation.\n\nYou have some experience from this role now, look for another",
          "score": 12,
          "created_utc": "2026-02-14 13:30:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5ci1ea",
              "author": "Kind_bite91",
              "text": "Yeah, I’ve been looking for another role. As soon as I line something up, I’ll be out that door like a dream.",
              "score": 3,
              "created_utc": "2026-02-14 14:51:30",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5bvc0k",
          "author": "Rosyface_",
          "text": "To be perfectly frank, leave. Find something else immediately and get out. There’s no changing what this absolute fuckwit is doing and you’re gonna go down with the ship unless you get out.",
          "score": 12,
          "created_utc": "2026-02-14 12:23:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5h6oeh",
          "author": "karlitooo",
          "text": "This is my experience with startup life also. Founders who can get from zero to one through sales tend to be chaos agents.\n\nYou have to win trust. That means being honest and not defensive. Consider radical candor the book. Don’t challenge, just give them information and ask for decisions. \n\nYou cannot rely on documentation. Plans reflect conversations not conversations about plans. Have the current plan in a simple visual format ready to go whenever a conversation turns to an impact on the plan, show the picture and ask for a decision on trade-offs.\n\nKeep spamming the plan into slack, consider having your own channel for and forward it to other channels. You have to keep the plan visible and simple. \n\nKeep buffering. Fuck the cto. Call it something else.\n\nOnce you have trust start the conversations about one plan vs secret work. Suggest ways to reduce chaos but don’t try to own them, let the cto drive change, try to make it so they’re his ideas.\n\nYou will never learn good project management form at this company but you will learn how to live in chaos without having a breakdown. Own the plan, communicate the changes, don’t be stressed about everything being on fire. It will always be on fire.\n\nEventually they will hire you a boss who will stand up to your ceo. That will never be you because you are pigeonholed. Stay until you find something better",
          "score": 11,
          "created_utc": "2026-02-15 08:21:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5hbjgw",
              "author": "Kind_bite91",
              "text": "I hear you and I agree with you on many points. To an extent I have tried doing what you suggest. I have published and tagged people to the project plans multiple times in the past. In the beginning, there was more trust between us all I think. Then I started calling the CEO out more and more on the things that cause problems. And now we are in the situation where I am a big thorn in his side. I’m under the impression that the more I try to do my job adequately the worse it gets. \nThe only thing I have to add is that eventually, I will be the third PM to leave the place.",
              "score": 3,
              "created_utc": "2026-02-15 09:08:06",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5dkgxq",
          "author": "Kombucha-Papi",
          "text": "Get out of there.",
          "score": 8,
          "created_utc": "2026-02-14 18:08:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5c323z",
          "author": "whiskeywannabe",
          "text": "No advice, just here to commiserate. Also dealing with a similar problem but within a multibillion dollar matrix organization with 7000+ employees. We are trying our best in the PMO, but some days I ask myself if I’m a masochist because trying to implement a discipline that helps execute major transformation initiatives has been PAINFUL.",
          "score": 6,
          "created_utc": "2026-02-14 13:20:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5eupp8",
              "author": "More_Law6245",
              "text": "The reason on why it's painful is because you're a professional practitioner who takes pride in their work, every PM (and PMO practitioners) goes through feeling this because they want to the do the best job they can but it can be very difficult when the organisation doesn't appreciate the governance needed in delivering an on time, on budget and fit for purpose project but yet these are very people who are the first to scream blue murder when it doesn't happen. Just take the satisfaction that you care about what you do because it wouldn't be so difficult if you didn't.",
              "score": 7,
              "created_utc": "2026-02-14 22:12:48",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5gfpvz",
                  "author": "whiskeywannabe",
                  "text": "Wow, I feel like you are inside my head. I appreciate the kind words of wisdom!",
                  "score": 3,
                  "created_utc": "2026-02-15 04:23:26",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5bqsqw",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 5,
          "created_utc": "2026-02-14 11:44:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5cphwe",
              "author": "projectmanagement-ModTeam",
              "text": "Thanks for your post/comment.  \n\nWe removed this post because it's in direct violation of our \"solicitation / self-promotion” rule.  \n\nPlease review these rules, which can be found in the sidebar.\n\nThanks,\nMod Team",
              "score": 1,
              "created_utc": "2026-02-14 15:31:42",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5ethx5",
          "author": "More_Law6245",
          "text": "This is your Kobayashi Maru test! You're in a no win scenario! To be brutally honest unless you're actually willing to hold your CEO to account, it's the only way that you're coming out of this with your reputation in tact.\n\nThese type of situations is where you earn your stripes (experience) as a PM, you just need to ask a simple and difficult question of your CEO, what is his priorities because you can only deal in the triple constraints of a project's time, cost and scope and all you have to ask is which constraint does your CEO want to change.  It's blunt, it's to the point and it's his decision, he just has to deal with and take responsibility for his decision. To be perfectly honest by confronting your CEO this is how you earn your seniority as a project practitioner and experience in handling difficult project stakeholders.\n\nHere is a reflection point for your consideration, if you keep capitulating to his over riding demands, you will be perceived as incompetent because you can never deliver on time but if you start placing the responsibilities back on to your CEO it becomes his issue and not yours. Remember decisions have consequences, you just need to highlight that your CEO with the impact of what he is doing but you need be pointed and ask if he is willing to accept the responsibility of those decisions. Something to keep in the back of your mind, if you don't learn to control or stand up to your CEO to hold him accountable, how are you going to go with your next role and you have the same type of personality to deal with, are you changing jobs again? Just a thought. Either way I hope you find the right solution to your situation but remember to look after yourself because you're in a very stressful situation, it's really up to you on how you want to approach this difficult stakeholder.\n\nJust an armchair perspective.",
          "score": 4,
          "created_utc": "2026-02-14 22:06:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5gh5az",
              "author": "Logical-Bookkeeper77",
              "text": "May be ask for a 5-10 mins after meeting to seek his advice say after a meeting just the 2 of you. \n\nAnd ask there’s a previous comment on XXXX, should we still proceed with it?",
              "score": 2,
              "created_utc": "2026-02-15 04:34:23",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5miiqk",
          "author": "sdarkpaladin",
          "text": "Sounds like the captain of the ship don't know how to steer.\n\nAbandon ship",
          "score": 2,
          "created_utc": "2026-02-16 03:46:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5bpar9",
          "author": "AutoModerator",
          "text": "Hey there /u/Kind_bite91, have you checked out the [wiki page](https://www.reddit.com/r/projectmanagement/wiki/index) on located on r/ProjectManagement?  We have a few cert related resources, including a list of certs, common requirements, value of certs, etc.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/projectmanagement) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-14 11:31:16",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r0h4pe",
      "title": "If I’ve flagged something everyday for 3 months. Is this a leadership issue?",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1r0h4pe/if_ive_flagged_something_everyday_for_3_months_is/",
      "author": "the-anonymous-ghost",
      "created_utc": "2026-02-09 21:27:00",
      "score": 26,
      "num_comments": 14,
      "upvote_ratio": 0.91,
      "text": "Basically this, If we are delayed and I’ve continuously flagged something everyday day for 3 months as it relates to our Tech projects. I’ve reached out to management almost every week about it. I’ve reached out to the specific person that hasn’t been doing their job.\n\nI’ve went on calls. I’ve tried to make things easier to transfer data. Made various docs. And to no avail we are 1 day before we make updates to which we will have to push.\n\nAm I to blame or does our company need to work on situations like this. If we don’t update it’s not my fault and its not on me to know specialized info that my peer knows and evaluates for.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/projectmanagement/comments/1r0h4pe/if_ive_flagged_something_everyday_for_3_months_is/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o4iaa12",
          "author": "pmpdaddyio",
          "text": "You've over documented the issue. Let the individual fail, and subsequently the project if that is an outcome. You are covered by your notifications and documentation. Hopefully you logged this as a risk, then an issue with the assignments.",
          "score": 20,
          "created_utc": "2026-02-09 21:52:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ib2e4",
              "author": "InfluenceTrue4121",
              "text": "Spot on. It’s so easy to ignore endless emails but way more tricky to ignore a big, fat risk with your name all over it.",
              "score": 8,
              "created_utc": "2026-02-09 21:56:44",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4i69ej",
          "author": "wittgensteins-boat",
          "text": "Leadership does not care to act. \n\n\nFor apparently undisclosed and undiscussed, and undiscussible  reasons.  \n\n\nYou have made your report.  \n\n\nIf the blame game is played, you have the documentation trail and notified warning about  failure to act indicated.  \n\n\nIs there a report about consequences to failing to act?  What also will occur, at what cost, and project completion time period delay, and follow-on target deadlines, and reputational loss, for failure to comply with the plan?\n\n\nYou could, if you so desire, discuss in person with senior people to understand why there is no intent to act.  Start with Senior people nearest to you on the project  organization chart.\n\n\nUnclear if your job is at risk for raising undiscussible plans for failure according to the current plan.",
          "score": 11,
          "created_utc": "2026-02-09 21:32:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4kcmkg",
          "author": "Fantastic-Nerve7068",
          "text": "not your fault at all you did the right thing by flagging the risk early and consistently if leadership didn’t act on it for three months that’s not a comms issue that’s a prioritization and accountability issue on their side at some point it’s not about how loud or often you raise the flag it’s about whether the system is set up to respond and clearly it’s not this is absolutely a leadership gap not a delivery one",
          "score": 9,
          "created_utc": "2026-02-10 05:07:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4j40na",
          "author": "More_Law6245",
          "text": "Throwing your hands up and saying \"it's not my fault\" is not a professional look you want, especially when you're left holding the bag (rightly or wrongly). It's why you have your project controls for your issues and risk log and it actually assists you in matters like this. You should be formally presenting these issues and risks to your project board/sponsor/executive and clearly articulate with a problem statement and the impact. In addition you should have ready a proposed plan or mitigation strategy to support the problem statement. Then you need to articulate what you're expecting from the relevant stakeholders (e.g. a decision on course of action or additional time, cost or scope etc.) and highlighted the impact if they fail to support you. This is about your maturity as a project practitioner, this is actually your responsibility being the PM to the project, this is also about you understanding roles and responsibilities within a project structure.  \n\nIF and only if your project board/sponsor/executive fails to address any of your issues or perceived risks then it becomes their problem under roles and responsibilities because you have covered your professional standing with documented evidence that can't be disputed and if any issue or risks that come to fruition that is at the organisation's peril. As the PM you can only highlight the risk and issues, you have formally asked for assistance and guidance through the project controls and if the appropriate stakeholders fail to act it's on them and not you. \n\nYour statement of \"you tried\" but the reality is that you haven't formally enacted your project controls and the associated reporting mechanisms, do you have written problem statement (issue, risk or white paper etc.)? Do you have a proposed course of action? Do you have a responsible person (s) or team who understands that they own the issue or risk? Do you have an agreed due date or a mitigation strategy initiation date? These are all the things you get when you formally escalate through your project controls, speaking up in forums and making various documents doesn't constitute to holding people to account! \n\nJust an armchair perspective. ",
          "score": 21,
          "created_utc": "2026-02-10 00:31:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4kz734",
              "author": "Chicken_Savings",
              "text": "I think you are spot on.\n\nSometimes as PM, we can see that it's going to crash, and with our subject matter understanding / expertise, we try to work with the team member to fix it, and we keep telling our leadership informally that it's a risk that's building towards a crash. May even write that in emails.\n\nBut we may be so focused on trying to do something that we fail to execute the formal project controls.\n\nIt shouldn't be told to management every day. It should formally be escalated to project sponsor and / or steerco, with formal project status report, risk description, suggestions for actions, request for a decision.\n\nI have once failed myself by doing exactly this - telling management several times a week, trying to help fixing it myself, watching the train drive towards the crash... and crash. That was a major lesson learned for me, and I now activate the formal controls instead of endless informal emails and calls.",
              "score": 3,
              "created_utc": "2026-02-10 08:22:46",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4o9tpo",
                  "author": "More_Law6245",
                  "text": "A good PM only needs to experience this type of situation once, I'm also a member of this club and we even have T-shirts too.  To be honest it was one of my more harsh lessons when I was first starting out, the concept of roles and responsibilities hadn't really sunk in and I was trying to \"fix everything\" and taking on other's responsibilities. ",
                  "score": 3,
                  "created_utc": "2026-02-10 19:59:51",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o4lyifd",
              "author": "maninkka4",
              "text": "This helps,  thank you. I am no PM but actually trying to do the work of one in a subjectively rather informal setting, but this is sth I should do anyway - going to \"proper channels\" even though no one would blame me for the outcome.. I want it to succeed. \n\n\nArmchair perspective eh? Seems like you know what you are taking about to me :)",
              "score": 3,
              "created_utc": "2026-02-10 13:17:58",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4ocga5",
                  "author": "More_Law6245",
                  "text": "You have a great professional attitude and maybe you should actually consider formalise your standing as an accredited PM, it's definitely a very portable skillset and makes you a little more attractive to a potential employer.  Just as a reflection point, being in your situation it does become really important to understand roles and responsibilities (particularly the latter) when you're not formally assigned as a \"project manager\" because what you're actually doing is being \"trusted to take on responsibilities\" but not having a professional standing or acknowledgment of your role, it does leave you a little exposed (good and bad).  Just something for you to consider.  \n\n  \nhuh, me know what I'm talking about .... I'm pretty sure I read this stuff on the back of a toilet stall door somewhere ;)\n\n\n\n ",
                  "score": 2,
                  "created_utc": "2026-02-10 20:12:11",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4ihswh",
          "author": "DrStarBeast",
          "text": "You've done everything you're able to do. Keep your CYA paper trail close and if anyone tries to pin this on you, point to the issues that you raised and kept going on as the reason it failed. \n\n\nDo not apologize or accept blame for this. Be ready to step up when someone tries to blame it on you. ",
          "score": 9,
          "created_utc": "2026-02-09 22:31:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4i8d1k",
          "author": "DesertMountainLvn",
          "text": "Do you have leadership within PMO that is positioned to raise the risk to execute leadership? That would be my move. If executive leadership is aware and has not engaged, then you've done all you can. Wash your hands and move on. \n\nWhen I worked in a position where there was not a PMO and I needed a VP to encourage work I was unable to influence, I reached out to the project sponsor and encouraged them to engage their VP. That VP called the VP for the party responsible for the work (happened to also be my VP) and explained the risk (loss in the millions for the org). Blocker was removed immediately. It was much more effective than if I were to have made the call myself.",
          "score": 4,
          "created_utc": "2026-02-09 21:43:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4inkd8",
          "author": "Longjumping-Wafer102",
          "text": "you already do all your best",
          "score": 6,
          "created_utc": "2026-02-09 23:00:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ikplp",
          "author": "Stebben84",
          "text": "If it was a risk, was a mitigation plan put in place. If so, how will that be executed. If that did not work, it becomes an issue to log and document how that will addressed. That all you can do. This is your work and hence not your fault. If it fails it fails. Success relies on the team and not solely on the PM.",
          "score": 1,
          "created_utc": "2026-02-09 22:46:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5gkyz1",
          "author": "Logical-Bookkeeper77",
          "text": "Plan the remediation plan if it’s impacting your project and raise it in steerco.\n\nAND clearly documented the decision and by whom.",
          "score": 1,
          "created_utc": "2026-02-15 05:04:04",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r1zc7c",
      "title": "(User based Recommendation) Apps that I’m using in 2026",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1r1zc7c/user_based_recommendation_apps_that_im_using_in/",
      "author": "anonymous5090",
      "created_utc": "2026-02-11 14:48:52",
      "score": 26,
      "num_comments": 17,
      "upvote_ratio": 0.91,
      "text": "New year so figured I'd share the tools that actually stuck around after trying way too much stuff last year. These are the ones I genuinely use not just installed once and forgot about.\n\n* Claude directly in the app for quick scripts. Faster than spinning up a project for something I'll run once.\n* n8n for automations. I know a majority of you have used this. Self hosted it and forgot about it which is exactly what I want.\n* Thinklistapp with their AI features for docs. Not groundbreaking but having everything in one place matters. Helps alot when it comes to executing tasks daily. Although it's a paid app, and I could potentially do the same thing with ChatGPT.\n* Langsmith for tracing LLM calls. Saved me so many times when something breaks and I need to see what happened. \n\nWhat tools survived your 2025 culling? ",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/projectmanagement/comments/1r1zc7c/user_based_recommendation_apps_that_im_using_in/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o4t29qr",
          "author": "AutoModerator",
          "text": "Attention everyone, just because this is a post about software or tools, does not mean that you can violate the sub's 'no self-promotion, no advertising, or no soliciting' rule.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/projectmanagement) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-11 14:48:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ujrzt",
          "author": "Available-Budget-735",
          "text": "This is all for project management?",
          "score": 5,
          "created_utc": "2026-02-11 19:01:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4thn4o",
          "author": "Consistent_Voice_732",
          "text": "Langsmith-style LLM tracing is a game changer-wish I used it sooner  ",
          "score": 2,
          "created_utc": "2026-02-11 16:03:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4tt0qo",
          "author": "Comfortable-Garage77",
          "text": "Gpt for the win, but now gradually switching to gemini. Also use grammarly extensively for my writing and saner to manage my tasks via chat. But that's all, all roads lead to Google sheet finally lol",
          "score": 1,
          "created_utc": "2026-02-11 16:56:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o51nxqo",
          "author": "More_Law6245",
          "text": "OP I have a question, so what skills are you learning in the advent you suddenly don't have systems at your disposal? \n\nAs a program director I'm starting to witness PM's skills coming up short because they have become too reliant on systems or tools, they come unstuck because they have either forgotten or they didn't learn underlying project management principles",
          "score": 1,
          "created_utc": "2026-02-12 20:40:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o522dag",
          "author": "erilysse",
          "text": "Notion for managing my todolist, projects and OKRs.\n\n\nI'm currently trying to make some task easier so using Claude Code and n8n yes. (For data analysis, and automatic reminders for people so i don't have to remind each month everyone what's they're accountable for). \n\n\nI could not use it but I try to understand the cases where it could be useful and where It's not. Like being less in AI FOMO and more in.. knowing what' it's actually capable?\n\n\nM365 is always there lurking in the shadows for some easy collaborative work (I'm in a tech-adverse company).",
          "score": 1,
          "created_utc": "2026-02-12 21:48:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o544da6",
          "author": "Fantastic-Nerve7068",
          "text": "Celoxis is the one platform that’s still holding strong in my stack. It’s not flashy but ridiculously reliable for cross team project visibility, resource capacity planning and actual delivery tracking without me babysitting everything. Bonus points for the built in timesheets and reporting I don’t have to manually build every week.\n\nAlso still using Notion for internal docs and meeting notes (paired with an AI summary agent now), Slack for team comms, and Raycast for speeding up damn near everything on the Mac.\n\nChopped a lot of “productivity” stuff last year that turned out to be more aesthetic than useful. What stayed either automates something painful or keeps my team moving without me needing to micromanage it.",
          "score": 1,
          "created_utc": "2026-02-13 05:12:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4t46k8",
          "author": "subtlesub29",
          "text": "🤮🤮🤮🤮🤮",
          "score": -1,
          "created_utc": "2026-02-11 14:58:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4t5oiy",
              "author": "Suspicious-Camera489",
              "text": "Do you think you can manage to elaborate your comment a bit more?",
              "score": 2,
              "created_utc": "2026-02-11 15:06:18",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4wywiq",
                  "author": "karlitooo",
                  "text": "Because it’s spam: https://www.google.com/search?q=thinklistapp+%22anonymous5090%22+site:www.reddit.com&sca_esv=04aa8d85dd72ea04&rlz=1CDGOYI_enGB771GB771&hl=en-GB&prmd=ivsn&sxsrf=ANbL-n7kSso3x1jOorfybwPcyBUnWevYPg:1770864084554&sa=X&ved=2ahUKEwiG_9Hl9tKSAxXgumMGHZQ6IwMQrQJ6BAggEAY&biw=375&bih=634&dpr=3",
                  "score": 2,
                  "created_utc": "2026-02-12 02:42:13",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o5e0si3",
                  "author": "subtlesub29",
                  "text": "https://techpolicy.press/how-ice-uses-ai-to-automate-authoritarianism",
                  "score": 1,
                  "created_utc": "2026-02-14 19:30:16",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4u49it",
          "author": "Smooth-Trainer3940",
          "text": "Never heard of Thinklistapp, seems cool. I might check it out. I use Text Blaze instead of n8n and it works well enough for me. Thanks for sharing!",
          "score": 0,
          "created_utc": "2026-02-11 17:49:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4u3k15",
          "author": "Papyrusblack",
          "text": "ChatGPT for content strategy \nOboard OKR software for goal tracking\nBase44 for spinning up apps to solve my unique problems\nGoogle Docs for everything note taking",
          "score": -1,
          "created_utc": "2026-02-11 17:46:11",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r06sqy",
      "title": "Selling team members on the benefits of a project plan",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1r06sqy/selling_team_members_on_the_benefits_of_a_project/",
      "author": "BreakNo7825",
      "created_utc": "2026-02-09 15:14:42",
      "score": 19,
      "num_comments": 26,
      "upvote_ratio": 0.96,
      "text": "Looking for any lessons learned or recommendations on getting team members on board with the idea of developing project management plans for our projects.\n\nI work for an organization that has historically performed very little planning prior to jumping into execution and the project managers have typically held a more reactive approach to issues in the projects. I’ve sold the idea of implementing formal PMPs with functional managers but at the end of the day, it’s the project team members, invluding our PMs, who need to adopt the idea wholeheartedly for it to be useful and successful. Has anyone else led such an adoption?\n\nIndustry is custom equipment design and manufacturing and lends itself to a waterfall approach. ",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/projectmanagement/comments/1r06sqy/selling_team_members_on_the_benefits_of_a_project/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o4gu07t",
          "author": "AldronProjectLab",
          "text": "I've been there. The key point is this: no one is convinced by a \"well-done PMP,\" but only by the pain it avoids. You have to create value.\n\nIn environments accustomed to starting immediately, the plan is perceived as unnecessary bureaucracy until you explicitly connect it to real problems already experienced: rework, late changes, stalled suppliers, decisions made too late, unclear responsibilities. The plan must serve to protect the team.\nIt works much better to start light: a few clear elements (scope, milestones, dependencies, obvious risks), built together with the team and not \"delivered.\" If the plan is conceived as something that helps us work better tomorrow, it is used and can evolve. If it is conceived as a document \"to keep things in order,\" it is circumvented.\n\nLast thing: don't call it a \"PMP.\" Call it a way of working, an initial agreement, a project map. Change the name, change the perception 😉",
          "score": 9,
          "created_utc": "2026-02-09 17:38:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4g1ph4",
          "author": "DrStarBeast",
          "text": "It's easy when you don't try and force the entire PMI tool kit down a small company's throat. \n\n\nInstead, sell a \"right sized \" process that adds necessary checks and balances while maintaining the agility your company expects.\n\n\n Only you know what this is from the issues you faced previously ",
          "score": 7,
          "created_utc": "2026-02-09 15:23:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4g4o7t",
              "author": "BreakNo7825",
              "text": "That is a valid point and I completely agree. I’m definitely encouraging our group to scale it to the size and importance of the project.",
              "score": 3,
              "created_utc": "2026-02-09 15:38:12",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4g670y",
          "author": "cbelt3",
          "text": "Someone IS doing project planning. They just call it production planning. Unfortunately you need to get senior management to own it.\n\nHaving been on that space, I will advise this:\n\nDo NOT use the whole model for every project. Multi year large projects need more control. Short one month projects … you can manage with a checklist. \n\nToo many people insist on applying the whole toolset to all projects. That’s not what PM Is about. It’s not a bureaucratic control system. It’s a framework that is sized to fit what word right.\n\nI once got called into a division to recommend a PM approach for their projects. I listened. Went to an office supply store. Came back with a package of index cards and a card box. Because that’s all they needed.",
          "score": 5,
          "created_utc": "2026-02-09 15:45:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4hx9v5",
          "author": "More_Law6245",
          "text": "This is not a \"team issue\" this is an organisational culture issue and realistically needs to be support from the executive down with the relevant support from change champions and agents. Most people don't see the relevance with corporate governance and generally perceive it to be an overhead in their daily working lives but the simple matter of the fact is that it's a cost effective measure, it helps delivery quality and ensure the company remains profitable and keeping these very people who are change resistant employed but most of all it assists with organisational reputation which even some PM's don't actually realise the importance of when delivering a project.  When you have a project that runs over time, budget or is not delivered cleanly, that is the impression your client gets and that is the image that is being projected by the organisation, unplanned projects is a bad image for the organisation, planning projects shows a professional organisation.  The key thing to remember your organisation is only as good as its last project!\n\nJust an armchair perspective.",
          "score": 5,
          "created_utc": "2026-02-09 20:48:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4kcqk7",
          "author": "Fantastic-Nerve7068",
          "text": "it’s tough shifting a reactive culture into one that values upfront planning especially when people see plans as “extra work” or “slowing things down” the thing that helped most was framing the plan not as a doc but as a painkiller literally say something like look this is how we stop chasing our tails in month three or how we avoid those last-minute redesigns that wreck our margins when people see it as a shield not paperwork they lean in also get quick wins like a short risk section that actually helped dodge a delay once and suddenly folks start asking “is that in the plan” instead of rolling their eyes just gotta show that it reduces their headaches not adds to them",
          "score": 4,
          "created_utc": "2026-02-10 05:08:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4hvkp0",
          "author": "Revolutionary-Can680",
          "text": "Gotta test it. The proof will be in the data. Pick 1-2 projects and provide a PP for those. Monitor hours/budget, timeline adjustments and general team sentiment. Do a retrospective for those projects and find out what needs to be tweaked. Present to stakeholders for buy in if data is positive.",
          "score": 3,
          "created_utc": "2026-02-09 20:39:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4le6ls",
          "author": "buildlogic",
          "text": "You can start with one visible project that's currently a dumpster fire and use the plan to solve their actual pain points, show them how 15 minutes of planning prevents the 3-hour emergency meeting they all hate. But don't sell it as formal PMPs, sell it as \"so we stop getting blindsided by the same issues every single project\", make the plan solve their problems, not yours, and they'll adopt it because it makes their lives easier.",
          "score": 3,
          "created_utc": "2026-02-10 10:47:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4goqwk",
          "author": "pmpdaddyio",
          "text": "Tell them that without a project plan you need to grab gasoline and find a dumpster. Light it on fire and all of you jump in.",
          "score": 2,
          "created_utc": "2026-02-09 17:13:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4h5ihq",
          "author": "Chicken_Savings",
          "text": "They already do production planning, which is different from project management. It's not like every worker just rock up each morning, produce something random based on whatever raw materials and WIP materials are lying around.\n\nYou can try to identify frequent occurring problems that would likely be avoided by investing in the administrative burden of PM. If you can't find any, then maybe PM isn't the right answer.\n\nMay I suggest to look up MRP2 and see if you can steal some ideas from that, or Production Planning Methodologies.\n\nI'm not saying that you can't implement PMBOK, just saying that perhaps it is not the right toolkit.\n\nMaybe something like this would be helpful:\n\nhttps://www.odoo.com/app/manufacturing",
          "score": 2,
          "created_utc": "2026-02-09 18:32:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4h5mhg",
          "author": "TylertheDouche",
          "text": "I’m kind of confused by this. The pushback is they don’t want to plan? What is the actual pushback? Too many checkpoints?",
          "score": 2,
          "created_utc": "2026-02-09 18:33:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4humvy",
              "author": "More_Law6245",
              "text": "Resistance to change itself and there is no immediate benefit realised or answering the question of what's in it for me from individuals. This is where having change champions and agents becomes very important when invoking organisational change. At the moment, planning is perceived as an overhead because it hasn't been done in the past, so having no experience with project plans leads to the change resistance. This is important in showing how planning will improve or benefit both the organisation and individuals with the myriad of problems they currently experience now with an unplanned approach.\n\nJust an armchair perspective.",
              "score": 3,
              "created_utc": "2026-02-09 20:35:16",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o4hkvuy",
              "author": "BreakNo7825",
              "text": "I’d say one argument is that it’s added work. Or at least some will perceive that to be a major hurdle.",
              "score": 1,
              "created_utc": "2026-02-09 19:46:05",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4hlrig",
                  "author": "TylertheDouche",
                  "text": "What is the added work though? Like what is the literal thing now that they will have to do that they aren’t doing? That’s what i would want to know to see if there’s any compromise. \n\nIf they don’t want to plan, that’s one thing. But if they just don’t want 47 checkpoints and you can minimize that then that’s something you can probably do.",
                  "score": 1,
                  "created_utc": "2026-02-09 19:50:26",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4hju8r",
          "author": "LowSkyOrbit",
          "text": "Change comes from failures and lessons learned. Buy in won't happen without some results or clear vision. That can't come from someone saying we need to document more and align our mythology.\n\n Look at the current projects and check in to see what issues they are having. Don't ask them how you would fix it. Ask them what they would do to make their jobs easier. Find the pain points and present to leadership. Suggest what might be course for improvement. Have examples.",
          "score": 2,
          "created_utc": "2026-02-09 19:40:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4l0pmp",
          "author": "impossible2fix",
          "text": "Don’t start with a full PMP or big docs. Start with just enough planning to answer the questions people already care about: what’s coming, what’s blocked and who’s overloaded. When teams see fewer surprises, less rework and clearer handoffs, buy-in follows pretty naturally.",
          "score": 2,
          "created_utc": "2026-02-10 08:37:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4g5dxq",
          "author": "Victorsarethechamps",
          "text": "Baby steps, for sure. Try to implement one small, beneficial change. Make that the norm, and then work on the next one. I did this with my current company with medium success. Strongly encourage the full buy-in, though. Once they see the small changes, they may see the light for the big changes.",
          "score": 1,
          "created_utc": "2026-02-09 15:41:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4gbsj5",
          "author": "ConfectionOver3951",
          "text": "Following this thread because my department is the same way. Everyone in the division is doing one off projects and nobody is keeping track of them. I will pitch that we need a program manager/ product manager to help execute this ideas and projects",
          "score": 1,
          "created_utc": "2026-02-09 16:12:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4gi7bj",
          "author": "thatburghfan",
          "text": "Are there ever any external conflicts about scope or milestones? ",
          "score": 1,
          "created_utc": "2026-02-09 16:42:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4gjfz9",
          "author": "1z1z2x2x3c3c4v4v",
          "text": "Why do you want to do this?  What do you expect to get at the end?  What problem are you trying to solve?   And what is the ROI for all the effort one must put into your plan?",
          "score": 1,
          "created_utc": "2026-02-09 16:48:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5glxkg",
          "author": "Logical-Bookkeeper77",
          "text": "PMP… is just a collective of tools and you need to tailor it to your needs.\n\nStart with the essential stuff like a business case and come up with standard template.\n\nImplement a process where checkpoints approval with these artifact with management or project won’t be endorsed to go ahead.\n\nWaterfall is fine, but I would recommend on breaking it down design / delivery phases more agile for easier time to validate if any changes are needed.",
          "score": 1,
          "created_utc": "2026-02-15 05:11:39",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r2i6fs",
      "title": "Tough stakeholders- how to work with difficult people?",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1r2i6fs/tough_stakeholders_how_to_work_with_difficult/",
      "author": "apfrkf",
      "created_utc": "2026-02-12 03:03:53",
      "score": 19,
      "num_comments": 13,
      "upvote_ratio": 1.0,
      "text": "I need some help to figure out this situation. \n\nFor context: I am a newer PM- 3 years in project coordinator role, and coming up on 6 months as a PM in a new company and a new industry. \n\nI work with an engineer who is their own worst enemy and stresses themselves out to the max because they’re “overworked”. I don’t doubt they have a lot of work that could be done, but he’s actively managing a lot less work than other coworkers of similar skills/tenure. He also publicly talks badly of his boss, and anyone else around him that doesn’t give him slack.  He’s in general unwilling to communicate his problems to find a resolve and doesn’t seem able to manage his time or emotions. \n\nI have been slowly onboarding into the role, primarily assisting with other projects currently underway and recently received my first three full time projects. Along with projects I also work on quoting future projects for labor and materials. \n\nThe issue is due to the aforementioned engineer being his own worst enemy, he tends to mail things in without looking into them as he should. Now, my PMO team I’m now working with is not a strong PMO team and also has been stretched thin over the last year. They haven’t been checking bill of materials like they should leading to a surge of internal (ie non-billable) request forms being filled out for replacement materials.\n\nI happened to catch over 30 missing items on a BOM for a repeat build, that was missed on the BOM. AND- it was also missing on the previous BOM from the same engineer. Why? Because he didn’t review the change request forms from the previous project. \n\nHe’s now very upset with me that I dared bring this up and actually asked him to fix the issue, and not continue to kick the can down the road. He tried to continue to kick the can down the road, but I had a hard deadline and eventually had to loop in his boss. The boss he hates. \n\nQuestion posed: how do you work with stakeholders who are their own worst enemies/ don’t get things done? I fear he’s the kind of worker who will not improve ever- so, building a relationship with him and giving him tools may not be effective. I’m okay with not being liked by him. He’s not especially likable to be honest. However, I worry him expressly disliking me will harm his ability to get work done. Advice? Thoughts?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/projectmanagement/comments/1r2i6fs/tough_stakeholders_how_to_work_with_difficult/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o4x2j0c",
          "author": "AutoModerator",
          "text": "Attention everyone, just because this is a post about software or tools, does not mean that you can violate the sub's 'no self-promotion, no advertising, or no soliciting' rule.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/projectmanagement) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-12 03:03:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4xk1se",
          "author": "Neither_Cover_4330",
          "text": "What I've learned over the years is that we are actually dealing with people, not robots. And these people all have feelings about yiu, your project, their workload, the company... everything. And those feelings can impact the project work.\n\nWhat's worked for me is that I \"mirror\" what I hear from them - to make them feel understood and to gain trust and a path to a successful working relationship. I usually try to get them on their own, and I'll start off with something like, \"So, Bob, how do you feel about our project? How do you feel about what you'll have to deliver?\" Notice I didn't ask him what he THOUGHT, but how he FELT. I take the time and give them the space to gripe... and I listen.\n\nI've learned a lot from people when I do this. One guy's coworker had quit, and he was trying to figure out fhow to juggle all the extra work. One young, new supervisor was a real bltch, and I found out it wss her first project, and she was afraid of failing because it had a lot of visibility.\n\nAnd then I let them know that I'm concerned - that I'm worried about them. And I ask them if they see any way I can help. Sometimes I can (maybe help get an additional resource assigned or create an extra report to track the project, for example). But I communicate that I care about their issues.... and that I know we both want the project to go well. And I ask them how I can help.\n\nI do this on a continuous basis throughout my projects. I keep asking people how thet FEEL, because that's a much better barometer of how things are going than if you ask them what they THINK. You'll hear that they're stressed or overworked or whatever, but your job is to assist however yoh can and to BUILD TRUST. Trust gains cooperation. If people like you, that gains cooperation, too.\n\nIt's a really rare thing that I have to bring out the \"big guns.\" I really don't need to. And if you polish your skills on how to build trust, how to develop relationships, and how to help people solve THEIR problems (not just have them solve yours) your projects will be much more successful.\n\nGood luck.",
          "score": 22,
          "created_utc": "2026-02-12 05:04:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4zo162",
              "author": "Wild_Instance_1323",
              "text": "good pm are good parents.",
              "score": 8,
              "created_utc": "2026-02-12 15:00:34",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o50pvot",
                  "author": "Soggy-Car-4548",
                  "text": "Yes. Parenting has been excellent prep for project management and management in general. As a parent, I learned quickly to identify root causes of issues where a stakeholder (child) is unable or unwilling to articulate the problem while screaming and crying in public. Adults that are difficult or melting down trigger my automatic slowdown and soften responses where I focus on listening and learning what the human needs. At the end of the day, empathy is the bridge. (FWIW, empathy is a trait that AI will not be replacing any time soon.)",
                  "score": 3,
                  "created_utc": "2026-02-12 17:59:11",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o4zxnj2",
              "author": "nborders",
              "text": "This is the way.  \n\nBut I would also keep your supervisor abreast of your plans. Good ones will back you up.",
              "score": 5,
              "created_utc": "2026-02-12 15:47:20",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o5c6atx",
              "author": "EatTheRich0",
              "text": "Best advice on this thread. Some of the most effective PM/Engineer relationships I’ve built over the years started at a very unproductive place. From my personal experience, anyone can be “flipped”, if you meet them where they are and work outwards. A skill that pays huge dividends.",
              "score": 3,
              "created_utc": "2026-02-14 13:41:31",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o51ld04",
          "author": "More_Law6245",
          "text": "The reality of being a project manager is that you can't be worried about what people think of you and over the years I have worked with many people as you have described and being in IT it would be fair to say when it comes to engineers you get to deal with some big egotistical personalities, especially when you start working in the enterprise space.\n\nThe way I approach these types of situations is I first have an informal 1:1 meeting and discuss the impact of their behaviour and how they affect project delivery (I always have supporting facts to highlight, so to not make it or have it perceived as an personal attack) what you outline is the impact of their behaviour and outline their responsibilities. You need to convey your expectation of what is and isn't acceptable behaviour to you as  you're the person who is responsible for delivering the project.\n\nYour next step if there is no change to the behaviour is to document and present to their immediate manager, highlight the impact of the individual's behaviour (again with verified facts) but this is where you start outlining the type of costs the project is incurring e.g days lost, time lost, additional unscheduled project costs but where you focus in on is the organisational reputational risk to the company and how this individual behaviour passes through to the client.\n\nIf you still don't get any assistance in the management of the unacceptable behaviour then you need to escalate through to your project board, sponsor or executive. This is the drawback from a PM perspective, because you don't own the resource you can't HR manage the individual. All you can do is highlight the unprofessional behaviour and the risks and impact of the individual's behaviour. Based upon my experience over the years sometimes you do need to have to have confrontation or conflict resolution management intervention, for me I'm sure as hell not going to be held accountable for someone's unprofessional behaviour but that's a \"me thing\". I've been around the block a few times and to be honest I refuse to accept behaviour like this because I have been really impacted in the pasts because of this type of behaviour and If I had the same attitude as a PM, I wouldn't be very successful and be out of a job very quickly, so why is this individual getting a hall pass?\n\nHere's a reflection point for your consideration, do think that it's fair that this individual isn't held accountable for their actions and you are as the PM? This comes down to the fundamental management skill, holding people accountable for their actions and to be perfectly honest I hold CEO's down to project support staff accountable because that is MY responsibility as a PM.  Good luck and I hope things work out for you.\n\nJust an armchair perspective",
          "score": 8,
          "created_utc": "2026-02-12 20:28:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5447dn",
          "author": "Fantastic-Nerve7068",
          "text": "yeah it’s rough dealing with someone who refuses accountability and punishes others for holding the line but here’s the thing your job isn’t to make everyone happy it’s to make sure the work gets done right especially when timelines and budget are on the line\n\nwhat helped me in a similar spot was treating these folks like unstable systems keep documentation tight escalate through the right channels early not emotionally just factually and always bring things back to impact not blame like “we missed 30 items which delayed production by x days and cost us y” not “you screwed this up again”\n\nalso build alignment with their boss whether or not they dislike each other because if leadership supports your clarity it gives you air cover to do your job you’re not there to babysit you’re there to deliver and if someone’s consistently undermining that let the record show it\n\nyou might not fix him but you can build enough structure that his chaos doesn’t wreck your ship good luck fr you're handling this better than most new PMs would",
          "score": 8,
          "created_utc": "2026-02-13 05:11:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4x9au2",
          "author": "choclatelabguy",
          "text": "Are you in the AV industry by chance?",
          "score": 1,
          "created_utc": "2026-02-12 03:47:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o52syx0",
              "author": "apfrkf",
              "text": "Audio visual? I am not.",
              "score": 1,
              "created_utc": "2026-02-13 00:11:12",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5cpua2",
                  "author": "wm313",
                  "text": "Are you in the controls industry? This sounds like controls engineers.",
                  "score": 2,
                  "created_utc": "2026-02-14 15:33:31",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1r0zy8h",
      "title": "Self-learning practical project management?",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1r0zy8h/selflearning_practical_project_management/",
      "author": "VladimiroPudding",
      "created_utc": "2026-02-10 12:54:30",
      "score": 16,
      "num_comments": 7,
      "upvote_ratio": 0.91,
      "text": "Hello all,\n\nI am currently in a weird spot. I recently went back to school to change gears and succeeded striking in last year, even with this horrid job market. I have some management experience under my belt from my previous career, including managing a small team and mentoring, and have made a project from scratch which, at the time, was in broad demand in the company. Meaning, I was just there to connect the dots and make a stuff everybody wanted. People were cooperative.\n\nNow, I am in a path that is totally new to me and... the company is a *brutal mess*. My boss doesn't know what the end goal/deliverable of their projects are, much less how to manage them (I mean, how can you manage the development of something you don't know what it is) and the senior managers under them are as oblivious. Everything is an amorphous blob. I feel like people are not jumping off ship because the company is in this limbo that deadlines don't matter much (think of something like public projects that take years to complete), so it is a comfortable place to be. \n\nHowever, because of some life planning of mine, I need to have a portfolio in this new career I have chosen, and I need it kinda fast, so I decided to create and manage my own projects. But because I am new in this career, and also because of the ethos of my company, I don't know exactly how to manage these projects. I did a course of project management and learned a bunch of fishbone diagrams and GANTT charts but they're all useless if I don't know exactly which steps to take and how much time to dedicate to them. Nobody will come to my rescue (no tutoring, coaching or learning where I am right now due to aforementioned reasons).\n\nSo, my question is: how to best be a self-learner and make my projects happen, in this environment? Thank you!",
      "is_original_content": false,
      "link_flair_text": "General",
      "permalink": "https://reddit.com/r/projectmanagement/comments/1r0zy8h/selflearning_practical_project_management/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o4oj5xa",
          "author": "More_Law6245",
          "text": "I commend you on your professionalism but there is a sailor's warning in your approach because one of the challenges you will experience is that you will have a difficult time enforcing organisational roles and responsibilities when there is no formal organisational project engagement model.\n\nI would highly suggest as part of your approach of getting off the ground is that you need to start seeking out change champions and agents and looking to influence your senior executive in the benefits of what you're doing e.g. being more cost effective and not wasting money off the company's bottom line. Also the other challenge you will face is change resistance, you need to be able to sell the benefits of your approach and answer a fundamental question from a work colleague perspective is \"how does this help me and what is in it for me?\". If you can't answer or demonstrate this you will be pushing a big rock up a hill. \n\nOne consideration is raising a white paper or business case to your senior executive and highlight the need for an organisational framework and a project engagement model, it has a two fold outcome. Firstly it shows the need for the business case and it potentially puts in you in a position to drive the organisational changes needed.  \n\nIn terms for you personally, I do recommend undertaking more formal accreditation to start providing you more context of project management frameworks an principles because by nature project management is an extremely broad discipline and there are many different ways to approach the same problem.  Your lack of experience may leave you will some challenges, having accreditation may just give you a bit more insight in how to approach the discipline holistically. Also keep in mind project management experience \"doesn't happen fast\" experience happens over time through failures and wins and it doesn't happen overnight. Good luck in your role \n\nJust an armchair perspective. ",
          "score": 7,
          "created_utc": "2026-02-10 20:43:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4lzzbi",
          "author": "pmpdaddyio",
          "text": "The first thing you need to do is grab the book [Bare Knuckled Project Manager.](https://www.amazon.com/Bare-Knuckled-Project-Management-Succeed/dp/0615813941) Tony Gruebel is a bit of a legend in project turn around. His company is brought in to fix projects and rerail them.\n\nNext, you need to take a step back and act like you are in the project initiation phase. Look at your team and figure out who you need active and who you need benched. Look at the SOW, then your requirements. If either is weak, you need to fix it. The requirements are easier but if you point out to the client the project is in the shitter, you might be able to convince them to provide an addendum.\n\nNow baseline everything. That way you can measure \"time now\" versus just restarting the project. Review all project artifacts, the project plan, RACI, RAIDD log, etc. Pull this information in when you rebuild. Come up with a new plan that builds off the baseline and a path to green. Determine the new definition of done, and along with that a new budget and schedule to present to the stakeholders and sponsor.\n\nNow the hard part. You need two recommendations, one is the fiscal impact of the sunk cost and project abandonment. This may be cheaper than you expect. The second is your new baseline plan. Get it in writing which path the stakeholders and sponsors want to take, and proceed.\n\nThis whole thing is not a PM issue, it is a leadership issue. Your role is to deliver the facts, not the assumptions.",
          "score": 4,
          "created_utc": "2026-02-10 13:26:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4m19bj",
          "author": "Old_Cry1308",
          "text": "honestly just treat it like you’re the only adult in the room write your own charter, define the deliverable yourself, break it down into tasks, guess timelines, track in a simple board and refine as you go it’s rough building experience in a place that chaotic but job hopping out is not easy with how hiring is right now",
          "score": 4,
          "created_utc": "2026-02-10 13:33:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4u4fso",
              "author": "Smooth-Trainer3940",
              "text": "This is good advice! \\^",
              "score": 1,
              "created_utc": "2026-02-11 17:50:16",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4lzdeo",
          "author": "Deflocks",
          "text": "I was self-learning PM, but it’s damn hard to make a “plan” if you don’t know what the “end game” looks like. Prior to becoming a PM (I was “borrowed” from a different team) I was in leadership for a large retail organization, so the soft people skills are easy enough. But the PM skills, I had no idea what to do.\n\nWhat I did: Took two courses through Coursera (Google Project Management & IBM Project Management) that offered certifications. Took the info I learned for both and applied it to my current role. Those courses helped me “map a path” for my projects, setup milestones, and prepare my projects.\n\n\nBut I have more information than you have… so YMMV.",
          "score": 1,
          "created_utc": "2026-02-10 13:23:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4n1sbm",
          "author": "A-n-o-v-a",
          "text": "Real world experiences thru internships or workshops should help. I only understood management science thru hands-on",
          "score": 1,
          "created_utc": "2026-02-10 16:37:28",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r4vo72",
      "title": "What are the methodologies you mostly use in project management?",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1r4vo72/what_are_the_methodologies_you_mostly_use_in/",
      "author": "Ok_Contribution_5709",
      "created_utc": "2026-02-14 20:55:37",
      "score": 14,
      "num_comments": 34,
      "upvote_ratio": 0.9,
      "text": "1. Alright So I’ve worked in smaller scale startups and we’ve usually used Waterfall or Agile. How often do you all use the other methods like Lean, SAFe, LeSS, XP etc?\n\n2. In your daily speaking, how much textbook jargon is actually used in daily language?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/projectmanagement/comments/1r4vo72/what_are_the_methodologies_you_mostly_use_in/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o5ehytz",
          "author": "Unicycldev",
          "text": "Honestly over time: none. \n\nThe agile manifesto itself says it well in its first line. \n\nIndividuals and interactions over process.",
          "score": 11,
          "created_utc": "2026-02-14 21:02:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5ek5ed",
              "author": "UnArgentoPorElMundo",
              "text": "And tools",
              "score": 2,
              "created_utc": "2026-02-14 21:14:55",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5h4x23",
          "author": "H0moludens",
          "text": "Never in my life has any single framework held up for long. In the end it is a mixture of ma y of those, which propagate the same thing with different terminology. \n\nI try to pick the most effective parts of what i currently need and get the team onboard. Keep it simple. ",
          "score": 12,
          "created_utc": "2026-02-15 08:03:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5k1ccg",
          "author": "dakrath",
          "text": "The ones that keep me under the radar whilst delivering what needs to be delivered.",
          "score": 7,
          "created_utc": "2026-02-15 19:15:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5gwowb",
          "author": "SuperTed321",
          "text": "JFDI",
          "score": 5,
          "created_utc": "2026-02-15 06:45:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5jzu06",
          "author": "bjd533",
          "text": "I met my Sponsor, we had a timeline and a budget. I forget the rest.\n\nEdit - referencing the famous Walt Whitman quote about love - just realised this comment can seem a little obnoxious  without getting the (obscure?!) reference.",
          "score": 6,
          "created_utc": "2026-02-15 19:08:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5eizco",
          "author": "Suspicious-Camera489",
          "text": "Scrum/Lean/SAFe… it doesn’t matter at the end to me. I need to know:\n- any off days in the upcoming two weeks\n- what is left to do how from the last two weeks\n\nWe need to know what we want to achieve in this 2 weeks so we need to specify it and make sure we understand and have all info. \nPlanning/grooming/refining/stand-ups… what brings  results is what I use but over the years I cut it down to basics, specifically if you have capable teams.\nOlder I get less jargon I use.",
          "score": 5,
          "created_utc": "2026-02-14 21:08:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5ejaf1",
              "author": "Ok_Contribution_5709",
              "text": "Very helpful, thank you!",
              "score": 1,
              "created_utc": "2026-02-14 21:10:12",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5h00u9",
          "author": "karlitooo",
          "text": "In all cases: Define a plan, monitor against the plan.\n\nUnder SAFe we used a lot of jargon naturally. A bit less in startups running mostly kanban-ish. Marketing agencies were pretty PM jargon heavy internally but processes way looser than they pretended.\n\nCurrently I am not using specific methodology but defaulting to lightweight wagile mostly. Low jargon environments.",
          "score": 4,
          "created_utc": "2026-02-15 07:16:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5hnmy2",
          "author": "LeChevrotAuLaitCru",
          "text": "I learned that software project management methodology is the right way to build nuclear plants, refineries, chemicals and all that. I like it when bad, incomplete scoping is rebranded as agile. \n\nTo top it off, I am confident that folks ~3 years out of college in consulting with titles program managers or directors are far better suited to know how to build such facilities than those who spent decades learning the crafts..",
          "score": 6,
          "created_utc": "2026-02-15 11:04:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5hpz4v",
              "author": "icezar1",
              "text": "O approve this message.",
              "score": 2,
              "created_utc": "2026-02-15 11:26:30",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5htmxu",
                  "author": "LeChevrotAuLaitCru",
                  "text": "Also, yelling kicking and cursing get the job done",
                  "score": 2,
                  "created_utc": "2026-02-15 11:58:59",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5f9z7e",
          "author": "Chicken_Savings",
          "text": "Meaningless question unless you consider the industry.\n\nNobody constructs a power station following Agile principles.",
          "score": 9,
          "created_utc": "2026-02-14 23:43:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5fgh81",
              "author": "tcumber",
              "text": "Welll...about that.  \"Agile\" is really iterative Just in time (JIT) quality manufacturing adapted to software delivery.",
              "score": -2,
              "created_utc": "2026-02-15 00:23:32",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5gh9nt",
                  "author": "Logical-Bookkeeper77",
                  "text": "It’s MUCH MORE THAN THAT.\n\nPleas at least read the manifesto. It’s not that long.",
                  "score": 2,
                  "created_utc": "2026-02-15 04:35:19",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5gukkf",
          "author": "Maro1947",
          "text": "Whatever alignment the business stakeholders want\n\nI've never, ever used one single methodology in Project land\n\nConsultancies and businesses are always \"Aligned\", not locked into a methodology\n\nBeing flexible is the key",
          "score": 4,
          "created_utc": "2026-02-15 06:25:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5h4y7b",
              "author": "H0moludens",
              "text": "+1\n\nMost frameworks are made to suck money from the companies rather than providing useful support. I have seen SAfE being implemented at places that were not ready for this… you can imagine the outcome and the emotional damage of the person who sponsored safe. ",
              "score": 2,
              "created_utc": "2026-02-15 08:04:15",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5jdd13",
          "author": "c0ncept",
          "text": "My brain is hard coded in Lean just because that was the work environment I was immersed in during the early stages of my career. \n\nStill to this day, I’ll be doing something mundane at home and think to myself “oh, this is totally motion waste right now.” It’s helpful in just about anything you do, though.",
          "score": 4,
          "created_utc": "2026-02-15 17:19:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ehbng",
          "author": "ArpanMaster",
          "text": "Controlled breathing. Mindfulness.",
          "score": 3,
          "created_utc": "2026-02-14 20:59:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5lpabs",
          "author": "Any-Oven-9389",
          "text": "p3 express all day homey",
          "score": 3,
          "created_utc": "2026-02-16 00:38:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5expfy",
          "author": "cbelt3",
          "text": "Manage by walking around. Or having quick working sessions…. My meetings last LESS than 15 minutes or are via email or teams IM’s.",
          "score": 2,
          "created_utc": "2026-02-14 22:29:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5f8chh",
          "author": "PhaseMatch",
          "text": "Agility requires:\n\n\\- Theory-Y management and learning organsiation culture  \n\\- change is cheap, easy, fast and safe (no new defects)  \n\\- fast feedback from users on the value change is creating  \n  \nWithout that, it will NOT control your business risk in a lightweight way, so you should use increasingly \"heavyweight\" stage-gate project controls to prevent anyone being scapegoated for failure.  \n\nLean and agile are not alternatives;  XP draws on lean ideas (\"build quality in\");  use both.  \n  \nXP is the only really effective agile framework.  \n  \nPrior to 2010 or so \"agile\" meant \"XP\", and deals to those last two requirements. It is mainly technological in nature - if you have a legacy code base where change is expensive, hard, slow and risky then either build the need to upskill and refactor into your programme of work, or move on.\n\nScrum adds \"investing one Sprint at a time\" as a business-level risk control, to prevent sunk costs and give the option to exit the programme at any Sprint boundary.  If your can't break your programme down into mini-projects/experiments and get the stakeholders to \"Shark tank\" with you a Sprint at a time, forget Scrum and move on.\n\nSAFe, Less and the wider Kanban method are more **long term plays for organisational change than short-term product delivery approaches**.   Again, they work if you have a Theory-Y management approach and evolve, but with Theory-X and a \"transformation\" mindset they **fail in an expensive, stressful, slow and risky way.**    \n  \n**Kanban Method** \\- start where you are, agree to evolve through data-driven experiments, build leadership at all levels - is my general advice.  Create a \"pull\" from teams and management rather than \"pushing\" a method. ",
          "score": 2,
          "created_utc": "2026-02-14 23:32:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5egmwb",
          "author": "AutoModerator",
          "text": "Hey there /u/Ok_Contribution_5709, Have you looked at our \"Top 100 books post\"? Find it [here](https://www.reddit.com/r/projectmanagement/wiki/index/books).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/projectmanagement) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-14 20:55:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ghmbc",
          "author": "Logical-Bookkeeper77",
          "text": "There isn’t that much jargon in project management.\n\nExcept some easily understand things like sprints, task, dev / prod … and some industry / project  specific code names.\n\n…. In general the best method is a mix, as you usually need a waterfall style to forecast / business case drafting.\nThen you run the parts agile and update periodically.",
          "score": 1,
          "created_utc": "2026-02-15 04:38:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5j5k42",
          "author": "GibsonLP93",
          "text": "In my experience, everything is hybrid. Sure, some things lean more towards agile and others more towards waterfall. But at the end of the day it’s very rarely ever purely one of those disciplines. Like others have said, you just tailor the approach to the project demands. But then call it whatever the hell the sponsor wants to call it.",
          "score": 1,
          "created_utc": "2026-02-15 16:41:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5j9mrb",
          "author": "PplPrcssPrgrss_Pod",
          "text": "Almost every project I've worked on is truly Hybrid. Even companies or teams that say they are all this or all that sprinkle in or dump in elements of other methodologies.",
          "score": 1,
          "created_utc": "2026-02-15 17:00:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5lnfgb",
          "author": "More_Law6245",
          "text": "Personally for me it genuinely depends on the the type of project and the approach that is needed which will dictate my methodology approach, being in the IT infrastructure space it tends to be predominantly waterfall but I've been known to run hybrid models to ensure that I deliver the project in the most expedited way but in a very controlled manner.\n\nWhen planning projects I always tell my project stakeholders that \"dumpster fires\" is not a preferred project methodology or framework that I prescribe to.\n\nTo be perfectly honest, if I have a fault in my project deliver is making an assumption that everyone knows PM jargon because I have been doing it for so long, I just rattle it off and think nothing of it but If I see someone who looks like there are seeing tumbleweeds passing or they kind of look like their constipated, it means I forgot that I'm using too much jargon. It's definitely one of \"my bad\" things that I do need to keep checking myself on, especially with the senior executive. To be honest it's more of a reflection on me because I'm the one that is making the assumptions.\n\nJust an armchair perspective.",
          "score": 1,
          "created_utc": "2026-02-16 00:27:11",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r0k8r2",
      "title": "Program Managing a Tech Transformation",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1r0k8r2/program_managing_a_tech_transformation/",
      "author": "Spiritual_Mistake579",
      "created_utc": "2026-02-09 23:25:17",
      "score": 9,
      "num_comments": 9,
      "upvote_ratio": 0.92,
      "text": "I have been in a program manager role for our cloud native transformation. This has been easily the most challenging year of my life and every day I feel like I am failing. Anyone else running a program like this? How are you surviving? Biggest challenging is not being able to keep up with how fast things move, and constant disconnects at the leadership level also very difficult to keep up with. ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/projectmanagement/comments/1r0k8r2/program_managing_a_tech_transformation/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o4j9k8s",
          "author": "More_Law6245",
          "text": "Firstly, take a breath as this is pretty typical for some program manager roles and it may also be further complicated by low organisational maturity in the project delivery framework, particularly when it comes to roles and responsibilities within the program. I have found in the past when I've auditing organisations the key disconnect was the communication paths along with expectations around when and what was being communicated. \n\nI might suggest is work with your leadership team and find out what is and is not working for them and work backwards from there to see if it's a process or procedure issue. Assess the communication paths and the right information being conveyed in the appropriate format and frequency.  As an example I had audited one program where the program manager was literally cutting an pasting from technical resource documentation for executive reporting and the executive where not reading or responding because A) it was too technical for them B) the exec were unsure on what the PM was communicating and what he was expecting C) the exec where to embarrassed to say anything and that they didn't understand it and to cap it off all under a compressed timeframe. Long story short a total disconnect and the impact was key decision were not being made on the program's critical path.  \n\nSimplification is your answer, if things are moving quickly you need understand why, was the business case fit for purpose? The golden rule is the amount of variation is a quality indicator on the business case (and  project plan) focus on the control your triple constraint of time, cost and scope. If there are a lot of changes then you need to ask why? Was the scope and requirements captured correctly? Are you rushing to meet a timeline or expectation? Who is accepting the risk of that? If there is scope change you need to ultimately understand and control it. Also understanding why and who is making changes, start setting expectations and enforcing the triple constraint e.g. if scope changes, then so does time and cost! It's also a very simple litmus test to see if the change is really warranted if you highlight it's impact of it's going to take more time and money on a whim, you find out very quickly if a RFC is really needed or not. \n\nYour project controls of issues and risk coupled with your status reporting should realistically be painting a very clear picture and highlight the amount of variation or change that is occurring. But with that said you also need to enforce roles and responsibilities in order to control the unscheduled changes. I suppose the key question I have, did you have an approved baseline program of work? and are you only just managing the exceptions?  \n\nJust an armchair perspective.  ",
          "score": 5,
          "created_utc": "2026-02-10 01:03:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4j19n4",
          "author": "Unusual_Ad5663",
          "text": "Complex programs have caused a lot of sleepless nights. You said you’re having trouble keeping up. Been there. What helped was shifting from “keep up” mode to getting ahead of leadership disconnects. The big aha was realizing the disconnect was ours, not theirs. Once we owned that, it changed how, what, and when we communicated, and we became much more intentional about the role we needed them to play.\n\nI learned a lot from the ROPE framework on managing up.",
          "score": 4,
          "created_utc": "2026-02-10 00:16:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ofvz6",
              "author": "weareabassi",
              "text": "Where can I learn more about this framework?",
              "score": 1,
              "created_utc": "2026-02-10 20:28:10",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4oddgd",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 5,
          "created_utc": "2026-02-10 20:16:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4qjnp5",
              "author": "Passionfruit4Life",
              "text": "This is an absolutely incredible comment and gave me such hope and perspective as I am managing a similar project to OP, and constantly feel like I’m drowning and failing. But every time I am able to drive a decision, I see the light.  So this really resonates. It’s less about managing the delivery as you said, which feels so counter intuitive as I’m so execution focused, but this requires a heavier level of governance and oversight, and less on the actual delivery managing.",
              "score": 2,
              "created_utc": "2026-02-11 03:19:37",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4nvu6b",
          "author": "Magnet2025",
          "text": "Have there been any analysis of the impact to the users of this transformation? \n\nThis is something that needs to be addressed to avoid post-implementation challenges.",
          "score": 1,
          "created_utc": "2026-02-10 18:55:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4vaen1",
          "author": "Live-Gift-731",
          "text": "Did one for 2.5 years and almost felt like smashing my laptop.\n\nDelivered it finally and became a plain simple scrum master,life is easier now..",
          "score": 1,
          "created_utc": "2026-02-11 21:09:04",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r5fz3s",
      "title": "How to see the detailed inside of mega projects / huge film sets?",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1r5fz3s/how_to_see_the_detailed_inside_of_mega_projects/",
      "author": "Hydrozy",
      "created_utc": "2026-02-15 14:29:04",
      "score": 6,
      "num_comments": 6,
      "upvote_ratio": 0.88,
      "text": "I know there is probably nowhere something like this out there, but imagine a full-detailed documentary of even the hiring process of a film, the post-production — what they edit and why — and even what the editors had to learn.\n\nShort looks into every single step and what is required when producing, for example, movies like Avatar or how Tesla Gigafactories work.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/projectmanagement/comments/1r5fz3s/how_to_see_the_detailed_inside_of_mega_projects/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o5ih3yv",
          "author": "LameBMX",
          "text": "https://youtube.com/@animagraffs?si=tbyM9x8P_HsUOJ1u\n\nfor a few megaproject builds.",
          "score": 2,
          "created_utc": "2026-02-15 14:38:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5il79z",
              "author": "Hydrozy",
              "text": "Hm, I searched for animagraffs project management / megaprojects but could not find much. Would you be so kind and post an example?",
              "score": 1,
              "created_utc": "2026-02-15 15:00:18",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5ih7tk",
          "author": "Old_Cry1308",
          "text": "try checking out behind-the-scenes featurettes on blu-rays or dvds. sometimes they have more details.",
          "score": 2,
          "created_utc": "2026-02-15 14:38:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5igi9v",
          "author": "Total_Literature_809",
          "text": "About movie production I can talk a little bit better. It’s hard to find in depth material, but for me the best example are the ~14h of documentaries showing how The Lord of the Rings was made. \n\nLord of the Rings was the best example of a project with a huge scope, limited budget and no understanding if there would be a return on investment.",
          "score": 1,
          "created_utc": "2026-02-15 14:34:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5ilxlf",
              "author": "Hydrozy",
              "text": "Thanks! Do you mean this playlist? https://m.youtube.com/playlist?list=PLRzqXH8K0HzHLIkb6g9PcXtaKBpFpomPB",
              "score": 1,
              "created_utc": "2026-02-15 15:04:12",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5isr5x",
                  "author": "Total_Literature_809",
                  "text": "Yup. This one. It came from the DVD/Blu-ray, but they are AMAZING",
                  "score": 1,
                  "created_utc": "2026-02-15 15:38:55",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1r3qwxj",
      "title": "Genuinely Curious! Did the AI change anything about the project manager's fundamentally responsibility? If yes, how?",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1r3qwxj/genuinely_curious_did_the_ai_change_anything/",
      "author": "Ok_Jello9448",
      "created_utc": "2026-02-13 14:41:21",
      "score": 6,
      "num_comments": 19,
      "upvote_ratio": 0.75,
      "text": "We keep hearing that using copilot or Claude helps me write my emails, or create decks faster. I get it. But beyond creating reports, emails or decks, how did AI change the fundamental responsibility of the Project Manager - i.e herding a group of disjointed people and departments and make them work towards 1 single goal.? if it did for you, how? I am reflecting on this myself but would love to hear others opinions as well. ",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/projectmanagement/comments/1r3qwxj/genuinely_curious_did_the_ai_change_anything/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o58hsf7",
          "author": "sinistar914",
          "text": "Being a PM is alot like being a juggler - you need to keep a lot of balls up in the air and they have to keep moving. If you drop one you need to pick it up and get it moving again. Sometimes the balls are going to drop into a pile of poop and you dont want to pick it up but you have to. If you dont keep the balls up in the air noone is going to pickup the ball for you.  If you are a really good juggler you will make it look easy but its really years of study and practice that make you a bad ass juggler. I dont ever see AI being a responsible juggler. The question that you didnt ask - does AI help us do our jobs? Absolutely, but everything still needs to be checked and vetted with current AI models. In addition, I have been spending time building up my prompts to get AI to do what I need it to do. AI is another tool in my tool belt currently and it is definitely helpful. ",
          "score": 11,
          "created_utc": "2026-02-13 21:29:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o592ptz",
              "author": "Ok_Jello9448",
              "text": "Yes. PMs have balls of steel 😄",
              "score": 5,
              "created_utc": "2026-02-13 23:19:27",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o56aj5m",
          "author": "Old_Cry1308",
          "text": "ai tools are just faster at the busywork. still need a human to herd the cats and keep things moving.",
          "score": 6,
          "created_utc": "2026-02-13 15:04:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o56ay6l",
              "author": "Ok_Jello9448",
              "text": "Agreed!",
              "score": 1,
              "created_utc": "2026-02-13 15:06:35",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o56f03g",
          "author": "Aggravating_Hippo546",
          "text": "If anything, it gives me more time to focus on actual project success, caring for the team and ensuring they do their work, having hard conversation, etc. by eliminating my busywork. I do utilize it to give me a start for the risk conversation/development, as it can usually pull some stuff out of my project documents.",
          "score": 3,
          "created_utc": "2026-02-13 15:26:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o56kax9",
              "author": "Ok_Jello9448",
              "text": "This is a great perspective.  Can you share your tool stack and the system in place to make the management a bit easier?",
              "score": 1,
              "created_utc": "2026-02-13 15:51:53",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o58hr11",
          "author": "More_Law6245",
          "text": "Interesting statement but AI by the very defnition can't change a project manager's responsibilities, AI is only a tool to support a project manager in the delivery of their project. As an example if you had AI create a project schedule and it goes horribly wrong? Who is responsible for it? The project manager who used it? Was it the organisation's for implementing the mandatory use of AI or do you blame an inanimate coded program? How do you explain that one to a client? Not a very professional look to be conveying of the company. \n\nI find project managers are relinquishing their responsibility to technology yet others voice concerns that it's taking their over their livelihoods. AI is a tool to support the PM, not take on the PM's responsibilities. ",
          "score": 3,
          "created_utc": "2026-02-13 21:29:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5dvdac",
          "author": "hippydidoda",
          "text": "Project manager role is to heard cats.  AI will only take away make easier the repetitive task of taking and writing minutes. Cat Hearding no computer can do.",
          "score": 3,
          "created_utc": "2026-02-14 19:02:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5ghxgv",
              "author": "Logical-Bookkeeper77",
              "text": "This. Although some “projects” like application development, the process can be simplified, but not the PM aspect except finding rooms and sending regular message and minutes whatnot.",
              "score": 1,
              "created_utc": "2026-02-15 04:40:28",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o57r84i",
          "author": "AldronProjectLab",
          "text": "Good question.\nFor me, AI hasn't changed the PM's fundamental role and responsibility, but it has changed the speed at which I get certain things done.\nIt helps me write better and faster, and structure thoughts and reports. But the real work remains creating alignment where it isn't there, managing tensions, dealing with ambiguity, and all the other power that requires soft skills.\nAI can support the form, but the substance (people, conflict, pressure) is still entirely ours.",
          "score": 2,
          "created_utc": "2026-02-13 19:17:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o58fplx",
          "author": "agile_pm",
          "text": "When you say AI, which type are you talking about?\n\n* Generative AI - planning, documentation, communication, analysis\n* Agentic AI - monitor tasks and risks, notifications, workflow automation\n* Predictive AI - forecasting and estimating things like delivery dates, cost overruns, and workload bottlenecks\n* Prescriptive AI - scenario modeling, resource allocation recommendations\n\nSome project/work management tools have some of these built-in and some of these are standalone.  But the real question is... \"Does any of this change anything about the project manager's fundamental responsibilities?\"\n\nI'm leaning toward no.  Enhance deliverables?  Sometimes.  Make some things easier?  Sure.  Change my core responsibilities as a project manager?  That might be a bit of an overstatement.  At least for now, at most companies.\n\nUsed together, they can help you with executive framing, tradeoff analysis, making decision-making easier, etc., which can, eventually, lead to more responsibility and possibly even promotion.  This is advisable even if the opportunities aren't there with your current employer.  What will likely have more impact on a project manager's fundamental responsibilities is changing leadership's attitude toward project managers and what they expect from them.  Once this expectation is changed, the bar is effectively raised.  Until then, the project manager is assuming greater responsibility that the organization might need, but hasn't granted, yet.",
          "score": 2,
          "created_utc": "2026-02-13 21:19:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o566zdw",
          "author": "yarffff",
          "text": "The only thing AI has changed for me is note taking in meetings and revising emails. I am not sure we are at the point where AI is going to fundamentally change project management, maybe in a few years when we have real AI rather than LLMs.",
          "score": 2,
          "created_utc": "2026-02-13 14:46:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o57gcpi",
              "author": "Stebben84",
              "text": "It can do much more than notes and emails. I can draft charters, come up with project plans, develop risk mitigation strategies, create executive summaries, do data analysis, and much more. It still takes vetting, but tasks that could take me a day, two or even more, take an hour or two. \n\nDid it fundamentally change? Not sure yet, but it saves me so much time to focus on the people part and less on the busy, administrative work.",
              "score": 1,
              "created_utc": "2026-02-13 18:25:06",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o56smmv",
          "author": "Coneptune",
          "text": "Project management is all about communication and that is where I would say AI can fundamentally change a PMs responsibilities. It allows you to work effectively with highly variable and unstructured data. In practice this means less friction when trying to get information out of the team. \n\nFor example, AI can extract the data you need from the teams own reports, written notes, meeting minutes, emails, etc and output in the format you need as a PM. So the team just has to do a quick review of the generated output, saving hours and they will appreciate that you are meeting them where they are. \n\nThat is just the beginning though. Most projects are well defined workflows and that means you can can automate end to end using multi-agents. That was the first thing I built with AI (a system that builds a complete project plan from a charter) and I haven't looked back since. ",
          "score": 1,
          "created_utc": "2026-02-13 16:31:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o56wwaf",
              "author": "Ok_Jello9448",
              "text": "Oh this is great. Do you mind sharing a bit more about your system or show me how it works?",
              "score": 1,
              "created_utc": "2026-02-13 16:51:20",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o57a6py",
                  "author": "Coneptune",
                  "text": "Sure, search for \"proagentic\" there is a free public version. \n\nFastest way to start is to click on customise button on one of the template projects, generate a charter and then start the project. It will create 8 PM plan dashboards in about a min. Once dashboard are generated there is an agent mode where you can ask for project info and agile mode which is my attempt at an \"agile converter\" and more\n\nPS - It is built as a SaaS product, but not commercialising it.  It is actually more of a side project on steroids.  \n\n\n  ",
                  "score": 3,
                  "created_utc": "2026-02-13 17:55:52",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1r31boh",
      "title": "How do you make tamplate for specification document and what should one contain?",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1r31boh/how_do_you_make_tamplate_for_specification/",
      "author": "doli-loli",
      "created_utc": "2026-02-12 18:30:42",
      "score": 3,
      "num_comments": 10,
      "upvote_ratio": 0.71,
      "text": "I am begginer PM and I have a task to make specification document that team for development will fill out with specification. Does this document have to contain introduction, pitpos of the document. I don't know what I should type in this document myself. \n\nIt shouldn't be onepager or table, it has to be in depth specification.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/projectmanagement/comments/1r31boh/how_do_you_make_tamplate_for_specification/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o51e4v3",
          "author": "More_Law6245",
          "text": "As a PM you should be asking those who will be using the document and determining what information needs to be captured. This is what a PM does is leverage those people around them to help deliver something because you may or may not have the skills yourself.  This is about understanding roles and responsibilities and how to engage resources for assistance in delivering something. \n\nMaking assumption as a PM is the worst thing you can do and to be honest it wastes everyone's time and money. There is an approach that I always take, if I'm unsure I will pull something together of what I think needs to be in the document then I send it out for review and feedback, it's a quick way to get buy in from the relevant stakeholders. ",
          "score": 3,
          "created_utc": "2026-02-12 19:53:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o52idlv",
          "author": "pmpdaddyio",
          "text": "Why would you or your team develop specifications. This is entirely customer driven. It can come in the form of an RFI or RFP, or just straight up spec sheet. \n\nI think you mean requirements.\n\nBusiness requirements - mapping to the SOW or specs telling the client you understand their specs and mapping them to a business need.  Usually usually contains a problem statement, an as is, to be portion, and any understood client concerns. \n\nFunctional requirements - internal mostly where you address how it will work. Usually contains high level process info in the form of flow charts, maybe some DB schemas, etc. \n\nTechnical requirements - internal only. It’s the guts of the system. Maybe your code structure, libraries, testing scripts, etc.",
          "score": 3,
          "created_utc": "2026-02-12 23:11:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o51mvhf",
          "author": "agile_pm",
          "text": "I agree that AI can be good for templates.  Just keep in mind that you might end up with more or less than you need.\n\nIf you're a member of PMI, you can also log into [projectmanagement.com](http://projectmanagement.com) and download templates for free.  I believe these are user contributed, so don't just assume they're perfect, either.\n\nI've had a book on my shelf for years - Software Requirements, 2nd edition, by Karl Wiegers.  At the back of the book he provides a detailed specification template.  It's more than I've ever needed, but if you want a deep understanding of what can be included, it's a good reference.",
          "score": 2,
          "created_utc": "2026-02-12 20:35:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o54c7dm",
          "author": "dhemantech",
          "text": "You can find many online as a start. Adding details may help you get better answers. With “development” I am assuming IT development activities. Are you a firm providing services to external customers or do you provide IT services to other departments of your own business/organisation.",
          "score": 2,
          "created_utc": "2026-02-13 06:14:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o54q0gy",
              "author": "doli-loli",
              "text": "We provide services to external customers.",
              "score": 1,
              "created_utc": "2026-02-13 08:17:25",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o54zuh8",
                  "author": "dhemantech",
                  "text": "Someone else already mentioned it, just repeating. Many organisations who come to you will have their own templates.",
                  "score": 1,
                  "created_utc": "2026-02-13 09:50:57",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o51lrqc",
          "author": "Suchiko",
          "text": "A non exhaustive list, but: who is the customer, what are the deliverables, quality expectations, expected activities, dates, budget, who approves the spec, who are the stakeholders, who approved delivery acceptance, what is cadence of meetings?",
          "score": 1,
          "created_utc": "2026-02-12 20:30:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5inzx2",
          "author": "SinkPsychological676",
          "text": "For an in-depth specification document, it helps to include sections like an introduction, purpose, scope, detailed requirements, and any assumptions or constraints. Using a tool that guides you through these sections step-by-step can make the process smoother, especially if you want to keep the structure clear and consistent. Take a look at Rakenne for that. ",
          "score": 1,
          "created_utc": "2026-02-15 15:14:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o51dupu",
          "author": "ntufar",
          "text": "Honestly, these days if there is no template ready in the organization, I use AI. Just describe what you want to the AI tool of your choice and it will generate you a good enough template.",
          "score": 1,
          "created_utc": "2026-02-12 19:52:12",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r2oa84",
      "title": "MS Planner Goals capped at 10",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1r2oa84/ms_planner_goals_capped_at_10/",
      "author": "legitmonk",
      "created_utc": "2026-02-12 08:40:50",
      "score": 3,
      "num_comments": 7,
      "upvote_ratio": 1.0,
      "text": "I'm posting this to find out if I'm understanding this correctly. I understand that Goals on MS Planner are capped at 10; would be nice to configure this manually but they're trying to enforce focus, gotcha. But I noticed that closing out a Goal still counts towards the cap, meaning that if I closed 10 goals, I'll *still* not be able to create new Goals and will be forced to create a new Project. Is this correct? That doesn't make sense. Copilot is suggesting I take screenshots of closed Goals and then delete them. Are we cavemen",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/projectmanagement/comments/1r2oa84/ms_planner_goals_capped_at_10/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o5301wy",
          "author": "timevil-",
          "text": "I laugh in one hand (splendidly articulated btw), and cry in another as I was going to configure Goals soon. But after reading your post, I'm now leaning towards aligning with strategic goals. Ramifications for not closing goals...?",
          "score": 1,
          "created_utc": "2026-02-13 00:52:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o536vjj",
          "author": "Magnet2025",
          "text": "One of the reasons, as a  Microsoft Project Online/Server consultant, I decided to reskill as Adoption and Change Management. \n\nI had little confidence that the new tools would support PMs as much as much it would support sales.",
          "score": 1,
          "created_utc": "2026-02-13 01:33:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5469cm",
              "author": "legitmonk",
              "text": "This is sad to hear, closest to the truth are those that work within the company to promote the tools they find issues with themselves and are powerless to change it. I've been there too in another company",
              "score": 2,
              "created_utc": "2026-02-13 05:26:41",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5404ms",
          "author": "Fantastic-Nerve7068",
          "text": "yep ran into this too and it’s honestly wild that closed goals still count toward the cap like what’s the point of finishing work if the system punishes you for it moved our team to celoxis partly because of stuff like this the way it handles goals milestones and reporting is actually built for grown up project tracking not just lightweight task lists",
          "score": 1,
          "created_utc": "2026-02-13 04:41:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o54mnjr",
          "author": "Maro1947",
          "text": "Is that in advanced ?",
          "score": 1,
          "created_utc": "2026-02-13 07:46:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o54q04b",
              "author": "legitmonk",
              "text": "I went to MS documentation now to understand what \"Advanced\" entails, are you refering to the paid plan? The templates I see are different than their documentation, so I'm thinking the recent changes might still be very new and they're working on updating and improving it. I selected \"Project Manager\" which is in Preview, so assuming it's Premium but also very new. Goals appear in this template.\n\nMS Documentation: [Advanced capabilities with premium plans in Planner - Microsoft Support](https://support.microsoft.com/en-us/office/advanced-capabilities-with-premium-plans-in-planner-6cdba2aa-da06-4e08-be4c-baaa4fda17ba)\n\nhttps://preview.redd.it/pll3c4vx08jg1.png?width=1014&format=png&auto=webp&s=4da22d9b57f69144469a1efee47dec5529b18041\n\n",
              "score": 1,
              "created_utc": "2026-02-13 08:17:20",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o59l9m4",
                  "author": "Maro1947",
                  "text": "Yeah. It's premium \n\nTBH, I create a master schedule and Timeline view in Project for high level review then do my tasks allocation in Planner basic\n\nIt works really well and isn't a lot of work to maintain\n\nI generally run 3 - 10 projects this way at a time",
                  "score": 1,
                  "created_utc": "2026-02-14 01:11:19",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1r1mzad",
      "title": "Contract/RFx process mapping or flow charts",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1r1mzad/contractrfx_process_mapping_or_flow_charts/",
      "author": "GroundZer0o",
      "created_utc": "2026-02-11 03:56:55",
      "score": 3,
      "num_comments": 1,
      "upvote_ratio": 1.0,
      "text": "I'm looking for process maps or flow charts for various RFx documents. \n\nIs anybody able to share some that they currently use for RFP, RFT and RFQ? ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/projectmanagement/comments/1r1mzad/contractrfx_process_mapping_or_flow_charts/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o4saxqf",
          "author": "evangelicalfuturist",
          "text": "My partners and I have built and reviewed a lot of RFx documentation over the years on both sides of the table (buyer and supplier), and the most common gap isn’t the document itself, but the decision gates around it. \n\nAt a high level, most effective RFx processes follow a structure like this:\n\n\t1.\tDemand validation (why are we issuing this?)\n\t2.\tScope clarity checkpoint\n\t3.\tMarket engagement strategy (RFP vs RFQ vs RFT decision)\n\t4.\tEvaluation criteria definition before release\n\t5.\tStructured Q&A governance\n\t6.\tCommercial + delivery risk assessment (not just price scoring)\n\t7.\tPre-award execution feasibility review\n\t8.\tExecutive decision gate with documented assumptions\n\nThe biggest failures we see happen at steps 2, 4, and 6.\n\nIf helpful, more than happy to chat!",
          "score": 2,
          "created_utc": "2026-02-11 12:06:33",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r5lpqc",
      "title": "Project Expediting… what is it?",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1r5lpqc/project_expediting_what_is_it/",
      "author": "Balvin_Janders",
      "created_utc": "2026-02-15 18:17:22",
      "score": 3,
      "num_comments": 10,
      "upvote_ratio": 0.8,
      "text": "Hi there (hey mod! I read the rules and I hope you’d allow this post)\n\nI am a project planning and control professional. I may jump to a managerial promotion in another organization soon.\n\nThe title is “Project Expediting Manager”.\n\nTo be honest, I’ve been salivating over leadership roles for awhile. But as an engineer who takes pride in their chops and the hard work done to earn a degree and deliver safe and cost-effective results; I CRINGE and DETEST administrative roles and doing follow up for a living!\n\nEven in PM, I go out of my way to review drawings, technical proposals, mfg schedules etc…\n\nTLDR: what is “project expediting”? Am I just following up over emails and the phone with suppliers?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/projectmanagement/comments/1r5lpqc/project_expediting_what_is_it/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o5js6kn",
          "author": "LeChevrotAuLaitCru",
          "text": "Expediting in my usual old ways is procurement expediting ie literally tracking and chasing vendors for equipment and material delivery..\n\nAlso these days companies tend to tag on the word manager to everything… ends up nobody does nothing since everyone just strokes the dicks to their right (or left)",
          "score": 2,
          "created_utc": "2026-02-15 18:31:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5jswf0",
              "author": "Balvin_Janders",
              "text": "Lol… anything technical? Do you work your brain at all at expediting (not to offend anyone who is in it)?",
              "score": 1,
              "created_utc": "2026-02-15 18:34:41",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5jucko",
                  "author": "LeChevrotAuLaitCru",
                  "text": "I think things are only technical if you’re actually interested and curious to learn what the hell it is you’re expediting. That unfortunately becomes your homework outside of work hours.. once you know what you’re expediting and, if you have access to read any relevant engineering documents or vendor documents or gannt chart or payment milestones, among others, only then you can put two and two together and understand why your job is so important.\n\n(Hint: the seasoned Project directors, project managers, project engineers and engineering managers know the pain of this job since they also had to deal with it expediting themselves when they did their own projects…)",
                  "score": 1,
                  "created_utc": "2026-02-15 18:41:40",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5k5kms",
          "author": "Magnet2025",
          "text": "I consider expediting projects in a couple of ways: \n\n1. Speed up delivery (projects) by examining each element of the project to determine gaps, funnels and roadblocks and designing process solutions to streamline the project. \n\n2. Jumping into a project that is considered “troubled” and figuring out the fastest and most efficient/least cost solution to fix the project and hit the triple constraint. Or at least two of them. \n\n3. When a troubled project continues to devolve, then it can take drastic action to fix it, lest the project becomes “failed” and you risk customer relationships. This is when the original PM begins to reconsider professions and the team realizes that “evenings and weekends” are coming up. Sometimes people say that this is when you “crash” a project. Crashing a project is very intensive review of all ongoing and any remaining tasks to find opportunities to make the work get done faster. Bringing in more people, cutting tasks that risk project success, bringing in cots. Usually referred to as a “death march” project. \n\nI’ve done the first two and they can be fun challenges. I’ve been involved in a death march but not as project management (thank God). It isn’t fun. It isn’t pretty. I got fired over a conference call when I pointed out that a project was hitting the lacing of boots part of a death march. Luckily, the PM (who was a contractor - always a bad sign when you are *undertaking the single largest project the company has taken on, impacting sales, delivery and billing*) didn’t have the authority to fire me. \n\nIt sounds as if you have the right combination of technical skills, PM skills and desire to be successful.",
          "score": 2,
          "created_utc": "2026-02-15 19:36:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5jqgxy",
          "author": "Old_Cry1308",
          "text": "sounds like a lot of chasing and following up to me. might want to brace yourself for those admin tasks.",
          "score": 1,
          "created_utc": "2026-02-15 18:22:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5jypid",
          "author": "SVAuspicious",
          "text": "I'm a turnaround guy which is called expediting in some places. I consider it walking into a dumpster fire on purpose. Often the big problems don't have clear causes until you get into the details so I spend a lot of time in working level reviews. \n\nDepending on your scope expediting could be figuring out why some IT roll out is stalled by a vendor hardware delivery. Not much technical detail there. A team that has broken down because the new DSP imaging remote sensor is clearly way behind but all the PM metrics look good. Lots of process AND lots of technical detail there. Very often with big problems even when process is the issue you have to get in the technical weeds to fix the process so it addresses the need. ",
          "score": 1,
          "created_utc": "2026-02-15 19:02:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5l64xe",
          "author": "pmpdaddyio",
          "text": "The terms are \n\nCrashing, meaning adding additional staff to the team to finish the effort. This can work when you aren’t trying to make a baby in a month with 9 women. \n\nFast tracking means to remove extraneous tasks and run the others in sequence. Essentially doing more with less.",
          "score": 1,
          "created_utc": "2026-02-15 22:46:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5mx4ao",
          "author": "iamright_youarent",
          "text": "I’m in the same spot. the position is to willfully dive into a hellfire and try to save any salvageable assets.  should call it a project rescue special force or something but that implies the project is fxxked and no one wants to acknowledge that lol.   \n \npositions like this are valuable and have job security cuz most people rather quit from the projects with undesirable outcomes.  stakeholders can worry less as there’s a dedicated person to do what they might do to expedite the projects.",
          "score": 1,
          "created_utc": "2026-02-16 05:34:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5n5m0g",
          "author": "wittgensteins-boat",
          "text": "Leadership is administration.   \nManagement is administration.   \nYour concerns are mutually exclusive, not wanting to do adminustration and desiring to be leadership.",
          "score": 1,
          "created_utc": "2026-02-16 06:46:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5nbdxu",
              "author": "Balvin_Janders",
              "text": "Surely you see a difference between a document controller and a design manager",
              "score": 1,
              "created_utc": "2026-02-16 07:38:38",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r20sq5",
      "title": "Moving company from Asana to Jira",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1r20sq5/moving_company_from_asana_to_jira/",
      "author": "No_Order_1868",
      "created_utc": "2026-02-11 15:44:45",
      "score": 3,
      "num_comments": 14,
      "upvote_ratio": 0.71,
      "text": "Has anyone gone through a migration of their company’s projects from Asana to Jira? My team is looking to make the switch, and I was wondering how it went for anyone else. Thanks in advance!\n\nEditing to add that this is for a tech team, so engineers will be (hopefully) using Jira!",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/projectmanagement/comments/1r20sq5/moving_company_from_asana_to_jira/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o4usrdu",
          "author": "SVAuspicious",
          "text": "Out of the frying pan into the fire. ",
          "score": 8,
          "created_utc": "2026-02-11 19:43:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4terkg",
          "author": "Latter_Inspector_711",
          "text": "we tried to but everyone hated jira so much more that we stayed with asana \n\nthis was for marketing work with some dev work, maybe 15% of all work",
          "score": 8,
          "created_utc": "2026-02-11 15:50:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4texoi",
              "author": "No_Order_1868",
              "text": "Ah, that makes sense. I should clarify that I’m intending to use Jira for dev work only :) \n\nDid your developers like it? And what did your team not like about jira vs asana?",
              "score": 3,
              "created_utc": "2026-02-11 15:51:03",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4tgbvt",
                  "author": "ExtraHarmless",
                  "text": "If you setup JIRA well and understand its limitations it can be a great tool.\n\nIf you try to use it for waterfall work or don't have a competent admin it will be a bad time.\n\nIf people are not updating tickets in current platform, that issue will persist and you will spend more time chasing updates than actually getting work done.",
                  "score": 7,
                  "created_utc": "2026-02-11 15:57:32",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4wscr2",
          "author": "zelpin",
          "text": "out of curiosity why are you switching? ",
          "score": 2,
          "created_utc": "2026-02-12 02:03:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5m8acu",
              "author": "No_Order_1868",
              "text": "The big issue theyre having is that theyre not able to track subtasks well against features. I’m a little less familiar with Asana than Jira - I worked with Jira in my last job - but I know that’s a known limitation of asana. \n\nTheres some organizational bits the company overall is working on, but better tracking of requirements seems to be at the core of most of their friction points.",
              "score": 1,
              "created_utc": "2026-02-16 02:38:46",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5mangq",
                  "author": "zelpin",
                  "text": "i find that naming conventions and project IDs at the beginning of the task name is super helpful for that. not something i’d ever consider changing tracking systems for , that seems like a drastic change ",
                  "score": 1,
                  "created_utc": "2026-02-16 02:53:51",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o52xy8h",
          "author": "tuxilina",
          "text": "No advice. Just wanted to say that we're in the same position. Planning to migrate in the next few months and also looking for ideas. ",
          "score": 2,
          "created_utc": "2026-02-13 00:39:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o543xxb",
          "author": "Fantastic-Nerve7068",
          "text": "if your team’s mostly engineering focused jira will probably click more but if you’re also trying to keep business folks or cross-functional teams in sync it can get messy fast we eventually moved to celoxis since it gave us proper project planning without feeling like a dev only tool timelines dependencies resource tracking all in one place without constant add ons worth a look if you want something more balanced",
          "score": 1,
          "created_utc": "2026-02-13 05:09:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5auaiz",
          "author": "elykiki",
          "text": "For teams that use the waterfall framework and need on-prem deploy, it’s simply another nightmare",
          "score": 1,
          "created_utc": "2026-02-14 06:33:24",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}