{
  "metadata": {
    "last_updated": "2026-02-11 17:29:57",
    "time_filter": "week",
    "subreddit": "projectmanagement",
    "total_items": 20,
    "total_comments": 239,
    "file_size_bytes": 284647
  },
  "items": [
    {
      "id": "1qw9otg",
      "title": "Being a contractor is so weird.",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1qw9otg/being_a_contractor_is_so_weird/",
      "author": "shadybadgal",
      "created_utc": "2026-02-05 03:03:58",
      "score": 106,
      "num_comments": 27,
      "upvote_ratio": 0.98,
      "text": "I am currently a project manager at a airline company and I am a contractor there. My contract is supposed to end at the end of March and I have been there for almost 4 years now. The director has changed and so have some of the leadership throughout the last year or so as well as some have been let go. With all of the changes and I only having a last few weeks at this company, it is a little bit weird to be part of conversations on meetings where I am the subject matter expert and almost like transferring the knowledge over as I have been working on it the last few years. It almost feels like a grieving process as well as a bit awkward because your role in job is ending, but it almost feels like no one talks about it.",
      "is_original_content": false,
      "link_flair_text": "Career",
      "permalink": "https://reddit.com/r/projectmanagement/comments/1qw9otg/being_a_contractor_is_so_weird/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o3no6af",
          "author": "fineboi",
          "text": "\nI’ve worked as a consultant for nearly 15 years, and I’ve seen both ends of the spectrum. Some clients have taken me to lunch or dinner to thank me for my contributions, while others have tried to extract as much knowledge as possible as quickly as they could because my billable rate was stretching their budget.\n\nOver time, I’ve learned to simply give 100% in every role and make sure my network knows when I’m open to new opportunities. The best advice I can offer is to build strong relationships with recruiters. My last five roles have come directly from those connections. Once recruiters know I’m available, they help filter opportunities and put me in front of the right hiring managers.",
          "score": 30,
          "created_utc": "2026-02-05 03:45:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3nz5jd",
          "author": "timevil-",
          "text": "I look forward to contract end date. I see it as meeting new people and bringing expertise to the next project. I believe we're all SMEs of some sort in a variety of industries. \nHopefully you have your next gig lined up.... Good luck",
          "score": 32,
          "created_utc": "2026-02-05 04:58:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3o2y2q",
              "author": "shadybadgal",
              "text": "  \ni love your perspective. i was worried about the income and money stopping but i love your point of view. thank you for introducing this.",
              "score": 7,
              "created_utc": "2026-02-05 05:25:21",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3onbc6",
                  "author": "CK_1976",
                  "text": "If you are in the world of contracting, you have to have a little bit of arrogance/confidence. If you are good at what you do, you'll always have work. Its only let me down once or twice!",
                  "score": 8,
                  "created_utc": "2026-02-05 08:22:06",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3pnbfb",
          "author": "pmpdaddyio",
          "text": "I worked as a contractor for years. I didn’t mind it until I got older and realized what a pain it was to move around so frequently. \n\nI found a stable W2 role shortly thereafter and I learned the huge difference between the contractor role and the FTE one. A contractor has no authority. As a FTE I realized that saying “No” was as acceptable as saying “Yes”. You are in control as an FTE, the contractor just works as a button pusher.",
          "score": 20,
          "created_utc": "2026-02-05 13:21:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3qbpyr",
              "author": "littlelorax",
              "text": "Did you work for yourself, or were you subcontracting through an agency?",
              "score": 2,
              "created_utc": "2026-02-05 15:31:00",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3qtqvr",
                  "author": "pmpdaddyio",
                  "text": "I did both, I did a corp to corp agreement as well as 1099 and w2 with an agency, and I kept my LLC and did an engagement agreement when I worked for myself.",
                  "score": 5,
                  "created_utc": "2026-02-05 16:54:17",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3qycvo",
          "author": "Magnet2025",
          "text": "I did contracting between W2 gigs. Typically, my project was Project (Server/Online) and working to improve the use of Project by the client’s PM team, or implementation of Project Server/Online. \n\nMy last contract role was with a large insurance company. I had done the implementation and was training and mentoring the users based on their process. They got a new PMO leader who called me in and said “I am not sure I see the value in this” and I replied “Because you are not using it right.” \n\nShe rightfully challenged with “Isn’t that your job?” And of course it was, but when gathering requirements, I am told to go in one direction or another and even if I say ‘that’s not best practice’ or ‘you won’t get full benefit from the tool’ in the end I do it the way they say to. \n\nSo we reconfigured and I did some more training and it was better. Then I was invited to go to a big conference in Idaho and present and my contract was extended 90 days and I was asked if I would consider a full time role. \n\nAt the end of 90 days nothing happened and the manager I reported to told me he didn’t think they were going to extend again. \n\nLiterally while having that discussion I saw a call coming in. I let it roll to VM. \n\nLater I listened to the message and called the guy back. He was a recruiter for Microsoft. The first question I asked was “Is this an orange badge (contract) or blue badge (FTE) position.” \n\nIt was an FTE position and I went through most of the Microsoft 5 step process and started. After about 15 years of working for Microsoft Gold Partners, working for the mothership was a big step up.",
          "score": 17,
          "created_utc": "2026-02-05 17:16:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3nmrze",
          "author": "yoccosfan",
          "text": "I have been in the exact same situation several times and it is always very awkward when you are transitioning out, especially after a long period of time. I just tried to be as helpful as possible.",
          "score": 11,
          "created_utc": "2026-02-05 03:36:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3nnhcm",
              "author": "shadybadgal",
              "text": "Totall same thing I am trying to do.",
              "score": 3,
              "created_utc": "2026-02-05 03:40:47",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3nriye",
                  "author": "yoccosfan",
                  "text": "Yep. That’s all you can do. I did contracting for several years and the end was always awkward. However, I think the company and coworkers are just grateful for you to be there to help transition/knowledge share. \n\nGiven your contributions, I would expect that as your end date draws closer, a lot of people will express their appreciation for your work and professionalism.",
                  "score": 3,
                  "created_utc": "2026-02-05 04:06:41",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3oxeqm",
          "author": "hmm_this_is_hard",
          "text": "As a contractor, I go into each contract knowing that the end goal is to complete my project and transfer the knowledge over successfully. Ensuring the business has everything they need going into it.\nIf finishing out your contract is weird to you, maybe you should consider a non-contract position.\nHopefully you have your next role lined up. If not, going forward, if your contract renewal isn't in the works a few months out, start working on your next role.",
          "score": 20,
          "created_utc": "2026-02-05 09:59:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3nj1y7",
          "author": "panconquesofrito",
          "text": "W2 contractor or 1099 contractor? I take 1099 all day. If you are W2 it’s going to suck.",
          "score": 7,
          "created_utc": "2026-02-05 03:13:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3nkpd3",
              "author": "FedExpress2020",
              "text": "Corp to Corp all day",
              "score": 3,
              "created_utc": "2026-02-05 03:23:46",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o3nnfjr",
              "author": "shadybadgal",
              "text": "Oh really? I am W2. How do you find clients for the 1099 contractors?",
              "score": 1,
              "created_utc": "2026-02-05 03:40:29",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3tb7e2",
                  "author": "panconquesofrito",
                  "text": "Look, talking from someone who spent years in the W2 contractor category and getting f*cked without access to a 401 (k) for almost a decade. You need to find a way to switch to 1099 and get paid to your LLC. With that setup you can either open a Solo 401 (k) or a SEP IRA.",
                  "score": 1,
                  "created_utc": "2026-02-06 00:09:51",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3wvfvt",
          "author": "Own_Abies_8660",
          "text": "I haven't felt this, but I treat every extension as if it's my last (and always know there could be some funding issues in the middle of an extension). Switching around to new opportunities is the whole reason that I loved contracting.",
          "score": 5,
          "created_utc": "2026-02-06 15:08:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o41lpi4",
          "author": "TheJoeCoastie",
          "text": "I'm right there with you. I'm a contract PM now, and I'm done in April. I keep giving management reports on things I'm finding that can be fixed or streamlined, as asked, when I'm not active on my projects, and I feel as if nobody really seems to care. It makes me wonder whether leadership even looks at what I send weekly, since no one has said a word or asked a question.",
          "score": 3,
          "created_utc": "2026-02-07 07:15:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ary5o",
              "author": "Feisty_Ad_2891",
              "text": "If it doesn't involve their pay they don't read it.  I throw Easter Eggs in reports all the time (including a $100 reward that was sent to over 10 people) that are never claimed.  Good news is if they don't care then I don't have to either.",
              "score": 1,
              "created_utc": "2026-02-08 19:00:13",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4c7xut",
                  "author": "TheJoeCoastie",
                  "text": "That’s a good point. Maybe they don’t. And once they do I’ll be long gone and I doubt they’ll remember the emails/papers.",
                  "score": 1,
                  "created_utc": "2026-02-08 23:27:00",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qxskb5",
      "title": "Tips on how to manage PM stress?",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1qxskb5/tips_on_how_to_manage_pm_stress/",
      "author": "ktv82",
      "created_utc": "2026-02-06 20:14:38",
      "score": 82,
      "num_comments": 73,
      "upvote_ratio": 0.99,
      "text": "Hi, I’ve been in a PM for 4 years. A year ago I was promoted and took on double the workload. I have around 40 active projects at a time (ranging from small short term to large year+ long projects). \n\nAfter starting the new role, I started to have major stomach/GERD issues. My doctor thinks it’s stress related, but the weirdest thing is I don’t feel stressed mentally that much. Sometimes yes, but usually I feel ok. The biggest tell though is that my symptoms disappear when I’m on vacation. \n\nJust wondering if anyone has had similar issues? And if there was anything that helped you? Project management can be a pretty high stress job, so any advice is helpful!",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/projectmanagement/comments/1qxskb5/tips_on_how_to_manage_pm_stress/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o3zcsjb",
          "author": "Economy_Pin_9254",
          "text": "What you’re describing is pretty common, and it usually isn’t “stress” in the way people think about it.\n\nYou’re carrying too many open loops. Forty projects means forty sets of unresolved decisions, risks, and future obligations sitting in the background all the time — even when you feel mentally fine. Your brain never really powers down.\n\nThat’s why it shows up physically and disappears on vacation. Nothing is waiting on you there.\n\nA lot of Project Managers normalise this without realising it. You don’t feel anxious or panicked, but your body is still running constant threat detection because so much is unresolved or dependent on you.\n\nWhat actually helps isn’t stress techniques. It’s reducing how much uncertainty you hold as PM. Being clearer about what you own, what you escalate, and forcing decisions so things stop sitting in limbo.\n\nPM stress usually isn’t about hours. It’s about being the place unresolved decisions go to live. Your body notices even if you’ve learned to ignore it.",
          "score": 38,
          "created_utc": "2026-02-06 22:21:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o42sgyx",
              "author": "ktv82",
              "text": "Good point. Also, nothing gets done when I’m on vacation. If they have a question they don’t do their work and will just wait till I get back. Super annoying honestly.",
              "score": 2,
              "created_utc": "2026-02-07 13:34:39",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o457got",
                  "author": "Economy_Pin_9254",
                  "text": "If nothing moves when you’re away, it means decisions are (rightly or wrongly) sitting with you. People aren’t blocked by the work, they’re blocked by not knowing who the decision maker is!",
                  "score": 1,
                  "created_utc": "2026-02-07 21:04:46",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3zg7fr",
          "author": "Total_Literature_809",
          "text": "I just don’t care. Even if things go south. In my company I’m not responsible for the project success or failure, or even budget. I just don’t care, if things go bad, I just write the report",
          "score": 53,
          "created_utc": "2026-02-06 22:39:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3zmcrh",
              "author": "Wabi_Sabi_Love",
              "text": "“Care, but only just enough.”\n\nAn old friend gave me that advice, and I think it’s excellent advice. Care just enough to do the job, but don’t care so much that it causes heartburn.",
              "score": 15,
              "created_utc": "2026-02-06 23:13:34",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o40663d",
                  "author": "therealvitocornelius",
                  "text": "yes, this is about it. Take pride in your work, but don’t kill yourself",
                  "score": 4,
                  "created_utc": "2026-02-07 01:08:47",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o409cvd",
              "author": "Maro1947",
              "text": "Great attitude. We don't get the Sales commission so just do what we are paid to do",
              "score": 12,
              "created_utc": "2026-02-07 01:28:21",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o3zv9gi",
              "author": "keriekat",
              "text": "This. I tell myself it's just a job to pay the bills. I don't make any extra $ if things are 100% perfect and I don't make any less otherwise.",
              "score": 9,
              "created_utc": "2026-02-07 00:05:05",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o4032yx",
              "author": "Mokentroll22",
              "text": "This is it. Identify the risks and make sure everyone knows about them early. Then when knuckle heads still manage to mess up its well documented that you flagged those risks and no one did anything to mitigate the issue. You arent paid nearly enough to make sure operations knows how to do their jobs. Thats for operations LM/SOs to work out. \n\nI try to help my team members and set everyone up for success but when they dont try their best I will diplomatically throw them under the bus.",
              "score": 9,
              "created_utc": "2026-02-07 00:50:14",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o406dqz",
              "author": "therealvitocornelius",
              "text": "two years into being a project manager, and this is where I’m at now. My new boss that I just got moved under basically gave me the perspective that success or failure is likely not my fault. A.k.a. do a good job but the outcomes depend on everybody else",
              "score": 6,
              "created_utc": "2026-02-07 01:10:05",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3z1q0y",
          "author": "Illustrious_Ad_23",
          "text": "40 projects sounds quite irresponsible. This means around an hour for each each week, not enough for most, I guess. Certainly it depends on the size, but I have managed four rather large projects maximum the same time and found that quite stressful, since you have to cut corners a lot to make things work and constantly get interrupted by topics often far away from what you try to concentrate on at that moment. You might be able to do that by retreating to a very stereotypical PM role of not caring for any details at all, but in my experience projects often fall short if you do that.",
          "score": 22,
          "created_utc": "2026-02-06 21:26:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ytfab",
          "author": "Nice-Zombie356",
          "text": "You have to stop caring so much.   I mean yes, care.  And Try.  But not care or try as hard as you must be. \n\nAlso, 40 projects is crazy.   Even if many of them are small, that means 40 sets of notes.  40 status reports?   Just a 10 minute update per project is almost a full day of effort.",
          "score": 16,
          "created_utc": "2026-02-06 20:45:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3yv5wo",
              "author": "belinck",
              "text": "40 is multiple programs.",
              "score": 5,
              "created_utc": "2026-02-06 20:53:48",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o3yvx43",
              "author": "essmithsd",
              "text": "This.  I don't stress about things that are not under my direct control. In the end, the product I'm shipping isn't life or death.  I care about doing my job well, but people aren't going to die if we slip a deadline.",
              "score": 2,
              "created_utc": "2026-02-06 20:57:33",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o3yurr8",
              "author": "ktv82",
              "text": "Yeah and having to manage 40 projects in our PM tool. And making 40 timelines. And sending all the comms for them. So fun lol\n\nI do try to take a step back and not care, but can be challenging. Especially when all my designers vent their stress to me.",
              "score": 1,
              "created_utc": "2026-02-06 20:51:51",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3yxc19",
                  "author": "Nice-Zombie356",
                  "text": "I hear ya.   \n\nI’ve also been coached to be less of a perfectionist.    In all honesty, I’d suggest finding a “Life Coach” or management coach who may help you adjust your perspective.  It took me a bunch of coaching and I still have a ways to go to reduce my perfectionist tendencies, which lead to stress. \n\nAs an example- i once  had a complex project budget that wasn’t reconciling correctly.  I pulled an all nighter rebuilding a big budget and it still wasn’t quite right.  \n\nDiscussing it later, my coach suggested nobody would have noticed the discrepancy, or been upset if they did.   If someone noticed AND was concerned, then maybe I should stress over fixing. \n\nSure enough, something similar happened later and I added a line to the budget for “adjustment” with a footnote explaining what didn’t reconcile. Nobody ever noticed and my stress level dropped from 12 to 8.",
                  "score": 3,
                  "created_utc": "2026-02-06 21:04:38",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o42i0q1",
          "author": "Low-Illustrator-7844",
          "text": "im running 13 mid to large and feeling miserable. 40 is just insane.",
          "score": 15,
          "created_utc": "2026-02-07 12:21:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3yoram",
          "author": "tardiskey1021",
          "text": "Most successful PM’s I know give way too much of themselves and don’t take care of physical and mental health out side of work.  I was just promoted to a senior PM and I am setting my own pace for productivity and establishing boundaries for what I can provide.  I am a human before I am an employee.  Doesn’t mean I won’t work hard I’ve just seen to may 60 -70 hour PM’s burning out and I won’t.",
          "score": 15,
          "created_utc": "2026-02-06 20:21:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3yymd6",
          "author": "Outrageous-Pizza-66",
          "text": "One thing my leadership teams would tell me.  Don’t think you should be addressing every detail.  Call on your team to shoulder some of those things.  Especially in larger projects.  The team should be stepping up to support you.",
          "score": 14,
          "created_utc": "2026-02-06 21:10:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3zdfwl",
              "author": "tarrasque",
              "text": "Ah. You work for sane people, not insane type-a PMO control freaks who’ve devised an insanely detailed and overwrought process full of documents and who just can’t NOT critique and second-guess every document, choice of words, meeting, time slot, presentation, and breath you take. \n\nLead with trust? Leave a detail to the team? Guess you’re not doing your job. \n\nI’ve worked for those people.",
              "score": 7,
              "created_utc": "2026-02-06 22:25:20",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o40xiys",
                  "author": "Outrageous-Pizza-66",
                  "text": "Agree with your points. It’s all about “reading the room”.  \nI’ve had some very seasoned PMs tell me that the hardest part about the project is the people.",
                  "score": 2,
                  "created_utc": "2026-02-07 04:01:46",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o3yzr7e",
              "author": "ktv82",
              "text": "Thank you! I’ve been trying to empower them to step up a bit and own more of their own comms. I get a bit of resistance tbh.",
              "score": 5,
              "created_utc": "2026-02-06 21:16:37",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o41l2gm",
          "author": "IHZ66",
          "text": "40 projects at once? How?! I am barely keeping the team together and the stakeholders engaged with a single one.",
          "score": 14,
          "created_utc": "2026-02-07 07:09:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o43rp76",
          "author": "Lethologica_",
          "text": "40 is absolutely cooked, no wonder you're stressed. I would be looking for a new role.",
          "score": 13,
          "created_utc": "2026-02-07 16:41:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3yon0f",
          "author": "Suspicious-Camera489",
          "text": "40 active projects? Dude, that sounds like a nightmare. Great job on being so organized.\n\nBut you need help. There is no secret, you need to give some of you projects to someone else. Your team need expansion asap. \n\nTalking from personal experience, once stress shows on you body, it is just a matter of time before you start making mistakes. Ask for help before that happens. \n\nAlso, I also feel fine, until I sleep for two weeks straight after a stressful period. Our head lies to us, but our body never does.\nGood luck!",
          "score": 12,
          "created_utc": "2026-02-06 20:21:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3yrhnv",
              "author": "ktv82",
              "text": "Yeah... it’s crazy. Somehow thought I was handling it ok! Unfortunately I’m the only PM in this specific function. My manager said I could get a freelancer, but not convinced that’s enough. Is managing another person worth the delegation? \n\nAnd it’s so true, the body does not lie!",
              "score": 1,
              "created_utc": "2026-02-06 20:35:16",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3ysf64",
                  "author": "Suspicious-Camera489",
                  "text": "It is worth it. Not in the fist month, but it is on the long run. In your case it is vital you get an experienced freelancer, who will also know how to report back to you, without making more work for you. \nMay I ask about the field you are working in?",
                  "score": 3,
                  "created_utc": "2026-02-06 20:39:59",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o3ytko1",
                  "author": "1z1z2x2x3c3c4v4v",
                  "text": "> My manager said I could get a freelancer, but not convinced that’s enough.\n\nWhat are you waiting for? Get some help ASAP.",
                  "score": 3,
                  "created_utc": "2026-02-06 20:45:49",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o424em1",
                  "author": "Dulcinea-1994",
                  "text": "After 5+ years (and lots of gastro issues myself), I was completely overwhelmed with the 40+ active projects I was solo juggling at any given time at my growing company. Believed in our products. Adored my coworkers. Was overjoyed when CMO fought to let me hire a Project Coordinator.\n\nHR told me that at the low salary range we were offering (which was almost as much as I was making), the role wasn’t allowed to intake or build new projects and was strictly limited to coordinating the work that I built and assigned in the PMS that I’d personally implemented a few years earlier.\n\nI established a new process where I did 75% of the work before handing over to the PC. I (mostly) adhered to HR’s “coordination only” mandate but considered the fact that at some point I’d have to take PTO and no one knew how to do anything I did. (Previously, my PTO required a week of preparation and the expectation that certain things just wouldn’t get started or done during that period.)\n\nAt my annual review three months later, I received high remarks, commending my leadership skills. I was feeling appreciated and accomplished now that I finally had support. \n\nTwo weeks after that, I was laid off in a RIF. \n\nThe CMO who months earlier had fought to get me help is rumored to be the person who identified me as redundant. He subsequently admitted to one of my former coworkers that he didn’t know or understand what project managers even do, despite the fact I had monthly meetings with him. \n\nI thankfully landed on my feet fairly quickly with a new company and I have an amazing boss who routinely tells me to stop taking on so much. I thank my lucky stars every day. \n\nBut my gawd, the PTSD I still internally battle. I have such a fear of speaking up when I’m at capacity now because I spent years physically making myself ill while managing an unmanageable, unsustainable amount of work and I never expected that I would be so easily discarded by someone who didn’t understand or value everything I did for our team!",
                  "score": 2,
                  "created_utc": "2026-02-07 10:17:24",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o426o94",
          "author": "Filtered_Frequency",
          "text": "Man. I'm carrying five projects at different stages right now. It's manageable but enough to last me the year. 40 projects? That's insane.",
          "score": 11,
          "created_utc": "2026-02-07 10:39:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o44auee",
          "author": "dirtyitalianguy",
          "text": "It took me awhile to cope and develop a strategy for project stress. At the end of the day, you can only exert so much control over something and the rest relies on your partners and stakeholders....so use them to their fullest. \n\nBe consistent, be verbose, be direct, be concise...is another approach I stand by. \n\nThe PM is a role of organization, socialization, and documentation. If your team misses delivery and you've ensured it was properly addressed and socialized, well then it lies with your initiative owner in my opinion.",
          "score": 12,
          "created_utc": "2026-02-07 18:15:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3zda9a",
          "author": "Wwtslwwfwdt",
          "text": "Therapy is what helps me the most. And setting firm boundaries with my time, no more late night emails or answering texts or messages after my workday has ended",
          "score": 11,
          "created_utc": "2026-02-06 22:24:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3z03uu",
          "author": "Rdikin",
          "text": "Man, I feel you there. \n\nConstruction PM. Each crew runs daily and weekly projects. \n\nPushing 30+ projects a week that I have full ownership of is crazy stressful. \n\nI haven't found a way to properly manage the stress and I've been burned out pretty much since I started. \n\nAdd the projects onto running the branch, the crews, the warehouse, logistics, and the fleet, and my mental health and personal life are pretty much non-existent.\n\nIt's more money than I've ever made but I'm pretty much of the thought that it's not fuckin worth it.",
          "score": 11,
          "created_utc": "2026-02-06 21:18:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3yyidd",
          "author": "obviouslybait",
          "text": "I just left a job like yours, 40+ projects to manage and have total control and ownership for. I answer for everything that can go wrong and get PIP'd if anything goes wrong.\n\nPut in my notice, don't even have a job lined up but prioritizing my mental health and wellbeing. \n\nFuck that place, I'm stepping out of PM for good, back to technical for me.",
          "score": 9,
          "created_utc": "2026-02-06 21:10:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3yqsv8",
          "author": "Wndrunner",
          "text": "I used to hide under my desk and binge chocolate.",
          "score": 7,
          "created_utc": "2026-02-06 20:31:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3yrmsi",
              "author": "ktv82",
              "text": "Sounds yummy",
              "score": 3,
              "created_utc": "2026-02-06 20:35:59",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3yrp84",
          "author": "wittgensteins-boat",
          "text": "An hour a project a week is insufficient time to manage anything.\n\nNo wonder you have gastric issues. \n\nYou are being taken advantage of.",
          "score": 6,
          "created_utc": "2026-02-06 20:36:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3yzzj4",
              "author": "ktv82",
              "text": "I call it bronze handcuffs. Money is pretty good, and the market is bad rn.",
              "score": 2,
              "created_utc": "2026-02-06 21:17:46",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3yv9qv",
          "author": "manmuffin92",
          "text": "The same thing happened to me. I worked as a PM in construction for five years. Sometimes when I wake up, I need five minutes to realize which country I’m in. What I did was use my field experience and switch to a sales engineer role, less pay, but I’m happier.",
          "score": 6,
          "created_utc": "2026-02-06 20:54:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3yy794",
          "author": "B4tzn",
          "text": "Describe a typical day please. I'm curious. Can't imagine how 40 can work?\n\nMeditation, exercise, sauna, being outside, traveling.. all that helps me. But vacation is the best. Just not touching work for a few weeks straight.\nAnd no my experience is different. I get very emotional when I'm stressed and I can't work anymore then (I just get static in my mind).",
          "score": 7,
          "created_utc": "2026-02-06 21:08:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3yzft8",
              "author": "ktv82",
              "text": "I log on, review the briefs and messages that came through over night from teams abroad. My designers have their sync early, so after I get through that- I start addressing their messages (questions, need XYZ for the project, etc). I have a weekly call with them and they give status updates every project together. \n\nI also usually have around 4 calls a day (sometimes more). \n\nIn between that, I’ll work on timelines and managing our PM tool. I can’t work on all 40 a day, lower priority projects get put on the burner.\n\nI just took a vacation (short one) and it was amazing. It’s been a nasty winter so haven’t been able to be outside much, which extra sucks.",
              "score": 4,
              "created_utc": "2026-02-06 21:15:03",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3z2nb8",
                  "author": "B4tzn",
                  "text": "To how many people do you speak in each of these weekly calls and in the daily ones?\nHow many focus shifts do you have each day? Do you have bad days where you can't be a productive?\n\nYes somehow this winter seems worse and seems to take forever. I'm glad you were able to enjoy it nonetheless",
                  "score": 2,
                  "created_utc": "2026-02-06 21:30:58",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3yygyg",
          "author": "nborders",
          "text": "I exercise until my brain stops working. I usually ride a bike to work when I can. If not I work on my trainer.  45 min ride will usually reset me enough where I can sleep well. \n\nUsually a good night’s sleep and good effort fixes the rest.",
          "score": 6,
          "created_utc": "2026-02-06 21:10:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o43ijvr",
          "author": "NobodysFavorite",
          "text": "I used to do a large number of projects at once.\n\nThe trick is being absolutely ruthless with where you invest not only your time but your mental energy, and being highly organised with your information.\n\nOn any given day I would plan ahead so that I would only think about one, two, maybe a few projects. You're buying yourself brain space to become a lot more effective.",
          "score": 6,
          "created_utc": "2026-02-07 15:56:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ysvc2",
          "author": "LDNLibero",
          "text": "I suddenly feel much happier with my workload.\n\nI don't know if the expectations for PM are different wherever you're based but I can't imagine having that many projects is feasible to have an impact.\n\nI work in the NHS and have never had more than 2 at a time",
          "score": 4,
          "created_utc": "2026-02-06 20:42:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3yufmg",
              "author": "ktv82",
              "text": "2 is the dream.",
              "score": 1,
              "created_utc": "2026-02-06 20:50:09",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4ccc4z",
          "author": "Jumpy_Knowledge_3330",
          "text": "oh boy where do we start. \n1) how can you possibly do a good job for your career and your teams by handling so many projects? more simultaneous projects doesn't make you a better/good PM my friend.\n2) saying no, or escalating for help is NOT frowned upon. remember this \n3) take night walks. if you can, DONT take your phone with you.  the Combination of 20min fresh air and less screen time does wonders.\n4) avoid working before you sleep. you are tired, less productive and carry that stress over to your bed messing up your sleep.\n5) pick a day and an afternoon where you are strictly offline/off time/off .  our brains get saturated with info and stress and this is the equivalent of restarting your laptop. your brain will see things clearer and be more productive/less stressed\n\n\ngood luck and god speed. you better ask for  a raise!!!😎🤘🤘",
          "score": 5,
          "created_utc": "2026-02-08 23:53:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4hajkl",
          "author": "Sweaty-Captain-694",
          "text": "Not necessarily advice just more a personal anecdote but I’ve been in that position multiple times and I reach a point where I just say “f—k it” and start speaking my mind. Stand up to stakeholders, push back where things are unreasonable and just decided I either live life on my terms or just give up. And every single time I’ve had massive breakthroughs. Promotions, praise and things get better. \n\nNobody like arrogance, aggression or ego. But they do respect people that have the self respect to speak their mind and cut through the BS corporate hierarchy. Managing 40 projects is impossible and nothing is worth your health being damaged. \n\nBut like i said, not advice, just my experience.",
          "score": 5,
          "created_utc": "2026-02-09 18:56:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3z4qaz",
          "author": "campbell-1",
          "text": "Read and reread and reread Meditations by Marcus Aurelius",
          "score": 9,
          "created_utc": "2026-02-06 21:41:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3zwq91",
              "author": "ErikaNaumann",
              "text": "I'm reading this book now. Interesting to see more PMs reading the same. ",
              "score": 2,
              "created_utc": "2026-02-07 00:13:30",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3yoe22",
          "author": "DiscoInError93",
          "text": "Automate and standardize as much as you can - meeting recaps, email templates, project documents, etc.\n\nDelegate tasks that aren’t the best use of your time and skills.\n\nPrioritize ruthlessly without allowing distractions and enabling fire fighting.\n\nSet boundaries, especially outside of working hours.",
          "score": 4,
          "created_utc": "2026-02-06 20:19:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ysnsw",
          "author": "eskjcSFW",
          "text": "Extreme sports. I mtb during the summer and ski in the winter",
          "score": 3,
          "created_utc": "2026-02-06 20:41:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3zwy50",
          "author": "Old-Block-8341",
          "text": "What industry? Data centers?",
          "score": 4,
          "created_utc": "2026-02-07 00:14:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o49v0n0",
          "author": "CheckoutFixer",
          "text": "I dont know why you have so many projects going at once. You relieve yourself of many of the less important ones. Focus on remaining on projects that are critical to the organization (to do this, look for projects that have active participation from senior leadership at the Steering committee level). ",
          "score": 4,
          "created_utc": "2026-02-08 16:24:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4a5vyq",
          "author": "Fantastic-Nerve7068",
          "text": "yeah been in pm for about 9 years now and i relate hard to what you’re saying had a stretch early on where i didn’t “feel” stressed but my body was telling a different story tension headaches chest tightness all of it disappeared on weekends or vacation\n\nwhat helped me was building real off switch routines like a hard stop in the evening no slack no email even if stuff is burning i also started blocking “focus” hours on my calendar during the week to reduce context switching and that lowered the background noise a lot\n\nalso worth tracking if your workload has become mostly reactive like putting out fires instead of steering work if you’re constantly in catch up mode even low key stress can build up physically over time\n\ntherapy helped too not because i was melting down but just to make sense of what my body was clearly feeling even when my brain wasn’t acknowledging it\n\nyou’re not imagining it pm stress shows up in weird ways and managing it takes more than just telling yourself you’re fine",
          "score": 3,
          "created_utc": "2026-02-08 17:17:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4cjfdz",
          "author": "apfrkf",
          "text": "Have an identity outside of work. A place where you aren’t a pm. I love baking, reading, traveling, paddle boarding, occasionally knitting and training my dog. Having something that makes you you outside of a job that is overwhelming at best is important.",
          "score": 3,
          "created_utc": "2026-02-09 00:33:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3yojnx",
          "author": "DatDamGermanGuy",
          "text": "Edibles",
          "score": 4,
          "created_utc": "2026-02-06 20:20:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3yonbr",
              "author": "ktv82",
              "text": "They make my GERD worse unfortunately 😭",
              "score": 1,
              "created_utc": "2026-02-06 20:21:03",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3yto89",
                  "author": "cmatthewp",
                  "text": "How about pill form?",
                  "score": 0,
                  "created_utc": "2026-02-06 20:46:19",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3z16se",
          "author": "Jakey-poo",
          "text": "Alcohol and a bag",
          "score": 3,
          "created_utc": "2026-02-06 21:23:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o432vp4",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-07 14:35:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3zpl08",
          "author": "PanzerFauzt",
          "text": "talk walks and eat less bread",
          "score": -4,
          "created_utc": "2026-02-06 23:32:07",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qwmsps",
      "title": "How can I tell my client I can't handle the constant revisions anymore?",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1qwmsps/how_can_i_tell_my_client_i_cant_handle_the/",
      "author": "Correct-Credit1961",
      "created_utc": "2026-02-05 14:31:36",
      "score": 37,
      "num_comments": 31,
      "upvote_ratio": 0.93,
      "text": "I'm a Senior Analyst working on a project for a major client. At the start of this year, my company put me on this account because of my performance, and I was excited about the opportunity.\n\nBut little did I know the revisions would be endless. Since January, the client has been requesting round after round of changes—many of which contradict previous feedback or go beyond the original scope we agreed on. I've been working 9+ hours each day trying to keep up, and I've started experiencing stomachaches and gastritis from the stress.\n\nMy company really wants to maintain a long-term relationship with this client, so I feel like I have to act like a doormat and just take it. I'm terrified to bring this up with the client because I'm afraid I'll get emotional or even break down during the conversation. I don't want to jeopardize the partnership, but I also feel like I'm being taken advantage of.\n\nHow can I professionally tell the client that the revisions have exceeded the original scope? Is there a way to do this without damaging the relationship? I'm so stressed that I'm scared I won't be able to keep my emotions in check if I try to have this conversation.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/projectmanagement/comments/1qwmsps/how_can_i_tell_my_client_i_cant_handle_the/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o3qxesw",
          "author": "pmpdaddyio",
          "text": "You don’t. You use your change management process and charge them. You also adjust the schedule and scope. It’s all related. Changes stop pretty quickly when you do that.",
          "score": 25,
          "created_utc": "2026-02-05 17:11:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3q0gmp",
          "author": "Senior_Operation_451",
          "text": "\"Hey, the volume of revisions seems to have exceeded what was outlined in our original agreement, can we discuss the scope?\"\n\nSay that sentence. Then prepare for the negotiation. If you're afraid of getting emotional, have your colleague role-play as the client and practice the conversation repeatedly, or use negotiation sim like chatvisor  to rehearse until you have no emotional reaction. Then go have the actual conversation.\n\nDon't work yourself to death trying to stay on top of everything. From their perspective they'll just see that you're completing all your tasks, so the workload must be fine. If you don't speak up, how are they supposed to know there's a problem ?",
          "score": 20,
          "created_utc": "2026-02-05 14:34:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3q3udy",
              "author": "Suspicious-Camera489",
              "text": "This and also, “let’s set up a call, discuss the latest version and agreed on the changes. After that, we cannot accept any more revisions if we want to meet the deadline. The revisions are necessary but to many of them are holding back the process and we as a team are not efficient anymore.”\n\nEnglish it not my first language but you get the idea",
              "score": 6,
              "created_utc": "2026-02-05 14:51:39",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3r7mx5",
          "author": "bstrauss3",
          "text": "Change Orders\n\nEverytime you get one of those requests, reply to the client with a copy to your project team\n\n\"I believe this represents a change in project deliverables or scope and I am reaching out to our account management team to address the necessary change order. Until this is resolved we will continue executing the approved project.\"",
          "score": 20,
          "created_utc": "2026-02-05 17:58:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3su6tr",
              "author": "pmpdaddyio",
              "text": "There is no “I believe” or negotiation. I start with the following grade every single time:\n\n“I’ve noted your change request(s). I need to assess them for impact on schedule, scope, and cost. I’ll present them to the change team and present you with an invoice, an updated schedule, and scope document.”",
              "score": 7,
              "created_utc": "2026-02-05 22:36:43",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3sv6z4",
                  "author": "bstrauss3",
                  "text": "I believe is specific code used in US Federal Government Contracting.\n\nUnlike commercial, state, and local government contracts -- where you follow the contract.\n\nWhen you're dealing with the federal government any member of government cause a change.\n\n believe is what you write to your contract officer to trigger the change order negotiations. do when you reach out to the contracts offficer. But then you start doing what they tell you to!",
                  "score": 2,
                  "created_utc": "2026-02-05 22:41:53",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3rsm7v",
          "author": "1z1z2x2x3c3c4v4v",
          "text": "Maybe...you need to adopt a more Agile project management process so changes and additions can be added to the backlog.\n\nBut it also seems like you have no change management process (reviewed by a board) to prevent the endless scope creep you describe.   A project is a balance between Time, Scope, and Cost.   If you can't contain the Scope, you can't deliver a good outcome.",
          "score": 19,
          "created_utc": "2026-02-05 19:35:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3yneaj",
          "author": "Adventurous_Vapor",
          "text": "Revisions come with change orders which increases scope and drive a price increase. Revisions stop when the money stops.",
          "score": 16,
          "created_utc": "2026-02-06 20:14:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3q9aig",
          "author": "dgeniesse",
          "text": "I was in an organization that changed a lot. We were all stressed except one guy, a senior manager. I asked him why he was calm while we were all stressed. \n\nHe just stated he only does the even number changes. This was #19 and he ignored it. On #20 he became Mr. Excitement. Very visible. Very active. True leadership!\n\nSo just do the even number changes!\n\n/jk",
          "score": 10,
          "created_utc": "2026-02-05 15:19:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3r652a",
              "author": "Lurcher99",
              "text": "Thanks for the chuckle. Delay #19, as #20 will change it. Why do it twice?  😆",
              "score": 2,
              "created_utc": "2026-02-05 17:52:07",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3s72cj",
                  "author": "dgeniesse",
                  "text": "Yes, it gave a new meaning to “that’s odd …”",
                  "score": 2,
                  "created_utc": "2026-02-05 20:43:57",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3qsps6",
          "author": "DiscoInError93",
          "text": "How is this a Senior Analyst’s responsibility? This should be communicated and managed by your PM or EM.\n\nAn analyst probably doesn’t have authority to accept scope changes to begin with and certainly shouldn’t have authority to negotiate contract-impacting changes on their own…",
          "score": 9,
          "created_utc": "2026-02-05 16:49:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3xgeg2",
          "author": "Bertie_McGee",
          "text": "Tell the client that constant revisions at this stage are causing delays. Meet with key stakeholders and come to a decision: is the business case and plan still feasible and valid? \n\nIf yes, then tell them that you are happy to discuss changes to Version 2, 3,....n for the future, but for now, version 1 must continue as originally designed and agreed upon.\n\nIf no, then it's time to properly and exhaustively redefine the requirements to meet the end goal or to shelve this particular project.",
          "score": 9,
          "created_utc": "2026-02-06 16:48:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3roj1r",
          "author": "More_Law6245",
          "text": "I'm sorry to hear that you're in this position but I might suggest a course of action and it's having a straight forward conversation about the project's triple constraints with your client when they're wanting a change. If one constraint of time, cost or scope changes then the other two must change.\n\nAll you need to say to the client is that \"I'm happy to help with this scope change and the impact of this change will see your project take longer to deliver and it will cost more\".  It pushes back on to the client to see how serious they are about the change as It becomes a litmus to test to see if the client balks at the fact it's going to take longer and cost more.  When the client tries to vary the conversation around any type of change just refer back to the triple constraint because it's a causal effect model. You also have to have a frank conversation about the project's project plan and especially if it's an approved and has been baselined and if in the current situation it's effectively allowing scope creep to occur and contractually the client is exceeding the agreed scope of the contract which raises another whole ball game of conversation around what is legally binding for those variations from everything from support, design, licensing etc. But also how it impacts your organisation's ability to service other clients because the workforce planning model is constantly changing (but that is your executive's problem but it's something that should be in the back of your mind with situations like this.\n\nYou need to seriously consider escalating internally with your project manager and project board or executive about the scope creep problem because it has contractual and legal obligations but it's also heightens your organisation's reputational risk. Then if your executive choose to allow the client's behaviour go unchecked (their choice) then you need to ask for administration support or you will run the risk of burnout. Again highlight the risk and impact of choice!\n\nThis is about you understanding that you need to be having professional and sometimes difficult conversations about fact and impact of choices and the associated risks. Without putting too much of a spin on this you need to put yourself in a proactive position rather than being passive because your fear is leading you where it shouldn't, you need the confidence to point out the facts and it's why we have a project plan, it's a legally binding plan and contract of who, what, when and how and all you're doing is enforcing that plan. The only last thought around this is that your client also knows you're a soft touch and you're actually being bullied or rough ridden into scope creep without you even realizing it, just some reflection points for your consideration and good luck, I hope it works out for you.\n\nJust an armchair perspective.",
          "score": 8,
          "created_utc": "2026-02-05 19:16:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3q3ug7",
          "author": "Outrageous-Pizza-66",
          "text": "You need to put your client in a box.\n\nWhat I mean by that is, if the work if piling up quicker than you can complete it, then you need to have a method for providing chunks of work.  Think of it like revisions or releases. \n\nOne method is to have your leadership team agree to your method, before approaching your client with this.  Then take your client and indicate that you will package up their requests, and for X period of time, you will work on these. Complete them, and then have another session with them, gather more of their next batch of requests, and then complete those.  That will allow you to manage your workload (work/life balance), and provide a consistent and quality output.  \n\nAlso if you think the scope is being exceeded, then you need to refer back to the original Statement of Work, or Signed off requirements to identify such.  Again, have the conversation with your leadership team about this.  Giving away free work sets a bad precedent.  Moving forward, that client and potentially other clients will know that they can push the bounds of any signed/agreed requirements and start asking for the moon.  \n\nThis becomes less about you 'handling' it, and more about putting a process in place and following the rigor of that process.  ",
          "score": 6,
          "created_utc": "2026-02-05 14:51:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3qqajx",
          "author": "2021pmp",
          "text": "SOW with fees for changes",
          "score": 6,
          "created_utc": "2026-02-05 16:38:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3qvmln",
          "author": "Hydra_AlexFG",
          "text": "Renegotiate so that you can charge them for revisions that go outside the scope or back to where you already were.  They will f8gure out how to fix it on their end so they dont have to pay you. It will also shed light on their poor Internal communication as well",
          "score": 6,
          "created_utc": "2026-02-05 17:03:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4fuyk3",
              "author": "pmpdaddyio",
              "text": ">Renegotiate so that you can charge them for revisions that go outside the scope or back to where you already were. \n\nWhy would a client agree to that? If you leave the SOW open and unenforceable, as your client, I am going to push and leverage for that. If you try to negotiate, I'm going to say no, or want to pay way less. \n\n>They will f8gure out how to fix it on their end so they dont have to pay you\n\nNo it won't. See above, they simply won't pay you. They don't have to. You can't negotiate with someone that has the upper hand.\n\n>It will also shed light on their poor Internal communication as well\n\nIt's not poor communications as described by OP. Its poor requirements gathering and SOW creation adding into crappy project discipline. This is entirely on OP and their organization.",
              "score": 1,
              "created_utc": "2026-02-09 14:48:24",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3q3m8e",
          "author": "ExtraHarmless",
          "text": "Are you the PM? If not, work with them on how to handle incoming change requests and follow the process.\n\nDon't work more than normal hours to accomplish the changes. With every change give them an estimate of completion and work to that. Make sure to help them understand changes=time+cost. Let them know that deadlines will slip and rework has cost attached to it. Look to the contract that they signed and understand it inside and out.\n\nWork with  your manager on a strategy for this client that makes sense. It will be a challenge, but it will save your sanity.",
          "score": 5,
          "created_utc": "2026-02-05 14:50:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3q8tw5",
          "author": "Ravintolavaunu",
          "text": "Talk to your PM about the change management process and ask what is agreed with the client. If the client pays the hours you work then yes, it is much work but extra money for your employer. If there is a fixed fee it is up to the PM to manage the incoming revisions.",
          "score": 6,
          "created_utc": "2026-02-05 15:16:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3v9h3t",
          "author": "dhemantech",
          "text": "At its simplest, for every change requested, communicate the impact of the change on deliverables, effort and schedule.",
          "score": 5,
          "created_utc": "2026-02-06 08:12:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3wbp57",
          "author": "A_human_humaning",
          "text": "Friend, you are the SUBJECT MATTER EXPERT in your area. Boundaries are vital - it also tells the client that you are not playing around. They don’t need to be walls - they can be speed bumps. \n\nTalk to your manager or someone you trust won’t give away your feelings. Tell them about how erratic and often the changes they are asking for are, and how out of scope. Bring it back to the business case - too many changes signal a flimsy or not-ready product. Taking things back a phase or two to realign might help you turn things around.",
          "score": 5,
          "created_utc": "2026-02-06 13:24:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3qmep6",
          "author": "tcumber",
          "text": "Get agreement on MVP with Prioritization with trade offs.",
          "score": 4,
          "created_utc": "2026-02-05 16:20:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3vnxyu",
          "author": "Mitsuka1",
          "text": "First and most important question: are you the PM?\n\nThe answer to this changes the advice we will give.",
          "score": 3,
          "created_utc": "2026-02-06 10:30:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4a73w8",
          "author": "Fantastic-Nerve7068",
          "text": "you’re not alone in this at all and i really feel for you\n\nyou’re clearly committed and care about delivering quality work but it sounds like the lack of boundaries is burning you out\n\none thing that helped me in a similar situation was shifting from reactive mode to structured communication setting up a formal change log or “decision tracker” made it easier to say hey this request contradicts revision 3 or falls outside original scope without making it feel personal\n\nalso if you’re worried about emotions during the convo write out your main points ahead of time and maybe even send a version of it in writing first\n\nframing it as “in order to maintain quality and hit deadlines we’d like to align on how changes are scoped moving forward” can help keep it constructive\n\nprotecting your energy isn’t selfish. it’s how you stay in the game long term.",
          "score": 2,
          "created_utc": "2026-02-08 17:22:54",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r0jnw3",
      "title": "Client who cancels a lot, but within the required window—how do I let them know it's disruptive without being too pushy?",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1r0jnw3/client_who_cancels_a_lot_but_within_the_required/",
      "author": "Longjumping-Wafer102",
      "created_utc": "2026-02-09 23:02:14",
      "score": 36,
      "num_comments": 19,
      "upvote_ratio": 0.93,
      "text": "I work in a client-facing service role with booked sessions\n\n\n\nI have a slightly limited schedule (baby) with 5 slots a day, 4 days a week. I don't like to take on too many clients if I can't service them as needed.\n\n\n\nI have a client who frequently cancels and I think they think it's fine because they do let me know before the 24-hour late cancel fee kicks in. They've rescheduled at least 50% of our scheduled meetings due to work and social obligations.\n\n\n\nMy question is: how can I word this via email or in person so that they don't feel bad or embarrassed, but that they understand that despite being in \"compliance\" of my policy, the amount they cancel is a huge disruption to my schedule?\n\n\n\nHere's my issue: I'm not great at putting pressure on clients. I tend to be emotionally soft and struggle with confrontation. I don't want to come across as demanding, but I also can't keep accommodating this constant rescheduling. How do I communicate this professionally without getting emotional or backing down?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/projectmanagement/comments/1r0jnw3/client_who_cancels_a_lot_but_within_the_required/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o4itzsn",
          "author": "MattyFettuccine",
          "text": "When they cancel, you ask them to rebook quickly as this will affect their project schedule.\n\nOr you update your policy for a longer cancellation notice.",
          "score": 32,
          "created_utc": "2026-02-09 23:35:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4l5rig",
          "author": "EconomistFar666",
          "text": "I’d frame it as an impact conversation, not a policy one. Something like “I want to make sure we’re getting the most value out of our time together. When sessions are frequently rescheduled, it’s hard for me to hold space for you and other clients since my schedule is pretty fixed. If weekly timing is tricky right now, we can look at less frequent bookings or a different cadence that’s easier to keep”.",
          "score": 17,
          "created_utc": "2026-02-10 09:27:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4n2m1s",
              "author": "A-n-o-v-a",
              "text": "This! And also, confront any situation that you are not comfortable with, because at the end of the day, it's your time. Don't let it get wasted.",
              "score": 3,
              "created_utc": "2026-02-10 16:41:12",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4it0un",
          "author": "JohnnyWeapon",
          "text": "I’d put it on my RAID and call it out through that avenue. It’s a good talking point and relevant to the project as a risk to the timeline. \n\nThey should have a vested interest in keeping the project on track. \n\nI’ve been a client-facing PM and my style is more empathetic and collaborative (sounds like you) and while I’m not shy to be confrontational, I’ve always found that keeping things in the context of the project helps a TON.",
          "score": 12,
          "created_utc": "2026-02-09 23:30:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4io3sr",
          "author": "Rude_Taro_9572",
          "text": "I'm generally pretty direct. Try having a conversation along the lines of: \"I've noticed you're frequently cancelling/rescheduling our appointments and I was wondering if we could work together to figure out a different day/time that would work better for your schedule?\"\n\n\n\nDon't be afraid to communicate directly with the client—it's the most efficient approach. If you struggle with emotional control during these conversations, use negotiation sims like chαtvisor, or have a colleague role-play as the client. Practice the conversation multiple times until you can stay calm and composed throughout. Then you'll be ready to address it professionally.",
          "score": 10,
          "created_utc": "2026-02-09 23:03:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4iv1lg",
              "author": "InfluenceTrue4121",
              "text": "I agree wholeheartedly. This is the best approach from a client management perspective.",
              "score": 3,
              "created_utc": "2026-02-09 23:41:37",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4kyp4s",
          "author": "dhemantech",
          "text": "I did trainings a decade back and faced the exact same problem. To all communication I just added a simple caveat- first cancellation is free, post that booking would need advance payment. Second cancel meant a 50% fee. Third cancellation onwards there would be no refunds. It impacted the bookings in that many customers feel it’s acceptable to book as long as they don’t have to pay upfront because they can always cancel. My priority was certainty for my time.",
          "score": 10,
          "created_utc": "2026-02-10 08:17:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4qb2q7",
              "author": "Glass-Ad-2731",
              "text": "This is excellent. As someone who relates to OP, thank you for this advice!",
              "score": 2,
              "created_utc": "2026-02-11 02:27:03",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4p1cvs",
          "author": "More_Law6245",
          "text": "There are two aspects to or post, firstly if the client keeps on cancelling then have them rebook immediately because their next engagement may not meet their expectations. Place the ounce and responsibility on the client, the client isn't always right nor should they have the expectation for you to bend over backwards every time to accommodate them. You're a service and not a door mat because at the end of the day it's costing you as a business not them. \n\nSecondly you have acknowledged your position in relation to your behaviour about confrontation, what are you doing to address your behaviour? In reality when running a business you need to be able to be firm with your client, negotiation is a two way street and not you just saying \"yes\" because it creates more problems than it should (this is a confidence and professional maturity thing), as you also have needs that must be met as well. By the very definition of them using your services means there is a professional relationship, hence you should also have expectations of your clients as well. \n\nI would also suggest really consider the terms and conditions of service within your contract and address your cancellation policy, being a smaller business there is no reason on why you can't push the cancellation time and the use of cancellation fees.  The key thing to remember is that you need to remain profitable in order to viable as a business. \n\nI would also suggest seeking out a small business mentor as well, there are many forums available that you could possibly leverage to help you grow professionally. Just a reflection point for your consideration. \n\nJust an armchair perspective. ",
          "score": 6,
          "created_utc": "2026-02-10 22:08:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ip9te",
          "author": "bstrauss3",
          "text": "I realize scheduling can be difficult, but I work a limited schedule and cancelations -- even though within policy -- have a large impact on me. Please work with the front desk to schedule with another therapist.\n\nThen next time(s) you see them on your schedule, you cancel them as far ahead as possible. \n\nYou are only a doormat if you let yourself be one.",
          "score": 11,
          "created_utc": "2026-02-09 23:09:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4is8cx",
              "author": "RhesusFactor",
              "text": "Lol therapist.\nSeems like your instance of Copilot/GPT you have been using for therapy has bled into your other requests to answer reddit questions.",
              "score": 4,
              "created_utc": "2026-02-09 23:26:05",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4ivfcl",
                  "author": "moochao",
                  "text": "thatsthejoke.jpg",
                  "score": 1,
                  "created_utc": "2026-02-09 23:43:45",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4oyt8g",
          "author": "Additional_Owl_6332",
          "text": "not everyone is a customer and if you can't make a profit then they aren't your customer and just walk away, \n\n",
          "score": 4,
          "created_utc": "2026-02-10 21:56:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4kliqd",
          "author": "hotheadnchickn",
          "text": "You could say you notice them cancelling a lot and ask them if there’s a different time that works better for their schedule. \n\nWhen it comes down to it, they are behaving in a way that respects your policy. If it doesn’t work, it sounds like you may need to change your policy.",
          "score": 3,
          "created_utc": "2026-02-10 06:17:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4kxd5c",
          "author": "BedRoomSenses",
          "text": "This might not directly apple but my work is client based. A lot of them are on a recurring schedule (once a week) and the soft policy is no more than 3 client cancelations in a row. After that we review together to see why there are so many cancelations. It doesn’t make sense for me to hold that spot for them and it doesn’t make sense for them to be charged for sessions they’ll just cancel.",
          "score": 4,
          "created_utc": "2026-02-10 08:05:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4kcdkk",
          "author": "Fantastic-Nerve7068",
          "text": "totally feel you on this one especially with a tight schedule and a baby in the mix the best approach i’ve found is framing it around predictability and availability not blame something like\n\n“hey i totally understand life gets busy and i appreciate the heads up when you need to reschedule that said just wanted to flag that the frequency of changes makes it harder for me to manage my availability and support all my clients effectively if it continues at this pace i might have to relook at how we schedule or whether a recurring slot still works for us”\n\nit’s kind honest and puts the impact on your side not making them feel attacked plus it gives you a boundary without sounding rigid",
          "score": 3,
          "created_utc": "2026-02-10 05:05:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4klrez",
          "author": "ZiKyooc",
          "text": "That problem should be solved by itself. Stick to your schedule and offer client alternative existing open slots. If you have room and the client is ok with late minutes available open slots then what is the issue? If the client is unhappy that the late minute change of plans leads to a few days delay, then you explain. If you are willing to make some adjustments to your schedule to accommodate, you can consider, if this interests you, to offer some late minute time slots that impact on your personal schedule with a 50% (or whatever) additional cost.",
          "score": 3,
          "created_utc": "2026-02-10 06:19:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4int9m",
          "author": "AutoModerator",
          "text": "Hey there /u/Longjumping-Wafer102, Have you looked at our \"Top 100 books post\"? Find it [here](https://www.reddit.com/r/projectmanagement/wiki/index/books).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/projectmanagement) if you have any questions or concerns.*",
          "score": 0,
          "created_utc": "2026-02-09 23:02:14",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qxrjc3",
      "title": "Unpopular opinions about IT project management",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1qxrjc3/unpopular_opinions_about_it_project_management/",
      "author": "Gandalf-and-Frodo",
      "created_utc": "2026-02-06 19:36:09",
      "score": 35,
      "num_comments": 99,
      "upvote_ratio": 0.9,
      "text": "I’d love to know your unpopular opinions about project management in IT.\n\n",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/projectmanagement/comments/1qxrjc3/unpopular_opinions_about_it_project_management/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o3yoev6",
          "author": "cbelt3",
          "text": "IT departments never include user training or documentation as a deliverable. \n\nAnd developers always assume younger eyes for a user interface. Shades of grey ? 8 point fonts ? Dammit I’m in my 60’s. I can’t see that !",
          "score": 36,
          "created_utc": "2026-02-06 20:19:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4fmv6b",
              "author": "ExtraHarmless",
              "text": "I had an issue where the branding from my Company was nearly the same Gray that Smartsheet uses for showing data flow on a sheet. Could not see that there were in and outbounds on a cell to save my life. Finally just changed everything to white. Its ugly, but at least it works.",
              "score": 2,
              "created_utc": "2026-02-09 14:03:10",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3yqb8c",
          "author": "Cheeseburger2137",
          "text": "90% of Agile Coaches and similar roles, especially influencers and high profile ones, live in an ivory tower and are detached from the reality of how most teams operate.",
          "score": 33,
          "created_utc": "2026-02-06 20:29:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3zb9pc",
              "author": "NobodysFavorite",
              "text": "They still pay people to be agile coaches?",
              "score": 1,
              "created_utc": "2026-02-06 22:14:04",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o409tg7",
          "author": "roninthe31",
          "text": "The framework and methodology doesn’t matter\nIf there’s no governance to manage the demand i.e. organizations say yes to everything then wonder why 80% of projects are Red/late/never-ending",
          "score": 32,
          "created_utc": "2026-02-07 01:31:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o42nifs",
              "author": "MiserableCry9206",
              "text": "👏👏👏👏👏👏",
              "score": 2,
              "created_utc": "2026-02-07 13:02:44",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3yz91q",
          "author": "Outrageous-Pizza-66",
          "text": "IT projects absolutely need a Solution Architect and an effective Change Manager.",
          "score": 26,
          "created_utc": "2026-02-06 21:14:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3yzydx",
              "author": "EnoughNumbersAlready",
              "text": "I’m a technical program manager and I approve this statement.",
              "score": 10,
              "created_utc": "2026-02-06 21:17:37",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o410coq",
                  "author": "partumvir",
                  "text": "I'm trapped in a server room after hours, and I approve this statement.",
                  "score": 2,
                  "created_utc": "2026-02-07 04:21:47",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o44e874",
              "author": "SVAuspicious",
              "text": "IT people don't know the difference between architecture and design. ",
              "score": 1,
              "created_utc": "2026-02-07 18:32:02",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3z2zef",
          "author": "yearsofpractice",
          "text": "Thinking of everyone’s favourite milestone - readiness for cutover of a new platform, product or service: ***No-one on the technical team will give an honest answer in terms of launch readiness unless they have to do it in formally in front of the project board/steerco***\n\nDevs, Tech Leads, IT Directors, CTOs… all of them will reassure you verbally in lower stakes meetings  that “Yeah, we’re fine to launch - everything is tested and ready and you’ll have engineers on call if you need them”. They’ll even sit passively in meetings while you - the PM - misguidedly take responsibility for confirming technical readiness to launch. \n\nIf have learned - brutally and frighteningly - that technical teams will change from “Super confident, infallible masters of the universe” to “Vague, uncertain, evasive put-upon victims” the minute things start to go wrong post-launch. If you haven’t nailed those fuckers to the wall in front of your project sponsor and made sure they say - in writing - that they approve a launch, they will - sure as shit - blame the ***cruel, unreasonable*** PM for pushing to launch something that they valiantly tried to say wasn’t ready (then weep softly into their handkerchief).  \n\nThe reason I say this is an unpopular opinion is that it undermines every basic assumption of all PM concepts - that delivery teams and the idea of the Senior Supplier own the technical solution. \n\nI’ve experienced it so many times that I will simply refuse to accept a launch unless the exec/direcor responsible for a technical product has written that they accept responsibility for the launch - and that I have their personal mobile number when their team members don’t answer their phones when the network warnings start lighting up 5 minutes post launch.",
          "score": 29,
          "created_utc": "2026-02-06 21:32:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3z3f1p",
          "author": "ethically-contrarian",
          "text": "1. Front End and Back End are never aligned.\n2. Change Management and Client Facing Team is always needed for an effective communication plan.\n3. Always add 3 months to their “go live date” it’s a difference between product management lifecycle and project management lifecycle",
          "score": 25,
          "created_utc": "2026-02-06 21:34:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o467vvk",
              "author": "OGcaptaincakey",
              "text": "Could I ask you to expand on your 3rd point please, I found your post very interesting.",
              "score": 1,
              "created_utc": "2026-02-08 00:34:14",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4911ue",
                  "author": "ethically-contrarian",
                  "text": "Yeah of course, when you add a buffer to the go-live date, it’s because the project manager needs time for all those critical last steps that product managers often do prioritize, such as full testing including debugging, user training, risk management while deploying and more. \n\nIts to ensure the project is successful in the long run. It’s a buffer for all the “extras” that go into managing a project beyond just building the product. How many of us lose the project team after the product is done and the PM is scrambling to get across the finish line.\n\nI hope this helps",
                  "score": 2,
                  "created_utc": "2026-02-08 13:42:00",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3zhuw2",
          "author": "tcumber",
          "text": "Agile methodology sucks.",
          "score": 26,
          "created_utc": "2026-02-06 22:48:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o41ct28",
              "author": "2oosra",
              "text": "Agile principles rock. Best agile principle is the one that states that rituals and methodologies suck.",
              "score": 0,
              "created_utc": "2026-02-07 05:57:00",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o41gibh",
                  "author": "tcumber",
                  "text": "Sure...principles rock in theory.  Practice sucks in a large integrated environment.  It creates silos because teams are concerned about their own deliverables without much consideration for timing of interdependencies. It also enables undisciplined clients who make unreasonable late requirementes. SAFE and other such patchwork methods to make Agile work in an integrated fashion are inadequate.  After a while, we found out that waterfall was not so bad afterall. So we use waterfall for project definition and strategic planning.  Agile for design but with waterfall-like documentation and focus on interdependent deliverables. Then agile for test and acceptance prior to deployment. After requirements are baselined, late client changes are treated like (gasp) change controls, which is a very bad term in agile circles, but only because they hate doing the necessary paperwork. \n\nAgile by itself sucks in a large integrated environment.  \n\nNot only have I lived this in a successful career of 35 years, I also have been an instructor/coach from greenbelt/blackbelt, waterfall/sdlc, and agile scrum/kanban.  \n\nI know whereof I speak.",
                  "score": 7,
                  "created_utc": "2026-02-07 06:28:47",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3zva2k",
          "author": "phobos2deimos",
          "text": "We jump straight to solving what we think the problem/need is, and spend very little time truly understanding the problem/need.",
          "score": 27,
          "created_utc": "2026-02-07 00:05:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o401r5e",
          "author": "jrawk96",
          "text": "It has been heavily suggested by many of our technical overlords that ITPM’s are going to be replaced by AI as soon as all the digital transformations wrap up, as there is no value provided that can’t be automated.  \n\nAnd I keep laughing, and laughing, and laughing.  I’m waiting.",
          "score": 28,
          "created_utc": "2026-02-07 00:42:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3yqrbm",
          "author": "SVAuspicious",
          "text": "Jira is not a PM tool. \n\nAgile is not PM. \n\nSMEs are more important than devs. \n\nQA and QC are different. \n\nYou cannot start coding and fix it later. ",
          "score": 43,
          "created_utc": "2026-02-06 20:31:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3yunu7",
              "author": "olive017",
              "text": "Jira sucks at least at my org. No way to track dates and no one is accountable",
              "score": 10,
              "created_utc": "2026-02-06 20:51:19",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3z2vdy",
                  "author": "MatchboxVader22",
                  "text": "Same. Nobody uses it what it’s made for in my org.",
                  "score": 2,
                  "created_utc": "2026-02-06 21:32:05",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o3z8ms0",
                  "author": "Flaky_Value6753",
                  "text": "That depends on what type of project you're running. Is it iterative, sprints, or buckets of work that need to be documented and reviewed with the team? If so JIRA works fine. If not, and you need granularity, dependencies, dates, timelines and a baseline? JIRA is not the option.",
                  "score": 1,
                  "created_utc": "2026-02-06 22:00:40",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o4009c9",
              "author": "jrawk96",
              "text": "SCREAM IT LOUDER",
              "score": 2,
              "created_utc": "2026-02-07 00:33:51",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o3ysdcs",
              "author": "fuuuuuckendoobs",
              "text": ">SMEs are more important than devs.\n\nA good BA out values both of them",
              "score": 6,
              "created_utc": "2026-02-06 20:39:43",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o3yw1hg",
              "author": "Mountain_Customer_83",
              "text": "Jira is a project management tool.",
              "score": 4,
              "created_utc": "2026-02-06 20:58:09",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3ywd84",
                  "author": "SVAuspicious",
                  "text": "Nope. Not even close. It's a ticket system reasonable for operations--like help desk--that can measure with SLAs. No matter what Atlassian says, it is not PM. ",
                  "score": 15,
                  "created_utc": "2026-02-06 20:59:48",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3z9sab",
          "author": "[deleted]",
          "text": "[deleted]",
          "score": 22,
          "created_utc": "2026-02-06 22:06:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3zjf1j",
              "author": "aPuppyNamedKorra",
              "text": "This.",
              "score": 2,
              "created_utc": "2026-02-06 22:57:14",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o43qgjs",
          "author": "PTP2020",
          "text": "Executives typically use 0 historical data to create realistic commitments",
          "score": 20,
          "created_utc": "2026-02-07 16:34:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ymi76",
          "author": "TheGulnar",
          "text": "IT departments massively over estimate end users Digital Literacy.",
          "score": 38,
          "created_utc": "2026-02-06 20:10:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3zmslr",
              "author": "wheelsofstars",
              "text": "100%. The number of times I've had end users express surprise that the USB-connected, non-networked low-volume printer they are receiving will require them to have and use a computer is shocking. There are grown adults in every office who seem to think that software can be accessed by thought, no user interface needed.",
              "score": 3,
              "created_utc": "2026-02-06 23:16:03",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3yr8pd",
          "author": "The1HoopHooted",
          "text": "IT and software development project management and Agile practices have an outsized degree of influence on greater PM practices and the resulting training/exposure. Schedule your next sprint to fight me about it.",
          "score": 43,
          "created_utc": "2026-02-06 20:34:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3yt6iy",
              "author": "pigeontheoneandonly",
              "text": "As someone not in IT, could not agree more.\n\nNeeds are different in environments where the projects exist in physical space, not just in a computer.",
              "score": 17,
              "created_utc": "2026-02-06 20:43:50",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o407em1",
              "author": "Maro1947",
              "text": "I'm in IT and I won't have a bar of that rubbish on my projects",
              "score": 1,
              "created_utc": "2026-02-07 01:16:22",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o41g9et",
          "author": "Sensitive_Pickle_625",
          "text": "Agile is the wrong answer in most organizations.",
          "score": 18,
          "created_utc": "2026-02-07 06:26:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o44bn87",
              "author": "SVAuspicious",
              "text": ">Agile is the wrong answer in most organizations.\n\nAgile is the wrong answer ~~in most organizations~~.\n\nFTFY.",
              "score": 2,
              "created_utc": "2026-02-07 18:19:29",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o41hazb",
              "author": "EnvironmentalRate853",
              "text": "Yes!",
              "score": 1,
              "created_utc": "2026-02-07 06:35:57",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o45z49t",
          "author": "just_robot_things",
          "text": "Agile project management methods should be kept to situations where there is software development or ongoing operational support. Everything else should utilize waterfall. \n\nIt's bonkers to me that an IT lead would demand to use Agile when they don't have a true minimum viable product (or an idea of what one would look like). You cannot possibly say that you're using agile when every single feature is a must-have. If you need everything to be available at first delivery, then use Waterfall, dammit.",
          "score": 19,
          "created_utc": "2026-02-07 23:41:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4q4a0y",
              "author": "More_Law6245",
              "text": "Just something for your consideration and a point of clarification, MVP is only applicable when using a Commercial Off The Shelf (COTS) or there is an already established applet or platform base build which is your starting point, then agile may be a feasible approach from that point. If you don't have a base build it's considered a bespoke development which doesn't start with an agile approach, what you're eluding too is actually called Prototyping which is slightly different to Agile and the outcome is to establishing the feasibility of the project deliverable.  In short it's essentially a pilot or configuration testing to validate the business case and generally conducted in a shorter timeframe than a traditional pilot and to be a crude about it, it's a simple wind find to see that it's even viable. \n\nI would also raise the notion of using only a waterfall approach to software development is considered a risk and costly hence the development of a hybrid model approach of using both waterfall and agile which has become industry's preferred approach for most software development. \n\nJust to give you context I started out delivering software projects back in the early 2000's and it was accepted practice to use a waterfall approach and by definition most projects failed because the client couldn't truly articulate what functionality was needed and how organisational data stores interacted with IT systems, in short we delivered a fully developed enterprise system that wasn't fit for purpose because it didn't have all the bells and whistles that the client needed or wanted. Hence the the fruition and development of a hybrid model approach and the wider acceptance of agile principles.\n\nI'm not singling you out, just providing a different perspective in order to challenge your current disposition as I found your perspective interesting, nothing more. \n\n",
              "score": 3,
              "created_utc": "2026-02-11 01:46:13",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3z1ljw",
          "author": "MatchboxVader22",
          "text": "All it takes is one person in leadership to make one decision out of the blue to add a random feature that makes zero sense and adds zero value to the deliverable, to completely derail your entire project plan and scope, because this one feature is torture on the developers to program.   Makes you wonder if we are actually able to manage our projects and we’re just task checker offers and nothing more.\n\nAnd then leadership gets upset when you miss dates that you originally planned for because they want a bunch of other junk added to the project.",
          "score": 13,
          "created_utc": "2026-02-06 21:25:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3zc5zd",
              "author": "localsonlynokooks",
              "text": "I had a project like this and just escaped because someone slid into my LinkedIn DMs lol. Today was my last day. Shit is roughly 3 weeks away from imploding. Sorry to everyone still there haha.",
              "score": 3,
              "created_utc": "2026-02-06 22:18:41",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o42mg4y",
          "author": "MiserableCry9206",
          "text": "It’s nothing but a ball of confusion (Temptations) lol. Anything in project management where IT is involved becomes a big blur. Too many chiefs and not enough Indians.",
          "score": 12,
          "created_utc": "2026-02-07 12:55:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o43hv8n",
              "author": "SFM851",
              "text": "Oh, there are enough Indians 😂",
              "score": 11,
              "created_utc": "2026-02-07 15:52:48",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4a8frg",
                  "author": "MiserableCry9206",
                  "text": "🤣🤣🤣🤣",
                  "score": 1,
                  "created_utc": "2026-02-08 17:29:22",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3z3jpq",
          "author": "yearsofpractice",
          "text": "Technical IT people care more about deciding “who” is right, not “what” is right.",
          "score": 26,
          "created_utc": "2026-02-06 21:35:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ysu0y",
          "author": "sausageandbeer1",
          "text": "This thread is frickin AWESOME",
          "score": 11,
          "created_utc": "2026-02-06 20:42:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3zdilb",
              "author": "PhreshPharaoh",
              "text": "Right? I’ve been an IT PM for 4 years now and I’m reading all these responses just happy I’m not crazy. Nice to see other people going through identical situations!",
              "score": 6,
              "created_utc": "2026-02-06 22:25:43",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o41rd1q",
          "author": "yearsofpractice",
          "text": "Until they’ve done the job and delivered their first project, every single new or aspiring PM is convinced that there is a tool, a system, a method out there that make project management straightforward - that all you have to do it create a plan in a lovely system with appropriate resources and then some magical tool will run the project for you. \n\nIn reality, the tools and systems only matter in the minds of management who expect the tool to magically create programme reports that will - and you’ve heard this one before - magically run the programme for them. \n\nThe harsh reality of project management is that you do the following:\n\n- Trying to forge relationships with execs so that they at least ***warn*** you before they throw you under the bus: *“Yes, CEO, the reason the project failed was that the PM did X/Y/Z - I, as sponsor, did everything right because I emailed them a one-line project brief, told them no budget and it was then their job to own the benefits and success of the project. I haven’t got time for these stupid steerco meetings that apparently I’m meant to chair. How was I meant to know anything was wrong?”* etc etc\n\n- Flattering the egos of recalcitrant techs who view themselves as the only correct person on earth and that they alone hold the keys to project success - until a service launch goes wrong when they suddenly become a put-upon confused victim who was ***forced*** to launch by the EVIL PM when they didn’t understand the systems, tech etc etc etc\n\n- Holding your position in front of perpetually-furious junior operational managers who cannot understand or accept why ***your*** project insists that ***their*** processes or systems have to change - why does the cruel PM want to change everything? They hate the new system, they hate change AND THEY HATE YOU\n\nOther than that, yeah, that new system will run everything for you.",
          "score": 9,
          "created_utc": "2026-02-07 08:09:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o42n31r",
              "author": "MiserableCry9206",
              "text": "1000% to everything you stated. I’m trying to get out of this field now. I never ever want to do this job again. It’s a straight setup for failure position and the companies know that the projects you are working on and the leaders are a bad recipe for disaster. I don’t want nothing else to do with project management. I don’t care how much it pays.",
              "score": 1,
              "created_utc": "2026-02-07 12:59:56",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4686er",
          "author": "WishfulAgenda",
          "text": "Just the term minimal viable product. Can’t stand it and makes my skin crawl every time I hear it. If I’m building something, paying someone to build something for me, I don’t want the minimum possible. I want what I asked for and am paying for. The term just sounds like consulting BS for not being able to comprehend the requirements or actually have resources competent enough to estimate and complete the project on time and budget. \n\nDon’t get me wrong, pilot projects, proof of concepts all sit well with me as they’re calling out what they are. I also understand that things go wrong, get missed and sometimes things just happen.\n\nI can’t tell you how many times I’ve sat in reviews and listened to a consulting firm talk about what the MVP is when the project is struggling, it’s what was in the requirements! It’s a greasy way of wriggling out of the commitment to a client with the general expectation of continuing to get paid. Rant over.",
          "score": 10,
          "created_utc": "2026-02-08 00:35:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4r1mb4",
              "author": "Routine_Net7933",
              "text": "I have found that MVP works better in context where senior stakeholders aren’t willing to put up enough budget to meet their requirements and a lot, if not all the work is being done by internal dev teams. When the project team defines what is going to be enough to save our arses and avoid financial penalties from regulators (for example) and you just need to get shit across the line.",
              "score": 2,
              "created_utc": "2026-02-11 05:25:07",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4etkpt",
          "author": "NoProfession8224",
          "text": "Unpopular take: a lot of IT project management problems aren’t about process at all, they’re about weak ownership. We add frameworks, ceremonies and tools to compensate for the fact that no one actually wants to make hard decisions.\n\nAnother one: most agile transformations just replace visible chaos with polite chaos. Same delays, same scope creep, just with nicer language and more meetings.",
          "score": 10,
          "created_utc": "2026-02-09 10:25:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4fp1l0",
              "author": "ToBeGreater",
              "text": ">a lot of IT project management problems aren’t about process at all, they’re about weak ownership\n\nHoly shit, this is so true",
              "score": 3,
              "created_utc": "2026-02-09 14:15:41",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4fpmcy",
                  "author": "ExtraHarmless",
                  "text": "What is crazy about the ownership issue is my current employer the business unit pays for licenses for the first year/implementation then the costs are transferred to IT. We get a millstone around our neck because someone in HR needs a $500 month per he person subscription. IT has a hard time approving a tool for half that internally.",
                  "score": 2,
                  "created_utc": "2026-02-09 14:18:59",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o4t6aus",
              "author": "musicpheliac",
              "text": "I think it's just as often that no one wants to make hard decisions, as that no one is given the power to make hard decisions. Because that authority is unclear or argued about (PM vs product mgr vs engineering mgr, and vene project A vs project B), it results in never ending discussions instead of just getting stuff done ",
              "score": 1,
              "created_utc": "2026-02-11 15:09:24",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o42efx8",
          "author": "Boom_Valvo",
          "text": " 1/2 the time you are a project manager.  The other half you are a baby sitter for a group of pre-Madonna’s.\n\nThe pre-Madonna’s are either mentally ill or mentally deficient.",
          "score": 26,
          "created_utc": "2026-02-07 11:51:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o42k6ws",
              "author": "jjb3rd",
              "text": "r/boneappletea",
              "score": 19,
              "created_utc": "2026-02-07 12:38:49",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o437q48",
              "author": "Kerial_87",
              "text": "How is that an unpopular opinion? I thought this is the consensus",
              "score": 4,
              "created_utc": "2026-02-07 15:01:32",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o42pi3m",
              "author": "LongTrailEnjoyer",
              "text": "Or incels",
              "score": 2,
              "created_utc": "2026-02-07 13:15:55",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3zigw8",
          "author": "JordanBell4President",
          "text": "An uncomfortable percentage of common dysfunction would disappear if we (IT technicians and management of any kind) remember that we exist to serve others. \n\nSo much of what we defend and protect so vehemently from “the others who just don’t understand the challenges of IT” would fall away or naturally fall into place if we let go of it and continually pulled focus to the needs and asks of others. ",
          "score": 22,
          "created_utc": "2026-02-06 22:52:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3zozn3",
          "author": "Ekkmanz",
          "text": "Agile made outsizes influences in IT delivery ceremony but very little impact on adopting its core values, while everyone almost entirely ignore eng practices that made this possible.",
          "score": 9,
          "created_utc": "2026-02-06 23:28:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o407xfq",
          "author": "Maro1947",
          "text": "The Iron Triangle gets stretched the most on IT Projects by Stakeholders who have no clue\n\nThey won't trust IT and it ends up costing them in the end because they can't admit fault",
          "score": 10,
          "created_utc": "2026-02-07 01:19:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o414c6j",
          "author": "weischris",
          "text": "Talk to your engineers. Understand their perspective and plan. Don't just ask status updates have a conversation about possible mitigation plans for possible risk. You don't have to understand what I am doing but it really helps.",
          "score": 9,
          "created_utc": "2026-02-07 04:50:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4a655x",
          "author": "Fantastic-Nerve7068",
          "text": "most “blockers” aren’t real blockers they’re just decisions people are avoiding\n\nalso way too much time is spent on updating gantt charts no one reads instead of actually talking to the dev who’s stuck\n\nand honestly not every project needs agile some teams just want to build the thing without story pointing their souls every week",
          "score": 8,
          "created_utc": "2026-02-08 17:18:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4cmsz2",
              "author": "Groganog",
              "text": "Amen to this - last role I got\nPulled up by senior leaders on a project plan that was a few days out of date.. meanwhile the delivery lead and product manager had just promised the execs a fully changed roadmap with… 0 consultation with their dev team.",
              "score": -1,
              "created_utc": "2026-02-09 00:51:52",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3z2teg",
          "author": "Living-Outside-8791",
          "text": "Delivering revenue is boss, not delivering value",
          "score": 14,
          "created_utc": "2026-02-06 21:31:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3zuogc",
              "author": "phobos2deimos",
              "text": "IMO this is a major contributor to global enshittification",
              "score": 6,
              "created_utc": "2026-02-07 00:01:40",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o3zhryl",
              "author": "Stebben84",
              "text": "Depends on what sector you are in. For nonprofits and higher ed, this is usually not the case.",
              "score": 2,
              "created_utc": "2026-02-06 22:48:19",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3zy45h",
                  "author": "BestNefariousness220",
                  "text": "Guess in there it’s more so “how can we save costs” ;)",
                  "score": 2,
                  "created_utc": "2026-02-07 00:21:29",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3z8k08",
          "author": "ExtraHarmless",
          "text": "Shipping product is more important than perfect product. \n\nThere is nothing worse than having developers test. It should always be end users. Always.(outside of regression/unit tests)",
          "score": 15,
          "created_utc": "2026-02-06 22:00:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3zuhmj",
              "author": "phobos2deimos",
              "text": "Flip side of this is that’s an excuse to ship a product that is absolute dog water (looking at you, MS)",
              "score": 7,
              "created_utc": "2026-02-07 00:00:33",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o41deye",
              "author": "2oosra",
              "text": "Flip side. Ship crap to users and have end users drown in broken crap while \"testing\" it. ",
              "score": 3,
              "created_utc": "2026-02-07 06:02:05",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3yqsrb",
          "author": "DrStarBeast",
          "text": "Developers are princesses and AI is the best thing to happen to software development. ",
          "score": 22,
          "created_utc": "2026-02-06 20:31:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3z673z",
              "author": "bleucrayons",
              "text": "And they will take up all the oxygen in the room to explain the smallest of details. \n\nDevelopers I find are long-winded and focus too much on semantics. \n\nInfra engineers you nearly need to bribe to have them be actively involved and speak up. \n\nThese are broad, generic statements of my experience having worked on both sides now. I was just surprised to see such a broad difference. All of them are easier to get to know more individually and that can really help the relationship aspect.",
              "score": 4,
              "created_utc": "2026-02-06 21:48:36",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3zcjo6",
                  "author": "DrStarBeast",
                  "text": "YES\n\n\nOnce I got out of software development and working with real engineers and tradesmen PMing became so much easier and more direct. Each one of them wanted to solve a problem the most efficient way possible. \n\n\nOnly software engineers seemed to be hell bent on over engineering and gold plating trash. ",
                  "score": 4,
                  "created_utc": "2026-02-06 22:20:41",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o41t4qm",
          "author": "yearsofpractice",
          "text": "Might just be specific to me in the corporate world of internal IT projects… but the following two things always happen post launch:\n\n- Operational support teams focus entirely on trying to link every operational issue to the new system/service: ***“A remote office hasn’t had good WIFI connectivity for five years? I know, I’ll assign 50 legacy ticket on that directly to the PM of the SaaS accountancy system feature upgrade - that will almost certainly resolve the existing WiFi issues and I will send out emails to exec naming the PM and saying it’s their issue now”***\n\n- A small number of business users of new systems will use the warranty support period as a kind of personal therapy service - Brenda in accounts will start sending heartfelt messages to confused project techs about ***”The new accountancy system isn’t working like the old one and has ruined my life, which reminds me that my own computer keyboard at home isn’t working and my boss won’t approve my PTO that I need for my friend’s sister’s pet rat and nobody cares about me. WHAT ARE YOU GOING TO DO ABOUT IT, PM?!?”***",
          "score": 9,
          "created_utc": "2026-02-07 08:26:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o41rh9b",
          "author": "jbigspin421",
          "text": "After reading many of these posts on IT Project Management and scrum masters, I see why My organization pays me very well to stay and perform at a high level, and why I get 4 to 5 calls a day from recruiters and HR's from so many companies. Many of you work for horrible organizations who have no clue how Agile really works and letting developers tank your production to manipulate, to let them take all the time they want to produce, with no deadlines or consequences.",
          "score": 13,
          "created_utc": "2026-02-07 08:10:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4322rl",
          "author": "surrealcrow",
          "text": "Project manager is someone Who schedule calls and keeps a fancy todo list",
          "score": 18,
          "created_utc": "2026-02-07 14:30:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4dez8f",
          "author": "KC-throwaway12345",
          "text": "Most of the time agile just means they don’t want to write business requirements",
          "score": 4,
          "created_utc": "2026-02-09 03:24:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4c7kfg",
          "author": "rayfrankenstein",
          "text": "The fastest way to turn around a flagging organization is to fire anyone in it who’s ever used the word “value” as a direct object noun “add value”, “deliver value”, “value add”, “provided value to tge user”, etc.",
          "score": 2,
          "created_utc": "2026-02-08 23:24:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4t6nv9",
              "author": "musicpheliac",
              "text": "So, serious question, how do you then talk about prioritization? How do you confirm ROI, or make a business case, if not showing how you provided value to your company/client? ",
              "score": 2,
              "created_utc": "2026-02-11 15:11:14",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4fk523",
          "author": "computer_ninja",
          "text": "Developers shouldn't work with product managers, they should be \"business aware\" else they will be filling in a spec to prove something is done instead of actually figuring out what's supposed to be done, and product are inventing random shit to justify their existence... they probably should handle communication with clients or users and only be a link to developers to convince the to build something",
          "score": 2,
          "created_utc": "2026-02-09 13:47:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o40vvna",
          "author": "Avarockstar44",
          "text": "IT Project Management is an oxymoron.",
          "score": 4,
          "created_utc": "2026-02-07 03:50:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o442flr",
          "author": "kewlness",
          "text": "Project management is a fancy title given to secretaries or administrative assistants to track ideas/initiatives/projects.",
          "score": -14,
          "created_utc": "2026-02-07 17:34:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4cmjzv",
              "author": "Groganog",
              "text": "Let me guess, you’re a dev who is an undiscovered genius but struggles to communicate and all we IT PMs do, when trying to get you to communicate with the people who indirectly pay your salary, is.. slow you down?",
              "score": 2,
              "created_utc": "2026-02-09 00:50:32",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4ifaup",
                  "author": "kewlness",
                  "text": "Incorrect. The thread is unpopular opinions about IT project management - I am a project manager and I was directly told this by a superior. Thankfully, I have moved on and am in a much happier spot.\n\nBut thanks for playing!",
                  "score": 0,
                  "created_utc": "2026-02-09 22:18:19",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1r1f1b2",
      "title": "Anyone using project management software that shows real burn vs budget?",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1r1f1b2/anyone_using_project_management_software_that/",
      "author": "Papito24",
      "created_utc": "2026-02-10 22:15:30",
      "score": 32,
      "num_comments": 14,
      "upvote_ratio": 0.71,
      "text": "PM at a professional services firm and this keeps bugging me. Schedules look green, clients are happy, but finance is constantly flagging billing issues after the fact. Right now delivery tools and billing live in totally different worlds, so PMs don’t really see burn vs budget in real time. What do other PMs use to get visibility into project financials without living in spreadsheets??",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/projectmanagement/comments/1r1f1b2/anyone_using_project_management_software_that/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o4p2ueb",
          "author": "AutoModerator",
          "text": "Attention everyone, just because this is a post about software or tools, does not mean that you can violate the sub's 'no self-promotion, no advertising, or no soliciting' rule.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/projectmanagement) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-10 22:15:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4p6j9a",
          "author": "cbelt3",
          "text": "It’s all about how you do project accounting. That’s what you need to interface. PM software won’t magically fix that for you, you have to find an integration point.",
          "score": 8,
          "created_utc": "2026-02-10 22:34:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4pp85c",
          "author": "oscarnyc1",
          "text": "Take a look at Motionode. It tracks cost, sow, and updates dates automatically. It also shows weekly capacity versus tasks requirements.",
          "score": 7,
          "created_utc": "2026-02-11 00:17:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4pb5hy",
          "author": "NewZealandTemp",
          "text": "Based on what I’ve seen discussed here and in PM-focused reviews, BigTime is often mentioned when people look for tools that surface burn rate and budget alignment during delivery, not just at invoicing. It’s usually framed as helpful for PMs who want financial signals alongside timelines, especially in services environments.",
          "score": 5,
          "created_utc": "2026-02-10 22:58:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4sb0im",
          "author": "SVAuspicious",
          "text": "You use \"burn\" differently than I do. \n\nFor good information you have to collect good labor and expense information. Weekly timesheets is good periodicity synchronized with status input. \n\nActual costs come from accounting into PM through an API and show up as actual costs (AC). The baseline in PM and status show earned value (EV). The baseline shows planned value (PV). I report this as CPI and SPI with LOE tasks excluded. \n\nOn contracts with progress payments instead of periodic (usually monthly) billing I get and include two other artifacts. First is AC v. billing as a line graph. If the customer is slow pay we add a \"paid\" line. I get reports from accounting of outstanding invoices (ours to customers and vendors to us). Second is a report of incomplete tasks to the next two progress payments. \n\nThe data flows from accounting to one of my BAs who generates reporting to me and for outgoing reporting. Everyone gets the same information. No tailored reporting. The BA has spreadsheet templates formatted to look like the ones from the PM tool to avoid confusion. Accounting provides data as .xlsx files. It's all very automated so work is in analysis, not generation. We also get an allocated cost from finance for interest charges for running costs (labor and expenses) from our corporate line of credit that shows up as a charge in our data from accounting through the API. If we see something big (big materials usually) on the horizon we generate an exception report as a heads up to finance. \n\nPM tools I've had this work with include MS Project, Scitor Project Scheduler (RIP), and Primavera. The new generation of PM \"tools\" are deficient. I have yet to encounter an accounting tool (or HRIS for that matter) without good API support. \n\nMS Project doesn't scale well when project size gets exponential, say 10 x 10^(7) USD. \\*grin\\* \n\nIn my experience, building systems to avoid duplicate data entry and for the long term is worth marginal cost in capex to minimize opex. Remember - all this stuff (except my BA) is overhead. \n\nDave's rant #374: Software can't do your job for you. You have to know what you're doing. \n\nPM, SE, accounting, finance, HR, IT, and legal form a team. We meet as needed (no periodic meetings - as needed) when anyone sees a bump in the road. We have an email distribution list as most bumps can be avoided through communication. If accounting software is getting an upgrade we all know. If some SaaS contract (ugh) is being renewed we all know. If HR is responding to new reporting requirements that change data formats we all know. If IT is doing a desktop refresh or changing cell phone plans we all know. ",
          "score": 4,
          "created_utc": "2026-02-11 12:07:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4p4yqf",
          "author": "RemotePersimmon678",
          "text": "Harvest does this",
          "score": 2,
          "created_utc": "2026-02-10 22:26:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4rwcxg",
          "author": "ConstructionPM_Pro",
          "text": "The disconnect between delivery tools and billing is the eternal PM struggle. You don't necessarily need fancy software — the key is having a consistent workflow for tracking hours/costs as work happens, not after the fact. I've found that simple templates (weekly burn reports, project cost trackers) that feed into a single dashboard solve 80% of this. The problem is usually process, not tools. Get your team logging costs consistently first, then pick software that fits your workflow — not the other way around.",
          "score": 2,
          "created_utc": "2026-02-11 10:02:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4qd6nr",
          "author": "DeliciousBuilder0489",
          "text": "Check out RocketLane. We just switched and it should suffice your use case.",
          "score": 1,
          "created_utc": "2026-02-11 02:39:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4rcxrx",
          "author": "HastaLaVistaDonkey",
          "text": "Klient.com",
          "score": 1,
          "created_utc": "2026-02-11 07:00:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4rji9g",
          "author": "Low-Illustrator-7844",
          "text": "Does the software you use to raise invoices not give you that option?",
          "score": 1,
          "created_utc": "2026-02-11 08:00:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4rofex",
          "author": "Murky_Cow_2555",
          "text": "What’s helped in my experience is tying time tracking directly to tasks and having budget fields at the project level that roll up automatically. So instead of hours logged somewhere else, you see planned vs actual hours and cost variance right on the project dashboard. That alone changes behavior because PMs stop managing just scope and start managing burn in real time.\n\nWe’ve used Teamhood in one setup where budget and estimation fields were locked at the workspace level and time rolled up to the project, so PMs could see burn vs estimate without exporting to Excel every week. ",
          "score": 1,
          "created_utc": "2026-02-11 08:48:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4rogwo",
          "author": "Present_Nerve7871",
          "text": "Most of the accounts posting in here are AI, just fyi.",
          "score": 1,
          "created_utc": "2026-02-11 08:48:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4rzr3d",
          "author": "arina_katz",
          "text": "We use actitime to see the project budget burn, you can track the budget by client, project and even task, very convenient ",
          "score": 1,
          "created_utc": "2026-02-11 10:33:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4su3c6",
          "author": "pmpdaddyio",
          "text": "This should be stock in most tools assuming you configure it properly. I always recommend you work with finance, and work on your integration method. Most organizations know how to break down the budget into various categories, this goes in your budget line, then you integrate data from your finance group and these go into your actuals.\n\nIn MS Project, SmartSheet, Jira, and many of the Gartner upper right tools, you have this built in, you may need to slightly adjust your reporting, but this isn't complicated.",
          "score": 1,
          "created_utc": "2026-02-11 14:05:16",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r0h4pe",
      "title": "If I’ve flagged something everyday for 3 months. Is this a leadership issue?",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1r0h4pe/if_ive_flagged_something_everyday_for_3_months_is/",
      "author": "the-anonymous-ghost",
      "created_utc": "2026-02-09 21:27:00",
      "score": 25,
      "num_comments": 13,
      "upvote_ratio": 0.91,
      "text": "Basically this, If we are delayed and I’ve continuously flagged something everyday day for 3 months as it relates to our Tech projects. I’ve reached out to management almost every week about it. I’ve reached out to the specific person that hasn’t been doing their job.\n\nI’ve went on calls. I’ve tried to make things easier to transfer data. Made various docs. And to no avail we are 1 day before we make updates to which we will have to push.\n\nAm I to blame or does our company need to work on situations like this. If we don’t update it’s not my fault and its not on me to know specialized info that my peer knows and evaluates for.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/projectmanagement/comments/1r0h4pe/if_ive_flagged_something_everyday_for_3_months_is/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o4iaa12",
          "author": "pmpdaddyio",
          "text": "You've over documented the issue. Let the individual fail, and subsequently the project if that is an outcome. You are covered by your notifications and documentation. Hopefully you logged this as a risk, then an issue with the assignments.",
          "score": 21,
          "created_utc": "2026-02-09 21:52:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ib2e4",
              "author": "InfluenceTrue4121",
              "text": "Spot on. It’s so easy to ignore endless emails but way more tricky to ignore a big, fat risk with your name all over it.",
              "score": 9,
              "created_utc": "2026-02-09 21:56:44",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4i69ej",
          "author": "wittgensteins-boat",
          "text": "Leadership does not care to act. \n\n\nFor apparently undisclosed and undiscussed, and undiscussible  reasons.  \n\n\nYou have made your report.  \n\n\nIf the blame game is played, you have the documentation trail and notified warning about  failure to act indicated.  \n\n\nIs there a report about consequences to failing to act?  What also will occur, at what cost, and project completion time period delay, and follow-on target deadlines, and reputational loss, for failure to comply with the plan?\n\n\nYou could, if you so desire, discuss in person with senior people to understand why there is no intent to act.  Start with Senior people nearest to you on the project  organization chart.\n\n\nUnclear if your job is at risk for raising undiscussible plans for failure according to the current plan.",
          "score": 11,
          "created_utc": "2026-02-09 21:32:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4j40na",
          "author": "More_Law6245",
          "text": "Throwing your hands up and saying \"it's not my fault\" is not a professional look you want, especially when you're left holding the bag (rightly or wrongly). It's why you have your project controls for your issues and risk log and it actually assists you in matters like this. You should be formally presenting these issues and risks to your project board/sponsor/executive and clearly articulate with a problem statement and the impact. In addition you should have ready a proposed plan or mitigation strategy to support the problem statement. Then you need to articulate what you're expecting from the relevant stakeholders (e.g. a decision on course of action or additional time, cost or scope etc.) and highlighted the impact if they fail to support you. This is about your maturity as a project practitioner, this is actually your responsibility being the PM to the project, this is also about you understanding roles and responsibilities within a project structure.  \n\nIF and only if your project board/sponsor/executive fails to address any of your issues or perceived risks then it becomes their problem under roles and responsibilities because you have covered your professional standing with documented evidence that can't be disputed and if any issue or risks that come to fruition that is at the organisation's peril. As the PM you can only highlight the risk and issues, you have formally asked for assistance and guidance through the project controls and if the appropriate stakeholders fail to act it's on them and not you. \n\nYour statement of \"you tried\" but the reality is that you haven't formally enacted your project controls and the associated reporting mechanisms, do you have written problem statement (issue, risk or white paper etc.)? Do you have a proposed course of action? Do you have a responsible person (s) or team who understands that they own the issue or risk? Do you have an agreed due date or a mitigation strategy initiation date? These are all the things you get when you formally escalate through your project controls, speaking up in forums and making various documents doesn't constitute to holding people to account! \n\nJust an armchair perspective. ",
          "score": 19,
          "created_utc": "2026-02-10 00:31:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4lyifd",
              "author": "maninkka4",
              "text": "This helps,  thank you. I am no PM but actually trying to do the work of one in a subjectively rather informal setting, but this is sth I should do anyway - going to \"proper channels\" even though no one would blame me for the outcome.. I want it to succeed. \n\n\nArmchair perspective eh? Seems like you know what you are taking about to me :)",
              "score": 3,
              "created_utc": "2026-02-10 13:17:58",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4ocga5",
                  "author": "More_Law6245",
                  "text": "You have a great professional attitude and maybe you should actually consider formalise your standing as an accredited PM, it's definitely a very portable skillset and makes you a little more attractive to a potential employer.  Just as a reflection point, being in your situation it does become really important to understand roles and responsibilities (particularly the latter) when you're not formally assigned as a \"project manager\" because what you're actually doing is being \"trusted to take on responsibilities\" but not having a professional standing or acknowledgment of your role, it does leave you a little exposed (good and bad).  Just something for you to consider.  \n\n  \nhuh, me know what I'm talking about .... I'm pretty sure I read this stuff on the back of a toilet stall door somewhere ;)\n\n\n\n ",
                  "score": 2,
                  "created_utc": "2026-02-10 20:12:11",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o4kz734",
              "author": "Chicken_Savings",
              "text": "I think you are spot on.\n\nSometimes as PM, we can see that it's going to crash, and with our subject matter understanding / expertise, we try to work with the team member to fix it, and we keep telling our leadership informally that it's a risk that's building towards a crash. May even write that in emails.\n\nBut we may be so focused on trying to do something that we fail to execute the formal project controls.\n\nIt shouldn't be told to management every day. It should formally be escalated to project sponsor and / or steerco, with formal project status report, risk description, suggestions for actions, request for a decision.\n\nI have once failed myself by doing exactly this - telling management several times a week, trying to help fixing it myself, watching the train drive towards the crash... and crash. That was a major lesson learned for me, and I now activate the formal controls instead of endless informal emails and calls.",
              "score": 2,
              "created_utc": "2026-02-10 08:22:46",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4o9tpo",
                  "author": "More_Law6245",
                  "text": "A good PM only needs to experience this type of situation once, I'm also a member of this club and we even have T-shirts too.  To be honest it was one of my more harsh lessons when I was first starting out, the concept of roles and responsibilities hadn't really sunk in and I was trying to \"fix everything\" and taking on other's responsibilities. ",
                  "score": 2,
                  "created_utc": "2026-02-10 19:59:51",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4ihswh",
          "author": "DrStarBeast",
          "text": "You've done everything you're able to do. Keep your CYA paper trail close and if anyone tries to pin this on you, point to the issues that you raised and kept going on as the reason it failed. \n\n\nDo not apologize or accept blame for this. Be ready to step up when someone tries to blame it on you. ",
          "score": 8,
          "created_utc": "2026-02-09 22:31:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4kcmkg",
          "author": "Fantastic-Nerve7068",
          "text": "not your fault at all you did the right thing by flagging the risk early and consistently if leadership didn’t act on it for three months that’s not a comms issue that’s a prioritization and accountability issue on their side at some point it’s not about how loud or often you raise the flag it’s about whether the system is set up to respond and clearly it’s not this is absolutely a leadership gap not a delivery one",
          "score": 8,
          "created_utc": "2026-02-10 05:07:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4i8d1k",
          "author": "DesertMountainLvn",
          "text": "Do you have leadership within PMO that is positioned to raise the risk to execute leadership? That would be my move. If executive leadership is aware and has not engaged, then you've done all you can. Wash your hands and move on. \n\nWhen I worked in a position where there was not a PMO and I needed a VP to encourage work I was unable to influence, I reached out to the project sponsor and encouraged them to engage their VP. That VP called the VP for the party responsible for the work (happened to also be my VP) and explained the risk (loss in the millions for the org). Blocker was removed immediately. It was much more effective than if I were to have made the call myself.",
          "score": 5,
          "created_utc": "2026-02-09 21:43:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4inkd8",
          "author": "Longjumping-Wafer102",
          "text": "you already do all your best",
          "score": 5,
          "created_utc": "2026-02-09 23:00:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ikplp",
          "author": "Stebben84",
          "text": "If it was a risk, was a mitigation plan put in place. If so, how will that be executed. If that did not work, it becomes an issue to log and document how that will addressed. That all you can do. This is your work and hence not your fault. If it fails it fails. Success relies on the team and not solely on the PM.",
          "score": 1,
          "created_utc": "2026-02-09 22:46:05",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qx237f",
      "title": "Project deadline tracking fails when stakeholders only use Slack",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1qx237f/project_deadline_tracking_fails_when_stakeholders/",
      "author": "hereccaaa",
      "created_utc": "2026-02-06 00:02:12",
      "score": 22,
      "num_comments": 19,
      "upvote_ratio": 0.96,
      "text": "PM at a tech company and half our stakeholders refuse to use Jira. They'll discuss requirements in Slack, make decisions in Slack, change scope in Slack, but won't touch Jira because \"it's too complicated\" or \"I don't have time to learn another tool.\"\n\n\n\nSo we end up with this split brain situation. Engineering uses Jira religiously, business side lives in Slack, and I'm stuck being the bridge between them. Someone asks in Slack \"when is feature X launching\" and I have to go check Jira, then come back to Slack and explain. Stakeholder changes priority in a Slack thread and I have to manually update Jira or the dev team works on the wrong thing.\n\n\n\nThe deadline tracking is especially bad. Stakeholder says \"we need this by end of month\" in a casual Slack message and I'm supposed to somehow make sure that commitment is tracked, communicated to eng, and actually happens. Miss one message and we're off by weeks.\n\n\n\nCan't force stakeholders to use Jira, can't force eng to live in Slack. Genuinely don't know how to solve this besides working twice as hard to keep everything in sync.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/projectmanagement/comments/1qx237f/project_deadline_tracking_fails_when_stakeholders/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o3t9v21",
          "author": "AutoModerator",
          "text": "Attention everyone, just because this is a post about software or tools, does not mean that you can violate the sub's 'no self-promotion, no advertising, or no soliciting' rule.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/projectmanagement) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-06 00:02:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3xhlim",
          "author": "[deleted]",
          "text": "The problem isn't that stakeholders won't use Jira, it's that you're using a tool built for engineering workflows to track business decisions.\n\nJira is great for eng because they *need* that complexity (sprints, story points, dependencies). Your business stakeholders don't. They just need to see: what's happening now, what's next, who owns what.\n\nInstead of forcing them into Jira or you playing translator, you need something dead simple that sits above it. Business side sees the high-level view in something they'll actually open. Engineering keeps using Jira for the detailed work. You update both but the stakeholder-facing layer is lightweight enough they don't ignore it.\n\nThe \"casual Slack deadline\" problem goes away when there's one obvious place to check status. Right now there isn't - it's either Jira (too complex) or Slack (too scattered).\n\nYou're not going to fix this by working harder. You need a different layer for stakeholder visibility that doesn't require them to learn project management concepts.\n\nWhat would happen if you just made a simple shared doc showing Today/This Week/Later for each major initiative? Would stakeholders actually look at it?",
          "score": 14,
          "created_utc": "2026-02-06 16:53:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3tcg10",
          "author": "BlueHg",
          "text": "Stakeholder management is one of the bread and butter PM skills. It is literally our job to be fluent and translate between engineering, leadership, and customer. Your stakeholders generally shouldn't need to live in Jira--it's primarily an engineering tool.\n\nThe specific problem of changes happening via Slack message is a process problem, not a tool problem. Does your contract institute any change management controls? You're supposed to define scope with stakeholders at the beginning of an effort, initiative, etc., get stakeholder buy in on the scope of work, then put them through ECPs if they want to formalize a change in scope or timeline. \n\nIt sounds like you've made it too easy for stakeholders to run over you. Make a biweekly priorities meeting or create a form to request change in scope/priority/timeline. Say it's so that you can better manage changes, because tracking via Slack isn't good enough, but it's also to increase the barrier for entry for a scope change. If you make it easy for them to change scope, they'll think it's easy to execute a change in scope. You need to formalize the change process so it's not conducted via informal message.",
          "score": 13,
          "created_utc": "2026-02-06 00:16:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3x67s5",
          "author": "Subtonic",
          "text": "For executives, this is part of why you’re on the payroll. They’re not going to do it. They’ll never learn your tool. To them, this is why they have PMs.",
          "score": 13,
          "created_utc": "2026-02-06 16:00:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3v1hj1",
          "author": "LessonStudio",
          "text": "I was told long ago as I became a project leader, \"You have two jobs: Manage client expectations, protect your people from the executive.\"\n\nThis post sounds like both are failing as it clearly comes from an extremely frustrated micromanager who wishes people would obey their thoughts.\n\n\nBTW Jira is a management tool, not a leadership tool. Management is for processes like assembly lines. Leadership is something entirely different.\n\nTo solve this, look for a vision which leads people to use the best tools. Going all gantt horny and \"Herding Cats\" is only asking for endless frustration and failure; for everyone.\n\nYour goal is to get everyone wanting the same clear thing. The executive, the clients, the executive. This way, all conversations can be filtered through this vision. They can ask for changes, etc, and you can say, \"Great idea. I am going to put that into Phase II\"\n\nWhen they asked for it to be in Phase I, I would ask what in Phase I should be moved to Phase II? When they would say, \"Can't you do it all in Phase I? I would ask how much we can now delay Phase I, but their brilliant idea would work very well in Phase II.\n\nThe key is to manage their expectation as to what is going to be done in Phase I.\n\nThen, when Phase II was being planned, they usually had forgotten their stupid idea; or the other people would disagree that it should be done at all. This way, you also avoided a pile of stupid meetings discussing stupid ideas.\n\nThe key here was the project was a creative process and thus leadership is the only way to run this. But, clients are more like a factory. They require a process, and that is something you manage.\n\nThere is no reason for clients to be in Jira outside of reporting bugs. They should have their expectations managed by regular reporting of the progress through reports. If they are pumping new features or alterations through slack on an endless basis, the math will kill you. Any collection of dumbasses given this sort of method for adding or changing features will be able to make demands which far exceed your speed of delivering. \"Hey could you port it to Apple?\" \"Oh, wait, we would like it on my Apple watch as well\". This means that they have not bought into a clear vision of what is going to be built, or when, or how constrained the resources are to do this.\n\nA proper iterative development methodology will definitely have feedback, but controlled by a good leader to more be a refinement of the vision, vs a bunch of micro directives.",
          "score": 7,
          "created_utc": "2026-02-06 07:00:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3tbob5",
          "author": "daneato",
          "text": "I haven’t used Jira enough to know, but can you link to a specific thing? \n\nSo, if they ask “when is feature X launching” you can respond with a link to the feature launch date in Jira? (The hope being by adding friction to the response they’ll eventually learn to bypass the friction and go straight to the Jira to begin with. )",
          "score": 5,
          "created_utc": "2026-02-06 00:12:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3uyyhh",
          "author": "More_Law6245",
          "text": "As a project practitioner this comes down to roles and responsibilities of your stakeholders and you. You as the PM need to set clear expectations of what is required and expected and if you can't get the outputs you need then you have to flag and escalate to your project board/sponsor/executive because not only do you have a IT system and data stores issue (e.g. not fit for purpose) you also have an organisational culture issues compounding the situation.  I also feel that you're being taken advantage and rough ridden with stakeholder non compliance, that is something that needs to be escalated. \n\nTask progress and tracking is your responsibility as the PM and you need to make a single system work, you need to work the stakeholders, their team leads and executive to reach a suitable and attainable outcome.  As an extreme example (and yes it did actually happen) I once had a Dev team who was extremely non compliant (apparently the company revolved around them), After basically refusing to comply with the project reporting requirements I had a project status meeting and clearly outlined how their behaviour impact me to deliver the project but how it raises the organisation's risk profile and then I reiterated my position on expectations and requirements. I also highlighted their behaviour as being unprofessional and outside project and organisational governance models, so repeated non behaviour can and will require HR involvement. \n\nAfter further non compliance I started having ad-hoc and inconvenient mandatory meetings e.g 08:00am, 12:00pm or 5:00pm. Did all hell break loose? Yes and the management team were standing behind me on this one. Did I make friends? No. Did I get what I needed? Yes. Did they comply in the future? Yes.  As a PM you will learn as you become more seasoned is that you can't be everything to everyone, because you need something from them in order to deliver. your project on time, on budget and fit for purpose,  ultimately you need to hold these people accountable. If they're required to use a system or systems (s) to track efforts then that is what is required, and I will ask you this, why do you get to carry the can when it fails and your stakeholders are not doing what is expected or required of them? Just a reflection point for your consideration \n\nJust an armchair perspective. ",
          "score": 5,
          "created_utc": "2026-02-06 06:38:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3vn1kp",
          "author": "causticalchemy",
          "text": "We use Teams, Slack, and Jira where I work. It's been made explicitly clear we are to check Teams and Slack, both are to be used (Teams typically for meetings and externals) and this message comes from the top down. \n\nHave you got Jira and Slack linked up? I'm not sure of the potential but being able to raise tickets and have automation for updates might take some of the strain off. You can make bots for different things too.",
          "score": 5,
          "created_utc": "2026-02-06 10:22:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3wp4p1",
          "author": "Eylas",
          "text": "You need a change management process.\n\nIf the client stakeholders are changing requirements vs the original scope,  this should not be done in anything resembling a chat message. It needs to be captured as part of whatever process exists to manage contractual change.\n\nThis change, if accepted, then propagates into whatever task process or tool (JIRA in this case) you're using to execute. Otherwise, you're just doing untrackable work that deviates from original scope with no checks or balances.\n\nThe stakeholders will take it more seriously when you refer to a change of scope being a contractual element and requiring the proper change process - unless of course your contract states that change management happens inside of slack, in which case, oof.",
          "score": 5,
          "created_utc": "2026-02-06 14:36:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3tjfa6",
          "author": "Justin_3486",
          "text": "We started using chaser in Slack which basically bridges this gap. Stakeholders can stay in Slack, tasks sync with what needs to happen, and you get proper deadline tracking without forcing everyone into Jira.",
          "score": 4,
          "created_utc": "2026-02-06 00:57:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3utuxw",
          "author": "Cheeseburger2137",
          "text": " I mean… why you are describing is literally the Project Manager job description.",
          "score": 3,
          "created_utc": "2026-02-06 05:56:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o465e4q",
          "author": "karlitooo",
          "text": "Usually companies will have a role where a person knowledgeable about both the business and team context will use their judgment to determine how to respond to incoming changes or requests for information. \n\nWhoever is doing that job should be able to assist you.",
          "score": 1,
          "created_utc": "2026-02-08 00:19:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4692l8",
              "author": "karlitooo",
              "text": "This is kind of a frequent topic here:\nhttps://www.reddit.com/r/projectmanagement/comments/1q7b54x/deadline_tracking_in_slack_is_a_nightmare_with/\n\nI suspect a lot of Slack based teams don’t have a documented project lifecycle. If a stakeholder is asking for dates, I’m guessing there isn’t a frequently circulated schedule and PSR.  I’m guessing there isn’t a project homepage, or weekly status meeting.\n\nIf changes are coming too fast, I’m guessing there isn’t a CR process.\n\nAs a new PM on a slack/Jira team it would be easy think the job is answering messages all day. That is so much less valuable than enforcing a stable delivery process. ",
              "score": 1,
              "created_utc": "2026-02-08 00:41:13",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4a6i6t",
          "author": "Fantastic-Nerve7068",
          "text": "been there and yeah it’s brutal acting as the human sync engine between slack chaos and structured tools\n\ni started using celoxis for this exact mess because it actually lets you set up forms and intake workflows that non-technical folks can use without touching the full platform\n\nso now when someone in slack casually drops “need X by next friday” i just drop them the intake link and boom it’s in the system with due date ownership and visibility\n\nit’s not perfect but it seriously cut down on stuff falling through the cracks and saved me from being the jira whisperer for every team decision",
          "score": 1,
          "created_utc": "2026-02-08 17:20:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4oemhb",
          "author": "Economy_Pin_9254",
          "text": "Yeah — this isn’t a tooling problem (no project problem ever is a tool problem), it’s a **decision capture problem**.\n\n**Slack isn’t killing your deadlines.** ***Unrecorded decisions are.***\n\nWhat’s actually happening is this: Slack feels fast and informal, so stakeholders treat it like conversation. But inside those “casual” messages are scope changes, priority calls, and delivery commitments — and none of them have ownership unless you trap them somewhere more durable.\n\nYou’re not stuck because Jira is bad or Slack is bad. You’re stuck because **decisions are being made in a place that has no memory**.\n\nA few hard truths that usually help reframe it:\n\n* You don’t need stakeholders to *use* Jira.\n* You need stakeholders to accept that **Slack is not the system of record**.\n* And you need a clear rule for when Slack talk becomes a commitment.\n\nIn practice, what works isn’t forcing behaviour — it’s **changing the boundary**.\n\nSomething like:\n\n* Slack = discussion, questions, exploration\n* Jira (or whatever) = decisions, scope, dates\n\nWhen someone says “we need this by end of month” in Slack, that isn’t a deadline yet. It becomes one only when *you* restate it and park it somewhere explicit:\n\n>\n\nThat small pause matters. It turns casual pressure into a visible trade-off.\n\nThe other shift is stopping the silent syncing. Every time you quietly translate Slack into Jira, you’re absorbing risk for the system. Instead, make the translation visible:\n\n>\n\nPeople learn fast when they see consequences attached.\n\nYou’re not failing because you can’t keep tools aligned. You’re feeling crushed because you’re acting as human middleware for unresolved decisions.\n\nThe fix isn’t working twice as hard. It’s making it clear that **if it isn’t captured, it isn’t real** — no matter how loud it was in Slack.",
          "score": 1,
          "created_utc": "2026-02-10 20:22:13",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r06sqy",
      "title": "Selling team members on the benefits of a project plan",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1r06sqy/selling_team_members_on_the_benefits_of_a_project/",
      "author": "BreakNo7825",
      "created_utc": "2026-02-09 15:14:42",
      "score": 19,
      "num_comments": 25,
      "upvote_ratio": 1.0,
      "text": "Looking for any lessons learned or recommendations on getting team members on board with the idea of developing project management plans for our projects.\n\nI work for an organization that has historically performed very little planning prior to jumping into execution and the project managers have typically held a more reactive approach to issues in the projects. I’ve sold the idea of implementing formal PMPs with functional managers but at the end of the day, it’s the project team members, invluding our PMs, who need to adopt the idea wholeheartedly for it to be useful and successful. Has anyone else led such an adoption?\n\nIndustry is custom equipment design and manufacturing and lends itself to a waterfall approach. ",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/projectmanagement/comments/1r06sqy/selling_team_members_on_the_benefits_of_a_project/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o4gu07t",
          "author": "AldronProjectLab",
          "text": "I've been there. The key point is this: no one is convinced by a \"well-done PMP,\" but only by the pain it avoids. You have to create value.\n\nIn environments accustomed to starting immediately, the plan is perceived as unnecessary bureaucracy until you explicitly connect it to real problems already experienced: rework, late changes, stalled suppliers, decisions made too late, unclear responsibilities. The plan must serve to protect the team.\nIt works much better to start light: a few clear elements (scope, milestones, dependencies, obvious risks), built together with the team and not \"delivered.\" If the plan is conceived as something that helps us work better tomorrow, it is used and can evolve. If it is conceived as a document \"to keep things in order,\" it is circumvented.\n\nLast thing: don't call it a \"PMP.\" Call it a way of working, an initial agreement, a project map. Change the name, change the perception 😉",
          "score": 10,
          "created_utc": "2026-02-09 17:38:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4g1ph4",
          "author": "DrStarBeast",
          "text": "It's easy when you don't try and force the entire PMI tool kit down a small company's throat. \n\n\nInstead, sell a \"right sized \" process that adds necessary checks and balances while maintaining the agility your company expects.\n\n\n Only you know what this is from the issues you faced previously ",
          "score": 7,
          "created_utc": "2026-02-09 15:23:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4g4o7t",
              "author": "BreakNo7825",
              "text": "That is a valid point and I completely agree. I’m definitely encouraging our group to scale it to the size and importance of the project.",
              "score": 3,
              "created_utc": "2026-02-09 15:38:12",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4g670y",
          "author": "cbelt3",
          "text": "Someone IS doing project planning. They just call it production planning. Unfortunately you need to get senior management to own it.\n\nHaving been on that space, I will advise this:\n\nDo NOT use the whole model for every project. Multi year large projects need more control. Short one month projects … you can manage with a checklist. \n\nToo many people insist on applying the whole toolset to all projects. That’s not what PM Is about. It’s not a bureaucratic control system. It’s a framework that is sized to fit what word right.\n\nI once got called into a division to recommend a PM approach for their projects. I listened. Went to an office supply store. Came back with a package of index cards and a card box. Because that’s all they needed.",
          "score": 5,
          "created_utc": "2026-02-09 15:45:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4hx9v5",
          "author": "More_Law6245",
          "text": "This is not a \"team issue\" this is an organisational culture issue and realistically needs to be support from the executive down with the relevant support from change champions and agents. Most people don't see the relevance with corporate governance and generally perceive it to be an overhead in their daily working lives but the simple matter of the fact is that it's a cost effective measure, it helps delivery quality and ensure the company remains profitable and keeping these very people who are change resistant employed but most of all it assists with organisational reputation which even some PM's don't actually realise the importance of when delivering a project.  When you have a project that runs over time, budget or is not delivered cleanly, that is the impression your client gets and that is the image that is being projected by the organisation, unplanned projects is a bad image for the organisation, planning projects shows a professional organisation.  The key thing to remember your organisation is only as good as its last project!\n\nJust an armchair perspective.",
          "score": 5,
          "created_utc": "2026-02-09 20:48:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4kcqk7",
          "author": "Fantastic-Nerve7068",
          "text": "it’s tough shifting a reactive culture into one that values upfront planning especially when people see plans as “extra work” or “slowing things down” the thing that helped most was framing the plan not as a doc but as a painkiller literally say something like look this is how we stop chasing our tails in month three or how we avoid those last-minute redesigns that wreck our margins when people see it as a shield not paperwork they lean in also get quick wins like a short risk section that actually helped dodge a delay once and suddenly folks start asking “is that in the plan” instead of rolling their eyes just gotta show that it reduces their headaches not adds to them",
          "score": 4,
          "created_utc": "2026-02-10 05:08:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4hvkp0",
          "author": "Revolutionary-Can680",
          "text": "Gotta test it. The proof will be in the data. Pick 1-2 projects and provide a PP for those. Monitor hours/budget, timeline adjustments and general team sentiment. Do a retrospective for those projects and find out what needs to be tweaked. Present to stakeholders for buy in if data is positive.",
          "score": 3,
          "created_utc": "2026-02-09 20:39:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4le6ls",
          "author": "buildlogic",
          "text": "You can start with one visible project that's currently a dumpster fire and use the plan to solve their actual pain points, show them how 15 minutes of planning prevents the 3-hour emergency meeting they all hate. But don't sell it as formal PMPs, sell it as \"so we stop getting blindsided by the same issues every single project\", make the plan solve their problems, not yours, and they'll adopt it because it makes their lives easier.",
          "score": 3,
          "created_utc": "2026-02-10 10:47:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4goqwk",
          "author": "pmpdaddyio",
          "text": "Tell them that without a project plan you need to grab gasoline and find a dumpster. Light it on fire and all of you jump in.",
          "score": 2,
          "created_utc": "2026-02-09 17:13:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4h5ihq",
          "author": "Chicken_Savings",
          "text": "They already do production planning, which is different from project management. It's not like every worker just rock up each morning, produce something random based on whatever raw materials and WIP materials are lying around.\n\nYou can try to identify frequent occurring problems that would likely be avoided by investing in the administrative burden of PM. If you can't find any, then maybe PM isn't the right answer.\n\nMay I suggest to look up MRP2 and see if you can steal some ideas from that, or Production Planning Methodologies.\n\nI'm not saying that you can't implement PMBOK, just saying that perhaps it is not the right toolkit.\n\nMaybe something like this would be helpful:\n\nhttps://www.odoo.com/app/manufacturing",
          "score": 2,
          "created_utc": "2026-02-09 18:32:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4h5mhg",
          "author": "TylertheDouche",
          "text": "I’m kind of confused by this. The pushback is they don’t want to plan? What is the actual pushback? Too many checkpoints?",
          "score": 2,
          "created_utc": "2026-02-09 18:33:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4humvy",
              "author": "More_Law6245",
              "text": "Resistance to change itself and there is no immediate benefit realised or answering the question of what's in it for me from individuals. This is where having change champions and agents becomes very important when invoking organisational change. At the moment, planning is perceived as an overhead because it hasn't been done in the past, so having no experience with project plans leads to the change resistance. This is important in showing how planning will improve or benefit both the organisation and individuals with the myriad of problems they currently experience now with an unplanned approach.\n\nJust an armchair perspective.",
              "score": 3,
              "created_utc": "2026-02-09 20:35:16",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o4hkvuy",
              "author": "BreakNo7825",
              "text": "I’d say one argument is that it’s added work. Or at least some will perceive that to be a major hurdle.",
              "score": 1,
              "created_utc": "2026-02-09 19:46:05",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4hlrig",
                  "author": "TylertheDouche",
                  "text": "What is the added work though? Like what is the literal thing now that they will have to do that they aren’t doing? That’s what i would want to know to see if there’s any compromise. \n\nIf they don’t want to plan, that’s one thing. But if they just don’t want 47 checkpoints and you can minimize that then that’s something you can probably do.",
                  "score": 1,
                  "created_utc": "2026-02-09 19:50:26",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4hju8r",
          "author": "LowSkyOrbit",
          "text": "Change comes from failures and lessons learned. Buy in won't happen without some results or clear vision. That can't come from someone saying we need to document more and align our mythology.\n\n Look at the current projects and check in to see what issues they are having. Don't ask them how you would fix it. Ask them what they would do to make their jobs easier. Find the pain points and present to leadership. Suggest what might be course for improvement. Have examples.",
          "score": 2,
          "created_utc": "2026-02-09 19:40:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4l0pmp",
          "author": "impossible2fix",
          "text": "Don’t start with a full PMP or big docs. Start with just enough planning to answer the questions people already care about: what’s coming, what’s blocked and who’s overloaded. When teams see fewer surprises, less rework and clearer handoffs, buy-in follows pretty naturally.",
          "score": 2,
          "created_utc": "2026-02-10 08:37:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4g5dxq",
          "author": "Victorsarethechamps",
          "text": "Baby steps, for sure. Try to implement one small, beneficial change. Make that the norm, and then work on the next one. I did this with my current company with medium success. Strongly encourage the full buy-in, though. Once they see the small changes, they may see the light for the big changes.",
          "score": 1,
          "created_utc": "2026-02-09 15:41:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4gbsj5",
          "author": "ConfectionOver3951",
          "text": "Following this thread because my department is the same way. Everyone in the division is doing one off projects and nobody is keeping track of them. I will pitch that we need a program manager/ product manager to help execute this ideas and projects",
          "score": 1,
          "created_utc": "2026-02-09 16:12:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4gi7bj",
          "author": "thatburghfan",
          "text": "Are there ever any external conflicts about scope or milestones? ",
          "score": 1,
          "created_utc": "2026-02-09 16:42:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4gjfz9",
          "author": "1z1z2x2x3c3c4v4v",
          "text": "Why do you want to do this?  What do you expect to get at the end?  What problem are you trying to solve?   And what is the ROI for all the effort one must put into your plan?",
          "score": 1,
          "created_utc": "2026-02-09 16:48:38",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qz6trm",
      "title": "Critique my Portfolio Management Setup",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1qz6trm/critique_my_portfolio_management_setup/",
      "author": "tky_phoenix",
      "created_utc": "2026-02-08 11:41:25",
      "score": 17,
      "num_comments": 28,
      "upvote_ratio": 0.91,
      "text": "I’m a delivery manager at a consulting company, currently managing <10 concurrent client projects.\n\nContext:\n\n* Sales wins the work and hands it over to delivery\n* Delivery owns execution\n* A separate talent team manages resourcing\n* Internal users only (no external client access)\n* Mixed tool maturity across teams (delivery is strong, sales less so)\n\nWhat we were trying to solve:\n\n* No consistent way to track deliverables, dependencies, and blockers across projects\n* Poor portfolio visibility (everything lived in emails, decks, or ad-hoc trackers)\n* Too much manual status chasing\n* Difficulty separating “we’re late” vs “we’re blocked externally”\n* Difficulty seeing the health of our engagements in one single source of truth\n\nWhat we’re experimenting with now:\n\n* **One Microsoft Planner plan for all projects**\n   * One bucket per project\n   * Tasks are labeled (deliverables, internal admin, on hold, dependency)\n* **Microsoft Teams**\n   * One team, one channel per project\n   * Planner tab filtered to that project\n   * Teams used for discussion; Planner is the system of record\n* **Power Automate**\n   * Project provisioning (channels, folders, Planner buckets)\n   * Daily automation posting overdue + due-soon tasks\n   * Weekly automated project health summary\n* **Power BI**\n   * Portfolio + project health\n   * Health based on:\n      * Deliverables completed vs time elapsed\n      * Budgeted hours vs actual hours\n      * Overdue / at-risk deliverables\n   * Explicit handling of external blockers\n\nDesign principles:\n\n* Delivery owns structure and task creation\n* Sales only responds to tasks assigned to them, they don't need to create tasks themselves\n* Automation replaces manual discipline as much as possible\n* Optimized for low admin overhead and scale\n\nWhat I’d like feedback on:\n\n* Where do you see this breaking in practice?\n* “One plan for all projects”: good idea or future regret?\n* Failure modes you’ve experienced with Planner / Teams-based setups\n* Anything you’d simplify or remove based on real-world scars\n\nNot looking for tool evangelism or “use Jira instead” answers. We are deep in the Microsoft eco-system and I can't easily change that. My goal is to make the most of the tools I have access to. Genuinely interested in what has worked or failed for people managing multiple projects with lightweight tooling. I can share more details if needed.\n\nThanks in advance.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/projectmanagement/comments/1qz6trm/critique_my_portfolio_management_setup/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o48kwiu",
          "author": "AutoModerator",
          "text": "Attention everyone, just because this is a post about software or tools, does not mean that you can violate the sub's 'no self-promotion, no advertising, or no soliciting' rule.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/projectmanagement) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-08 11:41:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o48le0l",
          "author": "Old_Cry1308",
          "text": "sounds like a lot of moving parts, might get messy. one plan for all projects could lead to chaos, seen it before.",
          "score": 5,
          "created_utc": "2026-02-08 11:45:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o48oq6s",
              "author": "tky_phoenix",
              "text": "I get what you mean. My instinct was also to have one per project. Comes with tradeoffs. One plan for each project has people flipping between different plans and potentially missing a task.",
              "score": 1,
              "created_utc": "2026-02-08 12:14:19",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o48p2he",
                  "author": "Thirstythursday00",
                  "text": "People can have their personal tasks from different plans in a single view in Planner, you can do this for sure if the tasks are assigned, pretty sure you can do this via tags as well. So that shouldn’t really be a tool issue, more of a user issue",
                  "score": 2,
                  "created_utc": "2026-02-08 12:17:06",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o48pklo",
                  "author": "Maro1947",
                  "text": "They also get email reminders so shouldn't miss tasks",
                  "score": 1,
                  "created_utc": "2026-02-08 12:21:12",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o49djw7",
          "author": "Correct-Ship-581",
          "text": "One option is set up Outlook folders per project (Project ID). Setup Outlook rule for each project to move email to the correct folder.  This way each project can have its own plan.",
          "score": 2,
          "created_utc": "2026-02-08 14:55:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4a5exo",
          "author": "weareabassi",
          "text": "I like a lot of what you are doing, but I question why you are rigging a single plan with buckets for your entire portfolio. Planner has a built in portfolio function that you can just  use instead of buckets. Plus, if you use the portfolio version instead of buckets, you can templatize similar projects, and use the buckets for a different purpose. \n\nI like your teams setup, and I do the same for the large program I'm running. However, I think it will all depend on buy in from sales in using it. My teams site struggles with adoption because people just message me or other teammates instead of using the channel. I will be stealing your power automate ideas though :). \n\nAnother idea if you have good traction with this setup, set up a SharePoint site with a quick overview of knowledge, key files, and even a high level critical path view of the higher profile projects for non-core team members",
          "score": 2,
          "created_utc": "2026-02-08 17:14:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4f0cot",
              "author": "tky_phoenix",
              "text": "Thanks for the feedback! I have not explored the portfolio feature yet. I played around with Planner Premium last year but stopped because PowerAutomate automations were too complicated.\n\nWe currently use OneNote for all our manuals and Miro for process maps but I want to move it to Sharepoint in the future so we can more conveniently use agents with it. \n\nThe one challenge I asked our data team to solve is how to get the Planner data into PowerBI. I know you can export to Excel and feed the Excel file to PowerBI but I want it automated.",
              "score": 1,
              "created_utc": "2026-02-09 11:27:59",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4g242u",
                  "author": "weareabassi",
                  "text": "What are you solving with the powerbi data? Sounds like youre using a bazooka on a molehill, or however that saying goes",
                  "score": 1,
                  "created_utc": "2026-02-09 15:25:28",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4b7jaw",
          "author": "rsbi",
          "text": "I like your setup already. The one thing I like to suggest is to maintain Portfolio Management within Sharepoint Lists / Microsoft Lists and add that to the Power BI.\n\nIn the SharePoint list, we register information such as: \n• Original delivery date\n• Current delivery date\n• Registration date\n• Short business case\n• Phase\n• Description\n• Business Lead\n• Sponsor\n• Technical Lead\n• Project Manager\n• Budget\n• Forecast*\n• Spent*\n• Committed Cost*\n• Cost RAG*\n• Time RAG*\n• Resource RAG*\n• Next Milestone*\n• Milestone Date*\n• Recent Update*\n\nWe also have a separate RAID Microsoft List that uses a selector for projects that exist in the portfolio. It will allow raising RAID entries against a project ID which we can centralize in Power Bi to see all risks over all projects in the portfolio. \n\nProject managers are meant to update all entries with a * weekly.",
          "score": 2,
          "created_utc": "2026-02-08 20:16:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4f01vj",
              "author": "tky_phoenix",
              "text": "That's a great point. We have a PowerApp that contains most of those data points exept RAID and that is what feeds into the PowerBI report in addition to the Planner data.",
              "score": 1,
              "created_utc": "2026-02-09 11:25:22",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4f7egu",
          "author": "More_Law6245",
          "text": "As a consultant I see this consistently when auditing organisations, your perspective in this thread is you're looking at end game, where you want to be but the key question here is what is your strategy to deliver a baselined delivery model? consistency in policy, process and procedures to ensure organisational portfolio, program and project delivery. Having a consistant organisational engagement model is the key to success that all stakeholders engage in.  \n\nI'm going to go out on a limb here and I'm going to say that you're not getting consistency in your project, program and portfolio schedule and plans because you should have a top to bottom and bottom to top view of all projects, programs and portfolios within a single view and yes it's actually achievable as it's how I actually deliver program and portfolios. Most of what you outlined can be drawn from the schedules themselves and all we do is redefine the view depending on what level you're looking at.  Also I feel that you may not be taking into consideration in how all teams operate differently and place different priorities around what they think is or isn't important to deliver, have you engaged these teams in workshops to map out business and workflows etc.? \n\nYour other constraint is your enterprise workforce planning model, in its current form you will always have a struggle, until you have a single source resource pool tracking genuine forecast and actuals, you will always run the risk of conflicting priorities within the organisation.  I must admit this has always been my challenge in the past, particularly from the senior execs especially when I ask for them to put a hand in their pocket to pay for an enterprise system. \n\nBased upon experience you need to look at your fundamental basics, refine them and ensure they have been embedded within the organisation, then you start becoming more strategic with different systems, governance, information management, data stores and information dissemination which leads to better strategic and performance outcomes.  Tools are the last thing to look at in addressing something like this, it's the requirements that dictate this, so what does the organisation need? \n\n  \nJust an armchair perspective",
          "score": 2,
          "created_utc": "2026-02-09 12:24:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4a1k8m",
          "author": "Fantastic-Nerve7068",
          "text": "yo this is honestly one of the cleaner Planner based setups i’ve seen. love how you’re squeezing value out of Power Automate without drowning in admin. the “one plan for all projects” thing can hold up if you’ve got <10, but once things grow it might start feeling noisy real fast. i’d just keep an eye on how many “overdue” tasks pile up and whether folks start ignoring the summaries. also planner’s lack of dependencies might bite you later when deliverables start overlapping. but for a MS first org, this is solid. respect.",
          "score": 1,
          "created_utc": "2026-02-08 16:56:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ezw7z",
              "author": "tky_phoenix",
              "text": "Thank you! Yeah the \"one planner to rule them all\" had me skeptical as well but it seems to be the most reasonable given our current scale. We could then break out into additional planners depending on theme, industry, sales team etc.",
              "score": 1,
              "created_utc": "2026-02-09 11:23:59",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4b0g3t",
          "author": "Economy_Pin_9254",
          "text": "Where I’ve seen things like this start to hurt isn’t Planner itself — it’s when projects begin to compete with each other in real ways. While you’re under \\~10 projects and priorities mostly align, one plan works fine. The moment two projects both “need to move” and share the same people, the system will show you the problem but won’t help you resolve it. You’ll feel that gap pretty quickly.\n\nAnother thing to watch is labels. “Blocked externally” is great in theory, but over time people get softer with it. Things quietly shift to “in progress” because no one wants their project to look stuck. Automation then just reports whatever it’s given. That’s not a tooling flaw — it’s just human behaviour once visibility exists.\n\nSame with the automations. They’re useful at first, then they fade into background noise. Once that happens, you’re back to status theatre, just without the manual work. The difference-maker is whether there’s a clear moment where “still blocked” stops being information and turns into a conversation with someone senior.\n\nThe parts I like are the obvious ones: delivery owning structure, sales not being dragged into tools, and BI sitting above it all instead of adding more noise. That’s sensible.\n\nIf this setup struggles later, it won’t be because Planner can’t scale. It’ll be because you’ve solved visibility but not yet solved how decisions get forced when projects clash. Most portfolio setups die right there.\n\nOverall, you’re on the right track — just don’t let it become a very efficient way of reporting problems without actually resolving them.",
          "score": 1,
          "created_utc": "2026-02-08 19:41:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ezqms",
              "author": "tky_phoenix",
              "text": "Thank you for the great feedback.\n\nLuckily our delivery team is only two people at this point. So consistency when it comes to tool use is stil fairly easy to manage, at least better than when there are more than 10 people involved.\n\nWe have weekly delivery pulse meetings to look at the whole portfolio and then drill down on the ones that need attention. That is also where we discuss and solve or escalate.",
              "score": 2,
              "created_utc": "2026-02-09 11:22:36",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4dhxcm",
          "author": "WhiteChili",
          "text": "this is honestly a pretty sane setup for where you are. you’ve solved visibility without drowning people in process, which is rare.\n\nwhere i’ve seen this strain is when projects start competing for the same people and dates. planner shows the conflict, but it can’t help arbitrate it. that’s where teams either add a thin portfolio layer (lists/sharepoint) or eventually reach for tools that handle cross-project dependencies and capacity a bit better, like celoxis or wrike. not because planner failed, but because the decision pressure moved up a level.\n\nsame risk with labels and automations… they work until humans soften them. dashboards don’t break, behavior does. the difference is having a clear point where “still blocked” forces a leadership call instead of becoming background noise.\n\nfor <10 projects, this is clean and pragmatic. just watch that you don’t end up with a very efficient system for reporting problems without a mechanism to resolve tradeoffs.",
          "score": 1,
          "created_utc": "2026-02-09 03:41:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ezhgp",
              "author": "tky_phoenix",
              "text": "Thank you, great feedback. I completely agree with your points. The system only works if people work within it and not around it.\n\nWe have a weekly delivery pulse where we look at the projects first at a macro level and then drill down on the ones that need attention. That's where the discussions and decisions then take place. At least that is the idea for now.",
              "score": 1,
              "created_utc": "2026-02-09 11:20:22",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4ek3dt",
          "author": "mandevillelove",
          "text": "Looks solid 1 plan works for <10 projects. but watch for resource conflicts and make sure you build in a clear way to prioritize and resolve trade offs, not just report them",
          "score": 1,
          "created_utc": "2026-02-09 08:51:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4f0fb0",
              "author": "tky_phoenix",
              "text": "Thank you, yeah I agree. The key take away is that it only works if people work in the system and not around it and secondly, issues are not only signaled but also then resolved instead of ignored.",
              "score": 1,
              "created_utc": "2026-02-09 11:28:38",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4fd59x",
          "author": "surrealcrow",
          "text": "Start super simple, automate as much as posible, then start adding where the process needs it, I've been on bot sides and no one likes to receive a bunch of nonsense extra work  on day one \n\nStart with",
          "score": 1,
          "created_utc": "2026-02-09 13:04:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4fdihq",
          "author": "pmpdaddyio",
          "text": "This is a consultant level ask. But my 1,000 foot view on where to address this is as follows:\n\n* No consistent way to track deliverables, dependencies, and blockers across projects\n   * *Planner has some cross over for projects, but it is mostly tied to the individual resource. I think you need to have separate projects per plan and use the buckets as intended, which is for project phase. Set up project phases and then set up PowerAutomate to pull these into an enterprise report.*\n* Poor portfolio visibility (everything lived in emails, decks, or ad-hoc trackers)\n   * *You need one source of truth. Your communications plan should outline where and how to communicate and for what reason. For instance, long term comms go in email, and are categorized in a project bucket and tagged. My day to day non tracked info is in Teams, and task/project specific comms goes in Planner. The hard part is socializing it. The more you ignore out of band comms, the better. I get people saying, \"I mailed my updates\" for instance and I just respond \"Hmmmm...didn't see those because the comms plan requires it.\". Then I send out the entire comms plan to the entire team and \"remind\" them. I only have to do this once or twice.*\n* Too much manual status chasing\n   * *This is accountability and you need to take the blame for this. If people are not updating tasks, you need to make it very clear that it is their responsibility. During status calls, I let them hang \"John, I don't see updates for your tasks, we'll skip you for this meeting, but I want all of your tasks updated by COB, and send me a status I can share with the team.\"*\n* Difficulty separating “we’re late” vs “we’re blocked externally”\n   * *This is where the progress field is best. You should not use the stock nomenclature, add what works, \"Blocked, waiting, on hold, delayed,\" etc. can all feed back into your reporting with PA.*\n* Difficulty seeing the health of our engagements in one single source of truth\n   * *Why? You have PowerBI, this is exactly what this tool does. It allows you to view all, or just a task. I'd start looking there. PBI has some great program and project resources.*\n\n",
          "score": 1,
          "created_utc": "2026-02-09 13:06:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4gj6w1",
          "author": "ninjapapi",
          "text": "your setup sounds pretty thoughtful but i've seen similar Planner-based approaches hit a wall when you need to correlate project data with actual financial or resource data from other systems. The \"\"one plan for all projects\"\" thing can work until you need to slice data differently or integrate with ERP/finance tools. From what I've read, Scaylor is built for exactly this kind of scenario - it unifies data from Microsoft tools, ERPs, and even spreadsheets into one queryable warehouse without replacing your existing stack.\n\nThat way your Power BI dashboards can pull from actual resourcing and budget systems instead of just task metadata. One thing I'd watch for: as you scale, you might spend more time maintaining teh automations than they save you, especially if data sources drift or someone changes a field name.",
          "score": 1,
          "created_utc": "2026-02-09 16:47:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ibni7",
          "author": "busote",
          "text": "Yeah, this unorganized mix of tools is always a problem. What worked for me is using a simple, easy-to-share Startpage. We're using it as a common ground for all co-workers where we collect all the tools and projects we are using.",
          "score": 1,
          "created_utc": "2026-02-09 21:59:40",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qy0fbj",
      "title": "PMI-CPMAI Experience",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1qy0fbj/pmicpmai_experience/",
      "author": "tky_phoenix",
      "created_utc": "2026-02-07 01:32:35",
      "score": 16,
      "num_comments": 5,
      "upvote_ratio": 1.0,
      "text": "I passed the CPMAI exam. Here is my experience.\n\nBackground: I got my PMP about 6 months ago. My role in consulting is very delivery focused and I was looking for a solid framework. PMP was the right move. With the focus on AI projects, I wanted a framework or methodology that I can use for AI projects and also just to learn more about AI, so I decided to go for the CPMAI.\n\nStudy: \n\n1. Main course: I signed up for the course on the PMI website and went through the course once. It's all just text with not videos/audio which is honestly not my preferred way of learning. \n\n2. Practice exam: After going through the course once, I signed up for the practice exam on the PMI website. The exam was way easier than all the PMP prep exam I went through. Even on my first attempt, I scored 85%. Went through it a few more times over the course of 2 weeks and got up to 95%. The multiple choice questions are usually the ones where I didn't get all answer right.\n\n3. Additional learning: I threw all the material into NotebookLM, created podcasts per module and quizzes too. Went through that for about a week including some chat conversations to clarify.\n\nExam:\n\nTook the exam at home. 120 questions. Some odd questions that were more basic PMP questions. Overall a lot more difficult than the practice exam on the PMI website but still easier than the PMP. All scenario based questions, usually just multiple choice with a few questions where I had to select more than one answer. I got through all the 120 questions in about 90 minutes, no break.\n\nHonestly, sitting focused for 90 minutes without break is tough. I found myself reading the same question repeatedly because I just didn't \"get\" the information I was reading. At the end of the exam I got the notification that I passed. Took about one day before I got the official notification via PMI via email.\n\n  \nAll together, compared to the PMP, I'd say the CPMAI is overpriced. The learning itself is still valuable and I would recommend it for anyone who works on AI projects.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/projectmanagement/comments/1qy0fbj/pmicpmai_experience/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o40bggl",
          "author": "DiscoInError93",
          "text": "So did you actually learn anything useful or novel about managing AI? I’ve been interested in this due to the demand for AI credentials, but I get the sense this is just a pay-to-play cert that doesn’t really bring much to the table.\n\nCongrats on passing and thanks for posting!",
          "score": 3,
          "created_utc": "2026-02-07 01:41:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o40qi36",
              "author": "tky_phoenix",
              "text": "Yeah, I did. If you learn something obviously depends on your current level of understanding of AI. But for me at least it gave me a framework to work with - the five phases: business understanding, data understanding, data preparation, model development, model evaluation, operationalization. That was useful. Same for the trustworthy AI framework.",
              "score": 5,
              "created_utc": "2026-02-07 03:15:08",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o40a1c6",
          "author": "AutoModerator",
          "text": "Hey there /u/tky_phoenix, Have you looked at our \"Top 100 books post\"? Find it [here](https://www.reddit.com/r/projectmanagement/wiki/index/books).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/projectmanagement) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-07 01:32:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4a2d9c",
          "author": "Fantastic-Nerve7068",
          "text": "congrats on the pass that’s a solid win and appreciate the honest breakdown especially the part about cpmai being a bit overpriced but still useful for ai focused work sounds like you made the most out of it with notebooklm and your own podcasts which is honestly a great approach respect",
          "score": 1,
          "created_utc": "2026-02-08 16:59:56",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qy8fxo",
      "title": "Tips on setting up Project Portfolio Management",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1qy8fxo/tips_on_setting_up_project_portfolio_management/",
      "author": "akash738",
      "created_utc": "2026-02-07 08:22:31",
      "score": 16,
      "num_comments": 17,
      "upvote_ratio": 0.92,
      "text": "Hi everyone, I’ve been running some coordination and managing workload for my branch for some months now and have realized the lack of proper portfolio management is hurting. Our current version is basically too reactive and I’m trying to move towards bit of an organized chaos. \n\nAs an added context, we do have an intake process currently and and excel tracker I created that basically sums up all projects and their statuses but it’s more like record log and does not help with scheduling, coordination, and proper workload balance. Moreover, this sheet is becoming the sum total of all things that higher ups want to know and have shown increased interest in expanding it to include various aspects of project management that does not help (25 columns is PITA tbh for anyone to fill out regularly) \n\nIf someone has setup their organizational PPM or are part of it, what helped the initial setup and what are some biggest lessons learned? ",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/projectmanagement/comments/1qy8fxo/tips_on_setting_up_project_portfolio_management/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o44bae8",
          "author": "WhiteChili",
          "text": "this is where a lot of teams go wrong… ppm turns into a Frankenstein excel instead of a decision system. more columns never fix reactivity, they just hide it better.\n\nwhat helped us was killing most fields and forcing a few hard views: priority, capacity, and timing. once leaders saw demand vs actual people, the chaos calmed down fast. tools like celoxis or wrike helped because they show portfolio load and tradeoffs without becoming report hell. lesson learned: if ppm can’t help you say “not now” or “no,” it’s just busywork dressed up as governance imo.",
          "score": 3,
          "created_utc": "2026-02-07 18:17:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o44lnu3",
              "author": "akash738",
              "text": "Spot on for my situation friend. I’ve had this nagging feeling that even with some software or different setup, without actual leadership support and involvement to change our “We can fit this in” stance every single time a new project pops up, will only send me to same existing situation with only a new fancy tool in my hands this time as the difference. \n\nTrying to implement some small wins on my end first without involving more people first. Once I can provide some answers like “we can fit this in after xx weeks due to these xx projects”, it might be time to start the bigger conversation when people have already seen some small wins.",
              "score": 2,
              "created_utc": "2026-02-07 19:08:58",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o431te0",
          "author": "timevil-",
          "text": "we are implementing Sensei...",
          "score": 3,
          "created_utc": "2026-02-07 14:29:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o41vdj9",
          "author": "Old_Cry1308",
          "text": "moving from excel to a real ppm tool was a game changer for us. too many columns is a mess. less is more. good luck",
          "score": 2,
          "created_utc": "2026-02-07 08:47:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o41zb8w",
              "author": "akash738",
              "text": "“One more column” has now dethroned my hatred for “One more lane”. What tool did you end up using?",
              "score": 1,
              "created_utc": "2026-02-07 09:26:43",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o42mzhy",
                  "author": "tubaleiter",
                  "text": "In a “real” tool it just becomes “one more custom field”. And then everybody complains the tool it too complex.\n\nNo tool will fix lack of discipline/process adherence, only leadership and culture can do that.",
                  "score": 3,
                  "created_utc": "2026-02-07 12:59:15",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o42r07x",
              "author": "Panda9903",
              "text": "What is a real PPM tool you are using, is it one that tracks all projects and resources used at once shown in a dashboard?",
              "score": 1,
              "created_utc": "2026-02-07 13:25:30",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o42rm6z",
                  "author": "ExpatPhD",
                  "text": "In my organization we use Smartsheet.",
                  "score": 2,
                  "created_utc": "2026-02-07 13:29:20",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4a273l",
          "author": "Fantastic-Nerve7068",
          "text": "one thing that helped us was separating reporting from actual execution tools early on we were trying to cram planning tracking resource load and status updates into one excel beast and it collapsed under its own weight shifting to a proper ppm platform gave us version control real timelines and portfolio level insights without turning everyone into spreadsheet slaves if you can get even a lightweight tool in place with roles workflows and dashboards it’ll save so much pain later even celoxis did a solid job letting us grow without overwhelming folks up front",
          "score": 2,
          "created_utc": "2026-02-08 16:59:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4avum8",
              "author": "akash738",
              "text": "💯. This was my pitch for 2026 and why we should stop relying on one single excel sheet for everything we do. Not only it takes mental toil on people updating the 20+ columns but it also start getting more messier to manage any sort of reporting except a very generic active, completed or on hold projects list. My current sheet takes so much time at end of every month from my workload due to constant reminder to people so they can update it and I genuinely understand why it’s not the most important thing for them when they are tacking 10+ design projects any single time. \n\nHopefully with some small changes, I can change their mind to start looking towards PPM and change organizational culture to be more provocative on our projects.",
              "score": 1,
              "created_utc": "2026-02-08 19:19:07",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4470xu",
          "author": "Magnet2025",
          "text": "I’ve used portfolio management software (part of Project Server) that took into account a complex ranking systems that included:\n\n- estimates of the cost and duration of the suggested project. In a well defined process we would collect the resource types (generics) so at the end, we’d see “PM 100%” “Business Analyst 150%” “Developer 550%” meaning 1 PM, 1.5 BA and 5.5 Devs. The resource estimate is important because most orgs can’t do all the projects and even with some projects they need to know the resource impact? Will you need to bring in contractors? Hire? \n\n- Then you have a portfolio of, say, 18 projects with the capacity of 12 projects. So the tool enable pair-wise comparison based on company direction and priorities. \n\nAt the end, you have your portfolio. Then the CIO says, “You eliminated project 7 and that’s a hard requirement” so you have to force out and force in projects. \n\nIn Project Server, the Portfolio process became an option I think. But it was a powerful tool with a lot of calculations running in the background. A colleague reverse engineered the process in Excel. I think it was about 25MB and many tabs. \n\nYou could lay the projects out against a calendar to see the resource load and change start dates to help reduce peaks and valleys.",
          "score": 1,
          "created_utc": "2026-02-07 17:56:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o44koi1",
              "author": "akash738",
              "text": "Thank you for sharing this. This is actually resembles something close to what I need on the workload balancing side and it’s lot easier to say “We can prioritize this thing but something from existing list needs to be delayed” with data in hand. I’ve gotten the usual “oh we can fit this in schedule” when clearly I’ve voiced we can’t (but with only rough numbers on active projects and their estimated time frames)",
              "score": 2,
              "created_utc": "2026-02-07 19:04:00",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4501kg",
                  "author": "Magnet2025",
                  "text": "You are welcome. \n\nI have that Excel somewhere if you would like to have it. \n\nI think the resource management part of the portfolio is very powerful part of the tool. When you compare the planned vs actual, you start to see the impact of delays as resources needed on another project are still critically engaged on a delayed project. \n\nI used to become fairly upset when told “You can get it done, just manage the team, that’s what we hired you for.” \n\nMy response would be: “I don’t own any of the resources and you hired me to deliver successful projects that comply with the triple constraint, not to browbeat team members into working a bunch of uncompensated overtime in order to work a project that was not in the portfolio.” \n\nI could usually get away with that. Not always, but usually.",
                  "score": 1,
                  "created_utc": "2026-02-07 20:24:20",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1r0zy8h",
      "title": "Self-learning practical project management?",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1r0zy8h/selflearning_practical_project_management/",
      "author": "VladimiroPudding",
      "created_utc": "2026-02-10 12:54:30",
      "score": 16,
      "num_comments": 6,
      "upvote_ratio": 0.91,
      "text": "Hello all,\n\nI am currently in a weird spot. I recently went back to school to change gears and succeeded striking in last year, even with this horrid job market. I have some management experience under my belt from my previous career, including managing a small team and mentoring, and have made a project from scratch which, at the time, was in broad demand in the company. Meaning, I was just there to connect the dots and make a stuff everybody wanted. People were cooperative.\n\nNow, I am in a path that is totally new to me and... the company is a *brutal mess*. My boss doesn't know what the end goal/deliverable of their projects are, much less how to manage them (I mean, how can you manage the development of something you don't know what it is) and the senior managers under them are as oblivious. Everything is an amorphous blob. I feel like people are not jumping off ship because the company is in this limbo that deadlines don't matter much (think of something like public projects that take years to complete), so it is a comfortable place to be. \n\nHowever, because of some life planning of mine, I need to have a portfolio in this new career I have chosen, and I need it kinda fast, so I decided to create and manage my own projects. But because I am new in this career, and also because of the ethos of my company, I don't know exactly how to manage these projects. I did a course of project management and learned a bunch of fishbone diagrams and GANTT charts but they're all useless if I don't know exactly which steps to take and how much time to dedicate to them. Nobody will come to my rescue (no tutoring, coaching or learning where I am right now due to aforementioned reasons).\n\nSo, my question is: how to best be a self-learner and make my projects happen, in this environment? Thank you!",
      "is_original_content": false,
      "link_flair_text": "General",
      "permalink": "https://reddit.com/r/projectmanagement/comments/1r0zy8h/selflearning_practical_project_management/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o4lzzbi",
          "author": "pmpdaddyio",
          "text": "The first thing you need to do is grab the book [Bare Knuckled Project Manager.](https://www.amazon.com/Bare-Knuckled-Project-Management-Succeed/dp/0615813941) Tony Gruebel is a bit of a legend in project turn around. His company is brought in to fix projects and rerail them.\n\nNext, you need to take a step back and act like you are in the project initiation phase. Look at your team and figure out who you need active and who you need benched. Look at the SOW, then your requirements. If either is weak, you need to fix it. The requirements are easier but if you point out to the client the project is in the shitter, you might be able to convince them to provide an addendum.\n\nNow baseline everything. That way you can measure \"time now\" versus just restarting the project. Review all project artifacts, the project plan, RACI, RAIDD log, etc. Pull this information in when you rebuild. Come up with a new plan that builds off the baseline and a path to green. Determine the new definition of done, and along with that a new budget and schedule to present to the stakeholders and sponsor.\n\nNow the hard part. You need two recommendations, one is the fiscal impact of the sunk cost and project abandonment. This may be cheaper than you expect. The second is your new baseline plan. Get it in writing which path the stakeholders and sponsors want to take, and proceed.\n\nThis whole thing is not a PM issue, it is a leadership issue. Your role is to deliver the facts, not the assumptions.",
          "score": 5,
          "created_utc": "2026-02-10 13:26:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4m19bj",
          "author": "Old_Cry1308",
          "text": "honestly just treat it like you’re the only adult in the room write your own charter, define the deliverable yourself, break it down into tasks, guess timelines, track in a simple board and refine as you go it’s rough building experience in a place that chaotic but job hopping out is not easy with how hiring is right now",
          "score": 4,
          "created_utc": "2026-02-10 13:33:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4oj5xa",
          "author": "More_Law6245",
          "text": "I commend you on your professionalism but there is a sailor's warning in your approach because one of the challenges you will experience is that you will have a difficult time enforcing organisational roles and responsibilities when there is no formal organisational project engagement model.\n\nI would highly suggest as part of your approach of getting off the ground is that you need to start seeking out change champions and agents and looking to influence your senior executive in the benefits of what you're doing e.g. being more cost effective and not wasting money off the company's bottom line. Also the other challenge you will face is change resistance, you need to be able to sell the benefits of your approach and answer a fundamental question from a work colleague perspective is \"how does this help me and what is in it for me?\". If you can't answer or demonstrate this you will be pushing a big rock up a hill. \n\nOne consideration is raising a white paper or business case to your senior executive and highlight the need for an organisational framework and a project engagement model, it has a two fold outcome. Firstly it shows the need for the business case and it potentially puts in you in a position to drive the organisational changes needed.  \n\nIn terms for you personally, I do recommend undertaking more formal accreditation to start providing you more context of project management frameworks an principles because by nature project management is an extremely broad discipline and there are many different ways to approach the same problem.  Your lack of experience may leave you will some challenges, having accreditation may just give you a bit more insight in how to approach the discipline holistically. Also keep in mind project management experience \"doesn't happen fast\" experience happens over time through failures and wins and it doesn't happen overnight. Good luck in your role \n\nJust an armchair perspective. ",
          "score": 4,
          "created_utc": "2026-02-10 20:43:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4lzdeo",
          "author": "Deflocks",
          "text": "I was self-learning PM, but it’s damn hard to make a “plan” if you don’t know what the “end game” looks like. Prior to becoming a PM (I was “borrowed” from a different team) I was in leadership for a large retail organization, so the soft people skills are easy enough. But the PM skills, I had no idea what to do.\n\nWhat I did: Took two courses through Coursera (Google Project Management & IBM Project Management) that offered certifications. Took the info I learned for both and applied it to my current role. Those courses helped me “map a path” for my projects, setup milestones, and prepare my projects.\n\n\nBut I have more information than you have… so YMMV.",
          "score": 1,
          "created_utc": "2026-02-10 13:23:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4n1sbm",
          "author": "A-n-o-v-a",
          "text": "Real world experiences thru internships or workshops should help. I only understood management science thru hands-on",
          "score": 1,
          "created_utc": "2026-02-10 16:37:28",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qza69j",
      "title": "For those who are contract PMs, is it common to have a gig supporting more than one project?",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1qza69j/for_those_who_are_contract_pms_is_it_common_to/",
      "author": "NuttyBrewnet",
      "created_utc": "2026-02-08 14:22:58",
      "score": 14,
      "num_comments": 16,
      "upvote_ratio": 0.95,
      "text": "After about 15 years in PM, I’m considering making the switch from FTE to contract work. Is it realistic to think that taking a contract only turns out to be just that one project I was contracted for? Or do you typically get more projects or responsibilities added over time? TBH I’m burned out on always having to juggle multiple projects and want to see how much more effective I could be if I just had one objective to focus on.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/projectmanagement/comments/1qza69j/for_those_who_are_contract_pms_is_it_common_to/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o499il2",
          "author": "Old_Cry1308",
          "text": "contract work often means juggling multiple projects. rarely just one. brace yourself, might not be the relief you’re seeking.",
          "score": 5,
          "created_utc": "2026-02-08 14:32:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4d821q",
          "author": "fineboi",
          "text": "The main difference in contracting vs FTE is your paid handsomely for your knowledge.   Other than the way they use your energy is the same.",
          "score": 4,
          "created_utc": "2026-02-09 02:47:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4fodir",
              "author": "NuttyBrewnet",
              "text": "Good point! Never thought about it that way.",
              "score": 1,
              "created_utc": "2026-02-09 14:11:54",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4ijfos",
          "author": "moochao",
          "text": "Depends on the contract, depends on the project size, depends on client PMO leadership. There's no flat answer to that. \n\n  \nI've been on contract for one single project 3 times. I've supported other projects to assist the PMO director & keep the client org happy during all 3, because that's how you build a reputation in your professional network. ",
          "score": 4,
          "created_utc": "2026-02-09 22:39:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4cm4oc",
          "author": "Efficient-County2382",
          "text": "I find them pretty much the same, you may be hired for a particular project, but also you may be hired as a genric PM that has to manage multiple projects",
          "score": 3,
          "created_utc": "2026-02-09 00:48:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4g4dsm",
          "author": "JoshSamBob",
          "text": "After fifteen years of juggling multiple projects as an employee, the idea of a single focus is a great way to beat burnout. In the contract world, your scope is usually tied to a specific project defined in your agreement. While scope creep can happen, you have much more leverage to push back than an fte. If you want to talk about vetting contracts for stability, feel free to shoot me a dm.",
          "score": 3,
          "created_utc": "2026-02-09 15:36:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4i2hbg",
          "author": "More_Law6245",
          "text": "At the end of the day, contract owners see you as an organisational resource and use you as they see fit as you're actually cheaper than an FTE on the hourly rate and have lower HR administration burdens e.g. if the work dries up or you're seen as a temporary supplement to the organisational workforce\n\nOn the rare occasion you can be employed under contract for a specific project or program because it was how the business case for the role was raised because the workload is exceeding the organisation's ability to deliver an it will have a finite period of delivery cycle or the organisation doesn't have the necessary skillset needed for a particular type of project delivery.\n\nThe problem I have with contracting is that I was employed under a contract but contract owners keep on wanting to extending my contract because I was delivering value for money (not to sound like a twat, I'm good at what I do). This makes planning difficult sometimes because A) I have already lined up another contract B) I didn't want to stay with the same contract owner because I had already delivered the contract C) I didn't like contracting with the organisation.\n\nSometimes that means managing multiple projects as a contractor and is a common practice,  I had one in particularly on where I was coming to an end of a contract and was asked to review a program of work and I essentially canned it because standard governance had not been met, so I got the foundation of the program back on track but the contract owner got their noses out of joint because it suddenly it turned into a two year program and I wasn't staying to run it. I was already out the door when they got me to review and assess the program.\n\nIt's the very reason why I became a contractor, I want to control how and when I work.  I've been fortunate enough to be able to pick and choose the contracts I want but I will make this very clear, don't get me wrong there has been a lot of hard yards and a lot of grinding but it's now the very thing that affords me the luxury to pick and choose and sometimes you have to do things that you may not want to. In contracting you're only as good as your last delivery! Reputation is everything when contracting.\n\nA reflection point for your consideration at the end of the day being either an FTE or Contractor it's going to be much the same, it's just what you're willing to put up with but personally I found that contracting gave me more flexibility but there are trade offs.\n\nJust an armchair perspective",
          "score": 3,
          "created_utc": "2026-02-09 21:13:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o498ez8",
          "author": "MattyFettuccine",
          "text": "It depends on your contract terms, of course, but that sounds like scope creep. My contracts are usually for a single project.",
          "score": 2,
          "created_utc": "2026-02-08 14:26:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4c1ua6",
          "author": "Neither_Cover_4330",
          "text": "This really depends on your contract. I've been a contract PM supporting tla PMO when someone is on leave, so I picked up their projects. Same thing for a new PMO. Just depends.",
          "score": 2,
          "created_utc": "2026-02-08 22:51:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4c3p09",
          "author": "FedExpress2020",
          "text": "Ive done both but mostly now its an entire program with PMs and leaders running their workstreams",
          "score": 2,
          "created_utc": "2026-02-08 23:02:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4earbp",
          "author": "Maro1947",
          "text": "Usually. Currently, I'm working on three, sometimes one and the most was around 20\n\nObviously it depends on the size of the project/program",
          "score": 2,
          "created_utc": "2026-02-09 07:21:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4eqh5s",
          "author": "Chicken_Savings",
          "text": "If you're in construction, you'll most likely need to frequently be on site, and it will be very difficult to handle multiple customers unless it's very small projects in the same city.  I'm in oil & gas, I may do a bundle of multiple very similar projects, or just one bigger project.  My colleague in office next to mine manages 1 big project for 3-4 years.",
          "score": 2,
          "created_utc": "2026-02-09 09:55:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4fs8t0",
          "author": "ExtraHarmless",
          "text": "Yes, unless it is one really big one like an ERP deployment.\n\nMany contracts are to replace FTE's when the business won't pay for them on a permanent basis and want the fliexibility to let you go when there is not enough work to keep you busy.\n\nJust make sure if you need to go over the number of contract hours you have(usually 40) to complete the work, talk to your contracting company about how to handle it. Sometimes you should bill for more than 40(go live etc) and sometimes they will want you to eat the extra hours. Try not to eat the hours whenever possible as it reduces your average hourly by a ton really quickly. 4 extra hours a week is \\~10% pay cut per hour. \n\nAfter discussing with your agency, talk to your contract holder about how they want you to handle it. Sometimes they will reduce work load, sometime they will want you to bill more.",
          "score": 2,
          "created_utc": "2026-02-09 14:33:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4h97kg",
          "author": "Correct-Smile-5080",
          "text": "By contract work, do you mean you’re an independent contractor? If so. You should dictate the projects based on the SOW’s you execute.  It’s all contract based.  I’m being hired for project A and I charge XYZ to carry out the scope of work, if they want me to work on Project B then that’s a whole new SOW with it’s own commercial terms. If I don’t want to take it I dont take it.",
          "score": 2,
          "created_utc": "2026-02-09 18:50:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4c3i27",
          "author": "karlitooo",
          "text": "It’s industry dependeeeeeeeeeeeent ",
          "score": 1,
          "created_utc": "2026-02-08 23:00:58",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qy8m74",
      "title": "Doing a Project Planning & Control course (MSc level) without any formal experience. Help?!",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1qy8m74/doing_a_project_planning_control_course_msc_level/",
      "author": "unrolledblueprint",
      "created_utc": "2026-02-07 08:33:24",
      "score": 13,
      "num_comments": 17,
      "upvote_ratio": 0.94,
      "text": "Hello everyone, \n\nSo instead of going for the full MSc, I had the option of taking one course to test the waters before committing and I chose to do Project Planning & Control. I have no formal, professional experience working in the project management field. My background is in construction & i was introduced to construction management courses during my undergrad studies. My goal is to work in construction management eventually. \n\nI love being a student and studying so I don't mind the workload at all, but I realize that I'm at a little disadvantage compared to my peers due to the lack of professional experience (not that it deters me!) I'm doing a ton of reading articles, research papers, watching videos, but I'm wondering what else I can do to gain a practical understanding that comes from actual experience. \n\nI would appreciate any advice you can share, I'm practically a sponge right now trying to absorb any knowledge, advice, or suggestion that comes my way. ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/projectmanagement/comments/1qy8m74/doing_a_project_planning_control_course_msc_level/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o420bw5",
          "author": "Build_higher",
          "text": " Be a site labourer for a bit. Understand the reality of what happens on construction sites, and how things are negotiated on the ground. Shit goes wrong all the time, it’s great to see that first hand.",
          "score": 3,
          "created_utc": "2026-02-07 09:36:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o41yw31",
          "author": "The_Chef_Raekwon",
          "text": "Depending on where you are, but there are definitely planning jobs that don’t require field experience. \n\nImo it depends on how companies view planning. If you want a planner who, on his or her own, owns a multidisciplinary planning and knows about all nuts and bolts, you do need that field experience and there’s no simple way to bypass that requirement as far as I know.\n\nAt my company, planners work together with subject matter experts. Those experts provide input for that planning and the planner makes sure it all comes together. \n\nI work with a female planner and she’s kick ass btw. I’m fortunate to work with pretty diverse teams, including women in a traditionally male dominated field. I’ve yet to hear any demeaning jokes or general unpleasantness towards women. \n\nConstruction adjacent (high voltage power grid), not based in US for what it’s worth.",
          "score": 2,
          "created_utc": "2026-02-07 09:22:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o420m60",
              "author": "unrolledblueprint",
              "text": "I'm not trying to bypass gaining experience at all, I'm very keen on getting that experience & am willing to start from the beginning. Like I said, it's a little hard trying to convince employers that I can be an asset without any experience to back me up. \n\nJust trying to get through this course as best I can without the experience bit ",
              "score": 1,
              "created_utc": "2026-02-07 09:39:50",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o420wae",
                  "author": "The_Chef_Raekwon",
                  "text": "Yeah no worries, doesn’t read like you want to. Just saying I see multiple options to move forward. Best of luck",
                  "score": 1,
                  "created_utc": "2026-02-07 09:42:38",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o450fg7",
          "author": "mostrengo",
          "text": ">I would appreciate any advice you can share\n\nA project is a series of things that need to be done. Each of those things:\n\n- Takes some time\n- Costs some money\n- Has some expected quality level\n- Needs to be done by someone or something (that logically will not be doing some *other* thing during that time)\n- May be an input for another thing that follows\n- May need the input of a thing that came before\n- Is subject to risks (some of which may be addressed proactively)\n- Should be checked during or after to see if things are developing as expected\n\n**Project management is the skill of gathering all of these inputs - which often conflict - and planning them within their constraints and monitoring the plan as it is being executed.**\n\nSo if you are able to:\n\n- Break down the final product into progressively smaller things that need doing\n- Sequence those things based on what is input for what\n- Answer all the points I touched on above for each of those things\n\nYou will be half way to being a PM.\n\n____________\n\nA note on having practical experience: what practical experience does for you is it increases the quality of your inputs (you will think of more risks and more strategies, you will be able to challenge or even perform estimates) and you will deal with people better. but fundamentally the subject matter is similar. \n\nThere also the whole human aspect of being a PM who deals with humans which I did not touch on because in my opinion that is only relevant for those wanting to become senior PMs - this also gets improved with practical experience, but it's far from a given.",
          "score": 2,
          "created_utc": "2026-02-07 20:26:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ejqx0",
              "author": "unrolledblueprint",
              "text": "This is great, thank you for taking the time to break it down! Thinking of these inputs in terms of a construction project is so exciting. I appreciate your help!",
              "score": 1,
              "created_utc": "2026-02-09 08:48:12",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4a1vt1",
          "author": "Fantastic-Nerve7068",
          "text": "Love your attitude toward learning because honestly that's half the battle. Since you're aiming for construction management I’d suggest shadowing real project managers if possible or volunteering on small projects even unpaid ones. Tools like MS Project or Celoxis are good to get familiar with because scheduling and resource planning are key in that field. Also try breaking down real world projects into work breakdown structures or mock Gantt charts on your own. It helps bridge the theory with execution and builds intuition fast. Keep going you’re on the right path.",
          "score": 2,
          "created_utc": "2026-02-08 16:57:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ehr9l",
              "author": "unrolledblueprint",
              "text": "Thank you, i really appreciate your advice and will definitely start incorporating this in my day to day. ",
              "score": 1,
              "created_utc": "2026-02-09 08:28:25",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o41upo8",
          "author": "RemyOregon",
          "text": "If that’s your question, you need to spend some time in the field. Are you what, 21?\n\nMy genuine advice, what I say to most ppl, you don’t know shit until you do 5 years in the field. It sounds like a long time, but it’s not. You’re not much help in the office if you can’t picture the work. The actual labor it requires.\n\nEvery problem I run into is the office thinking things just happen in quants. I did 12 in the field and I am now beginning my estimator/APM time. I add like 25% to whatever the others think. Simply because they don’t account for field error and/or time to move equipment. You have to see it happen.",
          "score": 1,
          "created_utc": "2026-02-07 08:41:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o41v66b",
              "author": "unrolledblueprint",
              "text": "That would be very ideal, I've been trying to get a job but getting entry level roles is pretty tough anywhere & terrible job markets don't make it any easier, but trying! \n\nI'm 25",
              "score": 2,
              "created_utc": "2026-02-07 08:45:56",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o41w0cf",
                  "author": "RemyOregon",
                  "text": "Brutal question, but male or female? Do you feel excited about any aspect of construction yet? Paperwork? Design?",
                  "score": 1,
                  "created_utc": "2026-02-07 08:53:58",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o41wd23",
              "author": "unrolledblueprint",
              "text": "I completely agree with you. My dad has been working in the construction field as estimating manager for a very long time now and he tells me a lot of the same things. Experience is the best teacher for sure. \n\nWhile I am on the job hunt, the whole reason of doing further studies is to get a job!! Employers don't like taking chances on people with no experience (rightfully so, i guess?), so I need to upgrade in other ways to show what I can bring to the table. \n\nThanks for your advice & good look in your new estimating role! ",
              "score": 1,
              "created_utc": "2026-02-07 08:57:22",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o41yqdw",
          "author": "vhagar123",
          "text": "The thing with project management is you could apply the techniques to almost any change. Although they may not be professional examples, things like hosting a party, moving home, making an elaborate dinner etc can all work as examples.",
          "score": 1,
          "created_utc": "2026-02-07 09:20:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4i3qnw",
          "author": "Sophie_Doodie",
          "text": "construction background already gives you real-world context. Treat everything you study as if it’s a live project: map it to jobs you’ve seen, decisions you’ve watched, problems you recognize. Case studies, mock schedules, and planning tools matter more than theory, and honestly a lot of PM “experience” is just learning to think in tradeoffs and constraints. You’re doing the right things already.",
          "score": 1,
          "created_utc": "2026-02-09 21:20:00",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qz0cvi",
      "title": "As a new PM am I doing setting things up the correct way?",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1qz0cvi/as_a_new_pm_am_i_doing_setting_things_up_the/",
      "author": "moderatenerd",
      "created_utc": "2026-02-08 05:20:25",
      "score": 11,
      "num_comments": 6,
      "upvote_ratio": 0.92,
      "text": "Hi All,\n\n   \nI believe this is the proper sub to post on. I just started as a PM for an IT asset management project sorting out issues inside servicenow. Currently the team is heavily reactive, excel, email, and teams based. My very first job in IT in 2014 I worked two years without a help desk system and I never want to go back to that. I have been here six months just doing basic trainings, excel projects like sorting data and testing scripts for people who need it done. There is no structure to really any of this and often I don't even get a date when the thing is due or why I am working on it. I do have clear goals set like test this project. But sometimes I get little duties to clean or fix datasheets in excel etc... \n\n**The Avalanche of Emails Friday Afternoon:**\n\nThis past week I had to work on three projects and it got down to the wire. Friday afternoon I was still updating code, scripts, and testing a feature with constant pushback from stakeholders and leadership (if something changed in the excel after approval etc). Different parties sending me different emails with different results. This happens often and then we have meetings to clarify.\n\nSo after I finished all my work at 3 PM I decided to look around the agency's tools to see what was being underutilized and not up to date. I live in the intersection of IT and dev so I have some admin rights to a lot of the cloud software jira, servicenow etc... \n\n**What I have done/working on:**\n\nWe had project boards in jira and wikis that haven't been updated since 2023. We don't utilize tasks or time tracking in jira. I started doing this on friday and showed my leadership who was pleased to see this functionality. Before the tracking board I would send my boss a report of what I did each day. \n\n**What we don't have:**\n\nWe don't have approvals or workflows for my team set up in servicenow (mostly because nobody knows how but i certainly can build it with the right research). I have also requested to work with the development team to get this access or even to work with the team more.\n\n**Tasks are discussed and done via memory and hardly any documentation:**  \n\nMy question is is this often what happens on the PM track? We are a small team consisting of two division chiefs and myself. We work with a few other teams like dev, and various branches of IT. I don't believe they have a centralized system or trusted source of knowledge either. A lot of things are done on the fly based on memory. Most of the teams meetings are about remembering what they did years ago with scattered documentation nobody knows exists.\n\n**What's the best way to setup a formalized intake process for the team?**\n\nIs there anything else I should focus on? I am thinking that I need to have a formalized intake process each of these teams need to utilize when they request something or change something that relates to our team. This for better auditing and tracking. \n\nAny other tips or suggestions would be very useful and appreciated. ",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/projectmanagement/comments/1qz0cvi/as_a_new_pm_am_i_doing_setting_things_up_the/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o47f9ll",
          "author": "AutoModerator",
          "text": "Attention everyone, just because this is a post about software or tools, does not mean that you can violate the sub's 'no self-promotion, no advertising, or no soliciting' rule.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/projectmanagement) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-08 05:20:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o47grci",
          "author": "Old_Cry1308",
          "text": "sounds chaotic. set up a simple intake form for requests. track everything in jira. documentation is your friend. revisit processes and keep stakeholders in the loop.",
          "score": 3,
          "created_utc": "2026-02-08 05:32:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o47h8ie",
              "author": "moderatenerd",
              "text": "Yes It was manageable when all I had to do was a simple chart or training a week, but now I guess my leadership knows I am capable so they are dumping more in my lap. I know they want me more on the development side (promotion hopefully) of things anyway so that sounds good. I hope I can create a good intake form (guessing this can be done in jira), and show the other teams not to be afraid of it either. Basically in my It jobs I would be the person to ignore everything that wasn't in the ticketing system. I love telling people to put it in the system and I will look at it then.",
              "score": 0,
              "created_utc": "2026-02-08 05:36:06",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4b0wmw",
          "author": "Economy_Pin_9254",
          "text": "What you’re describing is pretty normal in teams that never really had structure to begin with. And yes, this *is* often what the start of a PM role looks like in places like this.\n\nThe problem isn’t Jira vs ServiceNow vs Excel. It’s that work is coming at you with no clear why, no real deadline, and no one actually owning the decision. That’s why everything blows up late on Fridays — urgency gets manufactured at the end because it was never framed properly at the start.\n\nWhat you did by reviving boards and tracking work is fine, but be careful here. The fastest way to burn out is becoming the person who builds structure *for everyone* without the authority to enforce it. That turns you into the system instead of the system doing the work.\n\nOn intake — your instinct is right. But keep it simple. You don’t need a heavy process. You just need a gate. \n\nEvery request should answer:\n\n* what’s being asked, \n* why it matters, \n* when it’s needed, and \n* what happens if it doesn’t get done. \n\nIf it can’t answer those, it’s not ready. Full stop.\n\nI’d hold off on building fancy workflows for now. Not because they’re bad, but because automating chaos just makes chaos faster. Until there’s agreement on how decisions get made, tooling won’t fix much.\n\nA lot of what you’re feeling is just seeing the mess clearly for the first time. That’s not failure — that’s awareness. The trick is deciding which problems you surface and which ones you don’t try to personally absorb.\n\nFocus on fixing how work *enters* the system. If you get that right, everything downstream gets easier. If you don’t, no tool will save you.",
          "score": 2,
          "created_utc": "2026-02-08 19:43:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o47f9ml",
          "author": "AutoModerator",
          "text": "Hey there /u/moderatenerd, have you checked out the [wiki page](https://www.reddit.com/r/projectmanagement/wiki/index) on located on r/ProjectManagement?  We have a few cert related resources, including a list of certs, common requirements, value of certs, etc.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/projectmanagement) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-08 05:20:25",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r1zc7c",
      "title": "(User based Recommendation) Apps that I’m using in 2026",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1r1zc7c/user_based_recommendation_apps_that_im_using_in/",
      "author": "anonymous5090",
      "created_utc": "2026-02-11 14:48:52",
      "score": 10,
      "num_comments": 5,
      "upvote_ratio": 1.0,
      "text": "New year so figured I'd share the tools that actually stuck around after trying way too much stuff last year. These are the ones I genuinely use not just installed once and forgot about.\n\n* Claude directly in the app for quick scripts. Faster than spinning up a project for something I'll run once.\n* n8n for automations. I know a majority of you have used this. Self hosted it and forgot about it which is exactly what I want.\n* Thinklistapp with their AI features for docs. Not groundbreaking but having everything in one place matters. Helps alot when it comes to executing tasks daily. Although it's a paid app, and I could potentially do the same thing with ChatGPT.\n* Langsmith for tracing LLM calls. Saved me so many times when something breaks and I need to see what happened. \n\nWhat tools survived your 2025 culling? ",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/projectmanagement/comments/1r1zc7c/user_based_recommendation_apps_that_im_using_in/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o4t29qr",
          "author": "AutoModerator",
          "text": "Attention everyone, just because this is a post about software or tools, does not mean that you can violate the sub's 'no self-promotion, no advertising, or no soliciting' rule.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/projectmanagement) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-11 14:48:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4thn4o",
          "author": "Consistent_Voice_732",
          "text": "Langsmith-style LLM tracing is a game changer-wish I used it sooner  ",
          "score": 1,
          "created_utc": "2026-02-11 16:03:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4tt0qo",
          "author": "Comfortable-Garage77",
          "text": "Gpt for the win, but now gradually switching to gemini. Also use grammarly extensively for my writing and saner to manage my tasks via chat. But that's all, all roads lead to Google sheet finally lol",
          "score": 1,
          "created_utc": "2026-02-11 16:56:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4t46k8",
          "author": "subtlesub29",
          "text": "🤮🤮🤮🤮🤮",
          "score": -3,
          "created_utc": "2026-02-11 14:58:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4t5oiy",
              "author": "Suspicious-Camera489",
              "text": "Do you think you can manage to elaborate your comment a bit more?",
              "score": 2,
              "created_utc": "2026-02-11 15:06:18",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qwegri",
      "title": "best way to do a retro",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1qwegri/best_way_to_do_a_retro/",
      "author": "rockandroll01",
      "created_utc": "2026-02-05 07:03:49",
      "score": 9,
      "num_comments": 12,
      "upvote_ratio": 0.85,
      "text": "So, I recently had a big project release done 2 months back. As a PM I was involved in late when half of dev work was completed. Any way I got the project rolled out without any blockers and major obstacle (by focusing only on what is needed for phase wise delivery & eliminating rest)\n\nOverall I had more than 1 dozen people who worked in either small or big capacity on this project. I would like to run a retro. I tried for a previous small project where i gave the qs on google form\n\n1. what went well & keep doing\n\n2. What needs improvement\n\n3. what to avoid\n\n4. Any further suggestions?\n\nThe response numbers wasn't impressive , even though the submission was anonymous \n\nSo i would like to check with fellow Pms whats the most effective way to get this done. I actually want ppl to participate and give proper feedbacks, instead of generic ones.  What the right question to ask?\n\nSuggestions welcomed.   \n\n\n",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/projectmanagement/comments/1qwegri/best_way_to_do_a_retro/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o3ojbkq",
          "author": "Sensitive_Pickle_625",
          "text": "Make it easy to provide feedback, some sort of shared whiteboard. Forms suck for this.\n\nDo informal 1:1 interviews before.\n\nHave the key project metrics and data top of mind, don’t count on people remembering the details.\n\nFocus on positives, prevent individual blame games.",
          "score": 5,
          "created_utc": "2026-02-05 07:44:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3oh6tx",
          "author": "Marelle01",
          "text": "It's not so much what question to ask, but how to ask it.\n\nFor a dozen people, the interview will work much better, or in 3-4 groups if you can't do it one by one. \n\nThe key is to **valorize what went well** and ask  open-ended questions. \n\nKaizen, continuous improvement, happens in the *present* and set *future* goals. So, it's to late for that, since the project is finished. Retrospectives that focus on failures, in the *past*, piss everyone off and resemble witch hunts.",
          "score": 3,
          "created_utc": "2026-02-05 07:24:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3oj31v",
              "author": "Important-Union5181",
              "text": "Use SLA for the KPI(s). You can generate the SLA based on past data.  If you are tracking, say, release velocity as an item to valorize, then if it goes above the SLA or below the SLA you can ask the question what worked or what did not work. This way the questions will be objective and focused. You can use a online collaboration tool like confluence to post these questions with access control for privacy. I agree you need to have past data to do this now. If data is not there then group interview or email based feedback or chaos monkey based feedback might work",
              "score": 1,
              "created_utc": "2026-02-05 07:42:23",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4ddgnf",
                  "author": "rockandroll01",
                  "text": "would you be able to provide me with any sample/example I can relate to?",
                  "score": 1,
                  "created_utc": "2026-02-09 03:15:56",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3oq312",
          "author": "Overall_Tangerine494",
          "text": "I’ve tried to flip the questions to more of a ‘feeling’ rather than the standard questions. So for what went well, change to what made you happy with…, what to avoid, change to what made you frustrated etc. I found people engaged more and could then flip their responses to fit the usual questions.\n\nWe also used digital whiteboard, like Miro, so people could collaborate and also left open after the session in case something came to mind in a day or two",
          "score": 3,
          "created_utc": "2026-02-05 08:48:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ryy0k",
          "author": "More_Law6245",
          "text": "I would suggest using a lessons learned log which is used through out the project's lifecycle because you capture what is working and what needs more focus and attention in real time. You're not relying on a post function to undertake KPI assessment after the fact. Also stakeholders have already moved on to their next project so this would be perceived administration overhead or provides no benefit to the stakeholder so you will not get buy in or the participation you would expect and it's the very reason on why project managers should be using the lesson learned log because you don't get caught at the end of the project without any analytical performance data. \n\nJust an armchair perspective. ",
          "score": 3,
          "created_utc": "2026-02-05 20:05:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3oi490",
          "author": "phobos2deimos",
          "text": "By far most effective imo is  quick 1:1 calls/hallway chats as soon as possible.  Usually that’s the most honest and most real feedback.  Group live meeting is also ok, I usually work it into an existing team meeting as others won’t appreciate a separate meeting just to give feedback that they’re done caring about.",
          "score": 2,
          "created_utc": "2026-02-05 07:33:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3v9pcx",
          "author": "dhemantech",
          "text": "Meetings have worked for me where the agenda was made explicit that the intent was to improve. Expect these meetings to get a bit heated when they are cross functional.",
          "score": 1,
          "created_utc": "2026-02-06 08:15:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ohtlt",
          "author": "Important-Union5181",
          "text": "I think as a PM you should be coming up with the answers to these questions and then presenting them to the team for feedback. These days digital project tracking should be able to give this retro using KPI(s) and SLA(s) easily. Most PM tools like JIRA or Project offers you various reports that you can use. Some KPI(s) to present can be :\n\nRelease Productivity: Points completed in release \n\nRelease Efficiency : Points completed Vs planned in the release \n\nRelease Quality : Bug Arrival, Active Bugs, Bugs Fixed Vs Arrived etc",
          "score": 1,
          "created_utc": "2026-02-05 07:30:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4deafj",
              "author": "rockandroll01",
              "text": "I was thrown in as PM when most of dev was already underway. At one point it felt like damage control than anything else.  \n\nManagement have fancy ideas, but how to implement them gets dumped on PMs, without understanding the ground reality.  Worst is, no preventive actions are taken (which is is more of a human behavior issue than process) . I did lessons learned for some of last few projects, with word from management. I am glad that now management wants to have a retro in place, but no one has a valid answer on what they want to do with this information. ",
              "score": 1,
              "created_utc": "2026-02-09 03:20:29",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r0k8r2",
      "title": "Program Managing a Tech Transformation",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1r0k8r2/program_managing_a_tech_transformation/",
      "author": "Spiritual_Mistake579",
      "created_utc": "2026-02-09 23:25:17",
      "score": 7,
      "num_comments": 6,
      "upvote_ratio": 0.9,
      "text": "I have been in a program manager role for our cloud native transformation. This has been easily the most challenging year of my life and every day I feel like I am failing. Anyone else running a program like this? How are you surviving? Biggest challenging is not being able to keep up with how fast things move, and constant disconnects at the leadership level also very difficult to keep up with. ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/projectmanagement/comments/1r0k8r2/program_managing_a_tech_transformation/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o4j9k8s",
          "author": "More_Law6245",
          "text": "Firstly, take a breath as this is pretty typical for some program manager roles and it may also be further complicated by low organisational maturity in the project delivery framework, particularly when it comes to roles and responsibilities within the program. I have found in the past when I've auditing organisations the key disconnect was the communication paths along with expectations around when and what was being communicated. \n\nI might suggest is work with your leadership team and find out what is and is not working for them and work backwards from there to see if it's a process or procedure issue. Assess the communication paths and the right information being conveyed in the appropriate format and frequency.  As an example I had audited one program where the program manager was literally cutting an pasting from technical resource documentation for executive reporting and the executive where not reading or responding because A) it was too technical for them B) the exec were unsure on what the PM was communicating and what he was expecting C) the exec where to embarrassed to say anything and that they didn't understand it and to cap it off all under a compressed timeframe. Long story short a total disconnect and the impact was key decision were not being made on the program's critical path.  \n\nSimplification is your answer, if things are moving quickly you need understand why, was the business case fit for purpose? The golden rule is the amount of variation is a quality indicator on the business case (and  project plan) focus on the control your triple constraint of time, cost and scope. If there are a lot of changes then you need to ask why? Was the scope and requirements captured correctly? Are you rushing to meet a timeline or expectation? Who is accepting the risk of that? If there is scope change you need to ultimately understand and control it. Also understanding why and who is making changes, start setting expectations and enforcing the triple constraint e.g. if scope changes, then so does time and cost! It's also a very simple litmus test to see if the change is really warranted if you highlight it's impact of it's going to take more time and money on a whim, you find out very quickly if a RFC is really needed or not. \n\nYour project controls of issues and risk coupled with your status reporting should realistically be painting a very clear picture and highlight the amount of variation or change that is occurring. But with that said you also need to enforce roles and responsibilities in order to control the unscheduled changes. I suppose the key question I have, did you have an approved baseline program of work? and are you only just managing the exceptions?  \n\nJust an armchair perspective.  ",
          "score": 6,
          "created_utc": "2026-02-10 01:03:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4j19n4",
          "author": "Unusual_Ad5663",
          "text": "Complex programs have caused a lot of sleepless nights. You said you’re having trouble keeping up. Been there. What helped was shifting from “keep up” mode to getting ahead of leadership disconnects. The big aha was realizing the disconnect was ours, not theirs. Once we owned that, it changed how, what, and when we communicated, and we became much more intentional about the role we needed them to play.\n\nI learned a lot from the ROPE framework on managing up.",
          "score": 4,
          "created_utc": "2026-02-10 00:16:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ofvz6",
              "author": "weareabassi",
              "text": "Where can I learn more about this framework?",
              "score": 1,
              "created_utc": "2026-02-10 20:28:10",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4oddgd",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 5,
          "created_utc": "2026-02-10 20:16:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4qjnp5",
              "author": "Passionfruit4Life",
              "text": "This is an absolutely incredible comment and gave me such hope and perspective as I am managing a similar project to OP, and constantly feel like I’m drowning and failing. But every time I am able to drive a decision, I see the light.  So this really resonates. It’s less about managing the delivery as you said, which feels so counter intuitive as I’m so execution focused, but this requires a heavier level of governance and oversight, and less on the actual delivery managing.",
              "score": 1,
              "created_utc": "2026-02-11 03:19:37",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4nvu6b",
          "author": "Magnet2025",
          "text": "Have there been any analysis of the impact to the users of this transformation? \n\nThis is something that needs to be addressed to avoid post-implementation challenges.",
          "score": 1,
          "created_utc": "2026-02-10 18:55:02",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qxfofe",
      "title": "Plan on a page - software",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1qxfofe/plan_on_a_page_software/",
      "author": "Amax101",
      "created_utc": "2026-02-06 11:58:10",
      "score": 4,
      "num_comments": 5,
      "upvote_ratio": 0.83,
      "text": "I used to use Microsoft office timeline pro + to create project plan plan on a page.\n\nHowever this attachment has been blocked at work and   won’t approve the use of this.\n\nDoes anyone else have any useful tools (free preferably) or useful tricks, to make plan on a page with minimal effort and admin.\n\nPlease do not try and shill me your tools or use any salesman tactics - genuine advice please!!",
      "is_original_content": false,
      "link_flair_text": "General",
      "permalink": "https://reddit.com/r/projectmanagement/comments/1qxfofe/plan_on_a_page_software/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o3vyfez",
          "author": "AutoModerator",
          "text": "Attention everyone, just because this is a post about software or tools, does not mean that you can violate the sub's 'no self-promotion, no advertising, or no soliciting' rule.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/projectmanagement) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-06 11:58:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3w089m",
          "author": "Awkward_Blueberry740",
          "text": "So they aren't letting you use Microsoft planner which is the supported tool for the task you're trying to do? \n\nI mean you can use P6 or Project, both of which have extra costs and would be overkill for a one page Gantt chart. \n\nYou could use excel but it wouldn't look great. \n\nI'm sure there are other random tools out there that will create a nice looking graphic for you, but will your IT dept let you just install whatever if they're not letting you use the microsoft timeline feature?",
          "score": 1,
          "created_utc": "2026-02-06 12:11:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o46ev8u",
          "author": "karlitooo",
          "text": "What’s your project schedule data stored in? Nicest poap I’ve seen recently was a custom macro on top of ms project. \n\nYou could get Claude to create one from excel and build a ppt file but IT probably wouldn’t like that and you’d really want to obfuscate the task names before sending that data to anthropic (or any third party).\n\nBut yeah depends what tools your IT dept lets you use.",
          "score": 1,
          "created_utc": "2026-02-08 01:16:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o40146z",
          "author": "The_Solution_Starter",
          "text": "When you say 'Plan on a Page,' are you looking for a Project Status report on a page (budget, risks, issues, high-level Gantt, status commentary) or just a Gantt chart?\n\nDepending on your setup, here are a few ways if you don't want to use Excel or similar tool:\nFor a visual Dashboard: Try Power BI Desktop. It’s free and allows you to create a professional 'Plan on a Page' that you can refresh and export as a PDF. It's much more 'executive-friendly' than Excel, though it does require an install.\n\nFor a 'Free' Gantt Chart (M365): If your org uses Microsoft 365, use a SharePoint List. You can switch the view to 'Gantt Chart' by mapping your start and due date columns. It’s built-in and easy to share.\n\nIf you have installation restrictions: Stick to PowerPoint. It’s more manual, but it’s often the best tool for a high-level visual summary if you can't use Power BI.\n\nIf you have M365, the SharePoint List route is usually the quickest 'quick win' for a clean timeline. However, if you want dependency on the Gantt View, you will need to add JSON formatting.",
          "score": 0,
          "created_utc": "2026-02-07 00:38:47",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}