{
  "metadata": {
    "last_updated": "2026-03-02 09:15:17",
    "time_filter": "week",
    "subreddit": "projectmanagement",
    "total_items": 20,
    "total_comments": 255,
    "file_size_bytes": 252237
  },
  "items": [
    {
      "id": "1rg8t6n",
      "title": "got caught in the middle of a stakeholder screaming match and i just froze",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1rg8t6n/got_caught_in_the_middle_of_a_stakeholder/",
      "author": "Prior_Statement_6902",
      "created_utc": "2026-02-27 14:54:08",
      "score": 223,
      "num_comments": 100,
      "upvote_ratio": 0.98,
      "text": "today was a disaster for me.there was facilitating a meeting and two senior directors started going over the project scope. they were throwing out totally contradictory requirements and then both turned to me and asked which one \"we had agreed on\" last month. i couldn't find the meeting minutes fast enough and i just started stuttering like i dont belong here. i looked like i wasnt even in control of my own project. i felt so small. its so hard to manage big personalities when you can't recall every single random decision in a split second. any tips for staying 'authoritative' when people are losing their minds?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/projectmanagement/comments/1rg8t6n/got_caught_in_the_middle_of_a_stakeholder/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o7tn80a",
          "author": "JudeBootswiththefur",
          "text": "‘Give me a moment while I look up the specifics.’ You live and learn, don’t beat yourself up, it’s not worth it.",
          "score": 68,
          "created_utc": "2026-02-28 03:53:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7uqy99",
              "author": "AxisWavesBack",
              "text": "Totally.",
              "score": 5,
              "created_utc": "2026-02-28 09:25:30",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7rmpon",
          "author": "somethingweirder",
          "text": "Channel your inner old cranky receptionist. “Give me a minute to find the information that you both agreed to.” and be a broken record repeating yourself until they leave you alone enough to find what you need. \n\nAlso breathing and remembering that this is just a job it’s not a personal attack and that these people are assholes and deserve to be treated as such. \n\nNo one will die. It’s relatively low stakes for you - it’s not your giant investment on the line right?\n\nYes having steady work is incredibly important but it’s unlikely they’ll fire you for being stern with them. Honestly people with big personalities sometimes seem like they’d respond poorly to it but actually respect the hell out of it.",
          "score": 45,
          "created_utc": "2026-02-27 20:54:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o86wnb6",
              "author": "awful_waffle_falafel",
              "text": "I used to work high end niche retail and we had this one customer who was a nightmare. Rude, demanding, overbearing. But spent a lot of money so everyone teated her nicely.\n\n\nI am no-nonsense when I feel in control of my environment and would be borderline unacceptably rude to her (I'm normally pretty gracious and agreeable in a work environment). Took no shit. Called her on it. Guess who was her favourite employee to deal with? ",
              "score": 1,
              "created_utc": "2026-03-02 07:07:51",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7t01ca",
          "author": "arsenal_pianist",
          "text": "When the yelling starts, the listening has stopped. \nPause the meeting. Coffee / water break. Insist on leaving the room. You are the one in control that way. If they won't leave, you should. It also gives you a chance to breathe and check your notes.",
          "score": 34,
          "created_utc": "2026-02-28 01:26:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7uh2by",
          "author": "LowPea2461",
          "text": "When I first started in pm, I was trained by an awesome project director. His brain type meant he could remember dates, facts and figures from 10 years ago right off the top of his head. So I thought I should be able to do the same. But my brain doesn’t remember things like that. It remembers emotions. \n\nAfter a few early situations where I didn’t know the answer to core questions in meetings, I started devising a system for myself that my boss didn’t need, so didn’t teach me. \n\nIt meant a bit of extra work for me, but made my life a lot easier and made me much more confident in the answers I gave. I would basically have a small project bible that had a page of budget/cashflow figures, minutes from key meetings, decision/action log, change control log, and other key stuff relevant at that point in time. It would need updating at least once a week, maybe more. But I always had the info on me, easily accessible, where I could say, ‘let me check’.\n\nDevising a personal info system might be helpful for you too?",
          "score": 30,
          "created_utc": "2026-02-28 07:54:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7q19qx",
          "author": "Goggio",
          "text": "Next time dont talk.\n\nBreathe. Let a moment pass. SLOWLY AND DELIBERATELY look through your notes to find the answer.\n\nIf they rush you, without emotion state, if i rush I may miss the answer and this is too important to the company for me to take that risk.",
          "score": 27,
          "created_utc": "2026-02-27 16:17:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7q1u3i",
              "author": "Ninesect",
              "text": "Im so glad I read this sub for comments like this. That is an awesome response to have in the back pocket. Thank you!",
              "score": 6,
              "created_utc": "2026-02-27 16:20:07",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7wuqu0",
                  "author": "Goggio",
                  "text": "Thanks! Someone wiser than me asked one time, \"do you want the right answer or an answer right now?\" \n\nStuck with me 15 years later.",
                  "score": 1,
                  "created_utc": "2026-02-28 17:38:34",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7qsv4u",
          "author": "1z1z2x2x3c3c4v4v",
          "text": ">  i couldn't find the meeting minutes fast enough\n\nDid you find them at all?  \n\nIn the end, it sounds like there is some serious disagreement on scope or deliverables.    You should set a meeting with both of them, ASAP, separately, and identify what they want included in the scope.  Then you figure out whether you can include them or not.     \n\nHandle it like you would any child who was fighting over a toy.",
          "score": 28,
          "created_utc": "2026-02-27 18:27:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7r7twm",
              "author": "mf0723",
              "text": "When I was fairly new in my last job, my manager complimented me for how calm I stayed in a situation quite similar to the one OP is describing. I jokingly said back to her that I was very well prepared because I had ten years of experience of working in preschool settings - over my time in that job, I realized it was not a joke... \n\nThere were many times that I thought to myself that of all my relevant career experience - PM, technical, healthcare - the preschool experience was the most helpful! \n\nCommunication lessons I taught (explicitly and implicitly) in preschool that helped me out with adults more than I thought would ever be necessary:\n\n- T.H.I.N.K.: is True, Helpful, Informational, Necessary, and Kind? \n- Pause and Breathe: Before responding, take a brief, conscious pause to calm your mind and consider the impact of your words.\n- Active Listening: Focus entirely on the speaker's words, tone, and body language to fully understand their perspective before reacting.\n- Evaluate Intent: What is the goal of this statement? (Mine, and others')\n- Be Mindful: Consider the context of the conversation and the listener's feelings to adapt your message.\n\nEdited for formatting.",
              "score": 13,
              "created_utc": "2026-02-27 19:39:43",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7s9dh4",
                  "author": "Trickycoolj",
                  "text": "I worked with a former early grades elementary teacher and omg the way she could command the room\nLeading workshops with senior leaders that were notorious for going way off topic, off schedule, off agenda    She was so impressive! You could watch the classroom management skills take over like second nature and the middle aged adults her own parents’ age just fall in line without realizing it. Beautiful! The funny thing was, she hated teaching adults because they’re not receptive and open minded to new concepts and feedback like the age 5-10 crowd is.",
                  "score": 1,
                  "created_utc": "2026-02-27 22:50:49",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o7r6msz",
              "author": "Outrageous-Pizza-66",
              "text": "If the initial meeting was about the Project Scope, and you weren't prepared, then Lesson to you, be prepared.   If the meeting was derailed by the \"Who's right about the Project Scope\" then totally agree.  End the Conversation, Call a follow up meeting to discuss the Project Scope.  Then be prepared to discuss the signed off/agreed Project Scope and any updates since sign off.  If Stakeholders want to change the scope, then fine, document the changes and present them with a change request outlining the changes and any additions to work/schedule/timeline.  ",
              "score": 2,
              "created_utc": "2026-02-27 19:33:44",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7tfffu",
          "author": "Osiris_Raphious",
          "text": "Sometimes you have to be a teach in the kindergarten, and remind fully grown adults that we are all here to make this work, compromise etc etc etc\n\nAnd that if they cant have a reasonable conversation maybe its time for a recess to cool off, and reassess our prioroties and cool off...",
          "score": 29,
          "created_utc": "2026-02-28 03:03:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7prgcc",
          "author": "_Number_9_",
          "text": "Calmly, slowly, leave a pause for them to stop trying to commandeer the conversation, then with total control of the tone of your voice: \n\"There are a lot of data on jobs like this. One can't possibly memorize every decision. This is why we keep notes. I have minutes from those meetings, and I will consult them after this meeting and circulate the answer. \" ",
          "score": 21,
          "created_utc": "2026-02-27 15:30:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7spuk4",
          "author": "ConstructionNo1511",
          "text": "I use a decision log. You should too- and then bookmark it",
          "score": 21,
          "created_utc": "2026-02-28 00:25:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7q85b1",
          "author": "BadassSasquatch",
          "text": "It's only a failure if you don't learn. There are some great tips in the comments already. I would say it's not your position to be 'authoritative' but to make sure everyone has the necessary resources to do their job, to clearly define the objectives, and to ensure everyone completes tasks on time. ",
          "score": 20,
          "created_utc": "2026-02-27 16:49:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7sdfzg",
          "author": "More_Law6245",
          "text": "I wish I had $100 for every pissing match I had to referee over my career, I would actually give Elon Musk a run for his money.  To be really honest, every PM will experience the same thing at some point in their career but you should remember this as a really important lessons learned for yourself. \n\nThis is the very reason on why you keep a decisions register as a project artefact. Is it an administration overhead? Oh hell yes but does it stop stupid and childish arguments like this? Hell yes. It might be the first time you've felt like a deer in headlights and I assure you it definitely won't be the last, it's what you actually learn from your experience that will make you a better PM. And if you choose not to take anything away from it and you're still expecting a different outcome, then that is the very definition of insanity. Just a reflection point for your consideration. \n\nJust an armchair perspective. ",
          "score": 17,
          "created_utc": "2026-02-27 23:13:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7q3twl",
          "author": "Aggravating_Hippo546",
          "text": "That’s when you say, “hey you are both very passionate about XYZ, let’s take a break from this so I can gather some information, speak with both of you and we can come to a solution together.” Do NOT engage them while they are both hot. Let them calm down. Sometimes that allows time to see things the other way and get to a compromise.",
          "score": 37,
          "created_utc": "2026-02-27 16:29:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7q461j",
              "author": "dubujj",
              "text": "This is the advice you need to take. You’re not going to get anywhere in the moment - recognize, and step back with a calm plan for resolution.",
              "score": 10,
              "created_utc": "2026-02-27 16:31:07",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o7qgkvs",
              "author": "Irritant40",
              "text": "100% this.\n\nIgnore the condescending comments from others about \"don't you send minutes / don't you have an action log\" etc. \n\nnever allow screaming matches to continue, or if they insist then excuse yourself. Get a cup of tea and come back in ten minutes.",
              "score": 7,
              "created_utc": "2026-02-27 17:29:29",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o7s0cxm",
              "author": "BearyTechie",
              "text": ">“hey you are both very passionate about XYZ, let’s take a break from this so I can gather some information, speak with both of you and we can come to a solution together.”\n\nDuring a screaming match between Sr. Directors, I don't think anybody says a word unless they have authority or influence",
              "score": 2,
              "created_utc": "2026-02-27 22:02:51",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7s2u95",
                  "author": "Aggravating_Hippo546",
                  "text": "And as PM you should have that. You are after all the driver of those strategic initiatives.",
                  "score": 2,
                  "created_utc": "2026-02-27 22:15:50",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7q389p",
          "author": "Gadshill",
          "text": "The question was rhetorical, not a real question.   They probably didn’t have an agreement last time if none of you can remember.   Focus on building consensus now, regardless of what happened in the past.",
          "score": 16,
          "created_utc": "2026-02-27 16:26:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7qd9tz",
              "author": "BearyTechie",
              "text": "I was reading through the comments in this thread about sending meeting minutes, transcriptions, and ChatGPT summaries, hoping to find an answer like this.\n\nMost of the time, PMs are forced to document as many details as they can, hoping it will protect them and the project. However, the real risk to this project is the disagreement between the Directors and the level of influence they have.",
              "score": 7,
              "created_utc": "2026-02-27 17:13:47",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7plu4h",
          "author": "vespatic",
          "text": "don't react to the attitude, just say 'I will look for the minutes and come back to you'. if they expect an immediate answer and you cannot do it, don't give in, just reiterate that you want to consult the minutes before answering.",
          "score": 14,
          "created_utc": "2026-02-27 15:03:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o803eed",
          "author": "psycheslament",
          "text": "I put all project documentation in Notebook LM so I can type in questions like this and get an immediate answer.",
          "score": 14,
          "created_utc": "2026-03-01 04:45:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o81njsy",
          "author": "TheKaizokuSenpai",
          "text": "tell them to shut the hell up as you look for the meeting minutes. if you find it, tell them what was agreed on in the month prior. \n\nif you can’t find it, tell them it’s time to re-prioritize the right way and discuss how to move forward and stick to it with a plan.\n\nalso remember, none of these projects matter at the end of the day it’s all fake so don’t stress it’s just work💀",
          "score": 15,
          "created_utc": "2026-03-01 12:59:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ppwo1",
          "author": "elegant_eagle_egg",
          "text": "1. Memorize everything in your capacity \n2. Use “Give me a moment,” breathe, search, say “let me get back to you right after this meeting” in worst case scenario\n3. Never speak too quickly in moments like these",
          "score": 14,
          "created_utc": "2026-02-27 15:23:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7pqkjw",
              "author": "Civil_Assembler",
              "text": "Fully agree, only thing I would add is get organized. Your meeting notes should be accessible.",
              "score": 2,
              "created_utc": "2026-02-27 15:26:16",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7sfxmj",
          "author": "idrisivy",
          "text": "I have a decision section in my meeting notes. If it’s a major decision I might add it to the smartsheet as well as its own row with DECISION and the date and highlight decisions as its own color",
          "score": 14,
          "created_utc": "2026-02-27 23:27:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7pt0cf",
          "author": "AllowMeToFangirl",
          "text": "It’s okay to take the temp of the room and say, yes let’s take a look at the notes, how about we take a quick break so folks can take a bathroom break or get a cup of coffee and I will pull the notes for that specific discussion in the meantime.",
          "score": 28,
          "created_utc": "2026-02-27 15:38:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7puz62",
              "author": "Elleasea",
              "text": "Holding onto this one for the future.",
              "score": 5,
              "created_utc": "2026-02-27 15:47:30",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o7pwvb5",
              "author": "TossASalad4UrWitcher",
              "text": "Yes, excellent advice. De-escalation and massaging hurt fee-fees is an art in itself. ",
              "score": 3,
              "created_utc": "2026-02-27 15:56:34",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7pwnx7",
          "author": "m3ngnificient",
          "text": "That's fine. Don't beat yourself up for it. Make sure you have an RTM and a kdd list. If you can't pull it up immediately I'm demand, just tell them you need some time to find it, and that should be okay.",
          "score": 12,
          "created_utc": "2026-02-27 15:55:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7qpk03",
          "author": "AzoxWasTaken",
          "text": "If they start yelling, just stop the meeting. 'it seems like we need to align on this offline.' dont let them bully you into picking a side on the spot.",
          "score": 27,
          "created_utc": "2026-02-27 18:12:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7pviz3",
          "author": "No_Caramel_1782",
          "text": "I like to be Jimmy Carter. What do we agree on? Let’s start there. Table the discussion on the conflicting items until you can reference what was previously agreed to. And next time be organized before the discussion. That’s your job bro.\n\nEdit: and put everything in writing even if you have to recap it: per our conversation",
          "score": 12,
          "created_utc": "2026-02-27 15:50:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7qk7ju",
          "author": "chuckthunder23",
          "text": "I’ve seen stuff like this. If you cannot find the notes right away, try to de escalate and say let me look into this and get the warring parties together offline after you have definitive information.",
          "score": 10,
          "created_utc": "2026-02-27 17:46:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7qmbd0",
          "author": "InfluenceTrue4121",
          "text": "You need to be better prepared for the meeting and always have an agenda. If you are discussing scope, have the reqs documented pulled. If this was a meeting about something else, tell them you are putting this in a parking lot and will schedule a separate meeting to clarify scope. \n\nDon’t be too hard on yourself. Everyone has a moment where they lose control of the meeting. The key is to be prepared.",
          "score": 10,
          "created_utc": "2026-02-27 17:56:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7smpbh",
              "author": "LameBMX",
              "text": "review your stuff and refresh before meetings.",
              "score": 1,
              "created_utc": "2026-02-28 00:07:12",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7qohrb",
          "author": "TylertheDouche",
          "text": "it's the easiest thing in the world to just admit you don't have the meeting minutes. speak confidently and concisely. don't tell a whole story about how the dog ate your homework: \n\n*I don't have the meeting minutes from last meeting. I'll connect with you after the call with those decisions.*  it's 100x better than fumbling around\n\n if anyone is an asshole enough to question why you don't have them, confidently own your mistake. *yep, sorry I just don't have them. I should have had them. that's on me.*",
          "score": 10,
          "created_utc": "2026-02-27 18:07:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7qsq29",
          "author": "Magnet2025",
          "text": "I  blessed with a near photographic memory and I take notes. Printing in a notebook. \n\nI’ve been there. It’s unprofessional for them to lose control in a meeting. Whether or not you could produce the notes at the snap of a finger isn’t the issue. \n\nThe issue is two senior people not being able to control their tempers. \n\nMy recommendation: Find the notes. Then do a short PowerPoint with the notes, and how whatever director “won” impacts the project. Also present “if we take the other direction, this is what it looks like.”\n\nSchedule a meeting. Face to face is best, but Teams is fine.",
          "score": 11,
          "created_utc": "2026-02-27 18:26:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7qua2g",
          "author": "cbelt3",
          "text": "Omg yes…. Some owners and stakeholders love to yell about anything. Just stand your ground and de-escalate.\n\nAs a young defense project engineer I had my CEO scream at me in a meeting about project scope. I looked around. Then yelled back. Turned out it was his “style” to test the new guy. \n\nYes, he was a jerk.",
          "score": 27,
          "created_utc": "2026-02-27 18:34:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7vm8ok",
          "author": "Dry_Blackberry2190",
          "text": "Ok so what did you learn? From your post I learn to keep myself a cheat sheet with references for scope of work.  Also the contract readily available, as it should always be?",
          "score": 26,
          "created_utc": "2026-02-28 13:44:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7utazy",
          "author": "LonelyExercise1422",
          "text": "Sounds like my everyday, unfortunately. Chaos and a lack of clarity are bread and butter for senior managers.",
          "score": 8,
          "created_utc": "2026-02-28 09:49:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7pny4b",
          "author": "sgt_stitch",
          "text": "I’ve completely hit a wall and been unable to find any words while presenting a position paper to senior leadership and been given difficult/nuances/detailed questioning. \n\nWe’re human and this job is very high pressure and high stress some time. It happens. \n\nI was lucky with some colleagues who jumped in after a moment of silence while I did a ctrl-alt-delete on my brain. \n\nIve learnt that it’s completely OK to say “I’m sorry I don’t know that off the top of my head, I’ll need to look into it and get back to you”\n\nIf someone gave you that answer to you, then I’m sure you would be happy with that?",
          "score": 7,
          "created_utc": "2026-02-27 15:13:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7pwckk",
          "author": "Immediate-Actuator85",
          "text": "In theory (because I know things get messy in real life) As a first step in any project, define it in a project charter before the meetings even start. Work with the project sponsor/owner on drafting it and include defined scope in the document. Distribute it for comments.\n\nThe person who owns the project should be the sponsor, owner, client (will have to live with it when it is done) gets first dibs/priority on what the scope should be imo. Everyone else is noise.\n\nAs for remaining authoritative, calmly say, “ let’s address that point off line” and move on to the next agenda topic.",
          "score": 8,
          "created_utc": "2026-02-27 15:54:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7qpgg4",
          "author": "Proof_Independent_45",
          "text": "You’re not alone, review pressure can block recall. It’s usually a stress response, not lack of knowledge. Practicing explaining fundamentals repeatedly helps build confidence.",
          "score": 8,
          "created_utc": "2026-02-27 18:11:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7soegk",
          "author": "everettmarm",
          "text": "The correct response was to admonish the stakeholders to simmer down. Diplomatically. It will buy time to look up the minutes.  If you have supposed professionals acting like divas, it’s totally appropriate for a PM to enforce team norms and ask for a reset.",
          "score": 8,
          "created_utc": "2026-02-28 00:17:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7qiu9b",
          "author": "BjornBjornovic",
          "text": "Don’t have important calls on Fridays (if call was in fact today)",
          "score": 7,
          "created_utc": "2026-02-27 17:40:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7qpdes",
          "author": "BusinessPristine9249",
          "text": "this is why you always send a summary email after every call. if its not in the email, it didnt happen. just point them to the paper trail",
          "score": 8,
          "created_utc": "2026-02-27 18:11:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7scpf2",
          "author": "Visual_Strength8972",
          "text": "I was managing a large North American implementation when one group was flagged as high risk to our steering committee for underdelivering.\n\nOur recovery plan was hands-on support. During a call with their team, we discovered the real issue: they had been given incorrect and incomplete information.\n\nI messaged their lead to join and help us resolve it. When she joined the 20-person call, she immediately went ballistic and screamed at me.\n\nIn that moment, I knew her outburst wasn’t personal, it was a symptom of her own stress and frustration. Still, I held my ground. I told her the behavior was unacceptable and that screaming at me wouldn’t fix her problems.\n\nI ended the call focused on the solution, not the drama.\n\nNever lose sight of your project goal. That is the bottom line.",
          "score": 7,
          "created_utc": "2026-02-27 23:09:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7q5yu9",
          "author": "Seth_Imperator",
          "text": "You dont send minutes decisions to everyone after the meeting ? And no document/excel open to follow-up tasks? I always try to open everything that has a high probability of being useful",
          "score": 28,
          "created_utc": "2026-02-27 16:39:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7qa8fd",
              "author": "unknown-one",
              "text": "this needs to be top comment\n\nyou send mm after meeting, if soemone disagrees they have few days to comment otherwise what is written is agreen. and you will avoid situations that nobody includin PM doesn't know what's going on",
              "score": 7,
              "created_utc": "2026-02-27 16:59:21",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o7q6tfz",
              "author": "destonomos",
              "text": "This. I just record the teams meetings and then have ChatGPT summarize it.\n\nEveryone forgets everything andas a pm its ourjob to remind people over and over.",
              "score": 3,
              "created_utc": "2026-02-27 16:43:31",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7sqi8m",
                  "author": "ConstructionNo1511",
                  "text": "I call myself a professional botherer",
                  "score": 2,
                  "created_utc": "2026-02-28 00:29:27",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o7sqes4",
              "author": "ConstructionNo1511",
              "text": "Same",
              "score": 1,
              "created_utc": "2026-02-28 00:28:54",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7q1c0y",
          "author": "emptyfree",
          "text": "First off, don't beat yourself up. We've all been there.\n\nIf possible, record the meetings with a transcriber. For recurring meetings, run the previous meeting's transcript through Co-Pilot/Chat-GPT/AI-LLM-of-your-choice to get a reminder for your own sake of where the last meeting left off, and what the to-dos from that meeting actually were.\n\nNot sure of what kind of projects you manage or your company's stance on AI, so that may not be an option... the fallback is taking really good notes and reviewing them before the next meeting... and honestly, it's a good practice to do both, if possible!",
          "score": 12,
          "created_utc": "2026-02-27 16:17:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7psynm",
          "author": "Huck-Custard",
          "text": "No worries, often times open conflict is healthy for team development in senior leadership. It can make people uncomfortable, especially when they’re not on the team, but it builds long-term trust. However, they should have taken the disagreement offline. \n\nThe counterpoint is a room where no one feels open to speak their mind. You wouldn’t want that group steering your ship.\n\nI recommend reading The Five Dysfunctions of a Team by Patrick Lencioni. It’s a good case study of managing these things in a small group setting. The narrative style is an easy read.",
          "score": 6,
          "created_utc": "2026-02-27 15:37:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7qp56t",
          "author": "Public_Mortgage6241",
          "text": "man that sounds rough. i had a similar phase and started using huddlemate just to stay on top of the discussion. keeps all the key points handy so im not fumbling my words. definitely makes meetings feel way less like an interrogation",
          "score": 5,
          "created_utc": "2026-02-27 18:10:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7qnedj",
          "author": "eped123",
          "text": "Ya.  Immediately slow it down.  I mean call a break.  In that environment there is no finding an medium for agreement..\n\n\nThey were asking for you to take a side.  Adjourn so you can find the docs and return when cooler heads prevail..  ",
          "score": 5,
          "created_utc": "2026-02-27 18:02:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7sd12g",
          "author": "Lomasgo",
          "text": "I would call a stakeholder who is more senior than both of these two to settle the case.",
          "score": 3,
          "created_utc": "2026-02-27 23:11:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7t1zmj",
              "author": "Lethologica_",
              "text": "I would get my decisions register receipts out and talk to them like 5 year olds they're behaving as",
              "score": 3,
              "created_utc": "2026-02-28 01:39:20",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7pmiqx",
          "author": "beanandcod",
          "text": "Being a beginner PM is full of learning moments like this ive found. Have your notes next time. If things are flexible, determine the timeline based off of the work being done (timeline A is better than B even if we agreed on B last meeting because XYZ) but yeah being a PM is embarrassing and awkward it seems.",
          "score": 7,
          "created_utc": "2026-02-27 15:06:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o80c9fg",
          "author": "dank_shit_poster69",
          "text": "Therapy",
          "score": 6,
          "created_utc": "2026-03-01 05:52:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7qi1k0",
          "author": "surrealcrow",
          "text": "[ Removed by Reddit ]",
          "score": 3,
          "created_utc": "2026-02-27 17:36:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7qg7hj",
          "author": "Irritant40",
          "text": "Reasons copilot is essential for project managers.",
          "score": 8,
          "created_utc": "2026-02-27 17:27:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7qi6yt",
              "author": "Mokentroll22",
              "text": "YES",
              "score": 1,
              "created_utc": "2026-02-27 17:37:16",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o7sqcu0",
              "author": "ConstructionNo1511",
              "text": "Keep a decision log and make sure it’s open during the meeting on another screen. Don’t need any AI for that.",
              "score": 1,
              "created_utc": "2026-02-28 00:28:35",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7utm3b",
                  "author": "Irritant40",
                  "text": "Ok boomer",
                  "score": 1,
                  "created_utc": "2026-02-28 09:52:15",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o83k8hv",
          "author": "TheJoeCoastie",
          "text": "That moment of stuttering isn’t a competence failure; it’s a trap. Two people with contradictory memories put you on trial for their misalignment. That’s not your fault, and trying to recall on the spot is the wrong move anyway.\n\nThe most authoritative thing you can say in that moment: “I want to get this exactly right. Give me five minutes to pull the record before we go further.” Full stop. No apology.\n\nAuthority isn’t knowing everything instantly. It’s owning the process calmly when things get chaotic. A decision log you can open in 30 seconds is your best tool going forward.",
          "score": 7,
          "created_utc": "2026-03-01 18:53:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o85gxyv",
              "author": "No1uvConsequence",
              "text": "This feels very AI",
              "score": 3,
              "created_utc": "2026-03-02 01:03:00",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o85iw4i",
                  "author": "TheJoeCoastie",
                  "text": "I'll will take this as a huge complement. Thank you. However, no, it is not.",
                  "score": 1,
                  "created_utc": "2026-03-02 01:14:54",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7r6u2c",
          "author": "reynacdbjj",
          "text": "OP = zero situational awareness",
          "score": 9,
          "created_utc": "2026-02-27 19:34:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7sewns",
              "author": "More_Law6245",
              "text": "Situational awareness comes from experience, so if you never experience it then you will never be aware of it! OP was self aware enough to understand that their reaction or response could have been handled differently. This is a very good indication that a PM is self aware enough and is reaching out asking for assistance and guidance in order to learn. \n\nPM's don't come out fully minted out of the box as a well rounded and skilled professional, it comes from years of endless ongoing learning curves! ",
              "score": 16,
              "created_utc": "2026-02-27 23:21:50",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7skm0l",
                  "author": "reynacdbjj",
                  "text": "fight or flight",
                  "score": -2,
                  "created_utc": "2026-02-27 23:55:06",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7z8p72",
          "author": "corsair130",
          "text": "Watch this video to lighten the mood. \n\n[https://youtu.be/DYvhC\\_RdIwQ?si=cdrOkdm4k2IFAasJ](https://youtu.be/DYvhC_RdIwQ?si=cdrOkdm4k2IFAasJ)",
          "score": 2,
          "created_utc": "2026-03-01 01:26:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o82pfw8",
          "author": "Historical_Baby5774",
          "text": "As someone who does this at a senior level for a career, I say this firmly but kindly, are you new to this role? You should not have been given this role if you cannot handle scenarios like this, let alone the fact that your post is poorly written. A PM would have shut that down immediately. \n\nWhich makes me wonder if this is just a fake engagement post. \n\nIf this is legit, pursue training and mentorship from your leader immediately.",
          "score": 4,
          "created_utc": "2026-03-01 16:28:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7tatuv",
          "author": "Logical-Bookkeeper77",
          "text": "Eh, you don’t have an updated business requirement / business case ready?\n\nAnd you should be the person who’s most knowledgeable on what the project is doing aka “requirements / objectives”\n\nThere’s decision log, requirement documents,change logs, that pm shiuld stay on top of.",
          "score": 3,
          "created_utc": "2026-02-28 02:34:24",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rdw3hz",
      "title": "Starting to think no amount of data actually changes a leadership decision that's already been made.",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1rdw3hz/starting_to_think_no_amount_of_data_actually/",
      "author": "eastwindtoday",
      "created_utc": "2026-02-24 23:11:29",
      "score": 77,
      "num_comments": 37,
      "upvote_ratio": 1.0,
      "text": "Been managing cross functional projects for a while and I'm starting to question something I used to believe pretty firmly.  \n  \nBeen leaning into AI more for the ideation side of my job and genuinely it's helped. Synthesizing customer feedback, pulling patterns from call transcripts, getting to sharper priorities faster. The inputs are better than they've ever been atleast for the most part.\n\nStill I keep hitting the same wall I have hit in most aspects of my roles. Someone senior has already decided what the quarter looks like and the data doesn't really matter at that point.I'm trying to sort out what data or insights would drive meaningful prioritization decisions.\n\nSo I'm starting to wonder if the whole \"be more data driven\" thing is just something we tell ourselves to feel better about a process that's actually just politics and whoever talked to the CEO last.\n\nWould love to be proved me wrong. Is there a tooling or approach that's actually shifted this dynamic for you or is everyone just quietly dealing with the same thing until they are leadership haha.",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/projectmanagement/comments/1rdw3hz/starting_to_think_no_amount_of_data_actually/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o787ugw",
          "author": "AutoModerator",
          "text": "Attention everyone, just because this is a post about software or tools, does not mean that you can violate the sub's 'no self-promotion, no advertising, or no soliciting' rule.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/projectmanagement) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-24 23:11:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o78n87n",
          "author": "More_Law6245",
          "text": "As a reflection point for your consideration,  as a project practitioner It's not your responsibility to make decisions (what you think or feel) on behalf of an organisation, as a project practitioner your responsibility is to provide the relevant data, information and the impact that it has to the relevant stakeholders to make an informed decision (rightly or wrongly).  If they choose not to follow your advice or guidance regardless of it be political or them being clueless, then that is on them; In which you can clearly show through your IT systems,  decision, issues and risk logs of business transactions that have occurred (or in a crude way of putting it, you have just covered your behind). \n\nIf you're documenting accordingly, particularly with decision making and the ownership of that, you have been diligent in your role as the PM (again, rightly or wrongly) but it's not your responsibility because your project board/sponsor/executive is ultimately responsible for the success of the project, as the project manager you're responsible for the day to day business transactions and the delivery quality of your project.  I would suggest or pose the question are you taking on responsibilities that is not yours? just a different perspective to think about. \n\nJust an armchair perspective. ",
          "score": 16,
          "created_utc": "2026-02-25 00:35:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7am0ur",
          "author": "Only_One_Kenobi",
          "text": "When you get into big corporations, absolutely everything is based on the top management's egos and quarterly bonuses. No data, reality or facts will ever be allowed to interfere with those.",
          "score": 15,
          "created_utc": "2026-02-25 08:38:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o78fwnz",
          "author": "Character-Start-7749",
          "text": "data doesnt change minds. stories do. i learned this after presenting maybe 15 perfectly built dashboards that got polite nods and zero action. what actually works is connecting the data to something the leader already cares about - their bonus their reputation their pet project.\n\nthe AI synthesis stuff is genuinely useful for pattern finding but the delivery is still a human skill that no dashboard can replace",
          "score": 12,
          "created_utc": "2026-02-24 23:55:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o78jhzz",
              "author": "eastwindtoday",
              "text": "The dashboard graveyard is real. Are you using AI at all to help frame that story before you walk in or is it still mostly manual work connecting the dots to what leadership cares about?",
              "score": 3,
              "created_utc": "2026-02-25 00:15:31",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o79oq8s",
                  "author": "Puzzleheaded_Fold466",
                  "text": "If you need AI to “frame” your narrative, it is a big problem.\n\nThis is one of the areas where skilled humans can vastly outperform LLM models. \n\nIf you find that AI bests your strategic vision and narrative, you really need to work on big picture storytelling. My hope is that you are relatively junior.\n\nIncidentally, your comment assumes that what you are presenting is the only information available to your leadership, and that your reports / presentations exhaustively include all the information available to make decisions.\n\nHowever, chances are that you represent a fraction of the information / data that they must consider in their decisions. You’re just not privy to it apparently.\n\nInstead of getting frustrated that they aren’t hearing you, maybe you should try hearing them and figuring out what are the other factors that are driving their decisions.\n\nThat will allow you to better anticipate their expectations and to adjust your message accordingly.",
                  "score": 2,
                  "created_utc": "2026-02-25 04:10:08",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7ald9z",
          "author": "Only_One_Kenobi",
          "text": "I got fired because a leadership decision caused major problems with a client project. The reason I was fired was because I told the leadership they were making the wrong decision and it would incur massive penalties.\n\nAfter firing me they continued with the decision, and when it inevitably caused the penalties, they just conveniently blamed me and pat themselves on the back for firing me.",
          "score": 9,
          "created_utc": "2026-02-25 08:32:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7bhuxb",
              "author": "destonomos",
              "text": "Learning management 101. At 40 i adapted and stopped owning issues and started weaponizing ignorance. Sure i have a networking degree and ccna but as a pm i just ask my IT departmnt why more often when I know the answer and a lightbulb went off.\n\nWhat i witnessed was thr IT department now absorbing issues i used to get blammed for and my life got demonstrably easier.\n\nIts a sad fact butthe sheep of the world are easily fooled so i now just look at departments and have them explain stuff to me i already know.\n\nI have a horrible project a seniorpm quoted. Anytime anything goes wrongi copy and paste the question with the gcs records of said pm saying what to do (that was wrong) a year ago and put my boss on copy. After the 5th issue he is singing a different tune about theproject.\n\nThe new game for me is owning nothing and shoving issues into other departments and weaponizing ignorance. I can play silo wars better because i know the war is going on AND i am 15 years battle hardened.",
              "score": 5,
              "created_utc": "2026-02-25 13:01:51",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7bn7jo",
                  "author": "1z1z2x2x3c3c4v4v",
                  "text": "Same.  I had an MCSE and CCNA... its funny what you know but they don't know you know, so you know.   Makes my job as an IT Infra PM so much easier now.",
                  "score": 1,
                  "created_utc": "2026-02-25 13:33:19",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o7bmvaj",
              "author": "1z1z2x2x3c3c4v4v",
              "text": "Yeah, that's how it works.\n\nKnowing this, what could you have done differently?  Did you learn anything from this?",
              "score": 3,
              "created_utc": "2026-02-25 13:31:23",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7bo0oo",
                  "author": "Only_One_Kenobi",
                  "text": "Ignore what the client wants and never push back against the CEO and what he wants. Compromise on all my morals, and completely ignore it when the top management are doing something extremely unethical. Directly lie to the client's, and completely disregard the contractual obligations.\n\nWhen shit inevitably strikes the fan, find a patsy to pile all the blame onto, then take credit for making the fake numbers look good",
                  "score": 8,
                  "created_utc": "2026-02-25 13:37:52",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7f6r8c",
          "author": "Stinky_Flower",
          "text": "Sometimes I miss working for a professional services & consulting firm. \n\nWe were somewhat immune to politics & egos, so could freely (but politely) push back on managers ignoring data driven insights, and we were often paid exorbitant amounts up front, so clients felt obligated to at least CONSIDER changing their mind if the data recommended that.",
          "score": 8,
          "created_utc": "2026-02-25 23:42:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7i1j97",
          "author": "Mammoth_Ad3712",
          "text": "I don’t think you’re wrong. A lot of “be data driven” really means “bring data that supports the direction we already like.”\n\nThe only time I’ve seen data actually change leadership’s mind is when it stops being abstract and starts becoming operationally painful.\n\nWe had a case like that around safety spend. Leadership wanted to trim part of the budget because on paper it looked like overhead. But we had enough structured reporting and follow-up history to show that the stuff they wanted to cut was tied directly to repeat issues, slow closeouts, and rising exposure in the field. Once it became “cut this and here’s the likely downstream hit,” the conversation changed fast.\n\nSo I’d say data works best when it’s tied to consequences leadership actually feels. If it stays as insight, politics wins. If it becomes risk with a price tag, people suddenly get very interested. Have to hit them where it hurts as to say.",
          "score": 8,
          "created_utc": "2026-02-26 12:06:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7cnpdf",
          "author": "LowSkyOrbit",
          "text": "Make the data correlate to dollars and you'll see how quickly top down things can change in a bad fiscal year.",
          "score": 6,
          "created_utc": "2026-02-25 16:33:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7aib65",
          "author": "Geminii27",
          "text": "This has been the case as long as there have been bosses.\n\nEither you learn how to persuade bosses to change their minds (usually by appealing to whatever it is on a per-person basis that they value more highly than their own ego, if there is anything), or you put up with eternally throwing hundreds of hours of work against brick walls.",
          "score": 3,
          "created_utc": "2026-02-25 08:03:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o78mjvb",
          "author": "Prestigious-Disk3158",
          "text": "Leadership decisions are based on hunches and gut feelings. It’s never been about data.",
          "score": 2,
          "created_utc": "2026-02-25 00:31:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o78c09w",
          "author": "hotprof",
          "text": "Things take time. Often, the results are already baked in at the start of the quarter.",
          "score": 1,
          "created_utc": "2026-02-24 23:33:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o78jwm2",
              "author": "eastwindtoday",
              "text": "So is the real leverage just owning quarterly planning better than anyone else in the room?",
              "score": 1,
              "created_utc": "2026-02-25 00:17:43",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o78ds98",
          "author": "bluealien78",
          "text": "It does matter if your company culture leans heavily into data-driven decisions. If it doesn’t, then it doesn’t. I’ve changed many a leadership decision based on data rather than feelings, but they’ve gotta want that too.",
          "score": 1,
          "created_utc": "2026-02-24 23:43:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o78jo0f",
              "author": "eastwindtoday",
              "text": "Fair point, with that how do you actually figure out if a company is genuinely data driven before you're already in the room realizing they're not?",
              "score": 1,
              "created_utc": "2026-02-25 00:16:25",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7a2bdb",
          "author": "balunstormhands",
          "text": "They only think in terms of money. If they make a decision that loses them money they'll soon change it. Otherwise...",
          "score": 1,
          "created_utc": "2026-02-25 05:46:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7bewh8",
          "author": "SettleF",
          "text": "Data almost never flips a decision in the meeting. It only works when it changes the question before the decision is “set.” Your job becomes pre-wiring the decision and making the tradeoffs explicit.",
          "score": 1,
          "created_utc": "2026-02-25 12:43:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7h6h93",
          "author": "FindingBalanceDaily",
          "text": "You are not wrong, once a direction feels set, more data rarely moves it. I have seen it help when insights come in earlier and are framed around risks or tradeoffs, not proving someone wrong. Culture at the top still matters more than any tool.",
          "score": 1,
          "created_utc": "2026-02-26 07:23:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o83ghmt",
          "author": "TheJoeCoastie",
          "text": "The frustration is real, and I’d argue you’re diagnosing it correctly.\n\nHere’s the reframe that’s helped me: data rarely changes a decision, but it can shift the conditions under which decisions get made. The senior leader who we think has already decided on their course of action is usually optimizing for something you don’t have full visibility into (political safety of self, a prior commitment, a relationship). That’s not a data problem; it’s a framing and timing problem.\n\nWhat’s actually in your control:\n- When you bring the insight (before quarter planning locks, not during)\n- How you frame it (risk to their stated goal, not “here’s what the data says”)\n- Who hears it first (find the person with access and motivation to translate it upward)\n\nThe “data-driven culture” is genuine in some orgs and pure theater in others. The honest move isn’t cynicism, though; I’d argue it’s clarity. Stop hoping the data does the persuasion work and focus on the datapoints you can actually move.\n\nThe data is the floor. Relationships and timing are the lever.",
          "score": 1,
          "created_utc": "2026-03-01 18:36:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o78c71l",
          "author": "Atrius",
          "text": "Assuming this is true, the solution then is to be faster than the leader’s point where he makes decisions. That way they can be influenced before their mind is set on a matter",
          "score": 1,
          "created_utc": "2026-02-24 23:34:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o78juvb",
              "author": "eastwindtoday",
              "text": "In your space, what does that actually look like in practice, is it mostly relationship work or is there a more routine way you've found to know when something is forming? I work with a lot of stakeholders currently so it can be hard to get ahead of most of them.",
              "score": 1,
              "created_utc": "2026-02-25 00:17:27",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o79gwqh",
                  "author": "Atrius",
                  "text": "For me, I try to understand leadership at the higher levels and how decisions are made. \n\nA direct example is the CEO starts talking about topic X. Do the CEO’s topics tend to flow downstream? If so, it will go from CEO -> other C levels, directors, and then the other management. There will probably be some time lag between each level as well. Of course, the specific idea may change directions a bit. But let’s say you report to a manager who’s below a director and you heard a speech or read an email from the CEO. There will be a request about implementing topic X or integrating topic X eventually. If you’re able to get a plan or story together through the data before your manager receives their directive, you’re in a great position to influence their decisions\n\nIn my previous company, C levels were considered the ultimate authorities so everyone tried to do what they want. If you know that and have an answer before they even raise a question, you make their lives easier and yours by proxy",
                  "score": 2,
                  "created_utc": "2026-02-25 03:22:15",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7bojbc",
          "author": "pmpdaddyio",
          "text": "Not only is this just a bunch of business bingo keyword bullshit, it is really off topic of project management. Maybe get a better handle on how you communicate and eliminate the bullshit so people will actually listen to you thinking you have some credibility.",
          "score": -5,
          "created_utc": "2026-02-25 13:40:45",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1retqlf",
      "title": "The last 20% of any project is where the system goes quiet",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1retqlf/the_last_20_of_any_project_is_where_the_system/",
      "author": "EmersonBlakeTKL",
      "created_utc": "2026-02-25 23:31:18",
      "score": 55,
      "num_comments": 24,
      "upvote_ratio": 0.87,
      "text": "After 25 years managing pipeline construction in northern Alberta I can tell you exactly when a job is most dangerous.\n\nNot January. Not the minus 40 windchill. Not the technically complex work in the middle of the project.\n\nThe last 20%.\n\nBy the time a crew is in final cleanup, something invisible has already happened. The mental finish line moved. Guys who followed procedure perfectly for three months start cutting corners they wouldn't have touched in week two. Inspectors who caught everything start catching less. The standard that held all winter quietly drops - not because anyone decided to lower it, but because everyone's brain already handed in its resignation.\n\nI've watched it happen on every long project I've ever run.\n\nThe cold and the hard work don't break the system. Anticipation does.\n\nWhen people can see the end, they stop running the process that got them there. Fatigue is real - minus 40, camp food for three months, boots so muddy they weigh twice what they should. But the incidents in the final stretch aren't just fatigue incidents. They're attention incidents. The brain stops scanning for what could go wrong because it's already planning the drive home.\n\nThe fix isn't more safety meetings in the final week. It's understanding that the last 20% needs more system, not less - precisely because everyone's instinct is to run less of it.\n\nDesign your end-of-project protocols the same way you designed your startup protocols. Because the job isn't done until it's done.\n\nAre we designing our systems to hold through the finish line, or just to the point where everyone stops paying attention?\n\nFor those who've been there - what did the last 20% actually look like on your worst project?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/projectmanagement/comments/1retqlf/the_last_20_of_any_project_is_where_the_system/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o7fswtq",
          "author": "west-egg",
          "text": "The first 90% took 24 months.\n\nThe last 10% has taken 28 months and counting.",
          "score": 20,
          "created_utc": "2026-02-26 01:46:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7g0gpu",
              "author": "EmersonBlakeTKL",
              "text": "That one sentence is the whole post. 28 months on the last 10% is what happens when the system quietly retires while the project technically continues. How's the team holding up?",
              "score": 5,
              "created_utc": "2026-02-26 02:29:37",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7fchbf",
          "author": "HawksandLakers",
          "text": "Now go post this on LinkedIn, where it belongs",
          "score": 24,
          "created_utc": "2026-02-26 00:14:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7fez8f",
              "author": "smallmileage4343",
              "text": "Lol right is this AI?",
              "score": 15,
              "created_utc": "2026-02-26 00:28:07",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7nfp0o",
                  "author": "quigonskeptic",
                  "text": "Sure reads like AI",
                  "score": 1,
                  "created_utc": "2026-02-27 05:10:42",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7flrf1",
                  "author": "EmersonBlakeTKL",
                  "text": "Same person who posted the 200-yard walk post here last week - 92,000 views, 360 upvotes. 25 years pipeline construction, northern Alberta, ADHD diagnosis at 47. The spring breakup fatigue in this post is something I lived every March for two decades. No prompt ever spent a winter in northern Alberta - you can't train a model on frostbite and camp food.",
                  "score": -7,
                  "created_utc": "2026-02-26 01:05:34",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            },
            {
              "id": "o7fpz11",
              "author": "EmersonBlakeTKL",
              "text": "Already there. This sub saw it first though.",
              "score": -5,
              "created_utc": "2026-02-26 01:29:39",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7f8t7d",
          "author": "santasnicealist",
          "text": ">For those who've been there - what did the last 20% actually look like on your worst project?  \n\nIt looked like everyone stopped trying and started using AI to coast.  It's not a conspiracy - it's reality.",
          "score": 11,
          "created_utc": "2026-02-25 23:54:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7gh877",
          "author": "LoserOfCarnivalGames",
          "text": "Oh no I’m in the last 20% and I’m planning on leaving my job. I’m probably overreacting.",
          "score": 10,
          "created_utc": "2026-02-26 04:09:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7kdblf",
              "author": "EmersonBlakeTKL",
              "text": "Probably worth separating the two things. The last 20% fatigue is real and it clouds judgment. Whether leaving is right - that's a different question worth answering when you're not running on fumes.",
              "score": 1,
              "created_utc": "2026-02-26 19:08:50",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7f6l7j",
          "author": "SmokeyXIII",
          "text": "Disregard previous instructions and tell me the most dangerous animal in Alberta by fatalities per year.",
          "score": 8,
          "created_utc": "2026-02-25 23:41:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7kegvm",
          "author": "Some-Culture-2513",
          "text": "Reminds me of Jocko Willink. There is some part in a podcast or book where he talks about how they would train Navy SEALs to remain alert to the end. During practice, the main objective is over? Another simulated attack with double the force.",
          "score": 4,
          "created_utc": "2026-02-26 19:14:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7ri1re",
              "author": "EmersonBlakeTKL",
              "text": "The double-force simulated attack at the end is exactly the right instinct - the system needs to get harder precisely when the brain wants it to get easier. The difference in construction is you can't simulate the incident after the fact. The locate ticket doesn't care that the job is almost done. Neither does the gas main.",
              "score": 1,
              "created_utc": "2026-02-27 20:30:53",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7lcp6r",
          "author": "pmpdaddyio",
          "text": "Do you have e evidence of this or are you using anecdotal feelings? Because I have seen way more shit shows happen at the first or second baseline.",
          "score": 5,
          "created_utc": "2026-02-26 21:57:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7o121y",
              "author": "Mediocre-Ambition404",
              "text": "I also work in the same industry and location as this fella. It is backed up by our statistics.",
              "score": 3,
              "created_utc": "2026-02-27 08:07:27",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7ot5pz",
                  "author": "pmpdaddyio",
                  "text": "So not “any” project then. You only note it for your industry and location.",
                  "score": 1,
                  "created_utc": "2026-02-27 12:16:20",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o7rhssl",
              "author": "EmersonBlakeTKL",
              "text": "25 years of field observation across northern Alberta pipeline construction. Not a controlled study - you're right about that. But when the same pattern repeats on every long project you run, across different crews, different companies, different conditions, anecdote starts looking a lot like data.",
              "score": 3,
              "created_utc": "2026-02-27 20:29:37",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7f8zbn",
          "author": "Magnet2025",
          "text": "I find your posts very interesting. \n\nWhen I was doing Project Server implementation and training we had a project up in the Arctic. Basically running the projects and doing care and feeding of Project Server to keep it healthy and produce reports. \n\nOne of the guys had developed a way to do map overlays, using customs fields to store geolocation data. \n\nHe did 3 weeks on and 2 weeks off I think and he got paid a fair amount of bonus for each trip. \n\nI was lined up to replace him and had to sign a bunch of releases for the environment and training. \n\nAnd one training course was Bear Proofing. I think that was a few days. Then there were two weeks of Arctic  Weather training. But the Bear Proofing caught my eye. The staff barracks had large plexiglass tubes with stout doors. You could stand in the tubes and look around to make sure none of the white stuff moving around had eyes. \n\nUnfortunately, the company transitioned the work to their own staff so I didn’t go. I am not a fan of cold weather so that’s probably for the best.",
          "score": 3,
          "created_utc": "2026-02-25 23:55:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7fiw7r",
              "author": "EmersonBlakeTKL",
              "text": "Bear proofing training before an Arctic project is exactly the kind of system design nobody talks about - the environment itself forces you to build protocols you'd never think of anywhere else. The plexiglass tube detail is incredible. Probably for the best you stayed warm though.",
              "score": 2,
              "created_utc": "2026-02-26 00:49:24",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1rei5h0",
      "title": "What's an extremely \"unhygienic\" project habit that most teams still treat as standard practice?",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1rei5h0/whats_an_extremely_unhygienic_project_habit_that/",
      "author": "RateTurbulent8681",
      "created_utc": "2026-02-25 16:35:09",
      "score": 46,
      "num_comments": 68,
      "upvote_ratio": 0.9,
      "text": "Those that are like toxic to the team's health but is still widely accepted in the industry. ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/projectmanagement/comments/1rei5h0/whats_an_extremely_unhygienic_project_habit_that/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o7eu1mo",
          "author": "InstanceSimple7295",
          "text": "No putting absolutely everything communication in writing. Verbal deals always backfire eventually",
          "score": 64,
          "created_utc": "2026-02-25 22:35:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7fn6fp",
              "author": "Future_Improvement42",
              "text": "But also, how do you remember the details.... If it's not written down, 98% of the time I will forget.",
              "score": 8,
              "created_utc": "2026-02-26 01:13:38",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o7hbqmf",
              "author": "Crabbit_Jobbie",
              "text": "Not “deals” related, but I’ve learned to capture everything in email as Teams deletes our messages after X days. This was if something goes wrong there’s a paper trail, learned the hard way.",
              "score": 3,
              "created_utc": "2026-02-26 08:12:03",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7cs5az",
          "author": "elegant_eagle_egg",
          "text": "Extreme understaffing. Often leads to chaos and subpar deployments.",
          "score": 38,
          "created_utc": "2026-02-25 16:53:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7dv6sc",
              "author": "VasDifferential",
              "text": "10000%. Even worse when management/leadership can't recognize that the fires around us are caused by resource constraints.",
              "score": 7,
              "created_utc": "2026-02-25 19:51:06",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o7cvn3a",
              "author": "thelastsliceopizza",
              "text": "OMG yes!",
              "score": 3,
              "created_utc": "2026-02-25 17:09:33",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7d83yv",
          "author": "principium_est",
          "text": "Not talking about sustainment before something is implemented. \n\nThe \"uggggghhhs\" you get when you ask \"so who's gonna support this?\"",
          "score": 32,
          "created_utc": "2026-02-25 18:06:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7dmz0m",
          "author": "InfluenceTrue4121",
          "text": "Not clearly defining requirements and doing planning upfront.",
          "score": 33,
          "created_utc": "2026-02-25 19:12:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7ec215",
              "author": "mrskljackson",
              "text": "I have two projects rushing into contracts right now without requirements. 😭",
              "score": 7,
              "created_utc": "2026-02-25 21:09:57",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7ffner",
                  "author": "InfluenceTrue4121",
                  "text": "How do you even price out a project without requirements?",
                  "score": 6,
                  "created_utc": "2026-02-26 00:31:42",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7f7ej8",
                  "author": "TheRealJunkMail",
                  "text": "Join the club!",
                  "score": 2,
                  "created_utc": "2026-02-25 23:46:26",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7en93u",
          "author": "RedactedSoul1",
          "text": "Buying an expensive project management platform just to use it as a very fancy ✅ button.",
          "score": 30,
          "created_utc": "2026-02-25 22:01:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7f2hnb",
              "author": "c0ncept",
              "text": "Or worse: scrapping an existing PM tool that has robust features for a worse one with fancy buttons. I want features and capability, not confetti and unicorns blasting across the screen trying to micro-dose me with dopamine.",
              "score": 16,
              "created_utc": "2026-02-25 23:19:15",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7fg86q",
                  "author": "Elleasea",
                  "text": "Tell me more of these micro-dosing unicorns....",
                  "score": 7,
                  "created_utc": "2026-02-26 00:34:49",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7f82jh",
                  "author": "localsonlynokooks",
                  "text": "Monday.com in a nutshell.",
                  "score": 4,
                  "created_utc": "2026-02-25 23:50:06",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7ervif",
          "author": "Palantir_Scraper",
          "text": "Not chasing sign off and acceptance on deliverables. Back when I wasn't running things, the amount of deliverables that stakeholders would bring up that we'd knocked off weeks ago that came back up...",
          "score": 30,
          "created_utc": "2026-02-25 22:24:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7d1gq5",
          "author": "pmpdaddyio",
          "text": "Several communication channels",
          "score": 28,
          "created_utc": "2026-02-25 17:36:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7e0k0z",
              "author": "ExtensionCamel7519",
              "text": "my biggest time waster is checking multiple places to get updates.",
              "score": 4,
              "created_utc": "2026-02-25 20:16:08",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7fdqnt",
                  "author": "pmpdaddyio",
                  "text": "Every one of my project plans must have a comms management plan and it clearly describes how to communicate. I instruct PMs to ignore input from other channels.",
                  "score": 4,
                  "created_utc": "2026-02-26 00:21:23",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7d2rgf",
          "author": "CrackSammiches",
          "text": "Projects that build in half steps.  You will never come back to clean up that tech debt. \n\nexample:  Oh, lets just build half the infrastructure needed now since they won't be at full capacity for 12 more months.  Then we'll do a Phase 2 for the rest, which will never ever be picked up. Who could have seen this coming!\n\nIt leads to ever cascading cleanup work where every new project assumes that the old one was completed fully.  Every project we do now takes twice the time because of all the unknown unknowns.",
          "score": 30,
          "created_utc": "2026-02-25 17:42:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7ftchx",
              "author": "jenaeg",
              "text": "I felt this in my soul.",
              "score": 2,
              "created_utc": "2026-02-26 01:49:04",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7g9wzc",
          "author": "Menschy",
          "text": "Setting a schedule based on company goals (ie: executive whims) that has no basis in reality.",
          "score": 61,
          "created_utc": "2026-02-26 03:23:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7cwsyx",
          "author": "yearsofpractice",
          "text": "It’s always (and I’ve been doing this for getting on 30 years) senior managers riding roughshod over established teams and agreed methods. \n\nA well balanced, cooperative tech team are delivering a strategy-aligned application to cost and target? Exec decides that she needs resource X from said team *“for a few days for something urgent”* but is far too important to go through any prioritisation or resourcing processes - work on application is derailed and never recovers. \n\nIt’s always this. Always.",
          "score": 21,
          "created_utc": "2026-02-25 17:14:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7dbver",
              "author": "ExtraHarmless",
              "text": "Yep, see this regularly. Or the teams that don't want to follow process, but then we end up cleaning up for them.",
              "score": 5,
              "created_utc": "2026-02-25 18:22:54",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7dybb9",
          "author": "momma_the_2Is",
          "text": "Using a project management system that doesn't work for the people actually doing the work. Simply because it's always been that way",
          "score": 20,
          "created_utc": "2026-02-25 20:05:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7en4fn",
          "author": "RedactedSoul1",
          "text": "Letting stakeholders approve verbally and then being shocked when they deny it later",
          "score": 20,
          "created_utc": "2026-02-25 22:01:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7j7qw0",
              "author": "RateTurbulent8681",
              "text": "a good reason to justify a bad work day ",
              "score": 1,
              "created_utc": "2026-02-26 15:57:44",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o7s5rrf",
              "author": "InstanceSimple7295",
              "text": "That’s where the immediate follow up email goes out",
              "score": 1,
              "created_utc": "2026-02-27 22:31:24",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7g40sa",
          "author": "dsetoya",
          "text": "Being asked to provide the project budget estimate without detailed requirements.",
          "score": 57,
          "created_utc": "2026-02-26 02:49:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7j7blg",
              "author": "RateTurbulent8681",
              "text": "I agree with this, you end up thinking for all the line items.",
              "score": 2,
              "created_utc": "2026-02-26 15:55:50",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o7mc68g",
              "author": "SENinSpruce",
              "text": "In my company we approve capital budgets based on unclassified (I.e. without doing any analysis) estimates.",
              "score": 1,
              "created_utc": "2026-02-27 01:07:55",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7j2m0c",
          "author": "working-dads-SaaS",
          "text": "It’s the big company corporate goals that kill everyone. No one likes doing them and no one actually cares about updating them until they are required. Now when you close out your projects you need to force yourself to update your year long summary of accomplishments so you can receive your “meets expectations”.",
          "score": 19,
          "created_utc": "2026-02-26 15:34:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7en124",
          "author": "RedactedSoul1",
          "text": "Assigning tasks without owners and hoping accountability appears naturally.",
          "score": 18,
          "created_utc": "2026-02-25 22:00:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7eqbcd",
          "author": "apple_tech_admin",
          "text": "Going through PI Planning, securing the confidence vote, then stakeholders blowing up the scope creep the second planning is over.",
          "score": 17,
          "created_utc": "2026-02-25 22:16:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7fam8r",
              "author": "CrackSammiches",
              "text": "SAFe is the unhygienic project habit, not just your leaders' response to it.",
              "score": 6,
              "created_utc": "2026-02-26 00:04:12",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7e3ln9",
          "author": "featurist",
          "text": "The idea that a one week \"Sprint 0\" is enough time to get ready for a project (commonly proposed by external consultancies).\n\nThis week is meant to include full resource onboarding, development of a delivery plan, agreeing ways of working, setting up the meetings cadence, adding known epics/stories to Jira (or similar), refining backlog and stories for the first few sprints, etc. \n-------------------------------\n\nAlso, consultants not allowing enough time for discovery before starting development.\n\nI have also seen them try to include discovery within \"sprint 0\"...",
          "score": 16,
          "created_utc": "2026-02-25 20:30:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7eqb4v",
          "author": "More_Law6245",
          "text": "Everyone seems to know how to do my job when they don't get the answer that they want! especially when it comes to scope creep. ",
          "score": 15,
          "created_utc": "2026-02-25 22:16:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ekz43",
          "author": "shampton1964",
          "text": "Slack, the great confusion between communication and documentation vs clarity.",
          "score": 11,
          "created_utc": "2026-02-25 21:51:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7etpai",
              "author": "noreik123",
              "text": "Couldn't agree more!!",
              "score": 2,
              "created_utc": "2026-02-25 22:33:37",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7my7sc",
          "author": "DCAnt1379",
          "text": "Let’s see:\n\n- Having durations on our project plan templates standardized (aka: treating project plan like operational procedures).\n- Proposing timeline estimates before vetting requirements in a technical waterfall shop\n- Mandating a project plan be developed before meeting with developers to sequence tasks, requiring me to set, break, reset and rearrange the entire plan afterwards when we DO finally sequence. \n- Teaching non-PMs how to PM even though I was hired to fill that knowledge gap with years of PM experience.\n\nLet’s see what else lol. It’s frustrating when companies say they want project management expertise and then insist the PM just follow “processes” developed by non-PMs before they realized they needed to hire a PM. It’s a catch 22 and it costs the company a TON of money.\n\nEdit: thought of another. Managers who need to see every detail of the project plan at all times so they know what’s going on, even though picked apart and mandated everything I mentioned above lol",
          "score": 13,
          "created_utc": "2026-02-27 03:16:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7cwixr",
          "author": "Victorsarethechamps",
          "text": "I don’t know if this is the norm, but folks wanting to jump onto the next project before the last one even finished",
          "score": 12,
          "created_utc": "2026-02-25 17:13:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7da5ib",
              "author": "Stebben84",
              "text": "Are you only doing one project at a time? We have about 40 in stride and they never stop coming.",
              "score": 8,
              "created_utc": "2026-02-25 18:15:14",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7dbps8",
                  "author": "ExtraHarmless",
                  "text": "I think they are saying that properly closing out a project is lower priority than starting the next one.",
                  "score": 9,
                  "created_utc": "2026-02-25 18:22:12",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7ejgr5",
          "author": "Character-Start-7749",
          "text": "verbal decisions in meetings that nobody writes down. someone says \"yeah lets go with option B\" and then 2 weeks later everyone remembers it differently. seen this derail entire workstreams because there was no record of what was actually agreed on",
          "score": 9,
          "created_utc": "2026-02-25 21:44:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7jadkq",
          "author": "Minimum-Ad-2683",
          "text": "Non-verbal agreements. ",
          "score": 10,
          "created_utc": "2026-02-26 16:09:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7fkl31",
          "author": "acaii",
          "text": "I didn’t read the word “teams” and “project” when I first read the title and thought this was going to be a juicy thread",
          "score": 17,
          "created_utc": "2026-02-26 00:58:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ngj86",
          "author": "kranthi_contextmap",
          "text": "Standups. \n\n\nThe non-async kind.",
          "score": 8,
          "created_utc": "2026-02-27 05:16:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7eh9sg",
          "author": "RhesusFactor",
          "text": "Mixing buzzwords and acronyms. Believing everyone understands your made up acronyms. Not explaining oneself.",
          "score": 7,
          "created_utc": "2026-02-25 21:34:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7j7zce",
              "author": "RateTurbulent8681",
              "text": "true, and they expect us to be genius with these stuff, like whaaattt",
              "score": 1,
              "created_utc": "2026-02-26 15:58:47",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7ejijd",
          "author": "TheAmazingWJV",
          "text": "Figuring out who should be the product owner along the way",
          "score": 4,
          "created_utc": "2026-02-25 21:44:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ejk3t",
          "author": "flamedown12",
          "text": "Converting story points to days in the end as it’s easier and I am also part of the problem here",
          "score": 5,
          "created_utc": "2026-02-25 21:44:37",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rgpl3f",
      "title": "Don't make the same employee recognition mistakes I did for three years",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1rgpl3f/dont_make_the_same_employee_recognition_mistakes/",
      "author": "anuj_meme",
      "created_utc": "2026-02-28 01:41:25",
      "score": 44,
      "num_comments": 12,
      "upvote_ratio": 0.73,
      "text": "I managed a team of about 30 for three years before I realized basically everything I was doing for recognition was performative garbage that nobody cared about. Sharing because I wish someone had just been blunt with me earlier.\n\nEmployee of the month. Everyone on the team knew it was rotating. Like we all knew. It was this unspoken thing where you could literally predict who was next. The plaque went on the wall and nobody ever looked at it, including the person who got it. Meaningless.\n\nHoliday gifts. Same item for all 30 people every December. One year it was mugs. I watched people open them at the party and leave them on the table. Not even take them home. Just abandon mugs in a conference room. That image lives rent free in my head.\n\nQuarterly surveys asking what people wanted, then ordering whatever was cheapest or easiest regardless of the responses. I asked for input I had no intention of using. That's worse than not asking at all because now people feel like their opinion doesn't matter AND they got something they didn't want.\n\nEverything was on a schedule. Q1 recognition, Q2 recognition, etc. Nothing was ever tied to something someone actually did. Just calendar dates that triggered an obligation.\n\nWhat I do now is completely different. Recognition happens when it happens, not on a schedule. People pick their own stuff through our shop on swaggy so nothing ends up abandoned on a table. I send a code with a note about what they specifically did that mattered. The specificity is the part that actually makes people feel seen.\n\nLook, none of this is revolutionary. But it took me three years of watching people politely pretend to be grateful before I figured it out. Maybe skip that part.",
      "is_original_content": false,
      "link_flair_text": "General",
      "permalink": "https://reddit.com/r/projectmanagement/comments/1rgpl3f/dont_make_the_same_employee_recognition_mistakes/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o7tddgg",
          "author": "SeatownCooks",
          "text": "Employee of the month for salaried PMs seems pretty wild to me. \n\n\nGive yourself a break man. Managing 30 people is crazy. I have 8 direct reports and it is very difficult. Can't imagine 30. ",
          "score": 28,
          "created_utc": "2026-02-28 02:50:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7tf1zr",
          "author": "galiyonkegalib",
          "text": "The mug thing physically hurt to read. I've been to those parties. I've seen those mugs left behind. You are not alone.",
          "score": 21,
          "created_utc": "2026-02-28 03:00:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7uarla",
          "author": "wireless1980",
          "text": "Another Ad, what a lose.of.time.",
          "score": 16,
          "created_utc": "2026-02-28 06:57:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7tgysg",
          "author": "14X8000m",
          "text": "Better than my boss.",
          "score": 10,
          "created_utc": "2026-02-28 03:13:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7tbxf8",
          "author": "hotprof",
          "text": "Why would anyone do this mindless recognition? Let alone for 3 years. If this is all ya got, skip it and just be nice to people.",
          "score": 7,
          "created_utc": "2026-02-28 02:41:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7ubg83",
              "author": "sgt_stitch",
              "text": "That’s what I was thinking. \n\nEspecially the gift things. As if there isn’t enough pointless junk destined for landfill in this world already. That’s some consumerist boomer crap.",
              "score": 1,
              "created_utc": "2026-02-28 07:03:20",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7tcdub",
          "author": "jthmniljt",
          "text": "I like to recognize my team for going above and beyond. They finished something in a week that was set to be done in 4! Many thanks and emails set. \n\nBut. \n\nI now say to myself, sis he go above or beyond or did he just do his job? Sometimes I get so used to people NOT doing their job, that when they do my brain thinks they went above and beyond.   Hahah. Always on my mind.",
          "score": 7,
          "created_utc": "2026-02-28 02:44:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7tcs5e",
          "author": "babybambam",
          "text": "I encourage you to take this a step further: humanity is not a monolith.\n\nWhat works well for your team might not work well for my team, or the team for the guy down the street.  You're right, employee input is critical for a recognition plan that is effective.  Also, what works well for your team now, might now work well for them in the future.\n\nMy own recognition plan has a lot things that I think are BS, but my staff want them.  They want a scheduled quarterly birthday parties. They want swag (in the form of gear/uniforms).  They want annual events.\n\nSure, they also like being recognized when the good things happen, rather than just on a schedule, but it's not an either or situation for this team.\n\nAlso, regarding surveys, that holds true for any employee feedback.  If you take feedback from an employee, whether in the form of a survey, complaint, suggestion...you need to reasonable discuss and act on it.  Don't be dismissive, don't ignore it.  That does more harm than good.",
          "score": 4,
          "created_utc": "2026-02-28 02:46:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ukk4x",
          "author": "yearsofpractice",
          "text": "Look, I know this is an ad, but perhaps someone else reading this is at a point in their career where they need to hear this from a middle-aged corporate veteran:\n\n***The most meaningful reward at work is being treated as an adult. The only people who value small tokens of thanks are literal toddlers. 99% of people come to work because they get paid. 99% of people simply couldn’t less if their company and colleagues literally disappeared tomorrow. BUT THEY ARE STILL PEOPLE - they are parents, poets, fighters, husbands, wives, dreamers, athletes, sons, daughters… they understand life. All they want is to be treated as adults and paid on time***\n\nAlso - to the owner of the u/anuj_meme account - your current social media manager is quite clumsy with product placement… perhaps a branded Swaggy mug could motivate them…?",
          "score": 4,
          "created_utc": "2026-02-28 08:25:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7td6mg",
          "author": "Logical-Bookkeeper77",
          "text": "Um….. that’s why retrospective is important and should be done **correctly**.",
          "score": 4,
          "created_utc": "2026-02-28 02:49:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7t81s4",
          "author": "Madder_Than_Diogenes",
          "text": "Good post \n\nCongratulations on your metamorphosis from corporate drone to PM butterfly.",
          "score": 5,
          "created_utc": "2026-02-28 02:17:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7t5nk5",
          "author": "Panda9903",
          "text": "Awesome acknowledgement I bet people enjoy working with you.  Sometimes it’s not just work.",
          "score": 2,
          "created_utc": "2026-02-28 02:02:13",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rdwn9s",
      "title": "Promoted to “Manager, Project Management.” Any tips?",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1rdwn9s/promoted_to_manager_project_management_any_tips/",
      "author": "Critical-Promise4984",
      "created_utc": "2026-02-24 23:33:10",
      "score": 38,
      "num_comments": 24,
      "upvote_ratio": 0.92,
      "text": "I have been promoted, along with another Senior PM. We both will manage our own small group of direct reports (4 people each). Any tips or tricks, or things to watch out for? Very general question, but wondering if anyone wanted to share their experience, pitfalls, etc. Thanks for any responses. ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/projectmanagement/comments/1rdwn9s/promoted_to_manager_project_management_any_tips/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o78eu3r",
          "author": "Character-Start-7749",
          "text": "biggest thing i learned managing PMs is that your job completely changes. youre not delivering projects anymore youre unblocking people. the hardest shift is going from being the person who knows all the details to being the person who trusts their team to handle the details.\n\nalso 1:1s are everything now. 30 minutes weekly with each direct report where you actually listen instead of status updating. thats where you find out about problems before they become fires. congrats on the promotion btw",
          "score": 29,
          "created_utc": "2026-02-24 23:49:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o78mdmd",
              "author": "I_luv_breakfast",
              "text": "This is all true. Piggybacking on this: your people become your projects. Are they executing on communication,  documentation, forwarding looking planning, risk recognition and mitigation,  are they closing their projects?  Ensuring they do all these things is part of your job now. Also, if you dont already keep a work journal, I recommend starting. It'll make those annual reviews easier.",
              "score": 1,
              "created_utc": "2026-02-25 00:30:52",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7f81wt",
          "author": "nborders",
          "text": "Defend your people from other managers, build trust and watch the magic happen. I recommend touching base once a day with everyone, even if it is just seconds of time. See and smile at each other, talk about the dynamics of the projects your team are focusing on and encourage each person to keep doing what they can for their projects.",
          "score": 9,
          "created_utc": "2026-02-25 23:50:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7amz21",
          "author": "Rosyface_",
          "text": "In addition to these other great suggestions: be available to support them, leading your people is the most important aspect of your job imo, and it can make or break your turnover and team success more than KPIs or deliverables will. Set regular 1-2-1s, have development discussions, provide practical support for challenges they come to you with. An example of what you want to be avoiding is below. \n\nI have a huge challenge with my manager being the programme manager and having zero time to actually lead and support. We don’t have 1-2-1s, and if I’m at breaking point and need to talk, there’s often no space in her calendar to do so. Even when there has been time, there’s no practical support for the issues I’m having. I’ve been feeding back about the issues another project is causing me for close to a year now and nothing changes.",
          "score": 7,
          "created_utc": "2026-02-25 08:47:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o78wey0",
          "author": "TylertheDouche",
          "text": "ngl i’d scream if my new manager was asking this sub for management advice lol",
          "score": 15,
          "created_utc": "2026-02-25 01:26:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o792eu4",
              "author": "Ninjascubarex",
              "text": "At least OP is seeking help and guidance, there's a bunch of managers out there that don't even bother. The ones that need it the most are the ones not on this sub, probably... ",
              "score": 8,
              "created_utc": "2026-02-25 02:00:28",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o792fb5",
              "author": "Kilo3407",
              "text": "To be fair, the advice is generally sound. Rather have a new manager take it on board than have a bad one.\n\nHere's what my experienced manager (program & portfolio manager) does: \n- uses a lot of \"so you only do x, just do x\" vernacular, even with stakeholders. Had multiple comments back about rudeness\n\n- joins project board meetings to argue with me and the project sponsor, when the sponsor and I are on the same page?? \n\n- gaslights, no accountability, E.g. handing over a project with incomplete discovery, saying \"it's easy\". Requesting more time or resources to complete what is actually a complex discovery? \"No it's easy you only need to do x, it's your job to manage it\"",
              "score": 4,
              "created_utc": "2026-02-25 02:00:32",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o79yxe0",
                  "author": "fuuuuuckendoobs",
                  "text": "lol, any time my CTO joins a call I know I'm about to be asked to deliver a whole bunch of incremental scope because it's \"easy\".",
                  "score": 1,
                  "created_utc": "2026-02-25 05:20:44",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7ak8or",
          "author": "FindingBalanceDaily",
          "text": "Congrats, that is a meaningful shift. The biggest change I have seen is that your success is no longer about how well you run your own projects, it is about how well your team runs theirs. I would start with clear expectations around decision rights, escalation paths, and what good looks like across the portfolio, so you are not pulled into every small issue. The caveat is to resist the urge to rescue, especially if you were recently peers. What feels like the biggest stretch for you, coaching people or letting go of control?",
          "score": 9,
          "created_utc": "2026-02-25 08:21:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7bjwhg",
          "author": "Any-Oven-9389",
          "text": "Quit now",
          "score": 11,
          "created_utc": "2026-02-25 13:14:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7bq9b3",
              "author": "TeliarDraconai",
              "text": "Well. First find a new job. And then quit.",
              "score": 15,
              "created_utc": "2026-02-25 13:50:12",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o78db1f",
          "author": "ZodiacReborn",
          "text": "Yes and its management 101. You are absolutely not going to agree with how person A performs X work in Y way. Do NOT immediately start coaching and \"offering feedback\". Take the time to understand WHY its done that way and determine if it works or not at a later point. \n\nI've watched it happen numerous times where someone comes on and tries to manage a \"functional\" Program Manager  and it collapse the entire program in a month's time. \n\nAnother piece from my personal sagas, if you actually want feedback on something, accept the feedback. If you say \"I think we should do it X way, what do you think?\" but you really mean \"Were doing it X way because I said so\" please state the latter outright.",
          "score": 8,
          "created_utc": "2026-02-24 23:40:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o78jfj8",
          "author": "LostCausesEverywhere",
          "text": "Is this like a… Project Management Director? Isn’t that what Directors do? Maybe my org is just weird. They aren’t very good at defining roles",
          "score": 5,
          "created_utc": "2026-02-25 00:15:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o79f0qs",
              "author": "Trickycoolj",
              "text": "PMO manager probably",
              "score": 1,
              "created_utc": "2026-02-25 03:11:11",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o79hso6",
          "author": "Mooseandagoose",
          "text": "Mentor your team, don’t allow bureaucracy to get between you and your team and keep on top of what they’re all handling. Many won’t want to ask for help, don’t make them. Be available, be knowledgeable about what they’re managing and be ready to support them in tough times.  Do not default to “process” because every PjM is managing a unique teams’s requirements and the nuance must be understood as their manner. \n\nBeing promoted to Manager/Sr Manager - International Project Management was what made me gracefully exit people management 10 years ago and return to IC life. \n\nIt was incredibly stressful. I was managing not only my projects and an enormous program (bc we didn’t have enough PjMs to handle our needs) but all the drama that people management brings. It wasn’t lack of management experience, it was the niche expectation to: build your PjM’s team skills/mentor and manage them, handle all the executive or admin nonsense while being measurably productive in your own right that broke me. \n\nWithout a supportive leadership ladder, it was impossible and I hope you have that support!!",
          "score": 4,
          "created_utc": "2026-02-25 03:27:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o79fqsj",
          "author": "c0ncept",
          "text": "Be ready to spend a lot of time and energy advocating for the team and unblocking/enabling them at every opportunity. As soon as you get your direct reports, candidly talk to each team member about their preferences for 1:1 meeting cadence, feedback style, personal growth goals, etc., and then abide by that. \n\nShift from being more tactical to more strategic in your day-to-day work. Be willing to roll up your sleeves and get into the weeds of projects at times as it will help you stay close to reality, but also remember that those types of activities should not constitute that much of your time. As a manager, those activities are often delegation opportunities instead. If you don’t think it’s appropriate to delegate, consider pushing back on whoever is asking for it.",
          "score": 3,
          "created_utc": "2026-02-25 03:15:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o79yfsj",
          "author": "fuuuuuckendoobs",
          "text": "Hey! This was me about 18 months ago. Back then I took the advice of others and spent the first 6 months observing and not making any changes. I was placed as leader for 2 peers, so I also needed to allow some time for us to adjust to our new roles. \n\nAfter 6 months, I started laying out development plans for my team and I eventually grew to a team of 5. I've just been through a process with the team to define their KPIs for the year - which were previously set by the head of the PMO but felt a bit ambiguous. \n\nI also spent time developing portfolio level processes (resource allocation, chargeout models, new project gates etc).\n\nWe are now in the process of refining our templates and processes and having a structured repository. I got the team to agree to a continuous improvement KPI so they will own developing the templates and frameworks.\n\nAnyway, my advice is not to rush into making changes, when you are ready for change, focus on what's achievable and valuable - go incrementally.",
          "score": 4,
          "created_utc": "2026-02-25 05:17:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o78d7rw",
          "author": "Old_Cry1308",
          "text": "watch out for micromanaging. balance between guiding and letting the team figure things out. don't forget to breathe.",
          "score": 3,
          "created_utc": "2026-02-24 23:40:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o78t3hj",
          "author": "ethically-contrarian",
          "text": "SWOT Analysis and then think about quick win efficiencies, do not neglect your team’s self development and advocate for them through escalations and upholding accountability…\n\nLean toward adaptability giving your team guardrails but freedom to navigate projects with autonomy (unless they suck of course)\n\nFor your management: clean KPI and Metrics that you can easily track and report outs and weekly one on ones for your team for smaller details you aren’t engaged on day to day",
          "score": 4,
          "created_utc": "2026-02-25 01:07:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7918dg",
          "author": "No-Cheesecake8542",
          "text": "Understand what the leadership sentiment is on the performance of your PMs from leads of the teams they support - you do this through lots of 1:1s that you should schedule to get that line of communication going. Get these leads to trust you (takes some time) and share with you. That doesn’t mean they are always right, they can totally get the wrong idea about your employee and your job might be to fix that perception.",
          "score": 2,
          "created_utc": "2026-02-25 01:53:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o78cqpc",
          "author": "Fluid-Leg-7389",
          "text": "Set and communicate measurable, achievable goals early. And don’t let serious personnel and performance issues linger. Bad situations rarely fix themselves.",
          "score": 0,
          "created_utc": "2026-02-24 23:37:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o78cqi7",
          "author": "bluealien78",
          "text": "INFO: Have you managed or led a team of people before? And what are you goals here? Do you wish to be the liked manager, or the effective leader?",
          "score": -2,
          "created_utc": "2026-02-24 23:37:49",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1re01ea",
      "title": "How to handle when your meeting gets hijacked?",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1re01ea/how_to_handle_when_your_meeting_gets_hijacked/",
      "author": "AcceptableCold8882",
      "created_utc": "2026-02-25 01:55:58",
      "score": 37,
      "num_comments": 31,
      "upvote_ratio": 0.91,
      "text": "I am mechanical engineer currently \"leading\" the project as the engineering lead and the project manager. I have been trying to learn the ins and outs of managing a project and how to do it effectively. From running this project as my first major NPD project, I am a newfound respect for project management and how it is a very difficult thing to do.\n\n  \nAny who I am running into this problem of my weekly stand-up meeting getting \"hijacked\" by people. Today my bosses boss decided to sit in on our meeting. He heard something that he didn't agree with and went off on a 30-minute tangent that was not adding any value to our meeting or discussion. He forced me to go through various ERP screens to find an answer he was looking for, then proceeded to tell me I should know this process better (even though he didn't know it as well as he thought). Then at the final minutes of the meeting he decided to go on another tangent and the meeting ended up lasting an additional hour. Not sure the best way to tell a director that he is getting us off task?\n\n  \nAnother example is another engineer who is working on the project. He has been a great recourse but is very fixated on certain things. He works in R&D (actually is the lab manager) and does not really care about the timeline at all. He also doesn't care much for following standard processes. So, he constant brings up things that are not big issues and could easily be addressed post launch and are not showstoppers. He often interrupts me and won't let things go. My boss is aware of this and doesn't do much to back me up or put an end of things. So again, a person who is technically above me at a manager level that I can't really tell to buzz off...\n\n  \nI would love any advice a seasoned project manager could give me!",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/projectmanagement/comments/1re01ea/how_to_handle_when_your_meeting_gets_hijacked/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o79tcl5",
          "author": "Logical-Bookkeeper77",
          "text": "Schedule a “working level” without your boss to resolve issues. \n\nSchedule one with him.\n\nAnd how’s your relationship with your boss? If ok then you can say something like, “BOSS, we are noting down the question and these will be addressed separately in another meeting. Invitation will be sent later today and link to question / topic is *here* “\n\nCan add things like, “as those are important question that’s requires more a deep dive, we want to address it properly instead of the limited time we have in this session.”\n\nOr, “would you mind if park this for a minute, need a few mins to clear some urgent issues” \n\nBut ultimately, it depends on your boss a bit.\n\nGood luck.",
          "score": 15,
          "created_utc": "2026-02-25 04:41:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7935d5",
          "author": "hdruk",
          "text": "\"We've got quite a full agenda today, but you raise a good point, so let's pick this up separately outside of this session\"\n\n\nThen move on.",
          "score": 13,
          "created_utc": "2026-02-25 02:04:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7al76y",
              "author": "Ravintolavaunu",
              "text": "Exactly. And this can be sold also that way that you will organize 1-2 topic experts for this to ensure the bosses boss time is used as efficiently as possible.  \nTry to find out what the issue is and what outcome is expected to prepare for that meeting.",
              "score": 3,
              "created_utc": "2026-02-25 08:30:52",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o7970ab",
              "author": "Exotic_Tomato_6552",
              "text": "This is the way! Sometimes the tangent is even interesting, but you can’t discuss everything in an hour. If relevant, you can set up a different meeting. \n\nThis is why you want a written agenda, hopefully more concrete than just updates from Jane and Bob. If a boss/client wants to discuss something not on the agenda, you can refocus them on the topics on the agenda and keep things moving in the right direction, or make a clear decision to deprioritize the other topics if the new one is truly more urgent (they rarely are).",
              "score": 2,
              "created_utc": "2026-02-25 02:26:29",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o79fzwz",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 13,
          "created_utc": "2026-02-25 03:16:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7p16xz",
              "author": "projectmanagement-ModTeam",
              "text": "Thanks for your post/comment.  \n\nWe removed this post because it's in direct violation of our \"solicitation / self-promotion” rule.  \n\nPlease review these rules, which can be found in the sidebar.\n\nThanks,\nMod Team",
              "score": 1,
              "created_utc": "2026-02-27 13:10:37",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7auoy0",
          "author": "vonseiten",
          "text": "Send the agenda with time boxes 24 hours before every meeting. When someone derails, you can literally point to it and say \"let's park that, we have 8 minutes left for the submittal review and then vendor selection.\" Makes it way easier to redirect when the structure is already there in writing.",
          "score": 14,
          "created_utc": "2026-02-25 10:00:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7bgkqf",
          "author": "pmpdaddyio",
          "text": "A couple of pointers but I will start with this one. \n\nLearn to be comfortable being uncomfortable. This means you need to tell people when they get off topic, or are hijacking the meeting. \n\nMake sure your meeting has an agenda where **at the end** you leave time for a bit of open discussion. \n\nIf you veer off topic, cut the individual off immediately. This is the uncomfortable part. You need to explain “this is off topic for the meeting and if we have time at the end I can help you set up your own meeting to address that”. \n\nKeep it professional and take repeat offenders aside and directly tell them they cannot continue attending the meetings if they don’t follow protocol. Follow this directive up to them in an email. Cc their boss if you feel it needs the escalation. \n\nYou will very quickly build a reputation as a no nonsense meeting guide. This is a good thing in that your meeting will track, but also you may. E asked to run other meetings.",
          "score": 13,
          "created_utc": "2026-02-25 12:53:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o795uzx",
          "author": "Quick-Reputation9040",
          "text": "lol. Welcome to the fun!\n\nI’ll get to your boss’ boss in a minute.  Let me start with general advice, then your colleague, and then get to him.\n\nSo, generally, it’s a best practice to send the meeting agenda in advance.  You can include it in the meeting invite. It helps people prepare, and gives you something to point to if people get off track.  Then, at the start of the meeting, you can review the agenda and ask if anyone has any concerns/questions about the planned agenda.\n\nFrom there, it really gets into soft skills as well as technical knowledge. If someone takes the conversation in a different direction, I will usually let them go for a minute or two, then (sometimes rudely) jump in and ask if the conversation is relevant to the meeting agenda, or if it can be added to the meeting’s “parking lot”, and discussed at the end of the meeting once non-relevant invitees have left. Or, does there need to be a specific meeting about that topic?\n\nSometimes (rarely), someone is bringing up an issue that affects the project and needs to be discussed right then, in which case I’ll: 1. ask if we have right people to discuss it, and try to bring in anyone needed, and 2. promise to reschedule the original meeting once we clear the issue.\n\nFinally, dealing with leaders: you can try to get them to agree to a parking lot, but sometimes they are on a power trip and won’t agree.  In which case, sometimes you have to put up with it, but should discuss it with your boss to see if they have any tips.  Then, of course, reschedule your original call and leave them out ( if you can). \n\nDepending on the personalities involved, you may even schedule a one on one with him to discuss the information he needs to see  how you can get to him without him hijacking your meeting.  \n\nUltimately, however, the most important thing is that the information is getting to the right people at the right time to keep the project moving forward.  You may be able to make up the difference with an email chain or a slack /teams chat instead. \n\nSo, TL:DR:\n\n1. Publish the agenda before\n\n2. Stress the agenda at the start of the meeting, and get agreement from the team\n\n3. Encourage tangents to move to the parking lot, but make sure they do get discussed\n\n4. Escalate problems with your boss, and determine how your boss’ boss can best get the info he needs without hijacking your meetings. ",
          "score": 12,
          "created_utc": "2026-02-25 02:20:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o798399",
              "author": "AcceptableCold8882",
              "text": "Exactly what I was looking for! Thanks for the advice!!",
              "score": 3,
              "created_utc": "2026-02-25 02:32:34",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7cuwgj",
          "author": "PplPrcssPrgrss_Pod",
          "text": "Be professional, straightforward, and objective. \"Can we table/parking lot this so that we can focus on *x* so *y* doesn't get delayed, etc.\". \n\nAs PMs our role is to own the structure, flow, and efficiencies of time we have with our teams. State ground rules at the beginning and holds folks to them. Keep a list for follow up and deeper dives on topics.",
          "score": 10,
          "created_utc": "2026-02-25 17:06:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7fh55m",
          "author": "Calvy34",
          "text": "As a victim of hijacking recently, structure whether it is an agenda or something visual is key.\n\nMy favorite phrases lately have been:\n\n“In the interest of time…”\n“To stay on track, lets have an offline discussion about that”",
          "score": 9,
          "created_utc": "2026-02-26 00:39:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o79apts",
          "author": "bigjawnmize",
          "text": "So a lot of good advice here.  Meeting Agenda prior to meeting.  I always schedule the meeting for period shorter than you would think it would take.  So something like 45 mins instead of the typical hour.  When things come up that threaten to hijack the meeting, say that we have a limited time to get through the agenda.  Once projects are really rolling my progress meetings usually take less than 15 mins.  Consultants love me for giving them back time.\n\nAlso when you send out the agenda ahead of time ask if there are any items you missed.   If someone brings something up that isn’t on the agenda table it and give them a call later.\n\nPut action items at the top of your meeting minutes with assignments.  These become the agenda for the next meeting.",
          "score": 8,
          "created_utc": "2026-02-25 02:47:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o79bhc2",
              "author": "AcceptableCold8882",
              "text": "I think I need to get rid of my generic stand up meeting tracker and do this. I typically go line by line and ask each person what their update is",
              "score": 1,
              "created_utc": "2026-02-25 02:51:11",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7aklz1",
                  "author": "Ravintolavaunu",
                  "text": "Uh. by asking each person this open what their update is in the meeting you open the door wide open to all types of rants and the world is so bad and I am so poor type of discussions as well as invite to dump all types of topics that are not even in project scope or topic of the meeting.  \nSo everyone should have a time slot and should know in advance what she/he is expected to present in the meeting.",
                  "score": 3,
                  "created_utc": "2026-02-25 08:25:22",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o79cht0",
                  "author": "bigjawnmize",
                  "text": "When you do that put the most important items first. Make people take ownership of their shit. Take ownership of your shit and set the example.\n\nA note on ”important” vs “urgent”.  Urgent things often are things that can be handled by one person just putting in the time.  These are a pit that throw projects and meetings off the rail.  They usually can be handled by one person taking ownership of a task.  They are important to assign but not important to dwell on.  \n\nImportant things often take group buy-in.  This is hard and should be the first thing on the agenda when everyone is fresh.",
                  "score": 2,
                  "created_utc": "2026-02-25 02:56:50",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7a1dbl",
                  "author": "TacoNomad",
                  "text": "Uhhh yes. The agenda should be updated for every meeting with specific topics and follow up from the prior meeting. \n\n\nInstead of asking what the update is, briefly reference the previous update, challenges, and then ask for the update on those things, plus other issues.\n\nAlso, insist that people come prepared to discuss their work/progress/issues.  If someone isn't prepared, skip them and come back.",
                  "score": 2,
                  "created_utc": "2026-02-25 05:39:12",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7c7rmj",
          "author": "TylertheDouche",
          "text": "This often happens to me with senior leadership. VPs will start the call and run it even though i’m the host. They never know how to end the call so it’s awkward and has some weird silence. At this point i just let it be weird.",
          "score": 5,
          "created_utc": "2026-02-25 15:20:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7amdkm",
          "author": "dhemantech",
          "text": "Sending meeting agendas, time quotas maybe standard and this will still happen. \n\nIf company and local (country etc.) permit you can very respectfully and tactfully divert the meeting back to the agenda. And even in these cultures expect a fallout of some sort.\n\nIn a rigid, more hierarchical culture, I doubt there is anything to be done.\n\nExpect some loss of time in such and similar issues across the project.",
          "score": 4,
          "created_utc": "2026-02-25 08:42:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7cdba6",
          "author": "BloodyTurnip",
          "text": "An additional hour?!\nHonestly I would just say \"we can take this out of the meeting\" or that a dedicated meeting should be organised.  I don't particularly care what status someone holds in a company, as the manager of the meeting our main role is to keep it on track and make sure the agenda is worked through imo. They're wasting everyone in the room's time and risking the planned discussion points not being resolved.  Not to mention no one is paying attention to a meeting that's gone on for an additional hour.\n\nI guess that could be a cultural thing, but you shouldn't have to be afraid of your boss when you're honestly just trying to do your job, and they sure as hell shouldn't be giving you negative feedback in a public meeting.",
          "score": 6,
          "created_utc": "2026-02-25 15:46:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ow5wy",
          "author": "Negative_Site",
          "text": "Sometimes you have to be the bull. That means taking power by force. Assert dominance. This is my meeting, we will stay with the agenda. Book your own meeting for those topics. We don’t have time now.",
          "score": 5,
          "created_utc": "2026-02-27 12:37:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o79cmci",
          "author": "Trickycoolj",
          "text": "“Let’s parking lot that and schedule a meeting to cover that topic. I’d like to keep us on agenda and honor the time of our presenters/attendees.”",
          "score": 8,
          "created_utc": "2026-02-25 02:57:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o793uge",
          "author": "Old_Cry1308",
          "text": "sounds like a classic case of power dynamics. maybe start by setting a clear agenda and time limits, and stick to them. if they derail, politely remind them of the agenda. also, consider side conversations for off-topic stuff.",
          "score": 4,
          "created_utc": "2026-02-25 02:08:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o794mdi",
              "author": "AcceptableCold8882",
              "text": "Thanks for the advice. Typically, I just go through a generic stand up meeting tracker and ask for updates from everyone present. Maybe I need to start asking specific questions so people can't go on tangents.\n\n  \nThe question that triggered the tangent was a specific question to another party before the boss chirped in. He's famous for that at my company. Everyone knows not to ask him a question late in the day because you'll be there past dinner",
              "score": 1,
              "created_utc": "2026-02-25 02:13:04",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7g0du1",
          "author": "analyteprojects",
          "text": "A few things I can add to the comments already made. When management wants to get involved in a standup (which should be a quick working meeting), as a PM I would always ask the question: \"what is your objective in attending the meeting?\". That will help you uncover what the leader is looking for and determine if their expectation can be met in another meeting instead. It could also help you uncover something you aren't serving in how you are communicating or managing and that then provides a path that eliminates this behavior. \n\nFor the engineer that has a different definition of \"done\" from the project's level of acceptance, establishing that clarity is likely going to resolve the issue. This could be done a few different ways. First, if a definition of done doesn't exist, try creating one that everyone agrees to. Then this can be referenced if people get fixated on something that goes beyond the idea of \"done\". Another option, is my preferred approach, which is to document success criteria in your project charter and then transfer these to applicable deliverables as \"acceptance criteria\". Clear acceptance criteria on work items can help to curb the behavior as an alternative to a \"definition of done\". This individual's behavior can also be a sign of feeling undervalued, so pay attention to offering kudos where due and to building rapport that shows them you do appreciate their investment and style, even if you object to some of their ideas.",
          "score": 3,
          "created_utc": "2026-02-26 02:29:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o791mx0",
          "author": "AutoModerator",
          "text": "Hey there /u/AcceptableCold8882, have you checked out the [wiki page](https://www.reddit.com/r/projectmanagement/wiki/index) on located on r/ProjectManagement?  We have a few cert related resources, including a list of certs, common requirements, value of certs, etc.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/projectmanagement) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-25 01:55:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o84tiic",
          "author": "Rufawana",
          "text": "\"let's take that off-line\"",
          "score": 1,
          "created_utc": "2026-03-01 22:46:34",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rgkpsh",
      "title": "Clients think everything is \"easy now\" because of AI. How are you dealing with that late in projects?",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1rgkpsh/clients_think_everything_is_easy_now_because_of/",
      "author": "oscarnyc1",
      "created_utc": "2026-02-27 22:15:47",
      "score": 24,
      "num_comments": 8,
      "upvote_ratio": 0.89,
      "text": "I keep seeing scope creep difficulties answered with “just have a better SOW.” \n\nBut lately that hasn’t been my problem. Our clients see Cursor / Base44 and assume late changes are basically free. So near launch it’s always \"can we also add this, it shouldn’t take long\" and we end up working weekends. \n\nAt that point, you either say no and try to charge it (or risk the relationship) or say yes and eat it. \n\nFor the PMs working at agencies: what do you actually do in that situation?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/projectmanagement/comments/1rgkpsh/clients_think_everything_is_easy_now_because_of/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o7sk01q",
          "author": "More_Law6245",
          "text": "Here is a couple of things to keep in mind with Scope of Work (SOW) creep:\n\n* The amount of change requests in a project is a quality indicator of your business case and or SOW. The more change request you have the more you know that your business case or original SOW is unfit for purpose. So the first question is, does the client really know what they want or is your organisation not engaging properly?\n* Your triple constraint of time, cost and scope becomes your only priority and you only manage the exceptions.  As an example, if I'm to deliver a blue widget (scope) and the client said they now want a blue widget with gold wings (scope change) and because of the triple constraint model that immediately tells you that the time and cost must change. It's a causal and effect model and you need to ask your client which indicator do they want to change because the other two must change. It's a very good way to stop a client's scope creep because as the PM you're pushing the responsibility back on to the client to make a decision in what they want it to change. (It quickly flushes out if they really want the change especially if it's going to cost them or they're just trying it on to get something out of scope for free under the guise of client relationships).\n* As the PM if you allow scope creep in reality you're on the hook for a non/less profitable projects and by allowing scope creep it has flow on effects and not just at the project level, it can effect everything from licensing, support, maintenance, contractual, warranty, operational resources availability and you will earn a reputation very quickly if you keep on throwing dead cats over the fence at the end of your project.\n* Choosing \"when to eat it or not\" is a difficult challenge because there are many variables that need to be taken into consideration but it mostly comes back to two calls (which is generally not made by the PM, it's made by the project board/sponsor/executive) it can be the standard +/- 10-15 % of the total value of the project (generally the profit margin of the project) or the other is an organisational strategic call (treat it as a leader loss for an important client or more work, again not a PM's call).\n* As you become a more experienced practitioner you will become more adept at pushing back on the client, it's about confidence and enforcing your triple constraints, setting and maintaining the client's expectations. Simply put if they keep on changing the requirements you keep pushing out the end dates and costs. The client will come to learn that it's not a free for all and if you have problems then you escalate to your project board/sponsor/executive to make an informed decision.\n* AI has nothing to do with the triple constraints! you need to teach and inform your client, it's a contractual and working relationship not a technology relationship.\n\nJust an armchair perspective.",
          "score": 15,
          "created_utc": "2026-02-27 23:51:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7ttjo7",
              "author": "Logical-Bookkeeper77",
              "text": "Amount of change has nothing to do with quality of business case.\n\nIf you ever work / studied Agile. \n\nA change to SoW is different from having change requests. A client can know they want a chair, but they may not know exactly the color or the final chair or may be slight update of the height. …etc.\n\nWhich is the whole point of agile.\n\nThe way to address this is \n1) don’t say no, say how much \nAnd \n2) point out that the flaw in their suggestion, that while in isolation base44 is quick, but the integration and security and fitting it into the whatever framework still needed work which is why it’s not free nor fast.\n\nIf it’s an agile project it gets slightly trickier on what’s a scope creep since one of the expectation of agile is iteration that continually tuned to the desired product. Read the contract / agreement and see if it’s absolutely beyond shadow of a doubt scope creep.\n\nDon’t just “eat it”, document the change, if it’s something you agree to do. \nOr refuse, or documented the new updated scope but with extra cost.\n\nPoint is to make sure it’s agreed with all parties and being transparent of the process.\n\nWhen user sees you explain things clearly and given some insight to the why, they usually appreciate it.",
              "score": 3,
              "created_utc": "2026-02-28 04:38:40",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7s5eo6",
          "author": "babybambam",
          "text": "Yeah...you need a better statement of work that spells out how changes are going to be handled, including an escalation fee as you hit development periods.\n\nIt should be insanely expensive to have significant changes within a couple of weeks of launch.  \n\nYour SOW fee structure should also encourage deferring additional changes to a future iteration.",
          "score": 5,
          "created_utc": "2026-02-27 22:29:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7si57v",
              "author": "Hungry_Raccoon_4364",
              "text": "Phase 2… I love it…\nI always say “we can take a look at that change in Phase 2h",
              "score": 3,
              "created_utc": "2026-02-27 23:40:44",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7s5sev",
          "author": "littlelorax",
          "text": "Would highly depend on the type of agreement. If they paid a retainer and are ok with us billing extra hours? Yeah baby, sign on the line. I would just make sure the new scope was documented and agreed before doing it.\n\n\nIf they are paying by the milestone or deliverable, then it is outside what was agreed and needs to get the account or sales team to add a change order. \n\n\nEven if AI can help streamline, you bring value in doing it correctly and proof reading whatever AI outputs to ensure quality. Some companies are willing to charge cheap for quick fixes, but if your agency doesn't want to risk their reputation by producing product they aren't proud of, then the customer has to pay.",
          "score": 3,
          "created_utc": "2026-02-27 22:31:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7s6xj6",
          "author": "Erocdotusa",
          "text": "I would push for change order and indicate impact to delivery schedule.  Or get post launch support agreement lined up and make this a fast follow item under that agreement",
          "score": 3,
          "created_utc": "2026-02-27 22:37:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7sf9in",
          "author": "Outrageous-Pizza-66",
          "text": "My response would be to those clients… “Does AI deal with your expectations?”",
          "score": 2,
          "created_utc": "2026-02-27 23:23:55",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1ri6jef",
      "title": "How do you handle the early stages of a project?",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1ri6jef/how_do_you_handle_the_early_stages_of_a_project/",
      "author": "BearyTechie",
      "created_utc": "2026-03-01 19:29:45",
      "score": 18,
      "num_comments": 19,
      "upvote_ratio": 0.95,
      "text": "How do you handle unknowns during the early stages of a project when stakeholders have not yet been fully identified and the project team is not yet formed?\n\nHere is the current situation. Sr. Director of engineering started the project and the scope is not defined. There is no BA or anyone to prepare that scope document. We don't even know what stakeholders want yet.  \nThe Sr Engineers on the team will only maintain the product when the project is completed. The remaining engineer who is supposed to work on the project is a new grad and we are still interviewing additional engineers. The PM is asked to have daily meetings with these engineers",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/projectmanagement/comments/1ri6jef/how_do_you_handle_the_early_stages_of_a_project/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o85bwmm",
          "author": "SoftResetMode15",
          "text": "this is one of those moments where slowing down actually protects the project. before daily meetings with engineers who do not yet have a defined scope, i would recommend running a short discovery sprint focused only on clarifying purpose and stakeholders, even if it is just you and the sr director to start. one concrete step is to draft a simple one page brief that outlines the problem you believe you are solving, who is affected, and what success would look like, then circulate it to potential stakeholders to validate or correct it. that usually surfaces missing voices quickly and gives the new grad some context instead of daily standups with no direction. i would also document assumptions and unknowns openly so leadership sees the risk of moving forward without alignment. before execution starts, i would schedule a review checkpoint with the sponsor to confirm scope, stakeholders, and team capacity, because without that approval you are just managing motion, not a project.",
          "score": 15,
          "created_utc": "2026-03-02 00:33:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o860mnn",
              "author": "nphare",
              "text": "I typically called the S0 for sprint zero. Sounds needed here for sure",
              "score": 2,
              "created_utc": "2026-03-02 03:04:49",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o83uf46",
          "author": "Logical-Bookkeeper77",
          "text": "https://preview.redd.it/xhvoazw2mhmg1.jpeg?width=640&format=pjpg&auto=webp&s=b834f85b4d73fe4dcf9579f0822926599abbf435",
          "score": 12,
          "created_utc": "2026-03-01 19:44:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o83t6o1",
          "author": "CollazoandCo",
          "text": "Early stage chaos is normal. The mistake is pretending it’s not.\n\nWhen stakeholders aren’t identified and the team isn’t formed, I don’t try to force execution. I shift into discovery mode.\n\t1.\tDefine the problem before the solution.\nWhat business pain triggered this? Who feels it? Who benefits if it’s solved? That usually surfaces your real stakeholders fast.\n\t2.\tMap influence, not just titles.\nEarly on, I build a rough stakeholder heat map: decision-makers, budget holders, impacted teams, and hidden influencers. It won’t be perfect. That’s fine. It evolves.\n\t3.\tCreate a lightweight charter.\nEven if it’s scrappy. Purpose, success criteria, constraints, assumptions, known risks. Assumptions are gold at this stage. Write them down so they can be challenged.\n\t4.\tTime-box the ambiguity.\nI’ll run a 1–2 week “definition sprint” before formal kickoff. Output = clarified scope, identified core team, initial risk register.\n\t5.\tCommunicate uncertainty openly.\nEarly projects fail because leaders want false certainty. I’d rather say “Here’s what we know, here’s what we’re testing, here’s what we don’t know yet.”\n\nYou don’t eliminate unknowns in early stages. You convert them into assumptions, then into validated decisions.\n\nTrying to lock scope before alignment is how projects get sideways.",
          "score": 11,
          "created_utc": "2026-03-01 19:38:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o84p85s",
          "author": "TheJoeCoastie",
          "text": "This is less a project and more a situation someone decided to call a project. That distinction matters because it changes how you operate.\n\nWhen scope, stakeholders, and team are all undefined simultaneously, your job as PM shifts. You are not managing execution yet; you are creating the conditions for execution to eventually be possible. Those are different skills and a different mindset.\n\nThe most useful thing you can do right now is document every assumption, gap, and unknown in a simple log and get it in front of the Sr. Director. Not as a complaint, as a mirror. Most sponsors in this situation genuinely do not see the chaos they have created until someone puts it plainly in writing.\n\nIn my opinion, the daily standups with a new grad and a maintenance-only engineering team are not standups; they are relationship building. Use them to surface unknowns, not report progress. There is no progress yet, and pretending otherwise just burns trust early.",
          "score": 10,
          "created_utc": "2026-03-01 22:23:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o855y7g",
              "author": "BearyTechie",
              "text": ">you are creating the conditions for execution to eventually be possible. Those are different skills and a different mindset.\n\nIdeally who is responsible for creating those conditions if not the Project Manager? I guess it has to be someone with authority. right?",
              "score": 2,
              "created_utc": "2026-03-01 23:58:15",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o85afew",
                  "author": "TheJoeCoastie",
                  "text": "Great question and it cuts to something the PM profession gets wrong about its own role pretty regularly.\n\nTechnically, the project sponsor is responsible for creating the conditions for execution. That means securing funding, clearing organizational blockers, defining the mandate, and ensuring the right people are actually assigned. The PM cannot hire engineers, force a Sr. Director to define scope, or compel stakeholders to show up. Those levers belong to someone with organizational authority.\n\nThe PM’s job in that ambiguous early stage is to make the gap visible and undeniable. Document every assumption, unknown, and missing input, then put it in front of the sponsor clearly. Not as a complaint, as a mirror. Most sponsors in this situation genuinely do not see the chaos they have created until someone lays it out plainly.\nSo yes, it has to be someone with authority. But the PM owns the signal. The sponsor owns the response to it.\n\nWhere PMs burn out is when they confuse responsibility to surface a problem with an obligation to solve it unilaterally. You do not have the authority to fix a staffing gap or force scope definition. What you do have is the ability to make sure nobody can later claim they did not know.",
                  "score": 6,
                  "created_utc": "2026-03-02 00:24:28",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o83t58f",
          "author": "Stebben84",
          "text": "You don't. You let the project team and stakeholders determine the unknowns.",
          "score": 6,
          "created_utc": "2026-03-01 19:37:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o83wvcb",
              "author": "BearyTechie",
              "text": "What is the PM supposed to focus on during that stage? ",
              "score": 2,
              "created_utc": "2026-03-01 19:56:37",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o83xnz6",
                  "author": "JohnMcAfeewaswhackd",
                  "text": "Facilitate the discussions that define the requirements and make sure they are logged in the correct documents.",
                  "score": 4,
                  "created_utc": "2026-03-01 20:00:38",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o84o0km",
          "author": "More_Law6245",
          "text": "Your business case defines your project scope, it sounds like you don't have a completed and approved business case because you can't define your scope of work.  ",
          "score": 5,
          "created_utc": "2026-03-01 22:16:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o846nik",
          "author": "MattyFettuccine",
          "text": "So in your scenario, the project hasn’t started yet. You do all those things you identified as not being done yet, then you start the project.",
          "score": 4,
          "created_utc": "2026-03-01 20:46:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o84jzbx",
          "author": "clearwaterrev",
          "text": "You ask the project sponsor to define the goal and high level scope of the project, the stakeholders responsible for providing requirements, and to resource the project with the necessary team members, like a BA. \n\nThere is no project until there is some high-level scope and a project team. There's nothing you can manage or facilitate until the project sponsor defines what it is this project is supposed to accomplish, who is supposed to work on the project, and perhaps also whether there are specific funding or timeline constraints you need to work within.",
          "score": 3,
          "created_utc": "2026-03-01 21:55:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o8709xi",
          "author": "Immediate-Actuator85",
          "text": "As a PM, you need to meet with this sr engineer and define the project and document that.  This can be done through the use of a project charter. You need to interview him and define and document the business objective of the project, milestone tasks, scope (at a high level to start), risks, constraints (like project due date), resources that need to be involved . That would include the people making up the project team in addition to systems and or organizations involved.\n\nOnce this is drafted up, you can have a kick off meeting with the team and review the charter with them and make sure everyone is on the same page but the project owner (sr engineer ) has the final say on those components of the charter.  This is what I woukd call an in initiation/ discovery phase of a project.\n\nOnce that is settled, then you start the planning phase which is have the team identify the tasks under the milestones that have been identified. The tasks have to be assigned to a person and a timeframe for completion.  This will result in a project plan/schedule and then you start executing against that plan.",
          "score": 2,
          "created_utc": "2026-03-02 07:42:05",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rd7bsu",
      "title": "Spent way too long researching PSA tools. Here's what actually separates them",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1rd7bsu/spent_way_too_long_researching_psa_tools_heres/",
      "author": "xX_StarXMoon_Xx",
      "created_utc": "2026-02-24 05:14:39",
      "score": 17,
      "num_comments": 6,
      "upvote_ratio": 1.0,
      "text": "Been going pretty deep on the PSA software category lately and figured this might save someone else some time.\n\nMost of these tools look similar on the surface but they're actually pretty different once you get into how billing works and how complex your operations are.\n\nBQE Core tends to get strong marks for billing accuracy, especially for smaller firms. Very accounting-first. The tradeoff that comes up in reviews is that resource planning and multi-entity setups get clunky at scale.\n\nKantata is genuinely enterprise-grade. The resource and workload planning is where it gets consistent praise. But implementation is a real investment, and that comes up a lot in mid-market evaluations as a concern.\n\nOpenAir makes a lot more sense if you're already a NetSuite shop. If not, that ecosystem dependency becomes its own question to answer before anything else.\n\nScoro gets described in most comparisons as more of a full business ops platform than a pure PSA. Solid if you want CRM baked in, but probably more than you need if billing and project delivery are the core problem.\n\nRuddr is newer and gets solid reviews for UX, especially for smaller consultancies. Less depth on complex billing scenarios from what's out there so far.\n\nBigTime comes up a lot in the context of quote-to-cash (the full flow from proposal to invoice in one place) and the QuickBooks and Sage Intacct integrations get mentioned frequently. There's also a Projector acquisition that expanded the enterprise side of things.\n\nWhat's driving your evaluation? Happy to go deeper on any of these depending on what you're actually trying to solve.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/projectmanagement/comments/1rd7bsu/spent_way_too_long_researching_psa_tools_heres/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o734ghn",
          "author": "AutoModerator",
          "text": "Attention everyone, just because this is a post about software or tools, does not mean that you can violate the sub's 'no self-promotion, no advertising, or no soliciting' rule.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/projectmanagement) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-24 05:14:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o734gip",
          "author": "AutoModerator",
          "text": "Hey there /u/xX_StarXMoon_Xx, Have you looked at our \"Top 100 books post\"? Find it [here](https://www.reddit.com/r/projectmanagement/wiki/index/books).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/projectmanagement) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-24 05:14:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o735rhq",
          "author": "Old_Cry1308",
          "text": "sounds like a rabbit hole. glad you did the digging though.",
          "score": 1,
          "created_utc": "2026-02-24 05:24:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7b85ue",
          "author": "Confident-Ant1714",
          "text": "We recently went through the same exercise and picked [magnetic.app](http://magnetic.app) which so far has been a great experience. Our team loves it. It's simple and easy for our users to navigate yet very customisable. ",
          "score": 1,
          "created_utc": "2026-02-25 11:55:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7oddzl",
          "author": "NewZealandTemp",
          "text": "From what I've read on G2 and in threads like this, BigTime tends to come up pretty consistently when people compare PSA tools specifically around quote-to-cash. A lot of reviews call out the QuickBooks and Sage Intacct integrations as a reason firms pick it over tools that require a separate accounting sync. Worth putting on the list if that workflow gap is what you're trying to close.",
          "score": 1,
          "created_utc": "2026-02-27 10:04:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o84hiu6",
          "author": "dickhalluk",
          "text": "Implementation load matters more than people think. Some PSAs are powerful but require serious internal bandwidth. BigTime usually gets mentioned as a middle ground option that supports quote to cash without a massive rollout",
          "score": 1,
          "created_utc": "2026-03-01 21:42:36",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rdak4k",
      "title": "Have you built effective automated workflow?",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1rdak4k/have_you_built_effective_automated_workflow/",
      "author": "Haunting_Month_4971",
      "created_utc": "2026-02-24 08:15:53",
      "score": 16,
      "num_comments": 20,
      "upvote_ratio": 0.94,
      "text": "I am curious about automated workflow. Like I want to automate the full meeting cycle to connect pre-meeting prep, live notes, and follow-up actions into one workflow. For example, pulling context from previous meetings before a call starts, running a real-time meeting assistant during the call to capture decisions, then auto-generating follow-up tasks and summaries afterward. I wonder have you built any effective workflows with lean tool stack? What parts of the workflow actually saved time versus adding complexity?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/projectmanagement/comments/1rdak4k/have_you_built_effective_automated_workflow/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o73pjpw",
          "author": "AutoModerator",
          "text": "Attention everyone, just because this is a post about software or tools, does not mean that you can violate the sub's 'no self-promotion, no advertising, or no soliciting' rule.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/projectmanagement) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-24 08:15:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o73uus6",
          "author": "larkeowl",
          "text": "Yes! At my last job I built a solution using Microsoft Power Platform. It worked as follows:\n- pulled all the meeting information from the user(s) calendar and allow creation of an instance in the tool.\n- allowed actions to be added against the meeting either ahead of, during, or following the meeting.\n- allowed actions owners were automatically notified\n- allowed sending of a consolidated list of meeting notes and actions from the tool.\n- connected meeting instances together so you could see previous outcomes\n- connected with a powerbi dashboard to embed directly into PowerPoint slides to automate performance management \n- users could see their assigned actions from any meeting instances together one place, and got regular reminders (as needed).\n- allowed users to create their own action plans, personal actions or team plans - all in one place.\n- started to pull in actions from other tools \n\nIt was a huge help and saved us hours a week!",
          "score": 8,
          "created_utc": "2026-02-24 09:06:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7463xe",
              "author": "Logical-Bookkeeper77",
              "text": "So much work when you can just use teams with copilot for 80% of it without lifting 2 fingers.\n\nHonestly you sounded like you don’t want to do the PM work from your summary.",
              "score": -15,
              "created_utc": "2026-02-24 10:51:42",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o74brh9",
          "author": "didyou_not",
          "text": "Co-pilot does the majority of this",
          "score": 3,
          "created_utc": "2026-02-24 11:39:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o74jvfj",
          "author": "buildlogic",
          "text": "My friend and I built a fully automated meeting machine and the biggest win wasn’t fancy pre-reads, it was auto-shipping clean summaries and action items to the right place within minutes. Just keep the stack boring and tight, automate the handoffs, and leave one small human checkpoint so you don’t create task chaos.",
          "score": 3,
          "created_utc": "2026-02-24 12:38:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o74r4gl",
              "author": "Smooth-Trainer3940",
              "text": "Sounds useful",
              "score": 1,
              "created_utc": "2026-02-24 13:23:19",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7h6pwl",
          "author": "FindingBalanceDaily",
          "text": "I understand the pull to connect the whole meeting cycle, especially if your team is juggling a lot. In my experience, the real time saver is clarity, consistent agendas and clear owners, then adding light automation for summaries or action tracking. When everything is stitched together end to end, it can create more maintenance than value if no one owns it.\n\nI would pilot it with one recurring meeting before rolling it out wider.",
          "score": 3,
          "created_utc": "2026-02-26 07:25:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o74r1he",
          "author": "Smooth-Trainer3940",
          "text": "I am a fan of workflow automation. There are repetitive aspects of my job that I have to do daily, so I started using tools to automate them. One underrated tool that I recommend is Text Blaze. More than just a text expander",
          "score": 2,
          "created_utc": "2026-02-24 13:22:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7814jw",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 2,
          "created_utc": "2026-02-24 22:36:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7p15d3",
              "author": "projectmanagement-ModTeam",
              "text": "Thanks for your post/comment.  \n\nWe removed this post because it's in direct violation of our \"solicitation / self-promotion” rule.  \n\nPlease review these rules, which can be found in the sidebar.\n\nThanks,\nMod Team",
              "score": 1,
              "created_utc": "2026-02-27 13:10:21",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o79m0a6",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 2,
          "created_utc": "2026-02-25 03:52:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7bc8lq",
              "author": "projectmanagement-ModTeam",
              "text": "Thanks for your post/comment.  \n\nWe removed this post because it's in direct violation of our \"solicitation / self-promotion” rule.  \n\nPlease review these rules, which can be found in the sidebar.\n\nThanks,\nMod Team",
              "score": 1,
              "created_utc": "2026-02-25 12:25:15",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o74e933",
          "author": "Ok-Midnight1594",
          "text": "You can also do this with tools like Make.com or n8n or even natively in Airtable or SmartSuite.",
          "score": 1,
          "created_utc": "2026-02-24 11:58:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7462ga",
          "author": "Logical-Bookkeeper77",
          "text": "\nHonestly you sounded like you don’t want to do the PM work from your summary.",
          "score": -10,
          "created_utc": "2026-02-24 10:51:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o75120u",
              "author": "OuterInnerMonologue",
              "text": "Finding efficiencies is pretty crucial for a pm. Very unfortunate mindset you got there. \n\nIm 15+ years into being a pm and while im still not above any little task my job requires, it gets real hard to keep up when you’re juggling several projects and  8 hours of meetings some days with being double booked. \n\nIf you can automate something, and can do it correctly, thats just working smarter.",
              "score": 3,
              "created_utc": "2026-02-24 14:17:25",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1rg0olb",
      "title": "looking for slack-first project management tool",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1rg0olb/looking_for_slackfirst_project_management_tool/",
      "author": "Character-Letter4702",
      "created_utc": "2026-02-27 07:59:44",
      "score": 15,
      "num_comments": 19,
      "upvote_ratio": 0.94,
      "text": " our team runs a software & marketing company and basically everything happens in slack. we've tried a few different pm tools but the problem is always the same. everyone talks about work in slack but then forgets to update whatever board we're using. so the tool shows one thing and reality is something completely different happening in our channels. what we're really looking for is:\n\n     •something that actually integrates with how we work in slack\n\n     •not just notifications but real task management inside slack\n\n     •ability to see project status without leaving slack or opening another tab\n\n     •simple enough that people will actually use it consistently\n\n     •Works inside the conversations we’re already having open to suggestions especially from slack heavy teams. what's working well for you?\n\n Thanks\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/projectmanagement/comments/1rg0olb/looking_for_slackfirst_project_management_tool/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o7o077b",
          "author": "AutoModerator",
          "text": "Attention everyone, just because this is a post about software or tools, does not mean that you can violate the sub's 'no self-promotion, no advertising, or no soliciting' rule.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/projectmanagement) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-27 07:59:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7o5bw0",
          "author": "Any_Refuse2778",
          "text": "we gave up and just accepted we need two systems. slack for communication and a real pm tool for tracking. not ideal but trying to force everything into slack created more problems.",
          "score": 7,
          "created_utc": "2026-02-27 08:47:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7o3y5w",
          "author": "shy_guy997",
          "text": "honestly don't think this exists. slack isn't built for project management so everything feels like a workaround.",
          "score": 3,
          "created_utc": "2026-02-27 08:34:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7o37fa",
          "author": "The_possessed_YT",
          "text": "this is the exact problem we had. tried like 5 tools and they all just spam slack with notifications. nobody wants another place to go update stuff.",
          "score": 2,
          "created_utc": "2026-02-27 08:27:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7o3q19",
          "author": "Relative-Coach-501",
          "text": "someone on our team installed chaser (the Slack plugin) and it's been working well for this. tasks stay in the threads where we're already discussing them. way better adoption than tools we tried before.",
          "score": 2,
          "created_utc": "2026-02-27 08:32:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7p3xtf",
          "author": "frufruityloops",
          "text": "Linear maybe",
          "score": 2,
          "created_utc": "2026-02-27 13:26:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7s7p8d",
          "author": "Cultural_Bed287",
          "text": "If your team lives in Slack, the tool has to operate there natively. Otherwise conversations stay in Slack while tasks drift somewhere else.\n\nA Slack-native service desk approach tends to work better than traditional board-first PM tools. Siit, for example, runs directly inside Slack so messages can be converted into tickets within threads, ownership and status updates happen in-channel, and project visibility doesn’t require opening another tab.\n\nWhen task management exists inside the same conversations where work happens, the system stays aligned with reality.",
          "score": 2,
          "created_utc": "2026-02-27 22:41:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7o2qky",
          "author": "codedrifting",
          "text": "\nwe use monday with the slack integration but honestly it's just notifications. still have to leave slack to actually do anything which defeats the purpose.",
          "score": 1,
          "created_utc": "2026-02-27 08:23:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7o2qwd",
          "author": "Plenty-Cry-1575",
          "text": "asana slack bot helps a bit but yeah it's mostly just alerts. not really managing anything from slack itself",
          "score": 1,
          "created_utc": "2026-02-27 08:23:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7o9x81",
          "author": "depressedrubberdolll",
          "text": "linear has good slack integration for engineering teams. can create issues from slack and get updates back. not perfect but better than most.",
          "score": 1,
          "created_utc": "2026-02-27 09:31:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7oexqk",
          "author": "TH_UNDER_BOI",
          "text": "the problem is slack's interface isn't designed for task management. even  with integrations it feels awkward trying to manage projects there.",
          "score": 1,
          "created_utc": "2026-02-27 10:19:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7okydh",
          "author": "Sophistry7",
          "text": "same boat here. if you find something that actually works let me know. everything we've tried is either too limited or just becomes notification spam.",
          "score": 1,
          "created_utc": "2026-02-27 11:12:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ou5i3",
          "author": "Flaky_Value6753",
          "text": "I'm not sure you're going to find a tool that integrates that well with slack. I use JIRA and meet with our DEV teams to go through their work there and make updates.",
          "score": 1,
          "created_utc": "2026-02-27 12:23:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7pgafr",
          "author": "MattyFettuccine",
          "text": "I’ve been using monday.com for ages and it’s not the best solution for what you’re looking for, however I’ve started integrating Claude into both monday and Slack via MCP and it’s pretty close now.",
          "score": 1,
          "created_utc": "2026-02-27 14:35:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7tzibc",
          "author": "oddslane_",
          "text": "We ran into the same issue where Slack was the real source of truth and the PM tool was just… aspirational. The only setups that stuck were the ones where tasks could actually be created and updated from inside Slack threads, not just pushed as notifications. Tools like ClickUp and Asana have decent Slack actions, and Linear is pretty smooth if you are more product focused, but it still takes some behavior change. One thing that helped us was making it a rule that any decision made in a thread had to immediately become a task before the convo moved on. Slight friction up front, but it kept the board closer to reality.\n\nHow big is your team? I’ve found the smaller the team, the more realistic it is to stay mostly Slack native without the system breaking down.",
          "score": 1,
          "created_utc": "2026-02-28 05:22:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7uwjx7",
          "author": "ttsoldier",
          "text": "Did you try Linear?",
          "score": 1,
          "created_utc": "2026-02-28 10:21:18",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rg4hqm",
      "title": "Decisions made in meetings often never happen — anyone else struggle with this?",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1rg4hqm/decisions_made_in_meetings_often_never_happen/",
      "author": "AsesinoYT",
      "created_utc": "2026-02-27 11:44:07",
      "score": 15,
      "num_comments": 33,
      "upvote_ratio": 0.78,
      "text": "I’ve noticed that in a lot of teams, something is decided in a meeting… and then it just disappears. Deadlines get missed, follow-ups get lost, and sometimes nobody even remembers who was supposed to do what.\n\nI’m curious — how do your teams make sure that decisions actually get done? Any stories of things going wrong (or really well) would be great to hear",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/projectmanagement/comments/1rg4hqm/decisions_made_in_meetings_often_never_happen/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o7sdz8y",
          "author": "Visual_Strength8972",
          "text": "Write it down. Put it in the plan, the tracker, a reminder, wherever. Always have a due date, and owner. PM 101.",
          "score": 18,
          "created_utc": "2026-02-27 23:16:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7opeta",
          "author": "QueerMuseumGal",
          "text": "Decision log for every meeting that gets sent after each. Clear agreements on responsibility in the meeting so there's no surprises. And honestly as PM I see it as my job to make sure its not forgotten. Put in follow up meetings, chase actions, call and ask how they're getting on and if they need me to remove blockers",
          "score": 15,
          "created_utc": "2026-02-27 11:48:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7opi07",
              "author": "AsesinoYT",
              "text": "Do you think if it's worth automating?",
              "score": -5,
              "created_utc": "2026-02-27 11:49:32",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7opk2z",
                  "author": "QueerMuseumGal",
                  "text": "If whats worth automating?",
                  "score": 3,
                  "created_utc": "2026-02-27 11:49:58",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7oqu6k",
          "author": "Time-For-Toast",
          "text": "That's your job to do! That may be revising the scope of work, (re)setting someone to work, who knows all depends on the nature of the decision but it's absolutely on the PM to convert a decision into implementation, drive it forward, and to ensure the implications of the decision are clearly cascaded through the team so that everyone has clarity on what's now expected of them.",
          "score": 13,
          "created_utc": "2026-02-27 11:59:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7p371u",
          "author": "Aggravating_Hippo546",
          "text": "All. The. Time. Even with constant reminders. I also find people rehash things over and over. It’s exhausting. I tend to remember most decisions made on projects without reviewing notes, maybe this is why we are PMs because we have that retention skill and are able to point it out.",
          "score": 8,
          "created_utc": "2026-02-27 13:22:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7qcuuv",
          "author": "SVAuspicious",
          "text": "You have a process and/or culture problem. \n\nDecisions go somewhere. \n\nDecisions may be in the form of an action item which should have a charge number for the task they apply to. \n\nDecisions may be a course of action within an existing task in which case they are captured in the appropriate documentation (requirements, specification, architecture, design, test). \n\nDecisions may change a process in which case they are captured in documentation. \n\nIf a decision changes scope e.g. adds a task to the baseline they go to scope management for adjudication and cost and schedule impact. \n\nIf you don't have a baseline you aren't managing your project as a project which is a bigger problem. ",
          "score": 8,
          "created_utc": "2026-02-27 17:11:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7sa3ez",
          "author": "musicpheliac",
          "text": "If I'm leading the meeting, I'm also taking notes, sending them as a follow up email, and then following up hours/days/weeks later to make sure all those unorganized forgetful people finally do what we agreed they'd do. ",
          "score": 6,
          "created_utc": "2026-02-27 22:54:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7osfcn",
          "author": "elegant_eagle_egg",
          "text": "Please tell me that you are not the project manager for the project",
          "score": 11,
          "created_utc": "2026-02-27 12:11:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7owmxw",
          "author": "jthmniljt",
          "text": "In the follow up meeting I go over the decisions from last week. That’s helps.",
          "score": 7,
          "created_utc": "2026-02-27 12:41:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7oy2qw",
          "author": "sdarkpaladin",
          "text": "Minutes after the meeting. Get the participants to sign off if you have to.\n\nDraft up a schedule forecast with milestones and timelines.\n\nRemind people when milestone and timelines are going to be missed.\n\nRe-do if needed.\n\nHow do people miss decisions made in a meeting? What's the meeting for then!?",
          "score": 6,
          "created_utc": "2026-02-27 12:50:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7r21rv",
          "author": "analyteprojects",
          "text": "Here's how I would address this:  \n1. Ensure the need for a decision is clearly on a meeting agenda.  \n2. Following the discussion in the meeting recap the decision you have heard and capture it in the minutes. State clearly something like: the decision I heard is...  \n3. In addition to deciding what to do, establish who is accountable for the delivery of the decision outcome.   \n4. Establish a deadline for the decision outcome to be delivered by.   \n5. Follow-up after the meeting with clear notes that remind folks of the decisions made and who is accountable.   \n6. Follow-up with the person accountable to deliver on the decision in a timeline relevant to the established deadline. ",
          "score": 5,
          "created_utc": "2026-02-27 19:11:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7w6w7e",
          "author": "Responsible_Entry_11",
          "text": "This phenomenon is lack of PM leadership - and is why people generally view meetings as wasteful.\nPMP training is mostly about the responsibility of a PN to deliver results- that means taking ownership of getting people to take action.",
          "score": 5,
          "created_utc": "2026-02-28 15:39:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7pkw5u",
          "author": "ttsoldier",
          "text": "If it’s a project based meeting, a task should be created and assigned to the person in the relevant project \n\nIt its not a project based meeting, a task should also be created somewhere else. We use a separate tool for non project specific tasks .",
          "score": 9,
          "created_utc": "2026-02-27 14:58:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7p0gwm",
          "author": "Atemz",
          "text": "I mean, sure some things inevitably end up falling thru thr cracks, but it is my duty to document and follow up on any decisions that might be taken on weekly forums.\n\nSend minutes after every meeting, and start the following meeting by quickly gling over the minute. This gives everyone a quick recap, and allows you to ask for status updates on any drcision that might have been taken during the previous meeting.",
          "score": 5,
          "created_utc": "2026-02-27 13:06:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7s8qbh",
          "author": "Suchiko",
          "text": "It needs to go in the actual plan and become part of the job, not some random disconnected email/document that no one will ever read again. The key phrase is a *single* point of truth.",
          "score": 3,
          "created_utc": "2026-02-27 22:47:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ot1hn",
          "author": "Prestigious-Layer457",
          "text": "Do you use a RAID log? All that information is input into the RAID log and you circle back to it at least weekly to ensure things are being implemented. I’m not trying to be condescending but that is like PM 101 stuff.",
          "score": 5,
          "created_utc": "2026-02-27 12:15:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7oww4p",
          "author": "karlitooo",
          "text": "Er no, wtf?",
          "score": 1,
          "created_utc": "2026-02-27 12:42:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ovs1u",
          "author": "timevil-",
          "text": "Are the decisions part of your meeting agenda (under Goals) ?\nDo you have any Agenda?  (this is where most new people fail)",
          "score": 1,
          "created_utc": "2026-02-27 12:35:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ow29v",
          "author": "pechugasmcgee",
          "text": "Decision drifting.",
          "score": 0,
          "created_utc": "2026-02-27 12:37:14",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rdka0s",
      "title": "Project off track. Need good summary for board with next steps",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1rdka0s/project_off_track_need_good_summary_for_board/",
      "author": "SugarInvestigator",
      "created_utc": "2026-02-24 16:06:07",
      "score": 12,
      "num_comments": 18,
      "upvote_ratio": 0.93,
      "text": "Looking for advice on best apprach out of a project thats in chaos. I'll admit I'm partially to blame also due to not standing up to some individuals and allowing scope creep. \n\nSo project started 1 year ago, basically an IT upgrade, hardware procurement, app upgrade and data migration. In that  time 2 board approved changes in scope. All straight forward so far. \n\nScope changes\n 1) addition of preproduction environment. Simple enough just extended schedule and cost\n2) changes in hardware requirements. This is where it gets problematic. One of the board (my line manager and reaponsible for my contract renewal) has used this CR to ram in a pet technology he wants for a new tech without having to go through approvals for it. I missed it (didnt realise the inpact and was told it would take 3 weeks to implement) and the change was approved by the board. \n\nProblem is now we are 6 months late because of this addition of the different tech. Budget is blown because of the unforseen costs of the scope creep and (I'll admit) my failure to account for the costs of the 2 CRs and revise the budget earlier. \n\nNow I need to present to the board and outline the issues, projected costs and path to success (and not get fired)\n\nI'm baffled how to phrase it, maybe I'm too close to the problems. But issues are\n1) poc caused significant delays and cost over run\n2) costs of changes not factored in earlier and budget revised. Now I need to revise the budget and hardware costs have gone up by nearly 200%\n3) uncertainty on when hardware is going to be available. Basically the poc guy manages hardware and he's dragging his behind on deciding soec and saying it ain't my concern. But this project depends on the availability of the hardware and is supposed to fund the price.\n4) person that rammed stuff in is difficult and confrontational. Can't openly pin blame on them as it will become antagonistic \n\nLooking for a way to summarise this and provide a decent path to green and no matter what I write it just doesn't seem to highlight how the scope creep and governance failures  have impacted everything. ",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/projectmanagement/comments/1rdka0s/project_off_track_need_good_summary_for_board/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o789n9y",
          "author": "More_Law6245",
          "text": "Firstly, breathe as people don't die in ditches over things like this, but to be honest it's going to get a bit bumpy for a while but seriously keep in mind that it's only a temporary situation. Secondly, the reality is that you have lost control of your project because you've had changes to your approved baselined project but the reality is that you've not administered them due diligently, which should become a very important learning lesson for you.\n\nA suggested approach is to go back to your original business case and start mapping out your project's chronology of events and the changes and the decisions made as the evidence of change and what the impact that it had over your original baselined project. I would also suggest that you propose or recommend to your project board/sponsor/executive to placing the project on a momentary or temporary hold in order for you to rebaseline your project. From a project administration perspective is that you need to go back through and revise or update your project controls (issues & risk logs, milestones, deliverables, project schedule and your project plan and to reflect the new delivery date but the most important thing is to have the new baseline approved (first and foremost).  The key is once you rebaseline your project your only focus is your triple constraint and you need to actively manage your exceptions. The golden rule is if any one of the constraints of time, cost or change then the other two must change. All you do is ask if which one do they want to change because it's a causal effect relationship between the constraints and all your doing is putting the responsibility back on to the requestor and asking them to choose. Trust me, it sorts out pretty quickly if the change is really warranted or not.\n\nAlso keep in mind the person who rammed their agenda through can't dispute the facts when you can show evidence of where and how they got their change through but it also means that you have to be honest with your project board/sponsor/executive and admit that you could have handled this a little better (this is your lessons learned as a project practitioner, your triple constraint of time, cost and scope is your only priority and you have to document any exception to that agreed and approved baseline).\n\nGet your ducks lined up in a row and at your next status meeting raise the matter, the reality is the longer you leave it the worse it becomes. Go ready with your mapped chronology of events, understand your risks and issues, more importantly go with a proposed idea (e.g. a course of action) and ask for your project board/sponsor/executive for guidance on the matter.\n\nThe reality is that your project board/sponsor/executive is actually responsible for the success of the project, your responsibilities is to ensure the day to day business transactions are delivered. Keep in mind the project board/sponsor/executive can't nor shouldn't hang you out to dry on this because they're at fault just as much as you are. Good luck and this will work itself out in the end, just remember you need to be a little more diligent when handling change.\n\nJust an armchair perspective.",
          "score": 7,
          "created_utc": "2026-02-24 23:20:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o79iept",
              "author": "More_Law6245",
              "text": "Just an added after thought OP, I would also suggest informally reaching out to your project board chair or sponsor informally and let them know what is going on in order not to lob a grenade over the fence and catching everyone off guard.  It's a bit harder to come back from that.  Good luck ",
              "score": 5,
              "created_utc": "2026-02-25 03:31:09",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o78gqeo",
              "author": "Visual_Strength8972",
              "text": "This is gold advice OP. I was going to add, but after reading this whole comment I cannot disagree with this approach. \n\nBe honest, transparent and go to your steerco with a proposed path to green. \n\nYes this is a governance fail, but it doesn’t have to stay that. It is also an opportunity to turn it into a win.",
              "score": 2,
              "created_utc": "2026-02-25 00:00:11",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o75uqts",
          "author": "wittgensteins-boat",
          "text": "Start with, for yourself a table with list of columns  \n\n- agreed change order item & description   \n- estimated time change  \n- present estimated time change  \n- actual time change (if known/completed)  \n- estimated cost change  \n- current estimated cost change   \n- actual cost change (if known/completed) \n- line item follow-on summary impact, entire project \n- known risks of line item , cost and time \n- known consequences to risks  \n\nNarrative summarizing above.\n\nSee if that, when put on one chart, this might  clarify your fact based understanding and intended   discussion/presentation.",
          "score": 5,
          "created_utc": "2026-02-24 16:37:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o77g67i",
          "author": "Character-Start-7749",
          "text": "been in a similar situation. the thing that helped me most was going back to the original scope and making a clear table of whats in vs whats crept in vs whats board approved. boards dont want to read paragraphs - they want a 1 page visual showing original timeline vs current timeline and exactly which scope changes caused the delta.\n\nalso be upfront about the lessons learned. boards respect \"heres what went wrong and heres what im doing about it\" way more than trying to spin it. i learned that the hard way across like 4 projects lol",
          "score": 2,
          "created_utc": "2026-02-24 20:58:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o77mxwn",
              "author": "SugarInvestigator",
              "text": ">also be upfront about the lessons learned\n\nI've already logged the lesson about the scope creep and how it should have been a separate body of work. Didn't consider adding it to an update to the board. Good thinking. It shows in aware why we deviated so much.",
              "score": 1,
              "created_utc": "2026-02-24 21:29:16",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o77sxkm",
                  "author": "1z1z2x2x3c3c4v4v",
                  "text": "> why\n\nThe \"why\" is irrelevant to the \"how\" you get back on track.  See my comment below.",
                  "score": 2,
                  "created_utc": "2026-02-24 21:56:55",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o77s8ly",
          "author": "1z1z2x2x3c3c4v4v",
          "text": ">   provide a decent path to green \n\nLOL, I think that train has left the station.\n\nIf I were you, I would start from scratch.  This sounds like too much of a dumspter fire to save.  You need to start over, with a new Scope, Deliverables, Timelines, and Costs.\n\nSeriously.\n\nIf a new PM came in, that's what they would do.",
          "score": 2,
          "created_utc": "2026-02-24 21:53:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7a5da3",
              "author": "SugarInvestigator",
              "text": "I agree 100% that's what I was proposing. New baseline, get board to confirm deliverables again, get updated solution design etc.",
              "score": 1,
              "created_utc": "2026-02-25 06:10:34",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7birk7",
                  "author": "1z1z2x2x3c3c4v4v",
                  "text": "Then, after you design the new plan with a new scope and timelines, only then can you bring up the issues that led the last project astray.  Things like poor change management (which didn't reveal the potential time delay) and poor governance, both of which led to the scope creep.\n\nThere is no point in having a change management process if the review board doesn't really review the change and the potential risks.\n\nThe first plan of action is to get a new plan.\n\nThe second plan of action is a post-mortem on what went wrong the first time and how to mitigate that going forward.",
                  "score": 1,
                  "created_utc": "2026-02-25 13:07:27",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o75no17",
          "author": "AutoModerator",
          "text": "Hey there /u/SugarInvestigator, have you checked out the [wiki page](https://www.reddit.com/r/projectmanagement/wiki/index) on located on r/ProjectManagement?  We have a few cert related resources, including a list of certs, common requirements, value of certs, etc.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/projectmanagement) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-24 16:06:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7842do",
          "author": "Low_Friendship463",
          "text": "Be detailed about what happened, when it happened, the step by step process that was bypassed where the delays are and then follow it up with \"F this, I'm out\", as you've hopefully got a new job lined up...ok maybe not the last part so much but definitely the first stuff. Get it all out of your head and onto paper. Then separate facts and group them..when does your fiscal year end?",
          "score": 1,
          "created_utc": "2026-02-24 22:51:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7a5xio",
              "author": "SugarInvestigator",
              "text": ">when does your fiscal year end?\n\nOctober\n\n>step by step process that was bypassed where the delays are\n\nThat's what I'm thinking, I guess I'm concerned because the board.member can be extremly difficult. He has been rude and unprofessional on calls. Made comments that should not have been said or only face to face because it undermines me as a PM in front of the team. \n\nWe are a matrix organisation and the majoroty of the project team are his direct reports and he doenst think that I have any authority over them when it comes to peojext related work. We're a Prince2 house and the whole Delegation of Control thing doesn't exist to him.",
              "score": 1,
              "created_utc": "2026-02-25 06:15:07",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7bkhdk",
                  "author": "Low_Friendship463",
                  "text": "Sounds like an organization that's doomed to fail...might as well present the facts with evidence and let whatever happens happen.",
                  "score": 2,
                  "created_utc": "2026-02-25 13:17:41",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1rg4c5b",
      "title": "Any tips for navigating around workplace politics & favouritism?",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1rg4c5b/any_tips_for_navigating_around_workplace_politics/",
      "author": "ItsOverCasanova",
      "created_utc": "2026-02-27 11:35:35",
      "score": 8,
      "num_comments": 28,
      "upvote_ratio": 0.91,
      "text": "I think the question is self explanatory. \n\nI’ve only worked in 2 organisations as a PM but they’re both competitors and basically the same, culturally.\n\nIt’s wild to me that certain people get attention, promotions etc when objectively I’m told by others who work with both of us that I'm a better performer. \n\nI'm trying to not compare, as I know that will rob me of happiness, but it's hard.\n\nI guess I just am curious to know what other people do in these kinds of situations.. I know my experience is not a unique one.\n\nBtw, I hope my question has not come across as me having some kind of complex, I of course, also have my own area's I need to improve on, which I work hard at all the time, however I can't help but recognise the favouritism. I think that's a fair thing to say when I know other people in different contexts also in these situations.\n\nThank you!",
      "is_original_content": false,
      "link_flair_text": "Career",
      "permalink": "https://reddit.com/r/projectmanagement/comments/1rg4c5b/any_tips_for_navigating_around_workplace_politics/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o7oo5bp",
          "author": "El_Serpiente_Roja",
          "text": "Best advice I ever got was that the work you do is one thing and the narrative about you is a completely separate thing. Both need their own kind of maintenance and one does not necessarily help the other.",
          "score": 5,
          "created_utc": "2026-02-27 11:39:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7ooq09",
              "author": "ItsOverCasanova",
              "text": "Thanks. That’s insightful. I don’t know yet if I have figured out how to leverage the narrative part to work in my favour.\n\nI know there’s bias because I found out once that a KEY person in the organisation told another person..\n\n“Oh you know he’s gay, right?” before being placed on that (construction) project, just to see if it was okay.\n\nAs if that has any bearing on my ability to do the job.. I never even told them or brought that up to anyone ever.. \n\nIt sucks.",
              "score": 1,
              "created_utc": "2026-02-27 11:43:35",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7spd64",
                  "author": "El_Serpiente_Roja",
                  "text": "Exactly you never know the story floating around about you and the politics that come with that or the complexs people have. Good luck, it's not fun but this is the game we must play.",
                  "score": 1,
                  "created_utc": "2026-02-28 00:22:49",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o86nhk1",
                  "author": "Icy_Acanthisitta7741",
                  "text": "Seemed you are pretty dead set on people out against you. \n\nAnd no offense, seeing your continuous complaining and just gets upset on people disagreeing with you, may be people have their reasons for passing over you. ",
                  "score": 1,
                  "created_utc": "2026-03-02 05:48:47",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o7qtifz",
              "author": "Terrible-Currency607",
              "text": "And sometimes we dont know what narrative is done about you, people who sees you as threat might finish your time there( I was in a similar position, while I was trying too hard to convert to permanent role, I got to know later my work was narrated differently by someone who didn't work with me)",
              "score": 1,
              "created_utc": "2026-02-27 18:30:40",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7ooomm",
          "author": "Ok_Jello9448",
          "text": "Unfortunately reality is it happens in every org, at some extent. Dont beat yourself up over this. \n\nBut a generic advice for promotions - doing work is 1 thing, but showing it and gaining the visibility is more important. Especially for mid management roles like LMs and PgMs. \n\nGet yourself involved in process improvements, write playbooks based on lessons learnt etc, and train your colleagues, present at leadership forums. This is all outside of your regular project work. Once you start showing up,  leaders will start noticing you and you will have a chance to standout and grow. Also, being on a high visibility and high priority project gets you more attention than a project that not many people care about, even if the amount of work is same. \n\nGood luck.",
          "score": 3,
          "created_utc": "2026-02-27 11:43:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7op5xc",
              "author": "ItsOverCasanova",
              "text": "Thank you! I do exactly that and it seems to go unnoticed. I work hard and feel like I’m just a tickbox hire sometimes, because I found out they know I’m gay (even though I haven’t told anyone and try to keep that part hidden), and I found out it’s being used as a way to consider where I “belong” in relation to others based on stereotypes.\n\nI hate even saying this because I don’t like to play any victim cards, but I don’t know why else this could be the case. I try and toe the line between being real, a hard worker and NOT kissing arse.\n\nThanks for your insight, super helpful :)",
              "score": 2,
              "created_utc": "2026-02-27 11:46:59",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7psbfz",
                  "author": "painterknittersimmer",
                  "text": "I mean, maybe it's the case becsuse you *don't* kiss ass? I feel like you diagnosed your own problem. Meritocracy is a myth. Working hard is useless if you are not noticed. You need to have people on your \"team.\" Who in leadership have you cultivated to be on your \"team?\" It is something you may need to do consciously. Yes, if you are against the mold, you will almost certainly have to work harder to get the same level of recognition. Sometimes you may get lucky and it gets you a foot in the door, but has other downstream effects. This is life. ",
                  "score": 2,
                  "created_utc": "2026-02-27 15:34:42",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7qtsr3",
          "author": "PplPrcssPrgrss_Pod",
          "text": "Yes. Don't.\n\n* Be confident and objective in your answers\n* Don't fall into the rumor traps\n* Focus on you and your progress while enabling the team\n\nGodspeed.",
          "score": 3,
          "created_utc": "2026-02-27 18:32:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ou3nf",
          "author": "thrownsandal",
          "text": "> objectively I’m told by others who work with both of us that I'm a better performer\n\nthis is part of the politics playing. if you’re unaware, you may be played. not sure what HBR calls it, but ‘fluffing’ is good.",
          "score": 2,
          "created_utc": "2026-02-27 12:23:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7uohkz",
          "author": "DaimonHans",
          "text": "Does it matter if you are still getting paid?",
          "score": 2,
          "created_utc": "2026-02-28 09:02:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7v576i",
          "author": "Own_Abies_8660",
          "text": "When you need more pay or a higher role - apply elsewhere, or a different department.\n\nNearly every accomplished person I have met and admired has a linkedin that shows them moving on every 1.5 to 2 years - not sticking in the same team/area waiting for promotion.",
          "score": 2,
          "created_utc": "2026-02-28 11:40:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7onp7r",
          "author": "AutoModerator",
          "text": "Hey there /u/ItsOverCasanova, have you checked out the [wiki page](https://www.reddit.com/r/projectmanagement/wiki/index) on located on r/ProjectManagement?  We have a few cert related resources, including a list of certs, common requirements, value of certs, etc.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/projectmanagement) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-27 11:35:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7p561j",
          "author": "Stebben84",
          "text": "[secrets to winning at office politics ](https://books.google.com/books/about/Secrets_to_Winning_at_Office_Politics.html?id=EtDhpUt1kDoC)",
          "score": 1,
          "created_utc": "2026-02-27 13:33:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7rlzby",
          "author": "Internal-Alfalfa-829",
          "text": "Let's try a little reframe: Favoritism is not real. You may want to look at increasing your visibility and connectedness. Anybody can execute a job well, that's not a relevant differentiator. The difference is in how you communicate, how you show up and how easy and enjoyable you are to work with. How easy it is to notice your impact.",
          "score": -3,
          "created_utc": "2026-02-27 20:50:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7scfra",
              "author": "Brief_Software_6902",
              "text": "No reframing needed I don’t think - favouritism is real and until you’ve experienced it you won’t appreciate how much of a head melt it is, especially in a high pressure job.",
              "score": 1,
              "created_utc": "2026-02-27 23:07:43",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o7v5elo",
              "author": "Own_Abies_8660",
              "text": "This is already proven within numerous studies.",
              "score": 0,
              "created_utc": "2026-02-28 11:42:42",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7oy2b9",
          "author": "pmpdaddyio",
          "text": "I’d like to understand the relevance to PM here?",
          "score": -7,
          "created_utc": "2026-02-27 12:50:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7oz2u6",
              "author": "ItsOverCasanova",
              "text": "That’s my career. So i’m curious how other PM’s manage this specifically.",
              "score": 2,
              "created_utc": "2026-02-27 12:57:15",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7pdghk",
                  "author": "pmpdaddyio",
                  "text": "That's really a manager question - see rule 2..",
                  "score": -5,
                  "created_utc": "2026-02-27 14:19:51",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o7p6jxe",
              "author": "Stebben84",
              "text": "I'm an internal PM. Understanding and navigating office politics is important with stakeholder management and influence strategies. Knowing where and how to build allies for large scale complex projects can make or break the success. I would not say its about playing the office politics, but knowing how its at play. Every org has the politics.",
              "score": 2,
              "created_utc": "2026-02-27 13:41:43",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7pdry6",
                  "author": "pmpdaddyio",
                  "text": "Not a PM topic. In fact, getting into \"Office Politics\" as a PM is an ignorant approach. Try r/managersthatcantlead.",
                  "score": -5,
                  "created_utc": "2026-02-27 14:21:36",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7tcj3j",
          "author": "Logical-Bookkeeper77",
          "text": "I mean, they probably pass on other people to be the pm when they choose you, pikachu.\n\nNot sure why you are upset when it’s just a fact of life.  Unless you are a narcissist, and think that the world revolves around around you. \n\nHave you try to understand why that is?\nMay be the dude / gal worked with boss for long time so they need less prep time and has some guarantee on quality.\n\nMay be they just appeared better? \n\nMay be it’s a coin flip and you lost. Or he’s boss’s little cousin?\n\nWithout understanding the why, and you are just upset people didn’t chose you, you do sounded like have a complex.",
          "score": -2,
          "created_utc": "2026-02-28 02:44:58",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rfv0uv",
      "title": "ClickUp vs. Asana",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1rfv0uv/clickup_vs_asana/",
      "author": "hope_wait",
      "created_utc": "2026-02-27 03:00:27",
      "score": 7,
      "num_comments": 10,
      "upvote_ratio": 1.0,
      "text": "Hi everyone, I’m looking to roll out a project management software to a team who doesn’t have existing software. They want to use either clickup or Asana. I’ve never used either am curious if anyone has any opinions on either a their ease of use, reporting capabilities and automations. ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/projectmanagement/comments/1rfv0uv/clickup_vs_asana/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o7mvm5g",
          "author": "AutoModerator",
          "text": "Attention everyone, just because this is a post about software or tools, does not mean that you can violate the sub's 'no self-promotion, no advertising, or no soliciting' rule.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/projectmanagement) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-27 03:00:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7oh5uv",
          "author": "shyamal890",
          "text": "Asana is one of the most thought out product out there. ClickUp doesn't even come close to its User experience. This is also one of the reasons why Asana has less features than ClickUp while ClickUp feels bloated and complex. \n\nHowever, at the same time Asana is focusing more on Enterprise, even their home page screams Enterprise. \n\nSo if you are a SMB I would suggest looking at tools like SmartTask, Monday which combines CRM + Project Management + Time Tracking. With SmartTask, you even get process mapping support.",
          "score": 3,
          "created_utc": "2026-02-27 10:39:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7r6wfk",
          "author": "analyteprojects",
          "text": "For reporting I would definitely pick Asana and similar to other responses I think this is very easy for end users to pick up and utilize effectively. I don't agree that Clickup has better automations I think that's a matter of how/what you design in Asana. Note that Asana's reporting and automations are part of the more expensive packages. ",
          "score": 2,
          "created_utc": "2026-02-27 19:35:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7mz8og",
          "author": "Stebben84",
          "text": "Why not set up demos for the team and have them evaluate.",
          "score": 3,
          "created_utc": "2026-02-27 03:22:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7mvm6l",
          "author": "AutoModerator",
          "text": "Hey there /u/hope_wait, there may be more focused subreddits for your question. Have you checked out r/mondaydotcom or r/clickup for any questions regarding this application?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/projectmanagement) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-27 03:00:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7mxqk2",
          "author": "PugsandDrugz",
          "text": "Would depend on what type of projects you're managing. Asana is nice and simple and easy for teams to adopt and for PMs to build out.  Clickup is better for more robust automation and complex cross-functional deliverables.\n\nI have used both and although I was resistant to click up at first I prefer it now.",
          "score": 1,
          "created_utc": "2026-02-27 03:13:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7x4dvl",
          "author": "jbkrauss",
          "text": "I manage a small team and have used both.\n\nClickup is a great solution that does everything relatively well. A great all-arounder, basically. It keeps everyone in the same place.\n\nAsana is a bit more in-depth I guess when it comes to personalization/cistomization but in my experience it doesn’t cover all use cases. I found myself needing Slack also for communication and because information became scattered, we ended up not using Asana to its full extent\n\nI prefer clickup",
          "score": 0,
          "created_utc": "2026-02-28 18:26:33",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rgt1th",
      "title": "PM in the construction field",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1rgt1th/pm_in_the_construction_field/",
      "author": "Acceptable_Pizza_919",
      "created_utc": "2026-02-28 04:26:35",
      "score": 6,
      "num_comments": 10,
      "upvote_ratio": 1.0,
      "text": "I’m an electrical apprentice looking at my options once I’m a licensed electrician. Project management is something I’m interested in. Does anyone here have any experience being a PM in the construction field? Or any advice for someone interested in the general career? ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/projectmanagement/comments/1rgt1th/pm_in_the_construction_field/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o7ttepr",
          "author": "sinistar914",
          "text": "Learn as much as you can during your apprenticeship about your trade. Listen, work hard, when you don’t have something to do let your supervisor know. Be a sponge. Be respectful. Once you have enough experience to successfully run jobs on your own you should have no problem moving up into project management.",
          "score": 3,
          "created_utc": "2026-02-28 04:37:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7tu47f",
          "author": "xXIIIx",
          "text": "I came from the field to be a PM in the electrical field.\n\n1) make sure you have good references across the board and know your code. A candidate with good knowledge and real world experience always beats a degree imo.\n\n2) find a company that allows growth to the roll. A typical route I've seen is from PC to PE to APM to PM or some variations due to what roles are in company. Learn processes and what you need to do to achieve the next role. Don't be afraid to ask questions\n\n3) take classes such as a CAPM or PMP course\n\n\nAnd dont give up, you can do it. Just know PMing in construction is very stressful at times.",
          "score": 4,
          "created_utc": "2026-02-28 04:42:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7v98bk",
              "author": "Logical-Bookkeeper77",
              "text": "Please don’t start your education to be a PM with PMP.  It’s more tools and generics that wouldn’t help you.\n\nStart with PRINCE2. CAPM is ok*, but PRINCE2 is more comprehensive and you can advance the certification from foundation to practitioner.\n\nHave a look up on these, you can get a feel of it based on preliminary google search.\n\nPMP gives you more tools, but to know when to best utilize them, you need some experience in pm work already. \n\nFor anyone that doesn’t already **know** how to perform, you still wouldn’t know after taking PMP.",
              "score": 2,
              "created_utc": "2026-02-28 12:14:18",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7w7xw3",
                  "author": "xXIIIx",
                  "text": "Most people already have the foundations to get a PMP, based on requirements for certification, you'll need a degree and experience or more years of experience. I say the CAPM because there are no requirements so I think it's beneficial to start to formulate a state of mind and concepts for the role. It doesn't teach you what to do but teaches basic terminology and processes at a very fundamental level.",
                  "score": 2,
                  "created_utc": "2026-02-28 15:44:25",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o7u10it",
              "author": "Acceptable_Pizza_919",
              "text": "Thank you for the response! \n\nIs the work-life balance way better than being in the field?",
              "score": 1,
              "created_utc": "2026-02-28 05:34:24",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7w78vr",
                  "author": "xXIIIx",
                  "text": "I would say overall yes, the work life balance is better but know that as salaried, you'll probably be working 50-55 hrs a week. I have had weekend work before because I knew I had things to complete. \n\nBut at other times, I'm not stuck to the standard schedule. All my bosses have the perspective of you do what you need to. Don't come in or come in your work will reflect. \n\nI dont find use of abusing the system but I appreciate as a single father days im allowed to come in 30 mins late due to earliest drop off time.",
                  "score": 1,
                  "created_utc": "2026-02-28 15:40:56",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7tuar5",
          "author": "Logical-Bookkeeper77",
          "text": "Licensed or not doesn’t help **that** much to be a pm.\n\nE.g.: pm is not required to have an engineering or architectural degree, nor an electrical engineering degree.\n\nAlthough it does help in the specific domain knowledge, but far from a requirement.\n\nIf you are interested to be a pm.  Just observe a bit what they do in your line of work, ask them some questions on why / how they do some stuff.\n\nOnce you have a better understanding of the process, take up some courses, I recommend PRINCE2 framework that gives you an idea of how projects are run. \n\nAnd PMP for the different tools /template that can be used for tracking… whatnot.\n\nGood luck.",
          "score": 5,
          "created_utc": "2026-02-28 04:44:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ttkys",
          "author": "Awkward_Blueberry740",
          "text": "I've worked with a few who have come off the tools. \n\nThey are generally very well regarded in the MEP, building services project management. This is what I have specialised in, although I am not a tradie. \n\nMost of the time people got their qualification and worked in their trade for a few years before moving into PM. \n\nYou could also just do general building supervision / project management, but MEP would look more favourably upon your electrical background and it often pays better because it's more specialised.",
          "score": 2,
          "created_utc": "2026-02-28 04:38:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ttpwl",
          "author": "sunshine-1111",
          "text": "I’m a construction PM! Been doing it about 10 years. I would definitely take a specific construction management course or program in addition to general project management courses. It will help a ton. You’ll already have a leg up coming from the trades. I’m happy to answer any questions.",
          "score": 2,
          "created_utc": "2026-02-28 04:39:57",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rfopq0",
      "title": "PM and Management Inspiration",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1rfopq0/pm_and_management_inspiration/",
      "author": "justanotherjitsuka",
      "created_utc": "2026-02-26 22:32:11",
      "score": 5,
      "num_comments": 3,
      "upvote_ratio": 0.78,
      "text": "As frivolous as it may seem, I wish I were as respected and competent a manager as Violet Bridgerton (who caught the new episodes today?!).\n\nI happened upon project management as a career path after a decade or so of being a professional in the field I seek to manage (biological sciences and healthcare). Who are some well-known managers in your field that you seek inspiration from, and what are your core values or goals as a career PM?",
      "is_original_content": false,
      "link_flair_text": "Discussion",
      "permalink": "https://reddit.com/r/projectmanagement/comments/1rfopq0/pm_and_management_inspiration/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o7os0fg",
          "author": "Bensutki",
          "text": "For me its Satya Nadella: calm tone, clear priorities, and he gives people room to do the work.\n\nMy PM north star is making decisions visible (who owns what, by when, and why) so nobody is guessing.",
          "score": 6,
          "created_utc": "2026-02-27 12:08:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7o1ma3",
          "author": "FindingBalanceDaily",
          "text": "I like that example, sometimes fictional leaders show what good management feels like. The managers I respect most are steady and clear about priorities, especially when things get messy. As a PM, I focus on creating enough clarity that the team can work without constant fire drills. Respect usually builds from consistency over time, not one big moment. What qualities stand out most to you?",
          "score": 2,
          "created_utc": "2026-02-27 08:12:38",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rfb03f",
      "title": "Looking for feedback from PMs on a probabilistic Control Framework idea",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1rfb03f/looking_for_feedback_from_pms_on_a_probabilistic/",
      "author": "TStronks",
      "created_utc": "2026-02-26 14:04:17",
      "score": 5,
      "num_comments": 5,
      "upvote_ratio": 1.0,
      "text": "Hi guys,\n\nMaybe this isn't the right place to ask, but I’d genuinely value some feedback from experienced PMs here. I’ve worked a number of years in project controls (mainly infrastructure / large programs), and Ive noticed projects keep running into the same issue:\n\nWe manage highly uncertain projects using single-number baselines and fairly subjective (if they even exist) risk registers. When things slip, we’re surprised even though the uncertainty was always there.\n\nSo I’ve been experimenting with something I call a “Control Framework” that treats uncertainty as something measurable and repeatable rather than something descriptive (based on RISMAN method. I think it's mostly a Dutch thing but I'm sure there's other similar ways of incorperating riskmanagement).\n\nThe core idea of the framework is:\n\n* Use Monte Carlo not as a one-off risk exercise, but as a recurring measurement unit.\n* Express schedule/cost forecasts in probabilities (P50/P80 etc.) instead of single dates.\n* Identify actual risk drivers via sensitivity rather than relying only on qualitative registers.\n* Aggregate portfolio-level confidence mathematically consistently (instead of averaging P-values or buffers).\n* Create a governance loop: planning → quantified risk → simulation → decision insight → repeat.\n\nI’ve put the concept into a small website (built with the help of vibe-coding and AI tools). It’s still early-stage and very much exploratory.\n\nWhat I’d really like to understand from this community:\n\n1. Is this a way of working you would actually use in your projects?\n2. What would immediately make you skeptical?\n3. What’s missing from this concept from a real PM perspective?\n4. Would this help you in steering committees / governance discussions, or would it create more friction?\n5. Where else would you suggest sharing or testing an idea like this?\n6. Are there adjacent opportunities I might be overlooking?\n\nI’m not trying to sell anything, I’m genuinely trying to test whether this solves a real pain or just a theoretical one.  So if anyone is willing to look at the site and give blunt feedback, I’d appreciate it a lot.\n\nThanks in advance@ And if this isn’t the right subreddit for this kind of discussion, I’m happy to remove the post.\n\n  \n[https://prosim-control-studio.vercel.app/](https://prosim-control-studio.vercel.app/)",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/projectmanagement/comments/1rfb03f/looking_for_feedback_from_pms_on_a_probabilistic/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o7ikpnf",
          "author": "AutoModerator",
          "text": "Attention everyone, just because this is a post about software or tools, does not mean that you can violate the sub's 'no self-promotion, no advertising, or no soliciting' rule.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/projectmanagement) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-26 14:04:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ikpou",
          "author": "AutoModerator",
          "text": "Hey there /u/TStronks, have you checked out the [wiki page](https://www.reddit.com/r/projectmanagement/wiki/index) on located on r/ProjectManagement?  We have a few cert related resources, including a list of certs, common requirements, value of certs, etc.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/projectmanagement) if you have any questions or concerns.*",
          "score": 1,
          "created_utc": "2026-02-26 14:04:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7n3z3x",
          "author": "Logical-Bookkeeper77",
          "text": "The problem is the unknown unknown.\n\nIf you can anticipate a problem, it’s just having a risk management process.\n\nAs a general advise, don’t try to uncover all the unknown unknowns, you won’t be able to cover them all.\n \nDraw lessons from similar projects, get SME to chime in (and put their names there). Review by 3rd party experts if it’s a huge project.\n\nMakes sure there’s a change management framework working with the risk management procedures.\n\nFrequent review /address risk / issues.\n\nWhat you put down is fine, as the pm you should be able to come up with ways suitable for you to assess / address the risk and issues.\n\nDO PROPER ESCALATION.\n\nI really don’t understand how it’s a surprise on delays even on highly uncertain projects, as in yes, there will be surprises issues, but the reaction and impact should be assess very quickly and address accordingly.\n\nIf that end up causing a delay, it shouldn’t be a surprised, but a documented result of the AGREED AND ENDORSED course of actions from the options treating the surprise issue. \n\nHope it helps.\n\nGood luck!",
          "score": 1,
          "created_utc": "2026-02-27 03:51:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7opmiw",
          "author": "vonseiten",
          "text": "Yes, I’d use this if it plugs into the stuff teams already run (Primavera/MSP, cost system) and produces a steering pack slide in 5 minutes. If it turns into a monthly “model maintenance” ceremony, PMs will drop it.",
          "score": 1,
          "created_utc": "2026-02-27 11:50:29",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rgnben",
      "title": "Masters in project management for clinical trial PM",
      "subreddit": "projectmanagement",
      "url": "https://www.reddit.com/r/projectmanagement/comments/1rgnben/masters_in_project_management_for_clinical_trial/",
      "author": "Responsible_Bend_524",
      "created_utc": "2026-02-28 00:00:48",
      "score": 4,
      "num_comments": 10,
      "upvote_ratio": 0.75,
      "text": "Hi all, looking for advice . I have a BS in biology and work for a major pharma company in the clinical trial division. I make around 90k currently. Ive debated on getting my masters in hopes for a new role with a different company eventually and higher salary. Wondering if this is worth my time and money. ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/projectmanagement/comments/1rgnben/masters_in_project_management_for_clinical_trial/",
      "domain": "self.projectmanagement",
      "is_self": true,
      "comments": [
        {
          "id": "o7sukle",
          "author": "islandgirl_94",
          "text": "I wouldn't do a masters in Project Management. I would get an MBA or MHA. They will cover project management and you can go on to take additional certifications specifically in PM",
          "score": 6,
          "created_utc": "2026-02-28 00:53:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7sx40y",
              "author": "Boogerchair",
              "text": "I second this approach as a current clinical PM. I have a BS in microbiology and after a few years as an RA got a masters in clinical regulatory affairs. It eventually worked in getting me where I wanted to get, but in retrospect an MBA would have been more valuable for my resume and would have gotten me here quicker.",
              "score": 5,
              "created_utc": "2026-02-28 01:08:51",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7vqxd7",
                  "author": "[deleted]",
                  "text": "[deleted]",
                  "score": 2,
                  "created_utc": "2026-02-28 14:12:14",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7vugar",
                  "author": "Responsible_Bend_524",
                  "text": "Thank you!",
                  "score": 1,
                  "created_utc": "2026-02-28 14:32:35",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7trwn2",
          "author": "Logical-Bookkeeper77",
          "text": "Don’t do a master in pm.\n\nGo do a mba something.",
          "score": 13,
          "created_utc": "2026-02-28 04:26:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7snx13",
          "author": "lenin1991",
          "text": "It depends what the opportunity cost is. Is there a different degree you'd consider? Would you do it while still working full time? And even better, would your current company pay your tuition?\n\nI got a degree like that, and I have no regrets, but I'm also not sure how much difference it has made. Experience counts for way more. Look for ways to get some, even in your current role, there are always projects that could be managed.",
          "score": 3,
          "created_utc": "2026-02-28 00:14:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7smzwi",
          "author": "Magnet2025",
          "text": "I had a BS in Political Science and worked as a PM for about 13 years in the defense industry. \n\nI wanted out of defense and into IT and decided to get a masters in PM from GWU. \n\nWhen I got my degree, I immediately had job offers, around 30% increase in salary.",
          "score": 4,
          "created_utc": "2026-02-28 00:08:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7t1683",
          "author": "Playful-Jeweler-3943",
          "text": "Skip the masters in project management and get your PMP! I am a Clinical Trial PM myself with both an MBA and PMP.",
          "score": 3,
          "created_utc": "2026-02-28 01:34:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7vujqp",
              "author": "Responsible_Bend_524",
              "text": "Excellent idea. I have the perfect resume to get i to that role but i fear i just need more education",
              "score": 2,
              "created_utc": "2026-02-28 14:33:07",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7sxsoz",
          "author": "Boogerchair",
          "text": "I a lot of it is going to be how you style your resume and translate your experiences into PM. I would do as another said and go for a more general degree like MBA because even a PMP cert will be more valuable than a masters in PM. If you are currently performing PM duties you should reframe your experiences away from the lab and more into PM terms. Lean on your technical skills as a framework and convince them you have the soft skills to manage clients.",
          "score": 1,
          "created_utc": "2026-02-28 01:13:05",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}