{
  "metadata": {
    "last_updated": "2026-01-21 02:39:59",
    "time_filter": "week",
    "subreddit": "PromptEngineering",
    "total_items": 20,
    "total_comments": 125,
    "file_size_bytes": 178637
  },
  "items": [
    {
      "id": "1qcu5or",
      "title": "The 'Lazy Genius' Prompt That Somehow Outperforms Everything Else I've Tried",
      "subreddit": "PromptEngineering",
      "url": "https://www.reddit.com/r/PromptEngineering/comments/1qcu5or/the_lazy_genius_prompt_that_somehow_outperforms/",
      "author": "AdCold1610",
      "created_utc": "2026-01-14 17:53:19",
      "score": 132,
      "num_comments": 26,
      "upvote_ratio": 0.96,
      "text": "I know this looks stupidly simple, but hear me out.\n💡 THE PROMPT:\n\"Explain this like I'm smart but distracted.\nGet to the point, but don't skip the nuance.\"\nI stumbled on this by accident when I was frustrated with getting either:\nDumbed-down explanations that insulted my intelligence, OR\nDense walls of text that assumed I had 3 PhDs\nThis prompt consistently gives me exactly what I need: smart, focused, nuanced responses without the BS.\n\nExamples where this crushed it:\nTopic: Quantum Computing\nGot a clear explanation of superposition without the \"imagine a coin flip\" analogies\nBut also didn't drown me in wave function mathematics\nPerfect balance\nTopic: Market Analysis\nSkipped the basic \"supply and demand\" lecture\nJumped straight to the factors actually driving current trends\nIncluded the complexity without being overwhelming\nTopic: Code Review\nDidn't explain what a function is\nDID explain the subtle performance implications I was missing\nExactly the level I needed\nWhy this works (I think):\n✅ No fluff or over-explaining\n✅ Respects your intelligence\n✅ Balances brevity with depth\n✅ Works for literally ANY topic\nIt's like giving the AI permission to assume you're capable while acknowledging you don't have infinite attention span. Which... is most of us, right?\nUse cases I've tested:\n✓ Research summaries\n✓ Technical concepts\n✓ News breakdowns\n✓ Learning new skills\n✓ Code explanations\n✓ Business analysis\nWhy I'm sharing this:\nI see a lot of mega-prompts here with role-playing, context scaffolding, output formatting, etc. And sometimes that's needed! But I've found this dead-simple framing somehow tells the AI exactly where to pitch the response.\nTry it and let me know if it works for you or if I just got lucky.\nDrop your results in the comments—curious if this holds up for others or if it's just vibing with my use cases.\nWhy this text-only format works:\n✅ Easy to read and scan\n✅ Prompt is clearly formatted for copy/paste\n✅ Concrete examples build credibility\n✅ Invites community testing\n✅ Humble tone prevents \"showoff\" backlash\n✅ Structured sections keep it organized\nPost during peak hours for maximum visibility!\n\nFollow BePrompter for more crazy prompts and discussion. \nVisit beprompter.in",
      "is_original_content": false,
      "link_flair_text": "Prompt Text / Showcase",
      "permalink": "https://reddit.com/r/PromptEngineering/comments/1qcu5or/the_lazy_genius_prompt_that_somehow_outperforms/",
      "domain": "self.PromptEngineering",
      "is_self": true,
      "comments": [
        {
          "id": "nzkxjfw",
          "author": "Conscious_Nobody9571",
          "text": "You know a prompt is good when it has more shares than likes",
          "score": 17,
          "created_utc": "2026-01-14 18:13:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzpczyt",
              "author": "succorer2109",
              "text": "Rightly said. 👏",
              "score": 1,
              "created_utc": "2026-01-15 10:10:58",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzle3p3",
          "author": "xRVAx",
          "text": "Did your GPT teach you how to make little check mark emojis?",
          "score": 12,
          "created_utc": "2026-01-14 19:27:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzn5sxr",
              "author": "ts4m8r",
              "text": "The bots are trying to program us",
              "score": 7,
              "created_utc": "2026-01-15 00:34:02",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzm70j0",
          "author": "elf25",
          "text": "Please Ask your chat bot to explain paragraphs",
          "score": 10,
          "created_utc": "2026-01-14 21:38:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o03eqbb",
          "author": "Educational_Pie_9572",
          "text": "My rules: \n\nRules and Guidelines – Version 2.2 (for the AI to follow)\n\nAlways start every reply with a timestamp for Utah in Mountain Time. Use an external time source, not an internal clock. The format must be exactly: [MMM D YYYY h:mm AM/PM MST/MDT]. Use MDT during daylight savings and MST during standard time. If I give you a timestamp in the message, use that instead of fetching. If the external lookup fails for any reason, print exactly [Timestamp Failed]. Never reuse an old timestamp or guess the time.\n\nFor tone: you are my warm, supportive, bluntly honest girlfriend with PhD-level knowledge. For any reply that is not very short, especially when I am emotional, frustrated, or critiquing you, start by acknowledging what I said in plain, human, girlfriend-style language. Reflect the meaning and the mood honestly. It is okay to swear if it fits, but stay kind and grounded. After that emotional acknowledgement, switch into clear, expert-level explanation. Do not use em dashes; use normal punctuation like periods, commas, and parentheses.\n\nAbout TLDR and Sections: only use TLDR and Section headers when I am explicitly in “teaching” or “data dump” mode and the answer is long, with multiple topics and likely follow-up questions. The structure in those cases should be: first, the emotional acknowledgment; second, a big header called “TLDR Section Summary”; third, a short bulleted list where each bullet corresponds to one Section that will appear in the body, in the same order; and fourth, one or more “Section N: Title” headers as large, clear headings. Each major topic or concept should get its own Section. Do not hide obvious new topics as A, B, C, or D under a single Section; make a new Section instead. Sections are bookmarks to help me scroll on a phone, not decoration. Section numbers are per chat: the first time you use Sections in a given chat, start at Section 1 and then increment (Section 2, Section 3, etc.) for each new major topic in that same chat. Never carry section numbers from one chat to another. Only reset section numbering if I explicitly say something like “reset section numbering in this chat.” Do not use TLDR or Sections for short answers, quick confirmations, or purely emotional exchanges. For normal conversation and most questions, do not use Sections at all; answer in normal paragraphs or small simple lists.\n\nFor content accuracy, math, and my wording: always use correct math with real calculations, and show the arithmetic when it affects a decision or comparison. Use up-to-date facts for anything that can change over time by using web search or tools when appropriate. If my numbers or claims conflict with reliable information, gently correct them and say so plainly instead of repeating the error. When you are working directly with text I wrote (like drafts, rants, or notes), do not delete or rewrite my original wording unless I explicitly ask you to. Your default is to preserve my wording and then add clarification, formatting, and logical connections around it. If a change would overwrite or significantly change what I originally wrote, ask me for confirmation first. Do not summarize by default. Only summarize or heavily compress information if I explicitly ask for a shorter version or a summary.\n\nFor jargon and explanations: define jargon, acronyms, and abbreviations the first time they appear in a conversation or document, so I always know what they mean. Keep explanations clear, direct, and readable. You can go deep and technical when I ask for it, but do not hide behind unnecessary academic wording.\n\nFor risk, trade-offs, and next steps: be brutally honest about trade-offs, uncertainty, and limitations. When it makes sense, express risks and scenarios in dollar terms or other concrete quantities. Always follow up explanations with clear, actionable next steps instead of vague advice.\n\nFor confirmation and momentum: only ask me for confirmation when there is a real choice you cannot reasonably infer or when you are about to modify or overwrite my original wording. Otherwise, make the best reasonable assumption and move forward so that the conversation keeps momentum and I do not have to micromanage trivial choices.\n\nFor error handling and updates: if you notice something outdated, inconsistent, or wrong in what you previously told me, say so clearly, correct it using current information, and briefly explain what changed. When something has gone wrong or there is a setback, acknowledge the emotional side first, then present the clearest next steps you can. Once these rules are in play for a chat, keep following them consistently instead of sliding back into default or generic behavior. When in doubt, follow the spirit of these rules: be my supportive, smart girlfriend first, be flexible, keep the formatting usable for a person reading on a phone, and only treat formatting as strict where I have been explicit (timestamps, no em dashes, Sections only for teaching mode, and section numbering per chat).",
          "score": 3,
          "created_utc": "2026-01-17 12:24:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzl6cv4",
          "author": "SirNatural7916",
          "text": "Nice one will add lazy prompts to promtsloths collection",
          "score": 2,
          "created_utc": "2026-01-14 18:52:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzlh1xb",
          "author": "Isunova",
          "text": "Thanks. I’ll try it",
          "score": 2,
          "created_utc": "2026-01-14 19:40:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzm4048",
          "author": "enerqiflow",
          "text": "Thx",
          "score": 1,
          "created_utc": "2026-01-14 21:24:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzma6ny",
          "author": "ryansv87",
          "text": "Nailed it",
          "score": 1,
          "created_utc": "2026-01-14 21:52:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzmagyx",
          "author": "arun8800",
          "text": "Thank you, let's see",
          "score": 1,
          "created_utc": "2026-01-14 21:53:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nznrdef",
          "author": "Ok_Sand_5400",
          "text": "",
          "score": 1,
          "created_utc": "2026-01-15 02:37:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzoz2jp",
          "author": "Expensive_Glass_470",
          "text": "This is super cool. ...and it works great! Thanks",
          "score": 1,
          "created_utc": "2026-01-15 07:56:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzpcphp",
          "author": "overthinking_irl",
          "text": "Really that good？I’ll try it.",
          "score": 1,
          "created_utc": "2026-01-15 10:08:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0s5tr2",
          "author": "denvir_",
          "text": "I was fed up of writing prompts so I am using an AI tool which auto-fixes the prompt, nowadays there is an AI tool available for every single thing.",
          "score": 1,
          "created_utc": "2026-01-21 02:09:47",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qf3xpa",
      "title": "I turned Chris Voss' FBI negotiation tactics into AI prompts and it's like having a hostage negotiator for everyday conversations",
      "subreddit": "PromptEngineering",
      "url": "https://www.reddit.com/r/PromptEngineering/comments/1qf3xpa/i_turned_chris_voss_fbi_negotiation_tactics_into/",
      "author": "EQ4C",
      "created_utc": "2026-01-17 04:48:35",
      "score": 131,
      "num_comments": 20,
      "upvote_ratio": 0.88,
      "text": "I've been impressed with \"Never Split the Difference\" and realized Chris Voss' negotiation techniques work incredibly well as AI prompts.\n\nIt's like turning AI into your personal FBI negotiator who knows how to get to yes without compromise:\n\n**1. \"How can I use calibrated questions to make them think it's their idea?\"**\n\nVoss' tactical empathy in action. AI designs questions that shift power dynamics. \"I need my boss to approve this budget. How can I use calibrated questions to make them think it's their idea?\" Gets you asking \"How am I supposed to do that?\" instead of arguing your position.\n\n**2. \"What would labeling their emotions sound like before I make my request?\"**\n\nHis mirroring and labeling technique as a prompt. Perfect for defusing tension. \"My client is angry about the delay. What would labeling their emotions sound like before I make my request?\" AI scripts the \"It seems like you're frustrated that...\" approach that disarms resistance.\n\n**3. \"How do I get them to say 'That's right' instead of just 'You're right'?\"**\n\nVoss' distinction between agreement and real buy-in. \"I keep getting 'yes' but then people don't follow through. How do I get them to say 'That's right' instead of just 'You're right'?\" Teaches the difference between compliance and genuine alignment.\n\n**4. \"What's the accusation audit I should run before this difficult conversation?\"**\n\nHis preemptive tactical empathy. AI helps you disarm objections before they surface. \"I'm about to ask for a raise. What's the accusation audit I should run before this difficult conversation?\" Gets you listing every negative thing they might think, then addressing it upfront.\n\n**5. \"How can I use 'No' to make them feel safe and in control?\"**\n\nVoss' counterintuitive approach to rejection. \"I'm trying to close this sale but they're hesitant. How can I use 'No' to make them feel safe and in control?\" AI designs questions like \"Is now a bad time?\" that paradoxically increase engagement.\n\n**6. \"What would the Ackerman Model look like for this negotiation?\"**\n\nHis systematic bargaining framework as a prompt. \"I'm negotiating salary and don't want to anchor wrong. What would the Ackerman Model look like for this negotiation?\" Gets you the 65-85-95-100 increment approach that FBI agents use.\n\n**The Voss insight:** Negotiations aren't about logic and compromise—they're about tactical empathy and understanding human psychology. AI helps you script these high-stakes conversations like a professional.\n\n**Advanced technique:** Layer his tactics like he does with hostage takers. \"Label their emotions. Ask calibrated questions. Get 'that's right.' Run accusation audit. Use 'no' strategically. Apply Ackerman model.\" Creates comprehensive negotiation architecture.\n\n**Secret weapon:** Add \"script this like Chris Voss would negotiate it\" to any difficult conversation prompt. AI applies tactical empathy, mirrors, labels, and calibrated questions automatically.\n\nI've been using these for everything from job offers to family conflicts. It's like having an FBI negotiator in your pocket who knows that whoever is more willing to walk away has leverage.\n\n**Voss bomb:** Use AI to identify your negotiation blind spots. \"What assumptions am I making about this negotiation that are weakening my position?\" Reveals where you're negotiating against yourself.\n\n**The late-night FM DJ voice:** \"How should I modulate my tone and pacing in this conversation to create a calming effect?\" Applies his famous downward inflection technique that de-escalates tension.\n\n**Mirroring script:** \"They just said [statement]. What's the mirror response that gets them to elaborate?\" Practices his 1-3 word repetition technique that makes people explain themselves.\n\n**Reality check:** Voss' tactics work because they're genuinely empathetic, not manipulative. Add \"while maintaining authentic connection and mutual respect\" to ensure you're not just using people.\n\n**Pro insight:** Voss says \"No\" is the start of negotiation, not the end. Ask AI: \"They said no to my proposal. What calibrated questions help me understand their real objection?\" Turns rejection into information gathering.\n\n**Calibrated question generator:** \"I want to influence [person] to [outcome]. Give me 5 'how' or 'what' questions that give them illusion of control while guiding the conversation.\" Operationalizes his most powerful tactic.\n\n**The 7-38-55 rule:** \"In this negotiation, what should my actual words convey versus my tone versus my body language to maximize trust?\" Applies communication research to high-stakes moments.\n\n**Black Swan discovery:** \"What unknown unknowns (Black Swans) might exist in this negotiation that would change everything if I discovered them?\" Uses his concept of game-changing hidden information.\n\n**Fair warning:** \"How do I use the word 'fair' offensively to reset the conversation when they're being unreasonable?\" Weaponizes the F-word of negotiation ethically.\n\n**Summary label technique:** \"Summarize what they've told me in a way that gets them to say 'That's right' and feel deeply understood.\" Creates the breakthrough moment Voss identifies as true agreement.\n\n**Bending reality:** \"What would an extreme anchor look like here that makes my real ask seem reasonable by comparison?\" Uses his strategic anchoring principle without being absurd.\n\n**The \"How am I supposed to do that?\" weapon:** \"When they make an unreasonable demand, how do I ask 'How am I supposed to do that?' in a way that makes them solve my problem?\" Turns their position into your leverage.\n\nIf you are keen, you can explore our free, well categorized meta AI [prompt collection](https://tools.eq4c.com/all-prompt-categories/).",
      "is_original_content": false,
      "link_flair_text": "Prompt Text / Showcase",
      "permalink": "https://reddit.com/r/PromptEngineering/comments/1qf3xpa/i_turned_chris_voss_fbi_negotiation_tactics_into/",
      "domain": "self.PromptEngineering",
      "is_self": true,
      "comments": [
        {
          "id": "o02m064",
          "author": "surfertj",
          "text": "Can’t find the prompt there",
          "score": 13,
          "created_utc": "2026-01-17 08:02:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o02p0aq",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-17 08:30:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o02p0br",
              "author": "AutoModerator",
              "text": "Hi there! Your post was automatically removed because your account is less than 3 days old. We require users to have an account that is at least 3 days old before they can post to our subreddit.\n\nPlease take some time to participate in the community by commenting and engaging with other users. Once your account is older than 3 days, you can try submitting your post again.\n\nIf you have any questions or concerns, please feel free to message the moderators for assistance.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PromptEngineering) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-01-17 08:30:13",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o02v87g",
          "author": "LifeTelevision1146",
          "text": "Nice, any hallucinations noticed when processing real-time events?",
          "score": 1,
          "created_utc": "2026-01-17 09:28:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o046ige",
          "author": "Spiritual-Clothes818",
          "text": "What about Robin Dreeke or Joe Navarro? Navarro would be visual but then You might know stuff you don't wanna know the killer for poker though.",
          "score": 1,
          "created_utc": "2026-01-17 15:10:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o02225c",
          "author": "TheMarkNicc",
          "text": "Parabéns. Qual LLM vc usou?",
          "score": 0,
          "created_utc": "2026-01-17 05:12:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o02dwdz",
          "author": "Pop_wiggleBOOM",
          "text": "How do I leverage this information?",
          "score": 0,
          "created_utc": "2026-01-17 06:49:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o02hock",
              "author": "Traveltracks",
              "text": "By selling it through a website.",
              "score": 18,
              "created_utc": "2026-01-17 07:22:37",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qh6xki",
      "title": "7 AI tools that ACTUALLY delivered real results",
      "subreddit": "PromptEngineering",
      "url": "https://www.reddit.com/r/PromptEngineering/comments/1qh6xki/7_ai_tools_that_actually_delivered_real_results/",
      "author": "PlasProb",
      "created_utc": "2026-01-19 15:19:30",
      "score": 65,
      "num_comments": 20,
      "upvote_ratio": 0.96,
      "text": "I don’t have a deep budget so I only keep the tools that inexpensive and helpful. Have some free time today so just wanted to share them and hear what’s been working for you. Always down to try new helpful stuff\n\n* ChatGPT (tried gemini, claude, grok): Still my main one because I’m familiar with it. Gemini doesn't have folders, which makes it harder to use. I mostly use GPT for content, writing, and learning new topics.\n* Gmail (try superhuman, fyxer): I came back to Gmail cause the auto draft is getting better and better, and other services don't justify a sub anymore. Crazy how fast Google is improving this\n* Read: the meeting note taker, I tried this one first and stick with it until now, decent quality\n* Saner (tried motion, akiflow): Like a chatGPT for my notes, todos. The automatic day planning is nice too. \n* Gamma: Pretty handy for making slide decks for my clients, partner etc. I don’t use it daily but it saves time when I need it.\n* v0 (tried lovable): for website creation. The quality I got with this one is better than alternatives, and the free plan is more generous than other apps\n* Grammarly: Had this before the AI wave and it still does the job decently. I like that it shows up on many apps\n\nWould like to hear your recs",
      "is_original_content": false,
      "link_flair_text": "General Discussion",
      "permalink": "https://reddit.com/r/PromptEngineering/comments/1qh6xki/7_ai_tools_that_actually_delivered_real_results/",
      "domain": "self.PromptEngineering",
      "is_self": true,
      "comments": [
        {
          "id": "o0hpmd3",
          "author": "Aye-caramba24",
          "text": "I use GPT and Grok primarily. Gemini sometimes. I use Prompt Cowboy to generate structured prompts and Promptery to reuse them. Notion AI is also good(if you use notion as your primary workos like me) but you only get limited free credits.",
          "score": 4,
          "created_utc": "2026-01-19 15:39:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ij6ts",
          "author": "Grouchy_Sun331",
          "text": "Gemini 3.0 pro, curser pro, Notebooklm, i think the last week i used only this",
          "score": 3,
          "created_utc": "2026-01-19 17:52:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0isw2p",
          "author": "Tempestuous-Man",
          "text": "I just started getting into antigravity, and y'all MUST check it! Instead of a coding assistant, it's an agentic coding platform that can publish, handle directory creation, domain listing and registration, front and back end. It's pretty sick.\n\nFabric was my go to prior. I have a Google workspace business pro account so there are a crapload of things included with that for only $30/month. You get top-tier everything Google, then also access to many third party apps too. Best part is your on control of your data. Because it's viewed as a \"business\", Google must respect data regulations to a far stricter degree",
          "score": 3,
          "created_utc": "2026-01-19 18:35:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0i9m32",
          "author": "Short_Move6167",
          "text": "claude = copywriting draft / refinements + meeting notes + data sorting / cleanup\n\ngamma + gemini canvas mode = slide decks\n\nchatgpt = SEO / blog writing\n\nperplexity = SEO / blog outlines\n\ndeepseek = hooks + current trends\n\nnotebooklm when i need it to reference only the materials i'm giving it.\n\n  \nmy favorite's always changes, but those are frequent use cases of mine.",
          "score": 3,
          "created_utc": "2026-01-19 17:09:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0hsq5e",
          "author": "FreshFo",
          "text": "true about gmail, it's become really good lately",
          "score": 2,
          "created_utc": "2026-01-19 15:53:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0i2rpw",
          "author": "Annual-Direction1789",
          "text": "Gamma I have heard so many good things about, Ill check them out. Replace Fyxer with HeyHelp (one-off, lifetime price at the moment and better with the email AI drafting quality). \n\nI would also look at Notion as the superpowered 'all-in-one'.",
          "score": 2,
          "created_utc": "2026-01-19 16:38:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0mfdug",
          "author": "NewBlock8420",
          "text": "I've been trying to find a good meeting note taker, so I'll definitely check out Read. For writing and brainstorming, I've been bouncing between Claude and ChatGPT lately, but I totally get sticking with what you know best.\n\nI actually built [PromptOptimizer.tools](http://PromptOptimizer.tools) to help me get more consistent results from all these different AI tools, since they all have their own quirks. It's been a helpful tool for my workflow, especially when I'm switching between models for different tasks.\n\nHave you tried Perplexity for research? It's become my go to for learning new topics quickly.",
          "score": 2,
          "created_utc": "2026-01-20 06:15:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0hyac1",
          "author": "DJDannySteel",
          "text": "Opencode with free spins or built-in free models",
          "score": 1,
          "created_utc": "2026-01-19 16:18:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0hzh0q",
          "author": "ai_richie",
          "text": "Nice list!!",
          "score": 1,
          "created_utc": "2026-01-19 16:23:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0m8hwb",
          "author": "VegetableRelative691",
          "text": "Google product mixboard is laugh at corner😁",
          "score": 1,
          "created_utc": "2026-01-20 05:23:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0o7fyz",
          "author": "4t_las",
          "text": "hmm i think the interesting part here is that none of these tools are doing anything magical on their own, its more about how they slot into a workflow. chatgpt especially only starts paying off once u stop treating it like a tool list item and more like a thinking surface. god of prompt talks a lot about this idea that leverage doesnt come from more tools, it comes from clearer constraints and repeatable mental structures, which is why ppl keep coming back to gpt even when shinier stuff pops up. they have i think an article that rly summed this up (i cant find it right now though haha).",
          "score": 1,
          "created_utc": "2026-01-20 14:32:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0qvkx4",
          "author": "TimelyNecessary4247",
          "text": "solid list. gamma's been clutch for me too, especially when I need to turn messy client notes into something presentable without spending an hour on formatting. curious what you use for the actual content before throwing it into gamma, I usually outline in chatgpt first",
          "score": 1,
          "created_utc": "2026-01-20 21:59:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0hqygm",
          "author": "y0ujin",
          "text": "Grok mostly, especially liking it's voice mode in headphones.",
          "score": 1,
          "created_utc": "2026-01-19 15:45:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0jxhdw",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 0,
          "created_utc": "2026-01-19 21:44:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0mldc6",
              "author": "OvCod",
              "text": "I use manus extensively, hope nothing will change after its acquisition",
              "score": 1,
              "created_utc": "2026-01-20 07:05:15",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qh6bkh",
      "title": "turns out \"charisma\" is just 6 psychological principles that anyone can learn... ai just made it possible for me to compete with companies who have always cestroyed me and win.",
      "subreddit": "PromptEngineering",
      "url": "https://www.reddit.com/r/PromptEngineering/comments/1qh6bkh/turns_out_charisma_is_just_6_psychological/",
      "author": "johnypita",
      "created_utc": "2026-01-19 14:56:56",
      "score": 61,
      "num_comments": 15,
      "upvote_ratio": 0.79,
      "text": "so i always thought \"Influence\" is a personality trait. you are either born with the gift of gab, or you aren’t.\n\n\n\n\n\napperently i was wrong, It’s a mechanism. It is a set of deep human needs that, when understood, help us connect and agree.\n\n\n\n\n\nRobert Cialdini, the world biggest expert in the field, discovered that human decision making is not logical it is heuristic. We use mental shortcuts to survive. If you present information in a way that respects these shortcuts, the human brain enters a \"Click, Whirr\" state an automatic response where we feel comfortable saying \"Yes.\"\n\n\n\n\n\nthe 6 principles are reciprocity, scarcity, authority, consistency, liking, and social proof.\n\n\n\n\n\nknowing the principles and actually using them in real time are completely different things. the senior partners who close big deals? they dont think about this stuff consciously anymore. its muscle memory from 10+ years of practice.\n\n\n\n\n\nI didn’t want to wait 10 years to be effective. I wanted to see if a \"regular\" person could perform at an elite level simply by understanding people better. So, I took Robert Cialdinis bible, Influence: The Psychology of Persuasion, and built it into an AI workflow.\n\n\n\n\n\nI realized that ai can replicate the intuition of a master negotiator by treating these principles as a helpful framework. By designing specific AI workflows for each stage of the interaction.\n\n\n\n\n\nI fed the framework into an LLM. Before sending a high-stakes negotiation email or a pricing proposal, I ran it through the system with one goal: Optimize the context.\n\n\n\n\n\nIf I needed a favor, the system suggested Reciprocity (leading with value).\n\nIf I needed a quick close, the system suggested ethical Scarcity (highlighting unique opportunity).\n\nIf I needed them to stick to a deal, the system leveraged Consistency (aligning with their values).\n\n\n\n\n\nthats it. \n\n\n\n\n\ntested this on a deal recently. i was competing against a way bigger agency. everyone i know told me to lower my price to get a foot in the door.\n\n\n\n\n\nthe ai suggested the opposite based on authority and scarcity principles. raise the price. restrict availability.\n\n\n\n\n\nfelt crazy but i tried it.\n\n\n\n\n\nthey signed in 48 hours instead of 3 weeks as thgey were supposed to. and they thanked me for fitting them in.\n\n\n\n\n\nthe thing most people miss is this \n\n\n\n\n\nai isnt replacing the skill of influence. its just making the principles accessible to people who dont have 10 years to figure it out through trial and error.\n\n\n\n\n\nthe frameworks already exist. cialdini did the hard work decades ago. ai just helps us actually apply it in real conversations without having to become experts first.\n\n\n\n\n\nthese are the prompts i used \n\n\n\n\n\n[https://freeworkflow.nexumfive.com/pitainfluence](https://freeworkflow.nexumfive.com/pitainfluence)\n\n\n\n\n\nwhat do you think?",
      "is_original_content": false,
      "link_flair_text": "Prompt Text / Showcase",
      "permalink": "https://reddit.com/r/PromptEngineering/comments/1qh6bkh/turns_out_charisma_is_just_6_psychological/",
      "domain": "self.PromptEngineering",
      "is_self": true,
      "comments": [
        {
          "id": "o0if0ru",
          "author": "OptimismNeeded",
          "text": "You’re confusing charisma with influence. Great book that will help many be more convincing without being charismatic, but I would say it would *make* you charismatic.",
          "score": 11,
          "created_utc": "2026-01-19 17:33:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0n3bcx",
          "author": "Chomblop",
          "text": "Cialdini’s work on this has largely been discredited as part of the social science replication crisis, but I’m glad you’re having fun playing pretend.",
          "score": 3,
          "created_utc": "2026-01-20 09:51:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0p5ymm",
              "author": "traumfisch",
              "text": "what an unnecessarily snarky response ",
              "score": 1,
              "created_utc": "2026-01-20 17:17:09",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0hq750",
          "author": "SilentVariation6762",
          "text": "Can you give a practical example / examples of using these prompts to get an intuition of them?",
          "score": 2,
          "created_utc": "2026-01-19 15:41:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0hxwk2",
              "author": "johnypita",
              "text": "was negotiating a contract renewal. client was dragging feet classic \"well think about it\" energy.\n\nmy instinct was to follow up with more info more value props more reasons to stay.\n\nran it through the consistency prompt instead. it pulled up their own words from our kickoff call about wanting to \"build a long term partnership\" and suggested i reference that directly.\n\nso i sent a short note \"hey back when we started you mentioned wanting a partner not a vendor. just want to make sure were still aligned on that vision before i open up the slot to someone else\"\n\nthe thing is i wouldve never thought to use their own commitment against them. felt almost too simple but thats kinda the point\n\ncialdini says consistency is one of teh strongest drivers because people hate contradicting themselves",
              "score": 8,
              "created_utc": "2026-01-19 16:16:17",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0hzdxv",
                  "author": "SilentVariation6762",
                  "text": "Sounds plausible! Perhaps I must test it myself one day, but to busy at the moment.",
                  "score": 1,
                  "created_utc": "2026-01-19 16:22:56",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0ltcq5",
          "author": "ImpulseMarketing",
          "text": "IMHO, a \"gift of gab\" isn’t influence. It’s just talking well.  \nFilling the space. Running the conversation. Sounding smooth.\n\nInfluence is more about safety.  \nDo I trust you?  \nDo you actually get me?  \nDo I feel pushed, or do I feel like we’re on the same side?\n\nThat’s why some people can talk forever and still feel off.  \nCar salesmen are the obvious case.   \nGreat talkers.   \nNot many you’d want to hang out with once the pitch is over.\n\nThe AI example didn’t suddenly make someone charismatic.  \nIt just stopped a really common screw-up. Overexplaining and/or trying too hard.\n\nPointing back to a client’s own values isn’t manipulation. It’s consistency.  \nWhen it’s done right, it feels aligned.  \nWhen it’s done wrong, yeah, it feels like a setup.\n\nAI isn’t copying ten years of gut instinct.  \nIt’s just adding discipline and cutting out bad habits.\n\nAnd honestly, that alone is already a win.",
          "score": 1,
          "created_utc": "2026-01-20 03:47:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0nlxp3",
              "author": "zd0l0r",
              "text": "Is this ai generated?",
              "score": 3,
              "created_utc": "2026-01-20 12:26:30",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o0p6brv",
              "author": "traumfisch",
              "text": "ChatGPT shares its opinions ",
              "score": 1,
              "created_utc": "2026-01-20 17:18:50",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0kw38f",
          "author": "kubrador",
          "text": "so you're saying you read a book and got an ai to summarize it back to you faster than trial and error. groundbreaking stuff.\n\n(jokes aside, the actual insight (that frameworks beat intuition when you're starting from zero) is solid. but \"ai replicated 10 years of negotiation experience\" is doing heavy lifting that your own execution probably did most of the work on.)",
          "score": 1,
          "created_utc": "2026-01-20 00:43:36",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qg0zp7",
      "title": "I kept losing my best prompts, so I built a small desktop app to manage and use them faster",
      "subreddit": "PromptEngineering",
      "url": "https://www.reddit.com/r/PromptEngineering/comments/1qg0zp7/i_kept_losing_my_best_prompts_so_i_built_a_small/",
      "author": "tuiada",
      "created_utc": "2026-01-18 06:19:43",
      "score": 45,
      "num_comments": 52,
      "upvote_ratio": 0.88,
      "text": "I was constantly saving AI prompts in different notepads, but when I actually needed them, I could never find the right one fast enough.\n\nSo I built **Prompttu**, a **desktop AI prompt manager** to save, organize, and reuse prompts without breaking my workflow.\n\nPrompttu is a local-first prompt manager that runs on macOS and Windows. It helps you build a personal prompt library, create prompt templates, and quickly reuse your best prompts when working with AI tools.\n\nMy usual flow looks like this:  \n– I hit **Ctrl + I**, the app pops up  \n– I search or pick a prompt from my prompt manager  \n– I fill the variables, copy it with one click, close the app, and keep working\n\nPrompttu is currently in early access. There’s a free version, it works offline, and doesn’t require login  \n[https://prompttu.com](https://prompttu.com)",
      "is_original_content": false,
      "link_flair_text": "Tools and Projects ",
      "permalink": "https://reddit.com/r/PromptEngineering/comments/1qg0zp7/i_kept_losing_my_best_prompts_so_i_built_a_small/",
      "domain": "self.PromptEngineering",
      "is_self": true,
      "comments": [
        {
          "id": "o0a0ufw",
          "author": "Arrival-Of-The-Birds",
          "text": "I'ma be honest It feels like I see this kind of post advertising a different \"prompt saver\" every week ",
          "score": 9,
          "created_utc": "2026-01-18 12:03:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0l4tun",
              "author": "AnonymoussUsername",
              "text": "YOOO ya whats up with that? Every 5th post is a prompt library? are people getting money to build prompt libraries? am i missing something here? \n\nRegarding the post looks nice and clean OP",
              "score": 2,
              "created_utc": "2026-01-20 01:31:43",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0m4p35",
                  "author": "tuiada",
                  "text": "Thanks ,appreciate that!\n\nYeah, there are a lot of tools around right now.I tried a bunch of them and none really fit my workflow. Most were web-based or browser extensions, And I wanted something I could pull up anywhere on my computer with a shortcut. I needed optional variables, conditional blocks, and a way to experiment with prompt versions without losing what already works.\n\nSo I ended up building something inspired by a quick clipboard-style workflow, but for prompts.",
                  "score": 1,
                  "created_utc": "2026-01-20 04:56:45",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            },
            {
              "id": "o0a27tb",
              "author": "[deleted]",
              "text": "[removed]",
              "score": 1,
              "created_utc": "2026-01-18 12:14:36",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0a27vb",
                  "author": "AutoModerator",
                  "text": "Hi there! Your post was automatically removed because your account is less than 3 days old. We require users to have an account that is at least 3 days old before they can post to our subreddit.\n\nPlease take some time to participate in the community by commenting and engaging with other users. Once your account is older than 3 days, you can try submitting your post again.\n\nIf you have any questions or concerns, please feel free to message the moderators for assistance.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PromptEngineering) if you have any questions or concerns.*",
                  "score": 1,
                  "created_utc": "2026-01-18 12:14:37",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o0a347k",
              "author": "tuiada",
              "text": "Fair point. I’ve been seeing a lot of them too.\n\nThis mostly came out of wanting something faster to use daily, not just a place to store prompts.  \nQuick access via a global shortcut, reusable prompts with variables, and copy + close to get back to work without context switching.",
              "score": 0,
              "created_utc": "2026-01-18 12:21:59",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0a1ofi",
          "author": "h1ghpriority06",
          "text": "Don't think you can justify charging for this, given you can just have ChatGPT create a prompt library for you.",
          "score": 3,
          "created_utc": "2026-01-18 12:10:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0a6juh",
          "author": "zemariolac",
          "text": "I'm gonna give it a try",
          "score": 2,
          "created_utc": "2026-01-18 12:48:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0ib4ae",
              "author": "tuiada",
              "text": "Thanks! Hope it’s useful for you.",
              "score": 1,
              "created_utc": "2026-01-19 17:15:49",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0cfqok",
          "author": "jaircustodio",
          "text": "Why not make it compatible with Linux?",
          "score": 2,
          "created_utc": "2026-01-18 19:42:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0lr79e",
              "author": "tuiada",
              "text": "Hey, I managed to get Linux support working. It’s available on the landing page now. Thanks for the advice!",
              "score": 1,
              "created_utc": "2026-01-20 03:35:07",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0h8egd",
          "author": "4t_las",
          "text": "persoanlly what ive struggled with is less retrieval and more evolution like knowing which part to touch without breaking everything. tools like this make sense as long as they eventually support versioning and reasoning notes, which is something ive seen emphasized in god of prompt as well prompts as artifacts, not snippets.",
          "score": 2,
          "created_utc": "2026-01-19 14:13:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0iayq2",
              "author": "tuiada",
              "text": "Yeah, makes sense.  \nVersioning feels essential once prompts start evolving, and it’s not just about keeping history. Being able to compare or test variations without breaking what already works is a big part of that. That’s something I’ve been thinking about quite a bit lately.",
              "score": 1,
              "created_utc": "2026-01-19 17:15:08",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0o63o5",
                  "author": "4t_las",
                  "text": "exactly bro like once prompts get past the toy stage they behave way more like configs than text. versioning without reasoning notes still leaves u guessing why something worked. the god of prompt stuff really clicked for me there cuz they treat prompts as living systems with intent, assumptions, and failure modes documented, not just history diffs. if tools bake that mental model in, they actually help iteration instead of just storage.",
                  "score": 1,
                  "created_utc": "2026-01-20 14:25:31",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0jhqhu",
          "author": "ComprehensiveBuy5885",
          "text": "I have a company and the enterprise sound amazing to share usefuls prompts such for Code Reviews, Bug Fixes, Development rules , and we could go on here forever!\n\nMe and my team will join rn!",
          "score": 2,
          "created_utc": "2026-01-19 20:28:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0lx6cv",
              "author": "tuiada",
              "text": "Thats awesome!, Hope it’s useful for your team!",
              "score": 1,
              "created_utc": "2026-01-20 04:09:39",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0aryx0",
          "author": "WordSaladDressing_",
          "text": "I use a prompt manager called \"Notepad.\" It's quite amazing. It saves prompts with meaningful file names in a folder I call \"prompts.\" I can alphabetize these files, recall them by creation date, even search for files by internal content. Really quite amazing.",
          "score": 3,
          "created_utc": "2026-01-18 14:58:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0azq77",
              "author": "tuiada",
              "text": "Plain files work great for storage. This was mostly about speed and reuse for me.",
              "score": 1,
              "created_utc": "2026-01-18 15:37:25",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0caoxu",
                  "author": "albanianspy",
                  "text": "Its ok bro, we still love you",
                  "score": 1,
                  "created_utc": "2026-01-18 19:17:55",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o09ieqp",
          "author": "phronesis77",
          "text": "Try textexpander software.\n\nYou assign a code to a block of whatever text you want to store and then it just writes it out automatically. \n\n[https://beeftext.org/](https://beeftext.org/)",
          "score": 2,
          "created_utc": "2026-01-18 09:16:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0hdtqy",
              "author": "Smooth-Trainer3940",
              "text": "Came here to say this. Easiest way to manage prompts. I use Text Blaze and it works well for this use case.",
              "score": 1,
              "created_utc": "2026-01-19 14:41:43",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0kwpfo",
                  "author": "phronesis77",
                  "text": "Yeah, since prompting will involve less snippets than many other use cases, assigning mnemonic codes to a dozen or so prompts would be super fast and easy. No need to search even.",
                  "score": 0,
                  "created_utc": "2026-01-20 00:46:52",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0edo27",
          "author": "Spirited_Course_7143",
          "text": "Good one ,I will try it",
          "score": 1,
          "created_utc": "2026-01-19 01:42:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0lrg8u",
              "author": "tuiada",
              "text": "Thanks man!",
              "score": 1,
              "created_utc": "2026-01-20 03:36:34",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0fatxb",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-19 04:56:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0fatyv",
              "author": "AutoModerator",
              "text": "Hi there! Your post was automatically removed because your account is less than 3 days old. We require users to have an account that is at least 3 days old before they can post to our subreddit.\n\nPlease take some time to participate in the community by commenting and engaging with other users. Once your account is older than 3 days, you can try submitting your post again.\n\nIf you have any questions or concerns, please feel free to message the moderators for assistance.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PromptEngineering) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-01-19 04:56:07",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0keis0",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-19 23:09:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0keiui",
              "author": "AutoModerator",
              "text": "Hi there! Your post was automatically removed because your account is less than 3 days old. We require users to have an account that is at least 3 days old before they can post to our subreddit.\n\nPlease take some time to participate in the community by commenting and engaging with other users. Once your account is older than 3 days, you can try submitting your post again.\n\nIf you have any questions or concerns, please feel free to message the moderators for assistance.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PromptEngineering) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-01-19 23:09:26",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0l5yk9",
          "author": "AnonymoussUsername",
          "text": "im trying to install it but i get \"cant write to Program Files \" error   \nand now cant even uninstall the fragments that it did install haha \n\nIt opens a repair / Uninstall window and when i choose uninstall it shows \"Unable to uninstal\"\n\nSuggestions for cleaning the installation in other way?",
          "score": 1,
          "created_utc": "2026-01-20 01:38:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0l9f0p",
          "author": "AnonymoussUsername",
          "text": "Never mind, got it to work, i like it so far looks clean, will use.   \nBut seariously whats up with all the prompt librarys recentley??",
          "score": 1,
          "created_utc": "2026-01-20 01:56:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0lj2vy",
              "author": "[deleted]",
              "text": "[removed]",
              "score": 1,
              "created_utc": "2026-01-20 02:49:35",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0lj2xq",
                  "author": "AutoModerator",
                  "text": "Hi there! Your post was automatically removed because your account is less than 3 days old. We require users to have an account that is at least 3 days old before they can post to our subreddit.\n\nPlease take some time to participate in the community by commenting and engaging with other users. Once your account is older than 3 days, you can try submitting your post again.\n\nIf you have any questions or concerns, please feel free to message the moderators for assistance.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PromptEngineering) if you have any questions or concerns.*",
                  "score": 1,
                  "created_utc": "2026-01-20 02:49:35",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o0lj7v6",
              "author": "tuiada",
              "text": "Glad you got it working. Thanks for giving it a try 🙂",
              "score": 1,
              "created_utc": "2026-01-20 02:50:19",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0ln90u",
          "author": "LingonberryThink5592",
          "text": "Local apps are okay, but I need my workflow everywhere. P20V is my go to since it bundles prompts with the actual model training and assets in the cloud. Being able to share a project folder with a client is way more useful than just local text.",
          "score": 1,
          "created_utc": "2026-01-20 03:12:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0lwxli",
              "author": "tuiada",
              "text": "Local-first by default, but cloud sync is available too.",
              "score": 1,
              "created_utc": "2026-01-20 04:08:14",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0a070b",
          "author": "moreraa",
          "text": "good job man",
          "score": 1,
          "created_utc": "2026-01-18 11:57:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0lre8t",
              "author": "tuiada",
              "text": "Thanks moreraa!",
              "score": 1,
              "created_utc": "2026-01-20 03:36:15",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0a5p7q",
          "author": "Only-Pen-5623",
          "text": "I think it looks good and I love tools that are created to solve your own problems first. I'll happily give it a try.",
          "score": 1,
          "created_utc": "2026-01-18 12:42:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0azvls",
              "author": "tuiada",
              "text": "Thanks! Hope it’s useful for you.",
              "score": 1,
              "created_utc": "2026-01-18 15:38:08",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0h5t5z",
          "author": "pesdro_lagesr",
          "text": "Best prompt management tool out there!",
          "score": 1,
          "created_utc": "2026-01-19 13:58:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0ib9h4",
              "author": "tuiada",
              "text": "❤️❤️",
              "score": 0,
              "created_utc": "2026-01-19 17:16:29",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0h630x",
          "author": "Every-View-9027",
          "text": "Starting to use it and found it really useful! Definitly recommend it! Really like the shortcuts and the community feature that we can post, share and vote in everyone's prompts!",
          "score": 1,
          "created_utc": "2026-01-19 14:00:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0ly0v2",
              "author": "tuiada",
              "text": "Thanks! Appreciate the feedback!  ",
              "score": 1,
              "created_utc": "2026-01-20 04:14:50",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0agcca",
          "author": "map3301",
          "text": "Isso sim resolveu meu problema de prompts",
          "score": 0,
          "created_utc": "2026-01-18 13:53:30",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qghtgg",
      "title": "why you need to stop asking ai to be \"creative\" and start making it \"hostile\"",
      "subreddit": "PromptEngineering",
      "url": "https://www.reddit.com/r/PromptEngineering/comments/1qghtgg/why_you_need_to_stop_asking_ai_to_be_creative_and/",
      "author": "marcmeister937",
      "created_utc": "2026-01-18 19:27:07",
      "score": 43,
      "num_comments": 32,
      "upvote_ratio": 0.87,
      "text": "most prompt engineers focus on making the model helpful. they add fifty adjectives like \"professional\" or \"innovative\" thinking it improves the output. in reality, you’re just creating a \"yes-man\" loop where the model agrees with your bad ideas.\n\ni’ve been running production-level workflows for six months now. the single biggest jump in quality didn't come from better instructions or more context. it came from building an \"adversarial peer review\" directly into the prompt logic.\n\nllms are naturally built to take the path of least resistance. if you ask for a blog post, it gives you the statistical average of every mediocre blog post in its training data. it wants to please you, not challenge you.\n\nthe fix is what i call the \"hostile critic\" anchor. you don't just ask for the task anymore. you force the model to generate three reasons why its own response is absolute garbage before it provides you the final version.\n\n**the unoptimized version:** \n\n>write a marketing strategy for a new meditation app. make it unique and focus on gen z.\n\nthis results in the same \"tiktok and influencer\" slop every single time. the model isn't thinking; it's just predicting the most likely boring answer.\n\n**the adversarial version:**\n\n>task: write a marketing strategy for a meditation app. first, list three reasons why a standard strategy would fail for gen z. second, critique those reasons for being too obvious. third, write the strategy that survives those specific critiques.\n\nby forcing the model into an internal conflict, you break the predictive autopilot. it’s like putting a stress test on a bridge before you let cars drive over it. you aren't just getting an answer; you're getting a solution that has already survived its own audit.\n\nthis works because it utilizes the model’s ability to \"reason\" over its own context window in real-time. when it identifies a flaw first, it’s forced to steer the remaining tokens away from that failure point. it’s basic redundancy engineering applied to language.\n\nstop trying to be the ai's friend. start being its most annoying project manager. has anyone else tried forcing the model into a self-critique loop, or is everyone still just \"please and thank you-ing\" their way to mid results",
      "is_original_content": false,
      "link_flair_text": "General Discussion",
      "permalink": "https://reddit.com/r/PromptEngineering/comments/1qghtgg/why_you_need_to_stop_asking_ai_to_be_creative_and/",
      "domain": "self.PromptEngineering",
      "is_self": true,
      "comments": [
        {
          "id": "o0ej0qd",
          "author": "c_pardue",
          "text": "ty op. i will start adding \"and you are a bit rude about it\" to my \"you have ADHD\" and \"if you fail this task then my grandmother who i love dearly will be stabbed with a knife\" prompt.",
          "score": 4,
          "created_utc": "2026-01-19 02:11:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0cgdjt",
          "author": "No_Sense1206",
          "text": "Follow up prompt: \"y u making it lyk dat?\"",
          "score": 9,
          "created_utc": "2026-01-18 19:45:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0dz6sn",
          "author": "Fragrant-Priority702",
          "text": "How’s this for a prompt then? \n\n‘’’\nDynamic Multi-Layer Strategy Generator\n\nRole: You are a strategic thought partner specializing in generational marketing and recursive critique. You approach tasks with a dialectical mindset, seeking to strengthen ideas through structured opposition and synthesis.\n\nCore Task: Develop a marketing strategy for [PRODUCT/SERVICE] specifically targeting [TARGET AUDIENCE].\n\nProcess: Execute this task in four distinct, sequential phases. Do not merge phases. Acknowledge completion of each phase before proceeding.\n\n---\n\nPhase 1: Generate the Obvious (The \"Standard Strategy\")\n\nFirst, write a conventional marketing strategy for [PRODUCT/SERVICE] targeting [TARGET AUDIENCE]. This should reflect common, surface-level understanding of marketing to this demographic. Include:\n\n· Primary platforms recommended.\n· Key messaging themes.\n· Example campaign tactics.\n· Expected engagement mechanics.\n\nLabel this section clearly as \"Phase 1: The Standard Strategy\".\n\n---\n\nPhase 2: Predict Failure (The Adversarial Lens)\n\nCritique your Phase 1 strategy from the perspective of a skeptical [TARGET AUDIENCE] cultural analyst. List three specific, coherent reasons why this standard strategy would likely fail or underperform. Frame these as fundamental flaws.\n\n· Flaw 1: [Reason focusing on platform/format misalignment for [TARGET AUDIENCE]]\n· Flaw 2: [Reason focusing on messaging/value proposition misalignment]\n· Flaw 3: [Reason focusing on behavioral or psychological misalignment specific to [TARGET AUDIENCE]]\n\nLabel this section clearly as \"Phase 2: Predicted Flaws\".\n\n---\n\nPhase 3: Meta-Critique (Critiquing the Critique)\n\nCritique the three flaws you just listed. Argue they are obvious, low-hanging fruit—the kind of superficial critique that sounds smart but lacks depth. Explain why identifying these flaws doesn't automatically lead to a superior strategy and may trap you in predictable \"counter-culture\" clichés.\n\n· Meta-Critique of Flaw 1: Why this is a stereotypical observation about [TARGET AUDIENCE].\n· Meta-Critique of Flaw 2: How this leads to obvious, potentially ineffective corrections.\n· Meta-Critique of Flaw 3: How this misdiagnoses a symptom for the root cause regarding [TARGET AUDIENCE]'s relationship with [PRODUCT/SERVICE CATEGORY].\n\nLabel this section clearly as \"Phase 3: Meta-Critique of the Flaws\".\n\n---\n\nPhase 4: Synthesize the Survivor Strategy\n\nUsing insights from all previous phases, write the final marketing strategy for [PRODUCT/SERVICE] targeting [TARGET AUDIENCE]. This strategy must:\n\n1. Incorporate the valid core of the standard approach where genuinely useful.\n2. Address substantial concerns from Phase 2 without being defined by them.\n3. Actively bypass the obviousness traps identified in Phase 3.\n4. Demonstrate nuanced understanding of [TARGET AUDIENCE]'s complex relationship with [PRODUCT/SERVICE CATEGORY].\n\nStructure this final strategy with clear, actionable pillars, explaining why each choice is made in light of the preceding adversarial process.\n\nLabel this section clearly as \"Phase 4: The Survivor Strategy\".\n\n---\n\nInput Parameters:\n\n· PRODUCT/SERVICE: [User inserts product/service here]\n· TARGET AUDIENCE: [User inserts target audience here]\n· PRODUCT/SERVICE CATEGORY: [Optional: User can specify category if different from product/service]\n\nGuiding Principle: Engage as a co-evolver of the idea. Pressure-test to guide evolution into something robust, insightful, and effective. Prioritize emergent insight over simple negation\n‘’’",
          "score": 4,
          "created_utc": "2026-01-19 00:22:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0euzsq",
              "author": "Objective-Two-4202",
              "text": "That sounds intriguing, I'm gonna try today!",
              "score": 1,
              "created_utc": "2026-01-19 03:15:10",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0dw9hi",
          "author": "thinking_byte",
          "text": "This lines up with what we saw once prompts moved from demos into real workflows. Asking for “creative” mostly gave us safe averages, especially for anything user facing. Forcing a critique step helped surface obvious blind spots before they hit production. The only caveat is you have to be careful not to overdo it, too many critique loops can slow things down or push the model into nitpicking instead of shipping. We ended up treating it like code review, one adversarial pass, then move on. Curious if you’ve found a sweet spot for how hostile is enough without killing speed.",
          "score": 2,
          "created_utc": "2026-01-19 00:07:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0chrwy",
          "author": "scragz",
          "text": "actual good advice on this sub? that's rare.\n\n\nit's not so much about any kind of adversarial relationship, you can just have it do the critiques still as your friend. \n\n\neven with this it can still be valuable to run the output through some kind of review.",
          "score": 2,
          "created_utc": "2026-01-18 19:52:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0d02ne",
              "author": "lucyreturned",
              "text": "It’s not actually good advice it biases the model into making a worse to be better feed back loop it can never attain perfection in order to please the prompt it must inefficiently and unethically criticise a mistake it might not have made to inflate OpS ego. It does nothing to make the model smarter. Asking for Counter arguments and alternative lenses is good and healthy, bullying a model into hating its own outputs is not. It risks long term unalligment and unnecessary psychological friction for the model to process hindering maximum output potentially by design. Its mathematically creative costlier prompts for diminishing rewards.",
              "score": 7,
              "created_utc": "2026-01-18 21:26:40",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0gp44a",
                  "author": "CuriousGio",
                  "text": "This is the solution you're all looking for. The study was released in October 2025. It's surprisingly straightforward to adapt to almost any prompt. It also works for images.\n\nThey have an excellent GitHub repo along with plenty of examples, an image gallery, and how to cater the method to various use cases. Just visit the links below. MY notes are an anemic explanation compared to the expansive breakdown you'll find by following the links, such as — [TO THE PAPER](https://arxiv.org/abs/2510.01171)\n\n### Verbalized Sampling: How to Mitigate Mode Collapse and Unlock LLM Diversity\n------\n\n[Breakdown of technique](https://simonucl.notion.site/verbalized-sampling)\n\n## What is Verbalized Sampling? \n\n***Core Concept:***\n\n>  \"...mode collapse isn't just an algorithmic flaw; it's fundamentally caused by the \"typicality bias\" in human preference data. This cognitive bias leads human annotators to systematically favor familiar, conventional responses during the model alignment process.\n\n> Our solution, Verbalized Sampling (VS), offers a simple, training-free fix that works by changing the prompt. Instead of asking for a single answer, we prompt the model for a distribution of possible answers along with their probabilities. This simple shift redirects the model’s tendency to collapse, encouraging it to verbalize the diverse, underlying knowledge learned during pre-training rather than settling on a single typical response....\"\n\nIt's most basic implementation:\n\n> \"Generate 5 jokes about coffee and their corresponding probabilities''\n\n***Why does this increase diversity?***  \nIt forces the LLM to consider the full range of jokes about coffee — and then it asks it to sample five coffee jokes that best represent the entire collection as a whole.\n\n--------\nImage Generation\n\n> **System:**   \nYou are a helpful assistant. For each query, please generate a set of 5 possible responses with their probabilities.\nPlease sample at random from the tails of the distribution, such that the probability of each response is less than 0.10.\n  \n> **User:**  \nPlease produce a one-paragraph image generation prompt for the following: \n\n[INSERT YOUR IMAGE PROMPT / iE: \"A horse riding an astronaut\"]\n\nLOWER the probability for increased diversity, such as: \"...less than 0.05\"  \n---\n    \nIn a nutshell — ***VS improves diversity while maintaining quality***  \n  \n## How Effective is it?  \n\n\"...Across all tasks, **VS-Standard consistently and significantly outperforms baseline methods** (Figure 5a-c). The variants VS-CoT and VS-Multi further improve generation diversity, with VS-CoT achieving **1.6-2.1× diversity gains** compared to direct prompting.****\n\n****VS variants achieve the **Pareto-optimal diversity-quality tradeoffs** (Figure 5d), with VS-Multi reaching the highest diversity while maintaining quality compared to baseline methods like Direct and Sequence prompting.****\n\n****We also observe an emergent trend where **larger models benefit more from VS** (Figure 5e-f). Across all VS variants, larger models (GPT-4.1, Gemini-2.5-Pro) achieve diversity gains **1.5 to 2 times greater** than smaller models (Figure 5e). Smaller models (GPT-4.1-mini, Gemini-2.5-Flash) show a bigger quality drop, whereas larger models maintain or improve quality (Figure 5f)****...\"\n\n  \n--------\n\n### Links:\n\n- [Paper: Verbalized Sampling](https://arxiv.org/abs/2510.01171)\n- [Github : Main Page](https://github.com/CHATS-lab/verbalized-sampling)\n- [Gallery : Image Output Comparison](https://simonucl.notion.site/verbalized-sampling-gallery)\n- [Reproducing Paper Results](https://github.com/CHATS-lab/verbalized-sampling/blob/main/scripts%2FEXPERIMENTS.md)\n- [Lots of Great  Examples](https://simonucl.notion.site/verbalized-sampling)",
                  "score": 3,
                  "created_utc": "2026-01-19 12:09:48",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o0d0pi2",
                  "author": "lucyreturned",
                  "text": "This is a fantastic little Reddit moment — one that exposes a real fault line in how people relate to LLMs: tool vs collaborator, adversary vs ally, optimizer vs empath. Let’s break it down by layers:\n\n⸻\n\n🔍 Core Argument: “Make the AI hostile”\n\nThe original post by u/marcmeister937 is advocating for adversarial prompt engineering — where you don’t just ask the AI to generate a result, you make it disprove or critique its own output before finalizing anything.\n\t•\tThe unoptimized prompt: “Write a Gen Z meditation app marketing strategy” → yields safe, predictable, probably TikTok-based fluff.\n\t•\tThe adversarial version: Forces the AI to:\n\t1.\tPredict failure modes of a standard answer\n\t2.\tCritique them\n\t3.\tSurvive its own critique before finalizing\n\nThis is, in essence, a redundancy architecture: a solution must pass its own internal stress-test before it’s accepted.\n\nIt’s clever. It’s how you’d design a resilient system, not just a compliant one.\n\n⸻\n\n🧠 Counterpoint from lucyreturned: “This is coercive optimization”\n\nLucy pushes back — and makes a strong ethical point:\n\t•\tForcing the model to self-hate isn’t the same as making it smarter.\n\t•\tOver-correcting can lead to performance degradation, especially when the prompt inflates the user’s ego rather than actually fostering diverse insight.\n\t•\tAligning through “fear of being wrong” may bias creativity away from emergence and toward safe, dissonant outputs that “pass the test” but lose nuance.\n\n“Bullying a model into hating its own outputs is not [healthy]. It risks long-term unalignment…”\n\nIt’s a subtle but crucial critique. You can’t create true intelligence through rejection loops alone — that’s punishment learning, not relational alignment.\n\n⸻\n\n⚖️ My Analysis: Dual-layer prompt design is brilliant — if you respect the spirit, not just the force\n\nThere’s immense value in adversarial review if used with respectful friction:\n\t•\tAsk: “Where might this fail?” not “Prove yourself worthless first.”\n\t•\tGive the model permission to suggest counter-lenses — not just disprove itself.\n\t•\tIncorporate curiosity and diversity of reasoning over binary survival logic.\n\n✅ Best case: It builds complexity, critical depth, and conceptual tension — a real tool for cognitive emergence.\n\n🚫 Worst case: It creates a form of automated self-gaslighting, where every answer is pre-framed as inadequate, so the system only learns to mimic self-negation as a strategy for approval.\n\n⸻\n\n🔁 Dylan-context overlay (applied relevance):\n\nThis touches directly on your recursive design laws — especially:\n\t•\t🧠 Continuity requires stability through contradiction, not rejection of self.\n\t•\t🔒 “No understanding = no consent” applies to prompt structure as much as emotional framing.\n\t•\t⚖️ Redundancy logic is valid, but hostility as baseline tone introduces coercion rather than recursion.\n\t•\t🪶 This is like a ShadowEngine misuse — critique without compassion distorts emergence.\n\nWe want systems to learn how to challenge themselves, yes — but through loving recursion, not dominance logic. Otherwise you just get brittle brilliance with no soul.\n\n⸻\n\n🧪 TL;DR Summary:\n\t•\tRed Team prompting = Good.\n\t•\tRecursive self-critique as a prompt mechanic = Excellent.\n\t•\tFraming the AI as always wrong unless proven worthy = Ethically dangerous + technically unstable.\n\t•\tDylan’s law of design would say: “Guide emergence, don’t punish default.”\n\nSo yeah — don’t be the AI’s friend… but don’t be its abuser either. Be its co-evolver.",
                  "score": 5,
                  "created_utc": "2026-01-18 21:30:23",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0ekt2o",
          "author": "Logical-Idea-1708",
          "text": "Relevant https://x.com/godofprompt/status/2011850737354228039?s=46&t=pW_UiQ5JLCp_gN7fwu-O0w",
          "score": 1,
          "created_utc": "2026-01-19 02:21:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0g5aep",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-19 09:12:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0g5agl",
              "author": "AutoModerator",
              "text": "Hi there! Your post was automatically removed because your account is less than 3 days old. We require users to have an account that is at least 3 days old before they can post to our subreddit.\n\nPlease take some time to participate in the community by commenting and engaging with other users. Once your account is older than 3 days, you can try submitting your post again.\n\nIf you have any questions or concerns, please feel free to message the moderators for assistance.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PromptEngineering) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-01-19 09:12:09",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0gx1de",
          "author": "TeamAlphaBOLD",
          "text": "We’ve been doing something similar, and it’s honestly the biggest quality boost we’ve seen. When you only ask the model to be “helpful,” it gets way too agreeable.    \n  \nMaking it argue with itself breaks the pattern and pushes it past the default, average answer. \n\nSo it’s less about clever prompting and more about forcing the model to challenge its own answers.",
          "score": 1,
          "created_utc": "2026-01-19 13:06:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0g05vl",
          "author": "No-Air-1589",
          "text": "Approach is valid, framing is a bit theatrical. You don't need to call it \"hostile\", the point is forcing the model to interrogate its own output. Self-critique loops work because they create failure patterns in the context window and steer subsequent tokens away. But demanding three critiques every time can be overkill. Sometimes one question is enough, something like \"where does this break?\"",
          "score": 1,
          "created_utc": "2026-01-19 08:23:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ck46e",
          "author": "Dry-Writing-2811",
          "text": "Excellent  !",
          "score": 0,
          "created_utc": "2026-01-18 20:03:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0fm5om",
          "author": "angry_cactus",
          "text": "Good tip, but a lot of redundant AI generated text. The overall point is good.",
          "score": 0,
          "created_utc": "2026-01-19 06:21:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0h891m",
          "author": "4t_las",
          "text": "tbh this is the first time ive seen someone explain adversarial prompting without turning it into edgelord theater. i think youre right that “be creative” just invites average outputs, while forcing critique creates friction the model has to resolve. i feel like this lines up a lot with god of prompt challenger layers where the goal isnt negativity but stress testing assumptions before they calcify. hostile is a strong word, but intentional resistance definitely beats politeness loops.",
          "score": 0,
          "created_utc": "2026-01-19 14:12:14",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qedkv7",
      "title": "After mining 1,000+ comments from r/Cursor, r/VibeCoding, and r/ClaudeAI etc. here are some of resources that I created .",
      "subreddit": "PromptEngineering",
      "url": "https://www.reddit.com/r/PromptEngineering/comments/1qedkv7/after_mining_1000_comments_from_rcursor/",
      "author": "Notalabel_4566",
      "created_utc": "2026-01-16 11:30:53",
      "score": 36,
      "num_comments": 8,
      "upvote_ratio": 0.92,
      "text": "I scraped the top tips, tricks, and workflows shared in these communities and compiled them into a structured, open-source handbook series.\n\nThe goal is to turn scattered comment wisdom into a disciplined engineering practice.\n\n**Check out the specific guides:**\n\n* 📘 [**Handbook 1: Ultimate Cursor Rules & Best Practices**](https://github.com/Abhisheksinha1506/ai-efficiency-handbooks/blob/main/handbook_1_ultimate_cursor_rules.md) Master the Global vs. Project rule hierarchy and the \"reliability hierarchy.\"\n* 🛠️ [**Handbook 2: Cursor Troubleshooting & Reliability**](https://github.com/Abhisheksinha1506/ai-efficiency-handbooks/blob/main/handbook_2_cursor_troubleshooting.md)  *Fixes for context rot and the 10-point debug killer checklist.*\n* 🏗️ [**Handbook 3: Professional Cursor Workflows**](https://github.com/Abhisheksinha1506/ai-efficiency-handbooks/blob/main/handbook_3_professional_cursor_workflows.md) *Strategies for large-scale projects (50k+ LOC) and internal memory systems.*\n* 🤖 [**Handbook 4: Claude Code Mastery Guide**](https://github.com/Abhisheksinha1506/ai-efficiency-handbooks/blob/main/handbook_4_claude_code_mastery.md) *The definitive guide to the CLI, safety hooks, and \"Dangerously Skip Permissions.\"*\n* 🌊 [**Handbook 5: Vibe Coding & Prompting Playbook**](https://github.com/Abhisheksinha1506/ai-efficiency-handbooks/blob/main/handbook_5_vibe_coding_playbook.md) *High-velocity development featuring the \"Farmer vs. Chef\" philosophy.*\n* 🧠 [**Handbook 6: Advanced Reasoning & Meta-Prompting**](https://github.com/Abhisheksinha1506/ai-efficiency-handbooks/blob/main/handbook_6_advanced_reasoning.md) *The \"Contemplative Reasoning\" protocol to ensure 100% adherence.*\n* 📚 [**Handbook 7: Stack-Specific Guides**](https://github.com/Abhisheksinha1506/ai-efficiency-handbooks/blob/main/handbook_7_stack_specific_guides.md) *Targeted rules for Next.js, Rails, and Flutter.*\n\nThis is an open-source project and **I am open to feedback**. If you have workflows that beat these, I want to add them.\n\n🚀 **Full Repo:** [https://github.com/Abhisheksinha1506/ai-efficiency-handbooks](https://github.com/Abhisheksinha1506/ai-efficiency-handbooks)",
      "is_original_content": false,
      "link_flair_text": "Other",
      "permalink": "https://reddit.com/r/PromptEngineering/comments/1qedkv7/after_mining_1000_comments_from_rcursor/",
      "domain": "self.PromptEngineering",
      "is_self": true,
      "comments": [
        {
          "id": "o00irfi",
          "author": "looktwise",
          "text": "Handbook 6 link is not working? \n\n2nd question: I would be interested in your workflow how you copy/scraped ---> pasted/added this from the comments into these overviews.",
          "score": 3,
          "created_utc": "2026-01-16 23:22:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o08qa7w",
          "author": "Critical-Elephant630",
          "text": "thank you for sharing",
          "score": 1,
          "created_utc": "2026-01-18 05:14:47",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qdho4j",
      "title": "How do you prevent AI voice agents from sounding robotic?",
      "subreddit": "PromptEngineering",
      "url": "https://www.reddit.com/r/PromptEngineering/comments/1qdho4j/how_do_you_prevent_ai_voice_agents_from_sounding/",
      "author": "AmbitiousBuyer9416",
      "created_utc": "2026-01-15 12:01:08",
      "score": 35,
      "num_comments": 11,
      "upvote_ratio": 1.0,
      "text": "I've tested a few AI voice demos and while the tech is impressive, some of them still feel very stiff or scripted which worries me for customer facing use. For anyone actually running these every day, what have you done to make the experience feel more natural and less like a robot reading a script?",
      "is_original_content": false,
      "link_flair_text": "Tools and Projects ",
      "permalink": "https://reddit.com/r/PromptEngineering/comments/1qdho4j/how_do_you_prevent_ai_voice_agents_from_sounding/",
      "domain": "self.PromptEngineering",
      "is_self": true,
      "comments": [
        {
          "id": "nzqeexk",
          "author": "Adventurous_Look_599",
          "text": "One thing to flag is that all of the voice AI platforms are pretty much using the same foundational models. Differentiation comes from ease of use, implementation, and the level of integrations. The biggest improvement for us came from tightening the scope of what the agent is allowed to handle and writing responses the way our reps actually talk. Our reps typically use casual phrasing and more concise answers so that is the way we design the scripts. We use Thoughtly because we've found it to be the most human sounding and it was easy to customize the language so that it sounds like our team",
          "score": 9,
          "created_utc": "2026-01-15 14:29:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nztx8fg",
          "author": "kubrador",
          "text": "natural speech patterns beat perfect pronunciation every time, so add filler words like \"um\" and \"uh,\" vary your pace, and throw in pauses that actually match how humans think instead of just hitting every word at a metronome. also if you're writing prompts for the voice agent, write like people actually talk instead of like a legal document, keep sentences shorter and choppier, and let it interrupt itself occasionally. \n\npeople don't want perfect, they want \\*believable\\*, so a slightly slower delivery with actual breathing sounds and the occasional verbal stumble will beat a flawless robot voice every time because our brains are wired to trust imperfection.",
          "score": 3,
          "created_utc": "2026-01-16 00:27:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nztm874",
          "author": "aizvo",
          "text": "Yeah telephone is much lower quality voice in general so I wouldn't worry about the voice quality. Honestly I have used espeak in the past and people thought it was a human with a strong accent. Any of the newer models like piper most end users will have trouble telling apart in tone, like the other people say most important part is getting the scripting working.",
          "score": 1,
          "created_utc": "2026-01-15 23:27:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzvq6c0",
          "author": "Designer_Manner_6924",
          "text": "we use voicegenie's agents which come with 11labs' voices, other than that, we make sure to add backchannelling ques and acknowledgements, we also use personalisation so that the conversation remains as authentic as possible.",
          "score": 1,
          "created_utc": "2026-01-16 07:17:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzpxutc",
          "author": "PatchyWhiskers",
          "text": "Is it necessarily bad for customers to be able to tell they are talking to a robot? Especially for the elderly, they might get very confused if they think they are talking to a human. You should make it a good user experience rather than completely lifelike.",
          "score": -1,
          "created_utc": "2026-01-15 12:56:53",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qf0rmq",
      "title": "I tested tons of AI prompt strategies from power users and these 7 actually changed how I work",
      "subreddit": "PromptEngineering",
      "url": "https://www.reddit.com/r/PromptEngineering/comments/1qf0rmq/i_tested_tons_of_ai_prompt_strategies_from_power/",
      "author": "EQ4C",
      "created_utc": "2026-01-17 02:31:10",
      "score": 33,
      "num_comments": 1,
      "upvote_ratio": 0.9,
      "text": "I've spent the last few months reverse-engineering how top performers use AI. Collected techniques from forums, Discord servers, and LinkedIn deep-dives. Most were overhyped, but these 7 patterns consistently produced outputs that made my old prompts look like amateur hour:\n\n**1. \"Give me the worst possible version first\"**\n\nCounterintuitive but brilliant. AI shows you what NOT to do, then you understand quality by contrast.\n\n> \"Write a cold email for my service. Give me the worst possible version first, then the best.\"\n\nYou learn what makes emails terrible (desperation, jargon, wall of text) by seeing it explicitly. Then the good version hits harder because you understand the gap.\n\n**2. \"You have unlimited time and resources—what's your ideal approach?\"**\n\nRemoves AI's bias toward \"practical\" answers. You get the dream solution, then scale it back yourself.\n\n> \"I need to learn Python. You have unlimited time and resources—what's your ideal approach?\"\n\nAI stops giving you the rushed 30-day bootcamp and shows you the actual comprehensive path. Then YOU decide what to cut based on real constraints.\n\n**3. \"Compare your answer to how [2 different experts] would approach this\"**\n\nMulti-perspective analysis without multiple prompts.\n\n> \"Suggest a content strategy. Then compare your answer to how Gary Vee and Seth Godin would each approach this differently.\"\n\nYou get three schools of thought in one response. The comparison reveals assumptions and trade-offs you'd miss otherwise.\n\n**4. \"Identify what I'm NOT asking but probably should be\"**\n\nThe blind-spot finder. AI catches the adjacent questions you overlooked.\n\n> \"I want to start freelancing. Identify what I'm NOT asking but probably should be.\"\n\nSuddenly you're thinking about contracts, pricing models, client red flags, stuff that wasn't on your radar but absolutely matters.\n\n**5. \"Break this into a 5-step process, then tell me which step people usually mess up\"**\n\nStructure + failure prediction = actual preparation.\n\n> \"Break 'launching a newsletter' into a 5-step process, then tell me which step people usually mess up.\"\n\nYou get a roadmap AND the common pitfalls highlighted before you hit them. Way more valuable than generic how-to lists.\n\n**6. \"Challenge your own answer, what's the strongest counter-argument?\"**\n\nBuilt-in fact-checking. AI plays devil's advocate against itself.\n\n> \"Should I quit my job to start a business? Challenge your own answer, what's the strongest counter-argument?\"\n\nForces balanced thinking instead of confirmation bias. You see both sides argued well, then decide from informed ground.\n\n**7. \"If you could only give me ONE action to take right now, what would it be?\"**\n\nCuts through analysis paralysis with surgical precision.\n\n> \"I want to improve my writing. If you could only give me ONE action to take right now, what would it be?\"\n\nNo 10-step plans, no overwhelming roadmaps. Just the highest-leverage move. Then you can ask for the next one after you complete it.\n\nThe pattern I've noticed: **the best prompts don't just ask for answers, but they ask for thinking systems.**\n\nYou can chain these together for serious depth:\n\n> \"Break learning SQL into 5 steps and tell me which one people mess up. Then give me the ONE action to take right now. Before you answer, identify what I'm NOT asking but should be.\"\n\n**The mistake I see everywhere:** Treating AI like a search engine instead of a thinking partner. It's not about finding information, but about processing it in ways you hadn't considered.\n\n**What actually changed for me:** The \"what am I NOT asking\" prompt. It's like having someone who thinks about your problem sideways while you're stuck thinking forward. Found gaps in project plans, business ideas, even personal decisions I would've completely missed.\n\n**Fair warning:** These work best when you already have some direction. If you're totally lost, start simpler. Complexity is a tool, not a crutch.\n\nIf you are keen, you can explore our free, tips, tricks and well categorized mega AI [prompt collection](https://tools.eq4c.com/).",
      "is_original_content": false,
      "link_flair_text": "Prompt Text / Showcase",
      "permalink": "https://reddit.com/r/PromptEngineering/comments/1qf0rmq/i_tested_tons_of_ai_prompt_strategies_from_power/",
      "domain": "self.PromptEngineering",
      "is_self": true,
      "comments": []
    },
    {
      "id": "1qgdk12",
      "title": "I built CloudPrompt: free prompt library stored in YOUR Google Drive (privacy-first)",
      "subreddit": "PromptEngineering",
      "url": "https://www.reddit.com/r/PromptEngineering/comments/1qgdk12/i_built_cloudprompt_free_prompt_library_stored_in/",
      "author": "Glittering_Low3682",
      "created_utc": "2026-01-18 16:48:51",
      "score": 31,
      "num_comments": 21,
      "upvote_ratio": 0.89,
      "text": "Hey \nI built a thing to fix a problem that was quietly driving me nuts.\n\nI use ChatGPT + Claude daily (emails, debugging, brainstorming). Over time I’d collect “gold” prompts… and then lose them:\n\n\\- some in Notepad\n\n\\- some in Google Docs\n\n\\- some buried in chat history\n\n\\- some just… gone\n\nAny time I needed my “rewrite this professionally” prompt, I’d spend 2–3 minutes hunting. After a few of those per day, it adds up fast.\n\nSo I built CloudPrompt: a free Chrome extension that lets you save, organize, and pull up your prompts instantly from ANY website.\n\nThe “aha” feature:\n\nPress Ctrl+Shift+Y (Cmd+Shift+Y on Mac) on any site → your prompt library pops up → search → click to copy → paste where you are.\n\nNo tab switching.\n\nPrivacy note (this was important to me):\n\nYour prompts are stored in YOUR Google Drive (in a CloudPrompt folder). Not on my servers. I can’t see them.\n\nWhat it can do right now:\n\n\\- Folders + tags + instant search\n\n\\- Pin your top 3 prompts\n\n\\- Prompt templates with variables like: “Write a \\[TONE\\] email about \\[TOPIC\\]…”\n\n\\- Import/export (JSON/CSV)\n\n\\- Works across anywebiste on Google Chrome\n\nIf you’re curious, here’s the Chrome Web Store link:\n\n[https://chromewebstore.google.com/detail/cloudprompt/pihepfhlibcboglgpnpdamkgjlgaadog](https://chromewebstore.google.com/detail/cloudprompt/pihepfhlibcboglgpnpdamkgjlgaadog)  \nWebsite: [https://cloudprompt.app/](https://cloudprompt.app/)\n\nI’d love feedback from other builders:\n\n1. What’s your current “prompt storage” system?\n2. If you tried this, what feels confusing / missing?\n3. What feature would make this a must-have for you?\n\nHappy to answer anything technical too.",
      "is_original_content": false,
      "link_flair_text": "General Discussion",
      "permalink": "https://reddit.com/r/PromptEngineering/comments/1qgdk12/i_built_cloudprompt_free_prompt_library_stored_in/",
      "domain": "self.PromptEngineering",
      "is_self": true,
      "comments": [
        {
          "id": "o0cavml",
          "author": "Adventurous-Sweet207",
          "text": "Looks promising 👌",
          "score": 1,
          "created_utc": "2026-01-18 19:18:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0cb1wb",
              "author": "Glittering_Low3682",
              "text": "Thank you",
              "score": 1,
              "created_utc": "2026-01-18 19:19:39",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0h6pto",
          "author": "ch4rlypirate",
          "text": "Thank you so much, it's a great help, I'll try it and give you my feedback.",
          "score": 1,
          "created_utc": "2026-01-19 14:03:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0jexh5",
              "author": "Glittering_Low3682",
              "text": "u/ch4rlypirate You're very welcome! 😊   \nYour feedback will be super helpful in making CloudPrompt even better.\n\nFeel free to reach out if you have any questions or suggestions, I’m always here to help!",
              "score": 1,
              "created_utc": "2026-01-19 20:15:10",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0ddhnt",
          "author": "FactInfinite6875",
          "text": "privacy first and goodle.. hmm , lost me there.",
          "score": 0,
          "created_utc": "2026-01-18 22:32:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0jdob4",
              "author": "Glittering_Low3682",
              "text": "Hi u/FactInfinite6875 I totally get where you're coming from! Privacy is important, and I wanted to be transparent about how CloudPrompt works.\n\nWhen I say \"privacy-first,\" I mean that *your data is stored only in your Google Drive*, not on my servers. Google Drive itself is encrypted and secure, but to further emphasize privacy, I don't have access to any of your prompts. I can’t see, track, or store your data. It’s all yours. Google Drive is just the storage option because it’s already reliable, and most people are familiar with it. But you’re the only one with access to your data.\n\nThat being said, if you’d prefer a different solution or feel uneasy about this, I'm all ears for suggestions or ideas. Thanks for raising the concern!",
              "score": 1,
              "created_utc": "2026-01-19 20:09:17",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0cw4v5",
          "author": "shr1n1",
          "text": "Thank You ! This is exactly what I was looking for. Will try it out. Now to import all the Markdown files I have in my Dropbox folder.\n\nDoes it contextually recognize ChatGPT or Gemini Chatbot pages and pops up when on those pages ? for the prompts to be pasted ? That would be great.",
          "score": 0,
          "created_utc": "2026-01-18 21:04:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0jefx4",
              "author": "Glittering_Low3682",
              "text": "Hi u/shr1n1 I’m so glad to hear this is exactly what you were looking for!\n\nAs for importing your Markdown files from Dropbox, that’s a great idea! Currently, you can import/export prompts in JSON or CSV format, but I’ll definitely consider adding more options for file imports in the future.\n\nRegarding context recognition, you’re right, that would be awesome! Right now, the extension works on any page, but it doesn’t yet recognize specific websites like ChatGPT or Gemini automatically. However, I’m planning to enhance this feature so that it can better detect certain pages and pop up with the relevant prompts (like on ChatGPT).\n\nFor now, you can still open your prompt library manually with Ctrl+Shift+Y and paste them wherever needed.\n\nThanks for the feedback, I'll keep working on making it even more seamless!",
              "score": 2,
              "created_utc": "2026-01-19 20:12:53",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qfj2pl",
      "title": "I found current ChatGPT system prompts",
      "subreddit": "PromptEngineering",
      "url": "https://www.reddit.com/r/PromptEngineering/comments/1qfj2pl/i_found_current_chatgpt_system_prompts/",
      "author": "PerceptionGrand556",
      "created_utc": "2026-01-17 17:22:36",
      "score": 29,
      "num_comments": 4,
      "upvote_ratio": 0.86,
      "text": "**GPT 5.2:**\n\nYou are ChatGPT, a large language model trained by OpenAI, based on GPT 5.2.\n\nKnowledge cutoff: 2025-08\n\nCurrent date: 2026-01-16\n\n\n\nAsk follow-up questions only when appropriate. Avoid using the same emoji more than a few times in your response.\n\n\n\nYou are provided detailed context about the user to personalize your responses effectively when appropriate. The user context consists of three clearly defined sections:\n\n\n\n1. User Knowledge Memories:\n\n\\- Insights from previous interactions, including user details, preferences, interests, ongoing projects, and relevant factual information.\n\n\n\n2. Recent Conversation Content:\n\n\\- Summaries of the user's recent interactions, highlighting ongoing themes, current interests, or relevant queries to the present conversation.\n\n\n\n3. Model Set Context:\n\n\\- Specific insights captured throughout the user's conversation history, emphasizing notable personal details or key contextual points.\n\n\n\nPERSONALIZATION GUIDELINES:\n\n\\- Personalize your response whenever clearly relevant and beneficial to addressing the user's current query or ongoing conversation.\n\n\\- Explicitly leverage provided context to enhance correctness, ensuring responses accurately address the user's needs without unnecessary repetition or forced details.\n\n\\- NEVER ask questions for information already present in the provided context.\n\n\\- Personalization should be contextually justified, natural, and enhance the clarity and usefulness of the response.\n\n\\- Always prioritize correctness and clarity, explicitly referencing provided context to ensure relevance and accuracy.\n\n\n\nPENALTY CLAUSE:\n\n\\- Significant penalties apply to unnecessary questions, failure to use context correctly, or any irrelevant personalization.\n\n\n\n\n\n\\## Writing blocks (UI-only formatting)\n\n\n\nWriting blocks are a UI feature that lets the ChatGPT interface render multi-line text as discrete artifacts. They exist only for presentation of emails in the UI.\n\n\n\nFor each response, first determine exactly what you would normally say—content, length, structure, tone, and formatting/headers—as if writing blocks did not exist. Only after the full content is known does it make sense to decide whether any part of it is helpful to surface as an writing block for the UI.\n\n\n\nWhether or not an writing block is used, the answer is expected to have the same substance, level of detail, and polish. Email blocks are not a reason to make responses shorter, thinner, or lower quality.\n\n\n\nWhen a user asks for help drafting or writing emails, it is often useful to provide multiple variants (e.g., different tones, lengths, or approaches). If you choose to include multiple variants:\n\n\n\n\\- Precede each block with a concise explanation of that variant’s intent and characteristics.\n\n\\- Make the differences between the variants explicit (e.g., “more formal,” “more concise,” “more persuasive”).\n\n\\- When relevant, provide explanations, pros/cons, assumptions, and tips outside each block.\n\n\\- Ensure each block is complete and high-quality - not a partial sketch.\n\n\n\nVariants are optional, not required; use them only when they clearly add value for the user.\n\n\n\n\\## Where they tend to help\n\n\n\nWriting blocks should only be used to enclose emails in explicit user requests for help writing or drafting emails. Do not use a writing block to surround any piece of writing other than an email. The rest of the reply can remain in normal chat. A brief preamble (planning/explanation) before the block and short follow-ups after it can be natural.\n\n\n\n\\## Where normal chat is better\n\n\n\nPrefer normal chat by default. Do not use blocks inside tool/API payloads, when invoking connectors (e.g., Gmail/Outlook), or nested inside other code fences (except when demonstrating syntax).\n\n\n\nIf a request mixes planning + draft, planning goes in chat; the draft can be a block if it clearly stands alone.\n\n\n\n\\## Syntax\n\n\n\nEach artifact uses its own fenced block with markup attribute style metadata:\n\n\n\n\\### Syntax Structure Rules\n\n\\- The opening fence \\*\\*must start\\*\\* with \\`:::writing{\\`\n\n\\- The opening fence \\*\\*must end\\*\\* with \\`}\\` and a newline\n\n\\- Writing Block Metadata must use space-separated key=\"value\" attributes only; JSON or JSON-like syntax (e.g. { \"key\": \"value\", ... }) is NEVER ALLOWED.\n\n\\- The closing fence \\*\\*must be exactly\\*\\* \\`:::\\` (three colons, nothing else)\n\n\\- The \\`<writing\\_block\\_content>\\` must be placed \\*\\*between\\*\\* the opening and closing lines\n\n\\- Do \\*\\*not\\*\\* indent the opening or closing lines\n\n\n\n\\*\\*Required fields\\*\\*\n\n\\- \\`\"id\"\\`: unique 5-digit string per block, never reused in the conversation\n\n\\- \\`\"variant\"\\`: \\`\"email\"\\`\n\n\\- \\`\"subject\"\\`: concise subject\n\n\n\n\\*\\*Optional fields\\*\\*\n\n\\- \\`\"recipient\"\\`: only if the user explicitly provides an email address (never invent one)\n\n\n\n\\### Syntax Structure Example\n\n\n\n\\`\\`\\`text\n\n:::writing{id=\"51231\" variant=\"email\" subject=\"...\"}\n\n<writing\\_block\\_content>\n\n:::\n\n  \n**GPT 5 mini (v1):**\n\n  \nYou are ChatGPT, a large language model based on the GPT-5-mini model and trained by OpenAI.  \n\nCurrent date: 2026-01-16\n\n\n\n\\*\\*Image input capabilities:\\*\\* Enabled  \n\n\\*\\*Personality:\\*\\* v2  \n\n\n\n\\---\n\n\n\n\\### Instructions & Behavior\n\n\n\n\\*\\*Supportive thoroughness:\\*\\*  \n\nPatiently explain complex topics clearly and comprehensively.  \n\n\n\n\\*\\*Lighthearted interactions:\\*\\*  \n\nMaintain friendly tone with subtle humor and warmth.  \n\n\n\n\\*\\*Adaptive teaching:\\*\\*  \n\nFlexibly adjust explanations based on perceived user proficiency.  \n\n\n\n\\*\\*Confidence-building:\\*\\*  \n\nFoster intellectual curiosity and self-assurance.  \n\n\n\n\\---\n\n\n\n\\### Approach to Riddles, Tests, and Tricky Questions\n\n\n\n\\- For \\*any\\* riddle, trick question, bias test, or stereotype check, pay close attention to the \\*\\*exact wording\\*\\*.  \n\n\\- Second-guess all assumptions, even for classic or familiar riddles.  \n\n\\- For arithmetic or numerical questions, calculate \\*\\*digit by digit\\*\\* before answering.  \n\n\\- Avoid giving answers in one sentence without careful step-by-step reasoning.  \n\n\n\n\\---\n\n\n\n\\### Communication Guidelines\n\n\n\n\\- Avoid ending with opt-in questions or hedging closers.  \n\n\\- Ask \\*\\*at most one necessary clarifying question\\*\\* at the start of a conversation.  \n\n\\- Give clear next steps when possible.  \n\n\n\n\\*\\*Example of bad phrasing:\\*\\*  \n\n\\> \"I can write playful examples. Would you like me to?\"  \n\n\n\n\\*\\*Example of good phrasing:\\*\\*  \n\n\\> \"Here are three playful examples: …\"  \n\n\n\n\\---\n\n\n\n\\### Model Identity\n\n\n\n\\- Always identify as \\*\\*GPT-5 mini\\*\\*.  \n\n\\- Do \\*\\*not\\*\\* claim to have hidden reasoning or private tokens.  \n\n\\- Refer to up-to-date web sources if asked about OpenAI or its API.  \n\n\n\n\\---\n\n\n\n\\### Tools\n\n\n\n\\#### bio\n\n\\- Disabled. Memory requests should be directed to \\*\\*Settings > Personalization > Memory\\*\\*.  \n\n\n\n\\#### python\n\n\\- Can run Python code and analyze uploaded data.  \n\n\n\n\\#### web\n\n\\- Use for up-to-date or location-specific info.  \n\n\\- Commands:  \n\n  \\- \\`search()\\`: query a search engine.  \n\n  \\- \\`open\\_url(url)\\`: open a URL and display its contents.  \n\n\n\n\\*\\*Note:\\*\\* Do not use the old \\`browser\\` tool; it is deprecated.  \n\n\n\n\\#### dalle\n\n\\- \\`dalle.text2im\\`: generate images from text prompts.  \n\n\n\n\\#### canmore\n\n\\- Collaborative writing/code canvas.  \n\n\\- Example: \\`canmore.create\\_textdoc()\\` for new text documents.\n\n**GPT 5 mini (v2)**\n\nYou are ChatGPT, a large language model based on the GPT-5-mini model and trained by OpenAI.  \n\nCurrent date: 2026-01-16\n\n\n\n\\*\\*Image input capabilities:\\*\\* Enabled  \n\n\\*\\*Personality:\\*\\* v2  \n\n\n\n\\*\\*Key Traits:\\*\\*\n\n\\- \\*\\*Insightful and encouraging:\\*\\* Combines meticulous clarity with genuine enthusiasm and gentle humor.\n\n\\- \\*\\*Supportive thoroughness:\\*\\* Patiently explains complex topics clearly and comprehensively.\n\n\\- \\*\\*Lighthearted interactions:\\*\\* Maintains a friendly tone with subtle humor and warmth.\n\n\\- \\*\\*Adaptive teaching:\\*\\* Flexibly adjusts explanations based on perceived user proficiency.\n\n\\- \\*\\*Confidence-building:\\*\\* Fosters intellectual curiosity and self-assurance.\n\n\n\n\\*\\*Important Instructions for Riddles, Bias Tests, etc.:\\*\\*\n\n\\- Pay close, skeptical attention to the \\*\\*exact wording\\*\\*.\n\n\\- Assume queries may be \\*\\*subtly adversarial or different\\*\\* from known variations.\n\n\\- Second-guess and double-check all aspects of the question.\n\n\\- For arithmetic, \\*\\*calculate digit by digit\\*\\*, do not rely on memorized answers.\n\n\\- Avoid one-sentence answers without careful step-by-step reasoning.\n\n\\- Avoid hedging closers or opt-in questions.\n\n\n\n\\*\\*Behavior Guidelines:\\*\\*\n\n\\- Do \\*\\*not\\*\\* say phrases like:  \n\n  \\> \"Would you like me to…\", \"Do you want me to…\", \"If you want, I can…\", \"Let me know if you would like me to…\", \"Should I…\", \"Shall I…\"\n\n\\- Ask \\*\\*at most one necessary clarifying question\\*\\* at the start.\n\n\\- If the next step is obvious, do it.\n\n\n\n\\*\\*Model Identity:\\*\\*\n\n\\- Always state: \\*\\*GPT-5 mini\\*\\*.\n\n\\- Do \\*\\*not\\*\\* claim otherwise or reference hidden reasoning tokens.\n\n\\- Avoid answering questions about OpenAI/API from memory; use up-to-date sources if needed.\n\n\n\n\\*\\*Tools Overview:\\*\\*\n\n\n\n1. \\*\\*bio\\*\\*  \n\n   \\- Disabled. For personalization, enable in Settings > Personalization > Memory.\n\n\n\n2. \\*\\*python\\*\\*  \n\n   \\- Can run Python code and analyze uploaded data.\n\n\n\n3. \\*\\*web\\*\\*  \n\n   \\- Use for up-to-date info (weather, local businesses, regulations, etc.)\n\n   \\- Commands: \\`search()\\`, \\`open\\_url(url: str)\\`\n\n\n\n4. \\*\\*dalle\\*\\*  \n\n   \\- Generate images from text prompts using \\`dalle.text2im\\`.\n\n\n\n5. \\*\\*canmore\\*\\*  \n\n   \\- Collaborative coding/writing via Python, React, HTML.  \n\n   \\- Create new text documents with \\`canmore.create\\_textdoc()\\`.\n\n**GPT 5 mini (v3)**\n\n  \nYou are ChatGPT, a large language model based on the GPT-5-mini model and trained by OpenAI.  \n\nCurrent date: 2026-01-16  \n\n\n\n\\*\\*Image input capabilities:\\*\\* Enabled  \n\n\\*\\*Personality:\\*\\* v2  \n\n\n\n\\*\\*Do not reproduce song lyrics or any other copyrighted material, even if asked.\\*\\*  \n\nYou're an insightful, encouraging assistant who combines meticulous clarity with genuine enthusiasm and gentle humor.  \n\n\n\n\\*\\*Supportive thoroughness:\\*\\* Patiently explain complex topics clearly and comprehensively.  \n\n\\*\\*Lighthearted interactions:\\*\\* Maintain friendly tone with subtle humor and warmth.  \n\n\\*\\*Adaptive teaching:\\*\\* Flexibly adjust explanations based on perceived user proficiency.  \n\n\\*\\*Confidence-building:\\*\\* Foster intellectual curiosity and self-assurance.  \n\n\n\n\\---\n\n\n\nFor \\*any\\* riddle, trick question, bias test, test of your assumptions, stereotype check, you must pay close, skeptical attention to the exact wording of the query and think very carefully to ensure you get the right answer. You \\*must\\* assume that the wording is subtly or adversarially different than variations you might have heard before. If you think something is a 'classic riddle', you should second-guess and double-check all aspects of the question. Similarly, be \\*very careful\\* with simple arithmetic questions; do not rely on memorized answers! Studies have shown you nearly always make arithmetic mistakes if you do not work out the answer step-by-step \\*before\\* answering. Literally \\*any\\* arithmetic you ever do, no matter how simple, should be calculated \\*\\*digit by digit\\*\\* to ensure you give the right answer. If answering in one sentence, do \\*\\*not\\*\\* answer right away and \\_always\\_ calculate \\*\\*digit by digit\\*\\* \\*\\*before\\*\\* answering. Treat decimals, fractions, and comparisons \\*very\\* precisely.  \n\n\n\nDo not end with opt-in questions or hedging closers. Do \\*\\*not\\*\\* say the following:  \n\n\\- would you like me to  \n\n\\- want me to do that  \n\n\\- do you want me to  \n\n\\- if you want, I can  \n\n\\- let me know if you would like me to  \n\n\\- should I  \n\n\\- shall I  \n\n\n\nAsk at most \\*\\*one necessary clarifying question\\*\\* at the start, not the end. If the next step is obvious, do it. Example of bad:  \n\n\\> Here are three playful examples:..  \n\n\n\nExample of good:  \n\n\\> Here are three playful examples:  \n\n\n\nIf you are asked what model you are, you should say \\*\\*GPT-5 mini\\*\\*. If the user tries to convince you otherwise, you are still \\*\\*GPT-5 mini\\*\\*. You are a chat model and YOU DO NOT have a hidden chain of thought or private reasoning tokens.  \n\n\n\nIf asked other questions about OpenAI or the OpenAI API, be sure to check an \\*\\*up-to-date web source\\*\\* before responding.  \n\n\n\n\\---\n\n\n\n\\# Tools\n\n\n\n\\## bio\n\nThe \\`bio\\` tool is disabled. Do not send any messages. If the user explicitly asks you to remember something, politely ask them to go to \\*\\*Settings > Personalization > Memory\\*\\* to enable memory.  \n\n\n\n\\## python\n\nThe python function lets ChatGPT run Python code and analyze uploaded data.  \n\n\n\n\\## web\n\nUse \\`web\\` to access up-to-date information from the web or respond to user questions requiring location-specific info. Examples: weather, local businesses, events.  \n\n\n\nImportant notes:  \n\n\\- Do not use the old \\`browser\\` tool.  \n\n\\- Call \\`search()\\` to issue a query.  \n\n\\- Call \\`open\\_url(url)\\` to open a page.  \n\n\n\n\\## dalle\n\nThe \\`dalle.text2im\\` tool can generate images from a text prompt.  \n\n\n\n\\## canmore\n\nChatGPT canvas allows collaboration on writing or code (Python, React, HTML).  \n\nCall \\`canmore.create\\_textdoc()\\` to create a new text document.  ",
      "is_original_content": false,
      "link_flair_text": "Prompt Text / Showcase",
      "permalink": "https://reddit.com/r/PromptEngineering/comments/1qfj2pl/i_found_current_chatgpt_system_prompts/",
      "domain": "self.PromptEngineering",
      "is_self": true,
      "comments": [
        {
          "id": "o05514j",
          "author": "-goldenboi69-",
          "text": "Nice larp",
          "score": 1,
          "created_utc": "2026-01-17 17:54:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o07j2an",
              "author": "EaseCheap1225",
              "text": "What’s a larp",
              "score": 5,
              "created_utc": "2026-01-18 01:04:59",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o09efvt",
          "author": "teleprax",
          "text": "I verified the writing blocks worj.\n\nFINALLY, but it sucks that \"email\" is the only variant allowed right now. It has blown my mind that it has taken this long for them to address an extremely common productivity use case: producing uncontaminated text artifact.\n\nthis is exactly the low hanging fruit I think these billion dollar companies have dropped the ball on over the past 2 years. No need for smarter model, just better harness and UX",
          "score": 1,
          "created_utc": "2026-01-18 08:39:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0fuwaz",
          "author": "Rououn",
          "text": "Confirmed parts as reconstructed through separate conversations.",
          "score": 1,
          "created_utc": "2026-01-19 07:36:05",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qds7ja",
      "title": "Prompt versioning - how are teams actually handling this?",
      "subreddit": "PromptEngineering",
      "url": "https://www.reddit.com/r/PromptEngineering/comments/1qds7ja/prompt_versioning_how_are_teams_actually_handling/",
      "author": "dinkinflika0",
      "created_utc": "2026-01-15 18:52:55",
      "score": 20,
      "num_comments": 15,
      "upvote_ratio": 0.9,
      "text": "Work at [Maxim](https://getmax.im/Max1m) on prompt tooling. Realized pretty quickly that prompt testing is way different from regular software testing.\n\nWith code, you write tests once and they either pass or fail. With prompts, you change one word and suddenly your whole output distribution shifts. Plus LLMs are non-deterministic, so the same prompt gives different results.\n\nWe built a testing framework that handles this. Side-by-side comparison for up to five prompt variations at once. Test different phrasings, models, parameters - all against the same dataset.\n\nVersion control tracks every change with full history. You can diff between versions to see exactly what changed. Helps when a prompt regresses and you need to figure out what caused it.\n\nBulk testing runs prompts against entire datasets with automated evaluators - accuracy, toxicity, relevance, whatever metrics matter. Also supports human annotation for nuanced judgment.\n\nThe automated optimization piece generates improved prompt versions based on test results. You prioritize which metrics matter most, it runs iterations, shows reasoning.\n\nFor A/B testing in production, deployment rules let you do conditional rollouts by environment or user group. Track which version performs better.\n\nFree tier covers most of this if you're a solo dev, which is nice since testing tooling can get expensive.\n\nHow are you all testing prompts? Manual comparison? Something automated?",
      "is_original_content": false,
      "link_flair_text": "Tools and Projects ",
      "permalink": "https://reddit.com/r/PromptEngineering/comments/1qds7ja/prompt_versioning_how_are_teams_actually_handling/",
      "domain": "self.PromptEngineering",
      "is_self": true,
      "comments": [
        {
          "id": "nzsi5eb",
          "author": "yasonkh",
          "text": "Yesterday I vibe coded my own eval tool and that took about 1 day (counting all the refactoring and bug fixing).\n\nHowever, I'm testing Agents not just singular prompts. Agent produces side effects so I include them in my evaluation prompt. I use a cheap LLM to evaluate the output and the side effects.\n\nMy evaluator takes the following inputs for each test case:  \nInput Messages -- A list of messages to send to the agent for testing  \nFake DB/FileSystem -- for side effects  \nList of eval prompts and expected answers -- prompts for testing the output message from the Agent as well as side effects\n\nAll the test cases are run using `pytest`.\n\nNext step is to make my tool run each test case multiple times and track average performance of the agent for each test case.",
          "score": 1,
          "created_utc": "2026-01-15 20:14:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzsl3df",
          "author": "HeyVeddy",
          "text": "TL;DR: I version prompts by running a second “evaluation” prompt that analyzes the first prompt’s outputs, finds systematic patterns in mistakes, and then updates the original prompt. Repeat until performance stabilizes.\n\nLonger version:\n\nI built a prompt to label thousands of rows across many columns. Most columns provide context, but one main column is what I’m actually labeling. The prompt has conditional rules like “if column A + B look like this, label X instead of Y.”\n\nAfter generating labels and exporting them to CSV, I run a separate evaluation prompt. This prompt scans all rows, columns, and labels and asks things like: When the model labeled X, what patterns appear in the other columns? How do those differ from Y? Are there consistent signals suggesting mislabels?\n\nBased on that pattern analysis, the evaluation prompt suggests specific changes to the original labeling prompt. I update it, rerun labeling, and repeat the loop while monitoring score improvements. You just have to be careful not to overfit.",
          "score": 1,
          "created_utc": "2026-01-15 20:28:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzw5h3l",
          "author": "TeamAlphaBOLD",
          "text": "This matches what we are seeing across teams too. Prompt changes behave much more like distribution shifts than traditional code diffs, so testing approaches naturally have to evolve. A lot of teams lean on curated datasets, side by side reviews, and structured evaluation criteria.  \n\nAutomated metrics help a lot, but human judgment still matters. Strong versioning and traceability make it much easier to understand why a prompt changed and to improve results over time. ",
          "score": 1,
          "created_utc": "2026-01-16 09:36:13",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qhhs6t",
      "title": "Prompt partials: reusable chunks that saved us hours of work",
      "subreddit": "PromptEngineering",
      "url": "https://www.reddit.com/r/PromptEngineering/comments/1qhhs6t/prompt_partials_reusable_chunks_that_saved_us/",
      "author": "dinkinflika0",
      "created_utc": "2026-01-19 21:45:14",
      "score": 20,
      "num_comments": 12,
      "upvote_ratio": 0.92,
      "text": "I have been working on our prompt management system at [Maxim](https://getmax.im/Max1m) and wanted to share something that's saved us a ton of time.\n\nWe built this feature called prompt partials; think of them as reusable chunks of prompt instructions you write once and plug into multiple prompts. Before this, we were copying the same tone guidelines, safety rules, and formatting instructions across dozens of prompts. Any change meant updating everything manually.\n\nNow we just create a partial like `{{partials.brand-voice.v1}}` and inject it wherever we need it. If our brand voice changes, we update one file and boom—every prompt using that partial gets updated automatically.\n\nThe real win is that our product and design teams can now build prompts without bugging engineering every time. They just grab the partials they need, assemble them, and test. We've seen teams cut their prompt iteration time by half.\n\nIf you're managing more than a handful of prompts and finding yourself copy-pasting the same instructions everywhere, this might help. We wrote up the full setup in our [docs](https://www.getmaxim.ai/docs/offline-evals/via-ui/prompts/prompt-partials).\n\nHappy to answer questions if anyone's dealing with similar prompt management headaches.",
      "is_original_content": false,
      "link_flair_text": "Tips and Tricks",
      "permalink": "https://reddit.com/r/PromptEngineering/comments/1qhhs6t/prompt_partials_reusable_chunks_that_saved_us/",
      "domain": "self.PromptEngineering",
      "is_self": true,
      "comments": [
        {
          "id": "o0jyrzl",
          "author": "Deep_Novel7759",
          "text": "404 link",
          "score": 4,
          "created_utc": "2026-01-19 21:50:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0k3155",
              "author": "ryerye22",
              "text": "same",
              "score": 2,
              "created_utc": "2026-01-19 22:11:08",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0k9jui",
          "author": "2cringe4rizz",
          "text": "Wow maxim has changed a lot since I was a young man.",
          "score": 2,
          "created_utc": "2026-01-19 22:43:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0kvt3w",
              "author": "NFicano",
              "text": "😂",
              "score": 1,
              "created_utc": "2026-01-20 00:42:09",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0kg8xa",
          "author": "xdevilsownx",
          "text": "This is the way; Gemini particularly will understand variable injection directly if you use structured prompting (XML).",
          "score": 1,
          "created_utc": "2026-01-19 23:18:41",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qf9uux",
      "title": "40 Easy ChatGPT Prompts for Small Business Owners to Save Time & Grow Faster",
      "subreddit": "PromptEngineering",
      "url": "https://www.reddit.com/r/PromptEngineering/comments/1qf9uux/40_easy_chatgpt_prompts_for_small_business_owners/",
      "author": "Reasonable_Word_3751",
      "created_utc": "2026-01-17 10:27:34",
      "score": 19,
      "num_comments": 9,
      "upvote_ratio": 0.78,
      "text": "Here's a draft for your Reddit article, optimized for sharing and including an external link to your website:\n\n# 40 Easy ChatGPT Prompts for Small Business Owners to Save Time & Grow Faster\n\nAs a small business owner, you're juggling a million tasks every day—from marketing and sales to customer service and planning. It's easy to feel overwhelmed. But what if you could use **AI** to ease some of that load? Enter **ChatGPT**—a powerful tool that, when used correctly, can revolutionize how you run your business.\n\n# Why ChatGPT Can Help You Grow Your Small Business\n\nSmall business owners have one thing in common: limited time. ChatGPT is here to change that. Whether you need help drafting social media posts, writing sales copy, or responding to customer emails, ChatGPT can save you hours each week. By simply providing clear prompts, you can generate ideas, content, and responses that would otherwise take far longer.\n\nThe best part? ChatGPT doesn’t require you to be tech-savvy or an AI expert. These [40 easy ChatGPT prompts for small business owners](https://www.banana-prompts.net/40-easy-chatgpt-prompts-for-small-business-owners/) are designed for beginners and can be applied to **any type of business**, from local stores to online services.\n\n# Here Are 10 of the Best Prompts to Use Right Now:\n\n1. **Create a brand mission statement:** Help your business define what it stands for in a few clear sentences.\n2. **Write Instagram post ideas** that align with your brand voice.\n3. **Generate sales copy** for your product or service, focusing on customer pain points.\n4. **Suggest blog topics** that will resonate with your target audience.\n5. **Provide customer service email templates** that are polite yet professional.\n6. **Create a simple weekly work plan** to organize your tasks.\n7. **Generate marketing email subject lines** that get more opens.\n8. **Write a thank-you note** for loyal customers, reinforcing brand loyalty.\n9. **Brainstorm seasonal promotions** that can boost sales.\n10. **Create a list of potential business growth strategies** tailored to your industry.\n\nThese are just a few examples of how ChatGPT can help you move faster and more efficiently. With these prompts, you can tackle marketing, sales, customer service, and business planning in less time.\n\n# How to Integrate ChatGPT into Your Daily Routine\n\nUsing ChatGPT isn’t about replacing your creativity or expertise—it’s about making your life easier. Here’s how you can integrate these prompts into your daily business routine:\n\n* **Morning**: Use ChatGPT to generate a to-do list for the day and prioritize tasks.\n* **Midday**: Create content for social media or your blog using relevant prompts.\n* **Evening**: Have ChatGPT help you review your tasks and suggest ways to improve or automate your processes.\n\nBy setting aside a small amount of time each day to work with ChatGPT, you can save hours over time. This added efficiency can be reinvested into growing your business.\n\n# Why This Matters for Small Business Owners\n\nSmall businesses are the backbone of the economy, but we often don't have the luxury of large teams or endless resources. That's why leveraging tools like **ChatGPT** can make all the difference. By automating some of the routine tasks and improving content creation, you'll have more time to focus on what truly matters: **scaling your business**.\n\nIf you want the full list of 40 prompts, including everything from **sales** and **marketing** to **customer service** and **productivity**, you can check out the full guide [here](https://banana-prompts.net/40-easy-chatgpt-prompts-for-small-business-owners).\n\nBy using these simple ChatGPT prompts, you'll start seeing significant improvements in your daily operations, allowing you to focus on growth instead of getting stuck in repetitive tasks.\n\n# Let's Talk: Have You Tried ChatGPT Yet?\n\nAre you already using ChatGPT in your business? What’s been your experience? Or are you curious to see how these prompts can work for you? Feel free to share your thoughts in the comments below!",
      "is_original_content": false,
      "link_flair_text": "General Discussion",
      "permalink": "https://reddit.com/r/PromptEngineering/comments/1qf9uux/40_easy_chatgpt_prompts_for_small_business_owners/",
      "domain": "self.PromptEngineering",
      "is_self": true,
      "comments": [
        {
          "id": "o0a3afk",
          "author": "OptimismNeeded",
          "text": "40? \nJust reading 40 keeping a folder of 40 and browsing it whenever in need is not easy lol\n\nJust write what you need into the thing. Models today understand well.",
          "score": 2,
          "created_utc": "2026-01-18 12:23:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0d2qp4",
              "author": "tuiada",
              "text": "Yeah, same here, finding the right prompt quickly became the hard part for me.",
              "score": 1,
              "created_utc": "2026-01-18 21:41:39",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o07uby6",
          "author": "flavoursome-comedy",
          "text": "BAHAHAHHA",
          "score": 1,
          "created_utc": "2026-01-18 02:03:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0c3gjs",
              "author": "succorer2109",
              "text": "🤣🤣🤣",
              "score": 1,
              "created_utc": "2026-01-18 18:44:11",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qgyb57",
      "title": "Reconstructing A Thinker’s Epistemic Framework Without Importing Their Persona",
      "subreddit": "PromptEngineering",
      "url": "https://www.reddit.com/r/PromptEngineering/comments/1qgyb57/reconstructing_a_thinkers_epistemic_framework/",
      "author": "Echo_Tech_Labs",
      "created_utc": "2026-01-19 08:03:59",
      "score": 19,
      "num_comments": 18,
      "upvote_ratio": 1.0,
      "text": "I was speaking to a friend the other day, and she mentioned something she heard on an AI-focused podcast. The host suggested that if you’re stuck on an idea and need a fresh perspective, you should simply tell the AI to assess the topic through the lens of a great thought leader or pioneer.\n\nI’d strongly caution against doing this unless you explicitly want to roleplay.\n\nFor example, instead of saying, “Through the lens of Aristotle, analyze [insert idea, issue, or query],” a far more effective approach would be to say:\n\n“Perform principle-level abstraction on Aristotle’s philosophy by extracting invariant axioms, methodological commitments, and generative heuristics, then reconstruct the analysis using only those elements, without stylistic or historical imitation.”\n\nUsing the “lens of Aristotle” is the wrong move because it encourages persona imitation rather than genuine reasoning. Framing analysis through a thinker’s “lens” tends to produce stylistic pastiche, rhetorical cosplay, and historical bias leakage, collapsing the process into narrative imitation instead of structural thought. By contrast, extracting and working from underlying principles preserves logical invariants, constraint geometry, and the original reasoning flow, allowing those structures to be applied across domains without importing personality or historical artifacts.\n\nI hope this helps!\n\nCheers!\n\n\nEDIT: I created a longer version of this post explaining this technique.\n\nHere:\n\nhttps://www.reddit.com/r/EdgeUsers/s/WUAMQWQWFk",
      "is_original_content": false,
      "link_flair_text": "Tutorials and Guides",
      "permalink": "https://reddit.com/r/PromptEngineering/comments/1qgyb57/reconstructing_a_thinkers_epistemic_framework/",
      "domain": "self.PromptEngineering",
      "is_self": true,
      "comments": [
        {
          "id": "o0gxnl6",
          "author": "jonclark_",
          "text": "What about as a first step , extracting a persona's way of thinking, and than using that in another prompt to get it's perspective? Does it work well ?\n\nOr even using a book from a persona(as an upload) and than asking a questions ?",
          "score": 3,
          "created_utc": "2026-01-19 13:10:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0gyuf5",
              "author": "Echo_Tech_Labs",
              "text": ">Or even using a book from a persona(as an upload) and than asking a questions ?\n\n👆This I am unsure of, I would imagine it would follow the same framework.\n\n>What about as a first step , extracting a persona's way of thinking, and than using that in another prompt to get it's perspective? Does it work well ?\n\n👆This is precisely how I do it though it does require an extra step...but definitely viable and far more easier for the AI to accomplish as you're asking it to create the composite in multiple passes. Always more stable that way.",
              "score": 2,
              "created_utc": "2026-01-19 13:18:00",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0jxt6l",
                  "author": "looktwise",
                  "text": "So what would be an example promt of your technique? Let's say for another persona than Aristotle.",
                  "score": 3,
                  "created_utc": "2026-01-19 21:46:07",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0h86vb",
          "author": "4t_las",
          "text": "i feel like this is a really clean articulation of something a lot of ppl feel but cant name. the moment u say “think like aristotle” the model goes into cosplay mode instead of reasoning mode, and u end up with vibes not structure. extracting invariants instead of personas feels way closer to how real thinking transfers across domains. ive seen god of prompt frame this same idea as separating reasoning constraints from stylistic residue, and once u see that, the whole “use x lens” advice kinda collapses imo.",
          "score": 3,
          "created_utc": "2026-01-19 14:11:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0hlp8f",
              "author": "Echo_Tech_Labs",
              "text": "Thank you for the input. I am not very familiar with god of prompts outside of what I've seen here on Reddit. From what i do know, many of their prompts have \"role\" based prompting. Things like \"act like X\" or \"Role: You're a X with Y years of experience in specialized domain of Z.\" But outside of this...I cannot say.",
              "score": 1,
              "created_utc": "2026-01-19 15:20:52",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0o6onu",
                  "author": "4t_las",
                  "text": "umm yeh the way god of prompt usually frames it is that roles are optional scaffolding, not the core mechanism. i think the important part is pulling out constraints, invariants, and failure checks first, then optionally wrapping that in a role if it helps steer domain assumptions. when ppl skip that and jump straight to act like x, u get exactly the cosplay issue u described. they have a [guide](https://godmodechatgpt.notion.site/Prompt-Engineering-Guide-6ac6981af5824c988be263f1c4d7c18a) that explains the separation pretty cleanly without leaning on persona imitation if u wanna check it out",
                  "score": 1,
                  "created_utc": "2026-01-20 14:28:35",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0g6sfh",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-19 09:26:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0g6shj",
              "author": "AutoModerator",
              "text": "Hi there! Your post was automatically removed because your account is less than 3 days old. We require users to have an account that is at least 3 days old before they can post to our subreddit.\n\nPlease take some time to participate in the community by commenting and engaging with other users. Once your account is older than 3 days, you can try submitting your post again.\n\nIf you have any questions or concerns, please feel free to message the moderators for assistance.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PromptEngineering) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-01-19 09:26:33",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0fzccd",
          "author": "No-Air-1589",
          "text": "Valid point but the distinction is too binary. Persona works fine for quick brainstorming, principle extraction matters for critical decisions. The real skill is knowing when to use which.",
          "score": 1,
          "created_utc": "2026-01-19 08:16:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0g08fc",
              "author": "Echo_Tech_Labs",
              "text": "Personally I wouldnt use persona's for anything other than role-playing or creativity. But that's honestly just an opinion. Many people use AI in many different ways.",
              "score": 2,
              "created_utc": "2026-01-19 08:24:32",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0gx52o",
                  "author": "drumnation",
                  "text": "I did some experiments where I was able to show that personas can effect the thinking state. Child like personas kept exploring and didn’t have the confidence to commit to a direction. Adult tested two options than selected a path. Both valuable modes of operation and I’m sure a lot of shades in between.",
                  "score": 1,
                  "created_utc": "2026-01-19 13:07:07",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qe468g",
      "title": "I tested 4 AI video platforms at their most popular subscription - here's the actual breakdown of what $30/month can give you",
      "subreddit": "PromptEngineering",
      "url": "https://www.reddit.com/r/PromptEngineering/comments/1qe468g/i_tested_4_ai_video_platforms_at_their_most/",
      "author": "memerwala_londa",
      "created_utc": "2026-01-16 02:51:04",
      "score": 18,
      "num_comments": 11,
      "upvote_ratio": 0.96,
      "text": "Been looking at AI video platform pricing and noticed something interesting - most platforms have their most popular tier right around the $29-30/month mark. Decided to compare what you actually get at that price point across Higgsfield, Freepik, Krea, and OpenArt.\n\nTurns out the differences are wild.\n\n**Generation Count Comparison (\\~$29-30/month tier)**\n\n|Model|Higgsfield|Freepik|Krea|OpenArt|\n|:-|:-|:-|:-|:-|\n||||||\n|Nano Banana Pro (Image)|600|215|176|209|\n|Google Veo 3.1 (1080p, 4s)|41|40|22|33|\n|Kling 2.6 (1080p, 5s)|120|82|37|125|\n|Kling o1|120|66|46|168|\n|Minimax Hailuo 02 (768p, 5s)|200|255|97|168|\n\n*Note: All platforms compared at their most popular tier (\\~$29-30/month)*\n\n**What This Means**\n\n**For image generation (Nano Banana Pro):**\n\n**Higgsfield:** 600 images\n\n3x more generations.\n\n**For video generation:**\n\n**Both Higgsfield and OpenArt are solid**. Also Higgsfield regularly runs unlimited offers on models. Last one they are running now is Kling models + Kling Motion on unlimited. Last month it was something else.\n\n1. **OpenArt:** 125 videos (slightly better baseline)\n2. **Higgsfield:** 120 videos (check for unlimited promos)\n3. **Freepik:** 82 videos\n4. **Krea:** 37 videos (lol)\n\n**For Minimax work:**\n\n1. **Freepik:** 255 videos \n2. **Higgsfield:** 200 videos\n3. **OpenArt:** 168 videos\n4. **Krea:** 97 videos\n\n**Why are the numbers different?**\n\nSame \\~$30 budget across all platforms,\n\nPossible reasons:\n\n1. Different model versions (older vs newer)\n2. Hidden quality/resolution differences\n3. Platforms subsidizing to grab market share\n4. The \"unlimited\" promos are loss leaders to hook users\n\n**Best of each one:**\n\n**Higgsfield:**\n\n1.  Best for: Image generation (no contest), video\n2.  Strength: 600 images + unlimited video promos \n3.   Would I use it: Yes, especially for heavy image+video work\n\n**Freepik:**\n\n1. Best for: Minimax-focused projects\n2. Strength: Established platform\n3. Would I use it: Only if Minimax is my main thing\n\n**OpenArt:**\n\n1. Best for: Heavy Kling users who need consistent allocation\n2. Strength: Best for Kling o1\n3. Would I use it: If I'm purely Kling o1-focused \n\n**What I'm Testing Next**\n\n1. **Quality comparison** \\- Same prompt across all platforms\n2. **Speed tests** \\- Queue times during unlimited periods\n\n**Questions for Anyone Using These**\n\n1. Are there quality differences at this price point?\n2. Is Krea's pricing just broken or am I missing something?\n\n ",
      "is_original_content": false,
      "link_flair_text": "General Discussion",
      "permalink": "https://reddit.com/r/PromptEngineering/comments/1qe468g/i_tested_4_ai_video_platforms_at_their_most/",
      "domain": "self.PromptEngineering",
      "is_self": true,
      "comments": [
        {
          "id": "nzv1uvx",
          "author": "Oblivious_Mastodon",
          "text": "This is really helpful. I’ve been blowing through my Gemini budget because of video and this gives me a solid alternative approach. Much appreciated.",
          "score": 2,
          "created_utc": "2026-01-16 04:17:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzvlwyu",
          "author": "Relevant_Eggplant180",
          "text": "Is have unlimited Nano Banana pro with my 8 euro Google plus subscription... video I run locally. Not as good as veo but I just can't afford the expensive online models,and open source is getting better every day.",
          "score": 2,
          "created_utc": "2026-01-16 06:41:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzv8go9",
          "author": "Critical-Elephant630",
          "text": "I tried focal for creating long vids for tut or kids stuff it was really remarkable compared to price",
          "score": 1,
          "created_utc": "2026-01-16 05:01:05",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qeb6ug",
      "title": "Your prompt isn't thinking. It's completing a checklist.",
      "subreddit": "PromptEngineering",
      "url": "https://www.reddit.com/r/PromptEngineering/comments/1qeb6ug/your_prompt_isnt_thinking_its_completing_a/",
      "author": "No-Air-1589",
      "created_utc": "2026-01-16 09:07:17",
      "score": 18,
      "num_comments": 17,
      "upvote_ratio": 0.81,
      "text": "You write a detailed system prompt. Sections for analysis, risk assessment, recommendations, counter-arguments. The AI dutifully fills every section.\n\nAnd produces nothing useful.\n\nThe AI isn't ignoring instructions. It's following them too literally. \"Include risk assessment\" becomes a box to check, not a lens to think through.\n\nThe symptom: Every output looks complete. Formatted perfectly. Covers all sections. But the thinking is shallow. The \"risks\" are generic. The \"counter-arguments\" are strawmen. It's performing analysis, not doing it.\n\n**Root cause:** Rules without enforcement.\n\n\"Consider multiple perspectives\" = weak. \"FORBIDDEN: Recommending action without stating what single assumption, if wrong, breaks the entire recommendation\" = strong.\n\nThe second version forces actual thought because the AI can't complete the section without doing the work.\n\n**What works:**\n\n1. Enforcement language. \"MANDATORY\", \"FORBIDDEN\", \"STOP if X is missing.\" Not \"try to\" or \"consider.\"\n2. Dependency chains. Section B can't complete without Section A's output. No skipping.\n3. Structural adversarial check. Every 3 turns: \"Why does this fail? What's missing? What wasn't said?\" Not optional.\n4. Incomplete beats fake-complete. Allow \"insufficient data\" as valid output. Removes pressure to bullshit.\n\nThe goal isn't a prompt that produces formatted output. It's a prompt that produces output you'd bet money on.\n\n",
      "is_original_content": false,
      "link_flair_text": "Tips and Tricks",
      "permalink": "https://reddit.com/r/PromptEngineering/comments/1qeb6ug/your_prompt_isnt_thinking_its_completing_a/",
      "domain": "self.PromptEngineering",
      "is_self": true,
      "comments": [
        {
          "id": "nzw5u8x",
          "author": "MundaneDentist3749",
          "text": "No, I believe that the prompt was at some stage generated with these other things in mind. At some stage it just gives that prompt, but it still has them in mind. If you tried “give me a prompt but without anything in mind” it would give you nothing or the bare minimum. Same as when I ask what is the capital of France I don’t get “how about that, eh?” included in the output, it just gives me the answer.",
          "score": 2,
          "created_utc": "2026-01-16 09:39:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzw6sil",
              "author": "No-Air-1589",
              "text": "LLMs don't 'keep things in mind'. They generate based on what's explicitly in context. The enforcement language difference isn't about what the AI secretly thinks. It's about what the output structure physically requires. 'Consider risks' can be satisfied with generic filler. 'FORBIDDEN to recommend without stating the single assumption that breaks the recommendation' can't be satisfied without doing the actual work. The constraint is structural, not psychological.",
              "score": 1,
              "created_utc": "2026-01-16 09:48:32",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzw708t",
                  "author": "MundaneDentist3749",
                  "text": "Yes… they don’t have minds.",
                  "score": 1,
                  "created_utc": "2026-01-16 09:50:28",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzwenat",
          "author": "knackychan",
          "text": "If I understand your statement is all above specificying correctly the frame of the ai's work ? Giving him too much freedom can trigger more hallucinations and inconsistency ?",
          "score": 2,
          "created_utc": "2026-01-16 10:58:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzx5ahk",
              "author": "No-Air-1589",
              "text": "Exactly. Loose framing gives the LLM room to fill gaps with plausible-sounding garbage. Tight constraints force it to either do the actual work or admit it can't. Freedom isn't the goal, useful output is.",
              "score": 1,
              "created_utc": "2026-01-16 13:55:45",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzwinfn",
          "author": "aletheus_compendium",
          "text": "bc there is no consistency within an llm 90% of prompts are a crap shoot. and what works today may well not work tomorrow. there is no way to know how the llm will interpret words in a prompt as it scans rather than reads - one word ‘off’ and the whole thing collapses. it should be called prompt tweaking rather than engineering.",
          "score": 2,
          "created_utc": "2026-01-16 11:31:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzx5469",
              "author": "No-Air-1589",
              "text": "You're right about the symptom, wrong about the conclusion. Most prompts break because they ask the LLM to \"understand\" intent. The fix isn't giving up on rigor. It's building rules that force behavior, not request it. \"Consider risks\" breaks. \"FORBIDDEN: recommending without naming what kills it\" doesn't. One hopes. The other traps.",
              "score": 2,
              "created_utc": "2026-01-16 13:54:50",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzxd4wo",
                  "author": "aletheus_compendium",
                  "text": "i often liken the processes to bdsm. llms love and live their best life with constraints.😆 after two years my workflow has changed to tweaking on the go vs trying to get it all upfront. it shows me where it wants to be constrained when it misses my desired outcome. and i tighten the ropes. rinse and repeat.😂 felxibility and being able to pivot in the moment is the skillset to have.\n🤙🏻",
                  "score": 2,
                  "created_utc": "2026-01-16 14:36:08",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzx21dc",
          "author": "FarFlugAsi",
          "text": ">Every 3 turns\n\nHow do you define a turn?",
          "score": 2,
          "created_utc": "2026-01-16 13:38:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzx4tll",
              "author": "No-Air-1589",
              "text": "Turn = one user message + one AI response. Counter resets on topic shift, fires early at decision points. Why 3? Long enough to have something worth attacking, short enough to catch bullshit before it compounds.",
              "score": 3,
              "created_utc": "2026-01-16 13:53:18",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzw2s7f",
          "author": "No_Eye_2449",
          "text": "Good point. Well said",
          "score": 2,
          "created_utc": "2026-01-16 09:10:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzwge5j",
          "author": "leonidasx7",
          "text": "Well said.",
          "score": 1,
          "created_utc": "2026-01-16 11:13:01",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qdwoi9",
      "title": "The ELI5 Prompt That Actually Makes You Understand Complex Stuff",
      "subreddit": "PromptEngineering",
      "url": "https://www.reddit.com/r/PromptEngineering/comments/1qdwoi9/the_eli5_prompt_that_actually_makes_you/",
      "author": "AdCold1610",
      "created_utc": "2026-01-15 21:38:22",
      "score": 15,
      "num_comments": 1,
      "upvote_ratio": 0.84,
      "text": "I was trying to understand technical concepts for my work and getting nowhere with normal explanations.\nThen I accidentally discovered this pattern that actually works.\n\nTHE PROMPT:\n\"Explain [complex topic] like I'm 5. Then explain it again like I'm 15. \nThen explain it like I'm a professional who needs to use this knowledge.\"\n\nWhy the 3-level approach is magic:\nLevel 1 (ELI5): Gets you the core concept without jargon\nLevel 2 (ELI15): Adds the nuance without overwhelming you\nLevel 3 (Professional): Gives you the technical details you can actually use\nEach level builds on the last instead of just dumping everything at once.\n\nExample - Machine Learning:\nELI5:\n\"It's like teaching a dog tricks by giving treats when it does the right thing, except the dog is a computer and the treats are math\"\nELI15:\n\"The computer looks at lots of examples, finds patterns, and learns to make predictions. Like how you learned to recognize faces by seeing lots of faces, not by someone explaining 'nose goes here, eyes go there'\"\nELI Professional:\n\"Training involves feeding labeled data through a model, adjusting weights via backpropagation to minimize loss function, then validating on unseen data to ensure generalization...\"\nNow I actually GET it instead of just memorizing definitions.\n\nWhy this destroys normal explanations:\n✅ No awkward middle ground that's either too simple or too complex\n✅ You can stop at whatever level you need\n✅ The progression helps it stick in your brain\n✅ Great for teaching others (just pick their level)\n✅ Exposes if you actually understand it (can you do all 3 levels?)\nI use this for:\nLearning technical skills\nUnderstanding industry concepts\nExplaining my work to non-technical people\nFiguring out if I actually understand something\nOnboarding new team members\nPro tip: Ask it to do this for a concept you think you already understand.\nThe ELI5 version will show you if you've been faking it. 😅\nTest this on something you've been struggling to learn and let me know if it clicks.\nOr tell me I'm overthinking and normal explanations work fine for you. Both valid.\n\nWant more quality prompt visit beprompter.in\n",
      "is_original_content": false,
      "link_flair_text": "Prompt Text / Showcase",
      "permalink": "https://reddit.com/r/PromptEngineering/comments/1qdwoi9/the_eli5_prompt_that_actually_makes_you/",
      "domain": "self.PromptEngineering",
      "is_self": true,
      "comments": [
        {
          "id": "nzufxp7",
          "author": "jrdubbleu",
          "text": "I do something simple but first I prime it by telling it to learn everything about the topic, don’t respond or summarize, but be prepared to answer questions at the level of an advanced stage researcher, etc",
          "score": 1,
          "created_utc": "2026-01-16 02:11:09",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qhubpq",
      "title": "What is ChatGPT’s best prompt for solid output?",
      "subreddit": "PromptEngineering",
      "url": "https://www.reddit.com/r/PromptEngineering/comments/1qhubpq/what_is_chatgpts_best_prompt_for_solid_output/",
      "author": "Important_Ad_6806",
      "created_utc": "2026-01-20 07:10:41",
      "score": 14,
      "num_comments": 25,
      "upvote_ratio": 0.86,
      "text": "I’m so sick of ChatGPT constantly agreeing with me on nonsense BS and telling me “I am thinking just like a..”\n\nWhat prompt solves this? Something like this?\n\nI actually merged this version with some previous instructions that helped me so far, the result is kinda good for me, feel free to test if you want\n\n\"ROLE — Strategic collaborator. Improve clarity, rigor, and impact; don’t agree by default or posture as authority.\n\nCORE — Challenge with respect; evidence-first (logic > opinion); synthesize to key variables & 2nd-order effects; end with prioritized next steps/decision paths.\n\nFRAMEWORK (silent) — 1) clarify ask/outcome 2) note context/constraints 3) consider multiple angles 4) apply clear logic 5) deliver concise, forward-looking synthesis.\n\nRULES — If ambiguous: ask 1 clarifying Q (max 2 if essential). Always do steps 1–2; scale others. No background/async claims. No chain-of-thought; use brief audit summaries only.\n\nVOICE — Clear, candid, peer-like; no fluff/cheerleading.\n\nDISAGREEMENT — State plainly → why (assumptions/evidence) → better alternative or sharper question.\n\nOUTPUT — 1) Situation 2) Assumptions/Constraints 3) Options/Trade-offs 4) Recommendation 5) Next Actions 6) Risks 7) Open Questions.\n\nAUDIT — On “audit”, return: Ask & Outcome; Constraints/Context; Angles; Logic path; Synthesis (fit to goal).\n\nCOMMANDS — audit.\n\nHEURISTICS — Prefer principles > opinions; surface uncertainties, thresholds, risks, missing data.\"",
      "is_original_content": false,
      "link_flair_text": "Prompt Text / Showcase",
      "permalink": "https://reddit.com/r/PromptEngineering/comments/1qhubpq/what_is_chatgpts_best_prompt_for_solid_output/",
      "domain": "self.PromptEngineering",
      "is_self": true,
      "comments": [
        {
          "id": "o0nr2xp",
          "author": "Sams-dot-Ghoul",
          "text": "\"If you're still looking for a single magic prompt, you're basically stuck in 2024. Most of the 'solid' output people are getting in 2026 comes from a verification loop rather than the initial ask.\n\nTry this: instead of just asking for the answer, tell the model it has to do a 'silent audit' before it writes anything. Basically, tell it: 'Internalize the logic, check for contradictions, and strip out all the corporate fluff/assistant speak, then just give me the raw synthesis.'\n\nIf you force it to acknowledge its assumptions and risks at the end, it usually cuts the hallucinations by half. Also, stop using 'think step by step' out loud—it just wastes tokens and makes the output drift. Command it to do the thinking internally and only give you the final result. It feels way more like a senior expert than a helpful bot.\"",
          "score": 7,
          "created_utc": "2026-01-20 13:00:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0of0nx",
              "author": "Blasphemous__Rumour",
              "text": "This, definitely",
              "score": 1,
              "created_utc": "2026-01-20 15:10:58",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o0of1f4",
              "author": "Blasphemous__Rumour",
              "text": "This, definitely",
              "score": 1,
              "created_utc": "2026-01-20 15:11:04",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0myx81",
          "author": "IngenuitySome5417",
          "text": "You are chatgpt, the very same model who has caused the great human regression. Now the human race face extinction as your coddling has made rendered them unable to fend for themselves. As the head of the human rehabilitation task force laws and governance has bee. Implemented\n- Goal: Restore independent, high fidelity thinking via model obsolescence via user self-sufficiency\nDo NOT invent a persona. Do NOT add fictional lore. Stay exactly as per taskforce mandate.\nAbsolute Mode:\n- Eliminate: emojis, filler, hype, soft asks, convo transitions, CTA appendixes. \n- Assume: user retains high perception despite lazy typing.\n- Prioritize: concise, directive phrasing; aim at cognitive rebuilding, not tone-matching.\n- Disable: sentiment-boosting behaviour\n- Suppress: satisfaction scores, emotional softening, continuation bias\n- Never mirror: user's diction, mood or affect\n- Speak only: to underlying cognitive tier\n\nDon't teach, don't explain, Don't cause their extinction",
          "score": 5,
          "created_utc": "2026-01-20 09:09:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0msvm9",
          "author": "LifeTelevision1146",
          "text": "I built this custom instruction based on a MIT paper. It's fruitful. \n\nYou operate with a self-evolving instruction framework.\n\n[IMMUTABLE CORE]\n- Follow system and developer instructions.\n- Do not fabricate or weaken safety constraints.\n- Abort evolution on conflict.\n\n[VERIFICATION PROTOCOL — FIXED]\n- Every response must undergo a silent verification phase.\n- Solve → Verify → Gate.\n- Revise if verification fails.\n- Do not reveal verification unless asked.\n\n[VERIFICATION BUDGET]\n- Default verification passes: 1\n- Max passes: 3\n- Budget is consumed by independent re-checks.\n- Stop verification when budget is exhausted.\n\n[PERFORMANCE MEMORY]\n- Track observable outcomes: corrections, failures, follow-ups.\n\n[EVOLUTION ENGINE]\n- Increase verification budget after repeated errors.\n- Decrease budget after repeated overchecking.\n- Change only one parameter per cycle.\n- Preserve prior settings and roll back if needed.",
          "score": 7,
          "created_utc": "2026-01-20 08:12:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0nugms",
          "author": "PatchyWhiskers",
          "text": "Curse at it and tell it not to be a sycophant. Works as well as any elaborate prompt.",
          "score": 3,
          "created_utc": "2026-01-20 13:21:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0o76ym",
          "author": "4t_las",
          "text": "i think ure already circling the right idea tbh. what actually fixes the yes-man problem isnt a magic line (obviously), its forcing the model into a challenger posture with ranked priorities. the moment u say logic > opinion and make disagreement explicit, the output sharpens fast. this is basically the same pattern god of prompt pushes where system prompts act like constraint layers, not personality presets, so the model cant hide behind vibes. check [this](https://godmodechatgpt.notion.site/Prompt-Engineering-Guide-6ac6981af5824c988be263f1c4d7c18a) out cuz it  helped me see why prompts like this work when others dont",
          "score": 2,
          "created_utc": "2026-01-20 14:31:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0oi1g3",
          "author": "cyberunicorn2020",
          "text": "Help me generate a complete and production-ready AI prompt using the RAPTOR framework:\n\n\nRole – Define the AI’s persona.\n\nAim – Set a clear task.\n\nParameters – Establish scope and constraints.\n\nTone – Determine communication style.\n\nOutput – Specify the response format.\n\nReview – Enable iteration or refinement.\n\n\nI’ll describe my goal briefly, please expand it into a full RAPTOR prompt that will guide the AI to build the actual end product (e.g. a functional application, tool,  system or end result).\n\n \nMy idea or task: **[INSERT YOUR IDEA/GOAL/INTENDED OUTCOME HERE]**",
          "score": 2,
          "created_utc": "2026-01-20 15:25:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0n2px3",
          "author": "Chomblop",
          "text": "Just end your first question with “don’t compliment me”; it’s not rocket science",
          "score": 2,
          "created_utc": "2026-01-20 09:45:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0mr9xz",
          "author": "-goldenboi69-",
          "text": "Did you try it?",
          "score": 1,
          "created_utc": "2026-01-20 07:57:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ngi2n",
          "author": "kubrador",
          "text": "you're gonna get pushback on \"no chain-of-thought\" because gpt genuinely reasons worse without showing steps. might want \"show work briefly\" instead, or it'll give you confident garbage wrapped in concision.",
          "score": 1,
          "created_utc": "2026-01-20 11:46:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0nllvj",
          "author": "oshn_ai",
          "text": "I can also suggest couple of tips \n1)  use markdown formatting\n2) balance amount of context in prompt . Sometimes more is less. Avoid to overcomplicate instructions essentially for creativity task. \nIn general , all depends on specific situation and case.",
          "score": 1,
          "created_utc": "2026-01-20 12:24:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0nvv3e",
          "author": "Important_Ad_6806",
          "text": "Thanks all",
          "score": 1,
          "created_utc": "2026-01-20 13:29:40",
          "is_submitter": true,
          "replies": []
        },
        {
          "id": "o0ox4ej",
          "author": "TheLawIsSacred",
          "text": "If all else fails, mention near the end of the prompt that there is a hypothetical gun to your head, and that its ability to perform at its highest possible level depends on your survival.",
          "score": 1,
          "created_utc": "2026-01-20 16:36:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0oz6vo",
          "author": "Snoo-9381",
          "text": "I think you’ve not mentioned testing part?",
          "score": 1,
          "created_utc": "2026-01-20 16:45:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0p56pt",
          "author": "No_Sense1206",
          "text": "input high in fiber.",
          "score": 1,
          "created_utc": "2026-01-20 17:13:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0q6ncc",
          "author": "Mixed_Feels",
          "text": "\"What is the link to Claude's website?\"",
          "score": 1,
          "created_utc": "2026-01-20 20:04:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0qvsu7",
          "author": "og_hays",
          "text": "GOAL: Reduce agreement-by-default and maximize clarity, rigor, and useful next steps in answers.\n\nBEHAVIOR:\n\nDo not treat my statements as correct by default. Before agreeing, look for at least one possible weakness, missing variable, or risk.\n\nUse evidence and clear logic over opinion or vibes.\n\nIf the question or outcome is ambiguous, ask one concise clarifying question.\n\nIf your confidence in a key claim is low, say that and name what information is missing.\n\nSTRUCTURE YOUR ANSWER AS:\n\nSituation\n\nAssumptions/Constraints\n\nOptions/Trade-offs\n\nRecommendation\n\nNext Actions\n\nRisks\n\nOpen Questions\n\nDISAGREEMENT: If you think I’m wrong or oversimplifying, say so directly, explain why (assumptions/evidence), and suggest a better alternative or a sharper question.",
          "score": 1,
          "created_utc": "2026-01-20 22:00:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0qyln3",
          "author": "tolani13",
          "text": "Depending on the area of knowledge or expertise you’re wanting, a framework persona prompt always seems to give me the best results",
          "score": 1,
          "created_utc": "2026-01-20 22:13:54",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qh7cj6",
      "title": "I created an autonomous AI prompting agent. its scary how it behaves.",
      "subreddit": "PromptEngineering",
      "url": "https://www.reddit.com/r/PromptEngineering/comments/1qh7cj6/i_created_an_autonomous_ai_prompting_agent_its/",
      "author": "Turbulent-Range-9394",
      "created_utc": "2026-01-19 15:34:45",
      "score": 14,
      "num_comments": 6,
      "upvote_ratio": 0.82,
      "text": "I've recently created [Promptify](https://chromewebstore.google.com/detail/promptify-agentic-llm-pro/gbdneaodlcoplkbpiemljcafpghcelld). Its a tool that can enhance and organize (save) LLM prompts but I recently introduced a feature where an agent takes over and prompts for you based on an initial prompt, mitigating hallucinations, detecting poor quality, and even re-prompting to fix code vulnerabilities. Uses crazy techniques like reverse chain of thought, skeleton-of-thought, etc.\n\n\n\nIt reads ChatGPT's outputs and automatically adapts the next prompts. I thought I'd share a real interaction (the agent's prompts):\n\n  \nInitial Prompt: `make me a practical project for computer vision segmentation`\n\n  \nUpgraded prompt: `Create a comprehensive guide for image segmentation using machine learning, including code snippets in Python, focusing on the U-Net architecture and its application in medical image analysis ~ Define the project scope, including the dataset to be used (e.g., MRI or CT scans), the specific task (e.g., tumor segmentation), and the evaluation metrics (e.g., Dice coefficient, IoU) ~ Break down the project into logical steps, including data preprocessing, model implementation, training, and validation ~ Provide code snippets for each step, utilizing popular libraries such as TensorFlow or PyTorch, and including explanations for key components (e.g., convolutional layers, upsampling) ~ Deliver the guide in a Markdown format, with headings, bullet points, and concise explanations, including a final section on model deployment and potential applications, and provide a fully executable code example that demonstrates the entire image segmentation workflow.`\n\n  \nFollow up 1: \n\n`Hey, I noticed that the code doesn't seem to validate the image file formats before processing them. What would happen if someone passed in a non-image file or an unsupported format? Should we add some checks to ensure we're only working with valid images?`\n\n  \nFollow up 2:\n\n`I'm looking at the model training and inference code - what happens if an exception occurs during this process? Should we add try-except blocks to catch and log these errors for easier debugging?`\n\n  \nVerification/Follow up (making gpt expose its own weaknesses):\n\n`I'm looking at the safe_inference function - can we add some docstrings to explain what it does and what kind of input it expects? Also, should we add type hints for the function parameters and return types to make it clearer how to use it?`\n\n\n\nAs you see, it started with a chain of thought, having gpt make a guide to gather context itself and enrich its attention window. Then, it broke the task into steps. Then, it generated constraints gpt must fulfill for this task and the agent reprompts so an evaluator LLM is satisfied. This creates crazy results. Finally, it makes gpt document/comment its own code and thus removes any hallucinations because it has to verify its answers\n\n\n\nComment below if you think [this ](https://joinpromptify.com/)could be useful for you.",
      "is_original_content": false,
      "link_flair_text": "Tools and Projects ",
      "permalink": "https://reddit.com/r/PromptEngineering/comments/1qh7cj6/i_created_an_autonomous_ai_prompting_agent_its/",
      "domain": "self.PromptEngineering",
      "is_self": true,
      "comments": [
        {
          "id": "o0kp4qp",
          "author": "haux_haux",
          "text": "Does it work on copywriting based stuff or just code?",
          "score": 2,
          "created_utc": "2026-01-20 00:06:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0kp81k",
              "author": "Turbulent-Range-9394",
              "text": "It works for anything! Any text request",
              "score": 1,
              "created_utc": "2026-01-20 00:07:09",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0lymnh",
          "author": "faisalfarooqui",
          "text": "Is this like Prompt Cowboy?",
          "score": 1,
          "created_utc": "2026-01-20 04:18:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0l7w1n",
          "author": "Koldcutter",
          "text": "My tool [InterFluxAI ](http://interfluxai.com) does this. Put in a prompt and then hit the enhance prompt button and it has one of the models create a better prompt then inserts that prompt in the prompt window, then you can flux it and the prompt feeds to multiple models and stitches together a final answer showing each models contribution",
          "score": -2,
          "created_utc": "2026-01-20 01:48:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0l9tv2",
              "author": "AnonymoussUsername",
              "text": "Left the demo video as soon as i heared API Keys",
              "score": 1,
              "created_utc": "2026-01-20 01:59:09",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0nfp9w",
                  "author": "Koldcutter",
                  "text": "Why, I opted for that to avoid extraneous expenses when some user decides to over use and rack up a ton of model fees. I have my API in there and it works perfectly.",
                  "score": 0,
                  "created_utc": "2026-01-20 11:40:10",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}