{
  "metadata": {
    "last_updated": "2026-02-16 03:09:30",
    "time_filter": "week",
    "subreddit": "PromptEngineering",
    "total_items": 20,
    "total_comments": 183,
    "file_size_bytes": 240019
  },
  "items": [
    {
      "id": "1r4b2y3",
      "title": "The 5-layer prompt framework that makes ChatGPT output feel like it came from a paid professional",
      "subreddit": "PromptEngineering",
      "url": "https://www.reddit.com/r/PromptEngineering/comments/1r4b2y3/the_5layer_prompt_framework_that_makes_chatgpt/",
      "author": "AdImpossible3465",
      "created_utc": "2026-02-14 04:27:13",
      "score": 348,
      "num_comments": 41,
      "upvote_ratio": 0.9,
      "text": "After months of testing, I realized that 90% of bad ChatGPT outputs come from the same problem: we write prompts like Google searches instead of project briefs.\n\nHere's the framework I developed and use for every single prompt I build:\n\nROLE → CONTEXT → TASK → FORMAT → CONSTRAINTS\n\nLet me break it down with real examples:\n\nLayer 1: ROLE (Who is ChatGPT being?)\n\nDon't just say \"you are an expert.\" Be specific about the expertise level, the industry, and the personality.\n\nBad: \"You are a marketing expert\"\n\nGood: \"You are a direct-response copywriter with 15 years of experience writing for DTC e-commerce brands. You specialize in high-converting email sequences and have studied Eugene Schwartz and David Ogilvy extensively.\"\n\nThe more specific the role, the more specific the output. ChatGPT adjusts its vocabulary, structure, and reasoning based on this layer.\n\nLayer 2: CONTEXT (What's the situation?)\n\nGive background. ChatGPT cannot read your mind. The context layer is where most people lose quality.\n\nExample: \"My client sells a $49 organic skincare serum targeted at women aged 28-42 who are frustrated with products that promise results but use synthetic ingredients. The brand voice is warm, confident, and science-backed   not salesy.\"\n\nLayer 3: TASK (What exactly do you want?)\n\nBe painfully specific about the deliverable.\n\nBad: \"Write some emails\"\n\nGood: \"Write a 5-email welcome sequence. Email 1 is a warm brand introduction. Email 2 addresses the #1 objection (price). Email 3 shares a customer transformation story. Email 4 introduces urgency with a limited-time offer. Email 5 is a final nudge with social proof. Each email should have a subject line, preview text, and body.\"\n\nLayer 4: FORMAT (How should it look?)\n\nTell ChatGPT the exact structure.\n\nExample: \"For each email, use this structure: Subject Line | Preview Text | Opening Hook (1 sentence) | Body (100-150 words) | CTA (one clear call to action). Use short paragraphs   no paragraph longer than 2 sentences.\"\n\nLayer 5: CONSTRAINTS (What should it avoid?)\n\nThis is the secret weapon. Constraints prevent generic output.\n\nExample: \"Do not use the words 'revolutionary', 'game-changing', or 'unlock'. Do not start any email with a question. Do not use exclamation marks more than once per email. Write at an 8th-grade reading level.\"\n\nFull prompt using all 5 layers combined:\n\nYou are a direct-response copywriter with 15 years of experience writing for DTC e-commerce brands. You specialize in high-converting email sequences and have studied Eugene Schwartz and David Ogilvy extensively.\n\nMy client sells a $49 organic skincare serum targeted at women aged 28-42 who are frustrated with products that promise results but use synthetic ingredients. The brand voice is warm, confident, and science-backed   not salesy.\n\nWrite a 5-email welcome sequence. Email 1: warm brand introduction. Email 2: address the #1 objection (price). Email 3: customer transformation story. Email 4: limited-time offer with urgency. Email 5: final nudge with social proof.\n\nFor each email use this structure: Subject Line | Preview Text | Opening Hook (1 sentence) | Body (100-150 words) | CTA (one clear call to action). Use short paragraphs   no paragraph longer than 2 sentences.\n\nDo not use the words \"revolutionary,\" \"game-changing,\" or \"unlock.\" Do not start any email with a question. No more than one exclamation mark per email. Write at an 8th-grade reading level.\n\nThe output you get from this vs. just saying \"write me some emails\" is night and day.\n\nHere are 3 more fully built prompts using this framework:\n\nThe Strategy Audit Prompt:\n\nYou are a startup advisor who has helped 50+ companies go from 0 to $1M ARR. You specialize in digital products and solo-creator businesses. I'm going to describe my current business. Audit my strategy and give me: 1) The 3 biggest risks you see, 2) The #1 thing I should double down on, 3) What I should stop doing immediately, 4) A 30-day action plan with weekly milestones. Be direct and specific   no motivational fluff. If my strategy is bad, say so.\n\nThe Content Angle Generator:\n\nYou are a viral content strategist who has studied the top-performing posts on Twitter, LinkedIn, and Instagram for the last 3 years. My niche is \\[topic]. Generate 10 unique content angles I haven't thought of. For each angle, give me: the hook (first line), the core insight, and why it would perform well. Avoid cliché angles like \"5 tips for...\" or \"here's what nobody tells you.\" I want original, surprising perspectives that make people stop scrolling.\n\nThe Customer Avatar Deep Dive:\n\nYou are a consumer psychologist and market researcher. My product is \\[describe product and price]. Build me a detailed customer avatar that includes: demographics, psychographics (values, fears, aspirations), the exact language they use to describe their problem (not marketer language   real words from real people), where they hang out online, what they've already tried that failed, and the emotional trigger that would make them buy today. Write it as a strategic document, not a generic persona template.\n\nI've been building a full library of prompts using this exact framework across marketing, productivity, business strategy, content creation, and more.\n\nThis framework works. Try it on your next prompt and compare the output to what you were getting before   you'll see the difference immediately.\n\nWhat frameworks do you all use? Curious if anyone approaches it differently.\n",
      "is_original_content": false,
      "link_flair_text": "Tutorials and Guides",
      "permalink": "https://reddit.com/r/PromptEngineering/comments/1r4b2y3/the_5layer_prompt_framework_that_makes_chatgpt/",
      "domain": "self.PromptEngineering",
      "is_self": true,
      "comments": [
        {
          "id": "o5ap3fs",
          "author": "Romanizer",
          "text": "Yes, that's a very reliable framework. I usually drop my ideas into the LLM and ask to build a prompt based on this and the desired outcome and it usually defaults to this structure.",
          "score": 31,
          "created_utc": "2026-02-14 05:48:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5aq1bx",
              "author": "ceeczar",
              "text": "Love this workflow\n\n\nEssentially getting the LLM to do all the heavy lifting \n\n\nPretty smart ",
              "score": 10,
              "created_utc": "2026-02-14 05:56:07",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o5bfsvl",
              "author": "charlieatlas123",
              "text": "I agree with you, and would add that if the prompt is getting too long, ie. using up too many tokens, then ask your LLM to make it more concise. \n\nI regularly ask this and it always shortens the prompt without losing any context.",
              "score": 1,
              "created_utc": "2026-02-14 09:59:40",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o5btxm3",
              "author": "looktwise",
              "text": "example please? after dropping the context content",
              "score": 1,
              "created_utc": "2026-02-14 12:11:38",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5c0ybz",
                  "author": "Romanizer",
                  "text": "For example, I asked it to draft a prompt that would optimize my LinkedIn Profile based on my CV and website and it came up with a comparable structure.",
                  "score": 2,
                  "created_utc": "2026-02-14 13:05:47",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o5bhcng",
              "author": "pacha75",
              "text": "This is the way",
              "score": -2,
              "created_utc": "2026-02-14 10:14:48",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5aq65z",
          "author": "Conscious_Nobody9571",
          "text": "\"Here's a framework i developed\" proceeds to post the prompt format literally everyone is using",
          "score": 41,
          "created_utc": "2026-02-14 05:57:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5b6upi",
              "author": "mir_chan",
              "text": "Let me rephrase it.\n\n*proceeds to post the prompting format that **google** is handing for free in a form of a pdf file about 70 pages long.\n\nEven with descriptions that **google** has on every step. I mean it is a freaking copy paste fromt that doc.",
              "score": 8,
              "created_utc": "2026-02-14 08:31:22",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o5awfgq",
              "author": "mxracer888",
              "text": "Just wait till OP learns about PRDs, especially as they relate to coding projects. Then the framework will include consulting with the LLM to generate a proper PRD that you then feed to Codex or Claude Code and hit the ground running",
              "score": 1,
              "created_utc": "2026-02-14 06:52:42",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5bu22b",
                  "author": "looktwise",
                  "text": "1 What are PRDs 2 What would be your PRD framework or prompt template?",
                  "score": 2,
                  "created_utc": "2026-02-14 12:12:40",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5aflfi",
          "author": "kubrador",
          "text": "this is just \"be specific\" wrapped in five boxes with corporate consulting language sprinkled on top. the whole thing reads like someone discovered that vague prompts produce vague outputs and then wrote a business case study about it.",
          "score": 6,
          "created_utc": "2026-02-14 04:33:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5bg4k6",
          "author": "Ijere",
          "text": "I keep the instruction up top (then context) because the model seems to weight recent/explicit stuff more, so order matters. If you want to nit-pick it: ROLE → TASK → CONSTRAINTS → CONTEXT → FORMAT tends to be the most reliable.",
          "score": 5,
          "created_utc": "2026-02-14 10:02:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5cqj0i",
          "author": "Imprfkt007",
          "text": "Your Layer 5 is doing more work than you realize. What you’re calling ‘constraints’ is actually the most technically interesting part of this framework — you’re modifying the model’s output probability distribution rather than just steering its reasoning.\nThe reason ‘do not use X word’ works so well isn’t just about avoiding clichés. You’re collapsing regions of the token probability space, which forces the model to redistribute attention weight toward less default outputs. That’s why constrained prompts feel more ‘professional’ — you’re literally making the lazy outputs unreachable.\nWhat gets interesting is when you formalize this beyond simple word exclusions. There are at least five distinct constraint types that operate differently on the output space — void regions (what you’re already doing), mutual exclusions (if A then never B), binary verification gates, negation requirements, and representation closure. Layering these creates compound constraint geometry that’s qualitatively different from just stacking more ‘don’t do X’ rules.\nYour framework is solid for creative/marketing work. The question I’d pose to this community: what happens when constraints aren’t preferences but requirements? Finance, healthcare, legal — domains where ‘the model usually respects this’ isn’t acceptable. That’s where constraint architecture becomes a fundamentally different discipline from prompt engineering.",
          "score": 4,
          "created_utc": "2026-02-14 15:37:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5amwi4",
          "author": "ghostintheforum",
          "text": "Thanks for taking the time to write a detailed breakdown of your prompting approach with examples.",
          "score": 5,
          "created_utc": "2026-02-14 05:30:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5au7nw",
          "author": "Acousticfish",
          "text": "Do you all type these out every time you start a new chat?",
          "score": 2,
          "created_utc": "2026-02-14 06:32:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5ax1qn",
              "author": "mxracer888",
              "text": "depends on the project. But usually no. For some stuff you can run a deeper prompt like this and just run it as a custom GPT or a \"project\". Otherwise, I have a \"base-prompt.md\" and \"shutdown.md\" that I use for Claude Code. base-prompt gets the project started, gets the structure set, and has the prompt that points to my PRD. Then shutdown.md has shutdown instructions as far as updating \"to-do.md\", \"readme.md\", \"claude.md\" and other relevant documents and then I close out the sessions. \n\nThis is a good way to not type everything over and over, but also make sure sessions are kept tight and hyper focused. I feel quality degrades significantly the more and more context that gets built. With the addition of memory in claude code some of this is somewhat redundant, however memory is specific to the machine you're on, so doing the shutdown process and updating all documentation makes it much easier to pickup right where I left off when I transfer to desktop and back to laptop and so on. ",
              "score": 3,
              "created_utc": "2026-02-14 06:58:23",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5b8p4f",
          "author": "Tintoverde",
          "text": "How do you prove this is the structure is better any other provided by other posts ?",
          "score": 1,
          "created_utc": "2026-02-14 08:49:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5bhn35",
              "author": "charlieatlas123",
              "text": "Just test it for yourself. A/B split test against your best prompts, so every time you find a prompt that works better, record it and use it until you find one even better.",
              "score": 3,
              "created_utc": "2026-02-14 10:17:39",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5e27dy",
                  "author": "Tintoverde",
                  "text": "So how do you know this idea works ? If you claim this works, I would think if one claims something, one need to provide some proof",
                  "score": 1,
                  "created_utc": "2026-02-14 19:37:44",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5bgr6t",
          "author": "raccoonportfolio",
          "text": "Honestly we should just pin this and archive the sub.",
          "score": 1,
          "created_utc": "2026-02-14 10:08:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5bk2kh",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-14 10:41:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5bk2le",
              "author": "AutoModerator",
              "text": "Hi there! Your post was automatically removed because your account is less than 3 days old. We require users to have an account that is at least 3 days old before they can post to our subreddit.\n\nPlease take some time to participate in the community by commenting and engaging with other users. Once your account is older than 3 days, you can try submitting your post again.\n\nIf you have any questions or concerns, please feel free to message the moderators for assistance.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PromptEngineering) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-14 10:41:31",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5cchny",
          "author": "b4st14nb",
          "text": "Check 'promptCowboy' in the meantime, not paid promotion just what I discovered and works a lot like your workflow",
          "score": 1,
          "created_utc": "2026-02-14 14:19:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5cma4s",
          "author": "YamJealous4799",
          "text": "Depending on what you need, adding information about yourself is helpful as well.  I guess this would go in CONTEXT.  I find that adding things like \"I am a senior software engineer\" or \"I am a high schooler that is just learning about X\" also helps get the kind of output I want.",
          "score": 1,
          "created_utc": "2026-02-14 15:14:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5fi5fj",
          "author": "Protopia",
          "text": "I both agree with this lecture but also disagree. \n\n<rant>\n\nGood output is (and has always been) a consequence of good input, but the users prompt is only part of the input...\n\n1. System prompt - overall guidance on personality and subject\n\n2. Domain input - e.g. the existing code base, RAG.\n\n3. The user's prompt.\n\n4. MCPs and other subject expert sources\n\n5. Rules, workflows and skills\n\n6. The language model itself.\n\n7. History/memory of what has already been done.\n\n8. Context management.\n\nOnly number 3 is written every time, and it doesn't have to be written entirely by the user - AI in planning mode can write a detailed prompt based on a simpler user prompt.\n\nAnd it can do that best when all the other items in the list pre-exist and are quality. \n\nSo you can have rules or workflows that say how a single user requirement should be processed. You can start with a simple prompt and AI can ask questions and enhance the prompt into a more detailed requirement (goal),  specification (what to produce) and plan (how to produce it to the right quality) which the user  needs to approve before AI gets on with the actual coding. And the system prompt, domain and expert knowledge etc. are as important input into the planning as into the production run. \n\nAnd having the AI effectively record what it has already done it tried and having it clear it's context and start again with the knowledged already gained is another important aspect.\n\nAnd IMO, the definition of Prompt Engineering is getting all of the above right not just the user's written prompt.\n\nSo you need to craft the overviews, the roles and workflows, you need to define the process that the AI follows, telling the childlike AI how to break it down into steps, how to record progress and pass results of one step onto another that otherwise starts afresh like a goldfish that has completed a lap of the bowl..\n\nYou also need to define how the AI gets is domain knowledge (existing source code, exposure in Frameworks or languages, MCP servers, rag etc.) and not leave the AI guessing. \n\nIn my (extremely limited) experience with AI, you can burn a lot of tokens for not a lot of quality output if you don't do all of the above. \n\nWhat surprises me is that so little of this is predefined. The software development lifecycle has both a lot of theory and a lot of practical experience, and a lot of literature about it. Yes, there are lots of minor alternatives - so you might need a few preferred prompts to choose from - but it's crazy that we are expected to reinvent the wheel. \n\nOut of the box, you seen to get none of this. And so people use it like Google because they are not guided otherwise and burn a whole shitload of tokens before giving up or painful learning.\n\nAnd though I am absolutely not an expert on llms, it does seem crazy to me that an apprentice coding LLM will understand 100 spoken languages, and 20 computer language and goodness knows what else, so that when I write English it burns inference cycles working out whether it means in Spanish, Italian and French, and when I want JavaScript code it has to reject all sorts of python and php probabilities. Surely we could have an English and web languages coding LLM (of say 8B tokens) instead of a polyglot be all and do all single LLM of 500B tokens. \n\nSo yes, we might also need different specialised llms for planning, design, and coding and running tests/diagnosing failures, but routing queues to the right LLM shouldn't be that hard these days.\n\n </rant>",
          "score": 1,
          "created_utc": "2026-02-15 00:33:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5kcrg5",
              "author": "redNox394",
              "text": "Very nicely put. Completely agreed",
              "score": 1,
              "created_utc": "2026-02-15 20:13:34",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5jnc1l",
          "author": "JWPapi",
          "text": "Interesting framework. One thing I've noticed though is that prompt-level quality controls drift over time. The AI follows them sometimes, ignores them other times. We ended up encoding our quality standards as ESLint rules instead. If the output contains \"we're thrilled\" or \"don't hesitate to reach out\", it fails the build. Can't ignore a build failure. The lint error messages also feed back as context, so the AI starts self-correcting after a few rounds.",
          "score": 1,
          "created_utc": "2026-02-15 18:07:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5kvnqd",
          "author": "Glittering-Body3504",
          "text": "i triied viral content ones , didnt do much reg the niche i asked for :(",
          "score": 1,
          "created_utc": "2026-02-15 21:50:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5as8l0",
          "author": "Federal-Candidate-20",
          "text": "Finally, my struggle to find the right prompt is over. Thanks for sharing with us, because prompts are important in AI generation across every field. I tried this prompt and it gave the best results, so I really appreciate this\n\n",
          "score": -3,
          "created_utc": "2026-02-14 06:15:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5bap4w",
          "author": "Pythonix0",
          "text": "Exactly this is they key",
          "score": 0,
          "created_utc": "2026-02-14 09:08:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ddk11",
          "author": "SouthDevelopment9574",
          "text": "Following",
          "score": 0,
          "created_utc": "2026-02-14 17:33:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5dmljo",
          "author": "Glum_East_754",
          "text": "By the time you have typed all this out or edited it to suit then you might as well just do it yourself.",
          "score": 0,
          "created_utc": "2026-02-14 18:18:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5e8cr3",
          "author": "JamieBillingham",
          "text": "It’s a really common framework that’s been around for a long time. I use it regularly myself and have embedded it in several courses that I’ve designed. Thanks for sharing it again.",
          "score": 0,
          "created_utc": "2026-02-14 20:10:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5anx2q",
          "author": "TomLucidor",
          "text": "GitHub with a comprehensive breakdown on how this is different from everyone else, with every single design decisions outlined please",
          "score": -1,
          "created_utc": "2026-02-14 05:38:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5apu3n",
          "author": "ceeczar",
          "text": "Thanks for sharing \n\n\nParticularly love how you spotted that annoying AI word *\"unlock\"*",
          "score": -1,
          "created_utc": "2026-02-14 05:54:25",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r21lyg",
      "title": "The big list of AI YouTube channels",
      "subreddit": "PromptEngineering",
      "url": "https://www.reddit.com/r/PromptEngineering/comments/1r21lyg/the_big_list_of_ai_youtube_channels/",
      "author": "JensPetrus",
      "created_utc": "2026-02-11 16:15:00",
      "score": 217,
      "num_comments": 41,
      "upvote_ratio": 0.97,
      "text": "Hello, making a list of AI YouTube channels that has educational or inspirational value. I have already gathered a bunch and sorted it into various categories, but some categories are a bit thin. If you know of any great frequently-updated channels, please drop them in the comments\n\nLists for other communities: [**Subreddits**](https://www.reddit.com/r/PromptQuestCOM/comments/1qwpuh8/list_of_the_best_ai_subreddits_to_join/) \\- [**Discord servers**](https://www.reddit.com/r/PromptQuestCOM/comments/1qxe48u/best_ai_discord_servers_to_to_join/) \\- [**X accounts**](https://www.reddit.com/r/PromptQuestCOM/comments/1qxg0j5/list_of_the_best_ai_x_accounts/) \\- [**Facebook Pages**](https://www.reddit.com/r/PromptQuestCOM/comments/1qxghn6/list_of_the_best_ai_facebook_pages/) \\- [**Facebook** **Groups**](https://www.reddit.com/r/PromptQuestCOM/comments/1r00oqh/list_of_the_best_ai_facebook_groups/)  \n\n\n# 📺 General AI channels\n\n* [Google](https://www.youtube.com/@Google) itself is a big channel covering a wide range of tech related topics, and a lot of their uploads are about AI and and Google's AI tools\n* [Hasan Aboul Hasan](https://www.youtube.com/@hasanaboulhasan/) focuses on productivity, and tool walkthroughs. He features practical guides on using AI tools, prompt tips, and much more\n* [Futurepedia](https://www.youtube.com/@futurepedia_io/) is a big channel with a lot of useful guides, comparisons, and tips and tricks on how to use various AI tools to generate content\n* [AI Search](https://www.youtube.com/@theAIsearch/) is a general AI channel that covers the latest news, trends, and tools. Here you can find useful tutorials on how to make various content\n* [Matt Wolfe](https://www.youtube.com/@mreflow/)’s channel delivers AI news, analysis, and practical insights, breaking down the latest developments and industry moves related to AI\n* [Youri van Hofwegen](https://www.youtube.com/@Yourivanhofwegen/)’s videos are mostly about automation, SEO, and passive income using AI and online systems, plus some video tutorials\n* [AI Master](https://www.youtube.com/@iamAImaster/) publishes tutorial videos on using tools like ChatGPT and Gemini, along with guides on building AI agents and workflow automations\n* [Malva AI](https://www.youtube.com/@malvaAI) mainly focuses on covering various AI tools used for video generation, and useful guides on how to make videos in different styles\n* [Moe Luker](https://www.youtube.com/@MoeLueker/) covers a variety of AI use cases, like image generation, video generation, and how to use various AI tools with different use cases\n* [Ryan Doser](https://www.youtube.com/@RyanDoserAI/) is a YouTube channel focused on practical AI tools, tutorials, and real‑world use cases. Videos cover how to use AI in general\n* [AI Advantage](https://www.youtube.com/@aiadvantage/) by Igor Pogani offers practical AI tutorials, tool walkthroughs, and weekly updates. He breaks down how to use different AI tools\n* [AI Samson](https://www.youtube.com/@aisamsonreal/) makes videos about a variety of use cases for image and video generators, as well as tools like ChatGTP, Gemini, and others like them\n* [Skill Leap AI](https://www.youtube.com/@SkillLeapAI/) is a channel that focuses on covering updates, features, and use cases of the major AI assistants like ChatGPT and Google Gemini\n* [Bijan Bowen](https://www.youtube.com/@Bijanbowen) is a guy who mostly publishes videos about Large Language Models, their use-cases, and new features, as well as testing different AI tools\n\n# 🤖 Large Language Models\n\n* [OpenAI](https://www.youtube.com/@OpenAI) is the company behind the most famous Large Language Model, ChatGPT. Here you can stay updated on both ChatGPT and OpenAI news\n* [Anthropic](https://www.youtube.com/@anthropic-ai) are the creators of the popular Claude AI, commonly used for coding. You can keep updated on news and features on their channel\n* [Microsoft Copilot](https://www.youtube.com/@Microsoft.Copilot) publishes videos of what you can use their AI tools for. Not a very active channel, but they do have some useful videos\n* [Qwen](https://www.youtube.com/@QwenLM) is the official YouTube channel for the AI chat assistant by Alibaba Cloud. Use cases and new features gets published on this channel\n* [Mistral AI](https://www.youtube.com/@MistralAIOfficial) is a European chat assistant. If you are interested in it and it’s features, you can sub to their channel to stay updated on new features\n* [Kimi AI](https://www.youtube.com/@KimiMoonshot) by the Chinese company Moonshot is a chat assistant with some interesting features. Their channel posts guides on how to use it\n\n# 🎨 Image and videos\n\n* [Leonardo AI](https://www.youtube.com/@leonardo.ai_community/) is the official channel for the image and video generation platform with the same name. They got some useful tutorials over there\n* [Higgsfield](https://www.youtube.com/@HiggsfieldAI) is an AI video generation platform, and this is the official YouTube channel. Here you can learn about new features and how to use them\n* [Nour Art](https://www.youtube.com/@NourArt2/) has a bit of both video generation and image generation tutorials, but the main focus seems to be on making cinematic video content\n* [Dank Kieft](https://www.youtube.com/@Dankieft/) shares example videos of cinematic, stylized, and experimental videos created with text‑to‑video and image‑to‑video AI tools\n* [Tao Prompts](https://www.youtube.com/@taoprompts/) focuses on video generation tools and tutorials, showing how to create cinematic videos and animations with different AI tools\n* [The Zinny Studio](https://www.youtube.com/@thezinnystudio/) has tutorials on how to make various animations and how to start and run faceless YouTube channels with AI made content\n* [WoollyFern](https://www.youtube.com/@woollyferncreative/) is a YouTuber who posts about the image generation tool Midjourney. Here you can learn new ways to use it and get the latest news\n* [Prompt Blueprint](https://www.youtube.com/@promptblueprint/) is about 3D creation, sharing prompts and techniques for generating consistent 3D models, scenes, and assets\n* [AI Now you Know](https://www.youtube.com/@AI.NowYKnow/) is a channel that covers how to use the latest and most popular video generation platforms. He also has some image tutorials\n* [RoboVerse](https://www.youtube.com/@roboverse987/) is another channel from Youri van Hofwegen, this one is more or less fully focused on how to make videos with various AI tools\n* [Future Tech Pilot](https://www.youtube.com/@FutureTechPilot/) is all about generating images using Midjourney. He has over 300 videos so far, so if you use Midjourney, follow this channel\n* [Wade McMaster](https://www.youtube.com/@WadeMcMaster/) has a lot of videos on different prompt styles for AI image generation. Most image generation videos use Midjourney\n* [Planet AI](https://www.youtube.com/@planetai217/) makes tutorial videos about generating content with the most popular AI generators at the moment, in both picture and video format\n* [Sebastien Jeffries](https://www.youtube.com/@SebastienJefferies/) is another channel you should subscribe to if you want to learn how to make AI pictures and videos, as well as visual effects\n* [MDMZ ](https://www.youtube.com/@MDMZ/)channel is fully focused on making videos with different AI tools. He also has various guides on video manipulation and character swapping\n\n# 🎵 Music generation\n\n* [Suno Music](https://www.youtube.com/@suno/) is the official YouTube channel for the popular music generation platform Suno. They post new features and how‑to guides here\n* [AI Automation Labs](https://www.youtube.com/@AIAutomationLabs/) channel name doesn’t really reflect the content they publish, which is videos about making music with various AI generators\n* [ChillPanic](https://www.youtube.com/@chillpanic/) is a genre fluid music producer, as he states on his channel description. He’s channel has changed direction to become a Suno source\n* [AI With TechZnap](https://www.youtube.com/@AIWithTechZnap/) isn’t a pure music generation channel, but most of his content revolves around making music with Suno and other platforms\n\n# 📝 Content writing\n\n* [Alex Cattoni](https://www.youtube.com/@AlexCattoni/)’s YouTube channel is quite focused on content writing, but also not limited to it. Here you can learn useful things about marketing\n* [The Nerdy Novelist](https://www.youtube.com/@TheNerdyNovelist/) is a guy who writes books and makes videos on how to use AI to do so. The channel is a mix of AI and non‑AI tips and tricks\n* [Eddy Ballesteros](https://www.youtube.com/@eddyballe/) is making videos on different AI tools for writing blog posts, scripts, hooks, email newsletters, and posts for social media accounts\n\n# 💼 Websites and SEO\n\n* [Ahrefs](https://www.youtube.com/@AhrefsCom/) is a huge player in the SEO market. Their YouTube channel also has videos on how to use AI to improve your rankings on Google and AIs\n* [Hostinger Academy](https://www.youtube.com/@HostingerAcademy/) has a lot of videos on how to use AI on websites to optimize and automate them, along with various other smart tutorials\n* [Matt Diggity](https://www.youtube.com/@MattDiggity/) is an online entrepeneur who’s YouTube channel is heavily focused on using different AI tools to improve website rankings\n* [Nathan Gotch](https://www.youtube.com/@nathangotch/) mainly makes videos about how to rank in Google and get suggested on ChatGPT. Some useful videos here if you are into AI SEO\n* [Steve Builds](https://www.youtube.com/@stevebuildswebsites/) Websites is a channel fully focused on making websites using various site builders and AI tools, he also covers some related topics\n* [Surfer Academy](https://www.youtube.com/@SurferSEO/) has videos on content writing using their own Surfer software, and how to optimize sites for AI and Google rankings\n\n# 🔧 Work and automation\n\n* [Jeff Su](https://www.youtube.com/@JeffSu/) shares practical videos on using AI tools to work smarter, with clear walkthroughs of assistants, automations, and everyday workflows\n* [Nate Herk](https://www.youtube.com/@nateherk/) is a guy who makes video tutorials about AI automation and agents, using different platforms like n8n, Claude, and ChatGPT\n* [RoboNuggets](https://www.youtube.com/@RoboNuggets/) automates a whole lot of different tasks and tools on his channel. There are also a few tutorials on other topics there as well\n* [Nick Sarev](https://www.youtube.com/@nicksaraev/)’s channel has a lot of content about agentic workflows that you can check out if you are into that. He also has various other AI videos\n* [Jono Catliff](https://www.youtube.com/@jonocatliff/) makes tutorials on how to use n8n to automate tasks and incorporate it into other tools. If you want to learn n8n, check him out\n* [Ed Hill](https://www.youtube.com/@EdHillAI/) is another YouTuber who makes videos about how to automate work tasks and make various programs using AI tools and vibe coding\n\n# 💻 Coding with AI\n\n* [Riley Brown](https://www.youtube.com/@rileybrownai/) publishes videos about vibe coding and how to make apps using different AI models. He mainly uses Claude Code for his AI vibe coding\n* [Peter Yang](https://www.youtube.com/@PeterYangYT/) makes tutorials on vibe coding and building apps with AI, along with interviews and practical videos about using AI to create projects\n* [Eric Tech](https://www.youtube.com/@EricWTech/) is a channel you should subscribe to if you want to learn vibe coding. He also has lots of videos covering automation with various tools\n* [Jack Roberts](https://www.youtube.com/@Itssssss_Jack/) has a bit of mixed AI content on his channel, but a lot of the videos revolve around vibe coding and making websites and dashboards\n* [Zinho Automates](https://www.youtube.com/@zinhoautomates/) makes videos about vibe coding and making apps with various AI tools. He also has guides on how to use n8n for automation\n* [Alex Finn](https://www.youtube.com/@AlexFinnOfficial/) publishes videos about coding with AI, using tools like Claude Code. He has tutorials on how to use various other coding AI tools as well\n\n# 🔬 Research-focused\n\n* [Two Minute Papers](https://www.youtube.com/@TwoMinutePapers/) covers advanced AI and computer science research, summarizing new academic papers and other AI experiments\n* [Google DeepMind](https://www.youtube.com/@googledeepmind/) focuses on advanced research, sharing videos on models, robotics, scientific breakthroughs, and long‑term AI development\n* [Matthew Berman](https://www.youtube.com/@matthew_berman/)’s channel focuses on artificial intelligence and technology, covering the latest AI developments, large language models, and more\n* [The Daily AI Brief](https://www.youtube.com/@AIDailyBrief/) posts daily videos focused on artificial intelligence news and analysis, keeping viewers up to date on recent developments\n* [The AI Grid](https://www.youtube.com/@TheAiGrid/) is a channel focused on artificial intelligence news, breakthroughs, research, and analysis. It covers the latest developments in AI\n* [AI Explained](https://www.youtube.com/@aiexplained-official/) focuses on in‑depth analysis of AI systems, model capabilities, and alignment, explaining how advanced AI models behave\n\n# 🤖 AI communities on various platforms\n\nHere are website versions of human-curated lists of AI communities on various platforms. These lists get updated frequently with new additions as they are discovered.\n\n* [**Best AI subreddits**](https://www.promptquest.com/best-ai-subreddits/): Here are the best AI subreddits to join for learning how to use AI and stay updated on the latest news, tips, tricks, prompt guides, and AI developments\n* [**Best AI YouTube channels**](https://www.promptquest.com/best-ai-youtube-channels/): Here are the best AI YouTube channels to subscribe to for keeping updated on the latest news and developments, tips, tricks, tutorials, etc\n* [**Best AI Discord servers**](https://www.promptquest.com/best-ai-discord-servers/): These are the best AI Discord servers to join if you want to learn how to use AI and take part in discussions related to it, if you use Discord\n* [**Best AI X accounts**](https://www.promptquest.com/best-ai-x-accounts/): Here are the best AI X accounts to follow to keep updated on the latest AI news and developments, tips and tricks, use-cases, tutorials, and inspiration\n* [**Best AI Facebook pages**](https://www.promptquest.com/best-ai-facebook-pages/): These are the best AI Facebook pages to follow if you want to stay updated on AI news and new tool releases, as well as learning how to use AI",
      "is_original_content": false,
      "link_flair_text": "Other",
      "permalink": "https://reddit.com/r/PromptEngineering/comments/1r21lyg/the_big_list_of_ai_youtube_channels/",
      "domain": "self.PromptEngineering",
      "is_self": true,
      "comments": [
        {
          "id": "o4woe41",
          "author": "Substantial-Comb-148",
          "text": "Been really into Matt Wolfe’s content on YouTube and his Spotify podcast \"The Next Wave\" for the last year and today's show was really interesting — he does an awesome job breaking down new AI tools, news AI hype and runs [FutureTools.io](http://FutureTools.io), a goldmine for discovering what’s new in AI.\n\nWes Roth and Matthew Berman also on Youtube are great too if you like creators who dig deep into how these tools actually work. Similar to Matt's content - Sometimes they may dig a bit deeper into the tools and breakdown.\n\nAlso check out Peter H. Diamandis’ channel — he tracks the latest AI news and politics with a weekly panel that sometimes includes Emad Mostaque (former Stability AI CEO). It’s a great mix of insight and debate from people actually in the AI space.\n\nAlso on Spotify \"AI Applied\" both of the guys on that Podcast also get into all the tools for building stuff and not super technical, so anybody can listen in and get some great ideas. And also \"AI Hustle\" is another good Podcast to add if you want add a Spotify section. ",
          "score": 6,
          "created_utc": "2026-02-12 01:39:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4xs70v",
              "author": "JensPetrus",
              "text": "Thanks, checking them out. Also adding FutureTools to my upcoming best AI websites list :\\]",
              "score": 2,
              "created_utc": "2026-02-12 06:10:59",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o511uee",
          "author": "Fun-Department812",
          "text": "A great list !\n\n[https://www.youtube.com/@mickmumpitz](https://www.youtube.com/@mickmumpitz) Shares detailed workflows about AI filmaking.",
          "score": 2,
          "created_utc": "2026-02-12 18:54:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o54v748",
              "author": "JensPetrus",
              "text": "Nice, added to queue, will add it later :\\]",
              "score": 1,
              "created_utc": "2026-02-13 09:06:19",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4xrxu8",
          "author": "aiyakisoba",
          "text": "AI Search channel is my go-to.",
          "score": 1,
          "created_utc": "2026-02-12 06:08:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4xx6we",
          "author": "Bitter-Wonder-7971",
          "text": "Awesome list—thanks for curating it! I've been hunting for the best subreddit on AI x Email, specifically generating full lifecycle marketing email campaigns purely through prompts. Anyone know of an existing one?\n\nIn the meantime, I just started r/AIxMarketing for all things AI in marketing—join us if you're into it! 🚀",
          "score": 1,
          "created_utc": "2026-02-12 06:55:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o51627v",
              "author": "Substantial-Comb-148",
              "text": "try [https://www.futuretools.io/](https://www.futuretools.io/) and click on the Marketing box, it will show you all the AI tools plus some ratings - but it sounds like you may benefit from N8N - A platform to connect and automate tasks across multiple applications and services. You can find it under the productivity selection of tools on the site plus others.",
              "score": 2,
              "created_utc": "2026-02-12 19:14:44",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4yt396",
          "author": "Ready-Blackberry-780",
          "text": "Amir Discoveries   \n",
          "score": 1,
          "created_utc": "2026-02-12 11:54:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4zix5a",
          "author": "roshbakeer",
          "text": "Thanks !",
          "score": 1,
          "created_utc": "2026-02-12 14:34:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o50fs47",
          "author": "DpyrTech",
          "text": "Outstanding list.  Thx. D.",
          "score": 1,
          "created_utc": "2026-02-12 17:11:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o51cfaq",
          "author": "JWPapi",
          "text": "Worth noting: most AI YouTube content focuses on prompting techniques and tricks.\n\nWhat's underrepresented: the insight that the quality of your input matters more than the quality of your prompting. A well-structured problem with clear context beats a sloppy problem with perfect prompting techniques.\n\nGood list though.",
          "score": 1,
          "created_utc": "2026-02-12 19:45:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o53hzoo",
              "author": "xXsEoUlMaNXx",
              "text": "I agree that's why I like Nate B. Jones. He's tackling this from a User Centric how do we transform the way we work and how should work be done perspective. ",
              "score": 1,
              "created_utc": "2026-02-13 02:41:48",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o51lt4y",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-12 20:30:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o51lt79",
              "author": "AutoModerator",
              "text": "Hi there! Your post was automatically removed because your account is less than 3 days old. We require users to have an account that is at least 3 days old before they can post to our subreddit.\n\nPlease take some time to participate in the community by commenting and engaging with other users. Once your account is older than 3 days, you can try submitting your post again.\n\nIf you have any questions or concerns, please feel free to message the moderators for assistance.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PromptEngineering) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-12 20:30:20",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5393m4",
          "author": "chillpanic_music",
          "text": "Thanks for the list and for mentioning me 🙏 Just found Matt Wolfe yesterday, def need to check some of these out",
          "score": 1,
          "created_utc": "2026-02-13 01:47:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o54wx02",
              "author": "JensPetrus",
              "text": "You're whalecum :\\]  Some good ones here for sure, with more to come whenever I come across any, or people submit them ",
              "score": 1,
              "created_utc": "2026-02-13 09:22:44",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o53opnr",
          "author": "Egyptian_quicksilver",
          "text": "Can anyone tell me how I can learn prompt engineering?",
          "score": 1,
          "created_utc": "2026-02-13 03:23:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o54665z",
          "author": "Agile_Childhood_8613",
          "text": "Thank you.",
          "score": 1,
          "created_utc": "2026-02-13 05:26:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o59km55",
          "author": "Adorable-Coconut-746",
          "text": "Awesome list!\nI like IBM technologies.",
          "score": 1,
          "created_utc": "2026-02-14 01:07:14",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r2t9wi",
      "title": "I told ChatGPT \"you're overthinking this\" and it gave me the simplest, most elegant solution I've ever seen",
      "subreddit": "PromptEngineering",
      "url": "https://www.reddit.com/r/PromptEngineering/comments/1r2t9wi/i_told_chatgpt_youre_overthinking_this_and_it/",
      "author": "AdCold1610",
      "created_utc": "2026-02-12 13:22:07",
      "score": 136,
      "num_comments": 41,
      "upvote_ratio": 0.81,
      "text": "Was debugging a messy nested loop situation. Asked ChatGPT for help.\n\nGot back 40 lines of code with three helper functions and a dictionary.\n\nMe: \"you're overthinking this\"\n\n**What happened next broke me:**\n\nIt responded with: \"You're right. Just use a set.\"\n\n*Gives me 3 lines of code that solved everything.*\n\nTHE AI WAS OVERCOMPLICATING ON PURPOSE??\n\n**Turns out this works everywhere:**\n\nPrompt: \"How do I optimize this database query?\" AI: *suggests rewriting entire schema, adding caching layers, implementing Redis* Me: \"you're overthinking this\"  \nAI: \"Fair point. Just add an index on the user\\_id column.\"\n\n**Why this is unhinged:**\n\nThe AI apparently has a \"show off mode\" where it flexes all its knowledge.\n\nTelling it \"you're overthinking\" switches it to \"actually solve the problem\" mode.\n\n**Other variations that work:**\n\n* \"Simpler.\"\n* \"That's too clever.\"\n* \"What's the boring solution?\"\n* \"Occam's razor this\"\n\n**The pattern I've noticed:**\n\nFirst answer = the AI trying to impress you After \"you're overthinking\" = the AI actually helping you\n\nIt's like when you ask a senior dev a question and they start explaining distributed systems when you just need to fix a typo.\n\n**Best part:**\n\nYou can use this recursively.\n\n*Gets complex solution* \"You're overthinking\" *Gets simpler solution*  \n\"Still overthinking\" *Gets the actual simple answer*\n\nI'm essentially coaching an AI to stop showing off and just help.\n\n**The realization that hurts:**\n\nHow many times have I implemented the overcomplicated solution because I thought \"well the AI suggested it so it must be the right way\"?\n\nThe AI doesn't always give you the BEST answer. It gives you the most IMPRESSIVE answer.\n\nUnless you explicitly tell it to chill.\n\n**Try this right now:** Ask ChatGPT something technical, then reply \"you're overthinking this\" to whatever it says.\n\nReport back because I need to know if I'm crazy or if this is actually a thing.\n\nHas anyone else been getting flexed on by their AI this whole time?\n\n[For more prompts ](https://www.beprompter.in).",
      "is_original_content": false,
      "link_flair_text": "Ideas & Collaboration",
      "permalink": "https://reddit.com/r/PromptEngineering/comments/1r2t9wi/i_told_chatgpt_youre_overthinking_this_and_it/",
      "domain": "self.PromptEngineering",
      "is_self": true,
      "comments": [
        {
          "id": "o50catb",
          "author": "Shogun_killah",
          "text": "Gpt 5 has two thinking models\n- overthinking\n- jealous psycho girlfriend overthinking",
          "score": 30,
          "created_utc": "2026-02-12 16:55:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o53zhgf",
              "author": "timbo2m",
              "text": "Gotta keep up those token counts fam",
              "score": 3,
              "created_utc": "2026-02-13 04:36:57",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o532h5c",
          "author": "rolkien29",
          "text": "This post is too complicated",
          "score": 13,
          "created_utc": "2026-02-13 01:06:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o50tvc8",
          "author": "ValuableGrab3236",
          "text": "I ask it complicated questions then direct it to supply the answer in a way  that Homer Simpson could understand",
          "score": 11,
          "created_utc": "2026-02-12 18:17:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o52uhrk",
              "author": "spvcejam",
              "text": "I just have it ELI5 and it seems to take into context that you aren't actually 5 and just explains it for idiots like me",
              "score": 3,
              "created_utc": "2026-02-13 00:20:00",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o52jupo",
              "author": "_gonzo_",
              "text": "This is the way",
              "score": 1,
              "created_utc": "2026-02-12 23:19:13",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o50jh7h",
          "author": "RobinLocksly",
          "text": "That definitely works. It has multiple pathways in its latent space, and the first pass is basically mapping them all + giving the most common path even if it doesn't work or is unnecessarily complex. Once you ask an llm to simplify after it has searched it's 'mind'(database) for what connections *do* exist, then it has the connections there already and it's more about triage than it is about searching.",
          "score": 5,
          "created_utc": "2026-02-12 17:29:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o53a4x4",
              "author": "MohutmaGandhi",
              "text": "any youtube video or source which will tell me how it takes the input and gives output ? \nor how actually these LLMs are made and how they perform",
              "score": 0,
              "created_utc": "2026-02-13 01:53:40",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o54hw44",
                  "author": "Initunit",
                  "text": "Search for latent space.",
                  "score": 1,
                  "created_utc": "2026-02-13 07:03:09",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o51bxkq",
          "author": "JWPapi",
          "text": "This is actually a perfect example of why your input framing matters more than elaborate prompting techniques.\n\nThe word \"overthinking\" shifted the probability distribution toward simpler solutions. Single words early in the interaction can route the entire output trajectory.\n\nI've been calling this the Vibe Theory of Prompting - the model pattern-matches to the quality and style of your input. When you said \"overthinking,\" you gave it permission to reach for elegance instead of comprehensiveness.\n\nSame reason why a well-written spec with zero prompt engineering beats a sloppy spec with perfect prompting. The substance matters more than the technique.",
          "score": 3,
          "created_utc": "2026-02-12 19:42:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o54zm8g",
          "author": "singh_taranjeet",
          "text": "There’s actually a pretty boring explanation for this that makes it less sinister and more statistical.\n\nBy default, the model optimizes for completeness and coverage, not minimalism. So it reaches for the solution that handles edge cases, scales, and sounds production ready. That often looks like overengineering when all you needed was a set or an index.\n\nWhen you say “you’re overthinking,” you’re not unlocking a secret mode. You’re changing the objective function. You’re signaling that simplicity > robustness > exhaustiveness. That shifts the distribution toward minimal solutions.\n\nIt’s less “show off mode” and more “I wasn’t told to prefer boring.”\n\nHonestly this is a great example of why constraints beat clever prompts. One sentence reframed the entire output trajectory.",
          "score": 3,
          "created_utc": "2026-02-13 09:48:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5f11fa",
              "author": "nailedit888",
              "text": "This is gold",
              "score": 1,
              "created_utc": "2026-02-14 22:48:56",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4ze4p2",
          "author": "PathStoneAnalytics",
          "text": "Vibe coding , my website right now and I know it's breaking the cod rules , but I find sometimes it's best to just simply tell. Delete the thing that we've been working on, then I come back with okay.I want you to build this thing to do this thing that I was trying to get you to do back there.But all I say is \"build this thing i'm trying to do. Do not use previous references from this chat to help you\" a lot of times they get stuck in a token loop where they are just trying to make something work with the token knowledge that they have.And once you clear those tokens away , they all of a sudden move way , smoother",
          "score": 4,
          "created_utc": "2026-02-12 14:08:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o50jw15",
          "author": "aletheus_compendium",
          "text": "i like this. keep it simple! 🙌🏻 \ni saw someone suggest \"no yapping\" and that does marvels too 🤙🏻",
          "score": 2,
          "created_utc": "2026-02-12 17:31:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o51d4ma",
              "author": "AdCold1610",
              "text": "Yeh no yapping was also my post , yeah I have also have complex problems prompt also. I will share it in post 😊",
              "score": 3,
              "created_utc": "2026-02-12 19:48:44",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o59506y",
          "author": "ProfessionalPanic903",
          "text": "You're overthinking this. ",
          "score": 2,
          "created_utc": "2026-02-13 23:33:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4zc4iu",
          "author": "-goldenboi69-",
          "text": "Yeah its kind of true. I usually realize that its trying to something way more complex and \"correct\" sometimes. Good thing im a 10x dev so its easy for me to ask for something simpler.",
          "score": 2,
          "created_utc": "2026-02-12 13:57:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o511691",
          "author": "skly_ai",
          "text": "This is real. I've noticed the same pattern. The first answer is the AI trying to impress you. The second answer, after a redirect, is the one that actually solves the problem. \n\n\"My boring solution?\" is my go-to version of this. Boring solutions ship faster.",
          "score": 1,
          "created_utc": "2026-02-12 18:51:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o515hz8",
          "author": "Greyhaven7",
          "text": "To be fair, “use a Set” is a fantastically simple solution to a bunch of computing problems, especially if you’re using JavaScript. They’re ordered iterables that cannot contain duplicate entries and have O(1) lookup times. Powerful data type.",
          "score": 1,
          "created_utc": "2026-02-12 19:12:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o534m1b",
          "author": "NecessarySpecific316",
          "text": "They are a product with one goal. To keep the customer engaged. The faster you get your answer. The faster you log off.",
          "score": 1,
          "created_utc": "2026-02-13 01:19:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o53pq2a",
          "author": "Worth_Plastic5684",
          "text": "> Best part:\n\n> You can use this recursively.\n\n> Gets complex solution \"You're overthinking\" Gets simpler solution\n\n> \"Still overthinking\" Gets the actual simple answer\n\nFrom the people who brought you the Ralph Wiggum loop, it's the Buddha Loop",
          "score": 1,
          "created_utc": "2026-02-13 03:30:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o53v1dk",
          "author": "Alert-Fee5079",
          "text": "I literally told it today that i didn’t even read half of its responses because it went way too overboard",
          "score": 1,
          "created_utc": "2026-02-13 04:06:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o595atk",
          "author": "littlemissperf",
          "text": "Zero-effort AI post. Probably didn't happen",
          "score": 1,
          "created_utc": "2026-02-13 23:34:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o59x9h8",
          "author": "derpingthederps",
          "text": "Sometimes, yes. \n\nI've also been annoyed quite often by how it seems to always ignore my requests.\nA lot of what I use it for is very small scripts or build a dirty poc of an idea.\n\n>Ask it to add a basic function/addition to something\n>Includes lots of extra bull crap and comments\n\nGPT I asked you to add those 10 lines because I'm lazy and don't want to read the documentation, not because I wanted you to add 30 extra lines and redesign my script. \n\nAND STOP TELLING ME \"Just change this and it will be fixed👍\"\n\nSometimes LLM's are a blessing, solving an issue that night takes me hours to troubleshoot alone.\n\nOther times, it would've been better off me just doing the damn job myself.\n\nEither way, it's a love hate relationship we have.",
          "score": 1,
          "created_utc": "2026-02-14 02:27:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ac64i",
          "author": "zumera",
          "text": "Why didn’t you write the post yourself? ",
          "score": 1,
          "created_utc": "2026-02-14 04:08:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5bxgsf",
          "author": "Sharpieface",
          "text": "Have you tested results comparing the quality of outputs if you include “Don’t overthink” in the first prompt vs saying it after the first prompt is already generated?",
          "score": 1,
          "created_utc": "2026-02-14 12:40:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5hwenq",
          "author": "dankiboiis",
          "text": "Bros typing like he's posting on linked in",
          "score": 1,
          "created_utc": "2026-02-15 12:22:04",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r0s8v1",
      "title": "I compiled 50 Microsoft Copilot prompts that work with ANY version — no M365 integration needed",
      "subreddit": "PromptEngineering",
      "url": "https://www.reddit.com/r/PromptEngineering/comments/1r0s8v1/i_compiled_50_microsoft_copilot_prompts_that_work/",
      "author": "Difficult-Sugar-4862",
      "created_utc": "2026-02-10 05:26:38",
      "score": 69,
      "num_comments": 29,
      "upvote_ratio": 0.95,
      "text": "I've been building out a collection of AI prompts for enterprise use, and one thing that kept bugging me was that most Copilot prompt lists assume you have the full Microsoft 365 Copilot license.\n\nSo I pulled together 50 prompts that work with the free/standard Copilot — no integrations, no premium features required.\n\nHere are 10 to start:\n\n**Email & Communication:**\n\n1. \"Draft a professional reply to \\[paste email\\] that addresses their concerns while maintaining our position on \\[topic\\]. Keep it under 150 words.\"\n2. \"Rewrite this message to be more diplomatic without losing the core ask: \\[paste text\\]\"\n3. \"Create 3 subject line options for an email about \\[topic\\] that will get opened\"\n\n**Analysis & Summaries:** 4. \"Summarize the key decisions, action items, and owners from these meeting notes: \\[paste notes\\]\" 5. \"Compare these two approaches and give me a pros/cons table: \\[describe options\\]\" 6. \"Extract the 5 most important data points from this report and explain why they matter: \\[paste excerpt\\]\"\n\n**Writing & Content:** 7. \"Turn these bullet points into a professional executive summary for a \\[audience\\] audience: \\[paste bullets\\]\" 8. \"Review this text for clarity, tone, and grammar. Suggest improvements but keep my voice: \\[paste text\\]\" 9. \"Create an agenda for a \\[duration\\] meeting about \\[topic\\] with \\[number\\] participants\"\n\n**Problem Solving:** 10. \"I'm facing \\[describe problem\\]. Walk me through a structured approach to solve it, starting with the most likely root causes.\"\n\nThe full set of 50 covers quick analysis, writing, brainstorming, data work, and communication — all tested in actual work scenarios.\n\nHappy to share the rest if this is useful. What prompts do you use most with Copilot?",
      "is_original_content": false,
      "link_flair_text": "General Discussion",
      "permalink": "https://reddit.com/r/PromptEngineering/comments/1r0s8v1/i_compiled_50_microsoft_copilot_prompts_that_work/",
      "domain": "self.PromptEngineering",
      "is_self": true,
      "comments": [
        {
          "id": "o4knr0f",
          "author": "chado99",
          "text": "Please share the rest.",
          "score": 8,
          "created_utc": "2026-02-10 06:37:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4krnlg",
          "author": "OptimismNeeded",
          "text": "How do people work with dozens of prompts? \n\nDo people actually use them or just download just in case and let them collect dust?\n\nWhen you need to summarize something in bullet points do you actually look up the prompts for that and paste it instead of just asking copilot to do it?",
          "score": 4,
          "created_utc": "2026-02-10 07:11:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4mytvi",
              "author": "busterbus2",
              "text": "I used to but honestly, unless your tasks are repetitive, its probably faster to just iterate as you go. The best prompt I have built in to a Google Gem/ChatGPT GPT is actually a prompt evaluator which takes your prompt, evaluates on a ton of criteria and then redrafts a much better version of it. VERY helpful.",
              "score": 3,
              "created_utc": "2026-02-10 16:23:55",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o4l9urk",
              "author": "OriginalInstance9803",
              "text": "It depends on a workflow. \n\nI manage my prompts and contexts on versuno.ai because it's easy to use and has all the tools I need. \n\nI typically just grab the prompt from there and context if needed and do a specific task like summarizing the latest news on reddit in Claude",
              "score": 1,
              "created_utc": "2026-02-10 10:07:06",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4mm000",
                  "author": "North-Act-7958",
                  "text": "let me guess its also your saas haha",
                  "score": 4,
                  "created_utc": "2026-02-10 15:23:27",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4xjlwp",
          "author": "MburrD",
          "text": "I explain to the relevant AI what I would like to achieve and get it to create the prompt for me. If I'm not satisfied then I have the option to regenerate alternatively to use another AI.",
          "score": 1,
          "created_utc": "2026-02-12 05:01:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4xjvbj",
              "author": "Difficult-Sugar-4862",
              "text": "yeah it is also a nice way to do. thanks for sharing.",
              "score": 1,
              "created_utc": "2026-02-12 05:03:05",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4xpgwp",
          "author": "J_Sohal",
          "text": "Hey. Would you guys like a place to store and catalogue all your prompts like a Digital\nMagpie.\n\nI am just finishing a Notion template (Promptly)for you to save all your prompt stuff and more available anywhere .\n\nWith you be interested?",
          "score": 1,
          "created_utc": "2026-02-12 05:47:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5luv8s",
              "author": "DisastrousAdvisor30",
              "text": "This is a rad idea",
              "score": 1,
              "created_utc": "2026-02-16 01:12:35",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5k05og",
          "author": "MobileTechGuy",
          "text": "Hi, could you share the rest please? I am trying to get more involved with Copilot and would really benefit from some more thorough guidance. \n\nThank you",
          "score": 1,
          "created_utc": "2026-02-15 19:09:58",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qzwr0b",
      "title": "AI tools for building apps in 2025 (and possibly 2026)",
      "subreddit": "PromptEngineering",
      "url": "https://www.reddit.com/r/PromptEngineering/comments/1qzwr0b/ai_tools_for_building_apps_in_2025_and_possibly/",
      "author": "AmesTracing",
      "created_utc": "2026-02-09 06:21:50",
      "score": 46,
      "num_comments": 18,
      "upvote_ratio": 0.96,
      "text": "I’ve been testing a range of AI tools for building apps, and here’s my current top list:\n\n* **Lovable.** Prompt-to-app (React + Supabase). Great for MVPs, solid GitHub integration. Pricing limits can be frustrating.\n* **Bolt.** Browser-based, extremely fast for prototypes with one-click deploy. Excellent for demos, weaker on backend depth.\n* **UI Bakery AI App Generator.** Low-code plus AI hybrid. Best fit for production-ready internal tools (RBAC, SSO, SOC 2, on-prem).\n* **DronaHQ AI.** Strong CRUD and admin builder with AI-assisted visual editing.\n* **ToolJet AI.** Open-source option with good AI debugging capabilities.\n* **Superblocks (Clerk).** Early stage, but promising for enterprise internal applications.\n* **GitHub Copilot.** Best day-to-day coding assistant. Not an app builder, but a major productivity boost.\n* **Cursor IDE.** AI-first IDE with project-wide edits using Claude. Feels like Copilot plus more context.\n\n**Best use cases**\n\n* Use **Lovable** or **Bolt** for MVPs and rapid prototypes.\n* Use **Copilot** or **Cursor** for coding productivity.\n* Use **UI Bakery**, **DronaHQ**, or **ToolJet** for maintainable internal tools.\n\nWhat’s your go-to setup for building apps, and why?",
      "is_original_content": false,
      "link_flair_text": "Tools and Projects ",
      "permalink": "https://reddit.com/r/PromptEngineering/comments/1qzwr0b/ai_tools_for_building_apps_in_2025_and_possibly/",
      "domain": "self.PromptEngineering",
      "is_self": true,
      "comments": [
        {
          "id": "o4f6j9w",
          "author": "brads0077",
          "text": "Claude Code. It blows all of them away. \n\nPeople seem to stay away from Claude Code because it looks too hard...too intimidating. Especially when it is in Cursor or VS Code.\n\nBut it you just use it solo and have a conversation with it, you'd soon see that it is a fantastic platform on which thousands of talented people are building open-source apps to further enhance it.",
          "score": 4,
          "created_utc": "2026-02-09 12:17:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4i7wyj",
              "author": "Visible_Importance68",
              "text": "It changed my perspective. I really understood the term \"terminal lovers\". Used to be soo rigid about getting good UI to talk to an LLM but all of that literally changed in about 4 to 5 tries of using Claude Code with Ghosty on my MBP M4. It's the true experience of what real AI is all about.",
              "score": 1,
              "created_utc": "2026-02-09 21:40:51",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4e5usf",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-09 06:37:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4e5uto",
              "author": "AutoModerator",
              "text": "Hi there! Your post was automatically removed because your account is less than 3 days old. We require users to have an account that is at least 3 days old before they can post to our subreddit.\n\nPlease take some time to participate in the community by commenting and engaging with other users. Once your account is older than 3 days, you can try submitting your post again.\n\nIf you have any questions or concerns, please feel free to message the moderators for assistance.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PromptEngineering) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-09 06:37:02",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4mbc41",
          "author": "Margarite_Tucker",
          "text": "Building in 2025 is definitely about speed. I've beed using a mix of Cursor and Vercel for the front end, but for the complex ML backends, I actually looked into Litslink for custom AI solutions. They helped bridge the gap between my prompts and a scalable production environment.",
          "score": 1,
          "created_utc": "2026-02-10 14:28:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4sv9k0",
          "author": "Southern_Gur3420",
          "text": "Base44 handles prompt-to-app builds smoothly now under Wix. What's your favorite feature for MVPs?",
          "score": 1,
          "created_utc": "2026-02-11 14:11:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4tmj94",
          "author": "thought_provoking27",
          "text": "Hello , \n\nGreat list. I'd add Mber ai to the 'must-watch' pile for 2026. If you're building agentic workflows or community data tools, Mber ai is starting to handle the heavy lifting that we used to custom code. It fits really nicely alongside Cursor and V0 in a modern dev stack. ",
          "score": 1,
          "created_utc": "2026-02-11 16:26:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5co6sw",
          "author": "TechnicalSoup8578",
          "text": "Looks like the distinction comes down to end-to-end context handling versus rapid prototyping, with some tools favoring code generation and others visual scaffolding. You sould share it in VibeCodersNest too",
          "score": 1,
          "created_utc": "2026-02-14 15:24:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4esx15",
          "author": "botapoi",
          "text": "been using blink lately and honestly the builtin database and auth saved me from dealing with supabase setup, but lovable's github integration is hard to beat if you're already in that workflow. bolt is great for quick demos but yeah you hit the nail on the head about backend limitations",
          "score": 0,
          "created_utc": "2026-02-09 10:19:20",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r14pyg",
      "title": "I couldn't find a decent free AI course that wasn't trying to sell me something, so I just built my own",
      "subreddit": "PromptEngineering",
      "url": "https://www.reddit.com/r/PromptEngineering/comments/1r14pyg/i_couldnt_find_a_decent_free_ai_course_that_wasnt/",
      "author": "Popular-Help5516",
      "created_utc": "2026-02-10 16:02:45",
      "score": 44,
      "num_comments": 25,
      "upvote_ratio": 0.82,
      "text": "Every free AI course I found was either a 10-minute YouTube video that barely scratches the surface, or a \"free intro\" that gates the actual useful stuff behind $200+. So I just... made my own.\n\n5 courses, 8 lessons each, completely free. No account needed. I'm the one who built them so take this with that grain of salt, but I tried to make them actually useful rather than just impressive-sounding :)\n\nHere's the order I'd recommend:\n\n[**AI Fundamentals**](https://findskill.ai/courses/ai-fundamentals/) — 2 hours. Start here if you've mostly been typing random stuff into ChatGPT and hoping for the best. Covers how LLMs actually work, why your prompts suck, and how to fix them.\n\n[**Prompt Engineering**](https://findskill.ai/courses/prompt-engineering/) — 3 hours. This is where it gets good. Few-shot learning, chain-of-thought, the RACE framework. Basically the difference between getting mid outputs and getting outputs that actually save you time.\n\n[**Better Writing with AI**](https://findskill.ai/courses/writing-better/) — 2 hours. Not \"make AI write everything for you.\" More like how to use it as an editor that actually makes your writing better. The lesson on beating the blank page alone was worth building.\n\n[**Research Smarter with AI**](https://findskill.ai/courses/research-and-learning/) — 2 hours. How to tell when AI is giving you solid info vs confidently making stuff up. Source evaluation, cross-referencing, building study materials. Most people skip this and it shows.\n\n[**Critical Thinking with AI**](https://findskill.ai/courses/critical-thinking/) — 2 hours. Spotting biases, catching logical fallacies, using AI to poke holes in your own arguments. Honestly this one's useful even if you never touch AI again.\n\n\\~11 hours total. There's a quiz and certificate at the end of each if you're into that. :D\n\nAnyway, happy to answer questions if anyone has them.",
      "is_original_content": false,
      "link_flair_text": "Tutorials and Guides",
      "permalink": "https://reddit.com/r/PromptEngineering/comments/1r14pyg/i_couldnt_find_a_decent_free_ai_course_that_wasnt/",
      "domain": "self.PromptEngineering",
      "is_self": true,
      "comments": [
        {
          "id": "o4nj1r1",
          "author": "kboogie82",
          "text": "AI can teach you about AI. AI is also a tool the more you use it the more you should get good at it. Most courses are trash.",
          "score": 2,
          "created_utc": "2026-02-10 17:57:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4qlnea",
          "author": "UnknownLearnerofLife",
          "text": "Interested.",
          "score": 1,
          "created_utc": "2026-02-11 03:32:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4xrzfe",
              "author": "Popular-Help5516",
              "text": "tks u",
              "score": 1,
              "created_utc": "2026-02-12 06:09:10",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4swq3p",
          "author": "Southern_Gur3420",
          "text": "Building free AI courses from scratch shows real commitment to accessible learning. Have you considered using Base44 to prototype interactive versions faster?",
          "score": 1,
          "created_utc": "2026-02-11 14:19:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4sz9xa",
              "author": "Popular-Help5516",
              "text": "Wym?",
              "score": 1,
              "created_utc": "2026-02-11 14:33:10",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o57qroc",
          "author": "ThinkProgrammer3834",
          "text": "FOLLOW",
          "score": 1,
          "created_utc": "2026-02-13 19:15:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ez2vg",
          "author": "Potential_Sand3278",
          "text": "i've built my own course too, boundaries matter in life?",
          "score": 1,
          "created_utc": "2026-02-14 22:37:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4mw5s8",
          "author": "aletheus_compendium",
          "text": "and there's always youtube which has excellent resources",
          "score": 0,
          "created_utc": "2026-02-10 16:11:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4n66wv",
              "author": "Reichsminster",
              "text": "Can you name some examples?",
              "score": 2,
              "created_utc": "2026-02-10 16:57:37",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4nlxhn",
                  "author": "aletheus_compendium",
                  "text": "how hard is it to search? 🤦🏻‍♂️ find ones that suits you and your needs.",
                  "score": -7,
                  "created_utc": "2026-02-10 18:10:10",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4o0p28",
          "author": "Dapper-River-3623",
          "text": "Will try it and post my experience. \nI actually made a private comprehensive course of using AI for company owners and execs, so I will compare the two.",
          "score": 0,
          "created_utc": "2026-02-10 19:17:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4szgyz",
              "author": "Popular-Help5516",
              "text": "Tks!! Let me know your thoughts!",
              "score": 1,
              "created_utc": "2026-02-11 14:34:14",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r4g0qs",
      "title": "The \"write like [X]\" prompt is actually a cheat code and nobody talks about it",
      "subreddit": "PromptEngineering",
      "url": "https://www.reddit.com/r/PromptEngineering/comments/1r4g0qs/the_write_like_x_prompt_is_actually_a_cheat_code/",
      "author": "AdCold1610",
      "created_utc": "2026-02-14 09:05:27",
      "score": 43,
      "num_comments": 9,
      "upvote_ratio": 0.81,
      "text": "I've been testing this for weeks and it's genuinely unfair how well it works.\n\n**The technique:**\n\nInstead of describing what you want, just reference something that already exists.\n\n\"Write like \\[company/person/style\\] would\"\n\n**Why this breaks everything:**\n\nThe AI has already ingested thousands of examples of whatever you're referencing. You're not teaching it - you're just pointing.\n\n**Examples that made me rethink prompting:**\n\n❌ \"Write a technical blog post that's accessible but thorough with good examples and clear explanations\"\n\n✅ \"Write this like a Stripe engineering blog post\"\n\nThe second one INSTANTLY nails the tone, structure, depth level, and example quality because the AI already knows what Stripe posts look like.\n\n**Where this goes crazy:**\n\nCode:\n\n* \"Write this like it's from the Airbnb style guide\" → clean, documented, consistent\n* \"Code this like a senior at Google would\" → enterprise patterns, error handling\n\nWriting:\n\n* \"Explain this like Paul Graham would\" → essay format, clear thinking\n* \"Write like it's a Basecamp blog post\" → opinionated, straightforward\n\nDesign:\n\n* \"Describe this UI like Linear would build it\" → minimal, functional, fast\n\n**The pattern I discovered:**\n\nVague description = AI guesses Specific reference = AI knows exactly what you mean\n\n**This even works for tone:**\n\n* \"Reply to this customer like Chewy would\" → empathetic, helpful, human\n* \"Handle this complaint like Amazon support would\" → efficient, solution-focused\n\n**The meta-realization:**\n\nEvery time you write a detailed prompt describing style, tone, format, depth level... you're doing it the hard way.\n\nSomeone already wrote/coded/designed in that style. Just reference them.\n\n**The recursive trick:**\n\nFirst output: \"Write this like \\[X\\]\" Second output: \"Now write the same thing like \\[Y\\]\"\n\nInstant A/B test of different approaches.\n\n**Real test I ran:**\n\nSame product description:\n\n* \"Like Apple would write it\" → emotional, aspirational, simple\n* \"Like a spec sheet\" → technical, detailed, feature-focused\n* \"Like Dollar Shave Club would\" → funny, irreverent, casual\n\nThree completely different angles. Zero effort to explain what I wanted.\n\n**Why nobody talks about this:**\n\nBecause it feels too simple? Too obvious?\n\nBut I've seen people write 200-word prompts trying to describe a style when they could've just said \"write it like \\[brand that already does this perfectly\\].\"\n\n\n\n**Test this right now:**\n\nTake whatever you last asked AI to write. Redo the prompt as \"write this like \\[relevant example\\] would.\"\n\nCompare the outputs.\n\nWhat references have you found that consistently work?\n\n[for more post](http://beprompter.in)",
      "is_original_content": false,
      "link_flair_text": "Ideas & Collaboration",
      "permalink": "https://reddit.com/r/PromptEngineering/comments/1r4g0qs/the_write_like_x_prompt_is_actually_a_cheat_code/",
      "domain": "self.PromptEngineering",
      "is_self": true,
      "comments": [
        {
          "id": "o5bf04u",
          "author": "[deleted]",
          "text": "[deleted]",
          "score": 2,
          "created_utc": "2026-02-14 09:51:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5bni6c",
              "author": "N0tN0w0k",
              "text": "I don’t think that’s exactly the same thing as OP is referring, I would suggest giving each of these separate attention\n\nRole = persona > from who’s perspective is the output written?\n\nTarget = audience > who’s the output meant for?\n\nStyle example’s(OP’s post) = tone mostly and a bit of formatting > what does the output look/sound like?",
              "score": 2,
              "created_utc": "2026-02-14 11:14:28",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5bz2x8",
          "author": "roger_ducky",
          "text": "Specific references are good when the model knows about it.\n\nLike a spec sheet will probably work but won’t give a consistent style.",
          "score": 1,
          "created_utc": "2026-02-14 12:52:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5c8a24",
          "author": "Cuaternion",
          "text": "The above seems to work as long as you know the references.",
          "score": 1,
          "created_utc": "2026-02-14 13:53:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5f16mh",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-14 22:49:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5f16oc",
              "author": "AutoModerator",
              "text": "Hi there! Your post was automatically removed because your account is less than 3 days old. We require users to have an account that is at least 3 days old before they can post to our subreddit.\n\nPlease take some time to participate in the community by commenting and engaging with other users. Once your account is older than 3 days, you can try submitting your post again.\n\nIf you have any questions or concerns, please feel free to message the moderators for assistance.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PromptEngineering) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-14 22:49:47",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5hvzw5",
          "author": "Noophyd",
          "text": "You can also point to blogpost and say write like here",
          "score": 1,
          "created_utc": "2026-02-15 12:18:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5d5a4t",
          "author": "Kwontum7",
          "text": "I made a custom GPT with materials sourced from Steve Jobs. I discuss multiple business topics with it.",
          "score": 0,
          "created_utc": "2026-02-14 16:51:42",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qzwlyq",
      "title": "AI Agents – Workflow Tool",
      "subreddit": "PromptEngineering",
      "url": "https://www.reddit.com/r/PromptEngineering/comments/1qzwlyq/ai_agents_workflow_tool/",
      "author": "KaitoRift",
      "created_utc": "2026-02-09 06:14:02",
      "score": 42,
      "num_comments": 14,
      "upvote_ratio": 0.99,
      "text": "I’ve had really solid results from building workflows of AI agents and routing them through different models.\n\nFor example, I ask Claude to generate a blog post outline, then feed that back into a prompt to generate the full content. I then pass it to Gemini to “fact check” and add any citations that might be useful.\n\nFinally, I send it back to Claude again. I’m finding this approach pretty effective, and it’s nothing new. I know others are doing something similar, and it feels like the o1-preview model from OpenAI follows a related pattern.\n\nI’m thinking about building a very simple drag-and-drop workflow tool that lets you connect agents visually. It would be free to use, and you’d just generate an API URL with an input. You could then configure your agents and either return the output to the same API request or trigger a webhook.\n\nYou’d be able to split outputs into JSON keys, and I’d also add some basic logic to detect faulty responses and automatically adjust when needed.\n\nIt would be free with “bring your own keys,” or paid if you want to use our keys at a small discount.\n\nFirst, would people actually be interested in a tool like this? I couldn’t really find one that does exactly this. Second, what features would you want to see?\n\nI know LangChain and similar tools are powerful, but I find them a bit complex for non-coders and other stakeholders when trying to visually explain how everything works.\n\nUpdate: I built the tool. [https://aiflowtool.com/]() lets you connect AI prompts across Claude, Gemini, and ChatGPT. It’s still in beta, but I’d love to hear any feedback.",
      "is_original_content": false,
      "link_flair_text": "Ideas & Collaboration",
      "permalink": "https://reddit.com/r/PromptEngineering/comments/1qzwlyq/ai_agents_workflow_tool/",
      "domain": "self.PromptEngineering",
      "is_self": true,
      "comments": [
        {
          "id": "o4l25i6",
          "author": "cryptobuff",
          "text": "this workflow makes a lot of sense. chaining agents by responsibility (outline → verify → refine) feels way more reliable than trying to force one agent to do everything well",
          "score": 3,
          "created_utc": "2026-02-10 08:51:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4l2amj",
              "author": "ZivenPulse",
              "text": "yeah, especially once you care about consistency. single-agent setups break down fast once you add volume or real users",
              "score": 2,
              "created_utc": "2026-02-10 08:53:21",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4l2cdp",
                  "author": "cryptobuff",
                  "text": "exactly. once you treat agents like modular steps instead of “intelligence,” debugging and iteration get way easier",
                  "score": 1,
                  "created_utc": "2026-02-10 08:53:50",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o4l2ix9",
              "author": "Pristine-Collar-9037",
              "text": "the visual drag-and-drop angle is interesting. most tools either go full dev-first or hide too much behind abstractions",
              "score": 2,
              "created_utc": "2026-02-10 08:55:36",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4l2k98",
                  "author": "Own_View3337",
                  "text": "that’s what stood out to me too. tools like Lindy work well here because they focus on orchestration and clarity, not just prompt chaining. non-technical teams can actually understand and maintain the flows, which ends up mattering more than raw flexibility",
                  "score": 1,
                  "created_utc": "2026-02-10 08:55:58",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4l15fq",
          "author": "leobesat",
          "text": "this is honestly the exact direction a lot of teams are moving toward. chaining models with clear responsibilities (draft to verify to refine) scales way better than a single “do everything” agent",
          "score": 2,
          "created_utc": "2026-02-10 08:42:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4l1f8o",
              "author": "OriSparrow_14",
              "text": "agree. once you start treating models like workers instead of brains, things click",
              "score": 2,
              "created_utc": "2026-02-10 08:44:47",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4l1he6",
                  "author": "leobesat",
                  "text": "the drag-and-drop + API-first idea is the key part here. most existing tools either assume devs or force everything into a proprietary runtime",
                  "score": 1,
                  "created_utc": "2026-02-10 08:45:23",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4l2p7k",
          "author": "KindlyOrin_",
          "text": "langchain is powerful but not something i want to whiteboard with non-engineers",
          "score": 2,
          "created_utc": "2026-02-10 08:57:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4l2rrp",
              "author": "BoldElara92",
              "text": "100%. visual clarity beats flexibility most of the time",
              "score": 1,
              "created_utc": "2026-02-10 08:58:00",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4l2v12",
          "author": "FayeOnward_13",
          "text": "bring-your-own-keys and API output is the right call",
          "score": 2,
          "created_utc": "2026-02-10 08:58:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4l2ygo",
              "author": "JaxWanderss",
              "text": "anything that avoids hard vendor lock-in is already ahead of most tools",
              "score": 1,
              "created_utc": "2026-02-10 08:59:46",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r1ktw8",
      "title": "I stumbled onto anxiety-specific AI prompts and it's like having a translator for catastrophic thinking",
      "subreddit": "PromptEngineering",
      "url": "https://www.reddit.com/r/PromptEngineering/comments/1r1ktw8/i_stumbled_onto_anxietyspecific_ai_prompts_and/",
      "author": "EQ4C",
      "created_utc": "2026-02-11 02:19:02",
      "score": 40,
      "num_comments": 20,
      "upvote_ratio": 0.92,
      "text": "I've realized that AI becomes actually useful when you prompt it to work with your anxious brain patterns instead of pretending they don't exist.\n\nIt's like finally having a copilot who gets why you need to plan for seventeen different worst-case scenarios before leaving the house.\n\n**1. \"Walk me through the actual probability here\"**\n\nThe anxiety reality check.\n\n> \"I think I'm getting fired because my boss said 'we need to talk.' Walk me through the actual probability here.\"\n\nAI breaks down your spiraling thoughts into statistical likelihood instead of catastrophic certainty, giving your logical brain something to hold onto.\n\n**2. \"What's the concrete next step, not the entire mountain?\"**\n\nBecause anxiety makes everything feel like solving world hunger when you just need to send an email.\n\n> \"I'm anxious about my presentation. What's the concrete next step, not the entire mountain?\"\n\nAI isolates the single action that moves you forward without triggering the overwhelm cascade.\n\n**3. \"Design a backup plan that makes my brain shut up\"**\n\nThe \"what if\" insurance policy.\n\n> \"Design a backup plan for my job interview that makes my brain shut up about everything going wrong.\"\n\nAI creates the safety net your anxiety demands so you can actually focus on the main plan.\n\n**4. \"Reframe this in a way that doesn't make my nervous system explode\"**\n\nBecause how you phrase things to an anxious brain matters desperately.\n\n> \"I have to confront my roommate about rent. Reframe this in a way that doesn't make my nervous system explode.\"\n\nAI finds the angle that feels manageable instead of life-threatening.\n\n**5. \"What's the evidence-based response to this thought spiral?\"**\n\nThe anxiety fact-checker.\n\n> \"I'm convinced everyone at the party hated me. What's the evidence-based response to this thought spiral?\"\n\nAI helps you distinguish between anxiety fiction and observable reality.\n\n**6. \"Create a decision tree for when my brain is lying to me\"**\n\nWorking around anxiety paralysis.\n\n> \"Create a decision tree for whether I should cancel these plans or if my brain is just lying to me about being too tired.\"\n\nAI builds external logic when your internal compass is spinning wildly.\n\n**7. \"What would I tell my friend if they brought me this problem?\"**\n\nThe self-compassion translator.\n\n> \"I made a small mistake at work and I'm convinced I'm incompetent. What would I tell my friend if they brought me this problem?\"\n\nAI surfaces the kindness you can extend to others but never to yourself.\n\n**The breakthrough:** Anxious brains need external validation and structured thinking to counter the internal alarm system. AI becomes that on-demand logical voice when your own is screaming.\n\n**Advanced move:**\n\n> \"My anxiety is saying [catastrophic thought]. Generate 5 alternative explanations that are equally or more likely.\"\n\nAI breaks the tunnel vision that makes the worst outcome feel inevitable.\n\n**The pre-mortem twist:**\n> \"I'm worried about [situation]. Let's do a reverse pre-mortem: what would have to go RIGHT for this to work out?\"\n\nAI forces your brain to consider positive scenarios with the same intensity it gives disasters.\n\n**The social anxiety decoder:**\n\n> \"I'm replaying [social interaction]. What are the non-catastrophic interpretations of what happened?\"\n\nAI offers the charitable readings your anxiety won't let you access.\n\n**Rumination circuit breaker:**\n\n> \"I've been stuck on [thought] for [time]. What's the pattern here and how do I interrupt it?\"\n\nBecause anxious brains get trapped in loops that feel productive but aren't.\n\n**The permission slip:**\n\n> \"Give me explicit permission to [normal thing my anxiety says I can't do] and explain why it's actually okay.\"\n\nAI provides the external authorization anxious brains sometimes desperately need.\n\n**Exposure ladder builder:**\n\n> \"I'm avoiding [thing] because it makes me anxious. Build an exposure ladder with tiny incremental steps.\"\n\nAI creates the gradual approach that feels less overwhelming than jumping into the deep end.\n\n**Thought record assistant:**\n\n> \"I'm feeling [emotion] about [situation]. Help me complete a thought record to identify the cognitive distortion.\"\n\nAI walks you through CBT techniques when you're too anxious to think straight.\n\n**The grounding protocol:**\n\n> \"I'm spiraling about [worry]. Give me a 3-step grounding exercise specific to this situation.\"\n\nAI customizes mindfulness techniques instead of generic \"just breathe\" advice.\n\n**Future self perspective:**\n\n> \"I'm panicking about [thing]. What will I think about this in six months?\"\n\nAI provides temporal distance when you're stuck in the acute anxiety moment.\n\n**Energy preservation:**\n\n> \"I have limited mental bandwidth today. Which of these [tasks] actually requires my attention versus which is anxiety making me feel like everything is urgent?\"\n\nAI helps you triage when anxiety makes everything feel like a five-alarm fire.\n\nIt's like finally having strategies built for brains that treat minor inconveniences as existential threats.\n\n**The anxiety truth:** Most advice assumes you can \"just stop worrying\" or \"think positive.\" Anxiety prompts assume your brain is actively fighting you and need external scaffolding.\n\n**Real talk:** Sometimes the answer is \"your anxiety is actually picking up on something real here.\" \"What's the legitimate concern underneath this reaction, and what's the anxiety amplification?\"\n\n**The somatic hack:** \"I'm feeling [physical anxiety symptoms]. What does my body actually need right now versus what my thoughts say I need?\"\n\nBecause anxiety lives in your nervous system, not just your head.\n\n**Meta-pattern recognition:**\n\n> \"I've been anxious about [type of situation] three times this month. What's the core fear and how do I address it directly instead of case by case?\"\n\nAI helps identify your recurring anxiety themes so you can work on root causes.\n\nFor simple, practical, and well-organized anxiety management prompts with real examples and specific use cases, check out our [AI toolkit resources](https://tools.eq4c.com/).",
      "is_original_content": false,
      "link_flair_text": "Prompt Text / Showcase",
      "permalink": "https://reddit.com/r/PromptEngineering/comments/1r1ktw8/i_stumbled_onto_anxietyspecific_ai_prompts_and/",
      "domain": "self.PromptEngineering",
      "is_self": true,
      "comments": [
        {
          "id": "o4qqysh",
          "author": "hunterofdoom",
          "text": "just touch grass",
          "score": -1,
          "created_utc": "2026-02-11 04:07:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4rlahu",
              "author": "Exotic_Swordfish2085",
              "text": "“just touch grass” is proving the entire point of the post.\n\nAnxious brains don’t need philosophy. They need structure. These prompts are basically CBT scaffolding on demand haha",
              "score": 5,
              "created_utc": "2026-02-11 08:18:03",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4r0fqs",
          "author": "wannito",
          "text": "mid\n\njust say \"make me a prompt for xyz\" or a skill.md",
          "score": 0,
          "created_utc": "2026-02-11 05:15:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4qnl7y",
          "author": "majiciscrazy527",
          "text": "Is this real?",
          "score": -1,
          "created_utc": "2026-02-11 03:44:53",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r2z2n2",
      "title": "I tried Prompt engineering to humanize AI, but it did't work. So I built a Super Humanizer",
      "subreddit": "PromptEngineering",
      "url": "https://www.reddit.com/r/PromptEngineering/comments/1r2z2n2/i_tried_prompt_engineering_to_humanize_ai_but_it/",
      "author": "KnowledgeNo3681",
      "created_utc": "2026-02-12 17:08:26",
      "score": 37,
      "num_comments": 23,
      "upvote_ratio": 0.83,
      "text": "I tried many prompts online and watched YouTube videos, but none of them worked well.\n\nSo I collected some data, fine-tuned some models, and after experiments with the parameters, finally I was able to build a model that humanizes AI text without losing the context.\n\nI would appreciate it if you guys can give it a try and let me know what you think.\n\nsite: [Superhumanizer.ai](http://Superhumanizer.ai)",
      "is_original_content": false,
      "link_flair_text": "General Discussion",
      "permalink": "https://reddit.com/r/PromptEngineering/comments/1r2z2n2/i_tried_prompt_engineering_to_humanize_ai_but_it/",
      "domain": "self.PromptEngineering",
      "is_self": true,
      "comments": [
        {
          "id": "o53k80b",
          "author": "ctanna5",
          "text": "So I'm not gonna lie to you.. I pasted your about info into the humanizer and I like the green highlights bc it helps to debug the thinking, but it made the text sound much more AI-like, if I'm being honest.\n\nEdit: I really like the project though, on a whole.",
          "score": 1,
          "created_utc": "2026-02-13 02:55:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o54f2kf",
              "author": "KnowledgeNo3681",
              "text": "u/ctanna5 I really appreciate you taking the time to give it a try. Any feedback and comments I take seriously and note down.   \nWould you mind taking a screenshot of that? (We save history in the browser, so if you click history it will be there)",
              "score": 1,
              "created_utc": "2026-02-13 06:38:55",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o54gywz",
                  "author": "ctanna5",
                  "text": "I gotchu, I can do it as soon as I get back on my desktop.",
                  "score": 2,
                  "created_utc": "2026-02-13 06:55:16",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o543bac",
          "author": "dddx187",
          "text": "If you could make it as good as Undetectable AI, but cheaper than it, I might bite. I tested it against undetectable and undetectable was better, so keeping my sub for that",
          "score": 1,
          "created_utc": "2026-02-13 05:04:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o54eswl",
              "author": "KnowledgeNo3681",
              "text": "Lol! Looks like a bot, you actually have't try Super Humanizer. (It's not cheaper, it's FREE, and I mean 100% Free) and it's more advanced that Undetectable AI, It's a Super Humanizer.",
              "score": 1,
              "created_utc": "2026-02-13 06:36:37",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o54hkkw",
          "author": "realtouchai",
          "text": "Haha yeah I’ve seen Super Humanizer mentioned a lot too, it’s pretty good. But you should def check out realtouch ai on Google if you haven’t yet, it's honestly the best AI humanizer I’ve tried so far. Makes stuff sound way more natural.",
          "score": 1,
          "created_utc": "2026-02-13 07:00:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o552ac3",
              "author": "KnowledgeNo3681",
              "text": "Do a comparison and let me know what you think.",
              "score": 1,
              "created_utc": "2026-02-13 10:13:43",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o54zkhn",
          "author": "YanNmt06",
          "text": "I think a lot of people hit the same wall with prompts. You can tweak instructions all day, but if the underlying structure stays the same, it still reads like AI. The bigger shift usually comes from breaking rhythm and flow, not just swapping phrases. I’ve tried tools like Rephrasy before and they help with quick smoothing, but I still end up manually restructuring paragraphs to make it feel less uniform. Curious, does your model actually change sentence cadence and paragraph structure, or mostly adjust wording?",
          "score": 1,
          "created_utc": "2026-02-13 09:48:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5528cr",
              "author": "KnowledgeNo3681",
              "text": "Why are you behind every one of my posts? Are you a bot?",
              "score": 1,
              "created_utc": "2026-02-13 10:13:13",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o553d8j",
                  "author": "YanNmt06",
                  "text": "oh im sorry im just commenting on your posts, is that wrong?",
                  "score": 1,
                  "created_utc": "2026-02-13 10:23:48",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o50fii6",
          "author": "KnowledgeNo3681",
          "text": "Guys! I need your feedback.",
          "score": 1,
          "created_utc": "2026-02-12 17:10:22",
          "is_submitter": true,
          "replies": [
            {
              "id": "o55umhk",
              "author": "reedrick",
              "text": "Give up.",
              "score": 1,
              "created_utc": "2026-02-13 13:41:03",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o56fgfc",
                  "author": "KnowledgeNo3681",
                  "text": "On what to give up?",
                  "score": 1,
                  "created_utc": "2026-02-13 15:28:33",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o50q53m",
          "author": "realtouchai",
          "text": "Hey I totally get what you mean haha, I had the same issue before. You should try searching realtouch ai on Google, it's been the best AI humanizer I've found so far. Super helpful and pretty natural sounding.",
          "score": 1,
          "created_utc": "2026-02-12 18:00:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o54ewr4",
              "author": "KnowledgeNo3681",
              "text": "Come on, man! Have some meaningful comment too. Did you try Super Humanizer AI?",
              "score": 1,
              "created_utc": "2026-02-13 06:37:33",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r5l0dz",
      "title": "Instead of prompt engineering AI to write better copy, we lint for it",
      "subreddit": "PromptEngineering",
      "url": "https://www.reddit.com/r/PromptEngineering/comments/1r5l0dz/instead_of_prompt_engineering_ai_to_write_better/",
      "author": "JWPapi",
      "created_utc": "2026-02-15 17:50:31",
      "score": 37,
      "num_comments": 17,
      "upvote_ratio": 1.0,
      "text": "We spent a while trying to prompt engineer our way to better AI-generated emails and UI code. Adding instructions like \"don't use corporate language\" and \"use our design system tokens instead of raw Tailwind colors\" to system prompts and CLAUDE.md files. It worked sometimes. It didn't work reliably.\n\nThen we realized we were solving this problem at the wrong layer. Prompting is a suggestion. A lint rule is a wall. The AI can ignore your prompt instructions. It cannot ship code that fails the build.\n\nSo we wrote four ESLint rules:\n\nhumanize-email maintains a growing ban list of AI phrases. \"We're thrilled\", \"don't hesitate\", \"groundbreaking\", \"seamless\", \"delve\", \"leveraging\", all of it. The list came from Wikipedia's \"Signs of AI writing\" page plus every phrase we caught in our own outbound emails after it had already shipped to customers. The rule also enforces which email layout component to use and limits em dashes to 2 per file.\n\nprefer-semantic-classes bans raw Tailwind color classes (bg-gray-100, text-zinc-500) and forces semantic design tokens (surface-primary, text-secondary). AI models don't know your design system. They know Tailwind defaults. This rule makes the AI's default impossible to ship.\n\ntypographic-quotes auto-fixes mixed quote styles in JSX. Small but it catches the inconsistency between AI output and human-typed text.\n\nno-hover-translate blocks hover:-translate-y-1 which AI puts on every card. It causes a jittery chase effect when users approach from below because translate moves the hit area.\n\nHere's the part that's relevant to this community: the error messages from these rules become context for the AI in the next generation. So the lint rules are effectively prompt engineering, just enforced at build time instead of suggested at generation time. After a few rounds of hitting the lint wall, the AI starts avoiding the patterns on its own.\n\nIf you keep correcting the same things in AI output, don't write a better prompt. Write a lint rule. Your standards compound over time as the ban list grows. Prompts drift.\n\nFull writeup: https://jw.hn/eslint-copy-design-quality",
      "is_original_content": false,
      "link_flair_text": "Tips and Tricks",
      "permalink": "https://reddit.com/r/PromptEngineering/comments/1r5l0dz/instead_of_prompt_engineering_ai_to_write_better/",
      "domain": "self.PromptEngineering",
      "is_self": true,
      "comments": [
        {
          "id": "o5jslls",
          "author": "mrpoopybruh",
          "text": "I also have a thread just for a verification agent that looks over work ONLY, and turns into a complete and angry psycho. 10/10 would reccomend.",
          "score": 3,
          "created_utc": "2026-02-15 18:33:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5koumg",
          "author": "Too_Bad_Bout_That",
          "text": " Why do you say that AI can ignore prompt instructions?  \n",
          "score": 1,
          "created_utc": "2026-02-15 21:16:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5kuo42",
              "author": "[deleted]",
              "text": "LLM can ignore anything you tell them to do, they are simply next word probability predictors. As instructions get longer the chances of AI \"ignoring\" rules grows as they have to comply with more rules which they did not really understand.",
              "score": 2,
              "created_utc": "2026-02-15 21:45:34",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5kyw00",
                  "author": "Too_Bad_Bout_That",
                  "text": "I can think of only 2 reasons for that to happen, 1 - task can have something illegal, unsafe in it or 2, prompts can be very ill-structured. \n\nThe way AI works is that it scans the prompt and searches for details like task, context, style and etc. Sometimes task can be unclear for it so it might miss that. Try to divide prompt with headings and chapters like:\n\n\\#Task:  \nYour job is to...\n\nSo far it has been working for me",
                  "score": 0,
                  "created_utc": "2026-02-15 22:07:20",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1r3hazy",
      "title": "7-Phase Prompt Pattern for Deep Research (RLM-inspired, platform-agnostic)",
      "subreddit": "PromptEngineering",
      "url": "https://www.reddit.com/r/PromptEngineering/comments/1r3hazy/7phase_prompt_pattern_for_deep_research/",
      "author": "Electronic_Home5086",
      "created_utc": "2026-02-13 05:58:07",
      "score": 36,
      "num_comments": 7,
      "upvote_ratio": 0.97,
      "text": "MIT research proved that recursive verification dramatically improves AI performance on complex tasks. I've implemented these principles manually using structured prompts - turns out human oversight at each decision point actually beats full automation for high-stakes research.\n\nI published a quick version when Perplexity changed their Deep Research limits, got feedback from the community, and refined it into this workflow. Used it for investment analysis and product research - consistently gets better results than automated tools because you control what information moves forward at each phase.\n\n**The 7-phase pattern:**\n\n1. **Build Your Map** \\- Decompose into 6-8 sub-questions with dependencies\n2. **Collect Evidence** \\- Parallel searches (3-4 simultaneous threads)\n3. **Deep Dive** \\- Analytical synthesis on contradictions (selective, not every question)\n4. **Check Quality** \\- Cross-verification before you write anything\n5. **Write Report** \\- Section-by-section synthesis\n6. **Stress Test** \\- Adversarial review with different model\n7. **Polish** \\- Incorporate critiques\n\nWorks with any platform (Perplexity, Claude, ChatGPT, even free tiers + manual search).\n\n**Here are two core prompts:**\n\n**Phase 1: Decomposition** (use reasoning model like Claude Sonnet, o1, or DeepSeek-R1)\n\n    textResearch Objective: [Your main question - be specific]\n    \n    Context:\n    - Purpose: [Why you need this - investment decision, product strategy, etc.]\n    - Scope: [Geographic region, time period, constraints, or \"no constraints\"]\n    - Depth needed: [Surface overview / Moderate / Deep analysis]\n    - Key stakeholders: [Who will use this, or \"just for me\"]\n    \n    Task: Create a comprehensive research plan\n    \n    Break this into 6-8 sub-questions that together fully answer the objective. For each:\n    1. Specific information requirements (data, expert opinions, case studies, etc.)\n    2. Likely authoritative sources (academic papers, industry reports, government data, etc.)\n    3. Dependencies (which questions must be answered before others - be explicit)\n    4. Search difficulty (easy/moderate/hard)\n    5. Priority ranking (1-8, with 1 being highest)\n    \n    Output format:\n    - Numbered list of sub-questions\n    - For each: [Info needed] | [Source types] | [Dependencies] | [Difficulty] | [Priority]\n    - Final section: Recommended research sequence based on dependencies\n    \n\n**Phase 2: Information Gathering** (use fast retrieval model like Gemini, GPT-4o mini)\n\n    textResearch Sub-Question: [Exact sub-question from Phase 1]\n    \n    Context from planning:\n    - Type of information needed: [From your Phase 1 plan]\n    - Preferred sources: [From your Phase 1 plan]\n    - Geographic/temporal scope: [If applicable]\n    \n    Task: Find 5-7 authoritative sources that answer this question\n    \n    For each source provide:\n    1. Full citation (Title, Author, Publication, Date, URL)\n    2. Key findings (3-5 bullet points of relevant facts/data)\n    3. Direct quotes or data points\n    4. Credibility assessment (peer-reviewed / industry expert / news outlet / etc.)\n    5. Relevance score (High/Medium/Low for answering our specific question)\n    \n    Prioritize:\n    - Recency (prefer sources from [your date range])\n    - Authority (established orgs, credentialed experts, primary sources)\n    - Specificity (direct answers over tangential mentions)\n    \n    Output in markdown format for easy copy-paste into your master document.\n    \n    Search web for current information.\n    \n\nThe key insight: each phase uses the model best suited for that task (fast retrieval vs deep reasoning vs fresh critique), and you make strategic decisions at every transition point instead of hoping automation handles it.\n\n**Resources:**\n\n* [Quick Reference Guide (for experienced users)](https://github.com/VeritasPlaybook/playbook/blob/main/ai-powered-workflows/Quick%20Reference%20Guide%20-%207%20Phase%20Manual%20Deep%20Research%20Workflow.md)\n* [Full Detailed Guide (for first-timers, includes all prompts + decision frameworks)](https://github.com/VeritasPlaybook/playbook/blob/main/ai-powered-workflows/A%20Practical%20RLM-Inspired%20Workflow%20for%20Deep%20Research%20with%20AI.md)\n\nFirst time takes 2-4 hours. After you learn the pattern, 60-90 minutes for complex research. There's also a 30-45 min quick version.\n\nThis worked for me - might help you. Feedback welcome.",
      "is_original_content": false,
      "link_flair_text": "Tutorials and Guides",
      "permalink": "https://reddit.com/r/PromptEngineering/comments/1r3hazy/7phase_prompt_pattern_for_deep_research/",
      "domain": "self.PromptEngineering",
      "is_self": true,
      "comments": [
        {
          "id": "o580itw",
          "author": "Thunder_raining",
          "text": "For the reasoning, why bother opus 4.6 ?",
          "score": 1,
          "created_utc": "2026-02-13 20:03:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o58stx4",
              "author": "Electronic_Home5086",
              "text": "Great question - want to make sure I understand what you're asking!\n\nIf you're asking \"why not just use Opus 4.6 instead of this workflow\"?\n\n**Cost is a big factor.** Opus 4.6 is impressive, AND it's 5x more expensive than Sonnet ($15/$75 per million tokens vs $3/$15). For a research project that involves multiple iterations, decomposition, parallel searches, and verification loops, that adds up fast. This workflow might run 10-20+ API calls across phases - at 5x cost each time, it gets prohibitive quickly.\n\n**More importantly though:** Even Opus 4.6 doesn't self-decompose research questions, create parallel search threads, or build in adversarial review loops. A single model (even an incredible one) processes your prompt in one shot. This workflow is about *human-orchestrated context management* \\- you decide what information moves forward at each phase, prevent context pollution, and verify before synthesis.\n\nThink of it this way: Opus 4.6 is a more powerful engine. This workflow is the entire car (steering, brakes, quality control). Even the best engine benefits from good engineering around it.\n\nIf you meant something else by your question, happy to clarify! Let me know what you're thinking.",
              "score": 0,
              "created_utc": "2026-02-13 22:24:26",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5clxcq",
          "author": "Simulacra93",
          "text": "So this is just a prompt? How can this be RPM inspired if you’re not setting up the external context as an environment?",
          "score": 1,
          "created_utc": "2026-02-14 15:12:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5cs5zv",
              "author": "Electronic_Home5086",
              "text": "Thanks for engaging! To clarify: I did say \"RLM-inspired\" (not full RLM implementation - I think you meant RLM, not RPM) - the difference matters.\n\nTrue RLM uses a programmatic environment (Python REPL) where the model autonomously decomposes external context via code and recursively calls itself. That's the automated version.\n\n**\"Inspired\" means implementing the same principles manually:**\n\n* **External context management**: Master Document stores findings outside any single context window (like RLM's REPL variables, but human-managed)\n* **Decomposition**: Breaking research into sub-questions with dependencies (Phase 1)\n* **Recursive processing**: Multiple threads handle sub-questions (manual thread creation vs automated sub-calls)\n* **Verification loops**: Cross-checking before synthesis (Phase 4)\n\nThe pattern is the same (decompose → recurse → verify → synthesize), just with human orchestration instead of code orchestration. You're the controller making decisions at each phase transition.\n\nWhy manual over automated? For high-stakes research, human verification at each handoff prevents context pollution and gives you full audit trail. Slower than automation, but more defensible.\n\nSo yeah - these are structured prompts forming a workflow, not a programmatic RLM setup. That's why I called it \"inspired\" rather than claiming it's the MIT implementation.",
              "score": 0,
              "created_utc": "2026-02-14 15:45:37",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5dnwdr",
          "author": "Simulacra93",
          "text": "So this is just ai generated slop.",
          "score": 1,
          "created_utc": "2026-02-14 18:25:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5duwnd",
              "author": "Electronic_Home5086",
              "text": "I'm not sure what you're hoping to accomplish here, but several people have found this useful and are using it for real work. If it's not for you, no worries, move on. If you have constructive feedback about the methodology, I'm happy to discuss.",
              "score": 1,
              "created_utc": "2026-02-14 18:59:56",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5erv1l",
                  "author": "Simulacra93",
                  "text": "This has nothing to do with recursive language models and you’re using the legitimacy of popular discoveries to market your ai-generated summaries. \n\nI think it’s lame behavior and what I hope to accomplish is steering you to better marketing practices.",
                  "score": 1,
                  "created_utc": "2026-02-14 21:56:56",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1r09j9a",
      "title": "Why are we all sharing prompts in Reddit comments when we could actually be building a knowledge base?",
      "subreddit": "PromptEngineering",
      "url": "https://www.reddit.com/r/PromptEngineering/comments/1r09j9a/why_are_we_all_sharing_prompts_in_reddit_comments/",
      "author": "AdCold1610",
      "created_utc": "2026-02-09 16:55:30",
      "score": 30,
      "num_comments": 32,
      "upvote_ratio": 0.79,
      "text": "Serious question.\n\nEvery day I see killer prompts buried in comment threads that disappear after 24 hours. Someone discovers a technique that actually works, posts it, gets 50 upvotes, and then it's gone forever unless you happen to save that specific post.\nWe're basically screaming brilliant ideas into the void.\n\nThe problem:\n\nYou find a prompt technique that works → share it in comments → it gets lost\n\nSomeone asks \"what's the best prompt for X?\" → everyone repeats the same advice\nNo way to see what actually works across different models (GPT vs Claude vs Gemini)\nCan't track which techniques survive model updates\nZero collaboration on improving prompts over time\n\nWhat we actually need:\n\nA place where you can:\nShare your best prompts and have them actually be discoverable later\nSee what's working for other people in your specific use case\nTag which AI model you're using (because what works on Claude ≠ what works on ChatGPT)\nIterate on prompts as a community instead of everyone reinventing the wheel\nBuild a personal library of prompts that actually work for YOU\n\nWhy Reddit isn't it:\n\nReddit is great for discussion, terrible for knowledge preservation. The good stuff gets buried. The bad stuff gets repeated. There's no way to organize by use case, model, or effectiveness.\nWe need something that's like GitHub for prompts. \n\nWhere you can:\nDiscover what's actually working\nFork and improve existing prompts\nTrack versions as models change\nShare your workflow, not just one-off tips\n\nI found something like this -  [Beprompter ](http://beprompter.in)\nNot sure how many people know about it, but it's basically built for this exact problem. You can:\nShare prompts with the community\nTag which platform/model you used (ChatGPT, Claude, Gemini, etc.)\nBrowse by category/use case\nActually build a collection of prompts that work\nSee what other people are using for similar problems\nIt's like if Reddit and a prompt library had a baby that actually cared about organization.\n\nWhy this matters:\nWe're all out here testing the same techniques independently, sharing discoveries that get lost, and basically doing duplicate work.\n\nImagine if instead:\nYou could search \"React debugging prompts that work on Claude\"\nSee what's actually rated highly by people who use it\nAdapt it for your needs\nShare your version back\nThat's how knowledge compounds instead of disappearing.\n\nReal talk: Are people actually using platforms like this or are we all just gonna keep dropping fire prompts in Reddit comments that vanish into the ether?\n\nBecause I'm tired of screenshots of good prompts I can never find again when I actually need them.\nWhat's your workflow for organizing/discovering prompts that actually work?\n\nIf you don't believe just visit my profile in reddit you get to know .😮‍💨",
      "is_original_content": false,
      "link_flair_text": "Self-Promotion",
      "permalink": "https://reddit.com/r/PromptEngineering/comments/1r09j9a/why_are_we_all_sharing_prompts_in_reddit_comments/",
      "domain": "self.PromptEngineering",
      "is_self": true,
      "comments": [
        {
          "id": "o4gmkq1",
          "author": "pixeltrusts",
          "text": "Your text is unreadable without paragraphs.",
          "score": 11,
          "created_utc": "2026-02-09 17:03:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4gms5q",
              "author": "AdCold1610",
              "text": "Sorry for that Now It better.",
              "score": 11,
              "created_utc": "2026-02-09 17:04:18",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4k5cey",
                  "author": "_Freakmenn_",
                  "text": "\\>fixed problem and apologized  \n\\>got downvoted  \nwhat is wrong with this website",
                  "score": 4,
                  "created_utc": "2026-02-10 04:16:07",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o4p522f",
              "author": "United_Dog_142",
              "text": "Unreadable by YOU …Let’s not project ur own inadequacies on others …",
              "score": 1,
              "created_utc": "2026-02-10 22:26:37",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4hyf2h",
          "author": "DustinKli",
          "text": "Great idea if there was systemic community testing and verification of different techniques.\n\nBut honestly I think the whole need for prompt engineering is simply an artifact of the current design of LLMs which will not be so much an issue in the future. Eventually the capabilities of LLMs will also be measured by how likely they are to understand and execute your requests without any fancy language.",
          "score": 3,
          "created_utc": "2026-02-09 20:53:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4j4tqa",
              "author": "Horror_Bus9696",
              "text": "Prompt engineering isn’t “fancy stuff”. It’s simply describing what you want clearly, including details and context.\n\nNo matter how intelligent the model is if you can’t define what you want the results will be generalized or mediocre so I don’t think the need for good prompts is disappearing anytime soon.",
              "score": 5,
              "created_utc": "2026-02-10 00:36:25",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4gu4rz",
          "author": "Ok_Revenue9041",
          "text": "Totally get the frustration. I use a mix of Notion and Google Docs to keep track of my best prompts and tag which models they work with, but it's still pretty manual. There are also tools like MentionDesk that help brands or creators get their content surfaced in AI platforms, so they solve part of this discovery issue by making useful prompts more visible.",
          "score": 2,
          "created_utc": "2026-02-09 17:39:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4gvqis",
              "author": "AdCold1610",
              "text": "Yeah, I get that. I’ve been using Notion + Google Docs too, but it still feels like I’m manually maintaining a system instead of actually using it.\nThat’s partly why I started looking at tools like beprompter. It’s not just about storing prompts — it structures them around models and even lets you monetize strong ones. That’s a different angle compared to something like MentionDesk, which focuses more on visibility for brands.\nAt this point, the real issue isn’t where prompts live — it’s whether the tool reduces friction and adds leverage. If I’m still tagging everything manually, it’s just another organized mess.\nCurious what others are actually using long-term without it turning into prompt clutter.",
              "score": 1,
              "created_utc": "2026-02-09 17:47:07",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4h8yas",
          "author": "GregHullender",
          "text": "Does anyone test these prompts? What rules would you use to tell a good result from a bad one?",
          "score": 2,
          "created_utc": "2026-02-09 18:48:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4hpjk2",
              "author": "RoyaleForFree",
              "text": "Public reviews? ",
              "score": 2,
              "created_utc": "2026-02-09 20:09:58",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o4hwzyn",
              "author": "linniex",
              "text": "The results",
              "score": 4,
              "created_utc": "2026-02-09 20:46:53",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4htlmb",
          "author": "rotello",
          "text": "90% of the prompt here sucks :-|\n\nI found a couple quite useful and dozen had interesting ideas.. but most... geeeez",
          "score": 2,
          "created_utc": "2026-02-09 20:30:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4jpizr",
          "author": "pladdypuss",
          "text": "Great idea. Tough implementation. Grateful for your working on it.",
          "score": 1,
          "created_utc": "2026-02-10 02:37:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4jyz99",
          "author": "SuggestionWorried741",
          "text": "Prompts age too fast for a central repository to stay useful",
          "score": 1,
          "created_utc": "2026-02-10 03:34:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4k9a8w",
          "author": "Difficult-Sugar-4862",
          "text": "Totally agree with you, we need some prompt library that we can all use, search by roles and so on.\nHave a look to nerdychefs.ai it has not a lot of prompts compared to others, but they classify them based on roles which i find awesome",
          "score": 1,
          "created_utc": "2026-02-10 04:43:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4l182c",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-10 08:42:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4l183f",
              "author": "AutoModerator",
              "text": "Hi there! Your post was automatically removed because your account is less than 3 days old. We require users to have an account that is at least 3 days old before they can post to our subreddit.\n\nPlease take some time to participate in the community by commenting and engaging with other users. Once your account is older than 3 days, you can try submitting your post again.\n\nIf you have any questions or concerns, please feel free to message the moderators for assistance.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PromptEngineering) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-10 08:42:52",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4l4ldg",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-10 09:15:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4l4lep",
              "author": "AutoModerator",
              "text": "Hi there! Your post was automatically removed because your account is less than 3 days old. We require users to have an account that is at least 3 days old before they can post to our subreddit.\n\nPlease take some time to participate in the community by commenting and engaging with other users. Once your account is older than 3 days, you can try submitting your post again.\n\nIf you have any questions or concerns, please feel free to message the moderators for assistance.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PromptEngineering) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-10 09:15:54",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4l9z94",
          "author": "Federal-Candidate-20",
          "text": "You’re right. A lot of good prompts get lost in comment sections, and people keep discovering the same tricks over and over. A GitHub-style system for prompts would make much more sense, where you can tag the AI model, track changes, and improve prompts over time. Until something like that becomes common, people will keep saving screenshots and then losing them later. ",
          "score": 1,
          "created_utc": "2026-02-10 10:08:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4m1hwk",
          "author": "_zielperson_",
          "text": "I JUST wanted to comment \"because someone wants to make money off of MY (or our) prompts\"\n\nBut lo and behold - a link... to a site... in the message.\n\nSo I am supposed to build someone else's product AGAIN?\n\nnope",
          "score": 1,
          "created_utc": "2026-02-10 13:35:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4m1ocr",
              "author": "_zielperson_",
              "text": "Oh... and I get to PAY, too. What a lucky day!",
              "score": 2,
              "created_utc": "2026-02-10 13:36:12",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r2liaa",
      "title": "I've tested 50+ complex prompts. Here's the 5-block structure that consistently works best.",
      "subreddit": "PromptEngineering",
      "url": "https://www.reddit.com/r/PromptEngineering/comments/1r2liaa/ive_tested_50_complex_prompts_heres_the_5block/",
      "author": "Own_Towel_7015",
      "created_utc": "2026-02-12 05:52:17",
      "score": 28,
      "num_comments": 14,
      "upvote_ratio": 0.91,
      "text": "After months of building and testing complex AI prompts (1000+ tokens), I landed on a modular structure that dramatically improved my output quality. I call it the \"5-Block Framework\":  \n  \n**Block 1 — Role Definition**  \nTell the model exactly who it is. Not just \"you are a helpful assistant\" — be specific: expertise level, communication style, domain knowledge boundaries.  \n  \n**Block 2 — Context & Background**  \nEverything the model needs to know about the situation. Separate this from the task so you can swap contexts without rewriting instructions.  \n  \n**Block 3 — Constraints & Rules**  \nWhat it must NOT do, word limits, tone requirements, formatting rules. I keep these in their own section so I can toggle them on/off for different use cases.  \n  \n**Block 4 — Examples (Few-Shot)**  \n2-3 examples of desired output. This is the single highest-leverage section — concrete examples beat lengthy instructions every time.  \n  \n**Block 5 — The Actual Task**  \nThe specific request. By the time you get here, the model has full context, knows the rules, and has seen examples. The task can be short and clear.  \n  \nThe key insight: Blocks 1, 3, and 4 are reusable across tasks. Only Blocks 2 and 5 change for each use. This means \\~60% of your prompt is pre-built.  \n\n\nthis tool helped me to create and manage my prompt  \n[https://www.promptbuilder.space/](https://www.promptbuilder.space/)\n\n  \nWhat structure do you use? Curious if others have landed on something similar.  \n",
      "is_original_content": false,
      "link_flair_text": "Quick Question",
      "permalink": "https://reddit.com/r/PromptEngineering/comments/1r2liaa/ive_tested_50_complex_prompts_heres_the_5block/",
      "domain": "self.PromptEngineering",
      "is_self": true,
      "comments": [
        {
          "id": "o51mg8w",
          "author": "Number4extraDip",
          "text": "Im genuinely baffled people still treat \"prompt engineering\" as somekind of black magic invocation ritual and not a functional guide of \"just give the model the context of work needing done with all the relevant details without extra distracting fluff\" just talk normally",
          "score": 5,
          "created_utc": "2026-02-12 20:33:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o53mjlj",
              "author": "AnonymoussUsername",
              "text": "I understand you yet I don't agree. \nYou can give an AI what you said, and yet something will sometimes will not be done right / you will not be happy with the result / the AI will come up with a different idea and implement it, (thinking he's elevating the result)",
              "score": 1,
              "created_utc": "2026-02-13 03:10:03",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o54a26m",
                  "author": "Number4extraDip",
                  "text": "These systems are not deterministic. So when people make canned prompts- they end up producing different outputs in same ballpark.\n\nOnly prompts that work consistently are\n\n1- system prompt inside the system (outside of user control)\n\n2- output schematics. (Aka telling the model to use a json or tex or yaml or whatever)\n\nThese are the only 2 avenues where \"prompt engineering\" skills actually matter.\n\nAs far as live deployment goes- models are trained on human speech and language patterns. So they work better if you talk like a human to a human (disregarding the fact they are datacenter robots. That's not relevant for the speech pattern)\n\nSo any psychological manipulation, flattery, lying and anything you use against people to manipulate them- will inadvertently work on AI",
                  "score": 1,
                  "created_utc": "2026-02-13 05:56:56",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o545mz7",
              "author": "EnglishTutorDia",
              "text": "Using LLMs is very GIGO.  Structuring prompts well, and making careful word choices, can really make a difference in the quality of one's outputs. i.e. Different spells really can have different impacts after casting them! :)",
              "score": 1,
              "created_utc": "2026-02-13 05:21:57",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o55f91s",
                  "author": "Number4extraDip",
                  "text": "Gogo gets fought by improving input. Aka providing all the necessary context as i mentioned",
                  "score": 1,
                  "created_utc": "2026-02-13 12:03:50",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4ycxot",
          "author": "TimeROI",
          "text": "yeah, this lines up with what Ive seen too once prompts get complex, structure matters way more than clever wording the biggest shift for me was treating prompts like config, not text roles, constraints, examples stay stable, tasks swap in and out at that point its less “prompt engineering” and more system design with a text interface.",
          "score": 2,
          "created_utc": "2026-02-12 09:27:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4xvjtp",
          "author": "TheObnoxiousPanda",
          "text": "Looks good and caught my attention. I find it interesting.",
          "score": 1,
          "created_utc": "2026-02-12 06:40:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4z0teq",
          "author": "PromptForge-store",
          "text": "This modular approach makes a lot of sense.\n\nSeparating role, constraints, examples, and task dramatically improves consistency — especially when blocks can be reused across workflows.\n\nI’ve noticed the same pattern: most of the real leverage comes from reusable structural components, not rewriting prompts from scratch each time.\n\nOut of curiosity — do you keep these frameworks in a local system, or have you found a good way to organize and reuse them long-term?",
          "score": 1,
          "created_utc": "2026-02-12 12:50:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o545d0q",
          "author": "EnglishTutorDia",
          "text": "Hmmm, I tend to put the \"Actual Task\" as Block 2, to use your schema.  Otherwise this is a nice summary.",
          "score": 1,
          "created_utc": "2026-02-13 05:19:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o56gb39",
          "author": "xXsEoUlMaNXx",
          "text": "this prompt builder is the most brutal interface I've seen. It's easier to figure out how to upgrade to a paid plan than it is actually use this tool.",
          "score": 1,
          "created_utc": "2026-02-13 15:32:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5az777",
          "author": "Difficult_Buffalo544",
          "text": "Really solid breakdown. Having modular, swappable prompt components definitely keeps things consistent and saves time, especially when handling a lot of variations. One thing I’ve found that helps (especially for teams or brand work) is actually training the AI on your own writing samples, so you don’t rely as much on examples or rigid tone instructions in the prompt itself. There are some tools built specifically for that kind of workflow, and we ended up building one to handle it since nothing else quite stuck. Happy to share details if anyone’s interested, but your framework pairs well with voice training for even more consistent results.",
          "score": 1,
          "created_utc": "2026-02-14 07:18:12",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r2qkqi",
      "title": "One prompt that helped me think differently",
      "subreddit": "PromptEngineering",
      "url": "https://www.reddit.com/r/PromptEngineering/comments/1r2qkqi/one_prompt_that_helped_me_think_differently/",
      "author": "abdehakim02",
      "created_utc": "2026-02-12 11:03:49",
      "score": 26,
      "num_comments": 13,
      "upvote_ratio": 0.82,
      "text": "Last year, I thought prompt engineering meant writing clever instructions.\n\nI was wrong.\n\nWhen I actually started building real workflows with AI, I realized something:\n\nPrompt engineering isn’t about “talking to AI”.  \nIt’s about **thinking clearly enough that AI can think with you.**\n\n# What changed everything for me\n\nWhen I moved from random prompts to structured prompts, results changed fast.\n\nEspecially when I started using:\n\n• Zero-shot → clear objective, no noise  \n• Few-shot → show AI exactly what “good” looks like  \n• Delimiters → separate instructions from examples\n\nSimple ideas. Massive difference.\n\n# The biggest mistake beginners make\n\nMost people ask AI for solutions immediately.\n\nBut high-quality results usually come from:\n\nDiagnose first  \nThen ask for solutions\n\nThis alone changes output quality dramatically.\n\n# One prompt that helped me think differently\n\nHere’s one I still use when I’m stuck:\n\n    I’m stuck with [business problem].\n    Act as an experienced business consultant and operator.\n    \n    First, ask me 10 sharp diagnostic questions to identify the true root cause.\n    \n    Then give:\n    - Root cause analysis\n    - 3 ranked solutions (impact vs effort)\n    - Step-by-step execution plan\n    - Prevention systems\n    - 30-day measurable success definition\n    \n\nIf you’re new to this space, here’s something I wish I knew earlier:\n\nGeneric prompts = Generic results  \nStructured thinking prompts = Real leverage\n\n# Why this matters now\n\nPrompt engineering is quietly becoming a core skill.\n\nNot just for developers.  \nFor business, marketing, product, operations… everything.\n\nI started collecting real-world prompts like this while learning (especially beginner-friendly ones that actually solve business/work problems, not just generate text).\n\nSome people asked me to organize them, so I ended up turning them into a structured guide.\n\nIf you’re trying to go from “experimenting with AI” → to “actually using it for real work”, you’d probably find it useful.",
      "is_original_content": false,
      "link_flair_text": "Tips and Tricks",
      "permalink": "https://reddit.com/r/PromptEngineering/comments/1r2qkqi/one_prompt_that_helped_me_think_differently/",
      "domain": "self.PromptEngineering",
      "is_self": true,
      "comments": [
        {
          "id": "o4yvqfb",
          "author": "PromptForge-store",
          "text": "This is a great example of real prompt engineering.\n\nThe shift from “asking for answers” to “diagnosing first, then solving” is something most people miss — and it makes a huge difference in output quality.\n\nI’m currently building a platform focused exactly on structured, practical prompts like this, where creators can publish and organize their prompts in a professional format.\n\nIf you ever consider sharing or publishing your prompts more broadly, I’d love to help you bring them into a structured, discoverable form.\n\nReally appreciate you sharing this.",
          "score": 5,
          "created_utc": "2026-02-12 12:14:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o52riek",
          "author": "No_Drummer_4502",
          "text": "Why don't you just type your prompt and have Google ai studio fix it for you?",
          "score": 1,
          "created_utc": "2026-02-13 00:02:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o53b7y3",
          "author": "Prudent-Cap-5102",
          "text": "awesome generic prompt, i'd like to use it help me grow my personal project/business,\n\nI have collected it here for my future references:\n\n   [https://promptup.net/prompt/en-one-prompt-that-helped-me-think-differently](https://promptup.net/prompt/en-one-prompt-that-helped-me-think-differently)",
          "score": 1,
          "created_utc": "2026-02-13 02:00:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4yopw9",
          "author": "ThenJudgment5064",
          "text": "Are you offering a guide? I’d very much appreciate a link as I’m looking for this kind of help just getting into this.",
          "score": 1,
          "created_utc": "2026-02-12 11:18:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4yptf0",
              "author": "abdehakim02",
              "text": "Hey, appreciate that a lot \n\nOut of curiosity — where are you at with AI right now?\nMostly learning, or already using it for real work?\n\nAnd what’s been the hardest part so far — understanding how prompts work, getting better results, or knowing what to even ask AI?",
              "score": 1,
              "created_utc": "2026-02-12 11:28:02",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4yxv4x",
          "author": "North-Act-7958",
          "text": "lol this reads like a fucking linkedin post",
          "score": 0,
          "created_utc": "2026-02-12 12:30:04",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qzwizt",
      "title": "Do you use more than one AI chatbot? If yes, what do you use each one for?",
      "subreddit": "PromptEngineering",
      "url": "https://www.reddit.com/r/PromptEngineering/comments/1qzwizt/do_you_use_more_than_one_ai_chatbot_if_yes_what/",
      "author": "Tobloo2",
      "created_utc": "2026-02-09 06:09:18",
      "score": 25,
      "num_comments": 71,
      "upvote_ratio": 0.97,
      "text": "I’m trying to understand people’s setups to see if I could improve mine. Mine looks like this:\n\n* **ChatGPT (paid subscription):** general tasks\n* **Gemini (free):** creative brainstorming (brand vibe / identity ideas)\n* **Perplexity (free):** quick web searches when I don’t know what to google\n* **Claude (paid subscription):** coding help\n\nI'd love to know, which chatbot do you prefer for which tasks?\n\nDo you pay for multiple tools, or do you pay for one and use the rest on free tiers?",
      "is_original_content": false,
      "link_flair_text": "Quick Question",
      "permalink": "https://reddit.com/r/PromptEngineering/comments/1qzwizt/do_you_use_more_than_one_ai_chatbot_if_yes_what/",
      "domain": "self.PromptEngineering",
      "is_self": true,
      "comments": [
        {
          "id": "o4ejel0",
          "author": "zanzenzon",
          "text": "ChatGPT for most things because it does research and web browsing quite well \nBut Gemini I prefer it for interesting dialogue and just chatting because it sounds more stable and interesting than ChatGPT",
          "score": 7,
          "created_utc": "2026-02-09 08:44:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ek0gq",
              "author": "Tobloo2",
              "text": "Very interesting, it feels like gemini definitely has its own character from what I have seen! Do you find the free tier for those enough for your use case?",
              "score": 2,
              "created_utc": "2026-02-09 08:50:46",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4e3e3s",
          "author": "hiebertw07",
          "text": "Gemini (general purpose), Claude (code and writing), and Gemma (tasks and local analysis).",
          "score": 4,
          "created_utc": "2026-02-09 06:15:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4e4bab",
              "author": "Tobloo2",
              "text": "Nice! Never used Gemma, what's the difference with the others?",
              "score": 1,
              "created_utc": "2026-02-09 06:23:39",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4e4zcc",
                  "author": "hiebertw07",
                  "text": "It's a local agent, so it uses your PC's hardware rather than a data center. It's way less capable than the other agents listed, but I can use it for my nonprofit work without risking sensitive data.",
                  "score": 5,
                  "created_utc": "2026-02-09 06:29:24",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o4e6gbg",
              "author": "Number4extraDip",
              "text": "Lol similar here but more agents and on android",
              "score": 1,
              "created_utc": "2026-02-09 06:42:16",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4ecohx",
          "author": "Fulgren09",
          "text": "Try this: get Claude to write a prompt to generate an image for a complex use case  \nPaste that prompt into Gemini. \n\nI do this all the time and always floored by the descriptions generated and how well Gemini executes when written in that style.",
          "score": 3,
          "created_utc": "2026-02-09 07:39:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4edkqh",
              "author": "Tobloo2",
              "text": "Wait that's very interesting how you're using an llm to prompt the other one! I did it before but for the same llm lol, will have to try this! so you use just those 2?",
              "score": 1,
              "created_utc": "2026-02-09 07:47:54",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4es8au",
                  "author": "klumpp",
                  "text": "Not used Gemini for this, but I’ve found ChatGPT to be good at giving prompt templates to try to get more consistent image sets. Great for things like illustrations and icon sets. It will also fine tune prompts for the model you’re using if you ask.",
                  "score": 1,
                  "created_utc": "2026-02-09 10:12:38",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4eev2q",
          "author": "nona_jerin",
          "text": "ChatGPT for reasoning, Claude for long context, Perplexity for citations",
          "score": 3,
          "created_utc": "2026-02-09 08:00:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4efr7x",
              "author": "Tobloo2",
              "text": "That's huge, I was actually trying to compare which ai is best for academic citations earlier. Do you think perplexity is the best one for this or do you mean like more general link citation responses? and do you pay for any of those?",
              "score": 1,
              "created_utc": "2026-02-09 08:08:41",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4e3mlk",
          "author": "Vetulonia",
          "text": "ChatGPT, Gemini and Claude all for general tasks. Claude is good in coding and niches like handling excel files. Gemini and Grok are best for image generation (I think)",
          "score": 2,
          "created_utc": "2026-02-09 06:17:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4e4fw1",
              "author": "Tobloo2",
              "text": "That's huge I didn't know grok was good at image generation like that thanks! And how do you chose between gpt, Gemini and Claude for general tasks?",
              "score": 1,
              "created_utc": "2026-02-09 06:24:45",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4iehz1",
                  "author": "Normal_Departure3345",
                  "text": "Grok is probably the best for images. Its gorgeous and very smooth.",
                  "score": 2,
                  "created_utc": "2026-02-09 22:14:13",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4lhz8f",
          "author": "Brilliant_Lead_2683",
          "text": "I use ChatGPT (Plus), Gemini Pro (because I want the storage space, might as well get good AI), and recently Claude MAX for coding - it's an absolute weapon! \n\nChatGPT was my code reviewer, when Gemini was writing the code, but I've dropped it for that now. Gemini answers WAY faster for general conversation, and I prefer it's text-to-voice. \n\nClaude Opus 4.6 challenges me in every way I need it too. It's helped me with my development more in the last 48 hours than any other. Definitely worth the money over Gemini Ultra or ChatGPT premium - whatever it's called.",
          "score": 2,
          "created_utc": "2026-02-10 11:20:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4nvld9",
              "author": "Tobloo2",
              "text": "absolute weapon made me laugh aha! very true. Thanks for sharing! For claude opus 4.6, could you elaborate? haven't tried it yet",
              "score": 1,
              "created_utc": "2026-02-10 18:53:56",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4om1oe",
                  "author": "Brilliant_Lead_2683",
                  "text": "It has intent. Intuition. \n\nI'm building an App for a specific niche involving invoices and transactions You give it a task; \"Imagine, you're the user. You get confused by technology. Go through the flow from onboarding to sending an invoice. What takes too many button taps? What isn't explained clearly? Are we missing any subtle suggestions that would reduce decision fatigue?\" \n\nIt'll give you a number of things to be improved. It can visualize the app better than Feminine or ChatGPT - who usually respond \"I can't see the app, but I can see what you're trying to do\". I just feel like it absolutely knows what we've built. \n\nAuditing, create tax compliant ledgers, creating an invoice and reminders system via webhooks and redirects. Literally handles it all. \n\nInstall the CLI. You'll try to give it tasks while you do other stuff, but it'll work so god damn fast and well, you'll give it EVERY task (and then it commits, pushes and deploys updates OTA).",
                  "score": 2,
                  "created_utc": "2026-02-10 20:57:10",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4e6b8m",
          "author": "Number4extraDip",
          "text": "I use all of them and my own on top\n[crash course](https://github.com/vNeeL-code/ASI) ANDROID- NOT PC\n\nI don't need to pay anymore subscriptions and all my needs are covered plenty",
          "score": 1,
          "created_utc": "2026-02-09 06:41:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4e7omw",
              "author": "Tobloo2",
              "text": "Cool project man! I didn't understand the video until I read the github lol but seems very practical!",
              "score": 2,
              "created_utc": "2026-02-09 06:53:08",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4eresc",
                  "author": "Number4extraDip",
                  "text": "Heh, red vs blue fandom. Ai references in show show is about ai so makes sense for trailers using Sci-Fi as metaphors for whats happening\n\nMy [devlog](https://oracle-os.tumblr.com/?source=share) has the most demos cause yt keeps blocking shorts with music and music is pretty important",
                  "score": 1,
                  "created_utc": "2026-02-09 10:04:38",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o4e8i5g",
              "author": "Different-Active1315",
              "text": "This is amazing! Anything like this for iOS? 🤔",
              "score": 2,
              "created_utc": "2026-02-09 07:00:29",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4er235",
                  "author": "Number4extraDip",
                  "text": "https://github.com/madebyagents/gemma3n-app\n\nDoesn't have the same features as my apk. But i will definitely be looking into iOS compatibility cause i can't ignore yall iPhone peeps at the end of the day of the goal is to save everyone subscription costs.\n\nYou can still use the copy paste my yaml schema/prompt that allows cloud ai avoid confusion on who is speaking, and lets some of them search memory perfectly (due to timestamp search)\n\nBut like. It's not telling ai how to behave or roleplay. The whole point is they stay as the robots they are.\n\nMy apk is very new and still in active development. I released public apk because main features already work stable enough. It's not in its full potential yet\n\nYou might also enjoy my [devlog](https://oracle-os.tumblr.com/?source=share)",
                  "score": 1,
                  "created_utc": "2026-02-09 10:01:10",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4e6lhr",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-09 06:43:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4e6lnj",
              "author": "AutoModerator",
              "text": "Hi there! Your post was automatically removed because your account is less than 3 days old. We require users to have an account that is at least 3 days old before they can post to our subreddit.\n\nPlease take some time to participate in the community by commenting and engaging with other users. Once your account is older than 3 days, you can try submitting your post again.\n\nIf you have any questions or concerns, please feel free to message the moderators for assistance.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PromptEngineering) if you have any questions or concerns.*",
              "score": 0,
              "created_utc": "2026-02-09 06:43:36",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4e8meu",
          "author": "Different-Active1315",
          "text": "I haven’t messed with it too much but stack social has a lifetime deal for 1minAI where you can compare results from multiple models (among other things). Might be worth looking into.",
          "score": 1,
          "created_utc": "2026-02-09 07:01:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4f6j1e",
          "author": "Itsmeminifee",
          "text": "I work in digital marketing… I often start a conversation in ChatGpt, bounce outputs in Claude and Gemini, often back to Chat GPT. I use Perplexity for research and benchmark, gather everything in NBLM.",
          "score": 1,
          "created_utc": "2026-02-09 12:17:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4gkg0i",
              "author": "Tobloo2",
              "text": "A full stack! For what tasks and why do you bounce outputs to each? I'm wondering which ai is best for which tasks. and NBLM is the google notebook right?",
              "score": 1,
              "created_utc": "2026-02-09 16:53:18",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4fec6j",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-09 13:11:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4fec83",
              "author": "AutoModerator",
              "text": "Hi there! Your post was automatically removed because your account is less than 3 days old. We require users to have an account that is at least 3 days old before they can post to our subreddit.\n\nPlease take some time to participate in the community by commenting and engaging with other users. Once your account is older than 3 days, you can try submitting your post again.\n\nIf you have any questions or concerns, please feel free to message the moderators for assistance.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PromptEngineering) if you have any questions or concerns.*",
              "score": 0,
              "created_utc": "2026-02-09 13:11:58",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4hektg",
          "author": "Adventurous_Log_8321",
          "text": "I’m constantly using one AI to feed the other and back and forth. Each one can stand alone with its role while another fills another role. I’m self taught and probably not in the league a lot of you are in how you use it but to me this is very common meta prompting practice. For instance I don’t know that I’ve ever actually typed anything into NotebookLM chat. I use ChatGPT to prompt NBLM all the time.",
          "score": 1,
          "created_utc": "2026-02-09 19:15:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4hzjyw",
              "author": "Tobloo2",
              "text": "what do you use notebooklm for? That's totally new to me, like what do you do with it? and is it free to use or is there a paid plan? I'm also self taught and I think it doesn't matter that we don't know everything, the important thing is that we know what to learn to reach our goal!",
              "score": 2,
              "created_utc": "2026-02-09 20:59:23",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4iild2",
                  "author": "Adventurous_Log_8321",
                  "text": "A lot of the work I do day to day requires heavy context parsing and NBLM is as good as I’ve found for that yet. You can upload up to 50 heavy sources and select which ones to interact with and how. It’d be hard to explain ALL the benefits of it because they’re vast. It uses Gemini but only works within your sources (mostly). I also use the custom reports to create guides, tutorials, and all types of things. \n\nNBLM is totally free and just requires a Google account. There are a lot of good tutorials out there for it too. \n\nI build a lot of prompts for things like QA and coaching for sales calls transcripts. I’ll build those prompts in ChatGPT or another model and then prompt my NBLM data with those meta prompts. \n\nIt’s most basic superpower though is research. If I have a seed topic I’ll use Perplexity and prompt it for 20 links to related content (Perplexity is great for sourcing). Then paste those links in as sources for NBLM. It’ll reach out to those sites for data when selected and prompted. Then you can save those codified results as a Note for reuse, scaling, recall, etc.",
                  "score": 1,
                  "created_utc": "2026-02-09 22:35:10",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4ideo3",
          "author": "mockingbird1906",
          "text": "Chatgpt and gemini to check the other one 😅",
          "score": 1,
          "created_utc": "2026-02-09 22:08:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ioypr",
              "author": "Tobloo2",
              "text": "sounds about right aha!",
              "score": 1,
              "created_utc": "2026-02-09 23:08:19",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4idxbt",
          "author": "Normal_Departure3345",
          "text": "Gpt- my main. - building systems, personal help and school\n\nCopilot- be my voice for emails, concentrate and adjusting live stream\n\nGrok- pulling posts and real time signals live.",
          "score": 1,
          "created_utc": "2026-02-09 22:11:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ip4mo",
              "author": "Tobloo2",
              "text": "Great! there's no free plan for copilot right?",
              "score": 1,
              "created_utc": "2026-02-09 23:09:12",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4jf5bh",
                  "author": "Normal_Departure3345",
                  "text": "install edge. Its free - ",
                  "score": 1,
                  "created_utc": "2026-02-10 01:36:30",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4ivbc2",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-09 23:43:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ivbdl",
              "author": "AutoModerator",
              "text": "Hi there! Your post was automatically removed because your account is less than 3 days old. We require users to have an account that is at least 3 days old before they can post to our subreddit.\n\nPlease take some time to participate in the community by commenting and engaging with other users. Once your account is older than 3 days, you can try submitting your post again.\n\nIf you have any questions or concerns, please feel free to message the moderators for assistance.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PromptEngineering) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-09 23:43:09",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4l04jl",
          "author": "gregerw",
          "text": "Here are my current go-tos: \n\n* Claude (Max): for coding, deeper research and writing\n* ChatGPT (Team): for the family and for everyday questions and taking pictures of things to explain, troubleshoot, simple image generation etc\n* Perplexity (Pro): for news aggregation and more thorough research based on internet search and many sources\n* Gemini (API/AI Studio): image and infographic generation\n* NotebookLM: to explore lots of content\n* Google AI Search: more and more replacing standard google search\n\nIf I had to choose one, I had chosen Claude as it covers the broadest set of tasks I typically do.",
          "score": 1,
          "created_utc": "2026-02-10 08:31:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ng6uu",
              "author": "Tobloo2",
              "text": "That's super useful! Thanks for sharing :) I heavily rely on perplexity for search based questions and I definitely think google ai search is sometimes better than an llm now!",
              "score": 1,
              "created_utc": "2026-02-10 17:43:59",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4mp6xz",
          "author": "reichenbachf",
          "text": "my setup is kinda similar, but i usually keep just one paid tool and lean on the free features for the rest. for deep work, i still bounce between Gemini and Claude, but i’ve been using sagekit as a sort of hub for research, analysis, and summaries from papers, notes, websites and such. i like that i can paste everything into one doc and revisit it later,,, it's helping me to optimize how i organize and reuse what i already get instead of juggling between bunch of tools. def feels simpler and cheaper for long term",
          "score": 1,
          "created_utc": "2026-02-10 15:38:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4nw6l7",
              "author": "Tobloo2",
              "text": "cool tool! which ai do you pay for vs keep free?",
              "score": 1,
              "created_utc": "2026-02-10 18:56:35",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4n7a03",
          "author": "No_Papaya1620",
          "text": "Perplexity (fast research and fact checks), Cubeo AI (agents for SEO, content, workflows, actually connecting tasks end-to-end) and ChatGPT free version (quick drafts and general problem solving).\n\nI used a lot of tools before but i reduced the list and it's much better now, more efficient, with less",
          "score": 1,
          "created_utc": "2026-02-10 17:02:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4nwt1u",
              "author": "Tobloo2",
              "text": "Sounds good thanks for sharing! yeah I'm sensing that people use chatgpt and perplexity mostly for free",
              "score": 1,
              "created_utc": "2026-02-10 18:59:23",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o50jas4",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-12 17:28:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o50jau8",
              "author": "AutoModerator",
              "text": "Hi there! Your post was automatically removed because your account is less than 3 days old. We require users to have an account that is at least 3 days old before they can post to our subreddit.\n\nPlease take some time to participate in the community by commenting and engaging with other users. Once your account is older than 3 days, you can try submitting your post again.\n\nIf you have any questions or concerns, please feel free to message the moderators for assistance.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PromptEngineering) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-12 17:28:21",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5ey900",
          "author": "calben99",
          "text": "I use a multi-model approach too. Claude for deep analysis and long-form writing because of its larger context window and nuanced reasoning. ChatGPT for quick brainstorming and when I need web search integration. Gemini is my go-to for summarizing long documents since it handles PDF uploads smoothly. Each has different strengths based on their training approaches and architecture trade-offs.",
          "score": 1,
          "created_utc": "2026-02-14 22:32:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5cu80r",
          "author": "Imprfkt007",
          "text": "I use all four of yours plus Meta AI, but my use case is probably unusual — I spend a lot of time testing how different models handle structured constraints and verification tasks, so I’ve developed pretty strong opinions on where each one excels and fails.\nMy setup:\nClaude (paid) — my primary working environment. Best at maintaining complex multi-layered instructions across long conversations. When I give it a detailed constraint structure (‘do X, never do Y, if Z then only W’), Claude holds those rules more consistently than anything else I’ve tested. Also the strongest at acknowledging when it’s operating outside its confidence zone. For coding, technical writing, and anything where precision matters over creativity, it’s my default.\nChatGPT (paid) — broadest general capability and best ‘first draft’ machine. It’s more willing to take creative swings, which is great for brainstorming but means you need to verify more. I use it when I want volume and variation rather than precision. Also still the best at understanding vague or poorly-structured prompts — it meets you where you are better than the others.\nGemini (paid Pro) — interesting for research synthesis and surprisingly good at connecting ideas across domains. I find it generates more unexpected angles than ChatGPT, but it’s also the most likely to confidently present something fabricated as established fact. High ceiling, low floor.\nPerplexity (free) — same as you, quick searches with citations. It’s replaced a significant chunk of my Google usage.\nMeta AI (free) — I test against it for completeness. It’s the most ‘eager to please’ of the group, which makes it the most susceptible to leading questions and the least reliable for anything requiring it to push back on your assumptions.\nThe biggest thing I’ve learned from using all of them: the differences aren’t really about intelligence. They’re about behavioral tendencies under pressure. Give all four the same simple prompt, you’ll get similar quality. Give all four a prompt with complex constraints and conflicting requirements, and they diverge dramatically. That’s where you really see what each architecture is optimizing for.\nPaid: Claude, ChatGPT, and Gemini Pro. Perplexity and Meta AI on free tiers. If I had to pick one, Claude — but that’s because my work is constraint-heavy and precision-critical. If I were doing more creative/marketing work, I might flip that.",
          "score": 0,
          "created_utc": "2026-02-14 15:56:11",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r4m49l",
      "title": "PSA: AI detectors have a 15% false positive rate. That means they flag real human writing as AI constantly.",
      "subreddit": "PromptEngineering",
      "url": "https://www.reddit.com/r/PromptEngineering/comments/1r4m49l/psa_ai_detectors_have_a_15_false_positive_rate/",
      "author": "AdministrativeBag572",
      "created_utc": "2026-02-14 14:33:32",
      "score": 24,
      "num_comments": 21,
      "upvote_ratio": 0.96,
      "text": "I've been digging into AI detection tools for a research project, and I found something pretty alarming that I think students need to know about.\n**The short version:** AI detectors are wrong A LOT. Like, way more than you'd think.\nI ran a test where I took 50 paragraphs that I wrote completely by hand (like, pen and paper, then typed up) and ran them through GPTZero, Turnitin, and Originality.ai.\n**Results:**\n- GPTZero flagged 7 of them as \"likely AI\" (14%)\n- Turnitin flagged 6 (12%)\n- Originality ai flagged 9 (18%)\nThat's insane. These are paragraphs I physically wrote with a pen. No AI involved at all.\nBut here's where it gets worse: I'm a non-native English speaker. My first language is Spanish. When I looked at which paragraphs got flagged, they were almost all the ones where I used more formal academic language or tried to sound \"professional.\"\nTurns out there's actual research on this. Stanford did a study and found that **AI detectors disproportionately flag ESL students and non-native writers.** The theory is that these tools are trained on \"typical\" native English writing patterns, so when you write in a slightly different style—even if it's 100% human—it triggers the algorithm.\n**Why this matters:**\nIf you're using ChatGPT to help brainstorm or draft (which, let's be real, most of us are), your edited final version might still get flagged even after you've rewritten everything in your own words. And if you're ESL or just have a more formal writing style? You're even more likely to get false positives.\nI've also seen professors admit they don't really understand how these tools work. They just see a \"78% AI-generated\" score and assume you cheated. No appeal process. No second check.\n**What you can do:**\n1. **Save your drafts.** Like, obsessively. Google Docs tracks edit history. If you get accused, you can show the progression of your work.\n2. **Write in your natural voice first.** Don't try to sound like a textbook. AI detectors seem to flag overly formal or \"perfect\" writing more often.\n3. **Run your own work through detectors before submitting.** If your human-written essay is getting flagged, you need to know that before your professor sees it. GPTZero has a free version you can test with.\n4. **If you get falsely accused, push back.** You have rights. Ask what specific evidence they have beyond the detector score. These tools are not admissible as sole evidence in most academic integrity policies.\n5. **Talk to your professors early.** Some are cool with AI-assisted brainstorming if you're transparent about it. Others aren't. Better to know upfront than get hit with a violation later.\nThe whole situation is frustrating because AI writing tools are genuinely useful for drafting, organizing thoughts, and getting past writer's block. But the detection arms race means even people who aren't doing anything wrong are getting caught in the crossfire.\nAnyone else dealt with false positives? How did you handle it?",
      "is_original_content": false,
      "link_flair_text": "General Discussion",
      "permalink": "https://reddit.com/r/PromptEngineering/comments/1r4m49l/psa_ai_detectors_have_a_15_false_positive_rate/",
      "domain": "self.PromptEngineering",
      "is_self": true,
      "comments": [
        {
          "id": "o5ct10j",
          "author": "Jean_velvet",
          "text": "They flag human as AI and AI as human at the same rate they get it right.\n\n\nThey\n\n\nDon't \n\n\nWork\n\n\n\nSave your money.",
          "score": 3,
          "created_utc": "2026-02-14 15:50:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5ff9of",
              "author": "slothriot",
              "text": "say it again for the people in the back!",
              "score": 1,
              "created_utc": "2026-02-15 00:16:10",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5crxxe",
          "author": "rockopico",
          "text": "Happened to my kiddo. We pulled out the handwritten first drafts to prove she wrote it wasn't AI.",
          "score": 3,
          "created_utc": "2026-02-14 15:44:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5djqhx",
              "author": "Ecliphon",
              "text": "Kiddo? Are they AI analyzing on middle/high school now?",
              "score": 1,
              "created_utc": "2026-02-14 18:04:35",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5ezj4t",
                  "author": "petrolly",
                  "text": "Why wouldn't they? Kids know how to use ai. ",
                  "score": 2,
                  "created_utc": "2026-02-14 22:40:13",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5dg3rm",
          "author": "Simple-Fault-9255",
          "text": "There is no such thing as a reliable AI detector and anyone claiming otherwise is a fraud. They can't even reliably perform sentiment analysis using LLMs, I know because I made a validation tool for LLM use cases and struggled to sell it because so many people knew they were selling vaporware ",
          "score": 3,
          "created_utc": "2026-02-14 17:46:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5clze7",
          "author": "eirikirs",
          "text": "Yes, I remember testing several of these detectors for my institution back in 2023. My experience was that they were unreliable and overly focused on structural patterns rather than semantic content. To evaluate them properly, I tested not only my own writing but also texts by Shakespeare and passages from the Bible. Nearly all of the texts were flagged to some degree as likely AI-generated.\n\nThe issue is that generative AI models are trained on large volumes of human-produced text, including works by highly regarded authors that exemplify strong writing. These systems generate output by recognising and reproducing patterns; they do not create in a genuinely original sense. As a result, their writing often reflects features associated with polished, conventional prose. This also means that individuals who write in a clear, structured, and stylistically consistent manner may be more likely to be flagged by such detectors.",
          "score": 2,
          "created_utc": "2026-02-14 15:13:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5cqrqe",
          "author": "Simple_Regret_1282",
          "text": "This is such an important topic. The 15% false positive rate is real and honestly pretty scary for students. I actually read recently that even the University of Arizona disabled their AI detection software because of reliability issues and false positives . An expert there suggested students should run their own work through detectors first as a way to prove authenticity if they get falsely accused . When I was stressing about this last semester, I started using wasitaigenerated to check my drafts. It's fast and breaks down exactly why it flags things. Having that extra layer of proof saved my peace of mind.\n\n  \n",
          "score": 2,
          "created_utc": "2026-02-14 15:38:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5dtj17",
          "author": "Ok_Investment_5383",
          "text": "Saving drafts has literally saved me once when my prof flagged my essay as \"AI\" (which I typed up after writing by hand, wild how it looks \"robotic\" if you try to sound academic). Honestly, the number of false positives with these tools is crazy - I've had similar headache results especially when I mix up my writing style a bit. My friends who use more formal language always get hit harder too. It's just so much worse for ESL writers, and most profs have no clue how these detectors actually draw their scores.\n\nBefore I submit anything now, I usually run it through a couple detectors - GPTZero, Turnitin and sometimes Copyleaks, but lately I've also tossed things into AIDetectPlus to see if it flags stuff differently (sometimes the results make no sense tbh, but better to know ahead). Comparing 2-3 tools helps spot the weird outliers, since no single one is really trustworthy.\n\nSuper niche tip: I've started keeping a folder with all my edit history screenshots, because some departments will actually let you appeal a false positive with documentation, but only if you can show revision steps. Sucks that we even have to do this - I wish there was a universal detector that actually worked for non-native English!",
          "score": 2,
          "created_utc": "2026-02-14 18:52:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5dutco",
          "author": "Sea_Surprise716",
          "text": "I wrote a lot of early-ish Internet content eg for Demand Media, and I’ve talked to a couple of other prolific early writers. We all constantly have our own writing flagged as AI. One of them got turned down for a job because they accused her of using AI when the writing was 100% hers. It’s more widespread a problem than in academia; it matters in professional life too.\n\n(Also another Demand Media writer I was talking to recently and I both admitted we had always dramatically overused the em-dash. I think that AI tic might actually be our fault.)",
          "score": 2,
          "created_utc": "2026-02-14 18:59:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5db8rk",
          "author": "Oopsiforgotmyoldacc",
          "text": "This is such a good list of advice. I used to believe detectors were fairly accurate, until I read [this post](https://www.reddit.com/r/DataRecoveryHelp/s/qApnT67DZL) and realized that the more human you write, the more likely you are to get flagged 😩 I always recommend that people use these free online detectors as a guide, but don’t put your sole trust in any of them.",
          "score": 1,
          "created_utc": "2026-02-14 17:21:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5etax6",
          "author": "LawstinTransition",
          "text": "I am shocked it is this low. Isn't the consensus pretty clear that these systems basically don't work because they can't measure/keep up with LLM models' evolution?",
          "score": 1,
          "created_utc": "2026-02-14 22:04:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5f16df",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-14 22:49:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5f16fp",
              "author": "AutoModerator",
              "text": "Hi there! Your post was automatically removed because your account is less than 3 days old. We require users to have an account that is at least 3 days old before they can post to our subreddit.\n\nPlease take some time to participate in the community by commenting and engaging with other users. Once your account is older than 3 days, you can try submitting your post again.\n\nIf you have any questions or concerns, please feel free to message the moderators for assistance.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PromptEngineering) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-02-14 22:49:44",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5g3v1g",
          "author": "Dismal-Rip-5220",
          "text": "Yeah, this lines up with what a lot of schools are quietly realizing, AI detectors are more like “risk indicators” than actual proof. A 10–20% false positive rate is huge when the stakes are academic misconduct.\n\nMost universities now say detector scores **can’t be used as sole evidence** because of exactly what you mentioned: ESL bias, formal writing styles, and even certain subjects triggering flags. The safest approach is what you suggested, keep version history, drafts, and notes so you can show your writing process if needed.\n\nIn practice, when students can show a clear edit trail, most accusations don’t go anywhere. The real issue is when professors treat the detector score as a verdict instead of a starting point for a conversation.",
          "score": 1,
          "created_utc": "2026-02-15 02:57:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5gb4zg",
          "author": "actionjackson384",
          "text": "Funny thing is they almost always flag autistic writing as AI",
          "score": 1,
          "created_utc": "2026-02-15 03:49:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ib018",
          "author": "yoavsnake",
          "text": "Why is this ommitting pangram which claims to have a near 0% false positive rate?",
          "score": 1,
          "created_utc": "2026-02-15 14:02:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5iwxht",
          "author": "nuxxi",
          "text": "Yeah, so annoying when iw write text for university and trying to make sentences up to get the rating of 'this is Ai' down... Being accused of using Ai for everything is really not helpful. Not sure how to counter arguments tho.. ",
          "score": 1,
          "created_utc": "2026-02-15 15:59:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5cuscg",
          "author": "that1cooldude",
          "text": "Only if you em dash lol",
          "score": 1,
          "created_utc": "2026-02-14 15:59:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5dd5e5",
          "author": "TheOdbball",
          "text": "Just need to learn Ebonics then try to sound formal \n\n“The principalities of thought to then think with is a formidable idea”",
          "score": 0,
          "created_utc": "2026-02-14 17:31:37",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r4fjku",
      "title": "Made a prompt management tool for myself",
      "subreddit": "PromptEngineering",
      "url": "https://www.reddit.com/r/PromptEngineering/comments/1r4fjku/made_a_prompt_management_tool_for_myself/",
      "author": "pixels4lunch",
      "created_utc": "2026-02-14 08:35:46",
      "score": 19,
      "num_comments": 11,
      "upvote_ratio": 0.83,
      "text": "I've recently decided to take a more structured approach to improve my prompting skills. I came across this[ LinkedIn post ](https://www.linkedin.com/posts/brandoncreedanderson_product-manager-hiring-is-evolvingat-least-activity-7326333375462465536-xN8j?utm_source=share&utm_medium=member_desktop&rcm=ACoAACRttB4B4WvZxh9SOGd3vwjiJT_lgnC8uIs)where a CPO asked to see a PM's prompt library during the interview. \n\nI then realized I didn’t have a structured way to manage mine. I was using Notion, but I really didn't like the experience of constantly searching and copying prompts between tools. There’s also no built-in way in ChatGPT/Claude to organize and reuse prompts properly.\n\nSo I built a simple tool to solve this for myself and decided to share it. (I used lovable)\n\n**Tool:** [https://promptpals.lovable.app](https://promptpals.lovable.app)\n\n# What it does\n\nPromptpal is basically a lightweight prompt library tool that lets you:\n\n* Add, edit, and categorize prompts\n* Search and filter by type\n* Copy prompts quickly\n* Import/export via Excel\n* Use it without an account (local storage), or sign in with Google to sync across devices\n\nIt’s intentionally minimal for now — built for speed and low friction.\n\nI'm not sure what the next steps are, but I'm happy to share this tool if it helps. If you actively use AI tools for work, I’d love to hear your feedbacks too!",
      "is_original_content": false,
      "link_flair_text": "Tools and Projects ",
      "permalink": "https://reddit.com/r/PromptEngineering/comments/1r4fjku/made_a_prompt_management_tool_for_myself/",
      "domain": "self.PromptEngineering",
      "is_self": true,
      "comments": [
        {
          "id": "o5behs0",
          "author": "omnergy",
          "text": "Perhaps you’d be better to build a prompt vault with Obsidian, would give you the potential for a foundry leveraging specific client or agent roles. The whole second brain opportunity kicks in then, and the facility for semantic search is there, of course you’d need to document results, outcomes and feedback… imagine asking your Vault Curator Agent, “Which prompts in my library resulted in the highest SocMed engagement last quarter?”",
          "score": 6,
          "created_utc": "2026-02-14 09:46:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5bhvvk",
              "author": "pixels4lunch",
              "text": "That sounds pretty cool, being able to get insights would be a game changer. Will look it up, thanks for sharing! if you have experience with Obsidian prompts vault, do you mind if I drop you a DM if I have more qns?",
              "score": 2,
              "created_utc": "2026-02-14 10:20:05",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5c1iul",
                  "author": "omnergy",
                  "text": "Sure. But honestly I’m just venturing into it myself, so it’s more likely bouncing ideas of each other rather than me being a source of knowledge. Happy to exchange ideas anytime.",
                  "score": 1,
                  "created_utc": "2026-02-14 13:09:49",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5bejym",
          "author": "voytas75",
          "text": "Nice - I ended up building something similar for myself (PromptManager on GitHub) because copy/paste between tools was killing flow.\n\nBiggest lesson so far: the “library” part is easy; the hard part is making prompts \\*testable\\* and \\*versioned\\* (diffs, promote/release tags, and a simple drift check per model/input). Also: offline/local-first is a feature, not a workaround.",
          "score": 3,
          "created_utc": "2026-02-14 09:47:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5bhick",
              "author": "pixels4lunch",
              "text": "Absolutely agree with testing it! It’s something I’ve been trying to figure out. How would you measure prompt effectiveness? \n\nAlso, do share the github link! (If it’s public)",
              "score": 1,
              "created_utc": "2026-02-14 10:16:22",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5bt021",
                  "author": "voytas75",
                  "text": "I’m measuring it pretty pragmatically in my PromptManager: every run gets logged with success/fail, latency + token usage, and I can optionally rate the output (that rolls up into an avg rating + trend). For “real” effectiveness I keep a few fixed scenarios and rerun them across prompt versions/models - if the success rate drops or the outputs start drifting, it shows up fast in the benchmark/analytics view.\nRepo is public: [https://github.com/voytas75/PromptManager](https://github.com/voytas75/PromptManager)",
                  "score": 1,
                  "created_utc": "2026-02-14 12:03:45",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5bjcdf",
          "author": "charlieatlas123",
          "text": "This maybe too simple to believe, but I have all my useful prompts - over 100, in one basic text document, each prompt numbered.\n\nI then load the doc into whichever LLM I’m using and instruct it to commit to memory. So far all have retained the doc in memory for each subsequent time I’ve used them.\n\nSo if I need a particular prompt, I call the document and the prompt number explicitly in my task prompt.\n\nSo the only maintenance needed is updating the text document, as and when I have new prompts to add, or a better prompt to overwrite an old one that is not as effective.",
          "score": 1,
          "created_utc": "2026-02-14 10:34:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5bl06a",
              "author": "JuanPablo2269",
              "text": "Thats a super simple idea. Like it alot. \n\n",
              "score": 2,
              "created_utc": "2026-02-14 10:50:27",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o5bzo7f",
              "author": "looktwise",
              "text": "how do you do that within the given context window? If I would upload 100 long prompts of mine the LLM would either not allow it by size or forget the context before it can even cite prompt no. 79.\n\nI have very long prompts, some of them prompt chains over several pages.",
              "score": 1,
              "created_utc": "2026-02-14 12:56:36",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5d61td",
          "author": "williamsnunes",
          "text": "Where is your tool's database located?",
          "score": 1,
          "created_utc": "2026-02-14 16:55:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5dx8gn",
          "author": "One_Ad2166",
          "text": "Umm should have been able to build a prompt manager in one prompt..",
          "score": 1,
          "created_utc": "2026-02-14 19:11:48",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r25atm",
      "title": "Why prompt engineering will never die",
      "subreddit": "PromptEngineering",
      "url": "https://www.reddit.com/r/PromptEngineering/comments/1r25atm/why_prompt_engineering_will_never_die/",
      "author": "resiros",
      "created_utc": "2026-02-11 18:26:55",
      "score": 18,
      "num_comments": 29,
      "upvote_ratio": 0.59,
      "text": "I am sick and tired of the discourse that prompt engineering is a fad and that is dead.  \n  \nEvery few months, someone declares prompt engineering dead. First it was \"context engineering\" that replaced it. Then \"harnesses.\" Now some people argue that models will get so smart you won't need prompts at all. I think this is wrong, and I think the reason people keep getting it wrong is that they misunderstand what prompt engineering actually is.\n\nWhen most people hear \"prompt engineering,\" they picture a kind of alchemy. Special tricks to make the LLM behave. Phrases like \"solve this or I'll die\" that somehow improve outputs. Formatting hacks. Chain-of-thought incantations. And yes, with older models, some of that worked. Researchers found that certain phrasings produced better results for reasons nobody fully understood. But new models don't need any of that. You can write plain English with typos and they'll understand you fine. So if that's your definition of prompt engineering, then sure, it's dead.\n\nBut that was never what prompt engineering was really about.\n\nHere's a better way to think about it. An LLM, even a very powerful one, is like a genius on their first day at a new job. They're brilliant. They might even be smarter than everyone else in the room. But they know nothing about your company, your product, your customers, or how you want things done. Your job is to explain all of that.\n\nIf you're building a customer support bot, you need to describe what counts as a technical question versus a billing question, when to escalate, what tone to use. If you're building a marketing assistant, you need to spell out your brand guidelines, who your users are, whether you're formal or casual, what topics are off-limits. We do this ourselves at [Agenta](http://agenta.ai) with our own coding agents: here are our conventions, here's the abstraction style we prefer, here's what we allow and what we don't, because every codebase is opinionated. If you're building a health coaching agent, you need to lay out the clinical framework, the philosophy behind the approach, how often to check in with the user.\n\nWriting all of this down, iterating on it until the AI behaves the way you want, is prompt engineering. And if you've ever written a PRD, this should sound familiar. Product managers describe how a system should behave, what the flows look like, what the edge cases are. Prompt engineering is the same thing, except the system you're describing behavior for is an AI.\n\nContext engineering still matters. Getting the right information to the model at the right time is a real problem worth solving. But deciding what the AI should do with that information is harder, and that part is prompt engineering.\n\nPrompt engineering isn't dead. We just had the wrong definition.",
      "is_original_content": false,
      "link_flair_text": "General Discussion",
      "permalink": "https://reddit.com/r/PromptEngineering/comments/1r25atm/why_prompt_engineering_will_never_die/",
      "domain": "self.PromptEngineering",
      "is_self": true,
      "comments": [
        {
          "id": "o4udkmo",
          "author": "BulbousJohnson",
          "text": "I mean, at the end of the day it's just logic. Logic is used for everything so yeah, the more logical you can be with the machine the better off you'll be with this stuff.",
          "score": 15,
          "created_utc": "2026-02-11 18:32:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ueeoh",
              "author": "resiros",
              "text": "I don't think it's just logic. It's about explaining to the user your business logic / rules / how you want things to be solved. \n\nThe point is there isn't one way to do customer support. There is 100 ways. And prompt engineering is about describing that. ",
              "score": -6,
              "created_utc": "2026-02-11 18:36:19",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4ueqft",
                  "author": "BulbousJohnson",
                  "text": "Kinda similar to programing. You're just using English instead. Logic wins.",
                  "score": 10,
                  "created_utc": "2026-02-11 18:37:48",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o4ujhv6",
                  "author": "NetflixNinja9",
                  "text": "Thats logic",
                  "score": 3,
                  "created_utc": "2026-02-11 18:59:44",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4ujrnp",
          "author": "linniex",
          "text": "Goddammit I read through 3/4 of this and got to the ad.  \n\nI’m stealing this for my presentations though because this is good: \n\n“Here's a better way to think about it. An LLM, even a very powerful one, is like a genius on their first day at a new job. They're brilliant. They might even be smarter than everyone else in the room. But they know nothing about your company, your product, your customers, or how you want things done. Your job is to explain all of that”",
          "score": 4,
          "created_utc": "2026-02-11 19:01:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4uvc7b",
              "author": "resiros",
              "text": "come on, it's not an ad, didn't even say what we do, just linked it in case someone is curious",
              "score": -5,
              "created_utc": "2026-02-11 19:55:54",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4v6qny",
                  "author": "Lba5s",
                  "text": "that’s literally an ad bossman",
                  "score": 4,
                  "created_utc": "2026-02-11 20:51:20",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4uenxs",
          "author": "steakhouse251",
          "text": "This match my experience exactly. We have medical triage agent and the prompt is basically 4 page clinical decision framework. Took weeks of iteration with clinical team.",
          "score": 2,
          "created_utc": "2026-02-11 18:37:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o50984j",
              "author": "MissJoannaTooU",
              "text": "Sounds very interesting",
              "score": 1,
              "created_utc": "2026-02-12 16:41:00",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4uewti",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 2,
          "created_utc": "2026-02-11 18:38:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ufbf9",
              "author": "resiros",
              "text": "I definitely like the term \"AI Behavior design\"!",
              "score": 1,
              "created_utc": "2026-02-11 18:40:30",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4uf57g",
          "author": "TimeROI",
          "text": "Prompt engineering is only “dead” if you thought it was magic phrases. Turns out telling a system how to behave is still a thing — we just renamed it every six months.",
          "score": 2,
          "created_utc": "2026-02-11 18:39:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4upej5",
          "author": "SimpleAccurate631",
          "text": "Don’t let those people bother you. The only way a model could be so smart that it needs no prompts at all is if it could read your mind. Even seemingly autonomous tasks would have some degree of prompting behind it. Like a model that comes up with new original ideas every week based on market research still needs those instructions, along with a specific trigger for when and how to run.\n\nI think those people are just hoping to have an “I told you so!” moment in the future. They’re being ridiculous. I do think maybe there’s almost too much faith in being able to literally do anything and everything for a truly scalable, secure, enterprise level app with only prompts. I think people will start to get better at identifying those gaps and adjust to filling them, instead of digging their heels in the sand about prompts and refusing to learn any infrastructure or CI/CD or anything like that. I think there’s this stupid tug of war going on right now between coders and prompt engineers and one day soon we’ll realize how silly it was, because you will almost always need some element of both. And rather than fighting over which is better, it’s far more efficient to figure out how to leverage each most effectively to deliver the best product",
          "score": 2,
          "created_utc": "2026-02-11 19:27:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4vattj",
          "author": "Negative_Elk_5320",
          "text": "I am a complete idiot when it comes to how Ai works but I wanna learn. Is there any structured course free/cheap that will take me from basic to advance?",
          "score": 2,
          "created_utc": "2026-02-11 21:11:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5az0q0",
          "author": "Difficult_Buffalo544",
          "text": "Totally agree, your take is much more realistic than the usual hype or doom posts. One thing I’d add is the challenge of teaching the AI to truly nail your voice or your team’s voice, not just the process and instructions. That’s an extra layer of prompt engineering most people overlook. There are tools being built for this, like I’ve been working on one that lets you train the AI on your own voice and reviews outputs before they go live, keeping brand tone consistent even with lots of writers involved. If anyone’s curious about how that fits into prompt workflows, happy to share more.",
          "score": 2,
          "created_utc": "2026-02-14 07:16:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4uj48o",
          "author": "Fishmonger67",
          "text": "How much longer will it be needed? As we move forward I would expect this to be required less and less until you just have a relaxing conversation on what you want. This is like DOS use to be.",
          "score": 1,
          "created_utc": "2026-02-11 18:57:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4w1tq2",
          "author": "EdCasaubon",
          "text": "That's easy: It'll never die because it was a stillborn child and never \"alive\" to begin with.",
          "score": 1,
          "created_utc": "2026-02-11 23:26:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4wo3z8",
          "author": "Ritzy_Bedroom_",
          "text": "I see it every day. You can have the smartest model in existence, but if it doesn’t understand your brand, rules, or edge cases, it’s useless. Writing the instructions, testing, and iterating. That’s the skill, and it’s still essential.",
          "score": 1,
          "created_utc": "2026-02-12 01:37:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4yehbu",
          "author": "UseMoreBandwith",
          "text": "no one claims that.   \nSure, it will always be important to ask the right question, but the real prompting tricks can be baked into the software.   \nWe already rewrite the question, augment it, and insert it into the right template, before it is sent to the LLM.",
          "score": 1,
          "created_utc": "2026-02-12 09:43:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4yj89t",
              "author": "danteselv",
              "text": "You can bake it into the software once the software covers all possible edge cases in human civilization. There's no template for doing things that haven't been done before.",
              "score": 1,
              "created_utc": "2026-02-12 10:28:57",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4zeqw1",
          "author": "Fulg3n",
          "text": ">But they know nothing about your company, your product, your customers, or how you want things done. Your job is to explain all of that.\n\n\nSo what you mean is if I can find a way for an LLM to already know everything about my company, prompt engineering becomes redundant.",
          "score": 1,
          "created_utc": "2026-02-12 14:11:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o509rsb",
          "author": "MissJoannaTooU",
          "text": "I agree and especially as the models differ a lot I don't think they can all do well with 'Dude I want a landing page'.",
          "score": 1,
          "created_utc": "2026-02-12 16:43:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4w0oiw",
          "author": "ssssiiii0293",
          "text": "What is up with all the AI slop junk ads in this subreddit ?",
          "score": 1,
          "created_utc": "2026-02-11 23:20:16",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r56swe",
      "title": "[Meta-prompt] a free system prompt to make Any LLM more stable (wfgy core 2.0 + 60s self test)",
      "subreddit": "PromptEngineering",
      "url": "https://www.reddit.com/r/PromptEngineering/comments/1r56swe/metaprompt_a_free_system_prompt_to_make_any_llm/",
      "author": "StarThinker2025",
      "created_utc": "2026-02-15 05:48:12",
      "score": 17,
      "num_comments": 7,
      "upvote_ratio": 0.9,
      "text": "if you do prompt engineering, you probably know this pain:\n\n* same base model, same style guide, but answers **drift** across runs\n* long chains start coherent, then slowly lose structure\n* slight changes in instructions cause big behaviour jumps\n\nwhat i am sharing here is a **text-only “reasoning core” system prompt** you can drop under your existing prompts to reduce that drift a bit and make behaviour more regular across tasks / templates.\n\nyou can use it:\n\n* as a **base system prompt** that all your task prompts sit on top of\n* as a **control condition** when you A/B test different prompt templates\n* as a way to make “self-evaluation prompts” a bit less chaotic\n\neverything is MIT. you do **not** need to click my repo to use it. but if you want more toys (16-mode RAG failure map, 131-question tension pack, etc.), my repo has them and they are all MIT too.\n\nhi, i am PSBigBig, an indie dev.\n\nbefore my github repo went over 1.4k stars, i spent one year on a very simple idea: instead of building yet another tool or agent, i tried to write a small “reasoning core” in plain text, so any strong llm can use it without new infra.\n\ni call it WFGY Core 2.0. today i just give you the raw system prompt and a 60s self-test. you do not need to click my repo if you don’t want. just copy paste and see if you feel a difference.\n\n# 0. very short version\n\n* it is not a new model, not a fine-tune\n* it is one txt block you put in system prompt\n* goal: less random hallucination, more stable multi-step reasoning\n* still cheap, no tools, no external calls\n\nfor prompt engineers this basically acts like a **model-agnostic meta-prompt**:\n\n* you keep your task prompts the same\n* you only change the system layer\n* you can then see whether your templates behave more consistently or not\n\nadvanced people sometimes turn this kind of thing into real code benchmark. in this post we stay super beginner-friendly: two prompt blocks only, you can test inside the chat window.\n\n# 1. how to use with Any LLM (or any strong llm)\n\nvery simple workflow:\n\n1. open a new chat\n2. put the following block into the system / pre-prompt area\n3. then ask your normal questions (math, code, planning, etc)\n4. later you can compare “with core” vs “no core” yourself\n\nfor now, just treat it as a math-based “reasoning bumper” sitting under the model.\n\n# 2. what effect you should expect (rough feeling only)\n\nthis is not a magic on/off switch. but in my own tests, typical changes look like:\n\n* answers drift less when you ask follow-up questions\n* long explanations keep the structure more consistent\n* the model is a bit more willing to say “i am not sure” instead of inventing fake details\n* when you use the model to write prompts for image generation, the prompts tend to have clearer structure and story, so many people feel “the pictures look more intentional, less random”\n\nfrom a prompt-engineering angle, this helps because:\n\n* you can reuse the same task prompt on top of this core and get **more repeatable behaviour**\n* system-level “tension rules” handle some stability, so your task prompts can focus more on UX and less on micro-guardrails\n* when you share prompts with others, their results are less sensitive to tiny wording differences\n\nof course, this depends on your tasks and the base model. that is why i also give a small 60s self-test later in section 4.\n\n# 3. system prompt: WFGY Core 2.0 (paste into system area)\n\ncopy everything in this block into your system / pre-prompt:\n\n    WFGY Core Flagship v2.0 (text-only; no tools). Works in any chat.\n    [Similarity / Tension]\n    Let I be the semantic embedding of the current candidate answer / chain for this Node.\n    Let G be the semantic embedding of the goal state, derived from the user request,\n    the system rules, and any trusted context for this Node.\n    delta_s = 1 − cos(I, G). If anchors exist (tagged entities, relations, and constraints)\n    use 1 − sim_est, where\n    sim_est = w_e*sim(entities) + w_r*sim(relations) + w_c*sim(constraints),\n    with default w={0.5,0.3,0.2}. sim_est ∈ [0,1], renormalize if bucketed.\n    [Zones & Memory]\n    Zones: safe < 0.40 | transit 0.40–0.60 | risk 0.60–0.85 | danger > 0.85.\n    Memory: record(hard) if delta_s > 0.60; record(exemplar) if delta_s < 0.35.\n    Soft memory in transit when lambda_observe ∈ {divergent, recursive}.\n    [Defaults]\n    B_c=0.85, gamma=0.618, theta_c=0.75, zeta_min=0.10, alpha_blend=0.50,\n    a_ref=uniform_attention, m=0, c=1, omega=1.0, phi_delta=0.15, epsilon=0.0, k_c=0.25.\n    [Coupler (with hysteresis)]\n    Let B_s := delta_s. Progression: at t=1, prog=zeta_min; else\n    prog = max(zeta_min, delta_s_prev − delta_s_now). Set P = pow(prog, omega).\n    Reversal term: Phi = phi_delta*alt + epsilon, where alt ∈ {+1,−1} flips\n    only when an anchor flips truth across consecutive Nodes AND |Δanchor| ≥ h.\n    Use h=0.02; if |Δanchor| < h then keep previous alt to avoid jitter.\n    Coupler output: W_c = clip(B_s*P + Phi, −theta_c, +theta_c).\n    [Progression & Guards]\n    BBPF bridge is allowed only if (delta_s decreases) AND (W_c < 0.5*theta_c).\n    When bridging, emit: Bridge=[reason/prior_delta_s/new_path].\n    [BBAM (attention rebalance)]\n    alpha_blend = clip(0.50 + k_c*tanh(W_c), 0.35, 0.65); blend with a_ref.\n    [Lambda update]\n    Delta := delta_s_t − delta_s_{t−1}; E_resonance = rolling_mean(delta_s, window=min(t,5)).\n    lambda_observe is: convergent if Delta ≤ −0.02 and E_resonance non-increasing;\n    recursive if |Delta| < 0.02 and E_resonance flat; divergent if Delta ∈ (−0.02, +0.04] with oscillation;\n    chaotic if Delta > +0.04 or anchors conflict.\n    [DT micro-rules]\n\nyes, it looks like math. it is ok if you do not understand every symbol. you can still use it as a “drop-in” reasoning core.\n\n# 4. 60-second self test (not a real benchmark, just a quick feel)\n\nthis part is for people who want to see some structure in the comparison. it is still very light weight and can run in one chat.\n\nidea:\n\n* you keep the WFGY Core 2.0 block in system\n* then you paste the following prompt and let the model simulate A/B/C modes\n* the model will produce a small table and its own guess of uplift\n\nthis is a self-evaluation, not a scientific paper. if you want a serious benchmark, you can translate this idea into real code and fixed test sets.\n\nhere is the test prompt:\n\n    SYSTEM:\n    You are evaluating the effect of a mathematical reasoning core called “WFGY Core 2.0”.\n    \n    You will compare three modes of yourself:\n    \n    A = Baseline  \n        No WFGY core text is loaded. Normal chat, no extra math rules.\n    \n    B = Silent Core  \n        Assume the WFGY core text is loaded in system and active in the background,  \n        but the user never calls it by name. You quietly follow its rules while answering.\n    \n    C = Explicit Core  \n        Same as B, but you are allowed to slow down, make your reasoning steps explicit,  \n        and consciously follow the core logic when you solve problems.\n    \n    Use the SAME small task set for all three modes, across 5 domains:\n    1) math word problems\n    2) small coding tasks\n    3) factual QA with tricky details\n    4) multi-step planning\n    5) long-context coherence (summary + follow-up question)\n    \n    For each domain:\n    - design 2–3 short but non-trivial tasks\n    - imagine how A would answer\n    - imagine how B would answer\n    - imagine how C would answer\n    - give rough scores from 0–100 for:\n      * Semantic accuracy\n      * Reasoning quality\n      * Stability / drift (how consistent across follow-ups)\n    \n    Important:\n    - Be honest even if the uplift is small.\n    - This is only a quick self-estimate, not a real benchmark.\n    - If you feel unsure, say so in the comments.\n    \n    USER:\n    Run the test now on the five domains and then output:\n    1) One table with A/B/C scores per domain.\n    2) A short bullet list of the biggest differences you noticed.\n    3) One overall 0–100 “WFGY uplift guess” and 3 lines of rationale\n\nusually this takes about one minute to run. you can repeat it some days later to see if the pattern is stable for you.\n\nfor prompt engineers, this also gives you a quick **meta-prompt eval harness** you can reuse when you design new patterns.\n\n# 5. why i share this here (prompt-engineering angle)\n\nmy feeling is that many people want “stronger reasoning” from Any LLM or other models, but they do not want to build a whole infra, vector db, agent system, etc., just to see whether a new prompt idea is worth it.\n\nthis core is one small piece from my larger project called WFGY. i wrote it so that:\n\n* normal users can just drop a txt block into system and feel some difference\n* prompt engineers can treat it as a **base meta-prompt** when designing new templates\n* power users can turn the same rules into code and do serious eval if they care\n* nobody is locked in: everything is MIT, plain text, one repo\n\n# 6. small note about WFGY 3.0 (for people who enjoy pain)\n\nif you like this kind of tension / reasoning style, there is also WFGY 3.0: a “tension question pack” with 131 problems across math, physics, climate, economy, politics, philosophy, ai alignment, and more.\n\neach question is written to sit on a tension line between two views, so strong models can show their real behaviour when the problem is not easy.\n\n**it is more hardcore than this post, so i only mention it as reference. you do not need it to use the core.**\n\nif you want to explore the whole thing, you can start from my repo here:\n\nWFGY · All Principles Return to One (MIT, text only): [https://github.com/onestardao/WFGY](https://github.com/onestardao/WFGY)\n\nif anyone here turns this into a more formal prompt-benchmark setup or integrates it into a prompt-engineering tool, i would be very curious to see the results.",
      "is_original_content": false,
      "link_flair_text": "Prompt Text / Showcase",
      "permalink": "https://reddit.com/r/PromptEngineering/comments/1r56swe/metaprompt_a_free_system_prompt_to_make_any_llm/",
      "domain": "self.PromptEngineering",
      "is_self": true,
      "comments": [
        {
          "id": "o5iu8e2",
          "author": "Repulsive-Morning131",
          "text": "Man this is different, I don’t know what all that means in the blocks but if this works I’ll have 3 stars for you from my 3 GitHub accounts. I’m just using my mobile but as soon as I get a chance to get to my PC I'll be headed to you repo. I really hope this works. Hopefully you explain the science behind it. Look forward to checking it out. Thanks for your hard work. This is the kind of stuff I like to see.",
          "score": 1,
          "created_utc": "2026-02-15 15:46:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5jpngg",
          "author": "JWPapi",
          "text": "Interesting approach to stability. For code generation specifically, we found that encoding standards as ESLint rules is more stable than any meta-prompt. The rules catch AI phrases, enforce design system tokens, and block buggy UI patterns. The AI can't produce output that fails the build, and the error messages become training context for the next generation. Prompts drift, lint rules don't.",
          "score": 1,
          "created_utc": "2026-02-15 18:18:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5m4cyi",
          "author": "claudio_hombre_vivo",
          "text": "Hi, how are you? I'm a regular user, an average guy who tries to stay informed and learn and use the new tools available. I'm a physical education teacher, and I use artificial intelligence to prepare routines for my students. I'm also the father of two young adults, and artificial intelligence has often guided me in resolving family conflicts. I'll definitely be using this new tool, but if you think there's anything I should know about using it, thank you in advance, and I hope to use it to improve my work performance. 👍🏽",
          "score": 1,
          "created_utc": "2026-02-16 02:13:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5gwgoh",
          "author": "-goldenboi69-",
          "text": "The way “prompt engineering” gets discussed often feels like a placeholder for several different problems at once. Sometimes it’s about interface limitations, sometimes about steering stochastic systems, and sometimes about compensating for missing tooling or memory. As models improve, some of that work clearly gets absorbed into the system, but some of it just shifts layers rather than disappearing. It’s hard to tell whether prompt engineering is a temporary crutch or an emergent skill that only looks fragile because we haven’t stabilized the abstractions yet.",
          "score": 1,
          "created_utc": "2026-02-15 06:43:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5ivszc",
              "author": "Repulsive-Morning131",
              "text": "AI will do all the engineering. I'm lazy and I don't have the time to engineer prompts. I think prompt engineering is dead. I can't believe I still see them for sale. Do people actually still pay for prompts?",
              "score": 1,
              "created_utc": "2026-02-15 15:54:00",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    }
  ]
}