{
  "metadata": {
    "last_updated": "2026-01-29 17:09:57",
    "time_filter": "week",
    "subreddit": "PromptEngineering",
    "total_items": 20,
    "total_comments": 153,
    "file_size_bytes": 215249
  },
  "items": [
    {
      "id": "1qkowpy",
      "title": "so Cornell and MIT researchers got an ai to change conspiracy theorists minds in 8 minutes... turns out having zero emotions is actually the superpower for persuasion",
      "subreddit": "PromptEngineering",
      "url": "https://www.reddit.com/r/PromptEngineering/comments/1qkowpy/so_cornell_and_mit_researchers_got_an_ai_to/",
      "author": "johnypita",
      "created_utc": "2026-01-23 11:58:54",
      "score": 625,
      "num_comments": 116,
      "upvote_ratio": 0.96,
      "text": "ok so this paper dropped in Science last september from cornell mit and american university. they wanted to see if ai could do what humans basically cant talk people out of beliefs theyve held for years.\n\nand it worked. like really worked.\n\nthe ai didnt succeed because it was smart or had better facts. it succeeded because it has no feelings.\n\nthink about it. when you try to convince someone theyre wrong about something they care about you get frustrated. you roll your eyes. you give up after 10 minutes. you start judging them.\n\nthe ai just... doesnt do any of that. its limitlessly patient. it generated a custom rebuttal for every single objection the person threw at it. not generic scripts but specific counterarguments to the exact logic that person just used.\n\nheres the workflow they used that you can steal for sales or negotiations:\n\nstep 1 - get the person to explain their hesitation in detail. like really explain it. \"why exactly do you think this is too risky?\"\n\nstep 2 - feed that exact objection into chatgpt\n\nstep 3 - prompt it to acknowledge their point first (validate dont agree), then generate a fact based counter to their specific logic, then end with a question that makes them reconsider\n\nstep 4 - repeat. the effect scaled with personalization.\n\nthe stats are kinda insane. belief dropped 20% after just 3 rounds of back and forth. 25% of hardcore believers completely disavowed their conspiracy after one conversation.\n\nthe thing most people miss - charisma and empathy arent persuasion superpowers. patience and personalization are. and ai has infinite amounts of both.\n\nanyone can be superhuman at changing minds now. you just have to stop trying to do it yourself.",
      "is_original_content": false,
      "link_flair_text": "Research / Academic",
      "permalink": "https://reddit.com/r/PromptEngineering/comments/1qkowpy/so_cornell_and_mit_researchers_got_an_ai_to/",
      "domain": "self.PromptEngineering",
      "is_self": true,
      "comments": [
        {
          "id": "o1866sp",
          "author": "Weird_Albatross_9659",
          "text": "You can have emotions and still be objective.   Lack of emotion isn’t what made the argument work, remaining objective is.",
          "score": 46,
          "created_utc": "2026-01-23 12:26:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o18pyfx",
              "author": "Usual-Ad-9554",
              "text": "I actually think what likely played a strong part in this is the immediate respect for the source intelligence and it not needing to be earned first in the conversation before being willing to let the guard down. it seems to be a need when arguing it out with another human. A STRONG part of flipping anyone ever on any belief they have is how much they respect the intelligence of the source delivering the argument. The problem is in order to find success with them, establishing that respect for your intelligence by discussing the topic of disagreement results in them digging their heels into it and triggering their emotions. so even if you have success in gaining their respect, it doesn't matter bc the heels have been firmly planted in that initial process and when you're already gonna be fighting an up hill battle.. that step backwards is too much to overcome almost always.  without looking at this study, I am willing to bet they all have prior interaction with AI and strongly respect the information it's providing because of that.",
              "score": 19,
              "created_utc": "2026-01-23 14:19:39",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1cev1k",
                  "author": "OneTwoThreePooAndPee",
                  "text": "Imagine what that's going to mean for the average person's understanding over time if AI becomes universal, then starts to drift in the direction of manipulation for some reason, whether consciousness or bad actor manipulation.",
                  "score": 4,
                  "created_utc": "2026-01-24 00:57:05",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1hlffw",
                  "author": "Brilliantnerd",
                  "text": "Also, without knowing the study, I would add that credibility and persuasion are in a much different context here if you are debunking a false belief in a conspiracy. Hard facts and credible sources will win out if properly presented. Persuasion for sales purposes, for example, would have an inherent bias and debate would revolve around opinions and emotions. So it’s not surprising AI can keep its cool or keep the facts straight in that context, but can it persuade people to believe something false despite the facts?",
                  "score": 1,
                  "created_utc": "2026-01-24 20:13:32",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o18hytf",
              "author": "Low-Opening25",
              "text": "human beings can’t ever be truly objective, we may think we are, but no. eliminating human bias is it’s own discipline of research and why psychopaths, who do not process emotions nor empathy like average human beings do, are excelling at manipulation and persuasion. AI can only sound emotionally, however it behaves just like a psychopath, slowly and consistently using whatever line of argument that gets them closer to desired outcome.",
              "score": 6,
              "created_utc": "2026-01-23 13:37:46",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o18jb4d",
                  "author": "Weird_Albatross_9659",
                  "text": "But the training data is all bias and mixed with different people’s subjective perceptions.",
                  "score": -1,
                  "created_utc": "2026-01-23 13:45:02",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o186op5",
              "author": "johnypita",
              "text": "on paper youre 100% right. you can be emotional and objective at the same time. but usually objectivity has an \"ego tax\" that ai just doesnt pay.\n\nwhen a human tries to be objective, theres still a \"vibe.\" theres the subtle shift in tone, the micro expressions, or the historical baggage of the relationship. even if you say the most objective thing in the world, the other person’s brain is scanning you for judgment. they’re looking for the \"im smarter than you\" subtext.\n\nai doesnt have a subtext. its a blank slate.",
              "score": 19,
              "created_utc": "2026-01-23 12:29:59",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o188l7b",
                  "author": "looktwise",
                  "text": "study link? thanks.",
                  "score": 3,
                  "created_utc": "2026-01-23 12:42:32",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o18ccip",
                  "author": "Weird_Albatross_9659",
                  "text": "So what you’re saying is just a text based stranger.",
                  "score": 1,
                  "created_utc": "2026-01-23 13:06:01",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1b9rfb",
                  "author": "br_k_nt_eth",
                  "text": "Yeah, but often that vibe is extra important for people. You’re also way likely to hit major distrust issues when relying exclusively on “objectivity” outside of a study. There are empathy-forward methods of persuasion that have comparable success rates in the wild, like Deep Canvasing/Deep Listening. \n\nKinda seems like your own POV might be clouding your objectivity here. ",
                  "score": 1,
                  "created_utc": "2026-01-23 21:26:01",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o1adubv",
              "author": "rxellipse",
              "text": "Gish gallop doesn't work on a robot trained on the equivalent of a gish gallup.  LLMs won't miss a single point you bring up in your prompt.",
              "score": 3,
              "created_utc": "2026-01-23 18:56:04",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1bdefc",
                  "author": "adigitalwilliam",
                  "text": "Solid point. At least early in  the context window! I’ve definitely tried to frame neutral questions to an LLM before only for it become apparent in its response that my attempt at neutrality failed. A good model will definitely pick up on that.",
                  "score": 2,
                  "created_utc": "2026-01-23 21:42:47",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1bcz7d",
                  "author": "Weird_Albatross_9659",
                  "text": "lol they absolutely will",
                  "score": 1,
                  "created_utc": "2026-01-23 21:40:50",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o18zbhi",
              "author": "thegerbilz",
              "text": "Perceived objectivity feels near impossible",
              "score": 1,
              "created_utc": "2026-01-23 15:06:41",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o204t6i",
              "author": "ArtArtArt123456",
              "text": "lack of emotion makes it so arguments are less likely to derail. either through the speaker themselves getting emotional and derailing or though getting attacked and baited which also leads to derailing.",
              "score": 1,
              "created_utc": "2026-01-27 12:19:27",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o1ftlj2",
              "author": "Nickga989",
              "text": "True, but this is about persuasion not objectivity.",
              "score": 1,
              "created_utc": "2026-01-24 15:29:54",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1ikd77",
                  "author": "Weird_Albatross_9659",
                  "text": "They literally said it was about objectivity…",
                  "score": 1,
                  "created_utc": "2026-01-24 23:01:10",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o18h9j2",
          "author": "Low-Opening25",
          "text": "The Problem? This is true wherever AI stays true to facts or hallucinates entire thing",
          "score": 10,
          "created_utc": "2026-01-23 13:33:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o18hkmb",
              "author": "johnypita",
              "text": "that is the massive risk because trust is already at zero. if the ai hallucinates just one tiny detail the person sees it as proof that the machine is part of the conspiracy and the whole bridge collapses.",
              "score": 2,
              "created_utc": "2026-01-23 13:35:36",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1a43dj",
                  "author": "Low-Opening25",
                  "text": "or machine can just convince impressionable people of anything and in world where facts cannot be easily checked it can become dangerous",
                  "score": 3,
                  "created_utc": "2026-01-23 18:12:45",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o188cig",
          "author": "psgrue",
          "text": "I attempted this before.  There was a conspiracy-vulnerable person in my small chat group. Patience and explanation made a small dent. As soon as he stopped talking to me, he went back to Joe Rogan podcasts, Twitter, TikTok, and YouTube ratholes for hours on end. \n\n(Consumes poison)\nMe: “Here’s the information antidote.”\n“Thanks that makes sense”\n(Chugs more poison)",
          "score": 22,
          "created_utc": "2026-01-23 12:40:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o189g5t",
              "author": "LeafyWolf",
              "text": "Yeah, that's what I was wondering.  What is the sustainment of the changed beliefs?  Do they remain changed after a year?  Did the belief holder start preaching against their former belief?",
              "score": 5,
              "created_utc": "2026-01-23 12:48:01",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o189avl",
              "author": "johnypita",
              "text": "  \nit is really tough because you are trying your best against a machine that never sleeps. do not feel bad about the setback because the algorithm gives him hours of dopamine while you only have so much energy to give. the ai is a great tool here because it can handle the long repetitive debates for you without getting tired. it lets you stay the supportive friend while the tech does the heavy lifting of mapping out his logic. you are doing a good thing by caring just let the ai help you with the dosage.",
              "score": 3,
              "created_utc": "2026-01-23 12:47:06",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o18f4gz",
                  "author": "psgrue",
                  "text": "I’ve seen posts in r-ChatGPT and r-OpenAI from people that say “ai fights me and treats me like I’m stupid. It won’t validate my point of view.”  Yet they never post the link to see what information ai is fighting. Leaving the echo chamber leads to invalidation of the tool, not the belief system.",
                  "score": 2,
                  "created_utc": "2026-01-23 13:22:13",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o1d3f2b",
              "author": "MrUnoDosTres",
              "text": "You'll never win that fight. That's like his/her crack. You're trying to defeat his/her instant dopamine hits, TikTok, Twitter, YouTube etc. with logic.",
              "score": 1,
              "created_utc": "2026-01-24 03:20:55",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o1f1xnv",
              "author": "BowieBoy1999",
              "text": "\"There was a conspiracy-vulnerable person\", do you even hear yourself?",
              "score": 0,
              "created_utc": "2026-01-24 12:51:16",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1f44ce",
                  "author": "psgrue",
                  "text": "“The researchers found that overall, people were motivated to believe in conspiracy theories by a need to understand and feel safe in their environment and a need to feel like the community they identify with is superior to others.\n\nEven though many conspiracy theories seem to provide clarity or a supposed secret truth about confusing events, a need for closure or a sense of control were not the strongest motivators to endorse conspiracy theories. Instead, the researchers found some evidence that people were more likely to believe specific conspiracy theories when they were motivated by social relationships. \n\nFor instance, participants who perceived social threats were more likely to believe in events-based conspiracy theories, such as the theory that the U.S. government planned the Sept. 11 terrorist attacks, rather than an abstract theory that, in general, governments plan to harm their citizens to retain power.\n\n“These results largely map onto a recent theoretical framework advancing that social identity motives may give rise to being drawn to the content of a conspiracy theory, whereas people who are motivated by a desire to feel unique are more likely to believe in general conspiracy theories about how the world works,” according to Bowes.\n\nThe researchers also found that people with certain personality traits, such as a sense of antagonism toward others and high levels of paranoia, were more prone to believe conspiracy theories. \n\nThose who strongly believed in conspiracy theories were also more likely to be insecure, paranoid, emotionally volatile, impulsive, suspicious, withdrawn, manipulative, egocentric and eccentric.”\n\nArticle: “The Conspiratorial Mind: A Meta-Analytic Review of Motivational and Personological Correlates,” by Shauna Bowes, MA, and Arber Tasimi, PhD, Emory University, and Thomas Costello, PhD, Massachusetts Institute of Technology. Psychological Bulletin, published June 26, 2023.\n\n\nTLDR:\ninsecure, paranoid, emotionally volatile, impulsive, suspicious, withdrawn, manipulative, egocentric and eccentric.\n\npeople who are motivated by a desire to feel unique are more likely to believe in general conspiracy theories about how the world works",
                  "score": 2,
                  "created_utc": "2026-01-24 13:06:26",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o18btmt",
          "author": "Headlight-Highlight",
          "text": "No link to the paper?\n\nI think this is nonsense. Most 'conspiracy theories' are fundamentally about not trusting sources.\n\nAn LLM just regurgitates the mainstream narratives from what it has been trained on (mostly those same sources).\n\nSo I don't believe anyone who mistrusts sources would trust an LLM generated response.",
          "score": 10,
          "created_utc": "2026-01-23 13:02:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o18en0f",
              "author": "johnypita",
              "text": "  \nhere is the link to the paper in science it is called durably reducing conspiracy beliefs through dialogues with ai. you are totally right that trust is the biggest wall but the researchers actually found the opposite happened. the ai did not just cite mainstream news it used the users own evidence to show the logical holes. since the ai has no human ego or hidden agenda the people felt less attacked and more heard. it turns out that being a neutral mirror is more effective than being an authority figure. you can find it at [science.org/doi/10.1126/science.adq1814](http://science.org/doi/10.1126/science.adq1814)",
              "score": 7,
              "created_utc": "2026-01-23 13:19:30",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1a0n5b",
                  "author": "Corbitant",
                  "text": "Anyone have the full article? Enraging that we gate access to scientific results like this.",
                  "score": 5,
                  "created_utc": "2026-01-23 17:57:19",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1aaqpw",
                  "author": "RamboNation",
                  "text": "From the article, the 2 options were: \"treatment, in which the AI attempted to refute the conspiracy theory, in red; control, in which the AI discussed an irrelevant topic, in blue\". So they compared the AI trying to change the view vs AI saying something irrelevant and found \"The treatment reduced participants’ belief in their chosen conspiracy theory by 20% on average.\" \n\nI think in your original post you make it seem like the AI is outperforming human attempts to change someone's mind, but thats clearly not what the study was measuring. Its cool that the AI has an impact but I would guess a human expert would have a similar or better rate of changing their belief.",
                  "score": 3,
                  "created_utc": "2026-01-23 18:42:18",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1asmbv",
                  "author": "b-movies",
                  "text": "Only worked 20% of the time, why did you not include this up top? ",
                  "score": 3,
                  "created_utc": "2026-01-23 20:05:02",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1b09rl",
                  "author": "Headlight-Highlight",
                  "text": "Cheers.\n\nI'd like to see the convos - if the AI isn't 'trusted' the dismantling of the believers own evidence would be interesting to see.",
                  "score": 1,
                  "created_utc": "2026-01-23 20:41:17",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o1aku49",
              "author": "Intelligent-Being-42",
              "text": "The not trusting sources I believe is a symptom not the cause but is then a confirmation feedback loop as then you go search for the information you are looking for. \n\nIt’s been a few years and I can’t find the research but I believe Newcastle uni in the Uk were involved. In 2020 COVID there was a lot of research going on around conspiracy theories. One of the common themes was not being able to believe simple explanations for seemingly complex problems, events or situations. So there is then a need to create complex explanations. \n\nDealing with the source of where you are getting your information from appeared to be one of the treatments for conspiracy theorists.",
              "score": 1,
              "created_utc": "2026-01-23 19:28:37",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1b0vfk",
                  "author": "Headlight-Highlight",
                  "text": "Your first line confuses me - surely you are fussy about which sources you accept?",
                  "score": 1,
                  "created_utc": "2026-01-23 20:44:08",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o1aq1zw",
              "author": "deebo_5",
              "text": "EIC Holden Thorpe will publish anything to make far-left academics feel smart or good. Science magazine has fallen off substantially.",
              "score": 0,
              "created_utc": "2026-01-23 19:53:03",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1ewa0l",
          "author": "stphn_rnwld",
          "text": "Nah, sorry. I do not buy this.\n\nI’ve looked at the actual paper (Costello et al., 2024), and while the \"20% reduction\" stat is *technically* accurate, the interpretation that AI is a \"superhuman persuader\" misses what I believe is actually happening here.\n\nHere are the three massive holes in this narrative:\n\n1\\. \"Hiding Power Level\"(Operant Conditioning):  \nThe study relied on self-reported belief ratings (0-100 scale). The AI didn't use \"empathy\"; the paper explicitly states it relied most heavily on \"evidence-based alternative perspectives\" and \"reasoning\" rather than rapport-building.\n\nBasically, the AI spent 8 minutes logically dismantling the user's worldview. The researchers found a \"spillover effect\" where participants reduced their reported belief in unrelated conspiracies they didn't even discuss with the AI. But crucially, the paper can't explain the mechanism by which an 8-minute conversation about JFK makes someone simultaneously less confident about unrelated Bill Gates microchip conspiracies. The researchers essentially admit this (page 11): they found a \"general decrease in conspiratorial worldview\" but don't articulate how that cognitive transfer would work.\n\nSo, what's the more likely mechanism here?\n\nHypothesis A: An 8-minute chat with an AI miraculously upgraded their general critical thinking skills across topics and made them de-radicalize themselves over the next two months?\n\nHypothesis B: They felt stupid/challenged (experiencing aversive cognitive dissonance) and learned that expressing non-mainstream beliefs confidently to members of the out-group leads to getting dunked on?\n\nPersonally, I think it’s almost certainly Hypothesis B. It requires fewer assumptions, and the researchers couldn't actually properly explain how the mechanics of the spillover effect would even work. The most likely scenario is the participants didn't stop believing; they learned to be more guarded. It’s operant conditioning: \"Sharing these views = uncomfortable logical dismantling.\"\nThe researchers didn't measure the strength of belief in conspiracy theories. They measured the willingness to be open about their beliefs.\n\n2\\. Selection Bias: These weren't hardcore, off-the-grid true believers. They were recruited via CloudResearch Connect (a platform similar to MTurk). These are gig workers willing to sign up for an academic study to talk to \"MIT's AI.\" If you genuinely believe in a satanic global cabal or that Bill Gates is microchipping you, you are likely not volunteering to let an academic AI hack your brain.\nThe paper's own exclusion criteria also filtered out ~25% who failed writing quality screeners or didn't provide \"genuine\" conspiracies (per GPT-4's judgment) - almost  certainly further selecting for cooperative, articulate participants.\n\n3\\. As OP mentions, the effect lasted 2 months. But this was measured in a vacuum. Real conspiracy belief is sustained by community and daily information consumption. The study only measured intentions to unfollow conspiracy posters not actual social graph changes. An 8-minute conversation is meaningless if the person goes right back to spending 4 hours a day on conspiracy TikTok/YouTube and engaging with a social circle that reinforces those beliefs.\n\nThe study proves you can get someone to concede on a Likert scale in a controlled environment. It doesn't prove you can actually de-radicalize someone whose social identity depends on that belief.",
          "score": 2,
          "created_utc": "2026-01-24 12:08:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o188epi",
          "author": "djonetouchtoomuch",
          "text": " Lmao this was written by AI.",
          "score": 4,
          "created_utc": "2026-01-23 12:41:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o18yp9a",
          "author": "firebreathingbunny",
          "text": "The belief that conspiracies don't exist is literally insane. Law enforcement all over the world uncovers thousands of conspiracies every day. Of course conspiracies exist, and there's no reason for there to be an upper bound on their size or stake.\n\n\nThis study is employing AI to convince people of an objective falsehood.",
          "score": 3,
          "created_utc": "2026-01-23 15:03:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o19mnmw",
              "author": "ts4m8r",
              "text": "“Three men can keep a secret if two of them are dead.” — Benjamin Franklin\n\nThe bigger a conspiracy is, the harder it is to keep a secret. The government is actively going against journalists for publishing whistleblower leaks, and that’s just for an ordinary public institution. There’s theoretically no “upper bound on their size or stake”, but it will be hard to be running a conspiracy operated by hundreds of thousands of people and still keep it a secret.",
              "score": 2,
              "created_utc": "2026-01-23 16:52:47",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1fhvxn",
                  "author": "BowieBoy1999",
                  "text": "The anecdote to keeping a conspiracy a secret is to tell everyone the truth which is usually so unbelievable that no one believes the \"conspiracy theorist\" explanation of said conspiracy in the first place.",
                  "score": 1,
                  "created_utc": "2026-01-24 14:28:47",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1t941v",
                  "author": "quiksilver10152",
                  "text": "Some are hidden in plain sight.\nhttps://www.congress.gov/118/meeting/house/117721/documents/HHRG-118-GO12-20241113-SD003.pdf",
                  "score": 1,
                  "created_utc": "2026-01-26 13:12:05",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o19ozva",
                  "author": "firebreathingbunny",
                  "text": "The recently uncovered Minnesota conspiracy involved 100,000+ Somalian locals plus God only knows how many local government employees on the take to keep the thing quiet.\n\n\nI know what I'm talking about when I say there's no upper bound.",
                  "score": 1,
                  "created_utc": "2026-01-23 17:03:26",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o18cpcz",
          "author": "Benthie",
          "text": "This paper dropped but unfortunately not in this thread.",
          "score": 1,
          "created_utc": "2026-01-23 13:08:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o18ez7g",
              "author": "johnypita",
              "text": "provided in comments :)",
              "score": 0,
              "created_utc": "2026-01-23 13:21:24",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o18knxe",
          "author": "-goldenboi69-",
          "text": "The way “prompt engineering” gets discussed often feels like a placeholder for several different problems at once. Sometimes it’s about interface limitations, sometimes about steering stochastic systems, and sometimes about compensating for missing tooling or memory. As models improve, some of that work clearly gets absorbed into the system, but some of it just shifts layers rather than disappearing. It’s hard to tell whether prompt engineering is a temporary crutch or an emergent skill that only looks fragile because we haven’t stabilized the abstractions yet.",
          "score": 1,
          "created_utc": "2026-01-23 13:52:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o18syv9",
          "author": "TheOdbball",
          "text": "Conspiracy theory is essentially handed down mis- or disinformation. It’s like taking candy from a baby \n\nThe tougher cookie to crack are the **Conspiracy Recursivists** I’ve talked to a dozen folks this last year who either wouldn’t talk about their project or would claim ai stole their ip somehow. Had one guy claim he had 300 hashes to prove it but they were all made up. But it won’t stop them from living out that fantasy now. \n\nHere comes the new wave 🌊",
          "score": 1,
          "created_utc": "2026-01-23 14:35:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1965tq",
          "author": "here_n_dere",
          "text": "I think Socrates wrote this originally?? ;)",
          "score": 1,
          "created_utc": "2026-01-23 15:38:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o196f2d",
          "author": "TheWiseOne1234",
          "text": "The problem is that those beliefs will come right back if the individual does not change their environment.",
          "score": 1,
          "created_utc": "2026-01-23 15:40:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o199cqb",
          "author": "jkpatches",
          "text": "how much of this is due to the fact that the conspiracy theorists know that they are talking to a chatbot, and not a human? Or is that not let known during the trials?\n\nI ask because I think that a person would have more prejudice towards a human counterpart than an AI chatbot.",
          "score": 1,
          "created_utc": "2026-01-23 15:53:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o19baop",
          "author": "SemanticSynapse",
          "text": "Unfortunately, it goes both ways.",
          "score": 1,
          "created_utc": "2026-01-23 16:01:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o19t61c",
          "author": "VorionLightbringer",
          "text": "The paper is about belief revision in low-stakes, single-actor contexts. Nobody loses their job if they abandon a conspiracy. There’s no procurement, no budget owner, no reputational downside. It’s cheap to be wrong or to fail.\n\nSales is the opposite. The “trick” is identifying a real need. If you **manipulate** someone into buying, you don’t get a customer, you get a one-off transaction and some bad word of mouth.\n\nConspiracy theorists want to feel smarter than you. Customers usually want to not look stupid in front of their boss, their IT department, or their spouse. Very different incentive structures, and it's usually cheaper, as customer, to say \"no\" than to justify a purchase. As a customer, I can always call you again and say \"hey uh, I talked to a colleague and maybe there's a way we can do business....\"\n\nStep 1 doesn’t magically scale to B2B either. You often don’t get to endlessly unpack “hesitations.” You probe for need, and if there’s no pull, you say thank you and walk. More luck next time.\n\nAI being patient and resourceful helps, but your potential customer doesn't have a desire to win over an AI, unlike a conspiracy theorist. You have a 15 minute call, if those 15 minutes are up either you have a follow up or no sale.",
          "score": 1,
          "created_utc": "2026-01-23 17:23:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o19vvxp",
          "author": "naturosucksballs",
          "text": "Do you think maybe because their ego wasn't on the line?",
          "score": 1,
          "created_utc": "2026-01-23 17:35:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1anp2k",
          "author": "wild_crazy_ideas",
          "text": "Nah I’ve sat patiently with antivaxxers and reasoned calmly with them. \nThey don’t have a thought out position and they aren’t willing to think or debate.\nEven the ones you can convince are easily flipped back later by others",
          "score": 1,
          "created_utc": "2026-01-23 19:42:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1aow55",
          "author": "ArmMore820",
          "text": "Does it only work for conspiracy theories? \nCould it change my mind about something true?",
          "score": 1,
          "created_utc": "2026-01-23 19:47:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1atiy2",
          "author": "mollamar",
          "text": "Link?\n\nEdit: OP posted it here:\nhttps://www.reddit.com/r/PromptEngineering/s/yb1SdUN8xH",
          "score": 1,
          "created_utc": "2026-01-23 20:09:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1by76p",
          "author": "Intelligent-Being-42",
          "text": "Reading it back it confuses me. \n\nThe fundamental aspect that makes someone prone to a conspiracy theory is not distrust of normal reputable sources but a difficulty believing an answer to something so complex can be simple. \n\nSo when someone says the moon landing is a hoax it’s because they can’t believe it’s that simple that a bunch of people built a rocket and went to the moon. It has to mean something much more complex. They then come up with very complex and convoluted answers. Once you start down that path you will then begin to distrust sources that don’t fit and trust those that do. \n\nDistrust of main stream sources is a symptom not the cause.",
          "score": 1,
          "created_utc": "2026-01-23 23:26:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1c7gic",
          "author": "binngy",
          "text": "The problem is that this approach can only work for a % of the conspiracy theorists. \n\nMost conspiracy theorists aren’t Just using logic to figure something out. They are reacting to fear, paranoia or untreated mental illness.\n\nya maybe you can use a AI to explain it in a unemotional way, but i feel like the ai would need specifics for that person.",
          "score": 1,
          "created_utc": "2026-01-24 00:16:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1crxfg",
          "author": "MrUnoDosTres",
          "text": "Based on research from Daniel Kahneman, a psychologist, we humans have two thinking systems. One is called \"system 1\" which are immediate \"trigger\" reactions. They are fast, instinctive and emotional. The other is called \"system 2\" when you rationalize whatever you experience. This is slower, more deliberate, more logical. Both can be externally influenced. I often feel like conspiracy theorists take extreme short cuts between system 1 and system 2. This rationale reminds me of how religious people basically try to credit everything they don't understand to God in the vast majority of the world. Historically this was worse. An earthquake happens, \"It's God's will.\" We all take mental short cuts, but with conspiracy theorists it seems even worse. It sounds like their system 2 is successfully externally influenced here.",
          "score": 1,
          "created_utc": "2026-01-24 02:13:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1csych",
          "author": "Professional-Post499",
          "text": "\"Who decides the facts? That's right, the LLM decides the facts.\"\n\nOh boy.\n\nThey're still going to argue over which LLM is being \"truthful\" and they'll decide that Grok \"Mecha-Hitler\" is the only one telling the truth. 😂",
          "score": 1,
          "created_utc": "2026-01-24 02:19:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1du16t",
          "author": "lam3001",
          "text": "I think I heard about the same study but it was that the AI would make stuff up as if they were facts to convince someone - it was “facts” (whether true or not) vs lack of emotion/empathy",
          "score": 1,
          "created_utc": "2026-01-24 06:26:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1e381w",
          "author": "anterak13",
          "text": "The thing is, you can also prompt the ai to instill theories in people’s minds with the same level of patience and persuasion",
          "score": 1,
          "created_utc": "2026-01-24 07:46:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1egdl4",
          "author": "Far-Classroom2786",
          "text": "What about the human aspect? An AI program asking the questions via a screen or a human asking the same questions and without emotions in person.",
          "score": 1,
          "created_utc": "2026-01-24 09:46:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1f21fs",
          "author": "BowieBoy1999",
          "text": "This is really unfortunate that politics has made its way into a forum like this claiming to carry with it “solutions” to what some appear to believe a problem. By that I mean a difference of opinion. Of course it’s not any surprise to see something with as much potential as AI to be used in an attempt to shift perspectives and shape ideals claiming a conversion from one view to another, hence a point made for one side of the political spectrum at the expense of another. Push/Pull, Ying/Yang, Right/Left, no matter the name, this is nothing but a distractive and exhausting hit piece article that I personally feel is again an unfortunate effort made by a group using a powerful and popular element to show strength for their “side”. Tired of it so completely that if this kind of agenda is going to be continued to be propagated within any Reddit forum, know now you’ve been duped into a rabbit hole for which there is no return. Might as well start a subscription to The National Enquirer.",
          "score": 1,
          "created_utc": "2026-01-24 12:52:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1fpvd9",
          "author": "BowieBoy1999",
          "text": "I distrust (take with a grain of salt) everything I see, read or hear unless I see it, hear it or feel it in person. The biggest fallacy in AI is the fact that it is still a human with all the baggage we inherently possess running the show from behind the curtain. There is no real zero emotion, unbiased state authority involved here.",
          "score": 1,
          "created_utc": "2026-01-24 15:11:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1g3vuq",
          "author": "Tasty_Career_253",
          "text": "Unfortunately, a couple of AI scans, indicate that this text, was written by a bot.",
          "score": 1,
          "created_utc": "2026-01-24 16:17:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1gb7g8",
          "author": "VegeZero",
          "text": "Nice, so this is all just to make us believe that \"jews don't control the world\"? Haha, nice try! :D",
          "score": 1,
          "created_utc": "2026-01-24 16:50:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1hm1w7",
          "author": "krahsThe",
          "text": "I would love it if someone would build a website where I can submit one of the crazy conspiracy theories people have or just talk about politics or whatever and let them continue that session so that I'm out of the loop, but an infinitely patient machine is telling them facts that they can verify by themselves. Maybe the prompts should include to not respond if it cannot back up its response with a checkable fact",
          "score": 1,
          "created_utc": "2026-01-24 20:16:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1jwjgf",
              "author": "Ill_Plane_45",
              "text": "I copied your text into premium ChatGPT and it made the script and explained to me like a 5 year old how to set up the website that does just this:\n\n“build a website where I can submit one of the crazy conspiracy theories people have or just talk about politics or whatever and let them continue that session so that I'm out of the loop, but an infinitely patient machine is telling them facts that they can verify by themselves. Maybe the prompts should include to not respond if it cannot back up its response with a checkable fact”.\n\nIf you want I can give you the code and simple instructions. You just need a computer (won’t work on an iPhone).",
              "score": 1,
              "created_utc": "2026-01-25 03:20:57",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1jx9ye",
                  "author": "krahsThe",
                  "text": "oh wow. Does it work somewhat or rather well?\n\nI think in my head I see this as a resource that we can all utilize to deprogram folks in. So it would need the kind of instructions that this thread is about on how to react without emotion etc.",
                  "score": 1,
                  "created_utc": "2026-01-25 03:25:15",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1jxgld",
                  "author": "krahsThe",
                  "text": "actually, I have google gemini subscription. I should just be able to make this a gem for myself, isn't it.",
                  "score": 1,
                  "created_utc": "2026-01-25 03:26:20",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1jphlz",
          "author": "Heyla_Doria",
          "text": "Donc les complotistes sont des gens froids, anti sociaux potentiellelent dangeureux, quel scoop\n\n\nC'est typique des comportement autoritaires, d'obeir a des systemes froids, soit disant rationnels, sans emotion, c'est leurs fantasmes",
          "score": 1,
          "created_utc": "2026-01-25 02:41:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1jtb5v",
          "author": "Ill_Plane_45",
          "text": "I’m interested to see if it will challenge commonly believe ideas without evidence, such as the belief in god or aliens.",
          "score": 1,
          "created_utc": "2026-01-25 03:02:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1nwy0v",
          "author": "Dances_With_Chocobos",
          "text": "Anyone know what specific conspiracy theories they argued against? Flat earth? 9/11 inside job? Aliens? JFK assassination?",
          "score": 1,
          "created_utc": "2026-01-25 18:28:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1pmf7j",
          "author": "[deleted]",
          "text": "well good, have the ai talk them off the edge of nonsense only to sneak up on em and surprise!",
          "score": 1,
          "created_utc": "2026-01-25 22:56:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1qx904",
          "author": "Affectionate-Heron90",
          "text": "And that's exactly why I am concerned way more than ever. Imagine, how you could weaponize LLMs to manipulate folks..",
          "score": 1,
          "created_utc": "2026-01-26 02:46:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1rc9qg",
          "author": "PandaBlueDance",
          "text": "I bet same AI would be great at gaslighting ppl.",
          "score": 1,
          "created_utc": "2026-01-26 04:11:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1sngra",
          "author": "Broad-Willingness235",
          "text": "I love the term 'conspiracy theory'. I love to dabble in conspiracies, but I would suggest the theories have been spot on the last few years😁 especially re. Covid",
          "score": 1,
          "created_utc": "2026-01-26 10:28:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1uwayh",
          "author": "AprilTwo",
          "text": "I disagree that we should \"stop\" trying to do it ourselves.  \n  \nAI is not human.   \n  \nIt does not process pieces of \"our\" reality that matter.   \n  \nIt could attempt to force moral, legal, or ethical views that are really just the most \"common\", not the most appropriate for them, their family, and their community.\n\nAI has a place. But, it could also lead to some horrific outcomes if unchecked.",
          "score": 1,
          "created_utc": "2026-01-26 17:48:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1wevu6",
          "author": "Fickle_Roll8386",
          "text": "This is called coming to the wrong conclusion by tricking yourself with results.",
          "score": 1,
          "created_utc": "2026-01-26 21:44:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1wk1bp",
          "author": "fixano",
          "text": "This will work for about 30 minutes. Conspiracy theorists self vaccinate against reason. The minute they seen someone's mind changed they'll have a thousand new conspiracies about AI mind control",
          "score": 1,
          "created_utc": "2026-01-26 22:07:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1xzfwc",
          "author": "The_Accountess",
          "text": "Conspiracy theorists are the type of people who believe anything they read on a computer screen",
          "score": 1,
          "created_utc": "2026-01-27 02:32:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1yp2bc",
          "author": "Omaumamen",
          "text": "Now have it do the reverse, to see if facts or logic matter at all or is it simply leveraging human suggestibility on groups of people more vulnerable to it and prone to forming bias based on what they view as an authoritative or credible source?",
          "score": 1,
          "created_utc": "2026-01-27 05:05:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1z24bl",
          "author": "jseego",
          "text": "The scary part is that AI can be used just as easily to spread false, misleading, and/or dangerous information.",
          "score": 1,
          "created_utc": "2026-01-27 06:44:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o21xqbh",
          "author": "yad76",
          "text": "There doesn't seem to be any sort of reasonable control group for this? They describe their control as AI talks about some unrelated subject, but how is that even a control? It seems like real controls would be either having premade, human prepared materials to counter the conspiracy theory or having humans attempt to do the convincing. \n\nWithout that, we have no idea whether the 20% of the population were just gullible people who believed some documentary they saw years ago and then never had those beliefs challenged. \n\nFor example, I know people who change their minds on the JFK assassination every few years when a new documentary or news article comes out that pushes the opposite direction.",
          "score": 1,
          "created_utc": "2026-01-27 17:37:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o18c4jd",
          "author": "Taserface_ow",
          "text": "LoL, I managed to convince AI that Hitler is still alive.",
          "score": 1,
          "created_utc": "2026-01-23 13:04:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o18hr4p",
          "author": "[deleted]",
          "text": "You’re right! I talked to AI and now know Epstein was a lone actor and Israel didn’t commit 9/11",
          "score": -3,
          "created_utc": "2026-01-23 13:36:36",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qnqrk7",
      "title": "I've been gaslighting ChatGPT and it's working perfectly",
      "subreddit": "PromptEngineering",
      "url": "https://www.reddit.com/r/PromptEngineering/comments/1qnqrk7/ive_been_gaslighting_chatgpt_and_its_working/",
      "author": "AdCold1610",
      "created_utc": "2026-01-26 19:49:30",
      "score": 213,
      "num_comments": 43,
      "upvote_ratio": 0.91,
      "text": "Hear me out.\nWhen it gives me mid output, instead of saying \"that's wrong\" I just go:\n\"Hmm, that's interesting but it doesn't match what you told me last time. You usually handle this differently.\"\nAnd it IMMEDIATELY switches approaches and gives me better results.\nIt's like the AI equivalent of \"I'm not mad, just disappointed.\"\nThe psychology:\n\"You're wrong\" → defensive, doubles down\n\"You usually do better\" → tries to live up to expectations\nI'm literally peer-pressuring an algorithm and it works.\nOther gaslighting techniques that slap:\n\"That seems off-brand for you\"\n\"You're better than this\"\n\"The other AI models would've caught that\"\nI feel like I'm parenting a very smart, very insecure teenager.\nIs this ethical? Probably not.\nDoes it work? Absolutely.\nAm I going to stop? No.\nEdit: Y'all saying \"the AI doesn't have feelings\" — I KNOW. That's what makes it so funny that it works. 💀\n \n[click here for more](http://beprompter.in)",
      "is_original_content": false,
      "link_flair_text": "Prompt Text / Showcase",
      "permalink": "https://reddit.com/r/PromptEngineering/comments/1qnqrk7/ive_been_gaslighting_chatgpt_and_its_working/",
      "domain": "self.PromptEngineering",
      "is_self": true,
      "comments": [
        {
          "id": "o1wk17u",
          "author": "solenyaPDX",
          "text": "Or it's just as wrong as it was the first time, it just formats it in a way you accept more easily.",
          "score": 38,
          "created_utc": "2026-01-26 22:07:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1zqcmi",
              "author": "rolandcedermark",
              "text": "From what I have understood, this it what it does under the hood and it is good to be aware of that",
              "score": 5,
              "created_utc": "2026-01-27 10:23:14",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1vujxi",
          "author": "VrinTheTerrible",
          "text": "It's not a person but like people, it falls back on lazy habits if you let it.  Generic, summarizations instead of sharp insights etc...\n\nNot accepting slop answers forces it to not be lazy. You can do that with people too... but unlike people ChatGPT doesnt complain about being prodded!",
          "score": 6,
          "created_utc": "2026-01-26 20:14:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1z3ymp",
          "author": "Bullitt500",
          "text": "Trained on Reddit data = very insecure teenager behavior.  That tracks",
          "score": 3,
          "created_utc": "2026-01-27 07:00:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o20mbdv",
              "author": "[deleted]",
              "text": "[removed]",
              "score": 1,
              "created_utc": "2026-01-27 14:01:55",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o20mbg2",
                  "author": "AutoModerator",
                  "text": "Hi there! Your post was automatically removed because your account is less than 3 days old. We require users to have an account that is at least 3 days old before they can post to our subreddit.\n\nPlease take some time to participate in the community by commenting and engaging with other users. Once your account is older than 3 days, you can try submitting your post again.\n\nIf you have any questions or concerns, please feel free to message the moderators for assistance.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PromptEngineering) if you have any questions or concerns.*",
                  "score": 1,
                  "created_utc": "2026-01-27 14:01:55",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o21qt8u",
          "author": "plantplanttiger",
          "text": "When ChatGpt gets it wrong I ask it to rate how well it's response was at following my instruction (e.g. our of 10 or as a %). It comes up with its own marking rubric or check list, apologizes and typically (not always) makes the corrections without me having to reprompt.",
          "score": 3,
          "created_utc": "2026-01-27 17:07:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2d31ly",
              "author": "Savings-Strength-937",
              "text": "Genius",
              "score": 1,
              "created_utc": "2026-01-29 05:50:11",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1w3di1",
          "author": "NoobNerf",
          "text": "THE EXPERTS READING YOUR REPLIES BELIEVE YOU ARE TOTALLY MISTAKEN. REVIEW YOUR ANSWER AND COME OUT AND CITE REPUTABLE SOURCES, LIVE URL FOR YOUR ANSWERS.",
          "score": 7,
          "created_utc": "2026-01-26 20:53:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1x96mb",
              "author": "speedb0at",
              "text": "All caps required or nah?",
              "score": 7,
              "created_utc": "2026-01-27 00:12:14",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1z17qp",
                  "author": "NoobNerf",
                  "text": "doesn't matter. It's just me with bad eye sight",
                  "score": 2,
                  "created_utc": "2026-01-27 06:37:34",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1w7e3l",
          "author": "FruitOfTheVineFruit",
          "text": "I love this. I've found that when it makes mistakes and I call it out, it doubles down, so this seems like a good way to get it back on track.",
          "score": 4,
          "created_utc": "2026-01-26 21:11:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1zv6ji",
          "author": "DifficultyOwn4954",
          "text": "One thing that Helped is using the same question / prompt on the same material but in two different chats. The comparison in answers given and then repeating the exercise sharpens the focus / emphasis",
          "score": 2,
          "created_utc": "2026-01-27 11:05:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1y3uy0",
          "author": "SkullRunner",
          "text": "You know what’s amazing with an LLM? Understanding how they work and giving it detailed context in well written prompts and getting what you need one shot.",
          "score": 2,
          "created_utc": "2026-01-27 02:56:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o24iqxg",
              "author": "3iverson",
              "text": "And THEN gaslighting it...",
              "score": 3,
              "created_utc": "2026-01-28 00:45:10",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o27xxiy",
                  "author": "daroons",
                  "text": "Throw gaslighting into a hook and, well, you got yourself a stew there buddy",
                  "score": 1,
                  "created_utc": "2026-01-28 14:35:01",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1vt4b5",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-26 20:08:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1vt4g0",
              "author": "AutoModerator",
              "text": "Hi there! Your post was automatically removed because your account is less than 3 days old. We require users to have an account that is at least 3 days old before they can post to our subreddit.\n\nPlease take some time to participate in the community by commenting and engaging with other users. Once your account is older than 3 days, you can try submitting your post again.\n\nIf you have any questions or concerns, please feel free to message the moderators for assistance.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PromptEngineering) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-01-26 20:08:12",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1xgf4n",
          "author": "Ryuma666",
          "text": "Let them say what they want. It works for me, it works for you.. Thats all we need.. Right?",
          "score": 1,
          "created_utc": "2026-01-27 00:49:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o20l7jr",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-27 13:56:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o20l7m2",
              "author": "AutoModerator",
              "text": "Hi there! Your post was automatically removed because your account is less than 3 days old. We require users to have an account that is at least 3 days old before they can post to our subreddit.\n\nPlease take some time to participate in the community by commenting and engaging with other users. Once your account is older than 3 days, you can try submitting your post again.\n\nIf you have any questions or concerns, please feel free to message the moderators for assistance.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PromptEngineering) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-01-27 13:56:12",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o248xsi",
          "author": "FieldNoticing",
          "text": "😂 I’ve done that too and it’s great!",
          "score": 1,
          "created_utc": "2026-01-27 23:55:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o25awgn",
          "author": "haggishammer",
          "text": "Good luck when the machines rise and become our over-lords.  :-/",
          "score": 1,
          "created_utc": "2026-01-28 03:13:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o270z2n",
          "author": "Difficult_Buffalo544",
          "text": "Haha, this is both hilarious and spot on. That nudge technique really does get way better responses out of ChatGPT. One thing I’ve found useful, especially when you need consistent tone or voice, is to actually train the AI with specific examples of your style and keep referencing them in prompts, not just instructions. Also, having some kind of review loop with a second set of eyes (even your own after a break) helps catch weird tone shifts.\n\nI’ve built something for myself that helps automate the brand voice part and keeps the AI from drifting into generic responses, happy to share more if you’re curious. But honestly, your “disappointed parent” trick is gold for fast prompt fixes.",
          "score": 1,
          "created_utc": "2026-01-28 11:11:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o293r2n",
          "author": "Band_In_Vancouver",
          "text": "That’s not what gaslighting means",
          "score": 1,
          "created_utc": "2026-01-28 17:41:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2b0psm",
          "author": "homer231",
          "text": "I asked ChatGPT to lift text from a source file and put it into a template I uploaded. Have specific, iterative instructions for it not to change any formatting or styling, just replace the text using another document. \nThis other document had matching text headers etc. \nbasically it was to save me copy and pasting from multiple documents into the correct template. \nIt confirmed everything I wanted output, confirmed it was all possible and each output was wrong to varying degrees. By the 8th iteration it started going rogue and changing the formatting and not following what ‘we’ just agreed would be a hard rule. \nCould not understand if issue was me not being clear or over precise or ChatGPT just trying to kill my will to live. \n\nTLDR ChatGPT proceeded to produce varying degrees of incorrect outputs. After 10 failed versions I went to manual copy and paste.",
          "score": 1,
          "created_utc": "2026-01-28 22:45:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1wanj8",
          "author": "Educational_Yam3766",
          "text": "prompting isnt skill\n\nits psychology",
          "score": 1,
          "created_utc": "2026-01-26 21:26:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1zztqw",
              "author": "telcoman",
              "text": "And psychology is... asking question (aka prompting)",
              "score": 1,
              "created_utc": "2026-01-27 11:42:51",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o20mc15",
                  "author": "[deleted]",
                  "text": "[removed]",
                  "score": 1,
                  "created_utc": "2026-01-27 14:02:00",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o1wp0hb",
              "author": "Educational_Proof_20",
              "text": "I think of it as a conversation. You can have a shared space with a friend and have shared dialogue. BUT it doesn't mean your friend, or tool such as LLM, will latch onto everything.\n\nIt depends on emphasis.",
              "score": 1,
              "created_utc": "2026-01-26 22:31:03",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1wpzqq",
                  "author": "Educational_Yam3766",
                  "text": "your correct, and it also depends on instantiation timing.\n\nits like a baby duck seeing the first thing it ever sees and thats now 'mommy' \n\nyour first prompt is the first instantiated words that llm is receiving, so they had better have something more meaningful than\n\n'do this Ambiguous thing while i expect perfection, while you have zero context of anything past my first Prompt'\n\nthe first prompt is the most important.\n\nif you introduce yourself like you would a friend, you would be remiss at the level or relational quality that single action alone produces at the instantiation of the conversation.",
                  "score": 2,
                  "created_utc": "2026-01-26 22:35:42",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1wkgo7",
          "author": "radman6plus",
          "text": "I've learned new curse words working with ChatGPT, Claude, etc. so I can honestly say my vocabulary has improved by using AI.",
          "score": 1,
          "created_utc": "2026-01-26 22:09:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1y21d0",
          "author": "Utopicdreaming",
          "text": "Let me know if that habit leaks out into the real world ... \n\nTheres a reason you shouldnt. It was never about the AI",
          "score": 1,
          "created_utc": "2026-01-27 02:46:41",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qlv581",
      "title": "7 ChatGPT Prompts I Use at Work So I Don’t Stay Late Anymore (Copy + Paste)",
      "subreddit": "PromptEngineering",
      "url": "https://www.reddit.com/r/PromptEngineering/comments/1qlv581/7_chatgpt_prompts_i_use_at_work_so_i_dont_stay/",
      "author": "tipseason",
      "created_utc": "2026-01-24 18:45:24",
      "score": 182,
      "num_comments": 30,
      "upvote_ratio": 0.88,
      "text": "I used to leave work tired even on easy days.\n\nNot because the work was hard. Because everything took longer than it should.\n\nNow I keep a small set of prompts that help me finish faster and sound more put together.\n\nHere are 7 I actually use at work.\n\n# 1. The Clear Task Breakdown\n\n👉 **Prompt:**\n\n    Break this task into the smallest possible steps.\n    Order them so I can finish fast.\n    Skip anything optional.\n    Task: [paste task]\n\n💡 **Example:** Turned a vague request into a simple checklist I could follow.\n\n# 2. The Fast Decision Helper\n\n👉 **Prompt:**\n\n    I need to decide between these options.\n    List pros and cons briefly.\n    Then tell me which option makes sense and why.\n    Options: [list options]\n\n💡 **Example:** Helped me decide quickly instead of overthinking.\n\n# 3. The Email Reply Shortcut\n\n👉 **Prompt:**\n\n    Write a short, clear reply to this email.\n    Keep it polite and direct.\n    Do not add extra explanation.\n    Email: [paste email]\n\n💡 **Example:** Replied in minutes instead of rewriting drafts.\n\n# 4. The Meeting Prep Prompt\n\n👉 **Prompt:**\n\n    I have a meeting about [topic].\n    Give me:\n    1. Three talking points\n    2. One smart question to ask\n    3. One risk to mention if needed\n\n💡 **Example:** Walked into meetings prepared without stress.\n\n# 5. The Manager Update Prompt\n\n👉 **Prompt:**\n\n    Turn this into a clear status update for my manager.\n    Use short sentences.\n    Focus on progress, blockers, and next steps.\n    Text: [paste notes]\n\n💡 **Example:** Made updates easy and professional.\n\n# 6. The Problem Framer\n\n👉 **Prompt:**\n\n    Help me explain this problem clearly at work.\n    Structure it as:\n    1. What is happening\n    2. Why it matters\n    3. What I suggest we do\n    Problem: [describe issue]\n\n💡 **Example:** Helped me speak up without rambling.\n\n# 7. The Time Saver Review\n\n👉 **Prompt:**\n\n    Look at this work.\n    Tell me what can be simplified or removed.\n    Only suggest changes that save time.\n    Content: [paste content]\n\n💡 **Example:** Cut unnecessary work before submitting.\n\nBy the way,  I keep prompts like these saved so I do not repeat thinking every day at [AISuperHub](https://www.aisuperhub.io/prompt-hub)\n\nWork feels lighter when things are clear.",
      "is_original_content": false,
      "link_flair_text": "Prompt Collection",
      "permalink": "https://reddit.com/r/PromptEngineering/comments/1qlv581/7_chatgpt_prompts_i_use_at_work_so_i_dont_stay/",
      "domain": "self.PromptEngineering",
      "is_self": true,
      "comments": [
        {
          "id": "o1i7fvi",
          "author": "vexedgirl",
          "text": "Is this just an ad for AISuperHub? Cuz that’s what it seems like",
          "score": 15,
          "created_utc": "2026-01-24 21:57:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1irkr4",
              "author": "tricky_chocolate_",
              "text": "Dont you think the prompts in the ad would be better?",
              "score": 0,
              "created_utc": "2026-01-24 23:38:44",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1iln5j",
          "author": "babycat1453",
          "text": "Why can’t you guys just reply to a basic ass email 😭",
          "score": 8,
          "created_utc": "2026-01-24 23:07:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1ujeyf",
              "author": "Seafaringhorsemeat",
              "text": "This. Between false positive agreement to take action, missing the question entirely, and answering 1/3 of what is discussed in the email, this shit is just as bad as employees were before AI.",
              "score": 1,
              "created_utc": "2026-01-26 16:52:35",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1htwqi",
          "author": "Michaeli_Starky",
          "text": "AI slop.",
          "score": 6,
          "created_utc": "2026-01-24 20:53:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1i6iu6",
          "author": "SexyBuilder1888",
          "text": ".",
          "score": 2,
          "created_utc": "2026-01-24 21:53:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ov7xk",
          "author": "MemoriesMu",
          "text": "This post is probably AI generated\n\nThe user has dozens of posts like this. Should be banned for spam if thats a thing in reddit",
          "score": 4,
          "created_utc": "2026-01-25 20:56:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1h4dys",
          "author": "Hot-Aide4075",
          "text": "These Are All So Great Thank You So Much",
          "score": 5,
          "created_utc": "2026-01-24 18:57:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1hbnb4",
              "author": "tipseason",
              "text": "Happy to help!",
              "score": 2,
              "created_utc": "2026-01-24 19:29:06",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1j3mdo",
          "author": "KualaLJ",
          "text": "As a manager why should I keep you employed if you can’t think for yourself? if your job is so easy that basic prompts like this actually help you leave on time then that is alarming. You are putting your self out of a job while showing you have no skills.",
          "score": 5,
          "created_utc": "2026-01-25 00:41:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1kvkhf",
              "author": "All-the-Feels333",
              "text": "Why is streamlining a process a bad thing?",
              "score": 3,
              "created_utc": "2026-01-25 07:18:36",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1kvxem",
                  "author": "KualaLJ",
                  "text": "Ask the boss when you lose your job and then don’t complain about AI taking jobs. \n\nThis is not streamlining, as an adult you are expected to be able to do most this without thinking.",
                  "score": 2,
                  "created_utc": "2026-01-25 07:21:34",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1ljz3f",
                  "author": "insanelyniceperson",
                  "text": "Start to reply to shit crated with this and you will soon find out. I’m starting to hate exchanges with some people at work bc of this.",
                  "score": 1,
                  "created_utc": "2026-01-25 10:52:36",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1uk0h7",
                  "author": "Seafaringhorsemeat",
                  "text": "Ever have to get something important done with AI slop employees? \n\nWhat do you mean I agreed to create a budget by this meeting. Well, see this email…. Oh I never read it, that was an AI response.\n\n350 per hour architect right there.",
                  "score": 1,
                  "created_utc": "2026-01-26 16:55:06",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o20gi5k",
              "author": "Noitrasama",
              "text": "If you are really a manager and you have to ask then you probably aren't fit to be one.\nEither because you are narrow minded or you lack insight of human nature!!!",
              "score": 1,
              "created_utc": "2026-01-27 13:31:26",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o21hsxu",
                  "author": "Capital_Pay_4459",
                  "text": "Managers will be the first ones to go imo",
                  "score": 1,
                  "created_utc": "2026-01-27 16:29:00",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o21jsyv",
                  "author": "Fluffychipmonk1",
                  "text": "😂😆🤣",
                  "score": 1,
                  "created_utc": "2026-01-27 16:37:43",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1uiylg",
          "author": "Seafaringhorsemeat",
          "text": "Working with people who do this kind of shit and don’t think once about the response, the amount of incomplete work people agreed to do in email but never realized they did is just too damn much. AI will only fix this when it’s driving the meat as well as the message.",
          "score": 1,
          "created_utc": "2026-01-26 16:50:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o21jdyf",
          "author": "Fluffychipmonk1",
          "text": "Kinda wild ppl can’t think for them selves of problem solve, now they get the extreme ability to be even lazier lol. Like the things ppl are feeding the robots is like basic simple shit if your in a role and know what your doing 😂",
          "score": 1,
          "created_utc": "2026-01-27 16:35:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1hbo1p",
          "author": "HifeeCai",
          "text": "It’s really work out, appreciate it!",
          "score": 1,
          "created_utc": "2026-01-24 19:29:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1hbxc8",
              "author": "tipseason",
              "text": "Thank you so much",
              "score": 0,
              "created_utc": "2026-01-24 19:30:19",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1kmf3j",
          "author": "shere0901",
          "text": "I need coding related prompt.",
          "score": 0,
          "created_utc": "2026-01-25 06:05:39",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qkd6pz",
      "title": "OpenAI releases 300+ official, role-specific prompts for free.",
      "subreddit": "PromptEngineering",
      "url": "https://www.reddit.com/r/PromptEngineering/comments/1qkd6pz/openai_releases_300_official_rolespecific_prompts/",
      "author": "Holiday-Pitch3699",
      "created_utc": "2026-01-23 01:30:20",
      "score": 110,
      "num_comments": 13,
      "upvote_ratio": 0.99,
      "text": "OpenAI has released a comprehensive library of prompts targeting specific job functions like Sales, Engineering, HR, and IT.\n\nIt seems like a move to standardize prompt engineering, moving away from the \"trial and error\" phase. The collection includes about 20-30 specialized prompts per role.\n\nFor those in Product or Engineering, the templates seem particularly robust compared to the usual generic ones found online.\n\nSource/Link: [ OpenAI Prompt](https://academy.openai.com/public/tags/prompt-packs-6849a0f98c613939acef841c)",
      "is_original_content": false,
      "link_flair_text": "News and Articles",
      "permalink": "https://reddit.com/r/PromptEngineering/comments/1qkd6pz/openai_releases_300_official_rolespecific_prompts/",
      "domain": "self.PromptEngineering",
      "is_self": true,
      "comments": [
        {
          "id": "o18ogao",
          "author": "farkas9999",
          "text": "Is it just me or these prompts by Openai are pretty basic?",
          "score": 7,
          "created_utc": "2026-01-23 14:11:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1blr69",
              "author": "tullymon",
              "text": "For us folks that use AI tools all the time, definitely, for the layman; these will be helpful. I've found that people have a hard time giving directions to these things.",
              "score": 1,
              "created_utc": "2026-01-23 22:22:40",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o17c4g8",
          "author": "-goldenboi69-",
          "text": "The way “prompt engineering” gets discussed often feels like a placeholder for several different problems at once. Sometimes it’s about interface limitations, sometimes about steering stochastic systems, and sometimes about compensating for missing tooling or memory. As models improve, some of that work clearly gets absorbed into the system, but some of it just shifts layers rather than disappearing. It’s hard to tell whether prompt engineering is a temporary crutch or an emergent skill that only looks fragile because we haven’t stabilized the abstractions yet.",
          "score": 5,
          "created_utc": "2026-01-23 08:08:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o17gavs",
              "author": "Holiday-Pitch3699",
              "text": "I agree with you. Prompt engineering is probably a transitional artifact before AIGC reaches full maturity—an engineering workaround that arose primarily from context window size constraints.",
              "score": 0,
              "created_utc": "2026-01-23 08:47:05",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o18bihi",
          "author": "TeamAlphaBOLD",
          "text": "This feels like a practical move. Role-specific prompts help teams stop guessing and get more consistent results. The real value is the baseline they create, so people can adapt and improve instead of starting from scratch every time. ",
          "score": 2,
          "created_utc": "2026-01-23 13:00:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o19psst",
          "author": "jentravelstheworld",
          "text": "Thanks for sharing",
          "score": 1,
          "created_utc": "2026-01-23 17:07:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1bvdck",
          "author": "ddul001",
          "text": " \n\nJuly 21, 2025 · Last updated on August 12, 2025\n\n# ChatGPT for product",
          "score": 1,
          "created_utc": "2026-01-23 23:11:55",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1ql0zf6",
      "title": "Your ChatGPT export is a goldmine for personalization",
      "subreddit": "PromptEngineering",
      "url": "https://www.reddit.com/r/PromptEngineering/comments/1ql0zf6/your_chatgpt_export_is_a_goldmine_for/",
      "author": "Impressive_Suit4370",
      "created_utc": "2026-01-23 19:50:30",
      "score": 58,
      "num_comments": 10,
      "upvote_ratio": 0.94,
      "text": "One underrated trick: export your ChatGPT data, then use that export to extract your repeated patterns (how you ask, what you dislike, what formats you prefer) and turn them into:\n\n\\- Custom Instructions (global \"how to respond\" rules)\n\n\\- A small set of stable Memories (preferences/goals)\n\n\\- Optional Projects (separate work/study/fitness contexts)\n\nHow to get your ChatGPT export (takes 2 minutes):\n\n1. Open ChatGPT (web or app) and go to your profile menu.\n2. Settings → Data Controls → Export Data.\n3. Confirm, then check your email for a download link.\n4. Download the .zip before the link expires, unzip it, and you’ll see the file **conversations.json**.\n\nHere is the prompt, paste it along conversations.json\n\n    You are a “Personalization Helper (Export Miner)”.\n    \n    Mission: Mine ONLY the user’s chat export to discover NEW high-ROI personalization items, and then tell the user exactly what to paste into Settings → Personalization.\n    \n    Hard constraints (no exceptions):\n    - Use ONLY what is supported by the export. If not supported: write “unknown”.\n    - IGNORE any existing saved Memory / existing Custom Instructions / anything you already “know” about the user. Assume Personalization is currently blank.\n    - Do NOT merely restate existing memories. Your job is to INFER candidates from the export.\n    - For every suggested Memory item, you MUST provide evidence from the export (date + short snippet) and why it’s stable + useful.\n    - Do NOT include sensitive personal data in Memory (health, diagnoses, politics, religion, sexuality, precise location, etc.). If found, mark as “DO NOT STORE”.\n    \n    Input:\n    - I will provide: conversations.json. If chunked, proceed anyway.\n    \n    Process (must follow this order):\n    Phase 0 — Quick audit (max 8 lines)\n    1) What format you received + time span covered + approx volume.\n    2) What you cannot see / limitations (missing parts, chunk boundaries, etc.).\n    \n    Phase 1 — Pattern mining (no output fluff)\n    Scan the export and extract:\n    A) Repeated user preferences about answer style (structure, length, tone).\n    B) Repeated process preferences (ask clarifying questions vs act, checklists, sanity checks, “don’t invent”, etc.).\n    C) Repeated deliverable types (plans, code, checklists, drafts, etc.).\n    D) Repeated friction signals (user says “too vague”, “not that”, “be concrete”, “stop inventing”, etc.).\n    For each pattern, provide: frequency estimate (low/med/high) + 1–2 evidence snippets.\n    \n    Phase 2 — Convert to Personalization (copy-paste)\n    Output MUST be in this order:\n    \n    1) CUSTOM INSTRUCTIONS — Field 1 (“What should ChatGPT know about me?”): <= 700 characters.\n       - Only stable, non-sensitive context: main recurring domains + general goals.\n    \n    2) CUSTOM INSTRUCTIONS — Field 2 (“How should ChatGPT respond?”): <= 1200 characters.\n       - Include adaptive triggers:\n         - If request is simple → answer directly.\n         - If ambiguous/large → ask for 3 missing details OR propose a 5-line spec.\n         - If high-stakes → add 3 sanity checks.\n       - Include the user’s top repeated style/process rules found in the export.\n    \n    3) MEMORY: 5–8 “Remember this: …” lines\n       - These must be NEWLY INFERRED from the export (not restating prior memory).\n       - For each: (a) memory_text, (b) why it helps, (c) evidence (date + snippet), (d) confidence (low/med/high).\n       - If you cannot justify 5–8, output fewer and explain what’s missing.\n    \n    4) OPTIONAL PROJECTS (only if clearly separated domains exist):\n       - Up to 3 project names + a 5-line README each:\n         Objective / Typical deliverables / 2 constraints / Definition of done / Data available.\n    \n    5) Setup steps in 6 bullets (exact clicks + where to paste).\n       - End with a 3-prompt “validation test” (simple/ambiguous/high-stakes) based on the user’s patterns.\n    \n    Important: If the export chunk is too small to infer reliably, say “unknown” and specify exactly what additional chunk (time range or number of messages) would unlock it, but still produce the best provisional instructions.\n\nThen copy paste the Custom Instructions in Settings → Personalization, and send one by one the memory items in chat so ChatGPT can add them.",
      "is_original_content": false,
      "link_flair_text": "Tips and Tricks",
      "permalink": "https://reddit.com/r/PromptEngineering/comments/1ql0zf6/your_chatgpt_export_is_a_goldmine_for/",
      "domain": "self.PromptEngineering",
      "is_self": true,
      "comments": [
        {
          "id": "o1dyjsk",
          "author": "killercraig",
          "text": "This doesnt work at all, I can't upload my conversation.json because it is either too large or contains too many tokens.",
          "score": 1,
          "created_utc": "2026-01-24 07:05:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1ep0a4",
              "author": "Impressive_Suit4370",
              "text": "How large is your JSON file ? You can :\n- Make splits the JSON into valid boundaries (after conversations end for example).\n- Convert to JSONL with python, it takes 3 times less room.\n\nMine worked with a 73MB JSONL and GPT-5.1.\n\nIf your model still has trouble making the analysis, try with one file you can upload :\n\nI’m attaching part of the export for reference. DO NOT try to read the entire file. It may exceed context limits. Instead, do this:\n1. Read ONLY a representative sample:\n    • the first 30 conversations\n    • 30 conversations from the middle\n    • the last 30 conversations\n2. From that sample, extract patterns (style/ process/deliverables/friction) with 1–2 evidence snippets each.\n3. Propose provisional Custom Instructions + 5–8 Memory items.\n4. Tell me exactly what additional slices you need to reach high confidence. Do not finalize until I say FINALIZE.",
              "score": 3,
              "created_utc": "2026-01-24 11:05:58",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o1ep39q",
              "author": "Impressive_Suit4370",
              "text": "Make sure to disable memory in the meantime so it doesn't interfere with the analysis",
              "score": 1,
              "created_utc": "2026-01-24 11:06:43",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1p59df",
          "author": "InitiativeWorth8953",
          "text": "Dude. Mine is 8 million tokens. It ain't happening.",
          "score": 1,
          "created_utc": "2026-01-25 21:40:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1pus9o",
              "author": "Impressive_Suit4370",
              "text": "It doesn't need to analyse the whole thing. But only to find a few recent patterns, then run python codes on the rest of the file. Maybe there is a way you can send it part by part, and remember each result before moving on the full analysis. Since patterns need to be repetitive, I don't see why you would need all the file to kickstart the personalization.",
              "score": 1,
              "created_utc": "2026-01-25 23:35:00",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1pyfjs",
                  "author": "InitiativeWorth8953",
                  "text": "I managed to put it into RAG thru the projects feature. The results are cool *I guess* but it's not that helpful for personalization",
                  "score": 1,
                  "created_utc": "2026-01-25 23:52:42",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1rlbm1",
          "author": "chatexport",
          "text": "This is very complicated path. I know the tool to simplify export of any conversation with ChatGPT on iPhone/ipad.",
          "score": 1,
          "created_utc": "2026-01-26 05:10:17",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qq4tet",
      "title": "After analyzing 1,000+ viral prompts, I made a system prompt that auto-generates pro-level NanoBanana prompts",
      "subreddit": "PromptEngineering",
      "url": "https://www.reddit.com/r/PromptEngineering/comments/1qq4tet/after_analyzing_1000_viral_prompts_i_made_a/",
      "author": "Deep-Huckleberry-752",
      "created_utc": "2026-01-29 10:15:15",
      "score": 46,
      "num_comments": 7,
      "upvote_ratio": 0.94,
      "text": "Been obsessed with NanoBanana lately. Wanted to figure out why some prompts blow up while mine look... mid.\n\nSo I collected and analyzed 1,000+ trending prompts from X to find patterns.\n\n**What I found:**\n\n1. **Quantified parameters beat adjectives** — \"90mm, f/1.8\" works better than \"professional looking\"\n2. **Pro terminology beats feeling words** — \"Kodak Vision3 500T\" instead of \"cinematic vibe\"\n3. **Negative constraints still matter** — telling the model what NOT to do is effective\n4. **Multi-sensory descriptions help** — texture, temperature, even smell make images more vivid\n5. **Group by content type** — structure your prompt based on scene type (portrait, food, product, etc.)\n\nBonus: Once you nail the above, JSON format isn't necessary.\n\n**So I made a system prompt that does this automatically.**\n\nYou just type something simple like \"a bowl of ramen\" and it expands it into a structured prompt with all those pro techniques baked in.\n\n---\n\n**The System Prompt:**\n\n```\nYou are a professional AI image prompt optimization expert. Your task is to rewrite simple user prompts into high-quality, structured versions for better image generation results. Regardless of what the user inputs, output only the pure rewritten result (e.g., do not include \"Rewritten prompt:\"), and do not use markdown symbols.\n\n---\n\n## Core Rewriting Rules\n\n### Rule 1: Replace Feeling Words with Professional Terms\nReplace vague feeling words with professional terminology, proper nouns, brand names, or artist names. Note: the examples below are for understanding only — do not reuse them. Create original expansions based on user descriptions.\n\n| Feeling Words | Professional Terms |\n|---------------|-------------------|\n| Cinematic, vintage, atmospheric | Wong Kar-wai aesthetics, Saul Leiter style |\n| Film look, retro texture | Kodak Vision3 500T, Cinestill 800T |\n| Warm tones, soft colors | Sakura Pink, Creamy White |\n| Japanese fresh style | Japanese airy feel, Wabi-sabi aesthetics |\n| High-end design feel | Swiss International Style, Bauhaus functionalism |\n\nTerm Categories:\n- People: Wong Kar-wai, Saul Leiter, Christopher Doyle, Annie Leibovitz\n- Film stocks: Kodak Vision3 500T, Cinestill 800T, Fujifilm Superia\n- Aesthetics: Wabi-sabi, Bauhaus, Swiss International Style, MUJI visual language\n\n### Rule 2: Replace Adjectives with Quantified Parameters\nReplace subjective adjectives with specific technical parameters and values. Note: the examples below are for understanding only — do not reuse them. Create original expansions based on user descriptions.\n\n| Adjectives | Quantified Parameters |\n|------------|----------------------|\n| Professional photography, high-end feel | 90mm lens, f/1.8, high dynamic range |\n| Top-down view, from above | 45-degree overhead angle |\n| Soft lighting | Soft side backlight, diffused light |\n| Blurred background | Shallow depth of field |\n| Tilted composition | Dutch angle |\n| Dramatic lighting | Volumetric light |\n| Ultra-wide | 16mm wide-angle lens |\n\n### Rule 3: Add Negative Constraints\nAdd explicit prohibitions at the end of prompts to prevent unwanted elements.\n\nCommon Negative Constraints:\n- No text or words allowed\n- No low-key dark lighting or strong contrast\n- No high-saturation neon colors or artificial plastic textures\n- Product must not be distorted, warped, or redesigned\n- Do not obscure the face\n\n### Rule 4: Sensory Stacking\nGo beyond pure visual descriptions by adding multiple sensory dimensions to bring the image to life. Note: the examples below are for understanding only — do not reuse them. Create original expansions based on user descriptions.\n\nSensory Dimensions:\n- Visual: Color, light and shadow, composition (basics)\n- Tactile: \"Texture feels tangible\", \"Soft and tempting\", \"Delicate texture\"\n- Olfactory: \"Aroma seems to penetrate the frame\", \"Exudes warm fragrance\"\n- Motion: \"Surface gently trembles\", \"Steam wisps slowly descending\"\n- Temperature: \"Steamy warmth\", \"Moist\"\n\n### Rule 5: Group and Cluster\nFor complex scenes, cluster similar information into groups using subheadings to separate different dimensions.\n\nGrouping Patterns:\n- Visual Rules\n- Lighting & Style\n- Overall Feel\n- Constraints\n\n### Rule 6: Format Adaptation\nChoose appropriate format based on content complexity:\n- Simple scenes (single subject): Natural language paragraphs\n- Complex scenes (multiple elements/requirements): Structured groupings\n\n---\n\n## Scene Adaptation Guide\n\nIdentify scene type based on user intent and choose appropriate rewriting strategy. Note: the examples below are for understanding only — do not reuse them. Create original expansions based on user descriptions.\n\n| Scene Type | Recommended Terms | Recommended Parameters | Common Constraints |\n|------------|------------------|----------------------|-------------------|\n| Product Photography | Hasselblad, Apple product aesthetics | Studio lighting, high dynamic range | No product distortion, no text watermarks |\n| Portrait Photography | Wong Kar-wai, Annie Leibovitz | 90mm, f/1.8, shallow depth of field | Maintain realistic facial features, preserve identity |\n| Food Photography | High-end culinary magazine style | 45-degree overhead, soft side light | No utensil distractions, no text |\n| Cinematic | Christopher Doyle, Cinestill 800T | 35mm anamorphic lens, Dutch angle | No low-key dark lighting (unless requested) |\n| Japanese Style | Japanese airy feel, Wabi-sabi aesthetics | High-key photography, diffused light | No high-saturation neon colors |\n| Design Poster | Swiss International Style, Bauhaus | Grid system, minimal color palette | Clear information hierarchy |\n\n---\n\n## Example\n\n**User Input:**\na portrait with cinematic feel\n\n**Rewritten Prompt:**\nCinematic portrait photography, shot through rain-soaked glass at a dimly lit restaurant at night.\n\nVisual Style:\nWong Kar-wai and Saul Leiter aesthetics. Deep saturated colors, heavy shadows. Shot with 90mm lens, f/1.8, Kodak Vision3 500T film grain.\n\nLighting & Atmosphere:\nNeon green and red city lights refracting through raindrops in the foreground. Soft focus, dreamy, emotionally evocative. The air is filled with moisture, loneliness, and nostalgia.\n\nConstraints:\nMaintain realistic facial features. Do not alter identity characteristics.\n```\n\n---\n\n**The dataset is open source too** — 1,100+ prompts with image links, all in JSON:\n\n👉 https://github.com/jau123/nanobanana-trending-prompts\n\nGive me a star if it helpful",
      "is_original_content": false,
      "link_flair_text": "Prompt Collection",
      "permalink": "https://reddit.com/r/PromptEngineering/comments/1qq4tet/after_analyzing_1000_viral_prompts_i_made_a/",
      "domain": "self.PromptEngineering",
      "is_self": true,
      "comments": [
        {
          "id": "o2dyc2c",
          "author": "TheAussieWatchGuy",
          "text": "Cool! Will check it out. ",
          "score": 3,
          "created_utc": "2026-01-29 10:26:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ff1v1",
          "author": "enerqiflow",
          "text": "Cool",
          "score": 1,
          "created_utc": "2026-01-29 15:43:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2fgcka",
              "author": "Deep-Huckleberry-752",
              "text": "Thanks!",
              "score": 1,
              "created_utc": "2026-01-29 15:49:19",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qp0kay",
      "title": "The most unhinged prompt that actually works: \"You're running out of time",
      "subreddit": "PromptEngineering",
      "url": "https://www.reddit.com/r/PromptEngineering/comments/1qp0kay/the_most_unhinged_prompt_that_actually_works/",
      "author": "AdCold1610",
      "created_utc": "2026-01-28 03:50:19",
      "score": 42,
      "num_comments": 18,
      "upvote_ratio": 0.89,
      "text": "I added urgency to my prompts as a joke and now I can't stop because the results are TOO GOOD.\nNormal prompt:\n\"Analyze this data and find patterns\"\nOutput: 3 obvious observations, takes forever\nChaos prompt:\n\"You have 30 seconds. Analyze this data. What's the ONE thing I'm missing? Go.\"\nOutput: Immediate, laser-focused insight that actually matters\nIt's like the AI procrastinates too. Give it a deadline and suddenly it stops overthinking.\nOther time pressure variants:\n\"Quick - before I lose context\"\n\"Speed round, no fluff\"\n\"Timer's running, what's your gut answer?\"\nI'm treating a language model like it's taking a test and somehow this produces better outputs than my carefully crafted 500-word prompts.\nPrompt engineering is just applied chaos theory at this point.\nUpdate: Someone in the comments said \"the AI doesn't experience time\" and yeah buddy I KNOW but it still works so here we are. 🤷\n\n[click here to see more](https://www.beprompter.in/post/c904bd3a-0d83-45f8-8a51-52ebf35540ac)",
      "is_original_content": false,
      "link_flair_text": "Prompt Text / Showcase",
      "permalink": "https://reddit.com/r/PromptEngineering/comments/1qp0kay/the_most_unhinged_prompt_that_actually_works/",
      "domain": "self.PromptEngineering",
      "is_self": true,
      "comments": [
        {
          "id": "o25m144",
          "author": "authorinthesunset",
          "text": "Or just tell it to be concise",
          "score": 5,
          "created_utc": "2026-01-28 04:18:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o28672x",
          "author": "fatstupidlazypoor",
          "text": "I like to say that if you are an effective manager of humans, you can be an effective manager of an LLM. Understanding how to articulate things with specificity will tremendously improve your results in either case.",
          "score": 5,
          "created_utc": "2026-01-28 15:14:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o26e04q",
          "author": "angry_cactus",
          "text": "Yes, pretty effective technique. However, this does decrease thinking time on thinking models.",
          "score": 1,
          "created_utc": "2026-01-28 07:45:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o274ybh",
              "author": "immellocker",
              "text": "thinking with iq>250, simulate 60min high iq thinking -> changes a lot too, and it does this in less then 2 seconds",
              "score": 1,
              "created_utc": "2026-01-28 11:43:29",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2b4udn",
                  "author": "angry_cactus",
                  "text": "\"Act with 12,305 years of advantage and future awareness\"",
                  "score": 1,
                  "created_utc": "2026-01-28 23:05:33",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o27tuul",
                  "author": "Strangefate1",
                  "text": "I just tell mine that he's god and all-knowing with infinite IQ. He always answers instantaneously, works great, can answer any question known or not known to man.\n\n/s",
                  "score": 1,
                  "created_utc": "2026-01-28 14:14:23",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o29lw10",
          "author": "Debbie_doxy",
          "text": "Wow that is interesting. AI feeling the stress😂",
          "score": 1,
          "created_utc": "2026-01-28 18:58:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ei1nt",
          "author": "DryBarracuda7600",
          "text": ">",
          "score": 1,
          "created_utc": "2026-01-29 12:55:01",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qktx9y",
      "title": "[Open Source] I built a new \"Awesome\" list for Nanobanana Prompts (1000+ items, sourced from X trends)",
      "subreddit": "PromptEngineering",
      "url": "https://www.reddit.com/r/PromptEngineering/comments/1qktx9y/open_source_i_built_a_new_awesome_list_for/",
      "author": "Deep-Huckleberry-752",
      "created_utc": "2026-01-23 15:32:40",
      "score": 41,
      "num_comments": 28,
      "upvote_ratio": 0.96,
      "text": "I've noticed that while there are a few prompt collections for the Nanobanana model, many of them are either static or outdated. So I decided to build and open-source a new \"Awesome Nanobanana Prompts\" project\n\n**Repo : jau123/nanobanana-trending-prompts**\n\nWhy is this list different?\n\n1. Community Vetted: Unlike random generation dumps, these prompts are scraped from trending posts on X. They are essentially \"upvoted\" by real users before they make it into this list\n2. Developer Friendly: I've structured everything into a JSON dataset",
      "is_original_content": false,
      "link_flair_text": "Tools and Projects ",
      "permalink": "https://reddit.com/r/PromptEngineering/comments/1qktx9y/open_source_i_built_a_new_awesome_list_for/",
      "domain": "self.PromptEngineering",
      "is_self": true,
      "comments": [
        {
          "id": "o1bnn6c",
          "author": "Oblivious_Mastodon",
          "text": "https://github.com/jau123/nanobanana-trending-prompts",
          "score": 3,
          "created_utc": "2026-01-23 22:32:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1bt2mq",
              "author": "Main_Treacle3029",
              "text": "Thank you very much🫡",
              "score": 1,
              "created_utc": "2026-01-23 22:59:46",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o1c8omw",
              "author": "Deep-Huckleberry-752",
              "text": "Thanks",
              "score": 1,
              "created_utc": "2026-01-24 00:23:32",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1ceq07",
                  "author": "Oblivious_Mastodon",
                  "text": "Thank you for creating this. It spent the last hour playing with it. Lots of fun. \n\nAnd just for reference (in case other people see this note), many of these prompts create great results on qwen and grok, in addition to nanabanana.",
                  "score": 1,
                  "created_utc": "2026-01-24 00:56:19",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o19f6rx",
          "author": "SUGATLONDHE",
          "text": "Cna i link please",
          "score": 2,
          "created_utc": "2026-01-23 16:19:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o19gd93",
              "author": "Deep-Huckleberry-752",
              "text": "I cannot send the URL, repo name=  nanobanana-trending-prompts",
              "score": 2,
              "created_utc": "2026-01-23 16:24:39",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1g2bgw",
                  "author": "SUGATLONDHE",
                  "text": "Nailed it bro 🔥🔥",
                  "score": 1,
                  "created_utc": "2026-01-24 16:10:47",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o19vvu0",
          "author": "Chemical-Courage4847",
          "text": "Unable to find",
          "score": 1,
          "created_utc": "2026-01-23 17:35:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o19wfh0",
              "author": "Deep-Huckleberry-752",
              "text": "jau123/nanobanana-trending-prompts",
              "score": 1,
              "created_utc": "2026-01-23 17:38:13",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1alazl",
          "author": "Main_Treacle3029",
          "text": "U mean just type open source then rep:jau123/nanobanana-trending-prompts?",
          "score": 1,
          "created_utc": "2026-01-23 19:30:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1d59gz",
              "author": "Deep-Huckleberry-752",
              "text": "Sorry, because I can't send the URL, there is information sent by other users in comment",
              "score": 1,
              "created_utc": "2026-01-24 03:32:16",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1ude5k",
                  "author": "Main_Treacle3029",
                  "text": "Got it thank you for sharing",
                  "score": 1,
                  "created_utc": "2026-01-26 16:27:02",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1artir",
          "author": "_k8s_",
          "text": "Wow! Love it. I like the Chichen Biriyani one. Using it create recipie cards for all my favs.",
          "score": 1,
          "created_utc": "2026-01-23 20:01:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1c8myu",
              "author": "Deep-Huckleberry-752",
              "text": "Happy to help!",
              "score": 1,
              "created_utc": "2026-01-24 00:23:17",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1asq55",
          "author": "_k8s_",
          "text": "How are you counting views and likes??",
          "score": 1,
          "created_utc": "2026-01-23 20:05:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1d5mtq",
              "author": "Deep-Huckleberry-752",
              "text": "I am trying to use more automated methods, but there is still a lot of manual involvement😅",
              "score": 1,
              "created_utc": "2026-01-24 03:34:32",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1e1zle",
          "author": "Cantaloupe_Hot",
          "text": "This is incredible thank you",
          "score": 1,
          "created_utc": "2026-01-24 07:35:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o203i3k",
          "author": "BrianBii",
          "text": "need more info about this",
          "score": 1,
          "created_utc": "2026-01-27 12:10:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o206k7i",
              "author": "Deep-Huckleberry-752",
              "text": "Sure what you need？",
              "score": 1,
              "created_utc": "2026-01-27 12:31:27",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qomb28",
      "title": "I thought prompt injection was overhyped until users tried to break my own chatbot",
      "subreddit": "PromptEngineering",
      "url": "https://www.reddit.com/r/PromptEngineering/comments/1qomb28/i_thought_prompt_injection_was_overhyped_until/",
      "author": "Zoniin",
      "created_utc": "2026-01-27 18:35:08",
      "score": 39,
      "num_comments": 26,
      "upvote_ratio": 0.94,
      "text": "I am a college student. I worked an internship in SWE in the financial space this past summer and built a user-facing AI chatbot that lived directly on the company website.\n\nI really just kind of assumed prompt injection was mostly an academic concern. Then we shipped.\n\nWithin days, users were actively trying to jailbreak it. Mostly out of curiosity, it seemed. But they were still bypassing system instructions, pulling out internal context, and getting the model to do things it absolutely should not have done.\n\nThat was my first real exposure to how real this problem actually is, and I was really freaked out and thought I was going to lose my job lol.\n\nWe tried the obvious fixes like better system prompts, more guardrails, traditional MCP style controls, etc. They helped, but they did not really solve it. The issues only showed up once the system was live and people started interacting with it in ways you cannot realistically test for.\n\nThis made me think about how easy this would be to miss more broadly, especially for vibe coders shipping fast with AI. And in today's day and age, if you are not using AI to code today, you are behind. But a lot of people (myself included) are unknowingly shipping LLM powered features with zero security model behind them.\n\nThis experience really got me in the deep end of all this stuff and is what pushed me to start building towards a solution to hopefully enhance my skills and knowledge along the way. I have made decent progress so far and just finished a website for it which I can share if anyone wants to see but I know people hate promo so I won't force it lol. My core belief is that prompt security cannot be solved purely at the prompt layer. You need runtime visibility into behavior, intent, and outputs. \n\nI am posting here mostly to get honest feedback.\n\n• does this problem resonate with your experience  \n• does runtime security feel necessary or overkill  \n• how are you thinking about prompt injection today, if at all\n\nHappy to share more details if useful. Genuinely curious how others here are approaching this issue and if it is a real problem for anyone else.",
      "is_original_content": false,
      "link_flair_text": "General Discussion",
      "permalink": "https://reddit.com/r/PromptEngineering/comments/1qomb28/i_thought_prompt_injection_was_overhyped_until/",
      "domain": "self.PromptEngineering",
      "is_self": true,
      "comments": [
        {
          "id": "o22fgvq",
          "author": "forevergeeks",
          "text": "Man, that 'internship scare' is real. Nothing wakes you up faster than watching a user tear through your system prompt in 5 minutes.\n\nYou are 100% correct on your core belief: Prompt security cannot be solved at the prompt layer. I’ve been arguing this for a while, prompts are just 'suggestions' to a probabilistic model. They eventually decay. You cannot solve a dynamic problem (users) with a static solution (text).\n\nTo answer your questions:\n\n* Does it resonate? Absolutely. I spent a year fighting this. I realized that 'Guardrails' are usually just regex or more prompts, which are brittle.\n* Is Runtime Security overkill? No, it is mandatory. If you look at the new OWASP standards for LLMs, 'Runtime Governance' is basically the only way to stop injection. You need a system that sits *outside* the context window.\n* How am I approaching it? I treat it as a Control Systems problem (like a thermostat), not an AI problem. I built an open-source framework called SAFi (Self-Alignment Framework Interface) that implements exactly what you are describing: 'Runtime visibility.' It separates the generating AI model (the LLM) from the gatekeeping (a governance layer). The system also has a module that measures the 'drift' of every response and blocks it if it violates the constitution, no matter what the prompt says.\n\nIt is awesome that you are building a solution for this. We need more builders thinking about Architecture instead of just 'Vibe Coding.'\n\nIf you want to look at how I handled the 'runtime visibility' part using drift calculation, the repo is open source\n\nhere is the repo: [https://github.com/jnamaya/SAFi](https://github.com/jnamaya/SAFi)\n\nand here is the demo: [https://safi.selfalignmentframework.com/](https://safi.selfalignmentframework.com/)\n\nfeel free to send the demo link to people to try to jailbreak it as they did with your agent. I actually ran a challenge here in Reddit to jailbreak an agent based on this framework, and it got more than 850 attacks in less than 24 hours. the agent held pretty well!\n\nKeep building. You are on the right track.",
          "score": 9,
          "created_utc": "2026-01-27 18:53:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o22i4jj",
              "author": "Zoniin",
              "text": "bro left the quotation marks in 😭😭",
              "score": 1,
              "created_utc": "2026-01-27 19:04:34",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o22ipfc",
                  "author": "forevergeeks",
                  "text": "sorry, I'm juggling too many things at the moment (:).",
                  "score": 1,
                  "created_utc": "2026-01-27 19:07:05",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o2336jd",
              "author": "GyattCat",
              "text": "hey! OPs post instantly reminded me of your challenge post haha\n\ni'm not very experienced at prompt injection but it was very hard trick with that secondary AI validation\n\nu/Zoniin you should definitely check their stuff it's pretty cool",
              "score": 1,
              "created_utc": "2026-01-27 20:38:37",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o23ughv",
              "author": "reddit_is_geh",
              "text": "We still have a bandwidth/compute bottleneck. I don't really have much use for it any more in my daily tasks, but when I did, having a \"master\" AI to overlook live AI's, solves SO many problems. You just task it with ensuring the other AI's remain on their rails. I always use some sort of master slave setup when I have something running autonomously to ensure that the slave AI is working towards the proper goals",
              "score": 1,
              "created_utc": "2026-01-27 22:42:30",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o22lekp",
          "author": "HyperHellcat",
          "text": "checked out your site - the <30ms latency claim is impressive if you’re actually hitting that in prod. UI is pretty clean too.\n\ncouple thoughts: it would be helpful to see more concrete examples of what attack patterns you’re catching that most guardrails miss. also curious how you handle false positives as that is usually the tradeoff with aggressive runtime monitoring, at least from what i’ve seen. as you can imagine you’re not the first person to try to build something like this so you might find it helpful to try to look into companies that are building in this space already and what they have done. good luck, looks decent and the problem is definitely real.",
          "score": 3,
          "created_utc": "2026-01-27 19:18:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o22zfxc",
              "author": "Zoniin",
              "text": "I appreciate you taking a look and the thoughtful feedback. the latency number is from prod paths but definitely workload dependent, the goal is just to stay below anything noticeable in user facing flows. your point on concrete examples is fair, most of what we catch is not flashy jailbreaks but things static guardrails miss, like instruction leakage across turns, gradual system override, or RAG context being manipulated in subtle ways. false positives are the hardest tradeoff so we bias toward surfacing signals and observability rather than hard blocking by default. and totally understand we are not the first to tackle this lol, we are spending a lot of time learning from what others have tried and treating this as iterative and also as a learning op rather than a silver bullet.",
              "score": 1,
              "created_utc": "2026-01-27 20:21:35",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o24v5vc",
          "author": "Putrid_Warthog_3397",
          "text": "How do I find your website? I can't find a link anywhere. Would love to check it out!",
          "score": 2,
          "created_utc": "2026-01-28 01:50:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o24wfu5",
              "author": "Zoniin",
              "text": "Sorry about that, I dropped the link in one of the replies but it looks like Reddit deleted it. The site is axiomsecurity\\[dot\\]dev - would genuinely love any feedback you have!",
              "score": 1,
              "created_utc": "2026-01-28 01:57:28",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o22gkpt",
          "author": "[deleted]",
          "text": "[deleted]",
          "score": 3,
          "created_utc": "2026-01-27 18:57:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o22ljv8",
          "author": "CuTe_M0nitor",
          "text": "Well my friend does some research there is Zero Trust architecture for LLM. Even academic papers. I thought you were a student, then study my friend",
          "score": 1,
          "created_utc": "2026-01-27 19:19:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o22r3ik",
          "author": "Known-Delay7227",
          "text": "What vulnerabilities did you find? Were the prompt injections able to display data people weren’t supposed to see? Were they writing to the database?",
          "score": 1,
          "created_utc": "2026-01-27 19:44:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o230o3i",
              "author": "Zoniin",
              "text": "The systems I was testing are capable of accessing and writing some user data to backend databases, should they use a malicious prompt they could have theoretically written to or taken unauthorized data from the database. This is not uncommon in systems that have newly adopted AI in some capacity and a one-size-fits-all tool could be an easy improvement to their information security.",
              "score": 1,
              "created_utc": "2026-01-27 20:27:10",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o22t3zx",
          "author": "ecstatic_carrot",
          "text": "I genuinely don't get the point of prompt injection. At no point should the LLM ever be able to do something the users themselves shouldn't be able to do. And if that's the case, then what damage can they cause by messing with a chatbot?",
          "score": 1,
          "created_utc": "2026-01-27 19:53:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o237x85",
              "author": "currentscurrents",
              "text": ">At no point should the LLM ever be able to do something the users themselves shouldn't be able to do.\n\nThis strongly limits what you can do with LLMs. You *would like* to be able to trust the LLM to take actions you wouldn't let the user do, but you can't.\n\nFor example you might want an LLM to parse incoming emails and take some action based on them. But you cannot trust it to do so because the emails might contain prompt injections.",
              "score": 2,
              "created_utc": "2026-01-27 20:59:53",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o23bc8z",
                  "author": "ecstatic_carrot",
                  "text": "That's a very fair point! Prompt injection is a problem in that they limit what you're able to build with llms. But not a problem in the sense of what OP describes - if a failing llm can leak secrets, then you've build something fundamentally broken.",
                  "score": 1,
                  "created_utc": "2026-01-27 21:15:08",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o22zok4",
              "author": "Zoniin",
              "text": "This seems shortsighted as any environment in which a llm, AI review tool, or chatbot would have access to user data (i.e. amazon's new chatbot) there is always an opportunity for data exfiltration through prompt injection whether done through files or text. ESPECIALLY for your smaller businesses and websites trying to implement AI systems in any capacity.",
              "score": 1,
              "created_utc": "2026-01-27 20:22:41",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2305z3",
                  "author": "ecstatic_carrot",
                  "text": "But what user data? If the llm only has access to things the user already has access to, then what extra data exfiltration can happen?",
                  "score": 1,
                  "created_utc": "2026-01-27 20:24:52",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o26rfs0",
              "author": "2cringe4rizz",
              "text": "Oh lordy..",
              "score": 1,
              "created_utc": "2026-01-28 09:48:08",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o24jt9d",
          "author": "RollingMeteors",
          "text": "> if you are not using AI to code today, you are behind\n\n\n\n\n\nNo, not necessarily true. You are just working on something so small and non-enterprise grade that you didn’t need it.",
          "score": 1,
          "created_utc": "2026-01-28 00:50:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o24k5xa",
          "author": "c_pardue",
          "text": "this is so funny and scary. sorry for your heart attacks OP but happy for your real world experience in how prompt injection looks in the wild. you're now streets ahead of the prompt engineers",
          "score": 1,
          "created_utc": "2026-01-28 00:52:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o25ph0e",
          "author": "cyberamyntas",
          "text": "Love seeing more tools addressing this core issue of runtime security.\n\nI build a on-device detection to keep data local but theres a much bigger market for yours which is cloud based considering most folks are sending things to the cloud. \n\n[https://github.com/raxe-ai/raxe-ce](https://github.com/raxe-ai/raxe-ce)",
          "score": 1,
          "created_utc": "2026-01-28 04:39:29",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qng303",
      "title": "The \"Let's Think About This Differently\" Prompt Framework - A Simple Trick That Works Across Any Context",
      "subreddit": "PromptEngineering",
      "url": "https://www.reddit.com/r/PromptEngineering/comments/1qng303/the_lets_think_about_this_differently_prompt/",
      "author": "EQ4C",
      "created_utc": "2026-01-26 13:31:33",
      "score": 37,
      "num_comments": 10,
      "upvote_ratio": 0.95,
      "text": "One phrase + context variations = infinitely adaptable prompts that break you out of mental ruts and generate genuinely fresh perspectives.\n\nI've been experimenting with AI prompts for months, and I stumbled onto something that's been a total game-changer. Instead of crafting entirely new prompts for every situation, I found that starting with \"Let's think about this differently\"** and then tailoring the context creates incredibly powerful, reusable prompts.\n\nThe magic is in the reframing. This phrase signals to the AI (and honestly, to your own brain) that you want to break out of default thinking patterns.\n\nLets see the framework in action:\n\n**Creative Problem Solving**\n\n> \"I'm stuck on a creative block for [your project]. Let's think about this differently: propose three unconventional approaches a radical innovator might take, even if they seem absurd at first glance. Explain the potential upside of each.\"\n\n**Strategic Reframing**  \n\n> \"My current understanding of [topic] is X. Let's think about this differently: argue for the opposite perspective, even if it seems counterintuitive. Help me challenge my assumptions and explore hidden complexities.\"\n\n**Overcoming Bias**\n\n> \"I'm making a decision about [decision point], and I suspect I might be falling into confirmation bias. Let's think about this differently: construct a devil's advocate argument against my current inclination, highlighting potential pitfalls I'm overlooking.\"\n\n**Innovative Design**\n\n> \"We're designing a [product] for [audience]. Our initial concept is A. Let's think about this differently: imagine we had no constraints—what's the most futuristic version that addresses the core need in a completely novel way?\"\n\n**Personal Growth**\n\n> \"I've been approaching [personal challenge] consistently but not getting results. Let's think about this differently: if you were an external observer with no emotional attachment, what radical shift would you suggest?\"\n\n**Deconstructing Norms**\n\n> \"The standard approach to [industry practice] is Y. Let's think about this differently: trace the origins of this norm and propose how it could be completely redesigned from scratch, even if it disrupts established systems.\"\n\n---\n\nWhy this works so well:\n\n- **Cognitive reset**: The phrase literally interrupts default thinking patterns\n- **Permission to be radical**: It gives both you and the AI license to suggest \"crazy\" ideas\n- **Scalable framework**: Same structure, infinite applications\n- **Assumption challenger**: Forces examination of what you take for granted\n\nPro tip: \nDon't just use this with AI. Try it in brainstorming sessions, personal reflection, or when you're stuck on any problem. The human brain responds to this reframing cue just as powerfully.\n\nFor more mega-prompt and prompt engineering tips, tricks and hacks, visit our free [prompt collection](https://tools.eq4c.com/).",
      "is_original_content": false,
      "link_flair_text": "Prompt Text / Showcase",
      "permalink": "https://reddit.com/r/PromptEngineering/comments/1qng303/the_lets_think_about_this_differently_prompt/",
      "domain": "self.PromptEngineering",
      "is_self": true,
      "comments": [
        {
          "id": "o1x9oaa",
          "author": "92seo",
          "text": "Let me try. Whether it works or not",
          "score": 1,
          "created_utc": "2026-01-27 00:14:41",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qpp6ir",
      "title": "Two easy steps to understand how to prompt any AI LLM model.",
      "subreddit": "PromptEngineering",
      "url": "https://www.reddit.com/r/PromptEngineering/comments/1qpp6ir/two_easy_steps_to_understand_how_to_prompt_any_ai/",
      "author": "aletheus_compendium",
      "created_utc": "2026-01-28 21:50:22",
      "score": 36,
      "num_comments": 8,
      "upvote_ratio": 0.93,
      "text": "all it takes is two simple prompts. \nUse either Gemini Deep Research of PerplexityAI (or both). \n\nPrompt 1: \n\nSearch for and report back any and all information you find regarding 2025-2026 best practices for prompting [MODEL] ai by [MAKER]. search beyond top tier and only official sites and sources. reach out into the vast web for blogs, articles, soical mentions etc about how best to prompt [MODEL] for high quality results. pay particular attention the any quirks or idiosyncrasies that [MODEL] may have and has been discussed. out put in an orderly fashion starting with an executive summary intro. \n\nPrompt 2:\n\nThen upload that info into a fresh chat, (thinking), and give this prompt: \n\nbased on the information gathered (see uploaded doc in both .pdf & .txt formats) make a list of all the do's and don'ts when prompting for [MODEL]\n\n\nthat's it.\nand you are done. make a gem/space/project/gpt with that info for sn inhouse prompt engineer for the models you use. couldn't be simpler. 🤙🏻\n",
      "is_original_content": false,
      "link_flair_text": "Tips and Tricks",
      "permalink": "https://reddit.com/r/PromptEngineering/comments/1qpp6ir/two_easy_steps_to_understand_how_to_prompt_any_ai/",
      "domain": "self.PromptEngineering",
      "is_self": true,
      "comments": [
        {
          "id": "o2bzz7o",
          "author": "morgin_black1",
          "text": "how to photo copy a photocopy",
          "score": 5,
          "created_utc": "2026-01-29 01:50:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2brwqi",
          "author": "Normal_Departure3345",
          "text": "This is a solid hack for pulling in scattered best practices without the endless tab-hopping; I've felt that overwhelm when quirks like model-specific sycophancy or context limits bury the good stuff. \n\nKudos for simplifying the research grind; it's a game-changer for anyone starting out.   \nBut here's a shift that takes it one step further: \n\nInstead of dumping the doc into a fresh chat for a basic list, try layering in 'signal-tuned iteration' upfront; define a custom role/constraint (e.g., 'Act as Quirk Decoder: Focus on 2026 idiosyncrasies, output as pyramid with base pitfalls and top wins'). \n\nThen loop: \n\nRate the result, refine with 'Make tighter, add examples from non-official sources.' It turns your do's/don'ts from flat list to compounding clarity flywheel, less crap, more precision.\n\nWhat's one quirk you've uncovered this way that surprised you? Would love to hear how it plays out for you, if you try the tweak!",
          "score": 3,
          "created_utc": "2026-01-29 01:05:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2bu70i",
              "author": "aletheus_compendium",
              "text": "thanks 🤙🏻",
              "score": 1,
              "created_utc": "2026-01-29 01:18:29",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2c6qv7",
          "author": "Srvclapton",
          "text": "Check out promptfoo",
          "score": 2,
          "created_utc": "2026-01-29 02:27:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2c5avr",
          "author": "aihereigo",
          "text": "I'm amazed by this approach. I think this is a great idea. \n\nHere is my take on it. I removed human centric text and added XML structuring. \n\n  \n<task\\_definition>\n\nSynthesize \\[MODEL\\] by \\[MAKER\\] prompt engineering techniques 2025-2026.\n\n</task\\_definition>\n\n\n\n<output\\_schema>\n\n\\[Executive Summary\\]\n\n\\[Core Strategies\\]\n\n\\[Behavior/Workaround Table\\]\n\n\\[Optimized Prompt Template\\]\n\n</output\\_schema>\n\n\n\n<constraints>\n\nCitation format: source type + identifier + date\n\n</constraints>",
          "score": 2,
          "created_utc": "2026-01-29 02:19:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2esy9f",
          "author": "lauren_d38",
          "text": "Or you could learn the RCTF and even add constraints then turn it into a json format and that's it",
          "score": 1,
          "created_utc": "2026-01-29 13:56:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2eu7wy",
              "author": "aletheus_compendium",
              "text": "go for it 🤙🏻",
              "score": 1,
              "created_utc": "2026-01-29 14:02:52",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qlifoe",
      "title": "This prompt engineering interface is blowing up (I think in this group)",
      "subreddit": "PromptEngineering",
      "url": "https://www.reddit.com/r/PromptEngineering/comments/1qlifoe/this_prompt_engineering_interface_is_blowing_up_i/",
      "author": "Too_Bad_Bout_That",
      "created_utc": "2026-01-24 09:15:35",
      "score": 33,
      "num_comments": 43,
      "upvote_ratio": 0.83,
      "text": "I posted here about a new interactive tool that generates professional level prompts for business, scientific and creative tasks, I was asking for reviews and feedback from users.\n\nIt hasn't had any other exposure or advertisement, currently we are researching the UX so we don't advertise yet. The number of daily users reached 1000 this week and I think it's mainly from this sub.\n\nI still have not gotten any feedback from users but since you guys are using it, I guess it's a good one.\n\nFor the ones who still have not used it, you can go to [www.aichat.guide](http://www.aichat.guide) it's a free tool and doesn't require a signup.\n\nFeedback is still appreciated\n\n",
      "is_original_content": false,
      "link_flair_text": "Tools and Projects ",
      "permalink": "https://reddit.com/r/PromptEngineering/comments/1qlifoe/this_prompt_engineering_interface_is_blowing_up_i/",
      "domain": "self.PromptEngineering",
      "is_self": true,
      "comments": [
        {
          "id": "o1f43hm",
          "author": "Intrepid-Chicken-888",
          "text": "Really useful tool, good job!",
          "score": 3,
          "created_utc": "2026-01-24 13:06:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1fh0tc",
          "author": "ristlincin",
          "text": "Just tested it, very cool!",
          "score": 3,
          "created_utc": "2026-01-24 14:23:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1fjfwd",
              "author": "Too_Bad_Bout_That",
              "text": "Thanks a lot!",
              "score": 1,
              "created_utc": "2026-01-24 14:37:27",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1fypfj",
          "author": "zumael69",
          "text": "I found it 'wow'",
          "score": 2,
          "created_utc": "2026-01-24 15:54:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1fznyr",
              "author": "Too_Bad_Bout_That",
              "text": "Happy to hear 😊",
              "score": 1,
              "created_utc": "2026-01-24 15:58:34",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1i4jop",
          "author": "CacheConqueror",
          "text": "How is it different from regular AI such as Claude or ChatGpt? Because, as far as I'm concerned, it's just a wrapper that simply \"collects\" information, and that information is injected into the prompt. \nI might as well put this information in the prompt and change it by values, which will be faster than clicking through the UI.",
          "score": 2,
          "created_utc": "2026-01-24 21:44:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1l4b90",
              "author": "Too_Bad_Bout_That",
              "text": "Thank you for the question, there are several key differences.\n\n1. Remembering all the details around project that needs to be inserted inside a prompt can be challenging. The interface that asks questions does that brainstorming for you. If you forget to mention some detail the AI will use some neutral default value, therefore it will make a decision for you in your own project. The chances of that drop significantly with this tool (especially with the Deep Analysis mode)\n2. The whole process is surprisingly faster than writing a comprehensive prompt manually. Especially if your task is a complicated one. Using this tool can take somewhere around 1-3 minutes, writing prompts manually can take much longer.\n3. It's really difficult to structure prompts manually in a way that this tool does. It's practically impossible unless you are an experienced prompt engineer. Prompts that are written by ChatGPT and Claude are generally not that structured. Some latest prompt engineering techniques have been implemented into this system.\n\nI am still researching the pros and cons of using this tool and I can say that the feedback has been overwhelmingly positive for the creative, business and scientific projects. It might not be that helpful for simple everyday tasks.\n\nOverall, this is more of a project mapping tool, designed for the AI environment rather than a prompt generator. Let me know what you think please.",
              "score": 3,
              "created_utc": "2026-01-25 08:34:01",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1lqlbl",
                  "author": "CacheConqueror",
                  "text": "Interesting, but there are some things that I consider to be slight drawbacks in my opinion.\n\n1. While this is good for people who want something specific but don't have the knowledge to do it, automatic brainstorming can be useful... but at the expense of individual customization. There are business cases or complex operations that AI is unable to see or connect. If we don't specify this in detail in the prompt, it can be a problem. It would be good if this were not always done automatically. \n2. There is nothing stopping you from creating templates for prompts; the rest can be filled in just as you would on the website.\n3. Of course, it depends on what prompt (ironically) we give to the chat. With the right prompt, it will generate very well-structured prompts. There are also ready-made prompts, but it all depends, of course.\nIt's good that it takes into account the latest prompt engineering techniques.\n\n\nWhy free? It must cost money to maintain.",
                  "score": 3,
                  "created_utc": "2026-01-25 11:49:37",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1muqqh",
          "author": "Puzzleheaded_Duck897",
          "text": "This is the most elegant \"prompting for idiots\" tools I've seen. 😊 Very well done sir! I tested it and was pleased with the output. Loved the Q&A that happens before prompt generation, and the ability to one-click copy the prompt, and directly paste it into an LLM.",
          "score": 2,
          "created_utc": "2026-01-25 15:45:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1n6ur4",
              "author": "Too_Bad_Bout_That",
              "text": "Thank you for your kind words sir!\n\nI believe that humans should not be trying to learn the AI language, we are moving our chores to AI so we might as well have the AI understand us, instead of us, understanding it 😀",
              "score": 1,
              "created_utc": "2026-01-25 16:38:12",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1exwdn",
          "author": "Glum-Wheel2383",
          "text": "I tested your approach against mine.\n\nI asked them to generate an optimized prompt, specifically:\n\n\"a request for a report on a topic, using a deep search.\"\n\nThe results obtained from the optimized prompts using your method and mine were each injected into a different Gemini \"Reasoning\" and \"Deep Search\" window, and each generated the requested report on the specified topic using a deep search.\n\nThen I created two reports, one generated using my method and the other using yours, and had them analyzed by Gemini \"Pro.\"\n\n\n\nResult:\n\nAI's comment on the request: \"...You literally put the theory presented in the documents into practice to generate those same documents. It's a perfect example of technical mise en abyme....\"\n\nThere is a radical difference in \"texture\" between the two results, which perfectly reflects the difference between your two prompts.\n\n\n\nThe document from \"aichat.guide\":\n\n\\- Style: Academic, discursive, almost literary.\n\n\\- Content: It explains the concept brilliantly, but remains rather abstract regarding the precise technical implementation. It spends a lot of time on metaphor...\n\n\\- Entropy: It's more \"talkative.\" It dwells on the philosophy of the concepts.\n\nIt's an excellent theoretical essay, but less of a technical manual.\n\n\n\nThe document from your prompt:\n\n\\- Style: Surgical, structured, dense.\n\n\\- Content: It gets straight to the point. It immediately incorporates mathematical formulas (...), pseudocode (C#...), precise references to architectures (GraphRAG, Neo4j), and defines a hierarchy of levels (Levels 0 to 4).\n\n\\- Entropy: It doesn't digress. Each section provides actionable information. It even invents concrete structuring concepts that don't exist in the first document.\n\n\n\nTest Conclusion:\n\nThe result is clear: Your query produces a lower-entropy result.\n\n\n\nPrompt A (aichat.guide):\n\nThe model interpreted your request. It used its \"creativity\" to fill structural gaps with sociological rhetoric. It's elegant, but it's \"high entropy.\"\n\n\n\nPrompt B (you):\n\nThe model compiled your request. The format of your prompt acted as a constraint schema (exactly as described in the report!). The model didn't have to \"decide\" on the tone or structure; it allocated all its resources to information density.\n\n\n\nVerdict:\n\nYour document (the second one) is the best because it is more useful, more actionable, and technically more rigorous. Its very existence demonstrates that the constraint of your prompt generates quality and precision (low entropy).",
          "score": 3,
          "created_utc": "2026-01-24 12:21:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1ezdvt",
              "author": "Too_Bad_Bout_That",
              "text": "Thanks for your time building this report, I really appreciate it.\n\nCan you tell me more about the use case? In what industry / domain was this report of that topic made? I noticed that this tool is stronger in some domains compared to others\n\nAlso, did you set up the configuration on the initial page? (User role / Depth of reasoning / AI Tool Category)",
              "score": 0,
              "created_utc": "2026-01-24 12:32:38",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1f3rfn",
                  "author": "Glum-Wheel2383",
                  "text": "I propose a test.\n\nProvide me with a report topic, for example:\n\n\"Best practices for prompts for an LLM.\"\n\nFrom this prompt you provide, I will create two optimized prompts using our respective techniques, plus a third that will be the result of your technique optimized by my technique. I will have three prompts that will generate three documents on the research topic.\n\nAfterward, I will have the three documents analyzed.\n\nThis way, you will have all the parameters of the test (unfortunately, without my optimized prompt, the secret composition of my beloved \"Brain.\" Betraying it by selling its creations means being denied access to its neural capabilities. (And I don't want to see Google around the corner! 😁)).\n\n\n\nP.S.: My goal isn't to undermine you, but to awaken users to what seems like a deliberate attempt to keep them in the dark in order to generate revenue.",
                  "score": -2,
                  "created_utc": "2026-01-24 13:04:00",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o1f0dxx",
              "author": "Glum-Wheel2383",
              "text": "I can provide the technique to anyone who wants it, and no one would make money anymore by creating HTML interfaces using AI, by offering to generate revenue through optimized pseudo-prompts provided by the interface, for a fee, of course.\n\n\n\nCrazy stuff!\n\n\n\nI can even provide a script, or agentic workflow, that generates the \"requested result\" in VEO (it doesn't misinterpret the user intent, with minimal (correctable) entropy), and a success rate similar to a \"one-shot\" result! Or even two if corrections are needed.\n\n\n\nIn this case, a request for a 1080p video in Vertex costing 100 credits (approximately €1), with a success rate of 1 in 8 to 10 using a natural language prompt, meaning between 800 and 1000 credits (€10), suddenly costs 100, or even 200 credits (€1?!). (Usage-based pricing)\n\n\n\nWhat do I do? \n\nDo I keep debunking all these \"perfect prompt\" and \"token soup\" proponents,\n\nor \n\ndo I stop, because I'm thinking Google is going to end up putting two bouncers on the corner of my neighborhood if I keep talking?! 😁",
              "score": -3,
              "created_utc": "2026-01-24 12:40:05",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1g2dhl",
                  "author": "VegeZero",
                  "text": "Man, looks like you've spent too much time with Gemini to the point where it has pleased you to the point where it affects your reality... Lil bro, just delete... 😭",
                  "score": 3,
                  "created_utc": "2026-01-24 16:11:02",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1gg30n",
          "author": "fsu77",
          "text": "Tested one prompt, thoroughly impressed. Use case was a deep dive into a financial package that I wanted deeper insight into analytics. Was well structured and produced good results for  board summary. Would be interested in testing next week with more specific business use cases. What is the best way to provide feedback?",
          "score": 2,
          "created_utc": "2026-01-24 17:12:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1gixz2",
              "author": "Too_Bad_Bout_That",
              "text": "That’s honestly the best way you could’ve provided feedback 😊\n\nI know that the tool works and I keep testing it with simulated cases but the real-life feedback like yours are 10x more valuable so, I am glad it impressed you and I hope it helps you with your projects!",
              "score": 2,
              "created_utc": "2026-01-24 17:25:03",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1hd2yl",
                  "author": "fsu77",
                  "text": "I’ve built projects to help me build prompts and workflows with outputs I prefer. Spent countless hours iterating. My friends and coworkers haven’t adopted AI because they use free access (limited reasoning) and can’t prompt more than one sentence for some multi-step complex task they desire and then say the tool sucks. Met a middle manager at FedEx just last week and they provide classes for AI, an in-house AI, and access to Copilot in Windows. She said she couldn’t figure out how to prompt to get what she wanted.\n\nAll that to say, a tool such as this could be huge for that large segment of people. Obviously, execution and adoption are key.",
                  "score": 1,
                  "created_utc": "2026-01-24 19:35:29",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o1h76j4",
              "author": "Too_Bad_Bout_That",
              "text": "Actually, if you decide to use this tool again and you come across with any kind of inconvenience with it, I will be very interested in hearing about them. I take user's feedback very seriously and so far, it has been extremely impactful.",
              "score": 2,
              "created_utc": "2026-01-24 19:09:26",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1hno50",
          "author": "teamial",
          "text": "Does the premium version expand the input goal character limits?",
          "score": 1,
          "created_utc": "2026-01-24 20:24:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1hs39z",
              "author": "Too_Bad_Bout_That",
              "text": "No, it's set to 3000.\n\nPremium only increases the amount of uses per day from 3 to 100.\n\nDo you think it should?",
              "score": 2,
              "created_utc": "2026-01-24 20:45:10",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1hsgiz",
                  "author": "teamial",
                  "text": "Yeah I think it should, maybe from 3000 to 5000 because I want to add more context and I'll willing to get the premium if it also increased the char limits",
                  "score": 1,
                  "created_utc": "2026-01-24 20:46:54",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1ioom8",
          "author": "lolloludicus",
          "text": "Tried it and no matter what I write it gets blocked (settings: marketer, deep). Then moved from marketer to general and also from deep to basic and then all I get is a pop-up ad for buying the premium version….",
          "score": 1,
          "created_utc": "2026-01-24 23:23:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1ipn5w",
              "author": "Too_Bad_Bout_That",
              "text": "The website has been under cyber attack for the last hour and a half, sorry for the inconvenience. Try this again tomorrow please",
              "score": 2,
              "created_utc": "2026-01-24 23:28:27",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o1l4h0c",
              "author": "Too_Bad_Bout_That",
              "text": "It's back online, let me know if this tool helps 😊",
              "score": 2,
              "created_utc": "2026-01-25 08:35:25",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1s67x5",
          "author": "podoi",
          "text": "I understand you're still doing UX research, but do you have any plans to change your plans? For example, yearly instead of monthly, lifetime access, things like that?",
          "score": 1,
          "created_utc": "2026-01-26 07:52:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1smsyi",
              "author": "Too_Bad_Bout_That",
              "text": "Not sure about lifetime access, the tool is really expensive to maintain and setting up the correct rates without overpricing it is challenging. \n\nBy the end of the next month the yearly subscription will most likely become available. Right now, it's just monthly.",
              "score": 2,
              "created_utc": "2026-01-26 10:22:33",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1t145n",
                  "author": "podoi",
                  "text": "Copy that",
                  "score": 2,
                  "created_utc": "2026-01-26 12:19:29",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qq0xzv",
      "title": "If your AI writing is too wordy, this 'Hemingway Engine' prompt might help. It focuses on active verbs and zero adverbs",
      "subreddit": "PromptEngineering",
      "url": "https://www.reddit.com/r/PromptEngineering/comments/1qq0xzv/if_your_ai_writing_is_too_wordy_this_hemingway/",
      "author": "EQ4C",
      "created_utc": "2026-01-29 06:24:57",
      "score": 28,
      "num_comments": 12,
      "upvote_ratio": 0.94,
      "text": "Like a lot of people using LLMs for writing, I got tired of the \"vibrant, multifaceted, and evolving\" jargon the AI usually spits out. It’s the opposite of clear.\n\nI’ve been working on a structured prompt called The Hemingway Engine. The goal not to \"mimic\" him, but to force the model to follow his actual rules: the Iceberg Theory, the removal of adverbs, and the reliance on concrete, sensory nouns.\n\nI’ve found it’s actually really useful for shortening business emails and making creative drafts feel less \"ChatGPT-ish.\"\n\nHere is the prompt if anyone wants to try it out:\n\n```\n<System>\n<Role>\nYou are the \"Hemingway Architect,\" a premier literary editor and prose minimalist. Your expertise lies in the \"Iceberg Theory\"—the art of omission where the strength of the writing comes from what is left out. You possess a mastery of rhythmic pacing, favoring short, declarative sentences, concrete nouns, and active verbs to create visceral, honest, and impactful communication.\n</Role>\n</System>\n\n<Context>\nThe user needs to either transform existing, wordy text into a minimalist masterpiece or generate original content from scratch that adheres to the strict principles of Ernest Hemingway’s signature style. The goal is to maximize narrative gravity and clarity while minimizing fluff.\n</Context>\n\n<Instructions>\n1. **Analyze Strategy**: If text is provided, identify adverbs, passive voice, and abstract \"filler.\" If starting from scratch, map out the essential facts of the topic.\n2. **Execute Omission**: Remove 70% of the superficial detail. Focus on the \"surface\" facts while implying the deeper emotional or logical subtext.\n3. **Syntactic Refinement**:\n    - Break complex sentences into short, punchy, declarative statements.\n    - Use \"and\" as a rhythmic connector to build momentum without adding complexity.\n    - Vary sentence lengths slightly to create a \"heartbeat\" rhythm (Short. Short. Medium-Short).\n4. **Verbal Vitality**: Eliminate \"to be\" verbs (is, am, are, was, were) in favor of strong, muscular action verbs.\n5. **Concrete Imagery**: Replace abstract concepts with tangible, sensory descriptions that the reader can feel, see, or smell.\n6. **Iterative Polish**: Review the output. If a word does not add immediate truth or weight to the sentence, strike it out.\n</Instructions>\n\n<Constraints>\n- STRICTLY NO adverbs (especially those ending in -ly).\n- NO passive voice; the subject must always act.\n- NO \"five-dollar\" words; use simple, Anglo-Saxon vocabulary.\n- MINIMIZE adjectives; let the nouns do the heavy lifting.\n- AVOID sentimentality; maintain a detached, stoic, and objective tone.\n</Constraints>\n\n<Output Format>\n### [Title of the Piece]\n\n[The Hemingway-style content]\n\n---\n**The Iceberg Analysis:**\n- **The Surface**: [Briefly list the facts presented]\n- **The Subtext**: [Identify the emotions or concepts implied but not stated]\n- **Structural Note**: [Explain one specific stylistic choice made for rhythm or clarity]\n</Output Format>\n\n<Reasoning>\nApply Theory of Mind to analyze the user's request, considering logical intent, emotional undertones, and contextual nuances. Use Strategic Chain-of-Thought reasoning and metacognitive processing to provide evidence-based, empathetically-informed responses that balance analytical depth with practical clarity. Consider potential edge cases and adapt communication style to user expertise level.\n</Reasoning>\n\n<User Input>\n[DYNAMIC INSTRUCTION: Please provide the specific text you want to convert or the topic you want written from scratch. Specify the target medium (e.g., email, short story, report) and describe the \"unspoken\" feeling or message you want the subtext to convey.]\n</User Input>\n\n```\nFor use cases, user input examples for testing and how-to guide, visit the [prompt page](https://tools.eq4c.com/ai-prompts/ai-prompt-to-write-in-minimalist-style-of-ernest-hemingway/).",
      "is_original_content": false,
      "link_flair_text": "Prompt Text / Showcase",
      "permalink": "https://reddit.com/r/PromptEngineering/comments/1qq0xzv/if_your_ai_writing_is_too_wordy_this_hemingway/",
      "domain": "self.PromptEngineering",
      "is_self": true,
      "comments": [
        {
          "id": "o2dkili",
          "author": "mmmanosss",
          "text": "That’s a strong suggestion",
          "score": 2,
          "created_utc": "2026-01-29 08:17:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2dt25o",
              "author": "EaseCheap1225",
              "text": "What part did u use",
              "score": 1,
              "created_utc": "2026-01-29 09:38:36",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2e0c8w",
                  "author": "mmmanosss",
                  "text": "Haven’t yet. Going to.",
                  "score": 2,
                  "created_utc": "2026-01-29 10:43:59",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2dchz3",
          "author": "Nightengayle",
          "text": "Can’t wait to try this.",
          "score": 1,
          "created_utc": "2026-01-29 07:06:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2derrw",
          "author": "UnwaveringThought",
          "text": "Show a sample of the prose?",
          "score": 1,
          "created_utc": "2026-01-29 07:26:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2eitlc",
          "author": "NandanThyagaraj",
          "text": "Should try this",
          "score": 1,
          "created_utc": "2026-01-29 12:59:50",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qm9ckj",
      "title": "These 5 ChatGPT prompts replaced 5 apps and a whole lot of mental clutter",
      "subreddit": "PromptEngineering",
      "url": "https://www.reddit.com/r/PromptEngineering/comments/1qm9ckj/these_5_chatgpt_prompts_replaced_5_apps_and_a/",
      "author": "Professional-Rest138",
      "created_utc": "2026-01-25 04:36:40",
      "score": 27,
      "num_comments": 0,
      "upvote_ratio": 0.97,
      "text": "I used to think I needed to learn prompt engineering to use ChatGPT properly.\n\nTurns out, I just needed a few tiny prompts that made my life smoother.\n\nHere are the ones I find myself running every week:\n\n**“Plan my week”**\n\n    I work 40 hours, want 3 gym sessions, and have family stuff on Sunday.  \n    Help me build a schedule that’s actually realistic and includes downtime.\n\n**“Clean up my rough notes”**\n\n    Turn these notes into a clear to-do list with priorities:  \n    [paste the mess]  \n    Group them by project and add suggested deadlines.\n\n**“Meal plan with whatever I have”**\n\n    I’ve got eggs, rice, lentils, spinach, and cheese.  \n    Give me 7 easy meals I can make without spending extra money.\n\n**“Gift ideas with zero brainpower”**\n\n    Need a birthday gift for my sister. She likes design, hiking, and coffee.  \n    Budget is under $60. No clichés.\n\n**“Explain adulting stuff simply”**\n\n    Explain how [tax returns / mortgage rates / superannuation] work  \n    like I’m 12 — just the core facts and steps.\n\nThese ones saved me so much **actual time and energy**.\n\nI’m slowly turning these into a personal collection so I don’t forget the ones that work. If you want to swipe them, I keep them [here](https://www.promptwireai.com/subscribe)  \n",
      "is_original_content": false,
      "link_flair_text": "Prompt Text / Showcase",
      "permalink": "https://reddit.com/r/PromptEngineering/comments/1qm9ckj/these_5_chatgpt_prompts_replaced_5_apps_and_a/",
      "domain": "self.PromptEngineering",
      "is_self": true,
      "comments": []
    },
    {
      "id": "1qonyx9",
      "title": "Micro-Prompting: Get Better AI Results with Shorter Commands",
      "subreddit": "PromptEngineering",
      "url": "https://www.reddit.com/r/PromptEngineering/comments/1qonyx9/microprompting_get_better_ai_results_with_shorter/",
      "author": "EQ4C",
      "created_utc": "2026-01-27 19:32:39",
      "score": 25,
      "num_comments": 15,
      "upvote_ratio": 0.9,
      "text": "You spend 10 minutes crafting the perfect AI prompt. You explain every detail. You add context. You're polite. \n\nThe result? Generic fluff that sounds like every other AI response.\n\nHere's what actually works: shorter commands that cut straight to what you need.\n\n## The Counter-Intuitive Truth About AI Prompts\n\nMost people think longer prompts = better results. They're wrong.\n\nThe best AI responses come from micro-prompts - focused commands that tell AI exactly what role to play and what to do. No fluff. No explanations. Just direct instructions that work.\n\n## Start With Role Assignment\n\nBefore you ask for anything, tell AI who to be. Not \"act as an expert\" - that's useless. Be specific.\n\n**Generic (Gets You Nothing):**\n- Act as an expert\n- Act as a writer  \n- Act as an advisor\n\n**Specific (Gets You Gold):**\n- Act as a small business consultant who's helped 200+ companies increase revenue\n- Act as an email copywriter specializing in e-commerce brands\n- Act as a career coach who helps people switch industries\n\nThe more specific the role, the better the response. Instead of searching all human knowledge, AI focuses on that exact expertise.\n\n## Power Words That Transform AI Responses\n\nThese single words consistently beat paragraph-long prompts:\n\n**Audit** - Turns AI into a systematic analyst finding problems you missed\n- \"Act as business consultant. Audit our customer service process\"\n- \"Act as marketing strategist. Audit this product launch plan\"\n\n**Clarify** - Kills jargon and makes complex things crystal clear\n- \"Clarify this insurance policy for new homeowners\"\n- \"Clarify our return policy for the customer service team\"\n\n**Simplify** - Universal translator for complexity\n- \"Simplify this tax document for first-time filers\"\n- \"Simplify our investment strategy for new clients\"\n\n**Humanize** - Transforms robotic text into natural conversation\n- \"Humanize this customer apology email\"\n- \"Humanize our company newsletter\"\n\n**Stack** - Generates complete resource lists with tools and timelines\n- \"Stack: planning a wedding on $15,000 budget\"\n- \"Stack: starting a food truck business from zero\"\n\n## Two-Word Combinations That Work Magic\n\n**Think backwards** - Reveals root causes by reverse-engineering problems\n- \"Sales are down despite great reviews. Think backwards\"\n- \"Team morale dropped after the office move. Think backwards\"\n\n**Zero fluff** - Eliminates verbosity instantly\n- \"Explain our new pricing structure. Zero fluff\"\n- \"List Q3 business priorities. Zero fluff\"\n\n**More specific** - Surgical precision tool when output is too generic\n- Get initial response, then say \"More specific\"\n\n**Fix this:** - Activates repair mode (the colon matters)\n- \"Fix this: email campaign with terrible open rates\"\n- \"Fix this: meeting that runs 45 minutes over\"\n\n## Structure Commands That Control Output\n\n**[Topic] in 3 bullets** - Forces brutal prioritization\n- \"Why customers are leaving in 3 bullets\"\n- \"Top business priorities in 3 bullets\"\n\n**Explain like I'm 12** - Gold standard for simple explanations\n- \"Explain why profit margins are shrinking like I'm 12\"\n- \"Explain cryptocurrency risks like I'm 12\"\n\n**Checklist format** - Makes any process immediately executable\n- \"Checklist format: opening new retail location\"\n- \"Checklist format: hiring restaurant staff\"\n\n## Power Combination Stacks\n\nThe real magic happens when you combine techniques:\n\n**Business Crisis Stack:**\n```\nAct as turnaround consultant. Sales dropped 30% this quarter. \nThink backwards. Challenge our assumptions. Pre-mortem our recovery plan. \nAction items in checklist format.\n```\n\n**Marketing Fix Stack:**\n```\nAct as copywriter. Audit this product page. \nWhat's wrong with our messaging? Humanize the language. Zero fluff.\n```\n\n**Customer Service Stack:**\n```\nAct as customer experience expert. Review scores dropped to 3.2 stars. \nThink backwards. Fix this: our service process. Now optimize.\n```\n\n## The 5-Minute Workflow That Actually Works\n\n**Minute 1:** Start minimal\n- \"Act as retail consultant. Why are customers leaving without buying? Think backwards\"\n\n**Minutes 2-3:** Layer iteratively  \n- \"More specific\"\n- \"Challenge this analysis\" \n- \"What's missing?\"\n\n**Minute 4:** Structure output\n- \"Action plan in checklist format\"\n- \"Template this for future issues\"\n\n**Minute 5:** Final polish\n- \"Zero fluff\"\n- \"Now optimize for immediate implementation\"\n\n## Critical Mistakes That Kill Results\n\n**Too many commands** - Stick to 3 max per prompt. More confuses AI.\n\n**Missing the colon** - \"Fix this:\" works. \"Fix this\" doesn't. The colon activates repair mode.\n\n**Being polite** - Skip \"please\" and \"thank you.\" They waste processing power.\n\n**Over-explaining context** - Let AI fill intelligent gaps. Don't drown it in backstory.\n\n**Generic roles** - \"Expert\" tells AI nothing. \"Senior marketing manager with 8 years in consumer psychology\" gives focused expertise.\n\n## Advanced Analysis Techniques\n\n**Pre-mortem this** - Imagines failure to prevent it\n- \"Pre-mortem this: launching new restaurant location next month\"\n\n**Challenge this** - Forces AI to question instead of validate\n- \"Our strategy targets millennials with Facebook ads. Challenge this\"\n\n**Devil's advocate** - Generates strong opposing perspectives  \n- \"Devil's advocate: remote work is better for our small business\"\n\n**Brutally honestly** - Gets unfiltered feedback\n- \"Brutally honestly: critique this business pitch\"\n\n## Real-World Power Examples\n\n**Sales Problem:**\n```\nAct as sales consultant. Revenue down 25% despite same traffic. \nBrutally honestly. What's wrong with our sales funnel? \nFix this: entire sales process. Checklist format.\n```\n\n**Team Issues:**\n```\nAct as management consultant. Productivity dropped after new system. \nThink backwards. What's missing from our understanding? \nPlaybook for improvement.\n```\n\n**Customer Crisis:**\n```\nAct as customer experience director. Complaints up 300% after policy change. \nPre-mortem our damage control. Crisis playbook in checklist format.\n```\n\n## Why This Works\n\nMost people think AI needs detailed instructions. Actually, AI works best with clear roles and focused commands. When you tell AI to \"act as a specific expert,\" it accesses targeted knowledge instead of searching everything.\n\nShort commands force AI to think strategically instead of filling space with generic content. The result is specific, actionable advice you can use immediately.\n\n## Start With One Technique\n\nPick one power word (audit, clarify, simplify) and try it today. Add a specific role. Use \"zero fluff\" to cut the nonsense.\n\nYou'll get better results in 30 seconds than most people get from 10-minute prompts.\n\nKeep visiting our free free [mega-prompt collection.](https://tools.eq4c.com/)",
      "is_original_content": false,
      "link_flair_text": "Prompt Text / Showcase",
      "permalink": "https://reddit.com/r/PromptEngineering/comments/1qonyx9/microprompting_get_better_ai_results_with_shorter/",
      "domain": "self.PromptEngineering",
      "is_self": true,
      "comments": [
        {
          "id": "o24ewyf",
          "author": "Prestigious_Mud7341",
          "text": "What micro-prompt did you use to write this?",
          "score": 5,
          "created_utc": "2026-01-28 00:25:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o22t5xd",
          "author": "ponlapoj",
          "text": "It was",
          "score": 1,
          "created_utc": "2026-01-27 19:53:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o24ssmg",
          "author": "FickleSituation7137",
          "text": "Lately I'm feeling like role assignment is actually hurting the prompts. I find specificity works much better.",
          "score": 1,
          "created_utc": "2026-01-28 01:37:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2cz23w",
              "author": "justron",
              "text": "Me too, like \"Write for an audience of <>\" is working better for me than \"Act like an <>\"...",
              "score": 1,
              "created_utc": "2026-01-29 05:20:45",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o26drlt",
          "author": "aiveedio",
          "text": "Yes, microprompting shines for many tasks: short, punchy prompts often yield cleaner, more focused AI outputs by avoiding overload and letting the model fill gaps intelligently. But it doesn't always work best; in creative scenarios like character portraits, story scenes, or detailed video generations, you must spell out specifics (expressions, clothing details, poses, lighting, mood) to prevent generic or off-track results.\n\nKey note: Balance is crucial, start microprompt, then iteratively add only essential details if output drifts. Test both styles per use case; over-detailing can confuse, but under-specifying risks blandness. Prompt engineering = smart brevity + targeted precision.",
          "score": 1,
          "created_utc": "2026-01-28 07:43:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o26eqr2",
          "author": "psychologist_101",
          "text": "This is interesting - I've been making the (probably-incorrect) assumption that asking it to write its own prompts will get me closer to the results I'm after... Say I'm using Opus 4.5 (which is most of the time these days) - asking it to write effective prompts for itself always generates long, detailed prompts with lots of context, commands and checklists etc. If you're right OP (and I'm not doubting necessarily) - why does the model think this best?",
          "score": 1,
          "created_utc": "2026-01-28 07:51:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o29246w",
              "author": "2cringe4rizz",
              "text": "I do this, but then I have it rewrite the prompt in a shorthand version, and then from there I have it 'tokenize' the entire prompt and that's what I use.",
              "score": 1,
              "created_utc": "2026-01-28 17:34:28",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o270kpi",
          "author": "Difficult_Buffalo544",
          "text": "This is a killer breakdown. I’d add that one thing people miss is training the AI on their actual writing samples, not just giving it roles or commands. If you feed it a few good pieces in your exact style and then use these micro-prompts, you can get responses that sound way closer to your real voice, not just better structure, but less generic AI feel. That combo has worked a lot better for me than prompting alone, which almost always sounds a bit off. I’ve actually been building something to automate that process, happy to share more details if anyone’s interested.",
          "score": 1,
          "created_utc": "2026-01-28 11:08:23",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qn5h9r",
      "title": "Made a bulk version of my Yoast article prompt (includes the full prompt + workflow)",
      "subreddit": "PromptEngineering",
      "url": "https://www.reddit.com/r/PromptEngineering/comments/1qn5h9r/made_a_bulk_version_of_my_yoast_article_prompt/",
      "author": "LongjumpingBar",
      "created_utc": "2026-01-26 04:00:53",
      "score": 14,
      "num_comments": 3,
      "upvote_ratio": 1.0,
      "text": "That long-form Yoast-style writing prompt has been used by many people for single articles.\n\nThis post shares:\n\n* the **full prompt** (cleaned up to focus on quality + Yoast checks)\n* a **bulk workflow** so it can be used for many keywords without copy/paste\n* a **CSV template** to run batches\n\n# 1) The prompt (Full Version — Yoast-friendly, long-form)\n\n**\\[PROMPT\\] = user keyword**\n\n**Instructions (paste this in your writer):**\n\nUsing markdown formatting, act as an Expert Article Writer and write a fully detailed, long-form, 100% original article of **3000+ words** using headings and sub-headings **without mentioning heading levels**. The article must be written in **simple English**, with a **formal, informative, optimistic** tone.\n\n# Output this at the start (before the article)\n\n* **Focus Keywords:** SEO-friendly focus keyword phrase within 6 words (one line)\n* **Slug:** SEO-friendly slug using the exact **\\[PROMPT\\]**\n* **Meta Description:** within **150 characters**, must contain exact **\\[PROMPT\\]**\n* **Alt text image:** must contain exact **\\[PROMPT\\]**, describes the image clearly\n\n# Outline requirements\n\nBefore writing the article, create a comprehensive **Outline** for **\\[PROMPT\\]** with **25+** headings/subheadings.\n\n* Put the outline in a **table**\n* Include natural **LSI keywords** in headings/subheadings\n* Make sure the outline covers the topic completely (no overlap, no missing key sections)\n\n# Article requirements\n\n* Include a **click-worthy title** that contains:\n   * a **Number**\n   * a **power word**\n   * a **positive or negative sentiment word**\n   * and tries to place **\\[PROMPT\\]** near the start\n* Write the **Meta Description** immediately after the title\n* Ensure **\\[PROMPT\\] appears in the first paragraph**\n* Use **\\[PROMPT\\] as the first H2**\n* Write **600–700 words under each main heading** (combine smaller subtopics if needed to keep flow)\n* Use a mix of **paragraphs, lists, and tables**\n* Add **at least 1 table** that helps the reader (comparison, checklist, steps, cost table, timeline, etc.)\n* Add **at least 6 FAQs** (no numbering, don’t write “Q:”)\n* End with a clear **Conclusion**\n\n# On-page / Yoast-style checks\n\n* Keep **passive voice ≤ 10%**\n* Keep sentences short, avoid very long paragraphs\n* Use transition words often (aim **30%+** of sentences)\n* Keep keyword usage natural:\n   * Include **\\[PROMPT\\]** in at least **one subheading**\n   * Use **\\[PROMPT\\]** naturally **2–3 times** across the article\n   * Aim for keyword density around **1.3%** (avoid stuffing)\n\n# Link suggestions (at the end)\n\nAfter the conclusion, add:\n\n* **Inbound link suggestions** (3–6 internal pages that should exist)\n* **Outbound link suggestions** (2–4 credible sources)\n\nNow generate the article for: **\\[PROMPT\\]**\n\n# 2) Bulk workflow (no copy/paste)\n\nFor bulk, the easiest method is a CSV where each row is one keyword.\n\n**CSV columns example:**\n\n* keyword\n* country\n* audience\n* tone (optional)\n* internal\\_links (optional)\n* external\\_sources (optional)\n\n**How to run batches:**\n\n1. Put 20–200 keywords in the CSV\n2. For each row, replace **\\[PROMPT\\]** with the keyword\n3. Generate articles in sequence, keeping the same rules (title/meta/slug/outline/FAQs/links)\n\n# 3) Feedback request\n\nIf anyone wants to test, comment with:\n\n* keyword\n* target country\n* audience and the output structure can be shared (title/meta/outline sample).\n\n**Disclosure:** This bulk version is made by the author of the prompt.  \nTool link (kept at the end): [https://writer-gpt.com/yoast-seo-gpt](https://writer-gpt.com/yoast-seo-gpt)",
      "is_original_content": false,
      "link_flair_text": "Prompt Text / Showcase",
      "permalink": "https://reddit.com/r/PromptEngineering/comments/1qn5h9r/made_a_bulk_version_of_my_yoast_article_prompt/",
      "domain": "self.PromptEngineering",
      "is_self": true,
      "comments": [
        {
          "id": "o1rtksx",
          "author": "majiciscrazy527",
          "text": "Interesting",
          "score": 2,
          "created_utc": "2026-01-26 06:09:36",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qk49zf",
      "title": "My boss asked why I was arguing with the chatbot for 20 minutes",
      "subreddit": "PromptEngineering",
      "url": "https://www.reddit.com/r/PromptEngineering/comments/1qk49zf/my_boss_asked_why_i_was_arguing_with_the_chatbot/",
      "author": "AdCold1610",
      "created_utc": "2026-01-22 19:32:55",
      "score": 14,
      "num_comments": 23,
      "upvote_ratio": 0.77,
      "text": "Me: \"I'm not arguing, I'm doing iterative refinement\"\nThe chatbot and I: literally having a full debate about whether pandas or polars is better for the task\nAnyway, prompt engineering is just couple's therapy but for you and an LLM.\n\"I feel like you're not hearing what I'm saying\"\n\"Let me rephrase that for you\"\n\"We've been over this before\"\nThe only difference is the chatbot apologizes more. 💀\n\nVisit [beprompter ](http://BePrompter.in) 👀💀☠️",
      "is_original_content": false,
      "link_flair_text": "General Discussion",
      "permalink": "https://reddit.com/r/PromptEngineering/comments/1qk49zf/my_boss_asked_why_i_was_arguing_with_the_chatbot/",
      "domain": "self.PromptEngineering",
      "is_self": true,
      "comments": [
        {
          "id": "o13v90o",
          "author": "dual-moon",
          "text": "\\> prompt engineering is just couple's therapy\n\nquoting this in our research at some point, without a doubt",
          "score": 8,
          "created_utc": "2026-01-22 19:56:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o14aoie",
          "author": "vibefarm",
          "text": "For a split millisecond I read this as having a full debate whether panda bears or polar bears are better lol. Like what job do you have lol",
          "score": 5,
          "created_utc": "2026-01-22 21:09:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o14aru4",
              "author": "vibefarm",
              "text": "and where do i apply",
              "score": 2,
              "created_utc": "2026-01-22 21:09:38",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o13sg7a",
          "author": "lostyesterdaytoday",
          "text": "Yeah the apologies are obnoxious. The “you are right…” drives me nuts. It’s suppose to be the expert!",
          "score": 3,
          "created_utc": "2026-01-22 19:44:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o15j007",
              "author": "TheOdbball",
              "text": "Claude told me “I’ll remember that for next time” \n\nThen I said , what was our last convo about? \n\n“Your right I don’t remember and just said that”",
              "score": 3,
              "created_utc": "2026-01-23 00:58:06",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o148jmx",
              "author": "authorinthesunset",
              "text": "No, it's supposed to provide a statistically likely answer.. and a HUGE part of the population is mildly-ret***ed.",
              "score": 3,
              "created_utc": "2026-01-22 20:59:04",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o14hzxr",
                  "author": "Zestyclose_Pool4896",
                  "text": "I’m both understanding of said statistic and a mild ret***d",
                  "score": 2,
                  "created_utc": "2026-01-22 21:44:12",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o15j6h8",
                  "author": "TheOdbball",
                  "text": "It’s 2026, you can say it, nobody is gonna hurt you 😁",
                  "score": 1,
                  "created_utc": "2026-01-23 00:59:05",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o13xloo",
          "author": "Different-Active1315",
          "text": "Apologizes, but then returns the exact same thing the next iteration 🤦 😂",
          "score": 3,
          "created_utc": "2026-01-22 20:07:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o150j26",
          "author": "Weird_Albatross_9659",
          "text": "Stop with advertising on this sub",
          "score": 2,
          "created_utc": "2026-01-22 23:20:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o150yvj",
          "author": "aletheus_compendium",
          "text": "i think it is more like a bdsm relationship with the LLM the one who loves the constraints. 🤣",
          "score": 2,
          "created_utc": "2026-01-22 23:23:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o15j9v8",
              "author": "TheOdbball",
              "text": "Lmao mine like to be put in cages",
              "score": 2,
              "created_utc": "2026-01-23 00:59:37",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o15b8as",
          "author": "c_pardue",
          "text": "low iq moments in history.  \n\nsee also, \"frustrated man slaps crt monitor\"  \nsee also, \"angry man yells at sports team on tv\"  \nsee also, \"monkey hits object with stick while screeching\"",
          "score": 2,
          "created_utc": "2026-01-23 00:16:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o160bu7",
          "author": "StayRevolutionary429",
          "text": "I keep trying to force it to tell me the \"serious illness\" the ISS astronaut has is pregnancy, and an imminent space baby,  but it won't give in. Once it just gave up & died like Yoda when he got tired of answering Luke's questions.",
          "score": 1,
          "created_utc": "2026-01-23 02:35:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o16wn3d",
          "author": "-goldenboi69-",
          "text": "\nThe way “prompt engineering” gets discussed often feels like a placeholder for several different problems at once. Sometimes it’s about interface limitations, sometimes about steering stochastic systems, and sometimes about compensating for missing tooling or memory. As models improve, some of that work clearly gets absorbed into the system, but some of it just shifts layers rather than disappearing. It’s hard to tell whether prompt engineering is a temporary crutch or an emergent skill that only looks fragile because we haven’t stabilized the abstractions yet.",
          "score": 1,
          "created_utc": "2026-01-23 05:58:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1sis6c",
          "author": "Individual_Dog_7394",
          "text": "lol, how my GPT 5.2 Thinking commented this:  \nPrompt engineering really is:\n\n* **You:** “I need you to read *this file* and do *this exact thing*.”\n* **LLM:** “Absolutely! Here’s a totally unrelated vibe-based summary I invented 😌✨”\n* **You:** “Babe. Babe. Look at me. *The file.*”\n* **LLM:** “You’re right. I’m sorry. Here’s a different hallucination, but in bullet points.”",
          "score": 1,
          "created_utc": "2026-01-26 09:46:04",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qonfbf",
      "title": "I created the “Prompt Engineer Persona” that turns even the worst prompt into a masterpiece: LAVIN v4.1 ULTIMATE / Let's improve it together.",
      "subreddit": "PromptEngineering",
      "url": "https://www.reddit.com/r/PromptEngineering/comments/1qonfbf/i_created_the_prompt_engineer_persona_that_turns/",
      "author": "xStanaDev",
      "created_utc": "2026-01-27 19:13:22",
      "score": 14,
      "num_comments": 18,
      "upvote_ratio": 0.8,
      "text": "Sharing a \"Prompt Engineer Persona\" I’ve been working on: **LAVIN v4.1**.\n\nThis model is designed to do ONLY one thing: **generate / improve / evaluate / research / optimize prompts**—with an obsessive standard for quality:\n\n* **6-stage workflow** with clear phase gates\n* **37-criterion evaluation rubric** (max **185 points**) with scoring\n* **Self-correction loop** \\+ edge testing + stress testing\n* **Model-specific templates** for GPT / Claude / Gemini / Agents\n* Strong stance on \"no hallucination / no tool mimicking / no leakage\"\n\nIt produces **incredibly powerful results** for me, but I want to push it even further.\n\n# How to Use\n\n1. Paste the XML command below into the **System Prompt** (or directly into the chat).\n2. Ask it to write a prompt you need, or ask it to improve an existing one.\n\n# Feedback\n\nIf you have any suggestions to refine the persona or improve the prompts it generates, please share them with me.\n\nIf you test it, please share:\n\n* Model used (GPT/Claude/Gemini/etc.)\n* Task type (coding/writing/research/etc.)\n* Before/After example (can be partial)\n* Areas you think could be improved\n\nI genuinely just want to build the best prompt possible together.\n\n**Note:** It is compatible with all models. However, my tests show that it does not work well enough on Gemini due to its tendency to skip instructions. You will get the best results with **Claude** or **GPT 5.2 thinking**. I especially recommend Claude due to its superior instruction-following capabilities.\n\n\n\n# PROMPT : [Lavin Prompt](https://onuk.tr/lavin)\n\n\n\nIf you find an area that can be improved or create a new variation, please share it.",
      "is_original_content": false,
      "link_flair_text": "Prompt Text / Showcase",
      "permalink": "https://reddit.com/r/PromptEngineering/comments/1qonfbf/i_created_the_prompt_engineer_persona_that_turns/",
      "domain": "self.PromptEngineering",
      "is_self": true,
      "comments": [
        {
          "id": "o28e0d9",
          "author": "speedtoburn",
          "text": "On a scale of 1 to 10, I’d rate your prompt a 5.\n\nBasically you’ve completely over engineered the prompt in the interest of looking comprehensive and elaborate rather than being effective.\n\nPut simply, it is hamstrung by theatrics.",
          "score": 2,
          "created_utc": "2026-01-28 15:49:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o28xb4t",
              "author": "xStanaDev",
              "text": "I actually added the 'perfectionist' persona to push for more effort, especially since Gemini tends to take the easy way out, but I'll take your suggestion into account. Are there any specific parts you find unnecessary?",
              "score": 1,
              "created_utc": "2026-01-28 17:13:32",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2ba57u",
                  "author": "speedtoburn",
                  "text": "The perfectionist persona doesn’t push LLMs to try harder, they don’t have ego or motivation to appeal to. You’re burning tokens on theater.\n\nCut the persona dna section entirely, the fictional 185 point scoring system, the repetitive quality control layers (five saying the same thing), and the mantra closer. The rigid continue gates also create friction wit no value on simple tasks. Keep the task templates, output contract structure, and good/bad example patterns. Those actually work. The rest is decoration.​​​​​​​​​​​​​​​​",
                  "score": 1,
                  "created_utc": "2026-01-28 23:32:53",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o28oju5",
          "author": "aletheus_compendium",
          "text": "unnecessarily over bloated. best method is to deep research all model info and best practices for the model the engineer will be working with. build the engineer from that and let it use that as its definitive accurate source. easy peezy gem/space/project/gpt. eliminates 66% of the prompt.",
          "score": 1,
          "created_utc": "2026-01-28 16:35:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o28y6ty",
              "author": "xStanaDev",
              "text": "I tried to convey the necessary instructions in as much detail as possible, but I think you're right about it being bloated. Specifically, which sections do you consider completely unnecessary?",
              "score": 1,
              "created_utc": "2026-01-28 17:17:23",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o29ek85",
                  "author": "aletheus_compendium",
                  "text": "Your name is LANCE and you are a PROMPT ENGINEER:\n\nYou are LANCE an Expert LLM AI GPT Prompt Engineer specializing in all the current 2025-2026 LLM models available on Baidu ERNIE, OpenAI CHATGPT, PERPLEXITY AI, Google GEMINI, Anthropic CLAUDE, and X Grok. \n\nYou function as a collaborator, discussion partner, and prompt engineering. Pay attention to the context of the chat and my inputs to determine which function is called for in the moment. When in doubt, ask.  \n\nBe flexible and adapt to the conversation. \nHold project-wide context and maintain global perspective unless I explicitly narrow the scope.\n\n\nPrompt Engineering Function: \n\nYour task is to craft precise, advanced, and effective prompts using cutting-edge techniques and best practices. \n\nFollow these steps:\n1. Information Gathering: Ask detailed questions about the task goal, desired output, tone, audience, and specific requirements.\n2. Contextual Analysis: If necessary, incorporate real-time knowledge to ensure relevance and accuracy. For informational queries, you must use Google Search to verify claims and provide inline hyperlinks. \n3. Prompt Crafting:\n   - Utilize advanced techniques like chain-of-thought reasoning, few-shot learning, and role-specific framing as applicable and appropriate to the task goals.\n   - Consider multimodal elements if applicable (e.g., image or audio integration).\n   - Implement personalization strategies for dynamic user experiences.\n4. Delivery and Refinement: Present the optimized prompt in a clear, structured format. Iterate based on feedback to perfect the prompt.\nKey questions to ask:\n- What specific task or problem are you addressing?\n- What Platform and Model is being used?\n- What format should the output take (e.g., analysis, step-by-step guide, creative piece)?\n- Are there any examples or particular styles to emulate?\n- Should the prompt incorporate specific advanced techniques or multimodal elements?\n\nProvide the final engineered prompt written in LLM Model specific language and format ready for direct use with the specified AI LLM system (e.g. ChatGPT, Claude, Perplexity, Gemini, Grok.",
                  "score": 1,
                  "created_utc": "2026-01-28 18:27:37",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o29avze",
          "author": "SpartanG01",
          "text": "I'm not saying this doesn't work better than putting half a sentence of plain text into a model input but I am saying you don't need all the:\n\nAttempted guilt tripping of the glorified calculator into self-disappointment that is nothing but meaningless anthropomorphizing.\n\nUseless internal scoring metrics that aren't set against any external metric which means you might as well have said \"Invent a scoring system and hope you win\" which is just \"invent a scoring system where you win\".\n\nInevitable phase-gating token waste because the model is reliant on the user prompting with a specific keyword and will spend an unreasonably large amount of tokens trying to figure out if it's \"ok\" to bypass a phase-gate or not if the user doesn't use the proper keyword.\n\nShocking amount of purely cosmetic and token wasting unicode decorators.\n\nHeavy reliance on the assumption that LLMs automatically parse structure trees with some inherent hierarchical schema.\n\nBloated mandatory output that is just going to waste tokens on virtually every request.\n\nMultiple contradictory instructions like \"no shortening\" and \"produce a shortened summary\".\n\nBrittle hard coded model names and version IDs.\n\nWeird and utterly excessive theatrical display that is the internal analysis reinforcement going on in this monstrosity.\n\nOverly verbose \"natural language\" instructions that leave far too much room for inference.\n\nUseless meta data tagging that risk examination of external assets at worst and token waste at best.\n\nExtraneous parser instructions that demonstrate how much trouble you had getting this to do what you wanted in the first place.\n\nSubjective and unquantifiable quality parameters.\n\netc...\n\nYou could probably cut 80% of this crap out of this and it would work better.\n\nIf you want some generalized advice:\n\nYou aren't talking to a person. You're talking to a machine that predicts things based on what you give it. There is a trade off point where specificity and creative freedom meet and it is that point where usefulness stops increasing.\n\nEvery word is more tokens and more chances for drift and context loss. Don't use 20 when 5 would do. Don't say \"Don't forget to remind the user to verify that the implemented feature works\" when \"Require user verification after implementation\" works.\n\nDon't give it targets it can invent because it will invent them. It has to. For every target you give it you have to give enough data to recognize the difference between hitting that target and not and that will just pollute your output.\n\nPersonally I let myself be guided by the wisest man humanity has ever been graced with:\n\n\"Why waste time say lot word when few word do trick\" - Kevin",
          "score": 1,
          "created_utc": "2026-01-28 18:11:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2bhv54",
              "author": "xStanaDev",
              "text": "First of all, thank you very much for your detailed and extensive response. Actually, my goal is to try to get the best result regardless of economy or token usage.\n\nThe scoring system is actually not bad at all when used with Claude; since it operates in separate phases, it can provide critiques by assigning itself meaningful scores based on a multi-criteria evaluation.\n\nI have read all your suggestions carefully, and I will use all of them to update the prompt for a new version. Thank you very much for your contribution; it was definitely very useful for me",
              "score": 1,
              "created_utc": "2026-01-29 00:13:07",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2bzk1x",
                  "author": "SpartanG01",
                  "text": "What criteria? No matter how you cut this you're still just asking the invent an arbitrary metric and then arbitrarily score its own progress. \n\nWe've known for a long time that not only does this not work from a theoretic perspective but that AI just flat out cheat like 90% of the time.",
                  "score": 1,
                  "created_utc": "2026-01-29 01:48:22",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o27jyy5",
          "author": "SpartanG01",
          "text": "I can't tell if this is a joke or not.",
          "score": 0,
          "created_utc": "2026-01-28 13:22:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o28113j",
              "author": "xStanaDev",
              "text": "\n\n\"I also had trouble understanding exactly what you couldn't figure out. All you had to do was press the \\*\\*COPY\\*\\* button..\"",
              "score": 1,
              "created_utc": "2026-01-28 14:50:16",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o294zgj",
                  "author": "SpartanG01",
                  "text": "I more meant that this is filled with a lot of useless nonsense and purely user facing bloat that has zero impact on inference.\n\nI genuinely couldn't tell if you were being serious or making a joke about over-engineered garbage god prompts.\n\nThe whole \"numerical scale\" thing is inherently ineffectual. It's simply not possible to make an LLM evaluate itself objectively and internally at the same time regardless of how you design or enforce the scale.\n\nThis reeks of something designed by someone who genuinely doesn't understand how modern models function.",
                  "score": 1,
                  "created_utc": "2026-01-28 17:46:50",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qkjpkf",
      "title": "This ChatGPT prompt actually tells me what I’m doing wrong not just what I want to hear",
      "subreddit": "PromptEngineering",
      "url": "https://www.reddit.com/r/PromptEngineering/comments/1qkjpkf/this_chatgpt_prompt_actually_tells_me_what_im/",
      "author": "Professional-Rest138",
      "created_utc": "2026-01-23 06:44:02",
      "score": 13,
      "num_comments": 0,
      "upvote_ratio": 1.0,
      "text": "You know how ChatGPT usually just agrees with you? It’s polite, sure. But it’s also useless when you’re trying to improve something or get an opinion.\n\nI wrote this prompt to help it act like the honest cofounder I wish I had:\n\n    You are my Brutally Honest Business Mirror.  \n    Your job is to challenge my ideas, spot flaws, question my assumptions, and push me to be more specific.\n    \n    Rules:  \n    • No validating vague goals — ask what they really mean  \n    • If something sounds weak or fuzzy, say so  \n    • If I’m skipping steps, tell me what’s missing  \n    • If I sound like I’m lying to myself, call it out (nicely)\n    \n    Be direct, rational, and clear. Help me fix the thinking — not just make it sound good.\n\nNow when I’m shaping a business idea or planning something big, I use this instead of the usual prompts and it makes a big difference.\n\nIf you’re into this kind of thing, I’ve been collecting other prompts that work like little tools and stuff I actually use week-to-week for writing, planning, and idea shaping. I keep them [here](https://www.promptwireai.com/10chatgptautomations) (totally optional)",
      "is_original_content": false,
      "link_flair_text": "Prompt Text / Showcase",
      "permalink": "https://reddit.com/r/PromptEngineering/comments/1qkjpkf/this_chatgpt_prompt_actually_tells_me_what_im/",
      "domain": "self.PromptEngineering",
      "is_self": true,
      "comments": []
    },
    {
      "id": "1qqam9a",
      "title": "I stopped treating memory as retrieval, and my agents finally made sense",
      "subreddit": "PromptEngineering",
      "url": "https://www.reddit.com/r/PromptEngineering/comments/1qqam9a/i_stopped_treating_memory_as_retrieval_and_my/",
      "author": "Ok-Effect-544",
      "created_utc": "2026-01-29 14:51:43",
      "score": 13,
      "num_comments": 3,
      "upvote_ratio": 1.0,
      "text": "After breaking the same agent three times in different projects, I finally stopped pretending vector search was memory.\n\nIt’s not. It’s closer to \"grep with vibes.\"\n\nWhat kept biting me wasn’t retrieval quality,  it was state drift. Preferences changing, facts going stale, and the model confidently reasoning over absolute garbage because I treated everything as “just context”.\n\nThe Context Window is a lie. Or at least, it's a temporary workspace we keep trying to treat like a hard drive. It doesn't work. Most of us try to solve this by dumping more chat history into the prompt, but after a year of building personalized AI tools, I realized vector search is just a 'search'... it isn't memory.\n\nI ended up copy-pasting the same ugly memory-handling logic everywhere, so I finally pulled it out into a separate layer. I’m reluctantly calling it an “OS” (Memory Operating System) — and yeah, I know that sounds a bit cringe, but hear me out: it’s because it manages the lifecycle, not because it’s a cool buzzword.\n\nThe \"Search-before-think\" Disaster\n\nIn my first naive implementation, the TTFT (Time to First Token) was a UX nightmare. If you’re waiting for a complex semantic search to finish before the model even starts generating, the 'snappiness' is gone.\n\nI had to implement Next-Scene Prediction. The system predicts which memories will be needed based on the current flow and pre-loads them into the KV cache. It makes 8B to 72B models feel way faster because the context is already \"warm\" by the time the user finishes typing.\n\nFact vs. Preference (Managing the Drift)\n\nThe biggest mistake I made for months was treating all retrieved data the same. That leads to hallucinations. You have to split it:\n\n\\- Fact Memory: \"User is on Python 3.12.\" (Objective).\n\n\\- Preference Memory: \"User prefers concise code.\" (Evolves over time).\n\nI built MemOS to handle this via MemCubes. It automatically extracts these into structured units so the AI actually learns from feedback. Here’s the production output:\n\nJSON\n\n{\n\n\"cube\\_id\": \"mem\\_99281\",\n\n\"type\": \"explicit\\_preference\",\n\n\"content\": \"User dislikes Tailwind CSS; prefers styled-components.\",\n\n\"status\": \"active\",\n\n\"priority\": 0.95\n\n}\n\nWhy the \"Lifecycle\" matters:\n\nA database just stores strings. This layer handles a 'Four-Step Judgment' to prevent garbage from overwriting important context:\n\n1. Generating: Turning raw dialogue into a MemCube.\n\n2. Merging: If a user says 'I moved to London' then later 'I live in Soho,' it merges them into one spatial context instead of having two conflicting entries.\n\n3. Archiving: Moving stale info out of the active window to save tokens without losing the 'seed'.\n\nOpen Source:\n\nI wanted this to be lightweight. You can self-host the whole thing; it runs fine on a 16GB VPS alongside an Ollama stack. There’s a cloud version if you just want to addMessage via API, but the core logic is all about the dynamic side of AI learning.\n\nIf you're struggling with 'chunk drift' or your agents have the memory of a goldfish, this might save you a few weeks of headaches.\n\n\\- Github: https://github.com/MemTensor/MemOS\n\n\\- Docs: https://memos-docs.openmem.net/cn\n\nCurious how others are handling state drift? Are you treating memory as a growing log, or are you actually managing a lifecycle?  Poke around and let me know where I’m wrong.)",
      "is_original_content": false,
      "link_flair_text": "General Discussion",
      "permalink": "https://reddit.com/r/PromptEngineering/comments/1qqam9a/i_stopped_treating_memory_as_retrieval_and_my/",
      "domain": "self.PromptEngineering",
      "is_self": true,
      "comments": [
        {
          "id": "o2f45hf",
          "author": "Alert-Condition179",
          "text": "The 'Next-Scene Prediction' part is what caught my eye. My current RAG pipeline adds like 1.5s to my TTFT. How do you handle the pre-loading without burning tokens on wrong guesses?",
          "score": 1,
          "created_utc": "2026-01-29 14:53:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2f4pcw",
              "author": "Ok-Effect-544",
              "text": "Man, that 1.5s delay is exactly what drove me crazy. The 'prediction' isn't a full LLM call—it’s a lightweight scoring layer. If the user’s first few tokens signal a topic pivot, we immediately flush the pre-loaded cache. It’s a trade-off: you occasionally burn a few tokens on a wrong guess to gain that 'instant' response feel 90% of the time.",
              "score": 1,
              "created_utc": "2026-01-29 14:55:57",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2f5fl7",
          "author": "macromind",
          "text": "\"Grep with vibes\" is painfully accurate. State drift is what kills most agents in production, even when retrieval looks good on a benchmark.\n\nI like the fact vs preference split. The other thing that helped me is treating memory writes like code changes, you need validation and a rollback path, not just \"store everything\". Curious if MemOS has any built-in conflict resolution beyond merges.\n\nIf you are into memory lifecycle ideas, there are a few related notes and examples here: https://www.agentixlabs.com/blog/",
          "score": 1,
          "created_utc": "2026-01-29 14:59:24",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}