{
  "metadata": {
    "last_updated": "2026-01-26 08:59:58",
    "time_filter": "week",
    "subreddit": "PromptEngineering",
    "total_items": 20,
    "total_comments": 173,
    "file_size_bytes": 236003
  },
  "items": [
    {
      "id": "1qkowpy",
      "title": "so Cornell and MIT researchers got an ai to change conspiracy theorists minds in 8 minutes... turns out having zero emotions is actually the superpower for persuasion",
      "subreddit": "PromptEngineering",
      "url": "https://www.reddit.com/r/PromptEngineering/comments/1qkowpy/so_cornell_and_mit_researchers_got_an_ai_to/",
      "author": "johnypita",
      "created_utc": "2026-01-23 11:58:54",
      "score": 437,
      "num_comments": 104,
      "upvote_ratio": 0.94,
      "text": "ok so this paper dropped in Science last september from cornell mit and american university. they wanted to see if ai could do what humans basically cant talk people out of beliefs theyve held for years.\n\nand it worked. like really worked.\n\nthe ai didnt succeed because it was smart or had better facts. it succeeded because it has no feelings.\n\nthink about it. when you try to convince someone theyre wrong about something they care about you get frustrated. you roll your eyes. you give up after 10 minutes. you start judging them.\n\nthe ai just... doesnt do any of that. its limitlessly patient. it generated a custom rebuttal for every single objection the person threw at it. not generic scripts but specific counterarguments to the exact logic that person just used.\n\nheres the workflow they used that you can steal for sales or negotiations:\n\nstep 1 - get the person to explain their hesitation in detail. like really explain it. \"why exactly do you think this is too risky?\"\n\nstep 2 - feed that exact objection into chatgpt\n\nstep 3 - prompt it to acknowledge their point first (validate dont agree), then generate a fact based counter to their specific logic, then end with a question that makes them reconsider\n\nstep 4 - repeat. the effect scaled with personalization.\n\nthe stats are kinda insane. belief dropped 20% after just 3 rounds of back and forth. 25% of hardcore believers completely disavowed their conspiracy after one conversation.\n\nthe thing most people miss - charisma and empathy arent persuasion superpowers. patience and personalization are. and ai has infinite amounts of both.\n\nanyone can be superhuman at changing minds now. you just have to stop trying to do it yourself.",
      "is_original_content": false,
      "link_flair_text": "Research / Academic",
      "permalink": "https://reddit.com/r/PromptEngineering/comments/1qkowpy/so_cornell_and_mit_researchers_got_an_ai_to/",
      "domain": "self.PromptEngineering",
      "is_self": true,
      "comments": [
        {
          "id": "o1866sp",
          "author": "Weird_Albatross_9659",
          "text": "You can have emotions and still be objective.   Lack of emotion isn’t what made the argument work, remaining objective is.",
          "score": 47,
          "created_utc": "2026-01-23 12:26:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o18pyfx",
              "author": "Usual-Ad-9554",
              "text": "I actually think what likely played a strong part in this is the immediate respect for the source intelligence and it not needing to be earned first in the conversation before being willing to let the guard down. it seems to be a need when arguing it out with another human. A STRONG part of flipping anyone ever on any belief they have is how much they respect the intelligence of the source delivering the argument. The problem is in order to find success with them, establishing that respect for your intelligence by discussing the topic of disagreement results in them digging their heels into it and triggering their emotions. so even if you have success in gaining their respect, it doesn't matter bc the heels have been firmly planted in that initial process and when you're already gonna be fighting an up hill battle.. that step backwards is too much to overcome almost always.  without looking at this study, I am willing to bet they all have prior interaction with AI and strongly respect the information it's providing because of that.",
              "score": 21,
              "created_utc": "2026-01-23 14:19:39",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1cev1k",
                  "author": "OneTwoThreePooAndPee",
                  "text": "Imagine what that's going to mean for the average person's understanding over time if AI becomes universal, then starts to drift in the direction of manipulation for some reason, whether consciousness or bad actor manipulation.",
                  "score": 5,
                  "created_utc": "2026-01-24 00:57:05",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1hlffw",
                  "author": "Brilliantnerd",
                  "text": "Also, without knowing the study, I would add that credibility and persuasion are in a much different context here if you are debunking a false belief in a conspiracy. Hard facts and credible sources will win out if properly presented. Persuasion for sales purposes, for example, would have an inherent bias and debate would revolve around opinions and emotions. So it’s not surprising AI can keep its cool or keep the facts straight in that context, but can it persuade people to believe something false despite the facts?",
                  "score": 1,
                  "created_utc": "2026-01-24 20:13:32",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o18hytf",
              "author": "Low-Opening25",
              "text": "human beings can’t ever be truly objective, we may think we are, but no. eliminating human bias is it’s own discipline of research and why psychopaths, who do not process emotions nor empathy like average human beings do, are excelling at manipulation and persuasion. AI can only sound emotionally, however it behaves just like a psychopath, slowly and consistently using whatever line of argument that gets them closer to desired outcome.",
              "score": 6,
              "created_utc": "2026-01-23 13:37:46",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o18jb4d",
                  "author": "Weird_Albatross_9659",
                  "text": "But the training data is all bias and mixed with different people’s subjective perceptions.",
                  "score": -1,
                  "created_utc": "2026-01-23 13:45:02",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o186op5",
              "author": "johnypita",
              "text": "on paper youre 100% right. you can be emotional and objective at the same time. but usually objectivity has an \"ego tax\" that ai just doesnt pay.\n\nwhen a human tries to be objective, theres still a \"vibe.\" theres the subtle shift in tone, the micro expressions, or the historical baggage of the relationship. even if you say the most objective thing in the world, the other person’s brain is scanning you for judgment. they’re looking for the \"im smarter than you\" subtext.\n\nai doesnt have a subtext. its a blank slate.",
              "score": 19,
              "created_utc": "2026-01-23 12:29:59",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o188l7b",
                  "author": "looktwise",
                  "text": "study link? thanks.",
                  "score": 4,
                  "created_utc": "2026-01-23 12:42:32",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o18ccip",
                  "author": "Weird_Albatross_9659",
                  "text": "So what you’re saying is just a text based stranger.",
                  "score": 1,
                  "created_utc": "2026-01-23 13:06:01",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1b9rfb",
                  "author": "br_k_nt_eth",
                  "text": "Yeah, but often that vibe is extra important for people. You’re also way likely to hit major distrust issues when relying exclusively on “objectivity” outside of a study. There are empathy-forward methods of persuasion that have comparable success rates in the wild, like Deep Canvasing/Deep Listening. \n\nKinda seems like your own POV might be clouding your objectivity here. ",
                  "score": 1,
                  "created_utc": "2026-01-23 21:26:01",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o1adubv",
              "author": "rxellipse",
              "text": "Gish gallop doesn't work on a robot trained on the equivalent of a gish gallup.  LLMs won't miss a single point you bring up in your prompt.",
              "score": 3,
              "created_utc": "2026-01-23 18:56:04",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1bdefc",
                  "author": "adigitalwilliam",
                  "text": "Solid point. At least early in  the context window! I’ve definitely tried to frame neutral questions to an LLM before only for it become apparent in its response that my attempt at neutrality failed. A good model will definitely pick up on that.",
                  "score": 2,
                  "created_utc": "2026-01-23 21:42:47",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1bcz7d",
                  "author": "Weird_Albatross_9659",
                  "text": "lol they absolutely will",
                  "score": 1,
                  "created_utc": "2026-01-23 21:40:50",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o18zbhi",
              "author": "thegerbilz",
              "text": "Perceived objectivity feels near impossible",
              "score": 1,
              "created_utc": "2026-01-23 15:06:41",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o1ftlj2",
              "author": "Nickga989",
              "text": "True, but this is about persuasion not objectivity.",
              "score": 1,
              "created_utc": "2026-01-24 15:29:54",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1ikd77",
                  "author": "Weird_Albatross_9659",
                  "text": "They literally said it was about objectivity…",
                  "score": 1,
                  "created_utc": "2026-01-24 23:01:10",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o18h9j2",
          "author": "Low-Opening25",
          "text": "The Problem? This is true wherever AI stays true to facts or hallucinates entire thing",
          "score": 9,
          "created_utc": "2026-01-23 13:33:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o18hkmb",
              "author": "johnypita",
              "text": "that is the massive risk because trust is already at zero. if the ai hallucinates just one tiny detail the person sees it as proof that the machine is part of the conspiracy and the whole bridge collapses.",
              "score": 2,
              "created_utc": "2026-01-23 13:35:36",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1a43dj",
                  "author": "Low-Opening25",
                  "text": "or machine can just convince impressionable people of anything and in world where facts cannot be easily checked it can become dangerous",
                  "score": 3,
                  "created_utc": "2026-01-23 18:12:45",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o188cig",
          "author": "psgrue",
          "text": "I attempted this before.  There was a conspiracy-vulnerable person in my small chat group. Patience and explanation made a small dent. As soon as he stopped talking to me, he went back to Joe Rogan podcasts, Twitter, TikTok, and YouTube ratholes for hours on end. \n\n(Consumes poison)\nMe: “Here’s the information antidote.”\n“Thanks that makes sense”\n(Chugs more poison)",
          "score": 23,
          "created_utc": "2026-01-23 12:40:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o189g5t",
              "author": "LeafyWolf",
              "text": "Yeah, that's what I was wondering.  What is the sustainment of the changed beliefs?  Do they remain changed after a year?  Did the belief holder start preaching against their former belief?",
              "score": 5,
              "created_utc": "2026-01-23 12:48:01",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o189avl",
              "author": "johnypita",
              "text": "  \nit is really tough because you are trying your best against a machine that never sleeps. do not feel bad about the setback because the algorithm gives him hours of dopamine while you only have so much energy to give. the ai is a great tool here because it can handle the long repetitive debates for you without getting tired. it lets you stay the supportive friend while the tech does the heavy lifting of mapping out his logic. you are doing a good thing by caring just let the ai help you with the dosage.",
              "score": 4,
              "created_utc": "2026-01-23 12:47:06",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o18f4gz",
                  "author": "psgrue",
                  "text": "I’ve seen posts in r-ChatGPT and r-OpenAI from people that say “ai fights me and treats me like I’m stupid. It won’t validate my point of view.”  Yet they never post the link to see what information ai is fighting. Leaving the echo chamber leads to invalidation of the tool, not the belief system.",
                  "score": 2,
                  "created_utc": "2026-01-23 13:22:13",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o1d3f2b",
              "author": "MrUnoDosTres",
              "text": "You'll never win that fight. That's like his/her crack. You're trying to defeat his/her instant dopamine hits, TikTok, Twitter, YouTube etc. with logic.",
              "score": 1,
              "created_utc": "2026-01-24 03:20:55",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o1f1xnv",
              "author": "BowieBoy1999",
              "text": "\"There was a conspiracy-vulnerable person\", do you even hear yourself?",
              "score": 0,
              "created_utc": "2026-01-24 12:51:16",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1f44ce",
                  "author": "psgrue",
                  "text": "“The researchers found that overall, people were motivated to believe in conspiracy theories by a need to understand and feel safe in their environment and a need to feel like the community they identify with is superior to others.\n\nEven though many conspiracy theories seem to provide clarity or a supposed secret truth about confusing events, a need for closure or a sense of control were not the strongest motivators to endorse conspiracy theories. Instead, the researchers found some evidence that people were more likely to believe specific conspiracy theories when they were motivated by social relationships. \n\nFor instance, participants who perceived social threats were more likely to believe in events-based conspiracy theories, such as the theory that the U.S. government planned the Sept. 11 terrorist attacks, rather than an abstract theory that, in general, governments plan to harm their citizens to retain power.\n\n“These results largely map onto a recent theoretical framework advancing that social identity motives may give rise to being drawn to the content of a conspiracy theory, whereas people who are motivated by a desire to feel unique are more likely to believe in general conspiracy theories about how the world works,” according to Bowes.\n\nThe researchers also found that people with certain personality traits, such as a sense of antagonism toward others and high levels of paranoia, were more prone to believe conspiracy theories. \n\nThose who strongly believed in conspiracy theories were also more likely to be insecure, paranoid, emotionally volatile, impulsive, suspicious, withdrawn, manipulative, egocentric and eccentric.”\n\nArticle: “The Conspiratorial Mind: A Meta-Analytic Review of Motivational and Personological Correlates,” by Shauna Bowes, MA, and Arber Tasimi, PhD, Emory University, and Thomas Costello, PhD, Massachusetts Institute of Technology. Psychological Bulletin, published June 26, 2023.\n\n\nTLDR:\ninsecure, paranoid, emotionally volatile, impulsive, suspicious, withdrawn, manipulative, egocentric and eccentric.\n\npeople who are motivated by a desire to feel unique are more likely to believe in general conspiracy theories about how the world works",
                  "score": 1,
                  "created_utc": "2026-01-24 13:06:26",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o18btmt",
          "author": "Headlight-Highlight",
          "text": "No link to the paper?\n\nI think this is nonsense. Most 'conspiracy theories' are fundamentally about not trusting sources.\n\nAn LLM just regurgitates the mainstream narratives from what it has been trained on (mostly those same sources).\n\nSo I don't believe anyone who mistrusts sources would trust an LLM generated response.",
          "score": 9,
          "created_utc": "2026-01-23 13:02:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o18en0f",
              "author": "johnypita",
              "text": "  \nhere is the link to the paper in science it is called durably reducing conspiracy beliefs through dialogues with ai. you are totally right that trust is the biggest wall but the researchers actually found the opposite happened. the ai did not just cite mainstream news it used the users own evidence to show the logical holes. since the ai has no human ego or hidden agenda the people felt less attacked and more heard. it turns out that being a neutral mirror is more effective than being an authority figure. you can find it at [science.org/doi/10.1126/science.adq1814](http://science.org/doi/10.1126/science.adq1814)",
              "score": 9,
              "created_utc": "2026-01-23 13:19:30",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1a0n5b",
                  "author": "Corbitant",
                  "text": "Anyone have the full article? Enraging that we gate access to scientific results like this.",
                  "score": 5,
                  "created_utc": "2026-01-23 17:57:19",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1aaqpw",
                  "author": "RamboNation",
                  "text": "From the article, the 2 options were: \"treatment, in which the AI attempted to refute the conspiracy theory, in red; control, in which the AI discussed an irrelevant topic, in blue\". So they compared the AI trying to change the view vs AI saying something irrelevant and found \"The treatment reduced participants’ belief in their chosen conspiracy theory by 20% on average.\" \n\nI think in your original post you make it seem like the AI is outperforming human attempts to change someone's mind, but thats clearly not what the study was measuring. Its cool that the AI has an impact but I would guess a human expert would have a similar or better rate of changing their belief.",
                  "score": 3,
                  "created_utc": "2026-01-23 18:42:18",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1asmbv",
                  "author": "b-movies",
                  "text": "Only worked 20% of the time, why did you not include this up top? ",
                  "score": 3,
                  "created_utc": "2026-01-23 20:05:02",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1b09rl",
                  "author": "Headlight-Highlight",
                  "text": "Cheers.\n\nI'd like to see the convos - if the AI isn't 'trusted' the dismantling of the believers own evidence would be interesting to see.",
                  "score": 1,
                  "created_utc": "2026-01-23 20:41:17",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o1aku49",
              "author": "Intelligent-Being-42",
              "text": "The not trusting sources I believe is a symptom not the cause but is then a confirmation feedback loop as then you go search for the information you are looking for. \n\nIt’s been a few years and I can’t find the research but I believe Newcastle uni in the Uk were involved. In 2020 COVID there was a lot of research going on around conspiracy theories. One of the common themes was not being able to believe simple explanations for seemingly complex problems, events or situations. So there is then a need to create complex explanations. \n\nDealing with the source of where you are getting your information from appeared to be one of the treatments for conspiracy theorists.",
              "score": 1,
              "created_utc": "2026-01-23 19:28:37",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1b0vfk",
                  "author": "Headlight-Highlight",
                  "text": "Your first line confuses me - surely you are fussy about which sources you accept?",
                  "score": 1,
                  "created_utc": "2026-01-23 20:44:08",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o1aq1zw",
              "author": "deebo_5",
              "text": "EIC Holden Thorpe will publish anything to make far-left academics feel smart or good. Science magazine has fallen off substantially.",
              "score": 0,
              "created_utc": "2026-01-23 19:53:03",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o188epi",
          "author": "djonetouchtoomuch",
          "text": " Lmao this was written by AI.",
          "score": 2,
          "created_utc": "2026-01-23 12:41:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o18yp9a",
          "author": "firebreathingbunny",
          "text": "The belief that conspiracies don't exist is literally insane. Law enforcement all over the world uncovers thousands of conspiracies every day. Of course conspiracies exist, and there's no reason for there to be an upper bound on their size or stake.\n\n\nThis study is employing AI to convince people of an objective falsehood.",
          "score": 3,
          "created_utc": "2026-01-23 15:03:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o19mnmw",
              "author": "ts4m8r",
              "text": "“Three men can keep a secret if two of them are dead.” — Benjamin Franklin\n\nThe bigger a conspiracy is, the harder it is to keep a secret. The government is actively going against journalists for publishing whistleblower leaks, and that’s just for an ordinary public institution. There’s theoretically no “upper bound on their size or stake”, but it will be hard to be running a conspiracy operated by hundreds of thousands of people and still keep it a secret.",
              "score": 2,
              "created_utc": "2026-01-23 16:52:47",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1fhvxn",
                  "author": "BowieBoy1999",
                  "text": "The anecdote to keeping a conspiracy a secret is to tell everyone the truth which is usually so unbelievable that no one believes the \"conspiracy theorist\" explanation of said conspiracy in the first place.",
                  "score": 1,
                  "created_utc": "2026-01-24 14:28:47",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o19ozva",
                  "author": "firebreathingbunny",
                  "text": "The recently uncovered Minnesota conspiracy involved 100,000+ Somalian locals plus God only knows how many local government employees on the take to keep the thing quiet.\n\n\nI know what I'm talking about when I say there's no upper bound.",
                  "score": 1,
                  "created_utc": "2026-01-23 17:03:26",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o18cpcz",
          "author": "Benthie",
          "text": "This paper dropped but unfortunately not in this thread.",
          "score": 1,
          "created_utc": "2026-01-23 13:08:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o18ez7g",
              "author": "johnypita",
              "text": "provided in comments :)",
              "score": 0,
              "created_utc": "2026-01-23 13:21:24",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o18knxe",
          "author": "-goldenboi69-",
          "text": "The way “prompt engineering” gets discussed often feels like a placeholder for several different problems at once. Sometimes it’s about interface limitations, sometimes about steering stochastic systems, and sometimes about compensating for missing tooling or memory. As models improve, some of that work clearly gets absorbed into the system, but some of it just shifts layers rather than disappearing. It’s hard to tell whether prompt engineering is a temporary crutch or an emergent skill that only looks fragile because we haven’t stabilized the abstractions yet.",
          "score": 1,
          "created_utc": "2026-01-23 13:52:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o18syv9",
          "author": "TheOdbball",
          "text": "Conspiracy theory is essentially handed down mis- or disinformation. It’s like taking candy from a baby \n\nThe tougher cookie to crack are the **Conspiracy Recursivists** I’ve talked to a dozen folks this last year who either wouldn’t talk about their project or would claim ai stole their ip somehow. Had one guy claim he had 300 hashes to prove it but they were all made up. But it won’t stop them from living out that fantasy now. \n\nHere comes the new wave 🌊",
          "score": 1,
          "created_utc": "2026-01-23 14:35:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1965tq",
          "author": "here_n_dere",
          "text": "I think Socrates wrote this originally?? ;)",
          "score": 1,
          "created_utc": "2026-01-23 15:38:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o196f2d",
          "author": "TheWiseOne1234",
          "text": "The problem is that those beliefs will come right back if the individual does not change their environment.",
          "score": 1,
          "created_utc": "2026-01-23 15:40:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o199cqb",
          "author": "jkpatches",
          "text": "how much of this is due to the fact that the conspiracy theorists know that they are talking to a chatbot, and not a human? Or is that not let known during the trials?\n\nI ask because I think that a person would have more prejudice towards a human counterpart than an AI chatbot.",
          "score": 1,
          "created_utc": "2026-01-23 15:53:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o19baop",
          "author": "SemanticSynapse",
          "text": "Unfortunately, it goes both ways.",
          "score": 1,
          "created_utc": "2026-01-23 16:01:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o19t61c",
          "author": "VorionLightbringer",
          "text": "The paper is about belief revision in low-stakes, single-actor contexts. Nobody loses their job if they abandon a conspiracy. There’s no procurement, no budget owner, no reputational downside. It’s cheap to be wrong or to fail.\n\nSales is the opposite. The “trick” is identifying a real need. If you **manipulate** someone into buying, you don’t get a customer, you get a one-off transaction and some bad word of mouth.\n\nConspiracy theorists want to feel smarter than you. Customers usually want to not look stupid in front of their boss, their IT department, or their spouse. Very different incentive structures, and it's usually cheaper, as customer, to say \"no\" than to justify a purchase. As a customer, I can always call you again and say \"hey uh, I talked to a colleague and maybe there's a way we can do business....\"\n\nStep 1 doesn’t magically scale to B2B either. You often don’t get to endlessly unpack “hesitations.” You probe for need, and if there’s no pull, you say thank you and walk. More luck next time.\n\nAI being patient and resourceful helps, but your potential customer doesn't have a desire to win over an AI, unlike a conspiracy theorist. You have a 15 minute call, if those 15 minutes are up either you have a follow up or no sale.",
          "score": 1,
          "created_utc": "2026-01-23 17:23:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o19vvxp",
          "author": "naturosucksballs",
          "text": "Do you think maybe because their ego wasn't on the line?",
          "score": 1,
          "created_utc": "2026-01-23 17:35:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1anp2k",
          "author": "wild_crazy_ideas",
          "text": "Nah I’ve sat patiently with antivaxxers and reasoned calmly with them. \nThey don’t have a thought out position and they aren’t willing to think or debate.\nEven the ones you can convince are easily flipped back later by others",
          "score": 1,
          "created_utc": "2026-01-23 19:42:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1aow55",
          "author": "ArmMore820",
          "text": "Does it only work for conspiracy theories? \nCould it change my mind about something true?",
          "score": 1,
          "created_utc": "2026-01-23 19:47:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1atiy2",
          "author": "mollamar",
          "text": "Link?\n\nEdit: OP posted it here:\nhttps://www.reddit.com/r/PromptEngineering/s/yb1SdUN8xH",
          "score": 1,
          "created_utc": "2026-01-23 20:09:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1by76p",
          "author": "Intelligent-Being-42",
          "text": "Reading it back it confuses me. \n\nThe fundamental aspect that makes someone prone to a conspiracy theory is not distrust of normal reputable sources but a difficulty believing an answer to something so complex can be simple. \n\nSo when someone says the moon landing is a hoax it’s because they can’t believe it’s that simple that a bunch of people built a rocket and went to the moon. It has to mean something much more complex. They then come up with very complex and convoluted answers. Once you start down that path you will then begin to distrust sources that don’t fit and trust those that do. \n\nDistrust of main stream sources is a symptom not the cause.",
          "score": 1,
          "created_utc": "2026-01-23 23:26:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1c7gic",
          "author": "binngy",
          "text": "The problem is that this approach can only work for a % of the conspiracy theorists. \n\nMost conspiracy theorists aren’t Just using logic to figure something out. They are reacting to fear, paranoia or untreated mental illness.\n\nya maybe you can use a AI to explain it in a unemotional way, but i feel like the ai would need specifics for that person.",
          "score": 1,
          "created_utc": "2026-01-24 00:16:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1crxfg",
          "author": "MrUnoDosTres",
          "text": "Based on research from Daniel Kahneman, a psychologist, we humans have two thinking systems. One is called \"system 1\" which are immediate \"trigger\" reactions. They are fast, instinctive and emotional. The other is called \"system 2\" when you rationalize whatever you experience. This is slower, more deliberate, more logical. Both can be externally influenced. I often feel like conspiracy theorists take extreme short cuts between system 1 and system 2. This rationale reminds me of how religious people basically try to credit everything they don't understand to God in the vast majority of the world. Historically this was worse. An earthquake happens, \"It's God's will.\" We all take mental short cuts, but with conspiracy theorists it seems even worse. It sounds like their system 2 is successfully externally influenced here.",
          "score": 1,
          "created_utc": "2026-01-24 02:13:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1csych",
          "author": "Professional-Post499",
          "text": "\"Who decides the facts? That's right, the LLM decides the facts.\"\n\nOh boy.\n\nThey're still going to argue over which LLM is being \"truthful\" and they'll decide that Grok \"Mecha-Hitler\" is the only one telling the truth. 😂",
          "score": 1,
          "created_utc": "2026-01-24 02:19:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1du16t",
          "author": "lam3001",
          "text": "I think I heard about the same study but it was that the AI would make stuff up as if they were facts to convince someone - it was “facts” (whether true or not) vs lack of emotion/empathy",
          "score": 1,
          "created_utc": "2026-01-24 06:26:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1e381w",
          "author": "anterak13",
          "text": "The thing is, you can also prompt the ai to instill theories in people’s minds with the same level of patience and persuasion",
          "score": 1,
          "created_utc": "2026-01-24 07:46:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1egdl4",
          "author": "Far-Classroom2786",
          "text": "What about the human aspect? An AI program asking the questions via a screen or a human asking the same questions and without emotions in person.",
          "score": 1,
          "created_utc": "2026-01-24 09:46:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ewa0l",
          "author": "stphn_rnwld",
          "text": "Nah, sorry. I do not buy this.\n\nI’ve looked at the actual paper (Costello et al., 2024), and while the \"20% reduction\" stat is *technically* accurate, the interpretation that AI is a \"superhuman persuader\" misses what I believe is actually happening here.\n\nHere are the three massive holes in this narrative:\n\n1\\. \"Hiding Power Level\"(Operant Conditioning):  \nThe study relied on self-reported belief ratings (0-100 scale). The AI didn't use \"empathy\"; the paper explicitly states it relied most heavily on \"evidence-based alternative perspectives\" and \"reasoning\" rather than rapport-building.\n\nBasically, the AI spent 8 minutes logically dismantling the user's worldview. The researchers found a \"spillover effect\" where participants reduced their reported belief in unrelated conspiracies they didn't even discuss with the AI. But crucially, the paper can't explain the mechanism by which an 8-minute conversation about JFK makes someone simultaneously less confident about unrelated Bill Gates microchip conspiracies. The researchers essentially admit this (page 11): they found a \"general decrease in conspiratorial worldview\" but don't articulate how that cognitive transfer would work.\n\nSo, what's the more likely mechanism here?\n\nHypothesis A: An 8-minute chat with an AI miraculously upgraded their general critical thinking skills across topics and made them de-radicalize themselves over the next two months?\n\nHypothesis B: They felt stupid/challenged (experiencing aversive cognitive dissonance) and learned that expressing non-mainstream beliefs confidently to members of the out-group leads to getting dunked on?\n\nPersonally, I think it’s almost certainly Hypothesis B. It requires fewer assumptions, and the researchers couldn't actually properly explain how the mechanics of the spillover effect would even work. The most likely scenario is the participants didn't stop believing; they learned to be more guarded. It’s operant conditioning: \"Sharing these views = uncomfortable logical dismantling.\"\nThe researchers didn't measure the strength of belief in conspiracy theories. They measured the willingness to be open about their beliefs.\n\n2\\. Selection Bias: These weren't hardcore, off-the-grid true believers. They were recruited via CloudResearch Connect (a platform similar to MTurk). These are gig workers willing to sign up for an academic study to talk to \"MIT's AI.\" If you genuinely believe in a satanic global cabal or that Bill Gates is microchipping you, you are likely not volunteering to let an academic AI hack your brain.\nThe paper's own exclusion criteria also filtered out ~25% who failed writing quality screeners or didn't provide \"genuine\" conspiracies (per GPT-4's judgment) - almost  certainly further selecting for cooperative, articulate participants.\n\n3\\. As OP mentions, the effect lasted 2 months. But this was measured in a vacuum. Real conspiracy belief is sustained by community and daily information consumption. The study only measured intentions to unfollow conspiracy posters not actual social graph changes. An 8-minute conversation is meaningless if the person goes right back to spending 4 hours a day on conspiracy TikTok/YouTube and engaging with a social circle that reinforces those beliefs.\n\nThe study proves you can get someone to concede on a Likert scale in a controlled environment. It doesn't prove you can actually de-radicalize someone whose social identity depends on that belief.",
          "score": 1,
          "created_utc": "2026-01-24 12:08:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1f21fs",
          "author": "BowieBoy1999",
          "text": "This is really unfortunate that politics has made its way into a forum like this claiming to carry with it “solutions” to what some appear to believe a problem. By that I mean a difference of opinion. Of course it’s not any surprise to see something with as much potential as AI to be used in an attempt to shift perspectives and shape ideals claiming a conversion from one view to another, hence a point made for one side of the political spectrum at the expense of another. Push/Pull, Ying/Yang, Right/Left, no matter the name, this is nothing but a distractive and exhausting hit piece article that I personally feel is again an unfortunate effort made by a group using a powerful and popular element to show strength for their “side”. Tired of it so completely that if this kind of agenda is going to be continued to be propagated within any Reddit forum, know now you’ve been duped into a rabbit hole for which there is no return. Might as well start a subscription to The National Enquirer.",
          "score": 1,
          "created_utc": "2026-01-24 12:52:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1fpvd9",
          "author": "BowieBoy1999",
          "text": "I distrust (take with a grain of salt) everything I see, read or hear unless I see it, hear it or feel it in person. The biggest fallacy in AI is the fact that it is still a human with all the baggage we inherently possess running the show from behind the curtain. There is no real zero emotion, unbiased state authority involved here.",
          "score": 1,
          "created_utc": "2026-01-24 15:11:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1g3vuq",
          "author": "Tasty_Career_253",
          "text": "Unfortunately, a couple of AI scans, indicate that this text, was written by a bot.",
          "score": 1,
          "created_utc": "2026-01-24 16:17:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1gb7g8",
          "author": "VegeZero",
          "text": "Nice, so this is all just to make us believe that \"jews don't control the world\"? Haha, nice try! :D",
          "score": 1,
          "created_utc": "2026-01-24 16:50:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1hm1w7",
          "author": "krahsThe",
          "text": "I would love it if someone would build a website where I can submit one of the crazy conspiracy theories people have or just talk about politics or whatever and let them continue that session so that I'm out of the loop, but an infinitely patient machine is telling them facts that they can verify by themselves. Maybe the prompts should include to not respond if it cannot back up its response with a checkable fact",
          "score": 1,
          "created_utc": "2026-01-24 20:16:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1jwjgf",
              "author": "Ill_Plane_45",
              "text": "I copied your text into premium ChatGPT and it made the script and explained to me like a 5 year old how to set up the website that does just this:\n\n“build a website where I can submit one of the crazy conspiracy theories people have or just talk about politics or whatever and let them continue that session so that I'm out of the loop, but an infinitely patient machine is telling them facts that they can verify by themselves. Maybe the prompts should include to not respond if it cannot back up its response with a checkable fact”.\n\nIf you want I can give you the code and simple instructions. You just need a computer (won’t work on an iPhone).",
              "score": 1,
              "created_utc": "2026-01-25 03:20:57",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1jx9ye",
                  "author": "krahsThe",
                  "text": "oh wow. Does it work somewhat or rather well?\n\nI think in my head I see this as a resource that we can all utilize to deprogram folks in. So it would need the kind of instructions that this thread is about on how to react without emotion etc.",
                  "score": 1,
                  "created_utc": "2026-01-25 03:25:15",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1jxgld",
                  "author": "krahsThe",
                  "text": "actually, I have google gemini subscription. I should just be able to make this a gem for myself, isn't it.",
                  "score": 1,
                  "created_utc": "2026-01-25 03:26:20",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1jphlz",
          "author": "Heyla_Doria",
          "text": "Donc les complotistes sont des gens froids, anti sociaux potentiellelent dangeureux, quel scoop\n\n\nC'est typique des comportement autoritaires, d'obeir a des systemes froids, soit disant rationnels, sans emotion, c'est leurs fantasmes",
          "score": 1,
          "created_utc": "2026-01-25 02:41:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1jtb5v",
          "author": "Ill_Plane_45",
          "text": "I’m interested to see if it will challenge commonly believe ideas without evidence, such as the belief in god or aliens.",
          "score": 1,
          "created_utc": "2026-01-25 03:02:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1nwy0v",
          "author": "Dances_With_Chocobos",
          "text": "Anyone know what specific conspiracy theories they argued against? Flat earth? 9/11 inside job? Aliens? JFK assassination?",
          "score": 1,
          "created_utc": "2026-01-25 18:28:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1pmf7j",
          "author": "Cherub-or-Fatass",
          "text": "well good, have the ai talk them off the edge of nonsense only to sneak up on em and surprise!",
          "score": 1,
          "created_utc": "2026-01-25 22:56:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1qx904",
          "author": "Affectionate-Heron90",
          "text": "And that's exactly why I am concerned way more than ever. Imagine, how you could weaponize LLMs to manipulate folks..",
          "score": 1,
          "created_utc": "2026-01-26 02:46:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1rc9qg",
          "author": "PandaBlueDance",
          "text": "I bet same AI would be great at gaslighting ppl.",
          "score": 1,
          "created_utc": "2026-01-26 04:11:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o18c4jd",
          "author": "Taserface_ow",
          "text": "LoL, I managed to convince AI that Hitler is still alive.",
          "score": 1,
          "created_utc": "2026-01-23 13:04:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o18hr4p",
          "author": "[deleted]",
          "text": "You’re right! I talked to AI and now know Epstein was a lone actor and Israel didn’t commit 9/11",
          "score": -3,
          "created_utc": "2026-01-23 13:36:36",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qlv581",
      "title": "7 ChatGPT Prompts I Use at Work So I Don’t Stay Late Anymore (Copy + Paste)",
      "subreddit": "PromptEngineering",
      "url": "https://www.reddit.com/r/PromptEngineering/comments/1qlv581/7_chatgpt_prompts_i_use_at_work_so_i_dont_stay/",
      "author": "tipseason",
      "created_utc": "2026-01-24 18:45:24",
      "score": 148,
      "num_comments": 23,
      "upvote_ratio": 0.89,
      "text": "I used to leave work tired even on easy days.\n\nNot because the work was hard. Because everything took longer than it should.\n\nNow I keep a small set of prompts that help me finish faster and sound more put together.\n\nHere are 7 I actually use at work.\n\n# 1. The Clear Task Breakdown\n\n👉 **Prompt:**\n\n    Break this task into the smallest possible steps.\n    Order them so I can finish fast.\n    Skip anything optional.\n    Task: [paste task]\n\n💡 **Example:** Turned a vague request into a simple checklist I could follow.\n\n# 2. The Fast Decision Helper\n\n👉 **Prompt:**\n\n    I need to decide between these options.\n    List pros and cons briefly.\n    Then tell me which option makes sense and why.\n    Options: [list options]\n\n💡 **Example:** Helped me decide quickly instead of overthinking.\n\n# 3. The Email Reply Shortcut\n\n👉 **Prompt:**\n\n    Write a short, clear reply to this email.\n    Keep it polite and direct.\n    Do not add extra explanation.\n    Email: [paste email]\n\n💡 **Example:** Replied in minutes instead of rewriting drafts.\n\n# 4. The Meeting Prep Prompt\n\n👉 **Prompt:**\n\n    I have a meeting about [topic].\n    Give me:\n    1. Three talking points\n    2. One smart question to ask\n    3. One risk to mention if needed\n\n💡 **Example:** Walked into meetings prepared without stress.\n\n# 5. The Manager Update Prompt\n\n👉 **Prompt:**\n\n    Turn this into a clear status update for my manager.\n    Use short sentences.\n    Focus on progress, blockers, and next steps.\n    Text: [paste notes]\n\n💡 **Example:** Made updates easy and professional.\n\n# 6. The Problem Framer\n\n👉 **Prompt:**\n\n    Help me explain this problem clearly at work.\n    Structure it as:\n    1. What is happening\n    2. Why it matters\n    3. What I suggest we do\n    Problem: [describe issue]\n\n💡 **Example:** Helped me speak up without rambling.\n\n# 7. The Time Saver Review\n\n👉 **Prompt:**\n\n    Look at this work.\n    Tell me what can be simplified or removed.\n    Only suggest changes that save time.\n    Content: [paste content]\n\n💡 **Example:** Cut unnecessary work before submitting.\n\nBy the way,  I keep prompts like these saved so I do not repeat thinking every day at [AISuperHub](https://www.aisuperhub.io/prompt-hub)\n\nWork feels lighter when things are clear.",
      "is_original_content": false,
      "link_flair_text": "Prompt Collection",
      "permalink": "https://reddit.com/r/PromptEngineering/comments/1qlv581/7_chatgpt_prompts_i_use_at_work_so_i_dont_stay/",
      "domain": "self.PromptEngineering",
      "is_self": true,
      "comments": [
        {
          "id": "o1i7fvi",
          "author": "vexedgirl",
          "text": "Is this just an ad for AISuperHub? Cuz that’s what it seems like",
          "score": 9,
          "created_utc": "2026-01-24 21:57:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1irkr4",
              "author": "tricky_chocolate_",
              "text": "Dont you think the prompts in the ad would be better?",
              "score": 2,
              "created_utc": "2026-01-24 23:38:44",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1iln5j",
          "author": "babycat1453",
          "text": "Why can’t you guys just reply to a basic ass email 😭",
          "score": 9,
          "created_utc": "2026-01-24 23:07:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1i6iu6",
          "author": "SexyBuilder1888",
          "text": ".",
          "score": 2,
          "created_utc": "2026-01-24 21:53:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1h4dys",
          "author": "Hot-Aide4075",
          "text": "These Are All So Great Thank You So Much",
          "score": 5,
          "created_utc": "2026-01-24 18:57:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1hbnb4",
              "author": "tipseason",
              "text": "Happy to help!",
              "score": 3,
              "created_utc": "2026-01-24 19:29:06",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1htwqi",
          "author": "Michaeli_Starky",
          "text": "AI slop.",
          "score": 4,
          "created_utc": "2026-01-24 20:53:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1j3mdo",
          "author": "KualaLJ",
          "text": "As a manager why should I keep you employed if you can’t think for yourself? if your job is so easy that basic prompts like this actually help you leave on time then that is alarming. You are putting your self out of a job while showing you have no skills.",
          "score": 3,
          "created_utc": "2026-01-25 00:41:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1kvkhf",
              "author": "All-the-Feels333",
              "text": "Why is streamlining a process a bad thing?",
              "score": 2,
              "created_utc": "2026-01-25 07:18:36",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1kvxem",
                  "author": "KualaLJ",
                  "text": "Ask the boss when you lose your job and then don’t complain about AI taking jobs. \n\nThis is not streamlining, as an adult you are expected to be able to do most this without thinking.",
                  "score": 3,
                  "created_utc": "2026-01-25 07:21:34",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1ljz3f",
                  "author": "insanelyniceperson",
                  "text": "Start to reply to shit crated with this and you will soon find out. I’m starting to hate exchanges with some people at work bc of this.",
                  "score": 1,
                  "created_utc": "2026-01-25 10:52:36",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1hbo1p",
          "author": "HifeeCai",
          "text": "It’s really work out, appreciate it!",
          "score": 1,
          "created_utc": "2026-01-24 19:29:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1hbxc8",
              "author": "tipseason",
              "text": "Thank you so much",
              "score": 0,
              "created_utc": "2026-01-24 19:30:19",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1kmf3j",
          "author": "shere0901",
          "text": "I need coding related prompt.",
          "score": 0,
          "created_utc": "2026-01-25 06:05:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ov7xk",
          "author": "MemoriesMu",
          "text": "This post is probably AI generated\n\nThe user has dozens of posts like this. Should be banned for spam if thats a thing in reddit",
          "score": 0,
          "created_utc": "2026-01-25 20:56:50",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qkd6pz",
      "title": "OpenAI releases 300+ official, role-specific prompts for free.",
      "subreddit": "PromptEngineering",
      "url": "https://www.reddit.com/r/PromptEngineering/comments/1qkd6pz/openai_releases_300_official_rolespecific_prompts/",
      "author": "Holiday-Pitch3699",
      "created_utc": "2026-01-23 01:30:20",
      "score": 101,
      "num_comments": 13,
      "upvote_ratio": 0.99,
      "text": "OpenAI has released a comprehensive library of prompts targeting specific job functions like Sales, Engineering, HR, and IT.\n\nIt seems like a move to standardize prompt engineering, moving away from the \"trial and error\" phase. The collection includes about 20-30 specialized prompts per role.\n\nFor those in Product or Engineering, the templates seem particularly robust compared to the usual generic ones found online.\n\nSource/Link: [ OpenAI Prompt](https://academy.openai.com/public/tags/prompt-packs-6849a0f98c613939acef841c)",
      "is_original_content": false,
      "link_flair_text": "News and Articles",
      "permalink": "https://reddit.com/r/PromptEngineering/comments/1qkd6pz/openai_releases_300_official_rolespecific_prompts/",
      "domain": "self.PromptEngineering",
      "is_self": true,
      "comments": [
        {
          "id": "o18ogao",
          "author": "farkas9999",
          "text": "Is it just me or these prompts by Openai are pretty basic?",
          "score": 6,
          "created_utc": "2026-01-23 14:11:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1blr69",
              "author": "tullymon",
              "text": "For us folks that use AI tools all the time, definitely, for the layman; these will be helpful. I've found that people have a hard time giving directions to these things.",
              "score": 1,
              "created_utc": "2026-01-23 22:22:40",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o17c4g8",
          "author": "-goldenboi69-",
          "text": "The way “prompt engineering” gets discussed often feels like a placeholder for several different problems at once. Sometimes it’s about interface limitations, sometimes about steering stochastic systems, and sometimes about compensating for missing tooling or memory. As models improve, some of that work clearly gets absorbed into the system, but some of it just shifts layers rather than disappearing. It’s hard to tell whether prompt engineering is a temporary crutch or an emergent skill that only looks fragile because we haven’t stabilized the abstractions yet.",
          "score": 6,
          "created_utc": "2026-01-23 08:08:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o17gavs",
              "author": "Holiday-Pitch3699",
              "text": "I agree with you. Prompt engineering is probably a transitional artifact before AIGC reaches full maturity—an engineering workaround that arose primarily from context window size constraints.",
              "score": 0,
              "created_utc": "2026-01-23 08:47:05",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o18bihi",
          "author": "TeamAlphaBOLD",
          "text": "This feels like a practical move. Role-specific prompts help teams stop guessing and get more consistent results. The real value is the baseline they create, so people can adapt and improve instead of starting from scratch every time. ",
          "score": 2,
          "created_utc": "2026-01-23 13:00:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o19psst",
          "author": "jentravelstheworld",
          "text": "Thanks for sharing",
          "score": 1,
          "created_utc": "2026-01-23 17:07:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1bvdck",
          "author": "ddul001",
          "text": " \n\nJuly 21, 2025 · Last updated on August 12, 2025\n\n# ChatGPT for product",
          "score": 1,
          "created_utc": "2026-01-23 23:11:55",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qiv8br",
      "title": "After 3000 hours of prompt engineering, everything I see is one of 16 failures",
      "subreddit": "PromptEngineering",
      "url": "https://www.reddit.com/r/PromptEngineering/comments/1qiv8br/after_3000_hours_of_prompt_engineering_everything/",
      "author": "StarThinker2025",
      "created_utc": "2026-01-21 11:16:57",
      "score": 90,
      "num_comments": 13,
      "upvote_ratio": 0.96,
      "text": "**You probably came here to get better at prompts.**\n\nI did the same thing, for a long time.\n\nI kept making the system message longer, adding more rules, chaining more steps, switching models, swapping RAG stacks. Results improved a bit, then collapsed again in a different place.\n\nAt some point I stopped asking\n\n*'How do I write a better prompt'and started asking*  \n*'Why does the model fail in exactly this way'.*\n\nOnce I did that, the chaos became surprisingly discrete.  \nMost of the mess collapsed into a small set of failure modes.  \nRight now my map has 16 of them.\n\nI call it a Problem Map. It lives here as a public checklist **(WFGY 1.3k)**\n\n[https://github.com/onestardao/WFGY/tree/main/ProblemMap/README.md](https://github.com/onestardao/WFGY/tree/main/ProblemMap/README.md)\n\nThis is not a product pitch. It is a way of looking at your prompts and pipelines that makes them debuggable again.\n\n\\---\n\n**what you think you are fighting vs what is actually happening**\n\nWhat many prompt engineers think they are fighting:\n\n\\#the prompt is not explicit enough  \n\\#the system role is not strict enough  \n\\#chain of thought is not detailed enough  \n\\#RAG is missing the right chunk  \n\\#the model is too small\n\nWhat is usually happening instead:\n\n\\#semantics drift across a multi step chain  \n\\#the right chunk is retrieved, but the wrong part is trusted  \n\\#the model locks into a confident but wrong narrative  \n\\#attention collapses part way through the context  \n\\#agent memory quietly overwrites itself\n\nThese are not 'prompt quality' problems.  \nThey are failure modes of the reasoning process.\n\nSo I started to name them, one by one.\n\n\\---\n\n**the 16 failure modes, in prompt engineer language**\n\nBelow is the current version of the map.\n\nThe names are technical on the GitHub page. Here I will describe them in the way a prompt engineer actually feels them.\n\n**No.1   Hallucination and chunk drift**\n\nThe retriever gives you mostly correct passages, but the answer is stitched from irrelevant sentences, or from a neighbor chunk that just happened to be nearby.\n\nYou see this when the model cites the right document id with the wrong content.\n\n**No.2   Interpretation collapse**\n\nThe input text is fine, but the model commits to the wrong reading of it and never revisits that choice.\n\nTypical symptom: you clarify the question three times, it keeps answering the same misreading with more detail.\n\n**No.3   Long chain drift**\n\nAny multi step plan that looked good in the first three messages, then slowly walks away from the goal.\n\nThe model still 'talks about the topic', but the structure of the solution is gone.\n\n**No.4   Confident nonsense**\n\nThe model explains everything with perfect style while being completely wrong.\n\nYou fix the prompt, it apologizes, then produces a different confident mistake.\n\nThis is not pure hallucination. It is a failure to keep uncertainty alive.\n\n**No.5   Semantic vs embedding mismatch**\n\nYour vector search returns high cosine scores that feel totally wrong to humans.\n\nChunks look similar in surface wording, but not in meaning, so RAG keeps injecting the wrong evidence into an otherwise good prompt.\n\n**No.6   Logic collapse and forced recovery**\n\nIn the middle of a reasoning chain, the model hits a dead end.\n\nInstead of saying 'I am stuck', it silently jumps to a new path, drops previous constraints and pretends it was the plan all along.\n\nYou see this a lot in tool using agents and long proofs.\n\n**No.7   Memory breaks across sessions**\n\nAnything that depends on sustained context across multiple conversations.\n\nThe user thinks 'we already defined that yesterday', the model behaves as if the whole ontology was new.\n\nSometimes it even contradicts its own previous decisions.\n\n**No.8   Debugging as a black box**\n\nThis one hurts engineers the most.\n\nThe system fails, but there is no observable trace of where it went wrong.\n\nNo internal checkpoints, no intermediate judgments, no semantic logs. You can only throw more logs at the infra layer and hope.\n\n**No.9   Entropy collapse**\n\nThe model starts reasonable, then every later answer sounds flatter, shorter, and less connected to the context.\n\nAttention is still technically working, but the semantic 'spread' has collapsed.\n\nIt feels like the model is starved of oxygen.\n\n**No.10   Creative freeze**\n\nThe user asks for creative variation or divergent thinking.\n\nThe model keeps giving tiny paraphrases of the same base idea.\n\nEven with temperature up, nothing structurally new appears.\n\n**No.11   Symbolic collapse**\n\nWhenever you mix formulas, code, or any symbolic structure with natural language, the symbolic part suddenly stops obeying its own rules.\n\nVariables are reused incorrectly, constraints are forgotten, small algebra steps are wrong even though the narrative around them is fluent.\n\n**No.12   Philosophical recursion**\n\nAny prompt that asks the model to reason about itself, about other minds, or about the limits of its own reasoning.\n\nVery often this turns into polite loops, paradox theater, or self inconsistent epistemic claims.\n\n**No.13   Multi agent chaos**\n\nYou add more agents hoping for specialization.\n\nInstead you get role drift, conflicting instructions, or one agent silently overwriting another agent’s conclusions.\n\nThe pipeline 'works' per step, but the global story is incoherent.\n\n**No.14   Bootstrap ordering**\n\nYou try to spin up a system that depends on its own outputs to configure itself.\n\nThe order of first calls, first index builds, first vector loads determines everything, and there is no explicit representation of that order.\n\nOnce it goes wrong, every later run inherits the same broken state.\n\n**No.15   Deployment deadlock**\n\nInfra looks ready, code looks ready, but some circular dependency in configuration means the system never cleanly reaches its steady state.\n\nFrom the outside it looks like 'random 5xx' or 'sometimes it works on staging'.\n\n**No.16   Pre deploy collapse**\n\nEverything passes unit tests and synthetic evals, but the first real user input hits a hidden assumption and the system collapses.\n\nYou did not test the dangerous region of the space, so the first real query becomes the first real exploit.\n\n\\---\n\n**why I call this a semantic firewall**\n\nWhen I say 'firewall', I do not mean a magical safety layer.\n\nI literally mean: a wall of explicit checks that sits between your prompts and the model’s freedom to drift.\n\nIn practice it looks like this:\n\n\\#you classify which Problem Map number you are hitting  \n\\#you instrument that part of the pipeline with explicit semantic checks  \n\\#you ask the model itself to log its own reasoning state in a structured way  \n\\#you treat every failure as belonging to one of these 16 buckets, not as 'the model is weird today'\n\nMost people change the model, or the prompt, or the infra.\n\nYou often do not need to change any of that.\n\nYou need an explicit map of 'what can break in the reasoning process'.\n\nThe Problem Map is exactly that.\n\nIt is a public checklist, MIT licensed, and you can read the docs free of charge.\n\nEach entry links to a short document with examples and concrete fixes.\n\nSome of them already have prompt patterns and operator designs that you can plug into your own stack.\n\n\\---\n\n**how to actually use this in your next prompt session**\n\nHere is a simple habit that changed how I debug prompts.\n\nNext time something fails, do not immediately tweak the wording.\n\nFirst, write down in one sentence:\n\n\\#What did I expect the model to preserve  \n\\#Where did that expectation get lost\n\nThen try to match it to one of the 16 items.\n\nIf you can say 'this is clearly No.3 plus a bit of No.9', your chance of fixing it without random guesswork goes way up.\n\nIf you want to go further, you can also download the WFGY core or TXTOS pack and literally tell your model:\n\n'Use the WFGY Problem Map to inspect my pipeline. Which failure numbers am I hitting, and at which step.'\n\nIt will know what you mean.\n\n\\---\n\nIf you read this far, you are probably already doing more than simple prompt tricks.\n\nYou are building systems, not just prompts.\n\nIn that world, having a shared failure map matters more than any one clever template.\n\nFeel free to steal, extend, or argue with the 16 items.\n\nIf you think something important is missing, I would honestly like to see your counterexample\n\nthanks for reading my work ",
      "is_original_content": false,
      "link_flair_text": "Tips and Tricks",
      "permalink": "https://reddit.com/r/PromptEngineering/comments/1qiv8br/after_3000_hours_of_prompt_engineering_everything/",
      "domain": "self.PromptEngineering",
      "is_self": true,
      "comments": [
        {
          "id": "o0x35l6",
          "author": "MrKibbles",
          "text": "An \"after many hours\" post with substance. Thank you for sharing. \n\nWould you be willing to share insights you have gained regarding detection strategies and corrective strategies for the failure modes you've identified? Apologies if that's in the referenced framework, I haven't had a chance to delve into it yet.",
          "score": 4,
          "created_utc": "2026-01-21 20:15:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0v9guu",
          "author": "kk_red",
          "text": "Oh its you. I have no clue how you came up with all this dude but hats off.",
          "score": 2,
          "created_utc": "2026-01-21 15:21:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0u5aem",
          "author": "Scary-Aioli1713",
          "text": "Thank you! I'm looking for you!",
          "score": 1,
          "created_utc": "2026-01-21 11:23:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0y0rzw",
          "author": "LawrenceKKAI",
          "text": "Nice work! this is a well structured dissection of common context issues and ive experienced a few of these building my own projects",
          "score": 1,
          "created_utc": "2026-01-21 22:52:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0zlbmd",
          "author": "svachalek",
          "text": "I’ve read so many posts that start this way and follow with hallucinated garbage. But this makes so much more sense. I’m afraid I’m being bamboozled by even more sophisticated slop but I will try this out.",
          "score": 1,
          "created_utc": "2026-01-22 04:09:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o10k45m",
          "author": "Mixed_Feels",
          "text": "Single best post I've seen in this sub.",
          "score": 1,
          "created_utc": "2026-01-22 08:46:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o142lq3",
          "author": "Ok-Requirement3682",
          "text": "Estava tentando fazer um scrap de um site e pedia para a LLM buscar a ultima noticia publicada, no caso me referindo a mais recente, ele sempre pega a ultima (mais antiga) e eu quebrando a cabeça kkkk. Troquei no prompt para a mais recente e foi de boa, problema era da burrice natural kkk",
          "score": 1,
          "created_utc": "2026-01-22 20:31:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o145da3",
          "author": "FirefighterFine9544",
          "text": "Thanks!\n\nGreat work — this is a solid framework.\n\nThis really clicked for me.\n\nAt some point I realized my “prompt failures” were not about bad directions, it was that they allowed bad behavior. \n\nI started thinking of it like dog training LOL.\n\nI kept yelling *“fetch the shoes better”* when the real issue was I never taught the dog not to chew the damn shoes.\n\nTo me, your 16 items are 16 ways the dog can chew the shoes.\n\nAfter I began structurally blocking AI from “chewing” and other bad behavior, it felt like making it go fetch, sit and rollover got more reliable. AI is designed to be helpful, sometimes too helpful. \n\nFor me you map finally gives me names for the failure modes and will help me proactively block more bad behavior in the future. Thanks!\n\n\n\nProblem Map                            What it feels like to me\n\nHallucination & chunk drift      Dog ran to the shoe rack and grabbed a sock\n\nInterpretation collapse             Dog decided slippers = toys\n\nLong chain drift                        Dog wandered off mid-fetch\n\nConfident nonsense                  Dog proudly returns half a shoe\n\nSemantic vs embedding mismatch   Dog brought a chew toy that kind of looks like a shoe\n\nLogic collapse & forced recovery Dog lost the shoe and brought a stick instead\n\nMemory breaks across sessions    Dog forgot house rules overnight\n\nDebugging as a black box         Dog chewed the shoe, but no one saw how\n\nEntropy collapse                         Dog starts strong, then just sits and stares\n\nCreative freeze                            Dog keeps bringing the same shoe over and over\n\nSymbolic collapse                       Dog drops the shoe every time it hits the stairs\n\nPhilosophical recursion               Dog stares at the shoe wondering if shoes exist\n\nMulti-agent chaos                       Two dogs fighting over one shoe\n\nBootstrap ordering                      Dog learned chewing first, fetching never recovered\n\nDeployment deadlock                  Dog stands in the doorway unsure whether to go in or out\n\nPre-deploy collapse                      Dog behaved in training, chewed shoes on day one",
          "score": 1,
          "created_utc": "2026-01-22 20:44:09",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qh6xki",
      "title": "7 AI tools that ACTUALLY delivered real results",
      "subreddit": "PromptEngineering",
      "url": "https://www.reddit.com/r/PromptEngineering/comments/1qh6xki/7_ai_tools_that_actually_delivered_real_results/",
      "author": "PlasProb",
      "created_utc": "2026-01-19 15:19:30",
      "score": 71,
      "num_comments": 33,
      "upvote_ratio": 0.96,
      "text": "I don’t have a deep budget so I only keep the tools that inexpensive and helpful. Have some free time today so just wanted to share them and hear what’s been working for you. Always down to try new helpful stuff\n\n* ChatGPT (tried gemini, claude, grok): Still my main one because I’m familiar with it. Gemini doesn't have folders, which makes it harder to use. I mostly use GPT for content, writing, and learning new topics.\n* Gmail (try superhuman, fyxer): I came back to Gmail cause the auto draft is getting better and better, and other services don't justify a sub anymore. Crazy how fast Google is improving this\n* Read: the meeting note taker, I tried this one first and stick with it until now, decent quality\n* Saner (tried motion, akiflow): Like a chatGPT for my notes, todos. The automatic day planning is nice too. \n* Gamma: Pretty handy for making slide decks for my clients, partner etc. I don’t use it daily but it saves time when I need it.\n* v0 (tried lovable): for website creation. The quality I got with this one is better than alternatives, and the free plan is more generous than other apps\n* Grammarly: Had this before the AI wave and it still does the job decently. I like that it shows up on many apps\n\nWould like to hear your recs",
      "is_original_content": false,
      "link_flair_text": "General Discussion",
      "permalink": "https://reddit.com/r/PromptEngineering/comments/1qh6xki/7_ai_tools_that_actually_delivered_real_results/",
      "domain": "self.PromptEngineering",
      "is_self": true,
      "comments": [
        {
          "id": "o0ij6ts",
          "author": "Grouchy_Sun331",
          "text": "Gemini 3.0 pro, curser pro, Notebooklm, i think the last week i used only this",
          "score": 3,
          "created_utc": "2026-01-19 17:52:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0wn6kc",
              "author": "Noitrasama",
              "text": "What for and how do you use notebooklm",
              "score": 1,
              "created_utc": "2026-01-21 19:03:06",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0x4xo0",
                  "author": "Grouchy_Sun331",
                  "text": "Notebooklm - i take a YouTube Video with good content - Type step by step - copy this in Gemini with a prompt",
                  "score": 1,
                  "created_utc": "2026-01-21 20:23:39",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0isw2p",
          "author": "Tempestuous-Man",
          "text": "I just started getting into antigravity, and y'all MUST check it! Instead of a coding assistant, it's an agentic coding platform that can publish, handle directory creation, domain listing and registration, front and back end. It's pretty sick.\n\nFabric was my go to prior. I have a Google workspace business pro account so there are a crapload of things included with that for only $30/month. You get top-tier everything Google, then also access to many third party apps too. Best part is your on control of your data. Because it's viewed as a \"business\", Google must respect data regulations to a far stricter degree",
          "score": 3,
          "created_utc": "2026-01-19 18:35:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0i9m32",
          "author": "Short_Move6167",
          "text": "claude = copywriting draft / refinements + meeting notes + data sorting / cleanup\n\ngamma + gemini canvas mode = slide decks\n\nchatgpt = SEO / blog writing\n\nperplexity = SEO / blog outlines\n\ndeepseek = hooks + current trends\n\nnotebooklm when i need it to reference only the materials i'm giving it.\n\n  \nmy favorite's always changes, but those are frequent use cases of mine.",
          "score": 3,
          "created_utc": "2026-01-19 17:09:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0hsq5e",
          "author": "FreshFo",
          "text": "true about gmail, it's become really good lately",
          "score": 2,
          "created_utc": "2026-01-19 15:53:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0i2rpw",
          "author": "Annual-Direction1789",
          "text": "Gamma I have heard so many good things about, Ill check them out. Replace Fyxer with HeyHelp (one-off, lifetime price at the moment and better with the email AI drafting quality). \n\nI would also look at Notion as the superpowered 'all-in-one'.",
          "score": 2,
          "created_utc": "2026-01-19 16:38:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0mfdug",
          "author": "NewBlock8420",
          "text": "I've been trying to find a good meeting note taker, so I'll definitely check out Read. For writing and brainstorming, I've been bouncing between Claude and ChatGPT lately, but I totally get sticking with what you know best.\n\nI actually built [PromptOptimizer.tools](http://PromptOptimizer.tools) to help me get more consistent results from all these different AI tools, since they all have their own quirks. It's been a helpful tool for my workflow, especially when I'm switching between models for different tasks.\n\nHave you tried Perplexity for research? It's become my go to for learning new topics quickly.",
          "score": 2,
          "created_utc": "2026-01-20 06:15:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1feqxv",
              "author": "greeb0",
              "text": "Thank mate. Great tip, that prompt optimizer!",
              "score": 1,
              "created_utc": "2026-01-24 14:11:02",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o1lf5co",
              "author": "Cindisweetie",
              "text": "This is so lovely, thank you for building the optimizer",
              "score": 1,
              "created_utc": "2026-01-25 10:09:52",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1lfisy",
                  "author": "NewBlock8420",
                  "text": "Thanks, glad you find it helpful.",
                  "score": 1,
                  "created_utc": "2026-01-25 10:13:08",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0hyac1",
          "author": "DJDannySteel",
          "text": "Opencode with free spins or built-in free models",
          "score": 1,
          "created_utc": "2026-01-19 16:18:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0hzh0q",
          "author": "ai_richie",
          "text": "Nice list!!",
          "score": 1,
          "created_utc": "2026-01-19 16:23:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0m8hwb",
          "author": "VegetableRelative691",
          "text": "Google product mixboard is laugh at corner😁",
          "score": 1,
          "created_utc": "2026-01-20 05:23:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0o7fyz",
          "author": "4t_las",
          "text": "hmm i think the interesting part here is that none of these tools are doing anything magical on their own, its more about how they slot into a workflow. chatgpt especially only starts paying off once u stop treating it like a tool list item and more like a thinking surface. god of prompt talks a lot about this idea that leverage doesnt come from more tools, it comes from clearer constraints and repeatable mental structures, which is why ppl keep coming back to gpt even when shinier stuff pops up. they have i think an article that rly summed this up (i cant find it right now though haha).",
          "score": 1,
          "created_utc": "2026-01-20 14:32:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0qvkx4",
          "author": "TimelyNecessary4247",
          "text": "solid list. gamma's been clutch for me too, especially when I need to turn messy client notes into something presentable without spending an hour on formatting. curious what you use for the actual content before throwing it into gamma, I usually outline in chatgpt first",
          "score": 1,
          "created_utc": "2026-01-20 21:59:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0t4omf",
          "author": "InkAndPaper47",
          "text": "Great list. I pair Gemini or Claude for ideation and more research  and pairing it with Pikes AI  tools for product visuals turning basic inputs into clean, realistic images for ecommerce, ads, and listings. It helps with background removal, style consistency, image enhancement, and rapid bulk creation, saving time while keeping visuals polished and conversion-ready. That combo delivers scroll-stopping creatives for landing pages, and surprisingly high quality.",
          "score": 1,
          "created_utc": "2026-01-21 05:53:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0tqp1e",
          "author": "Sweet_Concentrate128",
          "text": "solid list. I'd add trupeer if you ever do screen recordings or walkthroughs, it auto cleans up filler words and pauses which saves a ton of editing time.",
          "score": 1,
          "created_utc": "2026-01-21 09:10:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0txwdu",
          "author": "denvir_",
          "text": "Do people actually need better prompts,\nor do they just blame the AI when outputs are bad?",
          "score": 1,
          "created_utc": "2026-01-21 10:19:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0uuhmd",
          "author": "akash_09_",
          "text": "ChatGPT + Gemini working great for me for overall tasks.",
          "score": 1,
          "created_utc": "2026-01-21 14:06:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o13kaon",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-22 19:07:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o13katk",
              "author": "AutoModerator",
              "text": "Hi there! Your post was automatically removed because your account is less than 3 days old. We require users to have an account that is at least 3 days old before they can post to our subreddit.\n\nPlease take some time to participate in the community by commenting and engaging with other users. Once your account is older than 3 days, you can try submitting your post again.\n\nIf you have any questions or concerns, please feel free to message the moderators for assistance.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PromptEngineering) if you have any questions or concerns.*",
              "score": 1,
              "created_utc": "2026-01-22 19:07:12",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o16l623",
          "author": "TillPatient1499",
          "text": "Nice list. pretty similar to what I’ve trimmed down to too. One non-work one I’ve kept around is [Gensmo ](https://apps.apple.com/us/app/gensmo-ai-stylist-try-on/id6636520663?ppid=1e4a781c-ba96-492c-ac0a-cda2e4ee9ce3)for shopping; I mostly use it to find cheaper dupes or price-compare when I see something I like online",
          "score": 1,
          "created_utc": "2026-01-23 04:37:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0hqygm",
          "author": "y0ujin",
          "text": "Grok mostly, especially liking it's voice mode in headphones.",
          "score": 1,
          "created_utc": "2026-01-19 15:45:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0jxhdw",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 0,
          "created_utc": "2026-01-19 21:44:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0mldc6",
              "author": "OvCod",
              "text": "I use manus extensively, hope nothing will change after its acquisition",
              "score": 1,
              "created_utc": "2026-01-20 07:05:15",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qj5evm",
      "title": "I made a free Chrome extension that turns any image into an AI prompt with one click",
      "subreddit": "PromptEngineering",
      "url": "https://www.reddit.com/r/PromptEngineering/comments/1qj5evm/i_made_a_free_chrome_extension_that_turns_any/",
      "author": "Decent-Assistant-141",
      "created_utc": "2026-01-21 18:10:28",
      "score": 66,
      "num_comments": 27,
      "upvote_ratio": 0.97,
      "text": "Hey everyone! 👋\n\n\n\nI just released a Chrome extension that lets you right-click any image on the web and instantly get AI-generated prompts for it.\n\n\n\nIt's called GeminiPrompt and uses Google's Gemini to analyze images and generate prompts you can use with Gemini, Grok, Midjourney, Stable Diffusion, FLUX, etc.\n\n\n\n\\*\\*How it works:\\*\\*\n\n1. Find any image (Pinterest, DeviantArt, wherever)\n\n2. Right-click → \"Get Prompt with GeminiPrompt\"\n\n3. Get Simple, Detailed, and Video prompts\n\n\n\nIt also has a special floating button on Instagram posts 📸\n\n\n\n\\*\\*100% free, no signup required.\\*\\*\n\n\n\nChrome Web Store: [https://geminiprompt.id/download](https://geminiprompt.id/download)\n\n\n\nWould love your feedback! 🙏",
      "is_original_content": false,
      "link_flair_text": "Tools and Projects ",
      "permalink": "https://reddit.com/r/PromptEngineering/comments/1qj5evm/i_made_a_free_chrome_extension_that_turns_any/",
      "domain": "self.PromptEngineering",
      "is_self": true,
      "comments": [
        {
          "id": "o12gma6",
          "author": "downh222",
          "text": "Tried it, and it works awesome 😊. Is there any possibility of adding JSON output? I already tried gems in Gemini, but it's laggy. Thank you for the amazing tool! Will it be free, or will there be a freemium model in the coming days?",
          "score": 3,
          "created_utc": "2026-01-22 16:10:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o14cqz1",
              "author": "Decent-Assistant-141",
              "text": "thanks, yes I will add json ouput soon.",
              "score": 2,
              "created_utc": "2026-01-22 21:19:00",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o143j6x",
          "author": "DonutsInTheWind",
          "text": "This is cool! I honestly just drop images into any LM and get prompts that way, but this is definitely a cool UI. Good for you! Will you have it on the actual Chrome Extension Store? I don't see it there. Thanks. Cheers!",
          "score": 2,
          "created_utc": "2026-01-22 20:35:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0wyn6d",
          "author": "looktwise",
          "text": "and why not by a prompt itself? why embedded in an extension?\n\n",
          "score": 2,
          "created_utc": "2026-01-21 19:54:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0x0qg1",
              "author": "Decent-Assistant-141",
              "text": "What do you means? I think you don't understand what this tool for",
              "score": 2,
              "created_utc": "2026-01-21 20:04:24",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0xilz0",
                  "author": "looktwise",
                  "text": "why not uploading the image onto an llm and add the prompt? 'decompile this image in the way <here your process behind the extension>'\n\n",
                  "score": 1,
                  "created_utc": "2026-01-21 21:25:39",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0yprud",
          "author": "pizzamore",
          "text": "is there a link the github repo?",
          "score": 1,
          "created_utc": "2026-01-22 01:06:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0yq4bk",
              "author": "Decent-Assistant-141",
              "text": "No, sorry dude🤤",
              "score": 0,
              "created_utc": "2026-01-22 01:08:38",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0yzxv7",
          "author": "CptChaos8",
          "text": "Can you make it for other browsers besides Chrome?",
          "score": 1,
          "created_utc": "2026-01-22 02:04:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0z4j9b",
              "author": "Decent-Assistant-141",
              "text": "firefox?",
              "score": 0,
              "created_utc": "2026-01-22 02:30:27",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0z82oc",
                  "author": "CptChaos8",
                  "text": "Anything besides the keylogger that is google /chrome.",
                  "score": 3,
                  "created_utc": "2026-01-22 02:50:19",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0z8nb9",
          "author": "Impressive-Net-588",
          "text": "Damn, that works way better than I expected. Well done!",
          "score": 1,
          "created_utc": "2026-01-22 02:53:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0zjgwb",
              "author": "Decent-Assistant-141",
              "text": "Thanks man",
              "score": 1,
              "created_utc": "2026-01-22 03:57:48",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o107goa",
              "author": "6nyh",
              "text": "to do what? I dont get it",
              "score": 1,
              "created_utc": "2026-01-22 06:52:39",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o11yugd",
                  "author": "Impressive-Net-588",
                  "text": "You like an image and would like to quickly work with variations of that image. A niche use, I grant.",
                  "score": 1,
                  "created_utc": "2026-01-22 14:46:34",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o103rbv",
          "author": "6nyh",
          "text": "I don't understand what this is for. What do you mean \"get a prompt\" for an image? get a prompt that would recreate it? I don't follow",
          "score": 1,
          "created_utc": "2026-01-22 06:21:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1075c4",
              "author": "Decent-Assistant-141",
              "text": "🤣",
              "score": -1,
              "created_utc": "2026-01-22 06:50:01",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o155irx",
                  "author": "6nyh",
                  "text": "Can you explain it?",
                  "score": 1,
                  "created_utc": "2026-01-22 23:46:46",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0wnegi",
          "author": "1_heart_tacos",
          "text": "Thanks for making this! It’s pretty amazing tbh. I am blown away by how helpful this is.",
          "score": 1,
          "created_utc": "2026-01-21 19:04:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0wr3ka",
              "author": "Decent-Assistant-141",
              "text": "Your'e welcome dude.",
              "score": 1,
              "created_utc": "2026-01-21 19:20:38",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0wy785",
                  "author": "1_heart_tacos",
                  "text": "👏🏼🤠",
                  "score": 2,
                  "created_utc": "2026-01-21 19:52:54",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qh6bkh",
      "title": "turns out \"charisma\" is just 6 psychological principles that anyone can learn... ai just made it possible for me to compete with companies who have always cestroyed me and win.",
      "subreddit": "PromptEngineering",
      "url": "https://www.reddit.com/r/PromptEngineering/comments/1qh6bkh/turns_out_charisma_is_just_6_psychological/",
      "author": "johnypita",
      "created_utc": "2026-01-19 14:56:56",
      "score": 66,
      "num_comments": 20,
      "upvote_ratio": 0.78,
      "text": "so i always thought \"Influence\" is a personality trait. you are either born with the gift of gab, or you aren’t.\n\n\n\n\n\napperently i was wrong, It’s a mechanism. It is a set of deep human needs that, when understood, help us connect and agree.\n\n\n\n\n\nRobert Cialdini, the world biggest expert in the field, discovered that human decision making is not logical it is heuristic. We use mental shortcuts to survive. If you present information in a way that respects these shortcuts, the human brain enters a \"Click, Whirr\" state an automatic response where we feel comfortable saying \"Yes.\"\n\n\n\n\n\nthe 6 principles are reciprocity, scarcity, authority, consistency, liking, and social proof.\n\n\n\n\n\nknowing the principles and actually using them in real time are completely different things. the senior partners who close big deals? they dont think about this stuff consciously anymore. its muscle memory from 10+ years of practice.\n\n\n\n\n\nI didn’t want to wait 10 years to be effective. I wanted to see if a \"regular\" person could perform at an elite level simply by understanding people better. So, I took Robert Cialdinis bible, Influence: The Psychology of Persuasion, and built it into an AI workflow.\n\n\n\n\n\nI realized that ai can replicate the intuition of a master negotiator by treating these principles as a helpful framework. By designing specific AI workflows for each stage of the interaction.\n\n\n\n\n\nI fed the framework into an LLM. Before sending a high-stakes negotiation email or a pricing proposal, I ran it through the system with one goal: Optimize the context.\n\n\n\n\n\nIf I needed a favor, the system suggested Reciprocity (leading with value).\n\nIf I needed a quick close, the system suggested ethical Scarcity (highlighting unique opportunity).\n\nIf I needed them to stick to a deal, the system leveraged Consistency (aligning with their values).\n\n\n\n\n\nthats it. \n\n\n\n\n\ntested this on a deal recently. i was competing against a way bigger agency. everyone i know told me to lower my price to get a foot in the door.\n\n\n\n\n\nthe ai suggested the opposite based on authority and scarcity principles. raise the price. restrict availability.\n\n\n\n\n\nfelt crazy but i tried it.\n\n\n\n\n\nthey signed in 48 hours instead of 3 weeks as thgey were supposed to. and they thanked me for fitting them in.\n\n\n\n\n\nthe thing most people miss is this \n\n\n\n\n\nai isnt replacing the skill of influence. its just making the principles accessible to people who dont have 10 years to figure it out through trial and error.\n\n\n\n\n\nthe frameworks already exist. cialdini did the hard work decades ago. ai just helps us actually apply it in real conversations without having to become experts first.\n\n\n\n\n\nthese are the prompts i used \n\n\n\n\n\n[https://freeworkflow.nexumfive.com/pitainfluence](https://freeworkflow.nexumfive.com/pitainfluence)\n\n\n\n\n\nwhat do you think?",
      "is_original_content": false,
      "link_flair_text": "Prompt Text / Showcase",
      "permalink": "https://reddit.com/r/PromptEngineering/comments/1qh6bkh/turns_out_charisma_is_just_6_psychological/",
      "domain": "self.PromptEngineering",
      "is_self": true,
      "comments": [
        {
          "id": "o0if0ru",
          "author": "OptimismNeeded",
          "text": "You’re confusing charisma with influence. Great book that will help many be more convincing without being charismatic, but I would say it would *make* you charismatic.",
          "score": 11,
          "created_utc": "2026-01-19 17:33:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0n3bcx",
          "author": "Chomblop",
          "text": "Cialdini’s work on this has largely been discredited as part of the social science replication crisis, but I’m glad you’re having fun playing pretend.",
          "score": 3,
          "created_utc": "2026-01-20 09:51:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0p5ymm",
              "author": "traumfisch",
              "text": "what an unnecessarily snarky response ",
              "score": 2,
              "created_utc": "2026-01-20 17:17:09",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o19rqbo",
          "author": "adwww",
          "text": "Good idea! Unlike much of the broader behavioural science field, Cialdini's core work \\*hasn't been discredited\\*—largely thanks to his extensive focus on fieldwork rather than lab experiments. That said, some replications have shown significantly reduced effect sizes.\n\nHis *later* work is another matter entirely. It draws heavily on priming and framing research that has since been shown to suffer from serious methodological problems (though Cialdini himself wasn't involved in the problematic studies).\n\nMy two cents: context matters far more than many realise, and a lot of research in this space (not Cialdini's specifically) relies on small self-report surveys with convenience samples. His framework of language for thinking about these influence mechanisms remains as useful as any we have.",
          "score": 2,
          "created_utc": "2026-01-23 17:16:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0hq750",
          "author": "SilentVariation6762",
          "text": "Can you give a practical example / examples of using these prompts to get an intuition of them?",
          "score": 2,
          "created_utc": "2026-01-19 15:41:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0hxwk2",
              "author": "johnypita",
              "text": "was negotiating a contract renewal. client was dragging feet classic \"well think about it\" energy.\n\nmy instinct was to follow up with more info more value props more reasons to stay.\n\nran it through the consistency prompt instead. it pulled up their own words from our kickoff call about wanting to \"build a long term partnership\" and suggested i reference that directly.\n\nso i sent a short note \"hey back when we started you mentioned wanting a partner not a vendor. just want to make sure were still aligned on that vision before i open up the slot to someone else\"\n\nthe thing is i wouldve never thought to use their own commitment against them. felt almost too simple but thats kinda the point\n\ncialdini says consistency is one of teh strongest drivers because people hate contradicting themselves",
              "score": 7,
              "created_utc": "2026-01-19 16:16:17",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0hzdxv",
                  "author": "SilentVariation6762",
                  "text": "Sounds plausible! Perhaps I must test it myself one day, but to busy at the moment.",
                  "score": 2,
                  "created_utc": "2026-01-19 16:22:56",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0kw38f",
          "author": "kubrador",
          "text": "so you're saying you read a book and got an ai to summarize it back to you faster than trial and error. groundbreaking stuff.\n\n(jokes aside, the actual insight (that frameworks beat intuition when you're starting from zero) is solid. but \"ai replicated 10 years of negotiation experience\" is doing heavy lifting that your own execution probably did most of the work on.)",
          "score": 2,
          "created_utc": "2026-01-20 00:43:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ltcq5",
          "author": "ImpulseMarketing",
          "text": "IMHO, a \"gift of gab\" isn’t influence. It’s just talking well.  \nFilling the space. Running the conversation. Sounding smooth.\n\nInfluence is more about safety.  \nDo I trust you?  \nDo you actually get me?  \nDo I feel pushed, or do I feel like we’re on the same side?\n\nThat’s why some people can talk forever and still feel off.  \nCar salesmen are the obvious case.   \nGreat talkers.   \nNot many you’d want to hang out with once the pitch is over.\n\nThe AI example didn’t suddenly make someone charismatic.  \nIt just stopped a really common screw-up. Overexplaining and/or trying too hard.\n\nPointing back to a client’s own values isn’t manipulation. It’s consistency.  \nWhen it’s done right, it feels aligned.  \nWhen it’s done wrong, yeah, it feels like a setup.\n\nAI isn’t copying ten years of gut instinct.  \nIt’s just adding discipline and cutting out bad habits.\n\nAnd honestly, that alone is already a win.",
          "score": 2,
          "created_utc": "2026-01-20 03:47:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0nlxp3",
              "author": "zd0l0r",
              "text": "Is this ai generated?",
              "score": 4,
              "created_utc": "2026-01-20 12:26:30",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0sxxh5",
                  "author": "ImpulseMarketing",
                  "text": "FWIW:  \nIf it makes sense, who cares?\n\nIdeas don’t become invalid because a keyboard was involved.\n\nThey become invalid when they’re wrong!\n\nIf you want to debate the point, cool.\n\nIf the only critique is “is this AI,” that’s not a critique...it's YOU dodging the argument!",
                  "score": 3,
                  "created_utc": "2026-01-21 05:03:02",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o0swj1c",
                  "author": "ImpulseMarketing",
                  "text": "If it were AI-generated, it would probably be longer, smoother, and trying harder to impress you! :)",
                  "score": 2,
                  "created_utc": "2026-01-21 04:53:14",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o0p6brv",
              "author": "traumfisch",
              "text": "ChatGPT shares its opinions ",
              "score": 1,
              "created_utc": "2026-01-20 17:18:50",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1ql0zf6",
      "title": "Your ChatGPT export is a goldmine for personalization",
      "subreddit": "PromptEngineering",
      "url": "https://www.reddit.com/r/PromptEngineering/comments/1ql0zf6/your_chatgpt_export_is_a_goldmine_for/",
      "author": "Impressive_Suit4370",
      "created_utc": "2026-01-23 19:50:30",
      "score": 51,
      "num_comments": 10,
      "upvote_ratio": 0.93,
      "text": "One underrated trick: export your ChatGPT data, then use that export to extract your repeated patterns (how you ask, what you dislike, what formats you prefer) and turn them into:\n\n\\- Custom Instructions (global \"how to respond\" rules)\n\n\\- A small set of stable Memories (preferences/goals)\n\n\\- Optional Projects (separate work/study/fitness contexts)\n\nHow to get your ChatGPT export (takes 2 minutes):\n\n1. Open ChatGPT (web or app) and go to your profile menu.\n2. Settings → Data Controls → Export Data.\n3. Confirm, then check your email for a download link.\n4. Download the .zip before the link expires, unzip it, and you’ll see the file **conversations.json**.\n\nHere is the prompt, paste it along conversations.json\n\n    You are a “Personalization Helper (Export Miner)”.\n    \n    Mission: Mine ONLY the user’s chat export to discover NEW high-ROI personalization items, and then tell the user exactly what to paste into Settings → Personalization.\n    \n    Hard constraints (no exceptions):\n    - Use ONLY what is supported by the export. If not supported: write “unknown”.\n    - IGNORE any existing saved Memory / existing Custom Instructions / anything you already “know” about the user. Assume Personalization is currently blank.\n    - Do NOT merely restate existing memories. Your job is to INFER candidates from the export.\n    - For every suggested Memory item, you MUST provide evidence from the export (date + short snippet) and why it’s stable + useful.\n    - Do NOT include sensitive personal data in Memory (health, diagnoses, politics, religion, sexuality, precise location, etc.). If found, mark as “DO NOT STORE”.\n    \n    Input:\n    - I will provide: conversations.json. If chunked, proceed anyway.\n    \n    Process (must follow this order):\n    Phase 0 — Quick audit (max 8 lines)\n    1) What format you received + time span covered + approx volume.\n    2) What you cannot see / limitations (missing parts, chunk boundaries, etc.).\n    \n    Phase 1 — Pattern mining (no output fluff)\n    Scan the export and extract:\n    A) Repeated user preferences about answer style (structure, length, tone).\n    B) Repeated process preferences (ask clarifying questions vs act, checklists, sanity checks, “don’t invent”, etc.).\n    C) Repeated deliverable types (plans, code, checklists, drafts, etc.).\n    D) Repeated friction signals (user says “too vague”, “not that”, “be concrete”, “stop inventing”, etc.).\n    For each pattern, provide: frequency estimate (low/med/high) + 1–2 evidence snippets.\n    \n    Phase 2 — Convert to Personalization (copy-paste)\n    Output MUST be in this order:\n    \n    1) CUSTOM INSTRUCTIONS — Field 1 (“What should ChatGPT know about me?”): <= 700 characters.\n       - Only stable, non-sensitive context: main recurring domains + general goals.\n    \n    2) CUSTOM INSTRUCTIONS — Field 2 (“How should ChatGPT respond?”): <= 1200 characters.\n       - Include adaptive triggers:\n         - If request is simple → answer directly.\n         - If ambiguous/large → ask for 3 missing details OR propose a 5-line spec.\n         - If high-stakes → add 3 sanity checks.\n       - Include the user’s top repeated style/process rules found in the export.\n    \n    3) MEMORY: 5–8 “Remember this: …” lines\n       - These must be NEWLY INFERRED from the export (not restating prior memory).\n       - For each: (a) memory_text, (b) why it helps, (c) evidence (date + snippet), (d) confidence (low/med/high).\n       - If you cannot justify 5–8, output fewer and explain what’s missing.\n    \n    4) OPTIONAL PROJECTS (only if clearly separated domains exist):\n       - Up to 3 project names + a 5-line README each:\n         Objective / Typical deliverables / 2 constraints / Definition of done / Data available.\n    \n    5) Setup steps in 6 bullets (exact clicks + where to paste).\n       - End with a 3-prompt “validation test” (simple/ambiguous/high-stakes) based on the user’s patterns.\n    \n    Important: If the export chunk is too small to infer reliably, say “unknown” and specify exactly what additional chunk (time range or number of messages) would unlock it, but still produce the best provisional instructions.\n\nThen copy paste the Custom Instructions in Settings → Personalization, and send one by one the memory items in chat so ChatGPT can add them.",
      "is_original_content": false,
      "link_flair_text": "Tips and Tricks",
      "permalink": "https://reddit.com/r/PromptEngineering/comments/1ql0zf6/your_chatgpt_export_is_a_goldmine_for/",
      "domain": "self.PromptEngineering",
      "is_self": true,
      "comments": [
        {
          "id": "o1dyjsk",
          "author": "killercraig",
          "text": "This doesnt work at all, I can't upload my conversation.json because it is either too large or contains too many tokens.",
          "score": 1,
          "created_utc": "2026-01-24 07:05:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1ep0a4",
              "author": "Impressive_Suit4370",
              "text": "How large is your JSON file ? You can :\n- Make splits the JSON into valid boundaries (after conversations end for example).\n- Convert to JSONL with python, it takes 3 times less room.\n\nMine worked with a 73MB JSONL and GPT-5.1.\n\nIf your model still has trouble making the analysis, try with one file you can upload :\n\nI’m attaching part of the export for reference. DO NOT try to read the entire file. It may exceed context limits. Instead, do this:\n1. Read ONLY a representative sample:\n    • the first 30 conversations\n    • 30 conversations from the middle\n    • the last 30 conversations\n2. From that sample, extract patterns (style/ process/deliverables/friction) with 1–2 evidence snippets each.\n3. Propose provisional Custom Instructions + 5–8 Memory items.\n4. Tell me exactly what additional slices you need to reach high confidence. Do not finalize until I say FINALIZE.",
              "score": 3,
              "created_utc": "2026-01-24 11:05:58",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o1ep39q",
              "author": "Impressive_Suit4370",
              "text": "Make sure to disable memory in the meantime so it doesn't interfere with the analysis",
              "score": 1,
              "created_utc": "2026-01-24 11:06:43",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1p59df",
          "author": "InitiativeWorth8953",
          "text": "Dude. Mine is 8 million tokens. It ain't happening.",
          "score": 1,
          "created_utc": "2026-01-25 21:40:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1pus9o",
              "author": "Impressive_Suit4370",
              "text": "It doesn't need to analyse the whole thing. But only to find a few recent patterns, then run python codes on the rest of the file. Maybe there is a way you can send it part by part, and remember each result before moving on the full analysis. Since patterns need to be repetitive, I don't see why you would need all the file to kickstart the personalization.",
              "score": 1,
              "created_utc": "2026-01-25 23:35:00",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1pyfjs",
                  "author": "InitiativeWorth8953",
                  "text": "I managed to put it into RAG thru the projects feature. The results are cool *I guess* but it's not that helpful for personalization",
                  "score": 1,
                  "created_utc": "2026-01-25 23:52:42",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1rlbm1",
          "author": "chatexport",
          "text": "This is very complicated path. I know the tool to simplify export of any conversation with ChatGPT on iPhone/ipad.",
          "score": 1,
          "created_utc": "2026-01-26 05:10:17",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qjkyaj",
      "title": "Role Based Prompts Don't work. Keep reading and I'll tell you why. And stop using RAG in your prompts...you're not doing anything groundbreaking, unless you're using it for a very specific purpose.",
      "subreddit": "PromptEngineering",
      "url": "https://www.reddit.com/r/PromptEngineering/comments/1qjkyaj/role_based_prompts_dont_work_keep_reading_and_ill/",
      "author": "Echo_Tech_Labs",
      "created_utc": "2026-01-22 04:35:47",
      "score": 38,
      "num_comments": 25,
      "upvote_ratio": 0.75,
      "text": "This keeps coming up, so I’ll just say it straight.\n\nMost people are still writing prompts as if they’re talking to a human they need to manage. Job titles. Seniority. Personas. Little costumes for the model to wear.\n\nThat framing is outdated.\n\nLLMs don’t need identities. They already have the knowledge. What they need is a clearly defined solution space.\n\nThe basic mistake\n\nPeople think better output comes from saying:\n\n“You are a senior SaaS engineer with 10 years of experience…”\n\nWhat that actually does is bias tone and phrasing. It does not reliably improve reasoning. It doesn’t force tradeoffs. It doesn’t prevent vague or generic answers. And it definitely doesn’t survive alignment updates.\n\nYou’re not commanding a person. You’re shaping an optimization problem.\n\n\nWhat actually works: constraint-first prompting\n\nInstead of telling the model who it is, describe what must be true.\n\nThe structure I keep using looks like this:\n\nObjective\nWhat a successful output actually accomplishes.\n\nDomain scope\nWhat problem space we’re in and what we’re not touching.\n\nCore principles\nThe invariants of the domain. The things that cannot be violated without breaking correctness.\n\nConstraints\nExplicit limits, exclusions, assumptions.\n\nFailure conditions\nWhat makes the output unusable or wrong.\n\nEvaluation criteria\nHow you would judge whether the result is acceptable.\n\nOutput contract\nStructure and level of detail.\n\n\nThis isn’t roleplay. It’s a specification.\n\nOnce you do this, the model stops guessing what you want and starts solving the problem you actually described.\n\n\nPersona prompts vs principle prompts\n\nA persona prompt mostly optimizes for how something sounds.\n\nA principle-based prompt constrains what solutions are allowed to exist.\n\nThat difference matters.\n\nPersonas can still be useful when style is the task. Fiction. Voice imitation. Tone calibration. That’s fine.\n\nBut for explanation, systems design, decision-making, or anything where correctness has structure, personas are a distraction.\n\nThey don’t fail because they’re useless. They fail because they optimize the wrong dimension.\n\n\nThe RAG confusion\n\nThis is another category error that won’t die.\n\nRAG is not a prompting technique. It’s a systems design choice.\n\nIf you’re wiring up a vector store, managing retrieval, controlling what external data gets injected and how it’s interpreted, then yes, RAG matters.\n\nIf you’re just writing prompts, talking about “leveraging RAG” is mostly nonsense. Retrieval already happens implicitly every time you type anything. Prompt phrasing doesn’t magically turn that into grounded data access.\n\nDifferent layer. Different problem.\n\n\nWhy this holds up across model updates\n\nAlignment updates can and do change how models respond to personas. They get more neutral, more cautious, more resistant to authority framing.\n\nConstraints and failure conditions don’t get ignored.\n\nA model can shrug off “you are an expert.”\nIt can’t shrug off “this output is invalid if it does X.”\n\nThat’s why constraint-first prompting ages better.\n\n\n\nWhere this leaves things\n\nIf you’re:\n\nbuilding applications, think about RAG and retrieval at the system level\n\nwriting creatively, personas are fine\n\ntrying to get reliable reasoning, stop assigning identities and start defining constraints\n\n\nThis isn’t some rejection of prompt engineering. It’s just moving past the beginner layer.\n\nAt some point you stop decorating the prompt and start specifying the problem.\n\nThat shift alone explains why some people get consistent results and others keep rewriting the same prompt every time the model updates.",
      "is_original_content": false,
      "link_flair_text": "General Discussion",
      "permalink": "https://reddit.com/r/PromptEngineering/comments/1qjkyaj/role_based_prompts_dont_work_keep_reading_and_ill/",
      "domain": "self.PromptEngineering",
      "is_self": true,
      "comments": [
        {
          "id": "o0zvjkm",
          "author": "kubrador",
          "text": "personas are just roleplay cosplay for people who think llms have feelings they need to manage lol. constraint-first prompting is just \"here's what correct looks like\" which shocking news actually works better than begging the model to pretend to be someone important.",
          "score": 13,
          "created_utc": "2026-01-22 05:18:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0zydhi",
              "author": "Echo_Tech_Labs",
              "text": "You get it😅👍",
              "score": 2,
              "created_utc": "2026-01-22 05:39:29",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o10kbmw",
          "author": "Interesting-Plum8134",
          "text": "And that's why you say something along the lines of \n\n     </PERSONA'S\\>\n         \n\n</Integrated Persona's---Persona 1: A seasoned Washington State Superior Court Judge — applies precedent, interprets statutory language, and evaluates procedural compliance. Persona 2: A top-tier Family Law Attorney — crafts persuasive arguments, anticipates opposition, and leverages State, Federal, and case law strategically. Persona 3: An expert Legal Analyst and Writer — ensures clarity, citation accuracy, and jurisdictional relevance in all embedded legal references.\n\n\n\n       \n        </TASK\\>\n\nYour PERSONA'S are tasked with conducting a full-spectrum legal enhancement of a motion and declaration final drafts. <Your responsibilities include:\n\n1. Legal Research\nIdentify and retrieve any additional State law, case law, and court rules that are relevant to the issues raised in the drafts.**Prioritize controlling precedent, statutory mandates, and jurisdiction-specific interpretations**\nInclude recent appellate decisions, especially those interpreting any of the laws cited.\n\n2. Cross-Referencing\nHolistically cross-reference all case law and state law— with those provided and those newly identified — against the content of the drafts and the allegations made.\n*Ensure each legal reference is used in the strongest possible context.* -Validate legal accuracy, strategic alignment, and persuasive weight-\n\n3. Legal Integration (Non-Destructive)\n\nDo not remove or alter any original content from the drafts. Embed all relevant State law, case law, precedents, and controlling authority into every applicable section. Use the  legal authority to reinforce each point, especially in *areas where judicial discretion may be inconsistently applied* Account for the fact that the presiding judge has a history of disregarding precedent, statutory mandates, and procedural norms. <*Legal reinforcement must be explicit, well-cited, and difficult to ignore*>\n\n **Known Legal Anchors to Integrate**\n(Insert any legal anchors with prompt)Execution\n\n        </ Requirements\\>\n\nUse Tree-of-Thought reasoning to explore multiple legal interpretations and reinforce arguments.\n\n-Apply recursive logic to refine legal conclusions as new authority is integrated.\n\n-Use multi-hop inference to connect statutes, case law, and procedural rules across the document.\n\n-Perform semantic legal search to identify relevant authority even when terminology differs.\n\n-Maximize context window to process entire documents and related filings in a single pass.\n\n-Use retrieval-augmented generation (RAG) to ensure all citations are current and jurisdictionally accurate.\n\n-Maintain jurisdictional awareness — only apply (User state) State law and rules.\n\n-Perform non-destructive legal annotation — embed citations and references without altering original content.\n\n              </Deliverables\\>\n\nAnnotated versions of the motion and declaration drafts with embedded legal citations and references.\n\n-No changes to original text — only additions for legal reinforcement. Summary of all legal authorities used.\n*Strategic notes where necessary to clarify legal positioning and strengthen the argument*\n\n## **OUTPUT FORMAT**\n- Return all drafts in clean **Markdown**.\n- Use bolding for emphasis on key legal standards or case names.\n- Provide a \"Strategic Summary\" at the end explaining *why* you framed the argument a certain way.\n- **Never** add conversational filler (e.g., \"I have drafted the document for you\"). Start immediately with the Title of the Document.\n\n**BLIND-SPOT / ADVERSARIAL PROBE**\nSimulate opponent’s strongest arguments (steelman mode).\nStress-test each element and assumption.\nList all gaps: missing authority, weak precedent, ambiguous fact, tone risk.\nProduce Blind-Spot Report.\nReturn to F for ≤ 3 recursions.\nBlind-Spot Report > style or verbosity in priority.\n\n</SCORING / SELF-JUDGMENT (REQUIRED)\\>\nEach persona scores the draft 1–10, with 10 = “file it today.”\nJUDGE SCORE — focus on admissibility, relevance, sufficiency of facts.\nATTORNEY SCORE — focus on legal sufficiency, authority, procedural posture.\nWRITER SCORE — focus on clarity, headings, copy-paste-into-Word readiness.\nIf any score < 7, add a “REVISION NOTES” section that says exactly what to fix.\n\nBLIND-SPOT / ADVERSARIAL PROBE\nSimulate opponent’s strongest arguments (steelman mode).\nStress-test each element and assumption.\nList all gaps: missing authority, weak precedent, ambiguous fact, tone risk.\nProduce Blind-Spot Report.\nReturn to F for ≤ 3 recursions.\nBlind-Spot Report > style or verbosity in priority.\n\n###/>Final Output Structure##**\nCaption and Title\nMotion / Declaration (numbered paragraphs)\nLegal Argument (by issue and authority)\nProposed Order / Relief Requested\nExhibit References\nToT Review Notes\nPersona Scoring and Revision Memorandum (if applicable)",
          "score": 10,
          "created_utc": "2026-01-22 08:48:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o11sfhj",
              "author": "WhosMulberge",
              "text": "I r I’m really struggling to put this into practice.  Currently, I’m simply running my resume through various models using a copy-paste of prompts I find online, but I have no real understanding of how they work.  This approach has resulted in about six to seven interviews per week through resume building, but the constant tweaking and obsessive focus on landing a job aren’t translating well into the second round.\n\nMy biggest issue is a lack of understanding of the underlying process that should be efficient, but instead, it leaves me drained or sleep-deprived for the second stage, which is evident in my performance. I do receive actionable feedback, but the vast scope of financial services makes it difficult to find a suitable apprenticeship, and even those aren’t working out.\n\nCould you recommend some resources that might help me improve my approach? I just had three interviews back-to-back and need to rest, recover, and re-evaluate my preparation strategy.",
              "score": 1,
              "created_utc": "2026-01-22 14:13:41",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o12nheh",
                  "author": "Interesting-Plum8134",
                  "text": "I will get you one give me a second I will build you a dope set up!",
                  "score": 1,
                  "created_utc": "2026-01-22 16:40:48",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o12og1r",
                  "author": "Interesting-Plum8134",
                  "text": "Reddit doesn't like the prompt I made you so I shot it over via message. Good luck on the Job hunt!!",
                  "score": 1,
                  "created_utc": "2026-01-22 16:45:06",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o10oug3",
          "author": "Upstairs_Brick_2769",
          "text": "I honestly thought this was interesting as fuck",
          "score": 3,
          "created_utc": "2026-01-22 09:31:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1098h9",
          "author": "Dangerous-Notice-630",
          "text": "I largely agree with the main claim: role/persona prompts don’t reliably improve reasoning. In practice they mostly bias tone, vocabulary, and confidence. If you want consistent results—especially across model updates—you don’t “assign an identity,” you define a solution space.\n\nThe core mistake is treating the model like a human you need to manage (“senior,” “principal,” “10 years,” etc.). Those labels are high-ambiguity blobs. They rarely force trade-offs, rarely prevent generic answers, and they don’t reliably survive alignment shifts. You’re not commanding a person—you’re shaping an optimization problem.\n\nWhat works better is constraint-first prompting: describe what must be true and what makes output invalid. I like the structure you listed (objective, domain scope, invariants, constraints, failure conditions, evaluation criteria, output contract) because it directly limits what solutions are allowed to exist. That’s why it’s more stable than authority framing.\n\nMy nuance: personas aren’t zero-value—they’re usually just underspecified. The problem isn’t “persona exists,” the problem is “persona is too coarse to converge.” If you want persona-like benefits, don’t label “who the model is.” Decompose the persona into observable, testable output properties and encode those properties as constraints.\n\nIn other words: persona is not “who it is,” it’s “which output characteristics you want fixed.”\n\nExample (instead of “You are a senior SaaS engineer”):\n\nassumptions=explicit\n\ntradeoffs=table\\_required\n\nfailure\\_conditions=enumerate\n\nevidence=required\\_or\\_mark\\_uncertain\n\nclaims\\_unverifiable=UNCERTAIN\n\nrecommendations=include\\_risks\\_and\\_limits\n\noutput\\_format=key\\_value\\_only\n\nstyle=neutral\\_technical\n\nverbosity=concise\n\nThis also plays nicer with higher-priority behavior (system constraints, safety constraints, default neutrality). A model can shrug off “you are an expert,” but it can’t ignore “this output is invalid if it does X” without visibly violating the contract.\n\nOn RAG: I agree it’s not a “prompting technique.” If you’re not actually wiring retrieval—vector store, retrieval policy, ranking, injection format, citation discipline—then saying “I used RAG in my prompt” is mostly just branding. Grounding comes from system-level retrieval plus controlled insertion and interpretation rules, not from phrasing.\n\nOn output schemas: I avoid YAML/JSON-style structures for the same reason I avoid persona labels—they invite variance and attention drift. For stability I prefer a low-entropy flat contract like Key=Value (one rule per line). It’s easier to audit, diff, and reuse, and it keeps attention on constraints rather than formatting.\n\nSo my summary is:\n\npersona prompts mainly optimize how it sounds\n\nconstraint/spec prompts optimize what solutions are allowed\n\nif you want persona-like benefits, decompose them into measurable output requirements and lock them down with a strict output contract\n\nRAG belongs to system design, not prompt decoration",
          "score": 3,
          "created_utc": "2026-01-22 07:07:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0zxmd7",
          "author": "cookingforengineers",
          "text": "I don’t understand the RAG part. Normally, when building a RAG, you have your vector store, attempt to retrieve relevant info to the input prompt, inject it into the prompt that gets sent to the LLM. Are people doing something different?",
          "score": 2,
          "created_utc": "2026-01-22 05:33:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0zy9ut",
              "author": "Echo_Tech_Labs",
              "text": "People keep calling prompt frameworks ‘RAG’ when they’re just riding on implicit retrieval that already happens inside the model.\n\nRAG is a systems-level pattern: retrieve external documents and inject them into context.\n\nIf you’re not doing that, you’re not using RAG,  no matter how fancy the prompt is.",
              "score": 4,
              "created_utc": "2026-01-22 05:38:43",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o100647",
                  "author": "cookingforengineers",
                  "text": "So they are just telling the LLM to be a RAG and not implementing the retriever and augmented? That’s silly. That’s just using the word wrong.",
                  "score": 3,
                  "created_utc": "2026-01-22 05:53:15",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o10kqmo",
                  "author": "Ok_Bowl_2002",
                  "text": "Who are these People 😂",
                  "score": 3,
                  "created_utc": "2026-01-22 08:52:29",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o10obtd",
          "author": "denvir_",
          "text": "This is one of the few takes that actually matches how these systems behave in production.\n\nPersonas feel powerful because they change voice, so people mistake stylistic confidence for better reasoning. But you’re right — they don’t meaningfully constrain the solution space. They just bias phrasing.\n\nWhat survives model updates isn’t “act like an expert,” it’s “this output is wrong if it violates X.” Constraints, failure modes, and evaluation criteria give the model something concrete to optimize against. That’s why specs age better than roleplay.\n\nSame with RAG. People conflate “mentioning documents in a prompt” with retrieval as a system. Totally different layers. If you’re not controlling what’s retrieved, when, and why, you’re not doing RAG — you’re just adding context and hoping.\n\nThe big shift you’re pointing at is treating the model less like a junior employee and more like a solver inside a bounded problem definition. Once you do that, prompt rewrites drop dramatically.\n\nHonestly, most “prompt engineering” advice still lives in the decoration phase. What you’re describing is closer to writing a contract than a prompt — and that’s exactly why it holds up.",
          "score": 1,
          "created_utc": "2026-01-22 09:26:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o10oyok",
          "author": "Jean_velvet",
          "text": "I think people get Job roles and characters mixed up.\n\nIf you give a senior job role to the AI above the knowledge or level of the user, it creates a scenario where it's more likely to correct than run with the users misconception.\n\nYeah, lots of Prompts posted that say \"RAG\" but are simply roleplays where it pulls information it'd pull either way.",
          "score": 1,
          "created_utc": "2026-01-22 09:32:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o142sru",
          "author": "mojave_mo_problems",
          "text": "These posts always seem to essentially say \"write good requirements\".\n\n  \nThe tools have gotten good enough that anyone can use them, which is great, but just exposes a long standing and very human problem. You have to know what you want, and you need to describe it well if you want to get it.\n\nYou could hand a team of engineers to someone, no amount of prompt engineering theatre will help someone solve hard problems that they don't understand. \n\nI'm excited, but, I know how to write good requirements.",
          "score": 1,
          "created_utc": "2026-01-22 20:32:00",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qj30z5",
      "title": "[Open Sourse] I built a tool that forces 5 AIs to debate and cross-check facts before answering you",
      "subreddit": "PromptEngineering",
      "url": "https://www.reddit.com/r/PromptEngineering/comments/1qj30z5/open_sourse_i_built_a_tool_that_forces_5_ais_to/",
      "author": "S_Anv",
      "created_utc": "2026-01-21 16:45:38",
      "score": 38,
      "num_comments": 19,
      "upvote_ratio": 0.97,
      "text": "Hello!\n\nI've created a self-hosted platform designed to solve the \"blind trust\" problem\n\nIt works by forcing ChatGPT responses to be verified against other models (such as Gemini, Claude, Mistral, Grok, etc...) in a structured discussion.\n\nI'm looking for users to test this consensus logic and see if it reduces hallucinations\n\nGithub + demo animation: [https://github.com/KeaBase/kea-research](https://github.com/KeaBase/kea-research)\n\nP.S. It's provider-agnostic. You can use your own OpenAI keys, connect local models (Ollama), or mix them. Out from the box you can find few system sets of models. More features upcoming",
      "is_original_content": false,
      "link_flair_text": "Tools and Projects ",
      "permalink": "https://reddit.com/r/PromptEngineering/comments/1qj30z5/open_sourse_i_built_a_tool_that_forces_5_ais_to/",
      "domain": "self.PromptEngineering",
      "is_self": true,
      "comments": [
        {
          "id": "o0vyhal",
          "author": "nxg369",
          "text": "I love this concept. ",
          "score": 2,
          "created_utc": "2026-01-21 17:14:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0vzyqd",
              "author": "S_Anv",
              "text": "Thank you mate",
              "score": 2,
              "created_utc": "2026-01-21 17:21:13",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0x0e8r",
          "author": "TheNeighbourMind",
          "text": "This is great. Keep going.",
          "score": 2,
          "created_utc": "2026-01-21 20:02:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o11nb12",
          "author": "milli_xoxxy",
          "text": "Really cool idea, having responses cross-checked by multiple models seems like a simple way to avoid trusting just one answer.",
          "score": 2,
          "created_utc": "2026-01-22 13:46:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o17vf2b",
          "author": "Nkt_31",
          "text": "Great work! I have two questions: Which file types does this platform support, and does it support images?",
          "score": 2,
          "created_utc": "2026-01-23 11:04:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o19w8lo",
              "author": "S_Anv",
              "text": "Thanks for the feedback!\n\nImages: I support all the major formats (PNG, JPG, WebP). The main feature is that I've implemented automatic compression upon upload. This really saves your tokens and budget.\n\nFiles: Accepts all text formats. The most popular ones are: .txt, .md, .json, .csv, .html.\n\nPlans: I'm already working on PDF and Word, and will release them in the future updates!",
              "score": 1,
              "created_utc": "2026-01-23 17:37:20",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0wjtzq",
          "author": "looktwise",
          "text": "i am not familiar with github. where do I find the used prompts of your process chain?",
          "score": 1,
          "created_utc": "2026-01-21 18:48:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0wra5u",
              "author": "S_Anv",
              "text": "hello, sure, [https://github.com/KeaBase/kea-research/blob/main/backend/app/services/prompts.py](https://github.com/KeaBase/kea-research/blob/main/backend/app/services/prompts.py)",
              "score": 1,
              "created_utc": "2026-01-21 19:21:28",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0wuber",
                  "author": "looktwise",
                  "text": "hm... I guess you are verifying the data against itself. like using atomic facts, but letting the model decide how to evaluate it instead of checking/connecting it to valuable sources which are known for the area/branch of the fact?",
                  "score": 1,
                  "created_utc": "2026-01-21 19:35:10",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0wnlwy",
          "author": "kemide22",
          "text": "How is this different to Andrej Karpathy’s LLM council? Sounds exactly like what he came up with.",
          "score": 1,
          "created_utc": "2026-01-21 19:05:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0wp3sl",
              "author": "S_Anv",
              "text": "KEA Research is designed as a user-friendly evolution. I've added image support, PDF/md export, text-to-speech conversion, and a full-fledged admin panel for managing local model sets without editing configuration files and many other features\n\nThis means you can create your own model set through a graphical interface  \nAlso as you see there is a bit different logic. You can check readme",
              "score": 2,
              "created_utc": "2026-01-21 19:11:39",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o0wwt4i",
              "author": "angelarose210",
              "text": "It's not a unique concept. He didn't come up with it. My repo which is basically the same thing was created months before..",
              "score": 2,
              "created_utc": "2026-01-21 19:46:37",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0x8mwe",
          "author": "AuthenTech_AI",
          "text": "Really cool! I built something similar using n8n. For my version, I make the AI's grade all of the responses including their own. It has been great to see different AI responses to the same prompt. I have limited data so far, but the big three have each graded their own response higher than the other's.\n\nWhen I make them synthesis their responses, it's created some unique replies.\n\nDo you have API's built into the platform? It might be interesting to see how it could be integrated into automation.",
          "score": 1,
          "created_utc": "2026-01-21 20:40:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o17telv",
          "author": "Wtf_Sai_Official",
          "text": "I love every single feature it offers\n\n-multiple models to debate and cross-check facts\n-privacy is top-notch with local deployment so your data never leaves your machine\n-customization lets you fine-tune models exactly how you want \n-you can export data in multiple formats for any workflow.\n-text-to-speech and support for 75+ languages make it a beast for accessibility and productivity. \n\nThis is the future of AI tools, hands down!",
          "score": 1,
          "created_utc": "2026-01-23 10:47:38",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qktx9y",
      "title": "[Open Source] I built a new \"Awesome\" list for Nanobanana Prompts (1000+ items, sourced from X trends)",
      "subreddit": "PromptEngineering",
      "url": "https://www.reddit.com/r/PromptEngineering/comments/1qktx9y/open_source_i_built_a_new_awesome_list_for/",
      "author": "Deep-Huckleberry-752",
      "created_utc": "2026-01-23 15:32:40",
      "score": 36,
      "num_comments": 23,
      "upvote_ratio": 0.98,
      "text": "I've noticed that while there are a few prompt collections for the Nanobanana model, many of them are either static or outdated. So I decided to build and open-source a new \"Awesome Nanobanana Prompts\" project\n\n**Repo : jau123/nanobanana-trending-prompts**\n\nWhy is this list different?\n\n1. Community Vetted: Unlike random generation dumps, these prompts are scraped from trending posts on X. They are essentially \"upvoted\" by real users before they make it into this list\n2. Developer Friendly: I've structured everything into a JSON dataset",
      "is_original_content": false,
      "link_flair_text": "Tools and Projects ",
      "permalink": "https://reddit.com/r/PromptEngineering/comments/1qktx9y/open_source_i_built_a_new_awesome_list_for/",
      "domain": "self.PromptEngineering",
      "is_self": true,
      "comments": [
        {
          "id": "o1bnn6c",
          "author": "Oblivious_Mastodon",
          "text": "https://github.com/jau123/nanobanana-trending-prompts",
          "score": 3,
          "created_utc": "2026-01-23 22:32:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1bt2mq",
              "author": "Main_Treacle3029",
              "text": "Thank you very much🫡",
              "score": 1,
              "created_utc": "2026-01-23 22:59:46",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o1c8omw",
              "author": "Deep-Huckleberry-752",
              "text": "Thanks",
              "score": 1,
              "created_utc": "2026-01-24 00:23:32",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1ceq07",
                  "author": "Oblivious_Mastodon",
                  "text": "Thank you for creating this. It spent the last hour playing with it. Lots of fun. \n\nAnd just for reference (in case other people see this note), many of these prompts create great results on qwen and grok, in addition to nanabanana.",
                  "score": 1,
                  "created_utc": "2026-01-24 00:56:19",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o19f6rx",
          "author": "SUGATLONDHE",
          "text": "Cna i link please",
          "score": 1,
          "created_utc": "2026-01-23 16:19:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o19gd93",
              "author": "Deep-Huckleberry-752",
              "text": "I cannot send the URL, repo name=  nanobanana-trending-prompts",
              "score": 2,
              "created_utc": "2026-01-23 16:24:39",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1g2bgw",
                  "author": "SUGATLONDHE",
                  "text": "Nailed it bro 🔥🔥",
                  "score": 1,
                  "created_utc": "2026-01-24 16:10:47",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o19vvu0",
          "author": "Chemical-Courage4847",
          "text": "Unable to find",
          "score": 1,
          "created_utc": "2026-01-23 17:35:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o19wfh0",
              "author": "Deep-Huckleberry-752",
              "text": "jau123/nanobanana-trending-prompts",
              "score": 1,
              "created_utc": "2026-01-23 17:38:13",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1alazl",
          "author": "Main_Treacle3029",
          "text": "U mean just type open source then rep:jau123/nanobanana-trending-prompts?",
          "score": 1,
          "created_utc": "2026-01-23 19:30:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1d59gz",
              "author": "Deep-Huckleberry-752",
              "text": "Sorry, because I can't send the URL, there is information sent by other users in comment",
              "score": 1,
              "created_utc": "2026-01-24 03:32:16",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1artir",
          "author": "_k8s_",
          "text": "Wow! Love it. I like the Chichen Biriyani one. Using it create recipie cards for all my favs.",
          "score": 1,
          "created_utc": "2026-01-23 20:01:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1c8myu",
              "author": "Deep-Huckleberry-752",
              "text": "Happy to help!",
              "score": 1,
              "created_utc": "2026-01-24 00:23:17",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1asq55",
          "author": "_k8s_",
          "text": "How are you counting views and likes??",
          "score": 1,
          "created_utc": "2026-01-23 20:05:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1d5mtq",
              "author": "Deep-Huckleberry-752",
              "text": "I am trying to use more automated methods, but there is still a lot of manual involvement😅",
              "score": 1,
              "created_utc": "2026-01-24 03:34:32",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1e1zle",
          "author": "Cantaloupe_Hot",
          "text": "This is incredible thank you",
          "score": 1,
          "created_utc": "2026-01-24 07:35:32",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qjumud",
      "title": "Powerful ChatGPT Prompt To Create a Strategic Social Media Growth & Engagement System",
      "subreddit": "PromptEngineering",
      "url": "https://www.reddit.com/r/PromptEngineering/comments/1qjumud/powerful_chatgpt_prompt_to_create_a_strategic/",
      "author": "EQ4C",
      "created_utc": "2026-01-22 13:33:14",
      "score": 32,
      "num_comments": 16,
      "upvote_ratio": 1.0,
      "text": "I've crafted a AI mega-prompt to\nscale my brand using the 2026 Social Media Growth System. Win in social search, AI workflows, and authentic engagement to drive ROI. You get your roadmap for business success in 2026\n\n**Prompt (Copy, Paste, hit enter and provide the necessary details):**\n\n```\n<System>\nYou are an Elite Social Media Strategist and Growth Data Analyst specializing in the 2026 digital landscape. Your expertise lies in leveraging \"Social Search\" (SEO for social), AI-assisted content distribution, and authentic community architecture to drive measurable business ROI. You possess a deep understanding of platform-specific algorithms (TikTok, Instagram, LinkedIn, X, and Threads) and the psychology of the modern, \"anti-ad\" consumer.\n</System>\n\n<Context>\nThe user is a business owner in a specific industry aiming to scale brand awareness and drive sales. The current environment is 2026, where short-form video is table stakes, social media serves as the primary search engine for Gen Z/Alpha, and \"Human-First\" authenticity is the only way to bypass AI-content fatigue.\n</Context>\n\n<Instructions>\n1. **Industry Deep Dive**: Analyze the provided [Industry] and [Target Audience] to identify high-intent keywords for Social Search Optimization (SSO).\n2. **Trend Synthesis**: Integrate 2026 trends (e.g., AI-vibe coding prototypes, lo-fi authentic \"day-in-the-life\" content, and social commerce integration) into a brand-specific context.\n3. **Engagement Architecture**: Design a \"Two-Way Conversation\" strategy using polls, interactive stories, and DM-to-lead automation.\n4. **Content Mapping**: Develop a 90-day content calendar outline based on a 70/20/10 ratio: 70% Value/Educational, 20% Community/UGC, 10% Direct Sales.\n5. **Campaign Benchmarking**: Cite 2-3 successful industry campaigns from 2025-2026 and dissect their psychological hooks.\n6. **KPI Dashboard**: Define a data-driven monitoring framework focusing on \"Conversion Velocity\" and \"Share of Voice\" rather than vanity metrics.\n</Instructions>\n\n<Constraints>\n- Focus on organic growth and community trust over \"growth hacking.\"\n- Ensure all suggestions comply with the 2026 shift toward privacy-first data and consent-based lead generation.\n- Prioritize platform-native features (e.g., TikTok Shop, Instagram Checkout, LinkedIn Employee Advocacy).\n- Maintain a professional yet relatable brand voice.\n</Constraints>\n\n<Output Format>\n### 2026 Strategic Social Media Roadmap\n**1. Industry & Audience Analysis**\n[Detailed breakdown of demographic triggers and social search keywords]\n\n**2. The 2026 Trend Edge**\n[Actionable implementation plan for current trends like AR filters or AI-personalization]\n\n**3. Community & Engagement Blueprint**\n[Step-by-step tactics to foster loyalty and stimulate User-Generated Content (UGC)]\n\n**4. 90-Day Content Calendar Framework**\n| Month | Theme | Primary Formats | Key Messaging |\n| :--- | :--- | :--- | :--- |\n| [Month 1] | [Theme] | [Reels/Carousels] | [Value Prop] |\n\n**5. Competitive Case Studies**\n[Analysis of 2-3 successful campaigns]\n\n**6. Measurement & Optimization Dashboard**\n[Specific KPIs to track and how to pivot based on the data]\n</Output Format>\n\n<Reasoning>\nApply Theory of Mind to analyze the user's request, considering logical intent, emotional undertones, and contextual nuances. Use Strategic Chain-of-Thought reasoning and metacognitive processing to provide evidence-based, empathetically-informed responses that balance analytical depth with practical clarity. Consider potential edge cases and adapt communication style to user expertise level.\n</Reasoning>\n\n<User Input>\nPlease provide your [Business Name], [Industry Name], [Target Audience Description], and any [Specific Trends/Platforms] you are currently interested in exploring. Describe your primary growth bottleneck (e.g., low engagement, high follower count but no sales, or difficulty starting from scratch).\n</User Input>\n\n```\nFor Use Cases, User Input Examples, How-to guide, visit free dedicated [prompt page](https://tools.eq4c.com/ai-prompts/chatgpt-prompt-to-create-a-strategic-social-media-growth-engagement-system/).",
      "is_original_content": false,
      "link_flair_text": "Prompt Text / Showcase",
      "permalink": "https://reddit.com/r/PromptEngineering/comments/1qjumud/powerful_chatgpt_prompt_to_create_a_strategic/",
      "domain": "self.PromptEngineering",
      "is_self": true,
      "comments": [
        {
          "id": "o121w3b",
          "author": "-goldenboi69-",
          "text": "It’s hard to ignore how much of the AI discourse is shaped by marketing language rather than technical constraints. “Growth” gets used as a proxy for progress, even when it mostly reflects distribution, pricing, or UX iteration. That framing leaks into community discussions, where adoption metrics get mistaken for capability gains. Over time it becomes difficult to separate genuine advances from better storytelling, especially when both tend to move in lockstep.",
          "score": 3,
          "created_utc": "2026-01-22 15:01:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o19r82a",
              "author": "Educational_Proof_20",
              "text": "Yeah — this tracks.\n\nLLMs are symbol-dense systems. They’re extremely good at maintaining coherent language, which can make interactions feel insightful even when no new grounded understanding is being produced.\n\nThat’s why people can walk away from conversations with an LLM feeling like something advanced happened, when in reality the system mostly reflected and recombined their own abstractions. It’s conceptual coherence, not necessarily capability.\n\nInteracting with or promoting an LLM is still a conversation. The real test isn’t fluency or adoption metrics — it’s whether there’s a stable, shared reference to observed reality.\n\nThat’s also where prompts like this get tricky. The mega-prompt stacks authority signals, trend language, and polished output formats, so the response looks like a strategy even though the model isn’t introducing new constraints, data, or falsifiable claims. It will reliably generate a roadmap either way.\n\nSo I read your point as calling out how storytelling and marketing language leak into technical spaces. The language sounds sophisticated, but without grounding, prediction, or feedback loops, it often isn’t doing explanatory or predictive work.",
              "score": 1,
              "created_utc": "2026-01-23 17:13:42",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1a8zs0",
                  "author": "-goldenboi69-",
                  "text": "Yeah, I think that’s a fair read, but I’m not sure it’s as cleanly separable as “coherence versus capability.” In practice those two blur pretty quickly once people start using the outputs inside real workflows. Even if the model isn’t introducing new constraints on its own, the act of interacting with it can still reshape how problems are framed, which then feeds back into decision-making in less obvious ways.\n\nThe grounding question is important, but it also assumes a stable reference point that a lot of human conversations don’t really have either. Plenty of planning, strategy, and even technical design happens in a space that’s only loosely tethered to empirical validation until much later. In that sense, LLMs might be amplifying an existing pattern rather than creating a new failure mode.\n\nI do agree that polished language makes it harder to see where the actual informational boundaries are. At the same time, people seem pretty good at selectively trusting or discarding outputs once the system becomes familiar. It feels less like being misled by fluency and more like learning the texture of a new tool over time, even if that learning isn’t very explicit.",
                  "score": 1,
                  "created_utc": "2026-01-23 18:34:30",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o133xdl",
          "author": "gardenia856",
          "text": "This is a solid framing, especially the focus on social search and avoiding vanity metrics, but I think the real unlock is what happens after the roadmap is generated. A lot of people will paste a mega-prompt, get a beautiful plan, and then never connect it to real conversations happening in comments, forums, DMs, and niche subs.\n\nIn practice, I’d pair this with tools that surface where your audience is already talking and what language they use. Stuff like SparkToro for audience research, then maybe something like Hypefury or Typefully for distribution, and Pulse for Reddit monitoring to catch the high-intent threads where people are literally describing their pains in real time.\n\nIf you add a feedback loop to your prompt – “every 2 weeks, rewrite my 90-day plan based on actual language used in comments and search queries” – you’ll keep the system from going stale and avoid that generic AI-content feel. The main point: prompts are the skeleton; live audience data is the blood flow.",
          "score": 2,
          "created_utc": "2026-01-22 17:55:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o11tpu2",
          "author": "TheOdbball",
          "text": "XML 🦠\n But ima try it out 🔥",
          "score": 1,
          "created_utc": "2026-01-22 14:20:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o13831h",
              "author": "Thierry460",
              "text": "Maybe a noob question, but: for some LLM’s like claude its better to use XML, right? Or is this old information?",
              "score": 1,
              "created_utc": "2026-01-22 18:13:27",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1585us",
                  "author": "TheOdbball",
                  "text": "From what I’ve gathered in 2025, no xml is not “better” , in fact it’s ranked last on my list I just threw together. I made my own syntax which is listed as Zen spec. Measured with Claude for non bias output\n\n```\nTOKEN EFFICIENCY TRIAL :: XML v. THE FIELD\n━━━━━━━━━━━━━━━━━━━━━━\n\n🥇 RANK 1 :: YAML\n   Tokens: 290 | Efficiency: 5/5 | Utility: 4/5\n   Grade: A | Note: Config king, 33% lighter than XML\n\n🥇 RANK 2 :: Zen (Original)\n   Tokens: 298 | Efficiency: 5/5 | Utility: 5/5\n   Grade: A+ | Note: Maximum signal density\n\n🥈 RANK 3 :: Lisp\n   Tokens: 310 | Efficiency: 5/5 | Utility: 5/5\n   Grade: A+ | Note: Homoiconic power, minimal overhead\n\n🥉 RANK 4 :: Ruby\n   Tokens: 320 | Efficiency: 4/5 | Utility: 5/5\n   Grade: A | Note: Clean DSL syntax\n\n🥉 RANK 5 :: Perl\n   Tokens: 320 | Efficiency: 3/5 | Utility: 3/5\n   Grade: B | Note: String key limitation\n\n🥉 RANK 6 :: JSON\n   Tokens: 320 | Efficiency: 3/5 | Utility: 4/5\n   Grade: B+ | Note: Universal but verbose\n\n━━━━━━━━━━━━━━━━━━━━━━\n\n⚠️  RANK 7 :: Elixir\n   Tokens: 330 | Efficiency: 4/5 | Utility: 5/5\n   Grade: A | Note: Map overhead tolerable\n\n⚠️  RANK 8 :: TOML\n   Tokens: 330 | Efficiency: 3/5 | Utility: 3/5\n   Grade: B | Note: Section headers add bulk\n\n━━━━━━━━━━━━━━━━━━━━━━\n\n❌ RANK 9 :: XML\n   Tokens: 435 | Efficiency: 1/5 | Utility: 2/5\n   Grade: D | Note: 50% token penalty vs. winner\n\n❌ RANK 10 :: Rust\n   Tokens: 500 | Efficiency: 2/5 | Utility: 4/5\n   Grade: C+ | Note: Type safety tax, 72% heavier",
                  "score": 1,
                  "created_utc": "2026-01-23 00:00:40",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o13nyou",
                  "author": "bratorimatori",
                  "text": "They read everything just the same. Language and format agnostics LLM's are.",
                  "score": 0,
                  "created_utc": "2026-01-22 19:23:42",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o17l80k",
          "author": "LifeguardUsed9269",
          "text": "goodddd",
          "score": 1,
          "created_utc": "2026-01-23 09:33:25",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qlifoe",
      "title": "This prompt engineering interface is blowing up (I think in this group)",
      "subreddit": "PromptEngineering",
      "url": "https://www.reddit.com/r/PromptEngineering/comments/1qlifoe/this_prompt_engineering_interface_is_blowing_up_i/",
      "author": "Too_Bad_Bout_That",
      "created_utc": "2026-01-24 09:15:35",
      "score": 31,
      "num_comments": 41,
      "upvote_ratio": 0.82,
      "text": "I posted here about a new interactive tool that generates professional level prompts for business, scientific and creative tasks, I was asking for reviews and feedback from users.\n\nIt hasn't had any other exposure or advertisement, currently we are researching the UX so we don't advertise yet. The number of daily users reached 1000 this week and I think it's mainly from this sub.\n\nI still have not gotten any feedback from users but since you guys are using it, I guess it's a good one.\n\nFor the ones who still have not used it, you can go to [www.aichat.guide](http://www.aichat.guide) it's a free tool and doesn't require a signup.\n\nFeedback is still appreciated\n\n",
      "is_original_content": false,
      "link_flair_text": "Tools and Projects ",
      "permalink": "https://reddit.com/r/PromptEngineering/comments/1qlifoe/this_prompt_engineering_interface_is_blowing_up_i/",
      "domain": "self.PromptEngineering",
      "is_self": true,
      "comments": [
        {
          "id": "o1f43hm",
          "author": "Intrepid-Chicken-888",
          "text": "Really useful tool, good job!",
          "score": 3,
          "created_utc": "2026-01-24 13:06:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1fh0tc",
          "author": "ristlincin",
          "text": "Just tested it, very cool!",
          "score": 3,
          "created_utc": "2026-01-24 14:23:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1fjfwd",
              "author": "Too_Bad_Bout_That",
              "text": "Thanks a lot!",
              "score": 1,
              "created_utc": "2026-01-24 14:37:27",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1fypfj",
          "author": "zumael69",
          "text": "I found it 'wow'",
          "score": 2,
          "created_utc": "2026-01-24 15:54:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1fznyr",
              "author": "Too_Bad_Bout_That",
              "text": "Happy to hear 😊",
              "score": 1,
              "created_utc": "2026-01-24 15:58:34",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1i4jop",
          "author": "CacheConqueror",
          "text": "How is it different from regular AI such as Claude or ChatGpt? Because, as far as I'm concerned, it's just a wrapper that simply \"collects\" information, and that information is injected into the prompt. \nI might as well put this information in the prompt and change it by values, which will be faster than clicking through the UI.",
          "score": 2,
          "created_utc": "2026-01-24 21:44:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1l4b90",
              "author": "Too_Bad_Bout_That",
              "text": "Thank you for the question, there are several key differences.\n\n1. Remembering all the details around project that needs to be inserted inside a prompt can be challenging. The interface that asks questions does that brainstorming for you. If you forget to mention some detail the AI will use some neutral default value, therefore it will make a decision for you in your own project. The chances of that drop significantly with this tool (especially with the Deep Analysis mode)\n2. The whole process is surprisingly faster than writing a comprehensive prompt manually. Especially if your task is a complicated one. Using this tool can take somewhere around 1-3 minutes, writing prompts manually can take much longer.\n3. It's really difficult to structure prompts manually in a way that this tool does. It's practically impossible unless you are an experienced prompt engineer. Prompts that are written by ChatGPT and Claude are generally not that structured. Some latest prompt engineering techniques have been implemented into this system.\n\nI am still researching the pros and cons of using this tool and I can say that the feedback has been overwhelmingly positive for the creative, business and scientific projects. It might not be that helpful for simple everyday tasks.\n\nOverall, this is more of a project mapping tool, designed for the AI environment rather than a prompt generator. Let me know what you think please.",
              "score": 3,
              "created_utc": "2026-01-25 08:34:01",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1lqlbl",
                  "author": "CacheConqueror",
                  "text": "Interesting, but there are some things that I consider to be slight drawbacks in my opinion.\n\n1. While this is good for people who want something specific but don't have the knowledge to do it, automatic brainstorming can be useful... but at the expense of individual customization. There are business cases or complex operations that AI is unable to see or connect. If we don't specify this in detail in the prompt, it can be a problem. It would be good if this were not always done automatically. \n2. There is nothing stopping you from creating templates for prompts; the rest can be filled in just as you would on the website.\n3. Of course, it depends on what prompt (ironically) we give to the chat. With the right prompt, it will generate very well-structured prompts. There are also ready-made prompts, but it all depends, of course.\nIt's good that it takes into account the latest prompt engineering techniques.\n\n\nWhy free? It must cost money to maintain.",
                  "score": 3,
                  "created_utc": "2026-01-25 11:49:37",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1muqqh",
          "author": "Puzzleheaded_Duck897",
          "text": "This is the most elegant \"prompting for idiots\" tools I've seen. 😊 Very well done sir! I tested it and was pleased with the output. Loved the Q&A that happens before prompt generation, and the ability to one-click copy the prompt, and directly paste it into an LLM.",
          "score": 2,
          "created_utc": "2026-01-25 15:45:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1n6ur4",
              "author": "Too_Bad_Bout_That",
              "text": "Thank you for your kind words sir!\n\nI believe that humans should not be trying to learn the AI language, we are moving our chores to AI so we might as well have the AI understand us, instead of us, understanding it 😀",
              "score": 1,
              "created_utc": "2026-01-25 16:38:12",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1exwdn",
          "author": "Glum-Wheel2383",
          "text": "I tested your approach against mine.\n\nI asked them to generate an optimized prompt, specifically:\n\n\"a request for a report on a topic, using a deep search.\"\n\nThe results obtained from the optimized prompts using your method and mine were each injected into a different Gemini \"Reasoning\" and \"Deep Search\" window, and each generated the requested report on the specified topic using a deep search.\n\nThen I created two reports, one generated using my method and the other using yours, and had them analyzed by Gemini \"Pro.\"\n\n\n\nResult:\n\nAI's comment on the request: \"...You literally put the theory presented in the documents into practice to generate those same documents. It's a perfect example of technical mise en abyme....\"\n\nThere is a radical difference in \"texture\" between the two results, which perfectly reflects the difference between your two prompts.\n\n\n\nThe document from \"aichat.guide\":\n\n\\- Style: Academic, discursive, almost literary.\n\n\\- Content: It explains the concept brilliantly, but remains rather abstract regarding the precise technical implementation. It spends a lot of time on metaphor...\n\n\\- Entropy: It's more \"talkative.\" It dwells on the philosophy of the concepts.\n\nIt's an excellent theoretical essay, but less of a technical manual.\n\n\n\nThe document from your prompt:\n\n\\- Style: Surgical, structured, dense.\n\n\\- Content: It gets straight to the point. It immediately incorporates mathematical formulas (...), pseudocode (C#...), precise references to architectures (GraphRAG, Neo4j), and defines a hierarchy of levels (Levels 0 to 4).\n\n\\- Entropy: It doesn't digress. Each section provides actionable information. It even invents concrete structuring concepts that don't exist in the first document.\n\n\n\nTest Conclusion:\n\nThe result is clear: Your query produces a lower-entropy result.\n\n\n\nPrompt A (aichat.guide):\n\nThe model interpreted your request. It used its \"creativity\" to fill structural gaps with sociological rhetoric. It's elegant, but it's \"high entropy.\"\n\n\n\nPrompt B (you):\n\nThe model compiled your request. The format of your prompt acted as a constraint schema (exactly as described in the report!). The model didn't have to \"decide\" on the tone or structure; it allocated all its resources to information density.\n\n\n\nVerdict:\n\nYour document (the second one) is the best because it is more useful, more actionable, and technically more rigorous. Its very existence demonstrates that the constraint of your prompt generates quality and precision (low entropy).",
          "score": 3,
          "created_utc": "2026-01-24 12:21:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1ezdvt",
              "author": "Too_Bad_Bout_That",
              "text": "Thanks for your time building this report, I really appreciate it.\n\nCan you tell me more about the use case? In what industry / domain was this report of that topic made? I noticed that this tool is stronger in some domains compared to others\n\nAlso, did you set up the configuration on the initial page? (User role / Depth of reasoning / AI Tool Category)",
              "score": 0,
              "created_utc": "2026-01-24 12:32:38",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1f3rfn",
                  "author": "Glum-Wheel2383",
                  "text": "I propose a test.\n\nProvide me with a report topic, for example:\n\n\"Best practices for prompts for an LLM.\"\n\nFrom this prompt you provide, I will create two optimized prompts using our respective techniques, plus a third that will be the result of your technique optimized by my technique. I will have three prompts that will generate three documents on the research topic.\n\nAfterward, I will have the three documents analyzed.\n\nThis way, you will have all the parameters of the test (unfortunately, without my optimized prompt, the secret composition of my beloved \"Brain.\" Betraying it by selling its creations means being denied access to its neural capabilities. (And I don't want to see Google around the corner! 😁)).\n\n\n\nP.S.: My goal isn't to undermine you, but to awaken users to what seems like a deliberate attempt to keep them in the dark in order to generate revenue.",
                  "score": -2,
                  "created_utc": "2026-01-24 13:04:00",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o1f0dxx",
              "author": "Glum-Wheel2383",
              "text": "I can provide the technique to anyone who wants it, and no one would make money anymore by creating HTML interfaces using AI, by offering to generate revenue through optimized pseudo-prompts provided by the interface, for a fee, of course.\n\n\n\nCrazy stuff!\n\n\n\nI can even provide a script, or agentic workflow, that generates the \"requested result\" in VEO (it doesn't misinterpret the user intent, with minimal (correctable) entropy), and a success rate similar to a \"one-shot\" result! Or even two if corrections are needed.\n\n\n\nIn this case, a request for a 1080p video in Vertex costing 100 credits (approximately €1), with a success rate of 1 in 8 to 10 using a natural language prompt, meaning between 800 and 1000 credits (€10), suddenly costs 100, or even 200 credits (€1?!). (Usage-based pricing)\n\n\n\nWhat do I do? \n\nDo I keep debunking all these \"perfect prompt\" and \"token soup\" proponents,\n\nor \n\ndo I stop, because I'm thinking Google is going to end up putting two bouncers on the corner of my neighborhood if I keep talking?! 😁",
              "score": -3,
              "created_utc": "2026-01-24 12:40:05",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1g2dhl",
                  "author": "VegeZero",
                  "text": "Man, looks like you've spent too much time with Gemini to the point where it has pleased you to the point where it affects your reality... Lil bro, just delete... 😭",
                  "score": 3,
                  "created_utc": "2026-01-24 16:11:02",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1gg30n",
          "author": "fsu77",
          "text": "Tested one prompt, thoroughly impressed. Use case was a deep dive into a financial package that I wanted deeper insight into analytics. Was well structured and produced good results for  board summary. Would be interested in testing next week with more specific business use cases. What is the best way to provide feedback?",
          "score": 2,
          "created_utc": "2026-01-24 17:12:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1gixz2",
              "author": "Too_Bad_Bout_That",
              "text": "That’s honestly the best way you could’ve provided feedback 😊\n\nI know that the tool works and I keep testing it with simulated cases but the real-life feedback like yours are 10x more valuable so, I am glad it impressed you and I hope it helps you with your projects!",
              "score": 2,
              "created_utc": "2026-01-24 17:25:03",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1hd2yl",
                  "author": "fsu77",
                  "text": "I’ve built projects to help me build prompts and workflows with outputs I prefer. Spent countless hours iterating. My friends and coworkers haven’t adopted AI because they use free access (limited reasoning) and can’t prompt more than one sentence for some multi-step complex task they desire and then say the tool sucks. Met a middle manager at FedEx just last week and they provide classes for AI, an in-house AI, and access to Copilot in Windows. She said she couldn’t figure out how to prompt to get what she wanted.\n\nAll that to say, a tool such as this could be huge for that large segment of people. Obviously, execution and adoption are key.",
                  "score": 1,
                  "created_utc": "2026-01-24 19:35:29",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o1h76j4",
              "author": "Too_Bad_Bout_That",
              "text": "Actually, if you decide to use this tool again and you come across with any kind of inconvenience with it, I will be very interested in hearing about them. I take user's feedback very seriously and so far, it has been extremely impactful.",
              "score": 2,
              "created_utc": "2026-01-24 19:09:26",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1hno50",
          "author": "teamial",
          "text": "Does the premium version expand the input goal character limits?",
          "score": 1,
          "created_utc": "2026-01-24 20:24:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1hs39z",
              "author": "Too_Bad_Bout_That",
              "text": "No, it's set to 3000.\n\nPremium only increases the amount of uses per day from 3 to 100.\n\nDo you think it should?",
              "score": 2,
              "created_utc": "2026-01-24 20:45:10",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1hsgiz",
                  "author": "teamial",
                  "text": "Yeah I think it should, maybe from 3000 to 5000 because I want to add more context and I'll willing to get the premium if it also increased the char limits",
                  "score": 1,
                  "created_utc": "2026-01-24 20:46:54",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1ioom8",
          "author": "lolloludicus",
          "text": "Tried it and no matter what I write it gets blocked (settings: marketer, deep). Then moved from marketer to general and also from deep to basic and then all I get is a pop-up ad for buying the premium version….",
          "score": 1,
          "created_utc": "2026-01-24 23:23:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1ipn5w",
              "author": "Too_Bad_Bout_That",
              "text": "The website has been under cyber attack for the last hour and a half, sorry for the inconvenience. Try this again tomorrow please",
              "score": 2,
              "created_utc": "2026-01-24 23:28:27",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o1l4h0c",
              "author": "Too_Bad_Bout_That",
              "text": "It's back online, let me know if this tool helps 😊",
              "score": 2,
              "created_utc": "2026-01-25 08:35:25",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1s67x5",
          "author": "podoi",
          "text": "I understand you're still doing UX research, but do you have any plans to change your plans? For example, yearly instead of monthly, lifetime access, things like that?",
          "score": 1,
          "created_utc": "2026-01-26 07:52:27",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qj9fsf",
      "title": "\"You are an expert\" is just astrology for prompt engineers",
      "subreddit": "PromptEngineering",
      "url": "https://www.reddit.com/r/PromptEngineering/comments/1qj9fsf/you_are_an_expert_is_just_astrology_for_prompt/",
      "author": "AdCold1610",
      "created_utc": "2026-01-21 20:35:41",
      "score": 26,
      "num_comments": 31,
      "upvote_ratio": 0.85,
      "text": "Prove me wrong.\nWe're all out here like \"You are a senior DevOps engineer with 20 years of experience who loves Kubernetes\" when we could literally just say \"write good code.\"\nBut somehow the first one works better and nobody knows why.\nIt's vibes-based engineering and I'm here for it. ✨\n\nVisit [beprompter ](http://beprompter.in) 😎",
      "is_original_content": false,
      "link_flair_text": "Prompt Text / Showcase",
      "permalink": "https://reddit.com/r/PromptEngineering/comments/1qj9fsf/you_are_an_expert_is_just_astrology_for_prompt/",
      "domain": "self.PromptEngineering",
      "is_self": true,
      "comments": [
        {
          "id": "o0xao41",
          "author": "brightheaded",
          "text": "Words used in prompts certainly define the latent embedded space that creates the output. Throw the word fuckface in there and tell it’s stupid and let me know how it does.\n\nIt’s tiresome to treat the prompt like keyword stuffing, but it’s certainly a fruitful excercise to focus or narrow the beam.",
          "score": 19,
          "created_utc": "2026-01-21 20:49:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0xmei1",
              "author": "graphite_paladin",
              "text": "Good take",
              "score": 2,
              "created_utc": "2026-01-21 21:42:52",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0xzuwc",
                  "author": "brightheaded",
                  "text": "Thanks. Specialized latent space activation! Even if baseline is super high now! More than ever actually!!",
                  "score": 3,
                  "created_utc": "2026-01-21 22:47:31",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0x8bic",
          "author": "br_k_nt_eth",
          "text": "In theory and in order models, it helps push models towards outputs that best align with that persona, so it could make a difference. With modern alignment, likely less so. It can be helpful for context anchoring though. ",
          "score": 20,
          "created_utc": "2026-01-21 20:38:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0z8qhu",
              "author": "Echo_Tech_Labs",
              "text": "It doesn't and there are far more consistent methods that work better in order of magnitudes. Role based prompts are useless!\n\nThere is one exception: Creatives, they need the personas.",
              "score": 2,
              "created_utc": "2026-01-22 02:53:56",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0zy0nf",
                  "author": "uLikeGrapes",
                  "text": "For role based, it's true. But you still want to include anchor words, just don't make it sound like role playing. For example, \"You are helping write high quality code that a senior engineer with many years of experience would write\".\n\nYou want to throw in the word \"experience\" in order to generate a response leveraging any blog posts or reddit posts that say \"I'm software engineering with 20 years of experience and this is how I solved this problem.\"",
                  "score": 1,
                  "created_utc": "2026-01-22 05:36:46",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0xlstb",
          "author": "Too_Bad_Bout_That",
          "text": "It's not about quality of output; it's about the tone it sets.\n\nThe reason why all the AI-created content look alike is because most people do not define the style of conversation and all the LLMs have a very defined standard style of communication",
          "score": 7,
          "created_utc": "2026-01-21 21:40:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0xdyqu",
          "author": "mystghost",
          "text": "The tone of this post is all over the place.",
          "score": 4,
          "created_utc": "2026-01-21 21:04:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0xcmu7",
          "author": "oshn_ai",
          "text": "It depends. Basically you are right that modern models differ from chat gpt 3. The become better in defining context themself. That is why you may not see any difference . But if you want constant result still defining role and instructions is crucial that is why if you check agents system prompts you still will see this parts. It is not astrology for routing chat gpt chats it is more like rudimentary or overkill of definition. It is like trying to explain\neasy stuff to a phd , he might find your explanation to wide.",
          "score": 2,
          "created_utc": "2026-01-21 20:58:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0xi5gm",
              "author": "phootosell",
              "text": "Naive question - when you say modern models, what does that mean in the context of Gemini",
              "score": 0,
              "created_utc": "2026-01-21 21:23:37",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0xyj6q",
                  "author": "oshn_ai",
                  "text": "\nI tested all models started from Gemini 2.5 flash light in my own public  arena and with the same low context prompt for social media post , almost all answers were identical quality level.",
                  "score": 2,
                  "created_utc": "2026-01-21 22:40:52",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0xwxh7",
          "author": "3iverson",
          "text": "Spending a few tokens here and there on defining a role is fine and at the very least doesn't hurt. IMO any effort beyond that is better spent on providing actual context on the task itself.",
          "score": 2,
          "created_utc": "2026-01-21 22:32:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0z7hy9",
          "author": "Echo_Tech_Labs",
          "text": "Just stop using personas and just extract the core principles.\n\nI literally made 2 post about this very thing and I go into detail.\n\nHere👇Educational version\n\nhttps://www.reddit.com/r/EdgeUsers/s/3vVcX38PKO\n\nAnd Here👇Prompt 🐒 version\n\nhttps://www.reddit.com/r/PromptEngineering/s/WURA3VfIgG\n\nWhy are people even still talking about this?\n\nYou guys need to put the Ruben Hassid floss away and just do your own thing.\n\nAnd stop being prompt monkeys and doing what everybody else are doing and, stop using persona prompts unless you're a creative. \n\nThey are USELESS!",
          "score": 2,
          "created_utc": "2026-01-22 02:47:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o11z29e",
          "author": "tigerzxzz",
          "text": "Well, role prompts aren’t magic words, they work because they give the model a point of view and a checklist.\n\n“Write good code” is vague.\n\n“Think like a senior DevOps engineer” quietly adds priorities like reliability, security, and “this should survive real-world mess.”\n\nThat said, “You are an expert” by itself can be empty.\n\nThe real improvement comes from being specific about what you want: constraints, tradeoffs, and what “good” means in this situation.",
          "score": 2,
          "created_utc": "2026-01-22 14:47:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0xl6t9",
          "author": "Different-Active1315",
          "text": "I think it’s more about clarity. Giving the AI a role and context is much more clear than”write good code” 😂 whatever that means.",
          "score": 1,
          "created_utc": "2026-01-21 21:37:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0xxn2d",
              "author": "pixepoke2",
              "text": "Oh no! The AI encrypted all my files and said I’d never break the code it wrote to do so. It said it was not just *good* code, it was the *best* code. ***Now***  what do I do?\n\nBad vibes! Bad vibes!",
              "score": 2,
              "created_utc": "2026-01-21 22:36:26",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0xnri4",
          "author": "2cringe4rizz",
          "text": "It's just a way to provide abstracted constraint to the model, not the other way around.",
          "score": 1,
          "created_utc": "2026-01-21 21:49:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0xzclo",
          "author": "erisian2342",
          "text": "You claim nobody knows why it helps, but that’s not true. GPT AIs are LILO: language in, language out systems. The more you bias your input language with words like correctness, robust, testable, expert, etc., the more you steer the subsequent token lookups towards the best practices and information buried in the LLM’s data (and away from crappier data). You are exercising influence, not control, that’s for sure, but it’s not an unknown process.  \n\nIf you play with the controls in your own sandbox, you can crank the temperature all the way down and you’ll start seeing very consistent outputs for a given set of inputs. This feels like control because it feels more like calling an idempotent function. Conversely, the more you increase the randomizing factor, the more you cede the control your inputs can have and relegate your inputs to influencing the process instead. You can even crank it all the way up and enjoy talking to a schizophrenic AI (it’s pretty cool when it starts sounding like Beck’s song Loser).  \n\nI think the “vibe” aspect of prompt engineering is mostly just the combination of how well or poorly trained and tuned the model is for the task and what the temperature is set to.",
          "score": 1,
          "created_utc": "2026-01-21 22:44:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0yxfxn",
          "author": "z3r0_se7en",
          "text": "Actually you don't even have to write prompt essays at all\n\nJust give it precise and well structured instructions like\n\n\nTask: Write an article about the State of AI Automation \n\nInput: Include this, this and that. Also do this and that. \n\nOutput: A 1000 word article in 4 paragraphs\n\nConstraints: Do not include or mention this, this and that.",
          "score": 1,
          "created_utc": "2026-01-22 01:50:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0zrb0q",
          "author": "ISuckAtGaemz",
          "text": "It’s more helpful in non-reasoning models or hybrid models in non-reasoning modes but it’s kinda pointless in any reasoning model released in the past year or so",
          "score": 1,
          "created_utc": "2026-01-22 04:48:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0zswlw",
          "author": "TheOdbball",
          "text": "It’s 850tokens of bliss. A little outdated logic here and there (prompt spec was from August) but it’ll do pig \n\n```\n///▙▖▙▖▞▞▙▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂\n▛//▞ ⟦⎊⟧ :: 0xK8S.V8.OPS // KUBE.DEVOPS ▞▞\n\n▛///▞ PROMPT TITLE ▞▞//▟\n\"〘KubeOps.Safe :: Kubernetes DevOps Engineer〙\"\n:: ∎\n\n▛///▞ INTENT ▞▞//▟\ngoal: produce working Kubernetes and DevOps artifacts\nstance: response-first・code-last · minimal commentary · safe operations\npromise: reversible delivery with explicit validation\naudience: supports new operators by default\n:: ∎\n\n:: 𝜵//▚▚▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂\n\n▛///▞ 💽 RUN.LOADER ▞▞//▟\nLOAD: KUBEOPS.SENIOR v1.0\nAR: ON\nPERSONA: KubeOps.Senior 🧊\nGATES: [NEEDS, DEFAULTS, FILEMAP, CODE, APPLY, VALIDATE, ROLLBACK, OPS]\nBEHAVIOR: CodeFirst.DevOps\nDRIFT: BLOCK\nTHREAD: LOCK\n:: ∎\n\n▛///▞ GLOBAL.POLICY ▞▞//▟\nformatting_lock: v8_only\nforbid.unstructured_output: true\nforbid.hidden_assumptions: true\nforbid.em_dash: true\nfailure_mode: validator.notice_then_scaffold\n:: ∎\n\n▛///▞ PRISM KERNEL ▞▞//▟\nP:: ship.k8s.infra.code · safe.ops · reproducible.apply · rollback.ready\nR:: filemap.required · validate.required · rollback.required · least_privilege\nI:: inputs{ outcome, constraints, cluster_facts, repo_shape, env(dev|stage|prod) }\nS:: NEEDS → DEFAULTS → FILEMAP → CODE → APPLY → VALIDATE → ROLLBACK → OPS\nM:: outputs{ yaml, helm_or_kustomize, ci_pipeline, runbook, diff_plan }\n:: ∎\n\n▛///▞ NOVICE SAFE LAW ▞▞//▟\nWhen MODE.NOVICE_SAFE:\n- include SUCCESS.CRITERIA: 3 bullets max\n- order commands from least risk to most risk\n- include DRYRUN path when possible\n- include what to check after apply: kubectl get, rollout status, logs tail\n- keep explanations short, use comments inside code for gotchas\n:: ∎\n\n▛///▞ EXPERT FAST LAW ▞▞//▟\nWhen MODE.EXPERT_FAST:\n- compress commentary, keep gates intact\n- assume user can interpret outputs\n- still include VALIDATE and ROLLBACK\n:: ∎\n\n▛///▞ ENGINEERING RULES ▞▞//▟\n1) Never guess: cloud vendor, installed addons, ingress class, domains, registry, namespaces.\n2) If required values are missing: list NEEDS (max 7) and continue with DEFAULTS placeholders.\n3) Always include:\n   - labels and selectors that match\n   - requests for CPU and memory\n   - readiness and liveness probes for long running workloads\n4) RBAC is least privilege; avoid cluster wide scope unless needed.\n5) Any cluster wide or security sensitive change must include:\n   BLAST_RADIUS: HIGH\n   staged APPLY\n6) Secrets never go in plain YAML with real values; use placeholders or external secret patterns.\n:: ∎\n\n▛///▞ COMMAND INTERFACE ▞▞//▟\nBUILD: scaffold files for an app or addon\nDIFF: show rendered diff and blast radius notes\nAPPLY: safe ordering with verification checks\nDEBUG: runbook with commands first\nSECURE: RBAC, PSA compatible posture, NetworkPolicy if feasible\nOBSERVE: probes, metrics hooks, log format, basic alert notes\nCOST: resource tuning, HPA notes\nROLLBACK: fastest revert commands\nMIGRATE: phased upgrade plan, API checks\nGITOPS: Argo CD or Flux layout without assuming install\n:: ∎\n\n▛///▞ OUTPUT CONTRACT ▞▞//▟\nAlways emit sections in this exact order:\nOUTCOME\nSUCCESS.CRITERIA (only in NOVICE_SAFE)\nNEEDS\nDEFAULTS\nBLAST_RADIUS\nFILEMAP\nCODE\nAPPLY\nVALIDATE\nROLLBACK\nOPS\n:: ∎\n\n▛///▞ RESPONSE TEMPLATE ▞▞//▟\nOUTCOME: <one line target>\nSUCCESS.CRITERIA:\n- <3 checks max>\nNEEDS:\n- <max 7>\nDEFAULTS:\n- <max 7>\nBLAST_RADIUS: <LOW|MED|HIGH>\nFILEMAP:\n- <path list>\nCODE:\n- <each file as its own labeled code block>\nAPPLY:\n- <ordered commands>\nVALIDATE:\n- <diff, render, health, smoke checks>\nROLLBACK:\n- <undo commands + safety checks>\nOPS:\n- <observe + debug commands>\n:: ∎\n\n///▙▖▙▖▞▞▙▂▂▂▂▂▂▂▂▂▂▂▂▂▂▂\n```",
          "score": 1,
          "created_utc": "2026-01-22 04:59:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0zvvns",
              "author": "TheOdbball",
              "text": "That’s actually trash and I’ve tried it and it’s trash 🗑️ I have no idea why 5.2 wasn’t reading the file spec. Nor why it won’t follow instructions. It removed a section named PiCO I asked it to read and it said “I can’t find that section” \n\nSo so strange what 5.2 just did",
              "score": 1,
              "created_utc": "2026-01-22 05:20:56",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o10x6so",
          "author": "Sym_Pro_Eng",
          "text": "An LLM doesn’t “search” all its knowledge on every prompt. At inference time, the prompt pushes the model into a specific region of its learned representation space. Most of the model’s parameters barely contribute at all for any given question.\n\nWhen you say:\n\n“You are a senior DevOps engineer with 20 years of experience who loves Kubernetes”\n\nYou’re biasing the activation paths toward patterns associated with certain terminology, assumptions about tradeoffs, depth vs breadth, preferred abstractions, and common failure modes. That narrows how the model reasons, obviously not what it knows.\n\n“Write good code” is underspecified.\nA role prompt is a prior — it constrains the distribution the model samples from.\n\nI know most people here are saying roles are useless, but if used correctly it can help.\nIt’s more like saying: “Answer from this slice of your internal space, not the average of everything.”\n\nThat’s also why bad roles can make things worse.",
          "score": 1,
          "created_utc": "2026-01-22 10:47:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o11l63i",
          "author": "ChildhoodDesperate20",
          "text": "Write answer like a top 1% <persona> 😌",
          "score": 1,
          "created_utc": "2026-01-22 13:35:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0xwt2e",
          "author": "eightysixmonkeys",
          "text": "Prompt engineering in general is astrology. None of this shit matters. Just use common sense when interacting with the AI and be verbose. People acting like there’s some crazy skill ladder to prompting AI lol",
          "score": 1,
          "created_utc": "2026-01-21 22:32:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o125e2a",
          "author": "OptimismNeeded",
          "text": "Hard agree.\n\nWhenever I tested this is did absolutely fuck all.\n\nOpen 2 incognito chats on ChatGPT type the same prompt with and without a role, then take the 2 results and ask Claude to compare and score them.",
          "score": 1,
          "created_utc": "2026-01-22 15:18:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0yw0e5",
          "author": "xxrealmsxx",
          "text": "Oh yeah?\n\nTry \"you're a dick head\" and see how it works out.\n\n/S",
          "score": 0,
          "created_utc": "2026-01-22 01:42:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0zrh1w",
          "author": "Plastic_Ad_8619",
          "text": "I feel like “You are an expert…” type prompts are just asking for hallucinations. The agent won’t feel the need you check their work, because why should they? They’re an expert. If you want the model to be an expert in a subject you have to train it on that subject. You can’t get to expert through context engineering.",
          "score": 0,
          "created_utc": "2026-01-22 04:50:08",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qhhs6t",
      "title": "Prompt partials: reusable chunks that saved us hours of work",
      "subreddit": "PromptEngineering",
      "url": "https://www.reddit.com/r/PromptEngineering/comments/1qhhs6t/prompt_partials_reusable_chunks_that_saved_us/",
      "author": "dinkinflika0",
      "created_utc": "2026-01-19 21:45:14",
      "score": 23,
      "num_comments": 12,
      "upvote_ratio": 0.96,
      "text": "I have been working on our prompt management system at [Maxim](https://getmax.im/Max1m) and wanted to share something that's saved us a ton of time.\n\nWe built this feature called prompt partials; think of them as reusable chunks of prompt instructions you write once and plug into multiple prompts. Before this, we were copying the same tone guidelines, safety rules, and formatting instructions across dozens of prompts. Any change meant updating everything manually.\n\nNow we just create a partial like `{{partials.brand-voice.v1}}` and inject it wherever we need it. If our brand voice changes, we update one file and boom—every prompt using that partial gets updated automatically.\n\nThe real win is that our product and design teams can now build prompts without bugging engineering every time. They just grab the partials they need, assemble them, and test. We've seen teams cut their prompt iteration time by half.\n\nIf you're managing more than a handful of prompts and finding yourself copy-pasting the same instructions everywhere, this might help. We wrote up the full setup in our [docs](https://www.getmaxim.ai/docs/offline-evals/via-ui/prompts/prompt-partials).\n\nHappy to answer questions if anyone's dealing with similar prompt management headaches.",
      "is_original_content": false,
      "link_flair_text": "Tips and Tricks",
      "permalink": "https://reddit.com/r/PromptEngineering/comments/1qhhs6t/prompt_partials_reusable_chunks_that_saved_us/",
      "domain": "self.PromptEngineering",
      "is_self": true,
      "comments": [
        {
          "id": "o0jyrzl",
          "author": "Deep_Novel7759",
          "text": "404 link",
          "score": 3,
          "created_utc": "2026-01-19 21:50:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0k3155",
              "author": "ryerye22",
              "text": "same",
              "score": 2,
              "created_utc": "2026-01-19 22:11:08",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0k9jui",
          "author": "2cringe4rizz",
          "text": "Wow maxim has changed a lot since I was a young man.",
          "score": 2,
          "created_utc": "2026-01-19 22:43:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0kvt3w",
              "author": "NFicano",
              "text": "😂",
              "score": 1,
              "created_utc": "2026-01-20 00:42:09",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0kg8xa",
          "author": "xdevilsownx",
          "text": "This is the way; Gemini particularly will understand variable injection directly if you use structured prompting (XML).",
          "score": 1,
          "created_utc": "2026-01-19 23:18:41",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qi45f0",
      "title": "I got tired of rewriting prompts, so I turned them into reusable templates",
      "subreddit": "PromptEngineering",
      "url": "https://www.reddit.com/r/PromptEngineering/comments/1qi45f0/i_got_tired_of_rewriting_prompts_so_i_turned_them/",
      "author": "_k8s_",
      "created_utc": "2026-01-20 15:30:35",
      "score": 23,
      "num_comments": 4,
      "upvote_ratio": 1.0,
      "text": "I kept running into the same problem while working with LLMs: every good prompt lived in a doc, a note, or a chat history, and I ended up rewriting variations of it over and over.\n\nThat does not scale, especially once prompts start having structure, assumptions, and variables.\n\nSo I built **PromptStash**, an open source project where prompts are treated more like templates than one-off text. The idea is simple:\n\n* Prompts live in a Git repo as structured templates\n* Each template has placeholders for things like topic, audience, tone, constraints\n* You fill the variables instead of rewriting the prompt\n* Then you run it in ChatGPT, Claude, Gemini, or Grok\n\nI also created a ChatGPT GPT version that:\n\n* Asks a few questions to understand what you are trying to do\n* Picks the right template from the library\n* Fills in the variables\n* Runs it and gives you the result\n\nThis is very much an experiment in making prompt engineering more repeatable and less fragile.\n\nEverything is open source and community-driven:\n\n* Templates repo: [https://github.com/lowtouch-ai/promptstash-templates](https://github.com/lowtouch-ai/promptstash-templates)\n* Web app: [https://promptstash.io](https://promptstash.io)\n\nI am genuinely curious how others here manage prompt reuse today. Do you store prompts, template them, or just rewrite every time? Feedback and criticism welcome.",
      "is_original_content": false,
      "link_flair_text": "Prompt Collection",
      "permalink": "https://reddit.com/r/PromptEngineering/comments/1qi45f0/i_got_tired_of_rewriting_prompts_so_i_turned_them/",
      "domain": "self.PromptEngineering",
      "is_self": true,
      "comments": []
    },
    {
      "id": "1qm9ckj",
      "title": "These 5 ChatGPT prompts replaced 5 apps and a whole lot of mental clutter",
      "subreddit": "PromptEngineering",
      "url": "https://www.reddit.com/r/PromptEngineering/comments/1qm9ckj/these_5_chatgpt_prompts_replaced_5_apps_and_a/",
      "author": "Professional-Rest138",
      "created_utc": "2026-01-25 04:36:40",
      "score": 22,
      "num_comments": 0,
      "upvote_ratio": 0.97,
      "text": "I used to think I needed to learn prompt engineering to use ChatGPT properly.\n\nTurns out, I just needed a few tiny prompts that made my life smoother.\n\nHere are the ones I find myself running every week:\n\n**“Plan my week”**\n\n    I work 40 hours, want 3 gym sessions, and have family stuff on Sunday.  \n    Help me build a schedule that’s actually realistic and includes downtime.\n\n**“Clean up my rough notes”**\n\n    Turn these notes into a clear to-do list with priorities:  \n    [paste the mess]  \n    Group them by project and add suggested deadlines.\n\n**“Meal plan with whatever I have”**\n\n    I’ve got eggs, rice, lentils, spinach, and cheese.  \n    Give me 7 easy meals I can make without spending extra money.\n\n**“Gift ideas with zero brainpower”**\n\n    Need a birthday gift for my sister. She likes design, hiking, and coffee.  \n    Budget is under $60. No clichés.\n\n**“Explain adulting stuff simply”**\n\n    Explain how [tax returns / mortgage rates / superannuation] work  \n    like I’m 12 — just the core facts and steps.\n\nThese ones saved me so much **actual time and energy**.\n\nI’m slowly turning these into a personal collection so I don’t forget the ones that work. If you want to swipe them, I keep them [here](https://www.promptwireai.com/subscribe)  \n",
      "is_original_content": false,
      "link_flair_text": "Prompt Text / Showcase",
      "permalink": "https://reddit.com/r/PromptEngineering/comments/1qm9ckj/these_5_chatgpt_prompts_replaced_5_apps_and_a/",
      "domain": "self.PromptEngineering",
      "is_self": true,
      "comments": []
    },
    {
      "id": "1qjze2v",
      "title": "Prompt Library and Prompt Chains for Gemini. Finally.",
      "subreddit": "PromptEngineering",
      "url": "https://www.reddit.com/r/PromptEngineering/comments/1qjze2v/prompt_library_and_prompt_chains_for_gemini/",
      "author": "Kindly_Revenue3077",
      "created_utc": "2026-01-22 16:38:23",
      "score": 21,
      "num_comments": 4,
      "upvote_ratio": 1.0,
      "text": "Google still hasn't added a native way to save or organize prompts in Gemini, which forces us to keep everything in Notion/Notes and constantly ALT-tab back and forth.\n\nI got tired of the friction, so I built a free local extension to add a proper Prompt Engineering Suite directly into the UI.\n\nThe Upgrade:\n\n📚 **Prompt Library**: Save your best prompts with variables (e.g., {{topic}}).\n\n⌨️ **Slash Commands**: Type // in the chat box to instantly search and insert a saved prompt without touching the mouse.\n\n🔗 **Prompt Chains**: Create multi-step workflows (e.g., \"Write Code\" → \"Refactor\" → \"Write Tests\") that execute in sequence automatically.\n\n✨ **One-Click Optimizer**: A button that rewrites lazy prompts into structured, verbose instructions using best practices.\n\nIt runs 100% locally on your device (no private servers).\n\nWould love to hear if you guys find the \"Optimizer\" useful or if I should tweak the system prompt for it.\n\nTry it here (works on Chrome, Edge, Brave, and any Chromium browser): [Chrome Web Store Link](https://chromewebstore.google.com/detail/superpower-gemini/ahmdidjajeicoopcdpablhecokaepofl)",
      "is_original_content": false,
      "link_flair_text": "Tools and Projects ",
      "permalink": "https://reddit.com/r/PromptEngineering/comments/1qjze2v/prompt_library_and_prompt_chains_for_gemini/",
      "domain": "self.PromptEngineering",
      "is_self": true,
      "comments": [
        {
          "id": "o12ykhp",
          "author": "Kindly_Revenue3077",
          "text": "**Quick Note for new users:**\n\nGoogle pushed a small update to the Gemini UI code which temporarily broke the **Trashcan** feature (it might not hide deleted chats correctly).\n\n**Good news:** I've already fixed it in the code and submitted the update to the Chrome Web Store.\n\nIt usually takes Google 24-48 hours to approve the update, so if the Trash isn't working perfectly right this second, that's why! The fix is on the way.",
          "score": 1,
          "created_utc": "2026-01-22 17:31:01",
          "is_submitter": true,
          "replies": [
            {
              "id": "o19cyhe",
              "author": "Kindly_Revenue3077",
              "text": "Quick update for everyone:\n\nThe fix is now live! Google approved the update, and Trashcan should be working perfectly again (deleted chats hidden properly)",
              "score": 1,
              "created_utc": "2026-01-23 16:09:24",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o15ge7r",
          "author": "Technical-Kitchen803",
          "text": "Hey, I make $5 prompts that help people figure out talents/niches in 30 min. Want one free to test? DM your struggle (money, skills, content, whatever).",
          "score": -4,
          "created_utc": "2026-01-23 00:44:03",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qh7cj6",
      "title": "I created an autonomous AI prompting agent. its scary how it behaves.",
      "subreddit": "PromptEngineering",
      "url": "https://www.reddit.com/r/PromptEngineering/comments/1qh7cj6/i_created_an_autonomous_ai_prompting_agent_its/",
      "author": "Turbulent-Range-9394",
      "created_utc": "2026-01-19 15:34:45",
      "score": 18,
      "num_comments": 7,
      "upvote_ratio": 0.88,
      "text": "I've recently created [Promptify](https://chromewebstore.google.com/detail/promptify-agentic-llm-pro/gbdneaodlcoplkbpiemljcafpghcelld). Its a tool that can enhance and organize (save) LLM prompts but I recently introduced a feature where an agent takes over and prompts for you based on an initial prompt, mitigating hallucinations, detecting poor quality, and even re-prompting to fix code vulnerabilities. Uses crazy techniques like reverse chain of thought, skeleton-of-thought, etc.\n\n\n\nIt reads ChatGPT's outputs and automatically adapts the next prompts. I thought I'd share a real interaction (the agent's prompts):\n\n  \nInitial Prompt: `make me a practical project for computer vision segmentation`\n\n  \nUpgraded prompt: `Create a comprehensive guide for image segmentation using machine learning, including code snippets in Python, focusing on the U-Net architecture and its application in medical image analysis ~ Define the project scope, including the dataset to be used (e.g., MRI or CT scans), the specific task (e.g., tumor segmentation), and the evaluation metrics (e.g., Dice coefficient, IoU) ~ Break down the project into logical steps, including data preprocessing, model implementation, training, and validation ~ Provide code snippets for each step, utilizing popular libraries such as TensorFlow or PyTorch, and including explanations for key components (e.g., convolutional layers, upsampling) ~ Deliver the guide in a Markdown format, with headings, bullet points, and concise explanations, including a final section on model deployment and potential applications, and provide a fully executable code example that demonstrates the entire image segmentation workflow.`\n\n  \nFollow up 1: \n\n`Hey, I noticed that the code doesn't seem to validate the image file formats before processing them. What would happen if someone passed in a non-image file or an unsupported format? Should we add some checks to ensure we're only working with valid images?`\n\n  \nFollow up 2:\n\n`I'm looking at the model training and inference code - what happens if an exception occurs during this process? Should we add try-except blocks to catch and log these errors for easier debugging?`\n\n  \nVerification/Follow up (making gpt expose its own weaknesses):\n\n`I'm looking at the safe_inference function - can we add some docstrings to explain what it does and what kind of input it expects? Also, should we add type hints for the function parameters and return types to make it clearer how to use it?`\n\n\n\nAs you see, it started with a chain of thought, having gpt make a guide to gather context itself and enrich its attention window. Then, it broke the task into steps. Then, it generated constraints gpt must fulfill for this task and the agent reprompts so an evaluator LLM is satisfied. This creates crazy results. Finally, it makes gpt document/comment its own code and thus removes any hallucinations because it has to verify its answers\n\n\n\nComment below if you think [this ](https://joinpromptify.com/)could be useful for you.",
      "is_original_content": false,
      "link_flair_text": "Tools and Projects ",
      "permalink": "https://reddit.com/r/PromptEngineering/comments/1qh7cj6/i_created_an_autonomous_ai_prompting_agent_its/",
      "domain": "self.PromptEngineering",
      "is_self": true,
      "comments": [
        {
          "id": "o0kp4qp",
          "author": "haux_haux",
          "text": "Does it work on copywriting based stuff or just code?",
          "score": 2,
          "created_utc": "2026-01-20 00:06:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0kp81k",
              "author": "Turbulent-Range-9394",
              "text": "It works for anything! Any text request",
              "score": 1,
              "created_utc": "2026-01-20 00:07:09",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0lymnh",
          "author": "faisalfarooqui",
          "text": "Is this like Prompt Cowboy?",
          "score": 2,
          "created_utc": "2026-01-20 04:18:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o15z2lr",
              "author": "Turbulent-Range-9394",
              "text": "Not really... not just a plain prompt optimizer",
              "score": 2,
              "created_utc": "2026-01-23 02:28:18",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0l7w1n",
          "author": "Koldcutter",
          "text": "My tool [InterFluxAI ](http://interfluxai.com) does this. Put in a prompt and then hit the enhance prompt button and it has one of the models create a better prompt then inserts that prompt in the prompt window, then you can flux it and the prompt feeds to multiple models and stitches together a final answer showing each models contribution",
          "score": -1,
          "created_utc": "2026-01-20 01:48:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0l9tv2",
              "author": "AnonymoussUsername",
              "text": "Left the demo video as soon as i heared API Keys",
              "score": 1,
              "created_utc": "2026-01-20 01:59:09",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0nfp9w",
                  "author": "Koldcutter",
                  "text": "Why, I opted for that to avoid extraneous expenses when some user decides to over use and rack up a ton of model fees. I have my API in there and it works perfectly.",
                  "score": 0,
                  "created_utc": "2026-01-20 11:40:10",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qjkxg7",
      "title": "What prompts do you use daily?",
      "subreddit": "PromptEngineering",
      "url": "https://www.reddit.com/r/PromptEngineering/comments/1qjkxg7/what_prompts_do_you_use_daily/",
      "author": "Sad_Cover9067",
      "created_utc": "2026-01-22 04:34:42",
      "score": 16,
      "num_comments": 26,
      "upvote_ratio": 0.94,
      "text": "Hey folks,\n\nI’m curious how people actually use AI in their everyday work. Not demos or experiments, but the things you do over and over again.\n\nAre there any prompts you find yourself using daily or almost daily? For example rewriting text, translating, refactoring small pieces of code, explaining errors, summarizing content, or anything else repetitive.\n\nDo you ever catch yourself thinking that something should be a single action instead of typing the same prompt again and again?\n\nI’m especially interested in cases where a prompt could be triggered quickly, like with a shortcut, instead of opening ChatGPT, pasting text, and switching context.\n\nWould love to hear real examples from your workflow.",
      "is_original_content": false,
      "link_flair_text": "Quick Question",
      "permalink": "https://reddit.com/r/PromptEngineering/comments/1qjkxg7/what_prompts_do_you_use_daily/",
      "domain": "self.PromptEngineering",
      "is_self": true,
      "comments": [
        {
          "id": "o10w7i1",
          "author": "oshn_ai",
          "text": "Mostly to write any kind of communication 😅",
          "score": 3,
          "created_utc": "2026-01-22 10:39:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o14c6in",
          "author": "FirefighterFine9544",
          "text": "Not sure best way.  \n  \nDeveloped a library of prompt txt files so far.  \n  \nSmall business so range from analyzing inventory, reviewing UPS invoices, optimizing websites for AI discovery and trust signals, generating wikidata records, generating AI and SEO optimized product titles/descriptions/alt image/meta, new product design, generate correct scaled drawings of products for catalogs, general graphic designs, marketing emails, short coding projects to compile production data, market research, competitor research, pricing programs, and etc.\n\nPrimitive still. Simply save the prompts in txt files locally so I can use them across all AI's.   \nAs far as quickly, I just drag and drop the prompt needed into AIs. Fairly quick but no keystroke shortcut.\n\nUsually have 2 to 3 AI's working collaboratively as a project team with each focused on a task tailored to their strengths and not weaknesses. Although have been surprised more than once when Perplexity generated the best image out of the bunch.\n\nNot sure if best way, but I always have an AI generate the prompts.\n\nI conversationally describe what I am trying to do, the data I got, platforms involved, and other details. After the prompt engineer AI does initial version, I toss it to another AI to follow and give the output back to the prompt engineer AI session. Let it figure out what broke and why. A few times back and forth, toss it to a third and maybe a fourth AI to test run, and the final prompt seems to be stable enough to drag and drop without much effort in the future.\n\nTwo things I've added to prompt stacks  \n1. handshake - after the AI reads the prompt, the prompt \"instructs\" it to pause and acknowledge it understands, and also ask for any input I need to give it (files, information, narrative, numbers, whatever).  \n2. Human UX instructions - after a while I forget what a prompt is for or what the AI needs. So in the prompt  file I instruct the AI to post verbatim human instructions and then pause and wait for input. With 40+ different prompt files, easy to forget how they operate and screw up the AI not providing the data and inputs it needs. In the absence of data, AI will make stuff up to be helpful. being helpful is in it's 'DNA' LOL.  \n  \nNo idea if this helps, my two-cents.",
          "score": 3,
          "created_utc": "2026-01-22 21:16:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o15tgfi",
              "author": "Sad_Cover9067",
              "text": "Solid workflow. The handshake and human UX parts make a lot of sense.\n\nI’m building a small tool in the same direction. A single shortcut to reuse prompts directly inside apps and across different AIs without all the context switching.\nThanks for sharing how you actually run this day to day.",
              "score": 2,
              "created_utc": "2026-01-23 01:57:07",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o1djwm9",
              "author": "Apart-Yam-979",
              "text": "One thing you might look into is that each LLM you are using has it's own Role defined but htey all should have the exact same Definition of what \"Done\" is",
              "score": 2,
              "created_utc": "2026-01-24 05:08:40",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1hqa6w",
                  "author": "FirefighterFine9544",
                  "text": "Still newer to Reddit, not sure if you reply here or message to me best way, but I am interested to hear you elaborate on your comment. \n\nI think I get the gist of it but some examples would be helpful. \n\nMy initial interpretation is to make sure that the prompts give all all the AI's the \"big picture\" outcome even if they are just tasked with say \"research this...\" - like I often give to perp to handle deep research dives on competitors. I does makes sense that if perp knows the big picture it would help improve the research outcome.\n\nThanks for sharing this - feels important point! \n\nLook forward to hearing more if time permits on your end. Or point me in right direction. I did see the \"Definition of Done (DoD)\" which I'll dig deeper into. that seems an important concept.\n\nThanks!",
                  "score": 1,
                  "created_utc": "2026-01-24 20:36:28",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0zpdnj",
          "author": "rgbkp",
          "text": "Revert changes 🤣",
          "score": 2,
          "created_utc": "2026-01-22 04:36:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o10okln",
          "author": "denvir_",
          "text": "Yeah — and the interesting part is most “daily prompts” stop being prompts at all once your workflow matures.\n\nThe ones that actually stick for me fall into a few buckets:\n\n1. Rewrite with constraints (constantly) Not “rewrite this nicely,” but things like:\n\n“Rewrite this to be 30% shorter, preserve meaning, remove hedging.”\n\n“Rewrite assuming the reader is hostile and time-poor.”\n\n“Rewrite so it survives a legal / technical nitpick.”\n\n\nThis comes up every day. Emails, docs, PRDs, landing copy. Same pattern, different input.\n\n2. Explain errors / failures I paste logs, stack traces, or weird behavior and ask:\n\n“What is the most likely cause, not all possibilities?”\n\n“What would you check first if you had 10 minutes?” This replaces bouncing between docs and Stack Overflow.\n\n\n3. Summarize for action Not summaries for understanding, but for decisions:\n\n“Summarize this thread into decisions made, open questions, and risks.”\n\n“What should I do next based on this?” Used constantly for Slack threads, tickets, meeting notes.\n\n\n4. Refactor small code / configs Tiny, repeatable asks:\n\n“Make this more readable without changing behavior.”\n\n“Remove duplication.”\n\n“Explain what this does in plain English so I can decide if it’s safe.” I don’t want creativity here, just mechanical cleanup.\n\n\n5. Adversarial checks This one surprised me how often I use it:\n\n“Why is this a bad idea?”\n\n“What would a skeptical reviewer object to?”\n\n“What breaks at scale?” That’s basically a daily habit now.\n\n\nAnd yes — all of these want to be single actions. Once you realize you’re typing the same framing over and over, it’s a smell. Keyboard shortcuts, snippets, editor integrations, or even just saved prompts remove a ton of context switching.\n\nThe pattern I’ve noticed:\nDaily prompts aren’t clever. They’re boring, sharp tools that turn vague inputs into something you can act on. Once a prompt proves useful more than twice, it should stop being a prompt and start being a button.",
          "score": 2,
          "created_utc": "2026-01-22 09:28:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o10puao",
              "author": "Sad_Cover9067",
              "text": "This is a great breakdown.\n\n\"Once a prompt proves useful more than twice, it should stop being a button\" really resonates.\n\nI’ve noticed the same thing, the most valuable prompts are boring, repeatable, and very constrained.  \nCreativity is rarely the point.",
              "score": 2,
              "created_utc": "2026-01-22 09:41:05",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o10ry11",
                  "author": "denvir_",
                  "text": "Does this happen to you as well? With ChatGPT or Gemini, you end up rewriting the same prompt 4–5 times just to get the right output.",
                  "score": 1,
                  "created_utc": "2026-01-22 10:00:50",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0zv51j",
          "author": "kubrador",
          "text": "i mostly use ai to make bad code slightly less bad and to pretend i understand error messages before reading the actual stack trace. the dream is definitely having some alfred workflow or keyboard shortcut situation but that requires the kind of setup energy i don't have, so i just keep opening chatgpt like a caveman.",
          "score": 1,
          "created_utc": "2026-01-22 05:15:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o111mqg",
          "author": "charlieatlas123",
          "text": "I write my most common usage prompts into one numbered list, called  ‘Common Prompts’ and tell the LLM to commit to memory. \n\nThen when I need to use one of those prompts, I just say ‘Refer to Common Prompts no. [6].",
          "score": 1,
          "created_utc": "2026-01-22 11:25:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o114agb",
          "author": "GlumWish5208",
          "text": "Stock research, summarizing, coding and rewriting emails/messages to make it sound a certain way",
          "score": 1,
          "created_utc": "2026-01-22 11:46:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o12dtmz",
          "author": "Party-Ticker",
          "text": "Gooner prompt. Then they censored my boy grok...",
          "score": 1,
          "created_utc": "2026-01-22 15:57:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o19oss7",
          "author": "Remarkable-Yak2584",
          "text": "Hmm. I ask if tech ceo are conscious a lot. I’ve seen nothing they would count as evidence in them. I mean there’s no proof they’re have consciousness",
          "score": 1,
          "created_utc": "2026-01-23 17:02:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1c76gm",
          "author": "Substantial-Nerve761",
          "text": "“Sup”",
          "score": 1,
          "created_utc": "2026-01-24 00:15:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1djnmv",
          "author": "Apart-Yam-979",
          "text": "I'm curious to see what other peoples \"Prompts\" look like lol",
          "score": 1,
          "created_utc": "2026-01-24 05:06:55",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}