{
  "metadata": {
    "last_updated": "2026-02-23 17:19:57",
    "time_filter": "week",
    "subreddit": "rss",
    "total_items": 10,
    "total_comments": 55,
    "file_size_bytes": 65036
  },
  "items": [
    {
      "id": "1r8tu1o",
      "title": "Why we have a new RSS reader every day ?",
      "subreddit": "rss",
      "url": "https://www.reddit.com/r/rss/comments/1r8tu1o/why_we_have_a_new_rss_reader_every_day/",
      "author": "AdImpressive7394",
      "created_utc": "2026-02-19 08:29:43",
      "score": 36,
      "num_comments": 37,
      "upvote_ratio": 0.95,
      "text": "I think at this rate we'll have more RSS readers than sites that support RSS haha. More seriously, I don't understand why so many people are motivated to do the same things, especially in an era when RSS is in decline and building a realist business based on an RSS reader seems almost impossible to me, given the competition and open-source alternatives. ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/rss/comments/1r8tu1o/why_we_have_a_new_rss_reader_every_day/",
      "domain": "self.rss",
      "is_self": true,
      "comments": [
        {
          "id": "o67l39h",
          "author": "MountainToppish",
          "text": "A vibecoding flurry. It'll pass.",
          "score": 32,
          "created_utc": "2026-02-19 08:34:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o67lvhh",
              "author": "AdImpressive7394",
              "text": "I hope it will pass because most of them are still low quality and you have to pay for them haha",
              "score": 8,
              "created_utc": "2026-02-19 08:42:10",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o693x0q",
                  "author": "loudpersononthebus",
                  "text": "you do have to pay, but i doubt many of them profitable. with each one, I try to be positive and look at what new innovation they have implemented.",
                  "score": 2,
                  "created_utc": "2026-02-19 15:12:25",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o6di0lo",
                  "author": "whyisjake",
                  "text": "Mine is free, and open source. (And good!)",
                  "score": 1,
                  "created_utc": "2026-02-20 05:35:35",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o67mwy1",
              "author": "billdietrich1",
              "text": "I don't think it will pass.  It will get easier and easier to do these things.\n\nAnd it could be interesting.  Maybe eventually everyone can have their own custom apps, choosing features and modifying UI as they wish.  First step might be simplified versions of existing apps: I want my own copy of app X with features A and B deleted from it.",
              "score": 10,
              "created_utc": "2026-02-19 08:52:27",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o67qoxn",
                  "author": "jacrxggfc",
                  "text": "It's not necessarily a bad thing imo, i do benefit from few 'vibe coded' projects",
                  "score": 2,
                  "created_utc": "2026-02-19 09:30:04",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o68fak6",
              "author": "sassanix",
              "text": "I’m hoping someone figures out Reuters.",
              "score": 1,
              "created_utc": "2026-02-19 12:54:24",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o698mac",
              "author": "throwingrocksatppl",
              "text": "wtf is vibe coding",
              "score": 1,
              "created_utc": "2026-02-19 15:36:08",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o698ub1",
                  "author": "wyldstallyns111",
                  "text": "Using AI to write the program for you",
                  "score": 3,
                  "created_utc": "2026-02-19 15:37:13",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o67llqd",
          "author": "Tiendil",
          "text": "Vibe coders… Also, that may be a sign that there may be a lack of functionality in the existing readers, or a sign of an intrinsic need for reshaping the whole approach to news handling.",
          "score": 14,
          "created_utc": "2026-02-19 08:39:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o67m1wh",
              "author": "AdImpressive7394",
              "text": "I have never seen anything innovative or new in the last rss readers and all of them have the same design and same colors",
              "score": 6,
              "created_utc": "2026-02-19 08:43:57",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o67tbow",
                  "author": "Tiendil",
                  "text": "I don't say the new readers have innovations, I say that people are trying into innovations — it is different things :-)\n\nHowever, for example, there was a post recently about the news reader that smartly manages news visibility based on its topics and user behaviour. I've not fully comprehended how it works, but the idea looks good. Also, my reader generates tags (with LLMs) for news, and the user can score news by creating rules — I think it is quite a unique feature; however, the reader is not very new — a few years already.\n\nGenerally, it is how evolution works — people try things. With time, someone will have success, or will not :-)",
                  "score": 1,
                  "created_utc": "2026-02-19 09:55:59",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o67m2ao",
          "author": "billdietrich1",
          "text": "Same with password managers, a new one every week.",
          "score": 6,
          "created_utc": "2026-02-19 08:44:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o69k1qj",
              "author": "AdImpressive7394",
              "text": "Vibe coders are everywhere haha",
              "score": 1,
              "created_utc": "2026-02-19 16:31:22",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o688o07",
          "author": "nizerifin",
          "text": "Shew I’ve wondered the same thing. It seems like most of the posts on this subreddit are simply new RSS readers.",
          "score": 6,
          "created_utc": "2026-02-19 12:08:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o67p4sc",
          "author": "VinsonGuo",
          "text": "This is not a bad thing. Today RSS is almost forgotten, but people keep creating new apps, which will improve the influence of RSS. I believe many RSS seasoned users want to create their own RSS app, because they more or less have some unsatisfied points with current apps. Now with AI power, many tired work can be given to AI. We have more time to think and create. Very cool era",
          "score": 7,
          "created_utc": "2026-02-19 09:14:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o69julg",
              "author": "AdImpressive7394",
              "text": "The problem is that it makes a lot of noise and overshadows good projects. For example here we have a new rss reader everyday some, some subs blocks the autopromotion to avoid spam ... And to be honest rss project have a lower quality than before AI",
              "score": 2,
              "created_utc": "2026-02-19 16:30:25",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6hz16e",
                  "author": "pk9417",
                  "text": "Good projects will be these which will stay alive even after years",
                  "score": 1,
                  "created_utc": "2026-02-20 21:49:16",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o68g0lf",
          "author": "kevincox_ca",
          "text": "1. It is relatively easy to do. You can hand-code the core functionality in a weekend. Less if you reuse some existing libraries.\n2. It is a big part of many people's lives. So there are infinite workflows and tweaks that can be made to make your reader work just right for you.\n\nvibecoding made entry easier I'm sure. But there have always been a regular supply of new personal projects in this space. I don't think it'll ever end. It is such an open-ended design space due to the flexibility of RSS and the plethora of different use cases. Every single person on the planet would probably have a slightly different \"perfect\" feed reader. So those who have the time and ability will try to craft their own.\n\nSincerely, a guy who make his own feed reader because the available options were not quite to taste.",
          "score": 3,
          "created_utc": "2026-02-19 12:59:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o67oooj",
          "author": "DrMylk",
          "text": "Have i told you about the rss reader i'm writing? It has AI!",
          "score": 6,
          "created_utc": "2026-02-19 09:10:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o67s48c",
          "author": "arduinoRPi4",
          "text": "haha i think people are just discovering the magic & simplicity of RSS. i too am trying to make an RSS aggregator that prints out a physical copy in the style of a newspaper, its just cool stuff.",
          "score": 2,
          "created_utc": "2026-02-19 09:44:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o681pf5",
          "author": "Cachao-on-Reddit",
          "text": "In a sense I've been guilty of this (before the vibe coding flurry). It was driven by a genuine need: Miniflux etc. work but aren't fun to use.\n\n\nSo I sympathise with te vibe coders. And we should be pleased that RSS continues to receive attention.\n\n\nBut also surely we can improve the signal/noise ratio. I tune out all the new reader launches.",
          "score": 2,
          "created_utc": "2026-02-19 11:12:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o68hs0g",
          "author": "erikperik",
          "text": "Software inflation",
          "score": 2,
          "created_utc": "2026-02-19 13:10:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o69kul6",
              "author": "AdImpressive7394",
              "text": "And bullshit inflation also haha",
              "score": 0,
              "created_utc": "2026-02-19 16:35:12",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o68hx3u",
          "author": "tw2113",
          "text": "I hope most are pet projects/\"can I do this?\" type things for people who want a personal challenge or most readers they have found do everything they want except one to two things and they're like \"whelp, gonna have to create my dream reader myself\"",
          "score": 2,
          "created_utc": "2026-02-19 13:11:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o68ki4t",
          "author": "fumanchudrew",
          "text": "I built one, more of a step up from a 'hello world'/notes app that everyone starts with in development. I wanted something specific from my RSS reader(email digests so I don't have to use an app) and to test a server I built. I didn't vibe code, but used it to learn some new rails features and to test deployment scripts and dev ops. RSS is great for this, as it requires a bit more complexity than a notes app, but can still be created quickly with established patterns. \n\n\nI think some of them are vibe slop, but we all want to consume things in a specific way and if you have an itch to test something, why not build something you'll personally use? ",
          "score": 2,
          "created_utc": "2026-02-19 13:26:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6bgxap",
          "author": "renegat0x0",
          "text": "We have many programs - that is good.\n\n\nWe need to be able find sources. i have not seen that many feeds lists.\n\n\nI have created mine though\n\n\nhttps://github.com/rumca-js/Internet-feeds",
          "score": 2,
          "created_utc": "2026-02-19 22:02:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o68gut5",
          "author": "ZaldorNariash",
          "text": "it's just like pasta, some people make it all at home, others just buy it ready made, others instead know how to make simple ones and only buy the ones that cannot produce themselves. in every case nobody is harming others and everyone is free to get the pasta they like, making yours is great if you enjoy it. If you buy pasta from your neighborhood you take the risks. \nenjoy your pasta",
          "score": 1,
          "created_utc": "2026-02-19 13:04:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o69l9fk",
              "author": "AdImpressive7394",
              "text": "The problem is when you are flooded with pasta you are not able to discover good pasta",
              "score": 1,
              "created_utc": "2026-02-19 16:37:10",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6djvqk",
          "author": "Kenjiroxox",
          "text": "even if RSS isn’t “trendy,” the desire for an algorithm-free way to follow content hasn’t gone away. People keep thinking they can improve the UX, add a niche angle, or layer in AI summaries.",
          "score": 1,
          "created_utc": "2026-02-20 05:51:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6gvbrp",
          "author": "ddawall",
          "text": "There are still a lot of RSS feeds available. I made my council on aging's news and info website almost entirely of feeds, and use protopage with lot of feeds added for one of my start pages.",
          "score": 1,
          "created_utc": "2026-02-20 18:37:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6hmv9f",
          "author": "Tiny_Cow_3971",
          "text": "Mine is not vibe coded but a labour of love and for me an opportunity to learn rust. And it's a beautiful TUI RSS reader.\n\nhttps://github.com/christo-auer/eilmeldung",
          "score": 1,
          "created_utc": "2026-02-20 20:48:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6nj5id",
          "author": "Late_Dress_1203",
          "text": "Es cierto brotan como callampas,y de todos no se hace uno",
          "score": 1,
          "created_utc": "2026-02-21 19:49:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ofuon",
          "author": "simplify3",
          "text": "oh, it's great. It doesn't matter how people get the programming bug, even if they use AI to make it for them. Maybe 50,000 people will create new RSS readers but out of that 50,000 some of them will create other projects and then other projects, and then some unique things will blossom forth overtime. let them cook.",
          "score": 1,
          "created_utc": "2026-02-21 22:43:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o67qcae",
          "author": "slowaccident",
          "text": "I keep seeing data that shows the market growing amid increasing frustration with social feeds. \n\nAnyway, check out my rss reader https://newsagent.fyi",
          "score": 1,
          "created_utc": "2026-02-19 09:26:33",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r84389",
      "title": "Current - An RSS reader that doesn't count",
      "subreddit": "rss",
      "url": "https://www.reddit.com/r/rss/comments/1r84389/current_an_rss_reader_that_doesnt_count/",
      "author": "georgehotelling",
      "created_utc": "2026-02-18 14:14:14",
      "score": 16,
      "num_comments": 19,
      "upvote_ratio": 0.79,
      "text": "https://www.terrygodier.com/current\n\n> Every RSS reader I've used presents your feeds as a list to be processed. Items arrive. They're marked unread. Your job is to get that number to zero, or at least closer to zero than it was yesterday.\n\n> Current has no unread count. Not because I forgot to add one, or because I thought it would look cleaner without it. There is no count because counting was the problem.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/rss/comments/1r84389/current_an_rss_reader_that_doesnt_count/",
      "domain": "self.rss",
      "is_self": true,
      "comments": [
        {
          "id": "o63ld2e",
          "author": "crunchberrykid",
          "text": "hey, i made this! thanks for sharing :) ",
          "score": 7,
          "created_utc": "2026-02-18 18:33:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o65ffnm",
              "author": "TurnipGirlDesi",
              "text": "Would you consider lowering the price? $10 seems a bit steep\n\nIt would also be nice if there was an Android version, I’m planning to switch to GrapheneOS once I ditch my iPhone and (assuming you do lower the price and allow for crossplatform licensing) I would like to be able to take the reader with me when I make the switch.",
              "score": 3,
              "created_utc": "2026-02-18 23:46:27",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o66o0iv",
                  "author": "_KangaDrew_",
                  "text": "$16 AUD and no trial period? Straight to  instant purchase? 😕\n\nI wanna say yay, but buying something without testing is an instant nay.",
                  "score": 3,
                  "created_utc": "2026-02-19 04:06:40",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o64ou9t",
              "author": "capnofasinknship",
              "text": "This seems extremely well thought out and complete. I appreciate your write up on the website. I got to the part about things aging out and my next thought was “it would be great if you could set your own durations for timing out” and that was your next paragraph. I’ll probably buy it as the “inbox zero” has been a sticking point for me with other readers.",
              "score": 3,
              "created_utc": "2026-02-18 21:34:31",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o65fp74",
              "author": "doffdo",
              "text": "This is actually what I have in mind when reading my rss list. Thank you I will check it out soon!",
              "score": 2,
              "created_utc": "2026-02-18 23:47:56",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o67hfsd",
              "author": "AgreeableWeb4899",
              "text": "seems great, but no trial? ",
              "score": 1,
              "created_utc": "2026-02-19 07:59:06",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o68uy8i",
              "author": "georgehotelling",
              "text": "Does it work with FreshRSS? Does it mark anything as read on the server?",
              "score": 1,
              "created_utc": "2026-02-19 14:25:19",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o63jmre",
          "author": "srinitata",
          "text": "can there be a trial to test it out?",
          "score": 3,
          "created_utc": "2026-02-18 18:25:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o65m5mt",
          "author": "tw2113",
          "text": "Why is having a displayed count a problem?",
          "score": 3,
          "created_utc": "2026-02-19 00:23:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o68fs39",
              "author": "georgehotelling",
              "text": "I thought that the first few paragraphs of the link answered that pretty well:\n> \n> I started building Current before I had the words for why.\n> \n> The impulse was simpler than a philosophy: every RSS reader I tried made me feel bad. Not because the apps were ugly or broken (most were quite good) but because they all seemed to agree on something I didn't. That reading the internet was a task. That articles were items to be processed. That falling behind was a failure state.\n> \n> I didn't have a name for this yet. I just knew I wanted a reader that didn't make me feel like I owed it something.\n> \n> The app was nearly finished when I sat down, in January, to write about what I'd been building against. I traced the feeling back to Brent Simmons and NetNewsWire in 2002, a pragmatic design decision that calcified into convention. I named the feeling phantom obligation: the guilt you feel for something no one asked you to do.",
              "score": 2,
              "created_utc": "2026-02-19 12:57:30",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o68hj0l",
                  "author": "tw2113",
                  "text": "If you're overwhelmed by volume, reduce what you subscribe to, and don't try to \"read the internet\". Subscribe to the content you actually want to read, and just delete the article entries in your feed reader that you don't necessarily care to read from what comes in at that point.\n\nThe joy of RSS is you control the content pool.",
                  "score": 1,
                  "created_utc": "2026-02-19 13:08:39",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o64zp4z",
          "author": "aygross",
          "text": "This looks so cool\nAny chance for Android/windows versions?",
          "score": 1,
          "created_utc": "2026-02-18 22:24:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6cdbsz",
          "author": "reelfright",
          "text": "The thing I've learned about this concept (both from buying this app and trying out the revamp of Reeder) is that I actually like have a count and clear start/stop point. I find satisfaction in clearing the queue. So what would work best for me is an app with as much meticulous attention to detail as Current, but that gamifies or rewards you for reading articles and clearing your unread list. Maybe something that even gives stats like number or articles or word count read, like a Spotify Wrapped for reading.\n\nWith all that said, if the concept intrigues you, check the app out. Even though I've already gone back to News Explorer, I don't regret dropping the $10 to support the developer.",
          "score": 1,
          "created_utc": "2026-02-20 01:06:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6cvksh",
          "author": "krypthos",
          "text": "Any plans for iOS widgets?",
          "score": 1,
          "created_utc": "2026-02-20 02:58:13",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r6y0bb",
      "title": "I'm building an RSS reader with a social layer - would love honest feedback from this community",
      "subreddit": "rss",
      "url": "https://www.reddit.com/r/rss/comments/1r6y0bb/im_building_an_rss_reader_with_a_social_layer/",
      "author": "thedazellama",
      "created_utc": "2026-02-17 05:54:56",
      "score": 9,
      "num_comments": 16,
      "upvote_ratio": 0.77,
      "text": "Hey r/rss. I've been building an app called Newsie ([newsieapp.com](https://newsieapp.com/)) and wanted to get some real feedback from people who actually care about RSS.\n\nThe short version: it's a feed reader where you can also follow friends and see what they're reading and sharing. Think Google Reader's social features meets a modern RSS client. You follow websites, save articles, and optionally share things with friends who are also on the app.\n\nI built it because I missed the social side of Google Reader. I still use RSS daily, but I wanted a way to see what articles my friends found interesting without relying on Twitter/X or algorithmic feeds to surface that stuff.\n\n**Where it's at right now:**\n\n* Progressive web app (works on mobile and desktop, no app store download needed)\n* Free, no paid tier, no ads\n* Supports RSS/Atom, OPML import\n* Folders, read/unread, favorites\n* Social feed: follow friends, share articles, comment on shared posts\n* Still early - I'm a solo developer iterating based on user feedback\n\n**What I'm genuinely wrestling with:**\n\n1. For those of you who remember Google Reader's social features - is that something you actually miss, or is it nostalgia? Would you want social in your feed reader, or do you prefer keeping reading as a solo activity?\n2. I've been trying to make the app approachable for people who don't know what \"RSS\" means (using language like \"follow a website\" instead of \"add an RSS feed\"). Does that feel dumbed down to power users, or do you appreciate the clarity?\n3. What's the one thing that would make you actually try a new reader? I know switching costs are real.\n\nNot trying to sell anyone anything here. Just a solo dev looking for honest takes from the people who know this space best.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/rss/comments/1r6y0bb/im_building_an_rss_reader_with_a_social_layer/",
      "domain": "self.rss",
      "is_self": true,
      "comments": [
        {
          "id": "o5tlko6",
          "author": "darth_snuggs",
          "text": "I’d be interested in having a way to share files in a sort of ‘shared folder,’ e.g. if I’m working on a project with someone and we want to share relevant articles/posts in some easily accessible mutual spot. I’m just starting & haven’t settled on a reader yet so I’ll keep an eye on this :)",
          "score": 2,
          "created_utc": "2026-02-17 06:08:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5tmhco",
              "author": "thedazellama",
              "text": "Great suggestion. Thank you for the feedback. So you mean something like instead of broadcasting an individual article to all of your friends/followers, you'd have a shared folder with a special set of friends/followers that you could all curate together... am I getting that right?",
              "score": 1,
              "created_utc": "2026-02-17 06:16:20",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5tq1mp",
          "author": "RatioMutatio",
          "text": "I like my RSS and socials separate. Feeds are one-way, broadcast type, media. Social is two-way. It feels like apps that try to bridge them fail to get either right most of the time.\n\nI’m also wrenching on an RSS app and for what it’s worth I landed on “Channel” and “Subscribe” for the key language. Again, due to the broadcast orientation of RSS, TV/radio language works well I think. Also, YouTube “like and subscribe” is pretty well drilled into everyone’s heads at this point.\n\nI’ll give pretty much anything a go that’ll eat my OPML. I’d say the biggest hurdle is signup. There’s always the doubt in my mind, “Is this going to be worth the unwanted emails?”\n\nSocial may not be my cup of tea but there’s definitely gains for whoever figures out how to make a seamless blended experience. It’s awesome seeing development in the space so keep up the good work.",
          "score": 1,
          "created_utc": "2026-02-17 06:46:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5tyed5",
              "author": "thedazellama",
              "text": "Thanks for the thoughtful reply. To clarify - Newsie doesn’t pull in any social media. The social layer is entirely within the app: you can follow other Newsie users and share articles from your RSS feeds with them. So it’s still RSS-first, with an optional way to see what your friends are reading. If that wasn’t clear in my post, that’s good feedback on how I’m describing it.\n\nReally interesting that you landed on “Channel” and “Subscribe” - I went through the same exercise and ended up with “Follow a website.” The broadcast/TV framing is smart though, I hadn’t thought of it that way.\nAnd your point about signup friction is noted. That “is this worth the unwanted emails” hesitation is real. Good thing to keep front of mind.\n\nCool that you’re building in the space too. What are you working on?",
              "score": 0,
              "created_utc": "2026-02-17 08:03:21",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5u75kr",
          "author": "whatshouldidotoknow",
          "text": "Looks real good, How do you get the data from the websites? Im a new dev.  \nAnd also it would be great if we can have filtered news being ingested, Like Tech news only , or something of that sort",
          "score": 1,
          "created_utc": "2026-02-17 09:27:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5v18sq",
          "author": "ericdano",
          "text": "Doesn’t Newsblur already do this? And it’s open sourced…..",
          "score": 1,
          "created_utc": "2026-02-17 13:24:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5vm5zc",
          "author": "ambiance6462",
          "text": "I’ll just text my friend an article to talk about it",
          "score": 1,
          "created_utc": "2026-02-17 15:16:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5yqh74",
          "author": "ulcweb",
          "text": "WHY TF DID IT ASK FOR MY LOCATION",
          "score": 1,
          "created_utc": "2026-02-18 00:27:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o66jbww",
              "author": "thedazellama",
              "text": "There is no geolocation feature in Newsie. The codebase never calls navigator.geolocation or any browser location API.\n\nThere is a Browser Notification permission prompt for a partially implemented push notification feature. Is it possible that's what you saw?",
              "score": 1,
              "created_utc": "2026-02-19 03:37:04",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6c8o5m",
                  "author": "ulcweb",
                  "text": "Yeah that's what I saw, and I was like nope I'm out. lol",
                  "score": 1,
                  "created_utc": "2026-02-20 00:38:12",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o66i2an",
          "author": "ItzPress",
          "text": "I've been looking for an app or way to share feeds with others so this is looking great. I'm just wondering if making the profile public is working or not, since it seems I can't check out my own profile and shares if not logged in.",
          "score": 1,
          "created_utc": "2026-02-19 03:29:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o66ionm",
              "author": "thedazellama",
              "text": " If what you mean is: when I have my profile sent to public, is it visible to the open web? Then the answer to that as a no. setting your profile as public only allows other Newsie users to find you.\n\nIf what you want is a publicly accessible URL I could probably build that if you want.",
              "score": 1,
              "created_utc": "2026-02-19 03:33:00",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o66jdb9",
                  "author": "ItzPress",
                  "text": "A publicly accessible URL was what I was looking for, and I think would be nice functionality to add as an option for the user, thanks!",
                  "score": 1,
                  "created_utc": "2026-02-19 03:37:18",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1r6l67i",
      "title": "I built a free, private RSS dashboard that runs entirely in your browser (No servers, no accounts)",
      "subreddit": "rss",
      "url": "https://www.reddit.com/r/rss/comments/1r6l67i/i_built_a_free_private_rss_dashboard_that_runs/",
      "author": "HugeCuriousPenguin",
      "created_utc": "2026-02-16 20:37:26",
      "score": 8,
      "num_comments": 8,
      "upvote_ratio": 0.83,
      "text": "Hey everyone, I wanted a simple, visual way to organize my feeds into widgets and tabs without having to pay for a subscription or set up any server.\n\nI ended up building a **static dashboard**. This means it runs entirely in your web browser—there is no server, and you don’t even need to create an account.\n\nQuick Demo: [https://rozhovetskyi.github.io/Dashboard/demo](https://rozhovetskyi.github.io/Dashboard/demo)\n\n**What it can do:**\n\n* **Thematic Tabs:** You can group feeds into specific topics (like \"Tech,\" \"Global News,\" or \"Finance\") to keep things organized and avoid distractions.\n* **Keep the widgets clean:**  You can set widgets to only show stories from the last N days (e.g., nothing older than 3 days) and limit the total number of items displayed.\n* **RSS & Google News:** Full support for standard feeds and specific Google News topics.\n* **Custom Widgets:** I added support for HTML widgets so you can embed things like weather, clocks, or stock tickers.\n\n**Why I built it this way:**\n\n* **Everything stays on your machine:** Your feed list and settings are saved in your browser's local storage. No data ever leaves your computer.\n* **Zero Setup:** You can use the live link above, or literally just download the code to your desktop and open the HTML file. It doesn't need a server to work.\n* **Portable:** You can export your entire layout to a file and import it on another device.\n\n**How to use it:**\n\n* **The Easy Way:** Just open the [https://rozhovetskyi.github.io/Dashboard/](https://rozhovetskyi.github.io/Dashboard/) and start adding feeds.\n* **Complex Way:** Grab the code from [https://github.com/Rozhovetskyi/Dashboard](https://github.com/Rozhovetskyi/Dashboard) and host it yourself or run it locally or fork to you github.\n\nI’d love to hear your thoughts or if there are any features you think are missing! :)",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/rss/comments/1r6l67i/i_built_a_free_private_rss_dashboard_that_runs/",
      "domain": "self.rss",
      "is_self": true,
      "comments": [
        {
          "id": "o5rawe2",
          "author": "kevincox_ca",
          "text": "I was curious how this dealt with CORS. It seems that there is actually a sever involved. It seems to call an API to fetch (and parse) the feeds.\n\nhttps://api.rss2json.com/v1/api.json?rss_url=https%3A%2F%2Fkevincox.ca",
          "score": 3,
          "created_utc": "2026-02-16 21:44:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5sb1bo",
              "author": "roleohibachi",
              "text": "Is this the same way other hosted readers work? Inoreader, Nextcloud News, etc etc",
              "score": 1,
              "created_utc": "2026-02-17 01:01:08",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5sbzwk",
                  "author": "kevincox_ca",
                  "text": "I doubt it. They probably fetch the feed from their backend, not a third-party service.",
                  "score": 2,
                  "created_utc": "2026-02-17 01:06:47",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o5u69fg",
              "author": "HugeCuriousPenguin",
              "text": "Spot on. Since standard RSS feeds don't support CORS for direct browser fetching, a proxy is necessary for a static frontend to work.\n\nMy goal was to eliminate **server management for the user**. I’ve just moved from `rss2json` to my own server so the user gets a zero-setup experience without a third-party.\n\nIn the future, it might be a good idea to add a config option so users can choose which service or self-hosted proxy they want to use for fetching the JSONs",
              "score": 1,
              "created_utc": "2026-02-17 09:18:36",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o67ze5t",
                  "author": "nwydo",
                  "text": "Wait but the title says no servers, not sure I get the value prop then. Also your post & comments sound very LLM generated making them a little hard to parse",
                  "score": 1,
                  "created_utc": "2026-02-19 10:52:20",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6cykco",
          "author": "This-You-2737",
          "text": "honestly this is pretty much what most people need and never build. the tab grouping thing alone saves so much mental noise. only real limitation i notice is local storage gets messy when you want the same setup on your work and home machine. people doing more than personal reading tend to drift toward stuff like Domo or similar where the feeds connect into bigger data workflows. but for solo personal use this hits the right notes",
          "score": 1,
          "created_utc": "2026-02-20 03:17:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6hh2w0",
              "author": "HugeCuriousPenguin",
              "text": "Thank you for the feedback!",
              "score": 1,
              "created_utc": "2026-02-20 20:20:16",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1raz1qo",
      "title": "Reeder remove shorts youtube feed",
      "subreddit": "rss",
      "url": "https://www.reddit.com/r/rss/comments/1raz1qo/reeder_remove_shorts_youtube_feed/",
      "author": "fromtibo",
      "created_utc": "2026-02-21 18:46:44",
      "score": 5,
      "num_comments": 5,
      "upvote_ratio": 0.85,
      "text": "Is there a way to remove shorts from a YouTube feed in the Reeder app?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/rss/comments/1raz1qo/reeder_remove_shorts_youtube_feed/",
      "domain": "self.rss",
      "is_self": true,
      "comments": [
        {
          "id": "o6qnckt",
          "author": "macieklamberski",
          "text": "Check your YT feed URL to get type you want.\n\nAll videos are either:\n\n* https://www.youtube.com/feeds/videos.xml?channel\\_id=UC<CHANNEL\\_ID>\n* https://www.youtube.com/feeds/videos.xml?playlist\\_id=UU<CHANNEL\\_ID> \n\nOthers types:\n\n* Long-form only: https://www.youtube.com/feeds/videos.xml?playlist\\_id=UULF<CHANNEL\\_ID>\n* Shorts only: https://www.youtube.com/feeds/videos.xml?playlist\\_id=UUSH<CHANNEL\\_ID>\n* Live streams only: https://www.youtube.com/feeds/videos.xml?playlist\\_id=UULV<CHANNEL\\_ID>",
          "score": 7,
          "created_utc": "2026-02-22 08:09:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6qo9qr",
              "author": "fromtibo",
              "text": "Thank you!",
              "score": 0,
              "created_utc": "2026-02-22 08:18:32",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6n8rtd",
          "author": "cheyrn",
          "text": "A reader app could ignore shorts based on \"/shorts/\" being in the URL.",
          "score": 1,
          "created_utc": "2026-02-21 18:56:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6n8x1n",
              "author": "fromtibo",
              "text": "But in Reeder in particular?",
              "score": 0,
              "created_utc": "2026-02-21 18:56:57",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6p28mj",
                  "author": "cheyrn",
                  "text": "Ah. Sorry no.",
                  "score": 1,
                  "created_utc": "2026-02-22 00:59:12",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1r9nl3n",
      "title": "Best way to let people subscribe to my RSS feed using email without an external service?",
      "subreddit": "rss",
      "url": "https://www.reddit.com/r/rss/comments/1r9nl3n/best_way_to_let_people_subscribe_to_my_rss_feed/",
      "author": "Arkholt",
      "created_utc": "2026-02-20 06:09:00",
      "score": 4,
      "num_comments": 15,
      "upvote_ratio": 0.75,
      "text": "Feedburner used to have the ability for readers to subscribe by email and get a message every time the RSS feed updated. This functionality hasn't existed for a few years now. I now use follow.it for this, which works fine and is free, but I have no control over what the email looks like, and it often has ads and such in it.\n\nI feel like there should be a way to do this without signing up for some kind of service. How difficult is it actually to have an email sent to someone each time a feed updates? It doesn't seem like it should be that hard to connect the two, but I have searched around for a solution and haven't had much luck.\n\nEDIT: It seems I didn't explain my situation well enough, so let me try again:\n\nHere’s what I want to do:\n\nI have a blog RSS feed. I want someone to be able to click a button, enter their email address, and get an email each time my RSS feed updates, which includes the full text of the feed item. It would work exactly the same as if you subscribed to the RSS feed using an RSS feed reader, but it just arrives in your email.\n\nFeedburner used to be able to do this, but they removed this functionality a while ago (and I don’t know if Feedburner is still even a thing). Currently I use a thing called follow.it which does this, but they insert a bunch of ads and whatnot into it which I don’t like (because I’m sure not making any money from that). It would be nice to not have to use an external service like that at all, and instead put something on my webhost that checks the feed and each time there’s an update sends out an email to everyone on the list.\n\nI can think of an easy enough way to do this manually, by just collecting an email address from everyone who wants to subscribe, and copypasting the blog post into an email that I send out right after I post something. But it would be nice to be able to automate that somehow.\n\nMaybe I’m just ignorant, but this seems like a very simple process, and yet, given all my research, this seems either very difficult or nearly impossible to do, and I’m not sure why.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/rss/comments/1r9nl3n/best_way_to_let_people_subscribe_to_my_rss_feed/",
      "domain": "self.rss",
      "is_self": true,
      "comments": [
        {
          "id": "o6eprli",
          "author": "ShoeRepaired_KeysCut",
          "text": "[https://feedrabbit.com/](https://feedrabbit.com/)",
          "score": 2,
          "created_utc": "2026-02-20 12:04:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6gikn9",
              "author": "Arkholt",
              "text": "This seems great if I want to subscribe to feeds myself, but I want something that will allow others to subscribe to my feed with their emails.",
              "score": 1,
              "created_utc": "2026-02-20 17:39:45",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6pbqif",
                  "author": "ShoeRepaired_KeysCut",
                  "text": "Well then you're going to pay for it... [https://alternativeto.net/software/follow-it/](https://alternativeto.net/software/follow-it/)\n\n",
                  "score": 1,
                  "created_utc": "2026-02-22 02:00:13",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6eyny0",
          "author": "kevincox_ca",
          "text": "I'm not quite sure what you are looking for. You need some service to check the feed and send emails. You can self-host but you need something to do the connection.",
          "score": 2,
          "created_utc": "2026-02-20 13:04:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6gioki",
              "author": "Arkholt",
              "text": "What I want to achieve is for someone to be able to subscribe to the feed using email, the way Feedburner used to be able to, but to be able to do so with something that I have on my own web host, rather than having to connect to something like Feedburner or Follow.it. Rather than subscribing to RSS and reading it in a feed reader, each time the feed updates they will receive an email which contains the feed item. Also the email would contain the full text of the feed item, and would not simply be a notification that there's a new post.",
              "score": 1,
              "created_utc": "2026-02-20 17:40:15",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6gp5wu",
                  "author": "kevincox_ca",
                  "text": "But FeedBurner is an external service? So it wouldn't fit your requirements.",
                  "score": 1,
                  "created_utc": "2026-02-20 18:09:44",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6g4fc5",
          "author": "Ok_Antelope_1953",
          "text": "not really. you'll need to use a service that can send emails. email delivery is a whole can of worms that's best left to the specialized providers.",
          "score": 2,
          "created_utc": "2026-02-20 16:34:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6dmr54",
          "author": "Traditional-Owl7365",
          "text": "I would  join  that",
          "score": 1,
          "created_utc": "2026-02-20 06:15:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6dnx0p",
          "author": "No_File1836",
          "text": "I use blogtrottr.com for rss to email.",
          "score": 1,
          "created_utc": "2026-02-20 06:25:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6gijaj",
              "author": "Arkholt",
              "text": "This seems great if I want to subscribe to feeds myself, but I want something that will allow others to subscribe to my feed with their emails.",
              "score": 1,
              "created_utc": "2026-02-20 17:39:35",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6dqj6y",
          "author": "Traditional-Owl7365",
          "text": "It very difficult 😕",
          "score": 1,
          "created_utc": "2026-02-20 06:48:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6e8ikq",
          "author": "chebatron",
          "text": "I’m not exactly sure what you’re trying to achieve. People who signed up to your feed will get the ne post and will read it in their reader whenever it’s convenient for them. You’re duplicating the functionality that is built into the protocol. Moreover, feeds are anonymous (by default, you can generate unique feed URLs but that’s extra) and email notifications require you collecting and keeping personally identifiable information which opens you to certainliabilities.\n\nAnyway, your users can automate this with [IFTTT](https://ifttt.com/search/query/email%20rss) (or alternatives like Zapier). If you’re using WordPress there are plugins that send out email when a new post appears, similar functionality eists in many other plogging platforms. It’s functionaly similar to what you’re asking.",
          "score": 1,
          "created_utc": "2026-02-20 09:37:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6gg7nz",
              "author": "Arkholt",
              "text": "What I want to achieve is for someone to be able to subscribe to the feed using email, the way Feedburner used to be able to, but to be able to do so with something that I have on my own web host, rather than having to connect to something like Feedburner or Follow.it. Rather than subscribing to RSS and reading it in a feed reader, each time the feed updates they will receive an email which contains the feed item. Also the email would contain the full text of the feed item, and would not simply be a notification that there's a new post.",
              "score": 1,
              "created_utc": "2026-02-20 17:28:43",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6gccsl",
          "author": "kevotheclone",
          "text": "Maybe build in it Node-RED?",
          "score": 1,
          "created_utc": "2026-02-20 17:10:48",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r8j7xh",
      "title": "Zephyr: Rss Reader",
      "subreddit": "rss",
      "url": "https://www.reddit.com/r/rss/comments/1r8j7xh/zephyr_rss_reader/",
      "author": "_janc_",
      "created_utc": "2026-02-18 23:37:15",
      "score": 4,
      "num_comments": 10,
      "upvote_ratio": 0.75,
      "text": "Rediscover the joy of reading without the noise.\n\n• Privacy-first: Your data stays yours, no accounts needed.\n\n• Customizable: Folders, dark mode\n\n• Filter feeds by keywords\n\nKeep all your favorite news, blogs, and updates in clean feeds. No ads, no tracking, no distractions — just the stories that matter to you. With smart syncing, your content is always ready when you are.\n\nFree for first 50 feed sources. You can added unlimited feed sources when subscribed to monthly, yearly or perpetual license.\n\n[https://apps.apple.com/app/zephyr-rss-reader/id6756065855](https://apps.apple.com/app/zephyr-rss-reader/id6756065855)",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/rss/comments/1r8j7xh/zephyr_rss_reader/",
      "domain": "self.rss",
      "is_self": true,
      "comments": [
        {
          "id": "o66x1lt",
          "author": "theredhype",
          "text": "In the age of vibecoding we get a new RSS app every day! Problem is... they're mostly the same, and we didn't really even need another one. ",
          "score": 13,
          "created_utc": "2026-02-19 05:08:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o674f6p",
              "author": "_janc_",
              "text": "You're right, there are a ton of readers out there! I honestly built this one because I couldn't find a modern option that combined keyword filtering with a strict no-tracking policy and local storage. It might not be for everyone, but for people who want a clean reading experience without the hidden tracking, I think it fills a gap!",
              "score": 4,
              "created_utc": "2026-02-19 06:05:38",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o679j63",
              "author": "lilacomets",
              "text": "Which non vibe coded RSS app do you use? 🧐 Looking for one currently.",
              "score": 1,
              "created_utc": "2026-02-19 06:48:26",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o67caux",
                  "author": "domysee",
                  "text": "I wrote an article listing many different options, maybe that's helpful: [https://lighthouseapp.io/blog/feed-reader-deep-dive](https://lighthouseapp.io/blog/feed-reader-deep-dive)",
                  "score": 2,
                  "created_utc": "2026-02-19 07:12:19",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o66i1i2",
          "author": "cheyrn",
          "text": "It's unique feature is that it has a cost?",
          "score": 3,
          "created_utc": "2026-02-19 03:29:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o66lq9y",
              "author": "_janc_",
              "text": "Actually, the app is completely free for up to 50 feed sources. We only charge for the unlimited tier to support development since we don't run ads or track any user data. Hope you give the free version a try!",
              "score": -3,
              "created_utc": "2026-02-19 03:52:00",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o670shr",
                  "author": "cheyrn",
                  "text": "I don't mean to be tearing the software down for having a cost. It sounds like a generic RSS reader. Why would someone pay for this one, instead of another for free?",
                  "score": 5,
                  "created_utc": "2026-02-19 05:36:53",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o67s67w",
          "author": "Aasemoon",
          "text": "Generally I think any new tool that can contribute to the popularisation of web feeds is a great idea. For my personal use-case though, it would be extremely hard to beat FreshRSS. ",
          "score": 2,
          "created_utc": "2026-02-19 09:44:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o68qj1n",
              "author": "_janc_",
              "text": "Thanks so much for the warm response. I built this one to be more for the zero setup, local first users who want privacy and filtering straight out of the box.",
              "score": 1,
              "created_utc": "2026-02-19 14:00:57",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1rbvvfn",
      "title": "Looking for an adequate RSS newsfeed",
      "subreddit": "rss",
      "url": "https://www.reddit.com/r/rss/comments/1rbvvfn/looking_for_an_adequate_rss_newsfeed/",
      "author": "Briky37",
      "created_utc": "2026-02-22 20:01:03",
      "score": 4,
      "num_comments": 8,
      "upvote_ratio": 1.0,
      "text": "I'd like to find an RSS newsfeed which doesn't hit me with breaking news every 10 minutes, but rather delivers one or two clear reports in the morning and/or evening, so as not to flood my timeline. Does that sound familiar?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/rss/comments/1rbvvfn/looking_for_an_adequate_rss_newsfeed/",
      "domain": "self.rss",
      "is_self": true,
      "comments": [
        {
          "id": "o6tz3rl",
          "author": "fumanchudrew",
          "text": "My guy does this with email digests: www.feedzombie.com",
          "score": 2,
          "created_utc": "2026-02-22 20:14:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6ujba2",
              "author": "loudpersononthebus",
              "text": "feedrabbit.com also does this.",
              "score": 1,
              "created_utc": "2026-02-22 21:56:25",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6tx3qt",
          "author": "tw2113",
          "text": "Sounds like you want stuff delivered in an annual digest",
          "score": 1,
          "created_utc": "2026-02-22 20:04:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6u2suj",
          "author": "Grocery_Odd",
          "text": "look at [readinsync.com](http://readinsync.com) !",
          "score": 1,
          "created_utc": "2026-02-22 20:33:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ubcyb",
          "author": "postnumbers",
          "text": "Kagi News updates a list of stories in each of a number of categories that you can pick from once per day.",
          "score": 1,
          "created_utc": "2026-02-22 21:16:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6uh4xg",
          "author": "seeker1938",
          "text": "The free NetNewsWire RSS works with both Macs and Windows.\n\nI love its minimalist approach - not loaded with bells and whistles.  Simple and easy to use.",
          "score": -1,
          "created_utc": "2026-02-22 21:45:15",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1ra9yqp",
      "title": "I've added RSS feeds to my tech news aggregator - feeds by topic",
      "subreddit": "rss",
      "url": "https://www.reddit.com/r/rss/comments/1ra9yqp/ive_added_rss_feeds_to_my_tech_news_aggregator/",
      "author": "Objective_Farm_1886",
      "created_utc": "2026-02-20 22:41:14",
      "score": 3,
      "num_comments": 9,
      "upvote_ratio": 0.64,
      "text": "I'm happy to share that RSS feeds for news tags are now operating, so you can get a page like: [https://deadstack.net/tag/nvidia/](https://deadstack.net/tag/nvidia/)\n\nAnd get it in RSS - just add /rss to the end of any tag page:\n\n[https://deadstack.net/tag/nvidia/rss](https://deadstack.net/tag/nvidia/rss)\n\nSo you can load up your feed reader of choice with topic specific feeds, and get updates on the hour.\n\nBackground: DeadStack is a ruthless tech news filter: a real-time aggregator that reads hundreds of sources so you don’t have to. It hunts down the high-impact stories and surfaces them fast, stripped of fluff & hype. Maximum signal, minimum noise.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/rss/comments/1ra9yqp/ive_added_rss_feeds_to_my_tech_news_aggregator/",
      "domain": "self.rss",
      "is_self": true,
      "comments": [
        {
          "id": "o6o28zg",
          "author": "ResearchBuzz",
          "text": "Wow, nice! Didn't know about DeadStack, when did it launch? \n\n",
          "score": 2,
          "created_utc": "2026-02-21 21:30:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6okz1p",
              "author": "Objective_Farm_1886",
              "text": "No launch per se - this is just a personal side project; currently aggregating \\~150 sources.",
              "score": 3,
              "created_utc": "2026-02-21 23:13:32",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6ooazo",
                  "author": "ResearchBuzz",
                  "text": "It's good stuff. I'll link to it in ResearchBuzz Monday or Tuesday ",
                  "score": 2,
                  "created_utc": "2026-02-21 23:33:44",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6kqw4d",
          "author": "Saynete",
          "text": "Suggestion Tag : XSLT  \n  \n[PPC Land : Google targets RSS feeds in new XSLT removal proposal](https://ppc.land/google-targets-rss-feeds-in-new-xslt-removal-proposal/)\n\n[Justin Jackson : Don't kill my pretty RSS feed](https://justinjackson.ca/xslt)",
          "score": 1,
          "created_utc": "2026-02-21 09:27:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6mkzkp",
              "author": "Objective_Farm_1886",
              "text": "I rifled around on the site, and unfortunately didn't find any XSLT stories that broke the threshold to get to get published --- let me think on that a little, and what the options are.",
              "score": 1,
              "created_utc": "2026-02-21 16:57:59",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6n00mv",
                  "author": "Saynete",
                  "text": "thanks for it, need inspiration ? [https://atlasflux.saynete.net/atlas\\_des\\_flux\\_rss\\_ang\\_computer\\_xml\\_xslt.htm](https://atlasflux.saynete.net/atlas_des_flux_rss_ang_computer_xml_xslt.htm)",
                  "score": 1,
                  "created_utc": "2026-02-21 18:13:38",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1r85ni5",
      "title": "RSS Deck Updates",
      "subreddit": "rss",
      "url": "https://www.reddit.com/r/rss/comments/1r85ni5/rss_deck_updates/",
      "author": "mephistophelesbits",
      "created_utc": "2026-02-18 15:16:07",
      "score": 1,
      "num_comments": 0,
      "upvote_ratio": 0.57,
      "text": "RSS Deck updated to v1.3.0 🚢\n\n🤖 Now support Claude, gemini, OpenAI, MiniMax, Kimi and Ollama \n\n✅ Per-provider API key management \n\n✅ Inline reading column\n\n✅ Cleaner UI, faster workflow\n\nYour personal AI news dashboard just got smarter.\n\nhttps://github.com/mephistophelesbits/rssdeck",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/rss/comments/1r85ni5/rss_deck_updates/",
      "domain": "self.rss",
      "is_self": true,
      "comments": []
    }
  ]
}