{
  "metadata": {
    "last_updated": "2026-02-07 08:49:57",
    "time_filter": "week",
    "subreddit": "rss",
    "total_items": 7,
    "total_comments": 35,
    "file_size_bytes": 31298
  },
  "items": [
    {
      "id": "1qslcsb",
      "title": "Is there a ton of money in RSS? Seems like a new reader pops up everyday?",
      "subreddit": "rss",
      "url": "https://www.reddit.com/r/rss/comments/1qslcsb/is_there_a_ton_of_money_in_rss_seems_like_a_new/",
      "author": "loudpersononthebus",
      "created_utc": "2026-02-01 02:00:41",
      "score": 9,
      "num_comments": 29,
      "upvote_ratio": 0.68,
      "text": "Or is it just because an RSS reader is easy to spin up? I was on TorrentFreak the other day and the note for signing up for RSS says something along the lines of... \"if you started using the internet after the age of 2000 here are some other options to use..\" this was always my impression. It's an old protocol, very few people use it anymore... although I find it insanely useful for information. But there can't be much money in it, can it?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/rss/comments/1qslcsb/is_there_a_ton_of_money_in_rss_seems_like_a_new/",
      "domain": "self.rss",
      "is_self": true,
      "comments": [
        {
          "id": "o2wuh3d",
          "author": "iolairemcfadden",
          "text": "It’s easier to create apps with AI code and lots of people have preferences on how they want to view their rss feeds.",
          "score": 14,
          "created_utc": "2026-02-01 03:50:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o30d4je",
              "author": "loudpersononthebus",
              "text": "i totally get that. personally i subscribe to feedbin because it's minimalist, but after 2 years i think i might try something more minimalist. the issue is they got me hooked with the newsletter aliases. i really don't want to change all of those.",
              "score": 3,
              "created_utc": "2026-02-01 18:05:43",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o30rayg",
                  "author": "macieklamberski",
                  "text": "I'm Feedbin user for a few years now, too. Which parts would you want to be more minimalist?",
                  "score": 2,
                  "created_utc": "2026-02-01 19:09:20",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2x5fhb",
          "author": "redditjerome",
          "text": "Money comes from what you can get people to subscribe to.\n\n\nSome people subscribe to a toothbrush with a cellphone app or a toaster with an internet connection.",
          "score": 8,
          "created_utc": "2026-02-01 05:04:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2x876u",
          "author": "optimisticalish",
          "text": "It's now quite easy to ask an AI to generate ('vibe code') basic software like an RSS reader. This month's *PC Pro* magazine had a group-test.",
          "score": 3,
          "created_utc": "2026-02-01 05:25:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2xl1o7",
              "author": "optimisticalish",
              "text": "I should add that Google Gemini was the group-test winner for coding.",
              "score": 2,
              "created_utc": "2026-02-01 07:09:50",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2yo5nk",
                  "author": "vdotcodes",
                  "text": "Mindblowing. As someone who runs a software development agency and uses AI 8-12 hours a day for the last \\~1.5 years professionally, having had subscription to the $200/$250 tiers of all of the big 3, Gemini 3 Pro is by far the worst between Codex 5.2 Xhigh > Opus 4.5 >>> Gemini 3 pro.\n\nI will give Gemini the points on FE design. For some reason their aesthetic there is dramatically improved over the others.",
                  "score": 1,
                  "created_utc": "2026-02-01 12:55:13",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2ygw8s",
          "author": "gecike",
          "text": "It’s easy and fun to create your own RSS service with vibe coding. I know because I have a project like that too.\n\nThe people posting their SaaS here are mostly delusional, since no one is going to pay for a worse alternative to existing solutions like Inoreader or FreshRSS.",
          "score": 3,
          "created_utc": "2026-02-01 11:59:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2yt6wp",
          "author": "jsled",
          "text": "SMTP is an \"old\" protocol (and actually a procotol ;), and still gets used all the time. HTTP. POP. IMAP. Some things just work.\n\nnewsblur.com (currently) has 3749 premium users ($100/yr) and 3343 standard users ($36/yr), so that's … $500k/yr revenue. There can be money in it, sure. Good tools are good, and worth paying for.",
          "score": 4,
          "created_utc": "2026-02-01 13:28:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o38oi4g",
              "author": "bayareasoyboy",
              "text": "I've been a $36/year subscriber to NewsBlur for a while now, probably since Google Reader shut down. It's not perfect or polished, but it's extremely dependable and helps me to read things other than just short-form social media junk.",
              "score": 2,
              "created_utc": "2026-02-02 22:42:35",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2xpb52",
          "author": "billdietrich1",
          "text": "> is it just because an RSS reader is easy to spin up?\n\nThis.  RSS feeds are just XML files.  Parse the file, display the subjects, keep track of the links and the \"read\" status, be able to fetch and display articles, be able to download attachments.",
          "score": 2,
          "created_utc": "2026-02-01 07:48:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o30dpdn",
              "author": "macieklamberski",
              "text": "Agree, though doing any of those elements right is a project in itself.",
              "score": 1,
              "created_utc": "2026-02-01 18:08:18",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o30e7m5",
                  "author": "billdietrich1",
                  "text": "Yes, it's not trivial.  But using an AI, or maybe Electron, it's not VERY difficult.",
                  "score": 1,
                  "created_utc": "2026-02-01 18:10:34",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o306acv",
          "author": "geegeedee",
          "text": "Nah, RSS readers are essentially the \"Hello World\" projects for those who haven't done programming work, but just discovered AI development tools.",
          "score": 2,
          "created_utc": "2026-02-01 17:34:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o34u8dm",
          "author": "AdImpressive7394",
          "text": "I think a lot of people do this to add a line to their CV. They vibe coded something in a few days, advertise it on Reddit, and then bullshit their human ressources employer that they created a SAS used by hundreds of users.",
          "score": 2,
          "created_utc": "2026-02-02 10:38:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2wdpla",
          "author": "tw2113",
          "text": "I feel like there's a mixup of provider vs consumer here. Feed Readers are a dime a dozen. Parse XML, voila, you're a consumer. Providers are a different topic. Provide the content in an XML-capable format. At what cost? At what benefit? How much is it forgotten in 2026?",
          "score": 1,
          "created_utc": "2026-02-01 02:07:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2xi0mv",
          "author": "Tarun122",
          "text": "\\+1 thought i doubt that's earning them money idk... all of them start to look the same to me :)",
          "score": 1,
          "created_utc": "2026-02-01 06:43:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2xmdul",
          "author": "candlemasshallowmass",
          "text": "I think there's no money in this market.\n\nIt's pretty concentrated with the top players, all of which have plenty of features and offerings.\n\nOn the indie level, there's too many projects no one bothers to try for an extended period of time.\n\nThese are also pretty easy to code as a form of study or a quick app to try to make some money.",
          "score": 1,
          "created_utc": "2026-02-01 07:21:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2y6tvh",
          "author": "Tiendil",
          "text": "No, there is definitely not a lot of money in RSS, just look at the size of this subreddit :-)\n\nHowever, it looks like people still have some unmet needs in news aggregation and reading, and there are some big problems with news content in society, so people are trying to solve them in different ways. => Some money and opportunities are there.\n\nAs an example, I created a news aggregator to close my needs, and now I'm thinking about monetizing it, because \"why not?\" — It is quite unique. If there are people who think like me, I'll earn some money. If there are none of them, well, I'll get a string into my CV.",
          "score": 1,
          "created_utc": "2026-02-01 10:30:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2yg118",
          "author": "pk9417",
          "text": "RSS doesn't bring money, and there a lot of apps for this, because it's simple, and everyone has different UI preferences, it comes up to the function you need, so you can earn with it like 1,99$ to turn off the ads between articles or so, but that's it.",
          "score": 1,
          "created_utc": "2026-02-01 11:52:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o31jxlr",
          "author": "ResearchBuzz",
          "text": "I have been using RSS for 26 years. I couldn't do my work without it. \n\nI used NewsBlur and Feedly for ages until 2024 when I \"spun up,\" as you say, my own, a Node project that runs locally. It allowed me to create keyword filters for the feeds, a feature I couldn't find in available readers. I'm also monitoring about 7000 feeds, which gets a bit creaky with a web reader. \n\nIf you're something that' really really minimalist you may want to try the recently-launched IncogFeedo ( [https://incogfeedo.com/](https://incogfeedo.com/) )",
          "score": 1,
          "created_utc": "2026-02-01 21:27:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3divon",
          "author": "Odd-Anteater875",
          "text": "As someone who spent the last months working on an (yet unfinished) cloud-based RSS reader, I would say it is not trivial at scale. Even with AI. Reading a XML feed locally and rendering it is simple, of course. But that’s just the beginning. \n\nStuff that keeps me busy, beside trying to design the best UI:\n- finding the RSS feed on a website and selecting the best square icon for the site on broken real-world sites (while fighting invalid HTML, Cloudflare bot protection and similar challenges)\n- selecting a good image from the post body that represents the post and not the site or section\n- processing the HTML body in a way that allows features like YouTube videos and X tweets, makes even broken content look good (Slashdot…), but is still secure and does not break the reader’s HTML. \n- handling malevolent sites and content in a secure way\n- admin tools that allow checking user-submitted feeds, improve descriptions (with AI support) and cataloging them\n- designing an architecture that handles many thousands of feeds that constantly need to be polled, and stores millions of posts efficiently without breaking the bank\n- creating custom feeds that merge hundreds of sources into one feed\n\nI know what I signed up for. I have dreamed of doing this ever since Google Reader has been shut down, but never wanted to take on a side-project that takes more than a year to finish. Now, with Claude Code, I hope to finish a usable version in 4 month or so. I just wouldn’t call it an easy project :)",
          "score": 1,
          "created_utc": "2026-02-03 17:27:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o30ch82",
          "author": "billdietrich1",
          "text": "> very few people use it anymore\n\n\"Get a list of 41,493,824 websites using RSS ...\"\n\nfrom https://trends.builtwith.com/feeds/RSS/",
          "score": 1,
          "created_utc": "2026-02-01 18:02:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o38eubf",
          "author": "matakite808",
          "text": "“very few people use it” is baseless",
          "score": 0,
          "created_utc": "2026-02-02 21:54:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2z3uor",
          "author": "aygross",
          "text": "I agree barely anyone uses podcasts as well.",
          "score": -1,
          "created_utc": "2026-02-01 14:30:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o30bkz8",
              "author": "billdietrich1",
              "text": "> With over 584.1 million podcast listeners, the podcasting industry has grown rapidly over the past years. And by the end of 2026, the number of podcast listeners worldwide is estimated to reach 619 million. \n\n> In the U.S. alone, 55% of the population, around 158 million people, listen to podcasts every month.\n\nfrom https://podcastatistics.com/",
              "score": 2,
              "created_utc": "2026-02-01 17:58:56",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o30yi4a",
                  "author": "aygross",
                  "text": "R/whoosh\nI'm aware \nI was telling the op he has no idea what he's talking about",
                  "score": 1,
                  "created_utc": "2026-02-01 19:43:09",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qvvbv9",
      "title": "Looking for a free modern desktop RSS app",
      "subreddit": "rss",
      "url": "https://www.reddit.com/r/rss/comments/1qvvbv9/looking_for_a_free_modern_desktop_rss_app/",
      "author": "Nic727",
      "created_utc": "2026-02-04 17:45:35",
      "score": 6,
      "num_comments": 7,
      "upvote_ratio": 0.8,
      "text": "Hi,\n\nI'm looking for a free app to be able to create my own feeds with websites I want to follow, or even YouTube channel.\n\nI didn't find anything yet.\n\nOn IOS, I use *Feeeed* which is awesome (no account, free, work with any websites), but I can't find anything similar on Windows desktop.\n\nI installed *\"FeedPal\"* plugin on my browser, but it's not ideal since it gives me updates for all my bookmarks and doesn't work with YouTube.\n\nThank you very much",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/rss/comments/1qvvbv9/looking_for_a_free_modern_desktop_rss_app/",
      "domain": "self.rss",
      "is_self": true,
      "comments": [
        {
          "id": "o3pw15x",
          "author": "pauladams_red",
          "text": "FeedFlow is good https://www.feedflow.dev/\n\nNot sure if it’s exactly what you’re looking for but worth a look",
          "score": 3,
          "created_utc": "2026-02-05 14:10:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3xir98",
              "author": "Nic727",
              "text": "I tried it. I don't like the integrated reader as it is hard to read. But maybe it will get better.",
              "score": 1,
              "created_utc": "2026-02-06 16:59:16",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3otrlk",
          "author": "hbHPBbjvFK9w5D",
          "text": "Thunderbird allows RSS feeds",
          "score": 2,
          "created_utc": "2026-02-05 09:24:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3p9dbr",
              "author": "billdietrich1",
              "text": "I had bad luck with Thunderbird RSS a few years ago.  It rejected feeds that worked on other clients.  I'm on Akregator now, which has its own set of quirks, but generally works.",
              "score": 1,
              "created_utc": "2026-02-05 11:46:10",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3xicu9",
          "author": "maalicious",
          "text": "Vivaldi browser has integrated feed reader",
          "score": 2,
          "created_utc": "2026-02-06 16:57:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3q6iex",
          "author": "ajay9452",
          "text": "try newsboat.",
          "score": 1,
          "created_utc": "2026-02-05 15:05:22",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qvzgsv",
      "title": "Improved Feedly Product Offering - Features of Interest",
      "subreddit": "rss",
      "url": "https://www.reddit.com/r/rss/comments/1qvzgsv/improved_feedly_product_offering_features_of/",
      "author": "Grocery_Odd",
      "created_utc": "2026-02-04 20:11:58",
      "score": 3,
      "num_comments": 4,
      "upvote_ratio": 1.0,
      "text": "I am looking to build an improved product over Feedly, and was curious if anyone had any common issues/features of interest they'd want in a new aggregated feed source.\n\nSome features I am already looking to incorporate\n\n* Free/cheap AI integration - provided summaries of new sources, grouped by category or across all sources\n* Recommendations based on similar sources, or based on sources across users\n* WSJ/paid source integration, offering pooled access to these otherwise paid subscriptions\n\nPlease feel free to comment or reach out with any ideas here.\n\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/rss/comments/1qvzgsv/improved_feedly_product_offering_features_of/",
      "domain": "self.rss",
      "is_self": true,
      "comments": [
        {
          "id": "o3n37xs",
          "author": "pollote",
          "text": "allow comments by other readers (like Hacker News), filters, banned word(s),  avoid duplicated, alerts for certain topics (to telegram, WhatsApp,etc) allow extension, hopefully open source, decentralized  ....",
          "score": 2,
          "created_utc": "2026-02-05 01:43:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3oxrdu",
              "author": "macieklamberski",
              "text": "\\> allow comments by other readers\n\nIs this something you saw some feed readers offer? I was interested in such functionality myself, some kind of feedback to posts, though couldn't find any examples of that.",
              "score": 1,
              "created_utc": "2026-02-05 10:03:19",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3q95bf",
                  "author": "pollote",
                  "text": "Not until now, I think smart comments from other people it was the golden era for the forums, aggregator news like Hacker news, etc,  even if you don't agree with them, and AI can do the filtering for trolls if local censoring is needed.",
                  "score": 2,
                  "created_utc": "2026-02-05 15:18:32",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3nl38s",
          "author": "pumpkineaterx",
          "text": "A more compact display of article summaries, more like the Google Android Deaktop News Feee",
          "score": 2,
          "created_utc": "2026-02-05 03:26:07",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qumglc",
      "title": "Need recommendations for news feed",
      "subreddit": "rss",
      "url": "https://www.reddit.com/r/rss/comments/1qumglc/need_recommendations_for_news_feed/",
      "author": "reaznval",
      "created_utc": "2026-02-03 08:22:00",
      "score": 3,
      "num_comments": 3,
      "upvote_ratio": 1.0,
      "text": "I'm looking for a news feed that is unbiased, preferably European based (can also be in German) and most importantly not too spammy / with filters so I wont get over 30+ articles per day.\n\nDoes anyone have any good recommendations?\n\n  \nThanks a lot on advance.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/rss/comments/1qumglc/need_recommendations_for_news_feed/",
      "domain": "self.rss",
      "is_self": true,
      "comments": [
        {
          "id": "o3bpqvn",
          "author": "Saynete",
          "text": "Atlas Feed Directory : [Europe Dedicated](https://atlasflux.saynete.net/atlas_des_flux_rss_ang_territory_europe_country.htm) and [\"Germany\" Search](https://atlasflux.saynete.net/?cherche=German&rubr=rss_en-us) (all in english)",
          "score": 2,
          "created_utc": "2026-02-03 11:33:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3d9z99",
          "author": "Sangkwun",
          "text": "Zeit and Spiegel have RSS feeds per section - way easier to stay under 30/day.  \nI use Daigest to get daily summaries instead of checking everything in real-time.  \nwell for staying informed without the noise.",
          "score": 1,
          "created_utc": "2026-02-03 16:46:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o404g7y",
          "author": "Hour_Raisin_7642",
          "text": "I use an app called Newsreadeck. Works great",
          "score": 1,
          "created_utc": "2026-02-07 00:58:23",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qxm4t1",
      "title": "NetNewsWire not showing videos",
      "subreddit": "rss",
      "url": "https://www.reddit.com/r/rss/comments/1qxm4t1/netnewswire_not_showing_videos/",
      "author": "Electric__Hive",
      "created_utc": "2026-02-06 16:22:39",
      "score": 3,
      "num_comments": 4,
      "upvote_ratio": 1.0,
      "text": "I'm thinking of switching over to NetNewsWire so I'm testing it out. I thought I read that it displays videos, but so far I haven't gotten it to work... On Reeder the same feed works fine, but on NNW I don't get anything but the title. \n\nSo am I doing something wrong, or NNW doesn't work like that?\n\nthis is the feed I tested: [https://www.youtube.com/feeds/videos.xml?channel\\_id=UCAL3JXZSzSm8AlZyD3nQdBA](https://www.youtube.com/feeds/videos.xml?channel_id=UCAL3JXZSzSm8AlZyD3nQdBA)",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/rss/comments/1qxm4t1/netnewswire_not_showing_videos/",
      "domain": "self.rss",
      "is_self": true,
      "comments": [
        {
          "id": "o3xg7ne",
          "author": "jpk613",
          "text": "I’m having the same problem",
          "score": 1,
          "created_utc": "2026-02-06 16:47:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3xhmv4",
          "author": "ChaosControl666",
          "text": "Mee too, embebed vídeos of YouTube are not working for me, from ages",
          "score": 1,
          "created_utc": "2026-02-06 16:54:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3xo70c",
          "author": "TijnvandenEijnde",
          "text": "I know that every now and then the YouTube RSS feeds stop working for a couple of hours. But this time it seems to be a problem in NNW because videos are working in my app.",
          "score": 1,
          "created_utc": "2026-02-06 17:25:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o41hhes",
          "author": "chickenandliver",
          "text": "Assuming you mean the mobile app, did you enable the \"Enable Javascript\" toggle? With the toggle off, YouTube feeds will show just the title.",
          "score": 1,
          "created_utc": "2026-02-07 06:37:35",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qul0fj",
      "title": "Finding a self-hosting solution as a successor to Feedbro",
      "subreddit": "rss",
      "url": "https://www.reddit.com/r/rss/comments/1qul0fj/finding_a_selfhosting_solution_as_a_successor_to/",
      "author": "That-Okra3052",
      "created_utc": "2026-02-03 06:54:44",
      "score": 3,
      "num_comments": 2,
      "upvote_ratio": 1.0,
      "text": "Hi all.\n\nFeedbro is a great RSS extension and has been my main news aggregator for the past few years. But as it doesn't support mobile, I need a different app on my phone, and the saved articles are getting more out of sync over time.\n\nI hope a self-hosted reader can solve the problem. I'd expect the new reader to inherit at least some of the merits of Feedbro, such as:\n* Switchable reading layout (Feedbro provides 6, but now I mainly rely on the list mode)\n* Feed-specific auto refreshing\n* Rule-based tagging and highlighting (But not necessarily GPT-powered; I believe this is what most of readers lack)\n\nThere might be some other features that I depend on which I haven't realized. Therefore I welcome any suggestions, and thanks in advance!",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/rss/comments/1qul0fj/finding_a_selfhosting_solution_as_a_successor_to/",
      "domain": "self.rss",
      "is_self": true,
      "comments": [
        {
          "id": "o3df68c",
          "author": "aygross",
          "text": "I think freshRSS with plugins should cover these",
          "score": 1,
          "created_utc": "2026-02-03 17:10:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3j7w7x",
          "author": "domysee",
          "text": "I wrote a post about feed readers which may be helpful: [https://lighthouseapp.io/blog/feed-reader-deep-dive](https://lighthouseapp.io/blog/feed-reader-deep-dive)\n\nIn the free and self-hosted category I found Miniflux, FreshRSS, CommaFeed, Nextcloud News, selfoss, and yarr.",
          "score": 1,
          "created_utc": "2026-02-04 14:18:28",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qs5zey",
      "title": "I built a browser extension that generates RSSHub rules with AI - no coding required! 我做了一个浏览器插件，用 AI 自动生成 RSSHub 规则，不用写代码！",
      "subreddit": "rss",
      "url": "https://www.reddit.com/r/rss/comments/1qs5zey/i_built_a_browser_extension_that_generates_rsshub/",
      "author": "AnybodyTiny1693",
      "created_utc": "2026-01-31 15:56:48",
      "score": 2,
      "num_comments": 5,
      "upvote_ratio": 0.56,
      "text": "Hey r/rss (or r/selfhosted),\n\nI've been using RSSHub for a while and love it, but writing custom rules for unsupported websites was always a pain. So I built a browser extension to solve this.\n\n**What it does:**\n\n* Select any content on a webpage and the AI automatically generates RSSHub-compatible rules\n* No need to understand RSSHub's rule syntax or write any code\n* Export rules directly in the format RSSHub expects\n\n**How it works:**\n\n1. Install the extension\n2. Navigate to any website you want to create an RSS feed for\n3. Select the content elements (title, link, description, date, etc.)\n4. AI analyzes the page structure and generates the rule\n5. Export and use with your RSSHub instance\n\nIt's open source: [https://github.com/xiongsircool/rsshub-rule-generator](https://github.com/xiongsircool/rsshub-rule-generator)\n\nWould love feedback from the community. What features would you find useful?：",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/rss/comments/1qs5zey/i_built_a_browser_extension_that_generates_rsshub/",
      "domain": "self.rss",
      "is_self": true,
      "comments": [
        {
          "id": "o3oq723",
          "author": "Only-Maximum-888",
          "text": "Nice thanks! Cannot wait to try it!",
          "score": 1,
          "created_utc": "2026-02-05 08:49:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2vljlf",
          "author": "loudpersononthebus",
          "text": "why is this being downvoted? genuine question. seems interesting... although i'm not too familiar with rsshub.",
          "score": 0,
          "created_utc": "2026-01-31 23:24:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o32zpep",
              "author": "_gina_marie_",
              "text": "Idk but people on Reddit really seem to hate when people post in not-english",
              "score": 2,
              "created_utc": "2026-02-02 02:05:50",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o338rq6",
                  "author": "AnybodyTiny1693",
                  "text": "thank u i don't know about this, i have change the post body's content.",
                  "score": 2,
                  "created_utc": "2026-02-02 02:57:12",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}