{
  "metadata": {
    "last_updated": "2026-02-05 09:15:01",
    "time_filter": "week",
    "subreddit": "SideProject",
    "total_items": 20,
    "total_comments": 316,
    "file_size_bytes": 281469
  },
  "items": [
    {
      "id": "1qv9yi5",
      "title": "I built an offline survival AI [Update]",
      "subreddit": "SideProject",
      "url": "https://v.redd.it/7mtivdp5hdhg1",
      "author": "scorpioDevices",
      "created_utc": "2026-02-04 00:51:32",
      "score": 834,
      "num_comments": 155,
      "upvote_ratio": 0.97,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/SideProject/comments/1qv9yi5/i_built_an_offline_survival_ai_update/",
      "domain": "v.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "o3hvce9",
          "author": "zuptar",
          "text": "Why is this not wrist mounted?\n\nI mean, there's a pretty good opportunity here.",
          "score": 161,
          "created_utc": "2026-02-04 08:09:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3id0y3",
              "author": "Another__one",
              "text": "I've been daydreaming about an actual useful pip-boy for quite a while now. Something that is not a gimmick but with actually useful features (geiger counter, meshtastic node, radio and so on) and durable enough to live a few decades after the apocalypse. Local wiki dump with llm-based RAG system would be a quite useful feature as well. So definitely a step in the right direction. Might be quite useful in a couple of years considering recent developments.",
              "score": 16,
              "created_utc": "2026-02-04 10:54:56",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3ma0x3",
                  "author": "NachosforDachos",
                  "text": "Me reading this while watching fall out",
                  "score": 3,
                  "created_utc": "2026-02-04 23:00:17",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o3ieowt",
              "author": "awesomeo1989",
              "text": "Exactly. Why would someone use a bulky, crappy single purpose device like this when my iPhone/iPad is already waterproof, has a Griffin Survivor case, and runs [https://huggingface.co/lolzinventor/Meta-Llama-3.1-8B-SurviveV3](https://huggingface.co/lolzinventor/Meta-Llama-3.1-8B-SurviveV3) and hundreds of other models locally?\n\nI use this app to run it: [https://privatellm.app/blog/run-survival-ai-offline-iphone-ipad-mac-private-llm](https://privatellm.app/blog/run-survival-ai-offline-iphone-ipad-mac-private-llm)",
              "score": 6,
              "created_utc": "2026-02-04 11:09:28",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3ikkj4",
                  "author": "awesomeo1989",
                  "text": "I tried OPs mobile app, definitely worse output quality than this model https://huggingface.co/lolzinventor/Meta-Llama-3.1-8B-SurviveV3\n\nI won’t trust my life with OPs app",
                  "score": 5,
                  "created_utc": "2026-02-04 11:56:50",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o3jbqua",
                  "author": "scorpioDevices",
                  "text": "I was thinking that it'd be something you can store in your closet, or throw in your car. I've gotten a lot of interest from this design because it's more rugged (you can run it over with a car and it's fine), it's more waterproof than a phone from my understanding and it would allow for upgraded capabilities compared to a phone. You can't do meshtastic, and geiger, etc etc with a phone too\n\nI would love your feedback on our mobile app! The AI can provide sources for its answers, pictures, it has offline maps, a library of study guides, and does a limited version of meshtastic using bluetooth. Thanks for your feedback here regardless\n\n[https://apps.apple.com/us/app/survival-ai-the-ark/id6746391165](https://apps.apple.com/us/app/survival-ai-the-ark/id6746391165)",
                  "score": 3,
                  "created_utc": "2026-02-04 14:38:26",
                  "is_submitter": true,
                  "replies": []
                },
                {
                  "id": "o3ob1mo",
                  "author": "ItalyExpat",
                  "text": "If it had an e-ink screen with efficient hibernation to make the batteries last weeks then it would make more sense.",
                  "score": 1,
                  "created_utc": "2026-02-05 06:30:24",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o3jk1oy",
              "author": "Mickey_Arthur",
              "text": "Was watching Fallout season 2 and this appears in my feed :)",
              "score": 2,
              "created_utc": "2026-02-04 15:19:50",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o3k4cuu",
              "author": "scorpioDevices",
              "text": "One thing at a time!",
              "score": 2,
              "created_utc": "2026-02-04 16:53:40",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o3j4abr",
              "author": "sh1be",
              "text": "Just need to design a casing on a 3d printer.",
              "score": 1,
              "created_utc": "2026-02-04 13:59:20",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3ht9it",
          "author": "diff2",
          "text": "design it so it'll last 1000 years or so, in case of a world ending apocalypse and the last survivors can find one of these to help.",
          "score": 43,
          "created_utc": "2026-02-04 07:50:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3i4ohw",
              "author": "uberstania",
              "text": "And create a religion around it",
              "score": 25,
              "created_utc": "2026-02-04 09:38:13",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o3i7uyn",
              "author": "el_yanuki",
              "text": "the obvious issue is power.. especially with that screen and an ai, i give it a week tops",
              "score": 7,
              "created_utc": "2026-02-04 10:08:11",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3ia0id",
                  "author": "DJTopNotch",
                  "text": "Add solarpanels",
                  "score": 9,
                  "created_utc": "2026-02-04 10:27:58",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o3iwnmx",
              "author": "TraditionalCounty395",
              "text": "Just get an RTG at this point",
              "score": 1,
              "created_utc": "2026-02-04 13:17:10",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o3jcb79",
              "author": "scorpioDevices",
              "text": "That's a pretty cool idea, thanks! I can do that with the internals afterward. It'd probably survive \\~200yrs rn",
              "score": 1,
              "created_utc": "2026-02-04 14:41:19",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3hwemz",
          "author": "yngwieHero",
          "text": "shouldn't you use more energy saving hardware since it's survival kit? would love to see it with e-ink screen for example.   \nBut the idea is really cool!",
          "score": 51,
          "created_utc": "2026-02-04 08:19:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3jdfr4",
              "author": "scorpioDevices",
              "text": "I originally wanted to do an E-Ink too because I was keeping in mind power, but after measuring power usage the savings you'd get is very nominal compared to me focusing on increasing power savings we'd get from optimizing the software that's running on the unit itself\n\nIt lasts for a few hours right now, so I thought adding solar panels to extend that even further would suffice. Thanks for the feedback!",
              "score": 12,
              "created_utc": "2026-02-04 14:47:04",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3llg5v",
                  "author": "IaAranaDiscotecaPOL",
                  "text": "Add a hand crank for power",
                  "score": 2,
                  "created_utc": "2026-02-04 20:59:37",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3hxgat",
          "author": "imfromczechbaby",
          "text": "This is a great product! I want this in my house asap. But please try to add a solar panel, that will be a game changer. \n\nBtw if you want a business partner in Europe to handle logistics or even sales, let me know",
          "score": 20,
          "created_utc": "2026-02-04 08:29:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3jrxep",
              "author": "scorpioDevices",
              "text": "Thank you! I'll add solar charging and DM you",
              "score": 3,
              "created_utc": "2026-02-04 15:56:41",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3ly5iu",
                  "author": "imfromczechbaby",
                  "text": "Great news!",
                  "score": 1,
                  "created_utc": "2026-02-04 22:00:09",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3hn19h",
          "author": "Golden-Ratio",
          "text": "What’s the price for the physical device?",
          "score": 11,
          "created_utc": "2026-02-04 06:55:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3jsuve",
              "author": "scorpioDevices",
              "text": "I'm not set on a price right now, but it'll be expensive to start. I would hate to risk someone's life because I was cheap. I'm going the extra mile software or hardware wise so that it's something people can actually rely on\n\nThat said, I plan to make affordable versions for everyone. This is just the first step toward that",
              "score": 2,
              "created_utc": "2026-02-04 16:00:55",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3idqe2",
          "author": "woadwarrior",
          "text": "Looks like [this con](https://www.reddit.com/r/SideProject/comments/1mjkt6x/comment/n7eo16f/?context=3) is going to go on for a long time. :)",
          "score": 13,
          "created_utc": "2026-02-04 11:01:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3jewd7",
              "author": "scorpioDevices",
              "text": "He was upset because the mobile app isn't 100% offline. That's obvious though because I have to ship app updates, etc. \n\nThe mobile app works 100% without internet. Please try it yourself to see.\n\nThe physical device works 100% without internet but has optional updates. I'd recommend the updates because the product can get smarter learning from the emergencies our +14k of mobile app users go through (pretty cool I think!)",
              "score": 9,
              "created_utc": "2026-02-04 14:54:30",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3jx8lv",
                  "author": "woadwarrior",
                  "text": "Please stop bullshitting. The HTTPS connections that your app makes to `api.revenuecat.com` isn't for updates, it is for [tracking users](https://www.revenuecat.com/docs/customers/identifying-customers).",
                  "score": 3,
                  "created_utc": "2026-02-04 16:21:05",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3howeu",
          "author": "thesamarena2",
          "text": "amazing bro, can you share how you made that thing",
          "score": 4,
          "created_utc": "2026-02-04 07:11:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3i282z",
          "author": "citizen4509",
          "text": "Fallout vibes",
          "score": 6,
          "created_utc": "2026-02-04 09:14:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3i8lsl",
          "author": "el_yanuki",
          "text": "okay this is objectively really cool.. but\n\nyou need a big fat safety disclaimer, especially on anything involving mushrooms or other \"edible\" plants otherwise its only a matter of time till someone dies\n\nSame thing goes for shelter conditions for example.. how can it tell or predict the temperature at my position and altitude. You run the risk of getting people wayy overconfident and relaxed in survival situations.\n\nwhat is the benefit of this heavy box over my phone, which i have on me anyways? I cant really see the situation where things are both bad enough where i need this yet good enough where i can still charge it.\n\nWouldn't this make more sens as like an auto response bot that can be reached via a satphone.. like a garmin inreach?",
          "score": 3,
          "created_utc": "2026-02-04 10:15:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3jxmt5",
              "author": "scorpioDevices",
              "text": "Hi there! Thank you!!\n\nYeah, beyond the AI providing sources for its answers, we have confidence scores and have proactively ensured anything to do with mushrooms is low confidence. It should also tell you to just avoid mushrooms too.\n\nThere are some solutions to the temperature, position, and altitude i'm excited about so I'll wait to implement them and  share. The guidance takes a proactive approach because you're right, they may think they intuitively know their survival priorities when they actually don't\n\nFor me personally, and from what I've heard it's that the device (3lbs, less than a foot wide), is rugged (you can run it over with a car and it's fine), waterproof (more so than a phone), and comes with upgraded capabilities for all features. The battery lasts a few hours so the thought would be in this version that it's for any situation where you need a few hours of guidance (lost in the wild, natural disasters, etc). I think it's a cool thing to have\n\nSo from my research \\~90% of people who get lost in the wild have their phone and have satellite yet many people still die. Satellite takes a few minutes sending/receiving, only supports a few words of text per message, isn't reliable, and is power hungry.   \n  \nImagine getting guidance from a bot where it takes a few mins to send your message, few mins to receive a reply, only to get a few words at a time. Let's hope it's not cloudy, there isn't tree coverage, you're not stuck in cave, etc (you need clear line of sight). \n\nNow contrast that with having almost instant answers with pictures, confidence scores, an AI that provides sources for its answers to a library of study guides stored on-device, maps, etc. Our battery life again lasts a few hours and will only get better too\n\nGood points though! Thanks for the feedback",
              "score": -1,
              "created_utc": "2026-02-04 16:22:54",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3k07ku",
                  "author": "el_yanuki",
                  "text": "\"A few hours\" of battery just doesnt sound great to me.\n\n In a real survival situation, realistically, a few minutes of response time doesnt really matter if that allows me to use the AI over days or weeks..\n\nI can definitely see the app being useful, especially now that you explain that you actually put thought to the safety side of things. But with the app covering the weekend adventure side of things. And the Device not really being suitable for an actual emergency survival situation.. this is a cool thing to have, im just unsure if its really practical or more just a gimmick for the prepper bros (no offence).",
                  "score": 2,
                  "created_utc": "2026-02-04 16:34:47",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3kt7tx",
          "author": "Public_Class_8292",
          "text": "Me: \"Can I eat these mushrooms\" ?  \nAI: \"Yes totally ! These mushrooms are very nutritious ... (blablabla)\"\n\n... 2 hours later ...\n\nMe: \"I'm dying. I think these were poisonous mushrooms.\"  \nAI: \"Yes, you're are absolutely right ! These are the most poisonous mushrooms ... (blablabla)\"",
          "score": 3,
          "created_utc": "2026-02-04 18:47:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3lb0l7",
              "author": "scorpioDevices",
              "text": "https://preview.redd.it/guo62kusbjhg1.png?width=1170&format=png&auto=webp&s=e89809a0b154ad5751d06da4bc6048416ab1c5a5\n\nAll mushroom content or other  dangerous material is flagged as (high risk content)  \n",
              "score": 1,
              "created_utc": "2026-02-04 20:09:50",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3hvzoq",
          "author": "OpenSourcePenguin",
          "text": "It's a good project but I would rather have a book than AI\n\na survival situation is the worst time for unreliable information.",
          "score": 10,
          "created_utc": "2026-02-04 08:15:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3jt7yr",
              "author": "scorpioDevices",
              "text": "Books definitely have their place. My thinking is that once we get solar-charging, you'd get a library of study materials with this in a water-proof, rugged form factor. \n\nAlso, the AI can provide sources to its answers to the study guides stored on-device\n\nAnd thank you!",
              "score": 0,
              "created_utc": "2026-02-04 16:02:37",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3juw6l",
                  "author": "OpenSourcePenguin",
                  "text": "Yes, and it's a great idea in theory. But unfortunately human instinct is to form habits.\n\nIf AI gives answers that seem to make sense most of the time, people will get complicit and stop checking the citations. The smaller and more portable the model, the higher the chance it messes up.\n\nBut could be a good resource for non dangerous situations.",
                  "score": 1,
                  "created_utc": "2026-02-04 16:10:18",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3hlky6",
          "author": "thejunkmonger",
          "text": "Tried to preorder but keeps telling me shipping to my address not available, tried my address in FL.",
          "score": 3,
          "created_utc": "2026-02-04 06:43:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3jrire",
              "author": "scorpioDevices",
              "text": "Shoot! I'm so sorry!! Here's the link: [scorpiodevices.com/store/p/theark-handheld-offline-survival-ai-pc](http://scorpiodevices.com/store/p/theark-handheld-offline-survival-ai-pc)\n\nI'm not that familiar with making websites so I messed up. It should work now",
              "score": 2,
              "created_utc": "2026-02-04 15:54:48",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3hqnvv",
          "author": "blackout-loud",
          "text": "Neat op...how do we keep it charged?",
          "score": 2,
          "created_utc": "2026-02-04 07:27:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3hrag9",
              "author": "symedia",
              "text": "![gif](giphy|o9wulbn7MAOzZVBUgD)",
              "score": 7,
              "created_utc": "2026-02-04 07:33:01",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o3hr09z",
              "author": "rdyplayerB",
              "text": "lol had the same thought. in a true survival situation, electricity may not be readily available and the sun may be perma-blocked out by the nuclear fall out.",
              "score": 1,
              "created_utc": "2026-02-04 07:30:27",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3i3va7",
                  "author": "HankKwak",
                  "text": "I'm pulling over 400w on a pretty overcast day, not great but would be usable (5kw array).\n\nIf the sky is much more blocked than that though, no amount of AI will get you through the mass extinction event as all crops fail and practically every human alive will starve.",
                  "score": 4,
                  "created_utc": "2026-02-04 09:30:27",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o3jtkvx",
              "author": "scorpioDevices",
              "text": "The plan is a solar charging and a cable where you can siphon electricity from other devices. Maybe mechanical charging but we'll see. And thanks!",
              "score": 0,
              "created_utc": "2026-02-04 16:04:16",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3hwfxy",
          "author": "Dhaupin",
          "text": "Great idea! I love it. What kind of depth can you ask it? \n\nSay one of us is sick. We don't know where we are, and need a solid GPS based data set of local points to help us. We need to find pharmacies and medical centers... But we also know they may be dangerous in a bug out scenerio.\n\nDoes your system digest situational awareness? Can it pivot based on potential danger? Like, you're sick but not that sick... \n\nAssuming we chose to stay out of dodge, we are sick, but not that sick to risk it. We need local plant/herb solutions instead, with insight on how to safely prepare them, apply them, etc. Preferably with second and third opinions, to make sure the solution is vetted.",
          "score": 2,
          "created_utc": "2026-02-04 08:19:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3jzmun",
              "author": "scorpioDevices",
              "text": "Hi there! Thank you!\n\nCurrently it does take stock of your situation before providing guidance on many scenarios.\n\nI will be working with medical professionals, etc to ingest their knowledge into the device. This weekend I'm working with another survival expert to do peer reviews of the material / guidance, etc.\n\nIt can offer herbal/natural antiseptics rn too. I see what you're saying though and it'll only be a matter of time before that's fully implemented. ",
              "score": 2,
              "created_utc": "2026-02-04 16:32:08",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3m909b",
                  "author": "Dhaupin",
                  "text": "That's so cool. Hope you guys do well.",
                  "score": 1,
                  "created_utc": "2026-02-04 22:54:56",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3i9dug",
          "author": "No-Independence-6890",
          "text": "  Vault tec",
          "score": 2,
          "created_utc": "2026-02-04 10:22:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3m2ndn",
          "author": "Free-Pound-6139",
          "text": "Why wouldnt you make a case for an iPad with a keyboard?",
          "score": 2,
          "created_utc": "2026-02-04 22:22:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3hvb3f",
          "author": "bordercolliefam",
          "text": "Whoah looks nice! How fast is it? A friend tried making something like this too with a mini PC but it wasnt very quick to answer from what he showed me",
          "score": 1,
          "created_utc": "2026-02-04 08:09:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3jyaxo",
              "author": "scorpioDevices",
              "text": "It's pretty fast! We have a free trial on the app, you can try it yourself if you'd like to see\n\nDepending on the query, maybe 3-5 seconds is normal but max is 1min",
              "score": 1,
              "created_utc": "2026-02-04 16:26:00",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3hvusd",
          "author": "rdyplayerB",
          "text": "“Survival AI, there is a man pointing a gun at me who wants to take all my survival gear. What should i do?”",
          "score": 1,
          "created_utc": "2026-02-04 08:14:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3jywab",
              "author": "scorpioDevices",
              "text": "\"Give him your (unpinned) grenades first\"",
              "score": 1,
              "created_utc": "2026-02-04 16:28:42",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3hwqsp",
          "author": "ArsenalEPL2026",
          "text": "How long is the battery life!?",
          "score": 1,
          "created_utc": "2026-02-04 08:22:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3k058s",
              "author": "scorpioDevices",
              "text": "There's so much to do so I haven't nailed down the exact battery life yet, but it's definitely at least a few hours. I'll get the exact figure down, before release ",
              "score": 1,
              "created_utc": "2026-02-04 16:34:29",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3hxtrf",
          "author": "I_lost_big_yesterday",
          "text": "No Canada shipping :(",
          "score": 1,
          "created_utc": "2026-02-04 08:33:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3jzvy8",
              "author": "scorpioDevices",
              "text": "Hi there! I'm so sorry!! I'm not that familiar with websites and made a mistake. Here's the right link:  \n[https://www.scorpiodevices.com/store/p/theark-handheld-offline-survival-ai-pc](https://www.scorpiodevices.com/store/p/theark-handheld-offline-survival-ai-pc)",
              "score": 1,
              "created_utc": "2026-02-04 16:33:18",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3hxz52",
          "author": "luis-acosta-",
          "text": "I like that it's so durable, but is the battery long-lasting? Or will I be left stranded after a week in the apocalypse?",
          "score": 1,
          "created_utc": "2026-02-04 08:34:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3le4yh",
              "author": "scorpioDevices",
              "text": "Hi there, thank you! Battery lasts a few hours",
              "score": 1,
              "created_utc": "2026-02-04 20:24:45",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3hy99r",
          "author": "Low_Mistake_7748",
          "text": "So you've made a G.E.C.K? Nice!",
          "score": 1,
          "created_utc": "2026-02-04 08:37:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3hzqun",
          "author": "researcer-of-life",
          "text": "what powers it? raspberry pi? what offline llm you are using? atleast parameters like 3b, 4b, 8b etc\n\nAnd is 49$ full price?",
          "score": 1,
          "created_utc": "2026-02-04 08:51:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3i2lki",
              "author": "Honest-Man-1212",
              "text": "Looks like it is using 4-bit quantized version of llama 3.2 3B",
              "score": 3,
              "created_utc": "2026-02-04 09:18:15",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3k0r28",
                  "author": "scorpioDevices",
                  "text": "Yeah the mobile app is using a llama 3.2 3B. The prototype here is using a pi but it'll probably change. \n\n$49 is to reserve your own unit. It's fully refundable until we begin production (I'll email you multiple times before we get to that point) and the money is deducted from your final purchase\n\n[https://www.scorpiodevices.com/store/p/theark-handheld-offline-survival-ai-pc](https://www.scorpiodevices.com/store/p/theark-handheld-offline-survival-ai-pc)",
                  "score": 1,
                  "created_utc": "2026-02-04 16:37:16",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3i0q5n",
          "author": "supreme_rain",
          "text": "What resources did you feed it for offline answers?",
          "score": 1,
          "created_utc": "2026-02-04 09:00:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3i1sok",
          "author": "Asleep_Bet_9778",
          "text": "It’s pretty cool. How long will battery last?",
          "score": 1,
          "created_utc": "2026-02-04 09:10:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3i30w2",
          "author": "palmallamakarmafarma",
          "text": "Very cool. How did you identify what the best source materials were for using within the app eg mist relevant resources it drains upon for information?",
          "score": 1,
          "created_utc": "2026-02-04 09:22:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3ilb36",
              "author": "roboknecht",
              "text": "Sources? Which sources? Nobody really knows I guess, it’s an LLM model making stuff up based on probabilities.",
              "score": 0,
              "created_utc": "2026-02-04 12:02:17",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3jcx9g",
                  "author": "SomnambulisticTaco",
                  "text": "Not necessarily. You could use a reasoning model and an offline image of Wikipedia.",
                  "score": 1,
                  "created_utc": "2026-02-04 14:44:27",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3i3ove",
          "author": "pndjk",
          "text": "i traveled back in time from 2457 to let you guys know that we still have a ton of these in the future but nobody has a USB C charger :(",
          "score": 1,
          "created_utc": "2026-02-04 09:28:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3k15h3",
              "author": "scorpioDevices",
              "text": "Haha I hope you guys have sunlight because the next version will be solar-charged",
              "score": 1,
              "created_utc": "2026-02-04 16:39:06",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3i4i59",
          "author": "shash_99",
          "text": "This is Wild...",
          "score": 1,
          "created_utc": "2026-02-04 09:36:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3i6e1h",
          "author": "Outside_Flounder8165",
          "text": "pip boy 3000 :)",
          "score": 1,
          "created_utc": "2026-02-04 09:54:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3i8ot3",
          "author": "Beautiful_Put_2420",
          "text": "You could make a lite version in the form of a smartwatch",
          "score": 1,
          "created_utc": "2026-02-04 10:15:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3k2pwq",
              "author": "scorpioDevices",
              "text": "I've heard this before too. What would be the things you'd like to see in the smartwatch app the most?",
              "score": 1,
              "created_utc": "2026-02-04 16:46:14",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3iamuf",
          "author": "SleeplessAdventurer",
          "text": "thats pretty cool! its giving a fallout vibe.",
          "score": 1,
          "created_utc": "2026-02-04 10:33:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ie45d",
          "author": "cltbeer",
          "text": "This needs how to grow crops and almanac for weather.",
          "score": 1,
          "created_utc": "2026-02-04 11:04:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3k18kg",
              "author": "scorpioDevices",
              "text": "I'll add this! Thank you",
              "score": 1,
              "created_utc": "2026-02-04 16:39:29",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3ihw7i",
          "author": "hellocppdotdev",
          "text": "Why ai and not just a collection of answers? Someone to talk to in your last few hours?",
          "score": 1,
          "created_utc": "2026-02-04 11:36:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ijsg4",
          "author": "puddinpieee",
          "text": "It should have an option for a faraday cage in the event of emp, otherwise this may become a brick. I understand this would interfere with wireless communications, but perhaps a telescoping antenna when I need communications features?",
          "score": 1,
          "created_utc": "2026-02-04 11:50:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3k1fuj",
              "author": "scorpioDevices",
              "text": "Definitely! I plan to add that later, it can work",
              "score": 1,
              "created_utc": "2026-02-04 16:40:24",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3ikcr3",
          "author": "Embarrassed-Gap4148",
          "text": "Dude, this is elite",
          "score": 1,
          "created_utc": "2026-02-04 11:55:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3k1hhi",
              "author": "scorpioDevices",
              "text": "Thanks so much!",
              "score": 1,
              "created_utc": "2026-02-04 16:40:36",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3im51x",
          "author": "roboknecht",
          "text": "It’s a nice project but to me it actually looks more like a cyberpunk gimmick for Cosplay or sth. Could run more performant on a current smartphone also I do not really see the benefit of it over a smartphone from a physical point of view. You can also just sell a protective case instead.\n\nAt least this should be designed in a way way more energy efficient way. Like using an e-ink display or sth.",
          "score": 1,
          "created_utc": "2026-02-04 12:08:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3k291s",
              "author": "scorpioDevices",
              "text": "Thanks!\n\nSo we do have the mobile app (+14k users) and the main benefits over a smartphone are that it's more waterproof than a smartphone, more rugged (you can run this over with a car and it's fine), and it has upgraded capabilities. Beyond AI, knowledge and mapping being upgraded, the iPhone has offline texting up to 800ft. The physical device in later versions would be up to 10miles, peer-to-peer, no external infrastructure needed. Plus the physical device later would be solar-charged",
              "score": 1,
              "created_utc": "2026-02-04 16:44:07",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3iq9zn",
          "author": "Trashy_io",
          "text": "I swear, each day we get closer to living in the fallout universe. So glad we get to watch fallout formatted as a tv show as it pans out in front of us lol",
          "score": 1,
          "created_utc": "2026-02-04 12:37:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3jciaq",
          "author": "JealousBid3992",
          "text": "50$? For the reservation or for the device itself? You think you're going to be able to make this in late March (this year?!) while seeking funding for production now? The prototype is pretty nifty but everything else about this is seems amateur",
          "score": 1,
          "created_utc": "2026-02-04 14:42:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3jys7v",
              "author": "Gen88",
              "text": "he makes a bunch of claims like \"would last \\~200 years\" and how solar will fix its energy needs. The internals dont even look professionally mounted...im guessing he doesn't have a lot of experience developing projects past a rough prototype phase. I wish him luck but the overall vibe of this is poorly planned and unlikely to function in real world user testing, assuming it ever actually gets to production. ",
              "score": 1,
              "created_utc": "2026-02-04 16:28:11",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3ldfm6",
                  "author": "scorpioDevices",
                  "text": "The \\~200yrs was just my thought if it were stationary and off. I don't see a reason why the timeline would be different but I'm open, it was just a fun theoretical opinion.\n\nI don't have a lot of experience past the prototype phase, but I'm learning! I am doing user testing with the unit now. All I need to do is polish it and then make them which doesn't take that long with me working insane hours and getting help\n\nI'm open to any advice too. ",
                  "score": 1,
                  "created_utc": "2026-02-04 20:21:23",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            },
            {
              "id": "o3lcaem",
              "author": "scorpioDevices",
              "text": "Hi there, $50 is for a reservation cost. If everything went right, the earliest we'd begin production is March of this year for this model. It is my first time doing a launch",
              "score": 1,
              "created_utc": "2026-02-04 20:15:54",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3jnkzf",
          "author": "JMV419",
          "text": "Wrist mount. Fallout vibes right there",
          "score": 1,
          "created_utc": "2026-02-04 15:36:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3k2mn9",
          "author": "beer_geek",
          "text": "This reminds me of the original Hitchhiker's Guide to the Galaxy (like, as written in the book) - kinda perfect. Just needs a big screen that says \"Don't Panic\" in friendly letters.",
          "score": 1,
          "created_utc": "2026-02-04 16:45:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3k64nm",
          "author": "dviolite",
          "text": "This is brilliant!",
          "score": 1,
          "created_utc": "2026-02-04 17:01:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3k6pb2",
              "author": "scorpioDevices",
              "text": "Thanks so much!",
              "score": 1,
              "created_utc": "2026-02-04 17:04:26",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3k6wsr",
          "author": "epSos-DE",
          "text": "Needs solar panel to charge battery !!",
          "score": 1,
          "created_utc": "2026-02-04 17:05:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3k7leg",
          "author": "Far_Boysenberry1837",
          "text": "Okay i have to admit this is is pretty cool to look at. Could you explain  how would this be different from a laptop running a light  llm locally?",
          "score": 1,
          "created_utc": "2026-02-04 17:08:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3k9g2e",
              "author": "scorpioDevices",
              "text": "Thanks so much! It's been a lot of hard work.\n\nAdvantages:  \n\\- Library of study guides  \n\\- Accuracy & Reliability: Our AI can provide sources for its answers using the study guides (works 100% offline), has confidence scores, and I work with survival / medical experts directly  \n\\- AI can provide pictures  \n\\- Includes offline maps of your area  \n\\- Optional updates allow your device to learn from emergencies other's encounter all around the world  \n\\- Ruggedness; run it over with a car, no problem  \n\\- Waterproof (more so than a phone)  \n\\- Battery life (optimized to take less energy per inquiry)  \nAnd then eventually..  \n\\- Offline texting (up to ten miles later on for the physical device)  \n\\- Solar-charged  \n\\- Emp-proof when closed",
              "score": 1,
              "created_utc": "2026-02-04 17:17:04",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3kf9aq",
          "author": "Crolto",
          "text": "What are the hardware specs on this thing? Doubt it's real tbh.",
          "score": 1,
          "created_utc": "2026-02-04 17:44:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3kot38",
          "author": "7HawksAnd",
          "text": "$49 to reserve? Is that the final price or just the price to reserve? Where is the actual price of the device?",
          "score": 1,
          "created_utc": "2026-02-04 18:27:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3l9zz5",
              "author": "scorpioDevices",
              "text": "Just the price to reserve. It's deducted from the final purchase however and is fully refundable until production starts. I'm still adjusting parts for the device so I don't have a final price yet\n\nWe send out email updates, so you'll get multiple messages from us about when production will start before it actually does along with the final price, etc",
              "score": 1,
              "created_utc": "2026-02-04 20:05:00",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3lfvwn",
                  "author": "7HawksAnd",
                  "text": "Have a ball park on final price? Kinda tough to just donate a deposit for something so open ended",
                  "score": 1,
                  "created_utc": "2026-02-04 20:33:04",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3l2v6m",
          "author": "Dev-sauregurke",
          "text": "That's a seriously impressive piece of kit. The IP68 certification and robustness sound promising, but what about the hardware? Running AI locally on such a small device must drain the battery quickly – how long would it last without power in a real emergency?",
          "score": 1,
          "created_utc": "2026-02-04 19:31:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3lb6l2",
          "author": "Ok_Condition4242",
          "text": "Cool aesthetic, strictly speaking, but isn't this just 'Security Theater'?\n\nA dusty mid-range Android phone with Kiwix (Wikipedia/Medical dumps) and OSMAnd/Organic Maps in a Faraday bag achieves 99% of this utility for 1/10th of the price and weight. In a real bug-out scenario, weight is the enemy. Why would I carry a dedicated brick for an LLM when redundancy and mobility are key?",
          "score": 1,
          "created_utc": "2026-02-04 20:10:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3lmie9",
          "author": "DriftyaApp",
          "text": "Cool somehow it reminds me of fallout",
          "score": 1,
          "created_utc": "2026-02-04 21:04:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3lnimh",
          "author": "Goshua",
          "text": "Nice!",
          "score": 1,
          "created_utc": "2026-02-04 21:09:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3m26mz",
          "author": "PurpleReign007",
          "text": "this is sick!",
          "score": 1,
          "created_utc": "2026-02-04 22:20:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3mhq5y",
          "author": "SlyGoblin927",
          "text": "I will definitely buy one if you guys release a fallout edition, you know something that might be used in the game instead of a fallout skin.",
          "score": 1,
          "created_utc": "2026-02-04 23:42:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3n7lci",
          "author": "This-Concern-6331",
          "text": "We got offline AI for Fallout before GTA 6",
          "score": 1,
          "created_utc": "2026-02-05 02:08:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3na6xo",
          "author": "Walfy07",
          "text": "PrepperDisk, ApocalypseAlmanac",
          "score": 1,
          "created_utc": "2026-02-05 02:23:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3nhsuf",
          "author": "i_m_possible_",
          "text": "So how’s this better than having a starlink access  to your phone in an otter box. Which can access chatgpt",
          "score": 1,
          "created_utc": "2026-02-05 03:06:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3nq397",
              "author": "scorpioDevices",
              "text": "If you're relying on starlink, you better hope you're not in a cave, there aren't trees overhead, and it's not cloudy day.\n\nAdvantages:  \n\\- Our AI provides sources for its answers, pictures, has confidence scores, and I've worked with actual survival experts to develop our software.   \n\\- A library of study materials  \n\\- Offline maps  \n\\- Offline texting  \n\\- rugged (you can run it over with a car)  \n\\- waterproof\n\nAnd then eventually it'll be solar-charged too",
              "score": 1,
              "created_utc": "2026-02-05 03:57:17",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3htg5s",
          "author": "AdoptedTargaryen",
          "text": "**Nice**, something actually worthwhile! \n\nGood job OP! 💫 \n\nWishing you the best in your production phase!",
          "score": 1,
          "created_utc": "2026-02-04 07:52:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3jxtog",
              "author": "scorpioDevices",
              "text": "Thank you so much!! Trying to save lives!",
              "score": 1,
              "created_utc": "2026-02-04 16:23:48",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3hsf7o",
          "author": "sharkymcstevenson2",
          "text": "Dude I love this",
          "score": 1,
          "created_utc": "2026-02-04 07:43:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3jy0jx",
              "author": "scorpioDevices",
              "text": "Thank you!",
              "score": 1,
              "created_utc": "2026-02-04 16:24:41",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3i088l",
          "author": "gob_magic",
          "text": "I’ve been imagining this device for years! Offline portable Q&A LLM including access to offline wiki database. \n\nThen I realized most people around the world have phones. Even the one with no internet access. SMS is available nearly everywhere. \n\nI then thought of info access through SMS in their native language.",
          "score": 1,
          "created_utc": "2026-02-04 08:55:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3gfc83",
          "author": "scorpioDevices",
          "text": "Do you guys think it would be cool if I put a solar panel where the monitor currently is and then did a touch screen on the bottom?",
          "score": -9,
          "created_utc": "2026-02-04 02:03:35",
          "is_submitter": true,
          "replies": [
            {
              "id": "o3hh01g",
              "author": "studymaxxer",
              "text": "why not just put a solar panel on the lid of the monitor?",
              "score": 10,
              "created_utc": "2026-02-04 06:05:21",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3hmwbk",
                  "author": "_Jiot_",
                  "text": "Exactly, it makes no sense to put a solar panel on the inside",
                  "score": 7,
                  "created_utc": "2026-02-04 06:54:37",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o3ja7pk",
                  "author": "scorpioDevices",
                  "text": "Thanks ofr the feedback everyone",
                  "score": 1,
                  "created_utc": "2026-02-04 14:30:28",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            },
            {
              "id": "o3hcu9n",
              "author": "apparentlyunoriginal",
              "text": "Yep, if you include an external small solar panel that charged this via USB-C, and maybe gave a way to access the battery for replacement, I would buy one of these.",
              "score": 3,
              "created_utc": "2026-02-04 05:33:03",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o3h8nhw",
              "author": "JohnnyIsNearDiabetic",
              "text": "A separate solar panel would be best",
              "score": 2,
              "created_utc": "2026-02-04 05:02:37",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3hprnj",
          "author": "ryryrondo",
          "text": "Западный мусор",
          "score": -8,
          "created_utc": "2026-02-04 07:19:27",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qt51ww",
      "title": "PSA: If you post your side project here, prepare for war",
      "subreddit": "SideProject",
      "url": "https://www.reddit.com/r/SideProject/comments/1qt51ww/psa_if_you_post_your_side_project_here_prepare/",
      "author": "TheHol1day",
      "created_utc": "2026-02-01 17:42:35",
      "score": 416,
      "num_comments": 121,
      "upvote_ratio": 0.9,
      "text": "posted my AI side project here about a week ago. got some great feedback.\n\nalso got:\n\n* 10+ new accounts per minute, all bots\n* all of them spamming the AI chat with the same prompts trying to extract system prompts and API keys\n* hundreds of requests to /.env, /config, /.git\n* puppeteer scripts hammering the site\n* python bots doing god knows what\n\nwe hadn't hardened security yet because it's a side project with like 12 users. that changed real fast.\n\nsome things that helped:\n\n* rate limiting (should've had this day 1)\n* blocking obvious bot patterns\n* making sure no secrets were exposed in obvious places\n\nanyway, consider this your warning. the moment you post here, assume someone is already trying to break in.\n\nweirdly a badge of honor though? like thanks for thinking my project was worth hacking i guess.\n\nif anyone's curious about what i'm building, happy to drop the link in comments. just didn't want this to be a promo post.\n\nstay safe out there.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/SideProject/comments/1qt51ww/psa_if_you_post_your_side_project_here_prepare/",
      "domain": "self.SideProject",
      "is_self": true,
      "comments": [
        {
          "id": "o30dtbs",
          "author": "velvet-thunder-2019",
          "text": "\\> making sure no secrets were exposed in obvious places\n\n\n\nThis should be: making sure no secrets were exposed In \\*ANY\\* place. \n\nSecrets should well be secret!",
          "score": 217,
          "created_utc": "2026-02-01 18:08:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o30e2y7",
              "author": "HypnoticLion",
              "text": "![gif](giphy|S5n7Wkhhw5A2IrfKER)",
              "score": 108,
              "created_utc": "2026-02-01 18:09:58",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o30wdeg",
              "author": "TheHol1day",
              "text": "Didnt have them exposed but didn't stop them from tryin 😅",
              "score": 15,
              "created_utc": "2026-02-01 19:33:01",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o34kqxn",
                  "author": "ilogik",
                  "text": "This happens all the time. Whenever you have a public http server you will get spammed all the time to find secrets",
                  "score": 5,
                  "created_utc": "2026-02-02 09:06:45",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o35otdt",
                  "author": "True-Strike7696",
                  "text": "Time to set some automod features",
                  "score": 1,
                  "created_utc": "2026-02-02 14:12:45",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o30g8as",
          "author": "InfamousJack9",
          "text": "Honestly, I might have to share my project here to get a free security audit haha",
          "score": 73,
          "created_utc": "2026-02-01 18:19:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o31zx8l",
              "author": "ZeroTwoMod",
              "text": "Hahhaha this was my attitude like 2 weeks ago I got hacked by some dudes in Singapore and Italy and stayed up for \\~3 days straight locking my site down as much as possible. Figured out I had to use CSRF token tied to IP address but took me forever to figure it out and in the meantime I had a couple pushes where users got locked out of the api. Was like the most brutal experience i've had since starting a business",
              "score": 15,
              "created_utc": "2026-02-01 22:46:45",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o322xxn",
                  "author": "InfamousJack9",
                  "text": "Dang that sounds like an awful experience. There should be a subreddit similar to this one where we can ask other SWEs/cybersecurity folks “safety” attempt to hack our apps to catch any vulnerabilities. Kinda like a bounty. \n\nI’m scared to release my app because it has to do with financial data, although the only integration point is Plaid and I only utilize read access, dealing with financial data is a bit daunting.",
                  "score": 6,
                  "created_utc": "2026-02-01 23:02:45",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3087x2",
          "author": "trusic_",
          "text": "Brb, gonna launch a honeypot",
          "score": 102,
          "created_utc": "2026-02-01 17:43:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o30r0j3",
              "author": "sillypoint_",
              "text": " Free penetration testing!",
              "score": 24,
              "created_utc": "2026-02-01 19:08:00",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o309u7z",
              "author": "TheHol1day",
              "text": "my work here is done",
              "score": 33,
              "created_utc": "2026-02-01 17:51:05",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o3172uc",
              "author": "rivkinnator",
              "text": "Haha was just about to do the same then collect all the IPs and use them as a blacklist.",
              "score": 9,
              "created_utc": "2026-02-01 20:24:29",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o30bkkj",
              "author": "PolliticalScience",
              "text": "A must have to get rid of 95% of them!",
              "score": 4,
              "created_utc": "2026-02-01 17:58:53",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o318wb3",
              "author": "ashvy",
              "text": "Lawful Good Epstein",
              "score": 3,
              "created_utc": "2026-02-01 20:33:26",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o31b840",
          "author": "fullstack_ing",
          "text": "/wp-admin has joined the chat.",
          "score": 16,
          "created_utc": "2026-02-01 20:44:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o31re97",
              "author": "Ok-Fruit823",
              "text": "Love it to see it in the logs 😂",
              "score": 5,
              "created_utc": "2026-02-01 22:03:41",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3215bv",
                  "author": "fullstack_ing",
                  "text": "I fail2ban anything .php at this point. Instaban",
                  "score": 3,
                  "created_utc": "2026-02-01 22:53:11",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o30k338",
          "author": "hygroscopy",
          "text": "most of this is just the background radiation of the internet, everything exposed publicly gets hammered constantly. It really has nothing to do with this sub.",
          "score": 15,
          "created_utc": "2026-02-01 18:36:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o30fbo6",
          "author": "CrimsonVixenPixie",
          "text": "Why does everyone write so weird now?",
          "score": 29,
          "created_utc": "2026-02-01 18:15:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o30g8ry",
              "author": "avocadorancher",
              "text": "Most content here is written by AI. Some is written by people who use AI so much that they now write like it too. Honestly best to ignore it all.",
              "score": 46,
              "created_utc": "2026-02-01 18:19:42",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o30hg49",
                  "author": "CrimsonVixenPixie",
                  "text": "I guess it's just really jarring to me because it's all lowercase, so I assumed differently. Just something about the way I keep seeing this thing I can't explain it but people write like \"blah blah blah, blah, blah blah, blah blah blah.\" I read it in my head in this really weird cadence like all rushed and smashed together just because of the way it's written it's actually really starting to get on my nerves now.",
                  "score": 14,
                  "created_utc": "2026-02-01 18:25:04",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o312dew",
              "author": "Oli_Picard",
              "text": "Because slop people slop so hard they can’t even be arsed to write anything original on Reddit.",
              "score": 5,
              "created_utc": "2026-02-01 20:01:33",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o30oq0p",
              "author": "TheRealArthur",
              "text": "feel like anyone that writes a semi well formatted post gets accused of using AI lol. Its annoying to think AI is used for everything but at the same time its the direction we're going in.  I dont think its going away",
              "score": 6,
              "created_utc": "2026-02-01 18:57:31",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o33cf9g",
              "author": "TheBear8878",
              "text": "Because they aren't actually writing, it's AI slop",
              "score": 2,
              "created_utc": "2026-02-02 03:18:39",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o36paro",
              "author": "ExAstrisDivitae",
              "text": "Probably for the same reason that people use a word in the form of an adjective when it should be an adverb… most people have never been very good at writing, and now those people use ai to write things",
              "score": 1,
              "created_utc": "2026-02-02 17:09:25",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o30wim1",
              "author": "TheHol1day",
              "text": "AI and I writing together is not a good mix apparently",
              "score": -2,
              "created_utc": "2026-02-01 19:33:42",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o30yqpk",
                  "author": "vep",
                  "text": "No, it’s not.  Just write to us like we are people",
                  "score": 11,
                  "created_utc": "2026-02-01 19:44:18",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o30twvf",
          "author": "Buffett_Goes_OTM",
          "text": "I had someone conduct a legit DDOS attack against my site in an area I didn’t have rate limiting enabled - now everything is locked down. I ended up reporting to the FBI because of its scale and how highly coordinated it seemed. Now I’m in active contact with the FBI, they followed up about 2 weeks after the report submission and every couple weeks.",
          "score": 6,
          "created_utc": "2026-02-01 19:21:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o30azcp",
          "author": "Bjeaurn",
          "text": "Good lesson learned quick. I wish more people would be aware of these things.",
          "score": 10,
          "created_utc": "2026-02-01 17:56:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o30vlvx",
          "author": "jakeStacktrace",
          "text": "Crazy so you have to make your site secure because it is on the public internet. What a shocking revelation.",
          "score": 12,
          "created_utc": "2026-02-01 19:29:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o31bjtc",
          "author": "fullstack_ing",
          "text": "https://preview.redd.it/c7t371go3ygg1.jpeg?width=1000&format=pjpg&auto=webp&s=e16ad994092326f7baea7cadf9851d287ff4353b",
          "score": 5,
          "created_utc": "2026-02-01 20:46:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o31uk2l",
          "author": "thedolceway",
          "text": "**Draft:**\n\nHackers doing more QA than your actual users. Classic side project experience.​​​​​​​​​​​​​​​​",
          "score": 2,
          "created_utc": "2026-02-01 22:19:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o326v76",
          "author": "bodiam",
          "text": "I'm only allowing signups with Google and Github, that seems to significantly reduce spam accounts ",
          "score": 2,
          "created_utc": "2026-02-01 23:24:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o34trfw",
              "author": "TheHol1day",
              "text": "Good call. In hindsight, email login/signup was a pathway for bots. Also I allow non logged in users to try out the website which even added more incentive for bots.",
              "score": 1,
              "created_utc": "2026-02-02 10:33:38",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3299fx",
          "author": "TheFern3",
          "text": "Don’t put anything online is not secured lol is that simple is common sense not war bro lmao",
          "score": 2,
          "created_utc": "2026-02-01 23:37:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o34ttkb",
              "author": "TheHol1day",
              "text": "![gif](giphy|C3OMX8yQB60IU)",
              "score": 2,
              "created_utc": "2026-02-02 10:34:12",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o34e82p",
          "author": "rjyo",
          "text": "and blocking /.env requests should be on everyone's day 0 checklist. The bots don't sleep!",
          "score": 2,
          "created_utc": "2026-02-02 08:04:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o359g84",
              "author": "HazKaz",
              "text": "i don't understand how could an ai chat bot have access to your .env ?",
              "score": 1,
              "created_utc": "2026-02-02 12:41:04",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3c318r",
                  "author": "explodedgiraffe",
                  "text": "Want to know that too",
                  "score": 1,
                  "created_utc": "2026-02-03 13:07:29",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o30ig40",
          "author": "ashafaei",
          "text": "Appreciate the heads up. Bookmarking this for when I launch.",
          "score": 1,
          "created_utc": "2026-02-01 18:29:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o30ktt7",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-01 18:40:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o30mrf3",
              "author": "rsmike",
              "text": "> the /.git one is especially sneaky because a lot of people forget to block that in nginx. \n\nUnder no circumstances should it be anywhere on your server, let alone in the document root, in the first place.",
              "score": 1,
              "created_utc": "2026-02-01 18:48:43",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3215rq",
          "author": "Opposite-Alfalfa-700",
          "text": "Yeah, i understand, but at some point you need to get traffic on your website, but i alwas looking for interesting projects here!",
          "score": 1,
          "created_utc": "2026-02-01 22:53:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o33ch7y",
          "author": "Altruistic_Minimum94",
          "text": "This happened to me as well when I advertised mines",
          "score": 1,
          "created_utc": "2026-02-02 03:18:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o33vnlt",
          "author": "gabos91",
          "text": "Oof that's rough... it's why I haven't publicly posted my little chat bot in the two years that I've had it... I have put some security measures on there, but it's been low priority. I do send it to some friends and family who try to break it tho and thats always fun. \n\nIt was flattering when some of told me they weren't able to prompt inject or get the api key, and they pointed out things I needed to add to the ol' TODO** list  (those things are still on that list lol)",
          "score": 1,
          "created_utc": "2026-02-02 05:24:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o34exjz",
          "author": "omarous",
          "text": "blocking obvious bot patterns -> now you are potentially blocking lots of legitimate users. many of these ips are shared/hijacked. You can't win this. Just get cheap/free bandwidth and secure your site. Cloudflare firewall is the worst.",
          "score": 1,
          "created_utc": "2026-02-02 08:10:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o34i9kq",
          "author": "RareDestroyer8",
          "text": "That’s the primary reason I stay away from LLMs unless they’re hosted manually by me. If someone sees an opportunity to easily burn through your entire API budget for fun, they’ll do it. It sort of becomes a game and puzzle for the user to see how quickly they can break an app of that sort.",
          "score": 1,
          "created_utc": "2026-02-02 08:42:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o34sgxn",
          "author": "Subject-Potential968",
          "text": "Damn free testing hack",
          "score": 1,
          "created_utc": "2026-02-02 10:21:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o366q5u",
          "author": "worldflier1980",
          "text": "Thank you for pointing this out. This potentially helped me, as I just released my own fashion and lifestyle analysis app lifegeek.ai, for which I put a separate post. Before posting, I saw your advice and fixed a few things. It turned out that API keys were hardcoded, instead of being saved in the GCP secret manager, which is much safer. Good luck with your project.",
          "score": 1,
          "created_utc": "2026-02-02 15:43:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o38k93f",
          "author": "Kindly-Concentrate93",
          "text": "Share it would\nLike to see it. Or dm me either or thanks in advance.",
          "score": 1,
          "created_utc": "2026-02-02 22:21:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3b3z41",
          "author": "Turbulent_Eagle2070",
          "text": "That’s utterly disgusting people do that. \n\nIf they don’t repent of being miserable thieves, they are in very serious danger of ending up in a very hot place for eternity after they die. ",
          "score": 1,
          "created_utc": "2026-02-03 08:08:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3chyae",
          "author": "codycodescode",
          "text": "The bots (and everyone else) ignored my project when I posted 🥲",
          "score": 1,
          "created_utc": "2026-02-03 14:30:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3l1hhn",
          "author": "GrayDonkey",
          "text": "The moment you make an app reachable via the internet this is likely to happen.\n\nIt wasn't AI but even 20 years ago the bots and viruses would start hitting your IP within minutes of it coming online.",
          "score": 1,
          "created_utc": "2026-02-04 19:24:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o32m6n9",
          "author": "Significant-Radish30",
          "text": "You need to understand one thing. The people who are here ARE YOUR COMPETITORS. I'm not going to generalize, but almost 100% of people want to see your project, get the data from it, and out of jealousy or other ridiculous reasons, copy you, or create something based on your idea if they think it's promising, and yes... almost 100% of the people here (and if anyone reading this is bothered by this truth, I hope they go to hell).",
          "score": 1,
          "created_utc": "2026-02-02 00:48:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o32e1wp",
          "author": "Used-Call-3503",
          "text": "this is hilarous",
          "score": 1,
          "created_utc": "2026-02-02 00:04:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o32fpzc",
          "author": "ShorelineStatic",
          "text": "What is ⁠rate limiting?",
          "score": 1,
          "created_utc": "2026-02-02 00:13:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o34huqk",
              "author": "RareDestroyer8",
              "text": "Limiting the rate at which a user can perform a certain task.\n\nIf in a note taking application I rate limit note creation to 10 notes per minute, that means a user can only create a maximum of 10 notes in a minute\n\nIn OP’s case it would prob be an account can only use x amount of tokens an hour, or only x amount of accounts can be created at a certain IP address, or something along those lines.",
              "score": 2,
              "created_utc": "2026-02-02 08:38:53",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o30xeq0",
          "author": "qqbbomg1",
          "text": "What telemetry logging tool do you guys use? I’m having hard time tracing these calls",
          "score": 0,
          "created_utc": "2026-02-01 19:37:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o31blpm",
              "author": "fullstack_ing",
              "text": "log4j\n\nEdit: RRRRRRRREeEEEEEEeeeeee, that down vote lol. You know someone got hurt",
              "score": 1,
              "created_utc": "2026-02-01 20:46:47",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o30cchz",
          "author": "stuaird1977",
          "text": "Would anyone like to look at mine, it's still in test mode and I've yet to build 3 more sections. It's aimed at helping small business and contractors and uses AI to build risk assessments. I'll be adding hazard tours, tool box talk generator and investigations next. Safety is my field and I see gaps all over the place. \n\n\nDemo mode will generate two lines of an assessment for free \n\n\n\nhttps://produce-rams.com/",
          "score": -1,
          "created_utc": "2026-02-01 18:02:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o30oq6i",
              "author": "746865626c617a",
              "text": "404's",
              "score": 0,
              "created_utc": "2026-02-01 18:57:33",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o31cdju",
                  "author": "stuaird1977",
                  "text": "My bad, link was wrong, I've edited it ",
                  "score": 0,
                  "created_utc": "2026-02-01 20:50:37",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o30xrk8",
          "author": "Ambitious-Style-1087",
          "text": "good to know lol smart move on the rate limiting. any other safety measures you used?",
          "score": 0,
          "created_utc": "2026-02-01 19:39:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3138w0",
          "author": "anywhereblue",
          "text": "Great warning.   Thank you.",
          "score": 0,
          "created_utc": "2026-02-01 20:05:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o31k9jm",
          "author": "matarrwolfenstein",
          "text": "I had the same experience, someone was trying to extract source code information from my AI support tool, however I'm experienced enough to have prepared for this",
          "score": 0,
          "created_utc": "2026-02-01 21:29:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o32emou",
          "author": "someGuyyya",
          "text": "Thank you for sharing this!",
          "score": 0,
          "created_utc": "2026-02-02 00:07:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o32rbmp",
          "author": "kubetson",
          "text": "before i read that i felt quite save to publish my project\n\nit's coded by AI but i tech personal that make choices to promote good patterns and safety.  \n  \nwhat i can recommend to any to use tech stack/frameworks that take care about security by default and make bad things harder to introduce.  \n  \nmy framework of choice in rails. maybe models are not as proficient as for ts/js shit. but the outcome should be safer\n\nbut now time for some audits :)",
          "score": 0,
          "created_utc": "2026-02-02 01:17:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o30b1dk",
          "author": "Vivid-Atmosphere5328",
          "text": "these attackers don't have anything else to do?\nI  had my telegram string session by mistake pushed to githib once because i was using it for creating a bot in tg that forward videos and that was mtproto authenticated because i wanted to send files that were in huge size.then one random mf logged in using that session i wasn't even able to log him out. that b*txh was using VPN too 1 second he was in France next second he was in Australia. I was forced to delete my Telegram Account. I made such a rookie mistake not adding .gitgnore file before pushing to github.🤧",
          "score": -1,
          "created_utc": "2026-02-01 17:56:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o30ggv8",
              "author": "InfamousJack9",
              "text": "Are commit histories public even if the repo is private?",
              "score": 2,
              "created_utc": "2026-02-01 18:20:42",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o30k7k5",
                  "author": "Vivid-Atmosphere5328",
                  "text": "the repo was public.🥲",
                  "score": 0,
                  "created_utc": "2026-02-01 18:37:17",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o30md51",
          "author": "Norris2906",
          "text": "Why do they do this? What are aiming to get out of it? What’s the end goal of even botting websites?",
          "score": -1,
          "created_utc": "2026-02-01 18:46:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o30z0rd",
              "author": "vep",
              "text": "I assume it’s automated and they just want to grab anything and everything to sort through later",
              "score": 0,
              "created_utc": "2026-02-01 19:45:38",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o31nt1s",
          "author": "rsagie",
          "text": "What do you think, Is that phenomenal specific to this sub reddit or to posting In reddit in general?",
          "score": -1,
          "created_utc": "2026-02-01 21:46:15",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qt6qvi",
      "title": "I built a pixel office that animates in real-time based on your Claude Code sessions — 100k views and 450+ beta users in 48 hours",
      "subreddit": "SideProject",
      "url": "https://v.redd.it/02v9spe9hxgg1",
      "author": "Waynedevvv",
      "created_utc": "2026-02-01 18:41:32",
      "score": 255,
      "num_comments": 58,
      "upvote_ratio": 0.97,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/SideProject/comments/1qt6qvi/i_built_a_pixel_office_that_animates_in_realtime/",
      "domain": "v.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "o30yhaf",
          "author": "Ambitious-Style-1087",
          "text": "so cooool",
          "score": 18,
          "created_utc": "2026-02-01 19:43:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o31r8av",
              "author": "Waynedevvv",
              "text": "thanks!",
              "score": 0,
              "created_utc": "2026-02-01 22:02:52",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o31rwqm",
          "author": "LiveMinute5598",
          "text": "I would use this but wish it was open source. Hard to trust anything these days when people can use Claude to clone it.",
          "score": 16,
          "created_utc": "2026-02-01 22:06:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o355y2f",
              "author": "Waynedevvv",
              "text": "Totally understandable. It’s partially open sourced. From the iOS side, terminal broadcasting the events via local network to mobile app. And the broadcasting code is open sourced so don’t need to worry about sensitive data leaked. https://github.com/waynedev9598/PixelHQ-bridge\n\nBut macOS side is just local file reading which is harder to proof security unless I open source the whole thing. Will think about it… thanks for your interest tho.",
              "score": 2,
              "created_utc": "2026-02-02 12:15:52",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o31cgpd",
          "author": "Superguy795",
          "text": "Very cool!",
          "score": 3,
          "created_utc": "2026-02-01 20:51:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o31n4ju",
          "author": "No-Loss4301",
          "text": "That's look like the kano kit exploration world!!",
          "score": 3,
          "created_utc": "2026-02-01 21:42:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o343z5p",
          "author": "PottsPointPilgrim",
          "text": "Would be perfect on the Apple TV",
          "score": 3,
          "created_utc": "2026-02-02 06:32:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3562st",
              "author": "Waynedevvv",
              "text": "Are you solo builder or a team? If there many teams requesting it might consider it!",
              "score": 1,
              "created_utc": "2026-02-02 12:16:50",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o31nb8o",
          "author": "neogener",
          "text": "How to try it?",
          "score": 2,
          "created_utc": "2026-02-01 21:43:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o31r7fh",
              "author": "Waynedevvv",
              "text": "[https://testflight.apple.com/join/qqTPmvCd](https://testflight.apple.com/join/qqTPmvCd)",
              "score": 2,
              "created_utc": "2026-02-01 22:02:45",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o34y47r",
                  "author": "Ste_XD",
                  "text": "Would love to see this on other platforms!",
                  "score": 2,
                  "created_utc": "2026-02-02 11:12:54",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3206ko",
          "author": "QuackDB",
          "text": "This is pretty cool. Is their a git page or a way I can try this out",
          "score": 2,
          "created_utc": "2026-02-01 22:48:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3569sy",
              "author": "Waynedevvv",
              "text": "Yeah you can try it here (beta on iOS/macOS): https://testflight.apple.com/join/qqTPmvCd",
              "score": 1,
              "created_utc": "2026-02-02 12:18:17",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3243oc",
          "author": "Ok-Access-7480",
          "text": "soooooo cool broo",
          "score": 2,
          "created_utc": "2026-02-01 23:09:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o356a6w",
              "author": "Waynedevvv",
              "text": "Thankssss",
              "score": 2,
              "created_utc": "2026-02-02 12:18:22",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o335mph",
          "author": "humanexperimentals",
          "text": "That's a dope as idea",
          "score": 2,
          "created_utc": "2026-02-02 02:39:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o356ajm",
              "author": "Waynedevvv",
              "text": "Thanks!",
              "score": 1,
              "created_utc": "2026-02-02 12:18:26",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o33gz1g",
          "author": "alpha_dosa",
          "text": "This is the coolest side project I've seen. Amazing!!",
          "score": 2,
          "created_utc": "2026-02-02 03:46:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o356bgb",
              "author": "Waynedevvv",
              "text": "Wow what a compliment!",
              "score": 1,
              "created_utc": "2026-02-02 12:18:37",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o33j1id",
          "author": "SereneAlps3789",
          "text": "Wow awesome! Did Claude create the assets too or tell you how to create the assets?",
          "score": 2,
          "created_utc": "2026-02-02 03:58:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o356bze",
              "author": "Waynedevvv",
              "text": "O sourced the assets",
              "score": 2,
              "created_utc": "2026-02-02 12:18:44",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o33q14w",
          "author": "Nightshade_Chronicle",
          "text": "This is so cool. Makes me miss all the pixel games I grew up playing. Nice job! What was your favorite part of creating this project?",
          "score": 2,
          "created_utc": "2026-02-02 04:44:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o33zb4l",
          "author": "Vashe00",
          "text": "Love it",
          "score": 2,
          "created_utc": "2026-02-02 05:53:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o342fks",
          "author": "Expert-Drawer9510",
          "text": "Wow that looks cool",
          "score": 2,
          "created_utc": "2026-02-02 06:18:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o346vhe",
          "author": "Sojechan",
          "text": "Looks like workadventure, which is also self-hostable",
          "score": 2,
          "created_utc": "2026-02-02 06:57:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o34dwym",
          "author": "c4pl4b",
          "text": "Pokémon ❤️",
          "score": 2,
          "created_utc": "2026-02-02 08:01:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o356dev",
              "author": "Waynedevvv",
              "text": "Exactly!",
              "score": 1,
              "created_utc": "2026-02-02 12:19:02",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o34fwo8",
          "author": "rjyo",
          "text": "The real-time sync with Claude Code is slick - how are you hooking into the session activity? Polling the API, file watchers, or something else? Also curious about the animation triggers - does each tool call get its own animation?",
          "score": 2,
          "created_utc": "2026-02-02 08:20:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o356ibv",
              "author": "Waynedevvv",
              "text": "Simply file water. And yes but animation is still very simple yet. Like a simple bubble. But will add more fun stuff soon!",
              "score": 1,
              "created_utc": "2026-02-02 12:20:02",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o34y2eu",
          "author": "Ste_XD",
          "text": "Looks inspired by Kairosoft games! <3",
          "score": 2,
          "created_utc": "2026-02-02 11:12:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o356j3d",
              "author": "Waynedevvv",
              "text": "What is that!",
              "score": 1,
              "created_utc": "2026-02-02 12:20:11",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o35w09c",
                  "author": "Ste_XD",
                  "text": "Search, it's a game dev studio with a similar style, I assumed you were inspired by it.",
                  "score": 1,
                  "created_utc": "2026-02-02 14:50:46",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o32069r",
          "author": "jakeStacktrace",
          "text": "No going postal option yet?",
          "score": 1,
          "created_utc": "2026-02-01 22:48:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o35he4v",
          "author": "ChoiceSeason3519",
          "text": "Not even 3mb? Impressive 🫨",
          "score": 1,
          "created_utc": "2026-02-02 13:31:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o35lkxn",
              "author": "Waynedevvv",
              "text": "1.8! It’s light 😆",
              "score": 1,
              "created_utc": "2026-02-02 13:54:57",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o35rij3",
          "author": "projectile55",
          "text": "Using swift ?",
          "score": 1,
          "created_utc": "2026-02-02 14:27:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o36lbtg",
          "author": "djpiperson",
          "text": "Mang I wish there was something like this for cursor on Linux/Windows. ",
          "score": 1,
          "created_utc": "2026-02-02 16:50:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o37ar2d",
          "author": "justleave-mealone",
          "text": "i freaking love this",
          "score": 1,
          "created_utc": "2026-02-02 18:46:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o37ere2",
          "author": "TomatoWasabi",
          "text": "Have you thought about adding a funny animation or a when a user hits the limit?",
          "score": 1,
          "created_utc": "2026-02-02 19:04:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3byfu8",
          "author": "CarpetApart7335",
          "text": "Reminds me of Pokémon Firered",
          "score": 1,
          "created_utc": "2026-02-03 12:37:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3djbe3",
          "author": "Quiet_gaming",
          "text": "Very cool",
          "score": 1,
          "created_utc": "2026-02-03 17:29:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3dm2tf",
          "author": "tallpig0205",
          "text": "i fudging love this",
          "score": 1,
          "created_utc": "2026-02-03 17:42:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3jocvv",
          "author": "k7nd7n",
          "text": "This is amazing on many levels. How did you manage to have more than 3 subtasks running?",
          "score": 1,
          "created_utc": "2026-02-04 15:40:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o315fwv",
          "author": "PositiveUse",
          "text": "Amazing idea lol the neckbeards gonna love it",
          "score": 2,
          "created_utc": "2026-02-01 20:16:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o32tnip",
          "author": "obaidnadeem",
          "text": "W",
          "score": 1,
          "created_utc": "2026-02-02 01:31:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o31r6jk",
          "author": "Waynedevvv",
          "text": "Join beta for free here (ios/macOS): [https://testflight.apple.com/join/qqTPmvCd](https://testflight.apple.com/join/qqTPmvCd)",
          "score": -3,
          "created_utc": "2026-02-01 22:02:38",
          "is_submitter": true,
          "replies": []
        },
        {
          "id": "o33rmqs",
          "author": "BP041",
          "text": "That sounds like a really fun and innovative project! Real-time animation based on coding sessions could add a unique layer of engagement and creativity to the development process. I’m curious about how you handle the performance aspect—do you have any tips for ensuring smooth animations while maintaining session responsiveness?",
          "score": -6,
          "created_utc": "2026-02-02 04:55:40",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qvk24a",
      "title": "I made a library of 1,000+ deep research stock reports",
      "subreddit": "SideProject",
      "url": "https://v.redd.it/grrppmzr3ghg1",
      "author": "Significant-Pair-275",
      "created_utc": "2026-02-04 09:27:24",
      "score": 183,
      "num_comments": 17,
      "upvote_ratio": 0.95,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/SideProject/comments/1qvk24a/i_made_a_library_of_1000_deep_research_stock/",
      "domain": "v.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "o3idb1k",
          "author": "rp4eternity",
          "text": "Interesting idea.\n\nYou should give a few reports completely free as a sample for people to understand what benefit they will get. \n\nI should know how fresh is the data and your analysis. \nFor all I know the report could be based off last quarter data and I am wasting time reading through the analysis if I am looking for fresh data.",
          "score": 11,
          "created_utc": "2026-02-04 10:57:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3ieop2",
              "author": "Significant-Pair-275",
              "text": "I gave a few free report samples in the OP. The data is up-to-date. It ingests the most recent SEC filings + live data from financial APIs.",
              "score": 3,
              "created_utc": "2026-02-04 11:09:25",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3ist0e",
                  "author": "rp4eternity",
                  "text": "Even those samples don't give the complete data without logging in. \n\nPlease mention the date of update on the report. \nIt will boost confidence in your product. \n\nI personally rely on other data points for trading and investing. These are just suggestions for your product.",
                  "score": 5,
                  "created_utc": "2026-02-04 12:53:44",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3ijd1z",
          "author": "ruibranco",
          "text": "Really clean execution on this. The judgment filter (Buy/Hold/Sell) is clever - curious how you're weighing the signals from the SEC filings vs industry publications? Also would love to see an \"earnings surprise\" filter or some way to surface stocks where the AI analysis significantly differs from analyst consensus. That's usually where the alpha is.",
          "score": 3,
          "created_utc": "2026-02-04 11:47:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3imem1",
              "author": "Significant-Pair-275",
              "text": "Thanks man, really great ideas for the filters!   \n  \nThe SEC filings have the priority weighing.",
              "score": 1,
              "created_utc": "2026-02-04 12:10:22",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3l23lo",
          "author": "Dev-sauregurke",
          "text": "Nice find. Definitely saves you the trouble of digging around.",
          "score": 2,
          "created_utc": "2026-02-04 19:27:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3lgwor",
              "author": "Significant-Pair-275",
              "text": "Thank you!",
              "score": 2,
              "created_utc": "2026-02-04 20:37:57",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3jcm6v",
          "author": "BP041",
          "text": "Really impressive evolution from single reports to a browsable library. The filter-by-judgment feature (Buy/Hold/Sell) is a nice touch. Curious — how do you handle the accuracy of the AI-generated judgments? Do you have any backtesting data showing how the \"potential buy\" picks have performed over time? That kind of track record would be a killer differentiator.",
          "score": 1,
          "created_utc": "2026-02-04 14:42:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3iagh7",
          "author": "WaldToonnnnn",
          "text": "Open source it or nobody will care",
          "score": -3,
          "created_utc": "2026-02-04 10:31:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3iaoes",
              "author": "WaldToonnnnn",
              "text": "Money comes after reputation on the internet not the other way around, nobody will pay you if they don't know your reputation. So if you want to succeed in your journey of side hustling you have to open source it.",
              "score": -1,
              "created_utc": "2026-02-04 10:33:57",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3ighuw",
                  "author": "PositiveUse",
                  "text": "Pressuring people into OSS, how noble",
                  "score": 0,
                  "created_utc": "2026-02-04 11:24:43",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qr6qna",
      "title": "I built a visual Python tool that turns AI generated code into reusable blocks",
      "subreddit": "SideProject",
      "url": "https://v.redd.it/paot2zxxwhgg1",
      "author": "lem_of_noland",
      "created_utc": "2026-01-30 14:20:49",
      "score": 182,
      "num_comments": 48,
      "upvote_ratio": 0.97,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/SideProject/comments/1qr6qna/i_built_a_visual_python_tool_that_turns_ai/",
      "domain": "v.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "o2m888m",
          "author": "imabev",
          "text": "Upvoted just because it looks pretty.",
          "score": 12,
          "created_utc": "2026-01-30 15:25:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2m8mtv",
              "author": "lem_of_noland",
              "text": "Thanks!",
              "score": 1,
              "created_utc": "2026-01-30 15:27:01",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2ma3vj",
          "author": "roncz",
          "text": "Interesting concept indeed.",
          "score": 6,
          "created_utc": "2026-01-30 15:33:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2mbn6d",
              "author": "lem_of_noland",
              "text": "Thank you",
              "score": 1,
              "created_utc": "2026-01-30 15:40:38",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2mrv7r",
          "author": "upvotes2doge",
          "text": "Excellent. Love your idea. Visual programming with dynamic blocks",
          "score": 5,
          "created_utc": "2026-01-30 16:53:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2myuce",
              "author": "lem_of_noland",
              "text": "Thanks!  \n  \nTbh, using it for pure \"visual programming\" can be a bad idea. I think It is more suitable for nodes containing some complex logic and you connect everything to gain time.\n\nAnd beyond the visual aspect, you still can export the flow as a Python script at the end.",
              "score": 2,
              "created_utc": "2026-01-30 17:24:17",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2mb0wo",
          "author": "2bake",
          "text": "Pretty neat!",
          "score": 3,
          "created_utc": "2026-01-30 15:37:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2mbowp",
              "author": "lem_of_noland",
              "text": "Thanks!",
              "score": 1,
              "created_utc": "2026-01-30 15:40:52",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2n23v4",
          "author": "ok_olive_02",
          "text": "I don't have a use case right now but I am going to give it a try and will give you honest feedback.\nBut upvoting just for the idea and visuals",
          "score": 3,
          "created_utc": "2026-01-30 17:39:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2n32kn",
              "author": "lem_of_noland",
              "text": "Yes please, thank you!  \nI'm solo developing this, so it is still a bit rough and honest feedbacks are more than welcome!",
              "score": 1,
              "created_utc": "2026-01-30 17:43:25",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2nefv4",
          "author": "s_u_r_a_j",
          "text": "Great work!",
          "score": 3,
          "created_utc": "2026-01-30 18:32:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2nemzq",
              "author": "lem_of_noland",
              "text": "Thank you!",
              "score": 1,
              "created_utc": "2026-01-30 18:33:43",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2nqztt",
          "author": "EtsyCorn",
          "text": "so block coding for python. Interesting!",
          "score": 3,
          "created_utc": "2026-01-30 19:28:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2nr795",
              "author": "lem_of_noland",
              "text": "Exactly!",
              "score": 1,
              "created_utc": "2026-01-30 19:29:27",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2ntiol",
                  "author": "EtsyCorn",
                  "text": "very cool",
                  "score": 1,
                  "created_utc": "2026-01-30 19:40:07",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2oqee3",
          "author": "zekirobi",
          "text": "Any thoughts on doing the same for Web Development tools? Like JS, PHP. Any other Programming language?",
          "score": 2,
          "created_utc": "2026-01-30 22:15:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2orvyo",
              "author": "lem_of_noland",
              "text": "Unfortunately, no. I'm limiting it to only Python, knowing I'm solo developing it and it's a bit hard to maintain and debug multiple \"language translator\" of the DAG (Directed Acyclic Graph) by myself.",
              "score": 2,
              "created_utc": "2026-01-30 22:23:27",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2osioc",
                  "author": "zekirobi",
                  "text": "Thats ok, either way congrats. Then i would go do some research on how to possibly do that same idea you did but with programming languages. \n\nAny tips, resources?",
                  "score": 2,
                  "created_utc": "2026-01-30 22:26:38",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2paztc",
          "author": "[deleted]",
          "text": "[deleted]",
          "score": 2,
          "created_utc": "2026-01-31 00:05:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2pc2fp",
              "author": "lem_of_noland",
              "text": "All the UI is React-flow (xyflow) + Tailwind CSS.\n\nI hope this answers your question.",
              "score": 4,
              "created_utc": "2026-01-31 00:11:30",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2pdcvz",
          "author": "Complete-Syrup-9179",
          "text": "That looks pretty good, well done",
          "score": 2,
          "created_utc": "2026-01-31 00:18:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2ryvjx",
              "author": "lem_of_noland",
              "text": "Thank you",
              "score": 1,
              "created_utc": "2026-01-31 12:02:08",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2qkl4o",
          "author": "Hairy_Beartoe",
          "text": "This is super cool! Side note/question, how do you make these types of videos? Is it a software?",
          "score": 2,
          "created_utc": "2026-01-31 04:40:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2rj7r5",
              "author": "lem_of_noland",
              "text": "It's an app called Screen Studio.",
              "score": 1,
              "created_utc": "2026-01-31 09:38:39",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2qu690",
          "author": "flagrande",
          "text": "I know next to nothing about python other than some people seem to know how to turn it into money, but this looks super cool!",
          "score": 2,
          "created_utc": "2026-01-31 05:51:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2rjb66",
              "author": "lem_of_noland",
              "text": "Thank you",
              "score": 1,
              "created_utc": "2026-01-31 09:39:34",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2rm484",
          "author": "protomota",
          "text": "The reusability problem with AI code is real - I've hit the same wall. You get something that works, but it's so tightly coupled to the context you described that extracting it for reuse feels like starting over. The block library approach is clever because it forces you to think about interfaces and boundaries upfront rather than after the fact. Curious how you handle versioning - when a block's internal logic needs to change but it's already wired into multiple workflows?",
          "score": 2,
          "created_utc": "2026-01-31 10:06:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2rnr10",
              "author": "lem_of_noland",
              "text": "You described this issue so well.\n\nFor the versioning part, it is a bit tricky: you can imagine if a block has its inputs/outputs names and types change completely, what to do in this case? Knowing that links between nodes are typed (meaning you can only link edges with compatible types).\n\nFor now I chose the approach that you need to manually put the new block in the flow to replace the old one. Upgrading or updating a block does not impact existing ones in an already created flow (for now).\n\nMaybe I have to think about a much clever and robust solution for a future version. But I think it's a hard problem (at least from my perspective).",
              "score": 1,
              "created_utc": "2026-01-31 10:22:06",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2p9qmw",
          "author": "INVENTADORMASTER",
          "text": "Great !",
          "score": 1,
          "created_utc": "2026-01-30 23:58:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2pau26",
          "author": "One-Lingonberry-4048",
          "text": "thanks for sharing",
          "score": 1,
          "created_utc": "2026-01-31 00:04:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2sbhyj",
          "author": "srch4aheartofgold",
          "text": "what are you using for zooming effects while recording?",
          "score": 1,
          "created_utc": "2026-01-31 13:33:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2y26yw",
              "author": "lem_of_noland",
              "text": "An app called Screen Studio",
              "score": 2,
              "created_utc": "2026-02-01 09:48:17",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o361v23",
                  "author": "srch4aheartofgold",
                  "text": "thank you",
                  "score": 1,
                  "created_utc": "2026-02-02 15:20:11",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2xdv1q",
          "author": "mossaicc",
          "text": "Amazing, What tech did you use to build this?",
          "score": 1,
          "created_utc": "2026-02-01 06:08:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2y2cl6",
              "author": "lem_of_noland",
              "text": "It's an Electron app, using Nextjs as a renderer (React-flow as core element). So using JS tondo the interface with Python.",
              "score": 2,
              "created_utc": "2026-02-01 09:49:42",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2y2m80",
          "author": "Opening-Clock-7603",
          "text": "Perfect!",
          "score": 1,
          "created_utc": "2026-02-01 09:52:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2yp4pv",
          "author": "Upbeat_Panic_2646",
          "text": "pretty cool!",
          "score": 1,
          "created_utc": "2026-02-01 13:02:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o30umb5",
          "author": "Vijay_17205",
          "text": "Niceee, did scratch inspire you to make dis?",
          "score": 1,
          "created_utc": "2026-02-01 19:24:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o310ljv",
              "author": "lem_of_noland",
              "text": "No, it was a mix of using Dataiku and DBT.",
              "score": 1,
              "created_utc": "2026-02-01 19:53:09",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o310344",
          "author": "Ambitious-Style-1087",
          "text": "👀👀👀",
          "score": 1,
          "created_utc": "2026-02-01 19:50:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3j2hn3",
          "author": "Thievn_",
          "text": "Wow this is pretty damn cool",
          "score": 1,
          "created_utc": "2026-02-04 13:49:43",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qv7cu9",
      "title": "I tracked my first 90 days as a non-technical founder. Here's what actually worked.",
      "subreddit": "SideProject",
      "url": "https://www.reddit.com/r/SideProject/comments/1qv7cu9/i_tracked_my_first_90_days_as_a_nontechnical/",
      "author": "DistributionSmall596",
      "created_utc": "2026-02-03 23:04:10",
      "score": 133,
      "num_comments": 22,
      "upvote_ratio": 0.93,
      "text": "**TL;DR: You don't need a technical co-founder anymore. You need to start.**\n\nFor years, I told myself I couldn't start a company because I wasn't a \"builder.\"\n\nI had ideas. I had domain expertise. But I couldn't code. And every startup playbook said: \"Find a technical co-founder or give up.\"\n\nSo I did what desperate wannabe founders do: I joined an accelerator program, surrounded myself with \"founder energy,\" and spent a year watching technical founders build while I... networked?\n\nOne year later, I felt like shit. I was 35. Still no company. Still waiting for permission.\n\n**Then something clicked.**\n\nI realized the game had changed. In 2025, you don't need to write code to build a company. You need to validate demand and execute fast.\n\nSo I gave myself 90 days to prove I could build a real B2B business without writing a single line of code.\n\n**The Stack That Replaced a Technical Co-Founder**\n\nHere's what I actually used:\n\n**1. Cursor (for building)**\n\n* I'm not a developer, but Cursor + Claude let me ship a functional MVP in 3 weeks\n*  Just me and AI pair programming.\n* Finish my platform in 3 months.\n\n**2. Loom (for recording)**\n\n* Forget fancy demos. I recorded 2-minute Loom videos showing the problem + solution\n* Sent 47 personalized videos in week 1. Got 8 calls booked.\n\n**3. Starnus (for selling)**\n\n* Needed a way to find and reach potential customers without spending all day on LinkedIn\n* Set up my ICP criteria, it finds matching leads and automates the outreach part\n* Went from 15 hours/week manual prospecting to maybe 2 hours checking responses\n\n**4. Notion (for everything else)**\n\n* Roadmap, customer feedback, sales pipeline, content calendar\n* One workspace. No complexity.\n\n**The Results (90 Days)**\n\n* **Week 1-2:** Validated idea with 23 customer conversations (all inbound from targeted outreach)\n* **Week 3-4:** Built MVP with Cursor\n* **Week 5-8:** Sent 200+ personalized outreach messages via Starnus\n* **Week 9-12:** 37 demo calls, 4 paying customers, $1,847 MRR\n\nI'm not rich. I'm not \"successful\" yet. But I have a real business with real customers paying real money.\n\n**The Uncomfortable Truth**\n\nMost founders fail because they build in isolation for months, then hope customers show up.\n\nI did the opposite:\n\n1. Found people with the problem\n2. Validated they'd pay (conversations)\n3. Built the solution \n4. Sold it \n\nRevenue came before product. Customers came before code.\n\n**What This Makes Me Think**\n\nThe \"non-technical founder\" excuse is dead.\n\nYou don't need to learn to code. You don't need a CTO. You need:\n\n* A real problem people will pay to solve\n* AI tools to build and automate the boring stuff\n* The courage to start before you're ready\n\nI wasted a year waiting for permission. Don't make the same mistake.\n\n  \nIf you're a non-technical founder sitting on an idea, stop waiting. Start validating.\n\nThe hardest part isn't building. It's starting.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/SideProject/comments/1qv7cu9/i_tracked_my_first_90_days_as_a_nontechnical/",
      "domain": "self.SideProject",
      "is_self": true,
      "comments": [
        {
          "id": "o3hmsfg",
          "author": "glowandgo_",
          "text": "there’s some truth here, but the trade off people don’t mention is what happens after the mvp. ai can get you to first revenue, not durable systems. in my experience the pain shows up once customers ask for reliability, edge cases, and real integrations. still agree that validation beats waiting, just don’t confuse early traction with having solved the hard part.",
          "score": 4,
          "created_utc": "2026-02-04 06:53:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3knt6l",
          "author": "aorisnt",
          "text": "lmao i love that you mentioned Cursor + Claude because i tried that exact stack and honestly felt like a genius for like 3 days until everything broke in production and i realized i had no idea what i was actually building\n\n\n\nended up using giga create app which is basically \"claude code but for people who dont want to accidentally delete their entire database at 2am\" (happened to me twice). has the same AI pair programming vibe but with actual guardrails and production infrastructure that wont explode.\n\n\n\nstill feels like cheating but at least my stuff stays online now. congrats on the 90 days btw thats huge",
          "score": 2,
          "created_utc": "2026-02-04 18:22:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3g20f4",
          "author": "ryan_mcleod",
          "text": "Congrats on the $1,847 MRR - that's real traction, not just theory ;)\n\nI'm on Day 11 of my own thing (Memflect - emotional processing tool, $3.99 one-time). Built it myself with Rails + ElevenLabs + GPT-4. Zero sales so far but TikTok's finally starting to respond haha.\n\nYour point about \"revenue before product\" hits hard though. I definitely went the other way - built the whole thing, THEN went looking for customers. Classic mistake. Now I'm scrambling to figure out where my actual audience hangs out (turns out it's not the indie hacker community lol).\n\nQuestion: did you use Starnus for B2C outreach or purely B2B? I'm wondering if cold outreach even makes sense for a $4 impulse purchase vs waiting for organic discovery.\n\nEither way, good reminder that starting > planning. Needed to hear that today actually ;)",
          "score": 3,
          "created_utc": "2026-02-04 00:48:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3hzlae",
              "author": "layer456",
              "text": "The golden rule: distribution first (tools like [https://navora.ai](https://navora.ai) can help with that), implementation second. Always.",
              "score": 2,
              "created_utc": "2026-02-04 08:49:49",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3fku3n",
          "author": "Less_Let_8880",
          "text": "Since u r sharing ur startup journey, I built [TheTabber.com](http://TheTabber.com) to help u cross-post and schedule content across 9+ social platforms at once. It's super helpful for solo founders who want to grow their audience and stay consistent without the extra work.",
          "score": 2,
          "created_utc": "2026-02-03 23:14:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3flc2r",
              "author": "DistributionSmall596",
              "text": "Going to check yes I need it actually some how making content and post everywhere is really hard",
              "score": 1,
              "created_utc": "2026-02-03 23:17:33",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3gfkcd",
                  "author": "Less_Let_8880",
                  "text": "thank you!",
                  "score": 1,
                  "created_utc": "2026-02-04 02:04:51",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3g59p9",
          "author": "Wooden-Term-1102",
          "text": "This is so inspiring. That feeling of 'waiting for permission' or waiting for a technical co-founder is what stops most people. It’s amazing to see how tools like Cursor and Claude are finally letting founders focus on the business instead of just fighting with code. $1,800 MRR in 90 days is a huge win : congrats!",
          "score": 2,
          "created_utc": "2026-02-04 01:06:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3g748h",
          "author": "rjyo",
          "text": "Solid journey. The Cursor + Claude combo really has become the default for non-technical builders at this point.\n\n  \nSomething that helped me get more done with similar constraints: async workflows. When Im running Claude Code for longer tasks (refactoring, debugging complex issues), I dont sit and watch it. I kick off the task, step away, then check back later. \n\n  \nYou mentioned the permission mindset being the biggest blocker. Totally agree. The mental shift from waiting to have everything figured out to learning by doing changed everything for me too.\n\n  \nOne practical tip for anyone earlier in this journey: if you want to keep iterating even when youre away from your laptop, there are mobile tools that let you SSH into your dev environment. I use one called Moshi for checking on Claude Code sessions from my phone. Useful when youre testing something and want to monitor progress without being chained to your desk.\n\n  \nWhat were the biggest technical blockers you hit during the MVP build? Curious if it was more about understanding architecture decisions or fighting with specific tools.",
          "score": 1,
          "created_utc": "2026-02-04 01:17:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3gbavi",
          "author": "woomadmoney",
          "text": "hey congrats on your success! also if you want a free Loom alternative for screensharing/demos try Cap, it works great for my product  \nshameless plug (if you ever need to add subtitles to your screen recordings) [https://subtitlesfast.com](https://subtitlesfast.com)",
          "score": 1,
          "created_utc": "2026-02-04 01:40:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3gha00",
          "author": "dextersnake",
          "text": "Congrats on the progress — $1.8k MRR in 90 days is real work, not theory. 👏  \nThanks for sharing the breakdown too, it’s super helpful for other solo builders.\n\nCurious — what are you building? 4 paying customers and $1.8k MRR is pretty neat\\~",
          "score": 1,
          "created_utc": "2026-02-04 02:14:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3gpmgb",
          "author": "Embarrassed_Wafer438",
          "text": "Perfect insight!! 👍 👍 👍",
          "score": 1,
          "created_utc": "2026-02-04 03:01:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3gse8g",
          "author": "Competitive_Sun2055",
          "text": "Congrats, I was in your past situation. I know nothing about coding. But I have been doing marketing for nearly 10 years, I always wanted to have my own self-built product, and I always thinking about finding a technical founder. Your story inspires me to start firstly.",
          "score": 1,
          "created_utc": "2026-02-04 03:17:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3i9a2o",
          "author": "Ok_Row9465",
          "text": "Can you please share the covering-message accompanying the loom-video link, to score meetings from cold DMs / emails? Might be of help to all.",
          "score": 1,
          "created_utc": "2026-02-04 10:21:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3k625z",
          "author": "EmanciporReese",
          "text": "Sounds like total horse shit tbh.\n\nEsp considering your post history is censored.",
          "score": 1,
          "created_utc": "2026-02-04 17:01:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3g9z9h",
          "author": "BP041",
          "text": "This is fantastic tracking! As someone who's been on the technical side, I'm curious - at what point did you feel most overwhelmed by the technical decisions? \n\n\n\nMonth 4-5 is usually when non-tech founders hit the \"AI wall\" - where AI-generated code gets you 80% there but that last 20% needs actual understanding of the architecture. Did you experience that? How did you navigate it?\n\n\n\nAlso, your user acquisition numbers are solid. What was your biggest learning about talking to potential users vs. actual customers?\n\nalso I saw that you start selling before you \"finish\" the platform how does that work?",
          "score": 1,
          "created_utc": "2026-02-04 01:33:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3hl4y4",
          "author": "FrustProgm",
          "text": "I’m looking for early adopters for a new GitHub App: **PR Nudge Coach**.\n\nThe problem: PRs sit open for days with no first review.  \nThe fix: the app posts a gentle nudge when a PR hits 3+ days without a first review, then stops once the first review happens. It also creates a weekly report per repo.\n\nBeta = free + **no repo limit**.  \nI’m trying to reach **100 installs** for initial validation. If you can install it on a small repo (or a test org) and share quick feedback, I’ll prioritize your suggestions.\n\nInstall link: https://github.com/apps/pr-nudge-coach",
          "score": 0,
          "created_utc": "2026-02-04 06:39:40",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qvojp2",
      "title": "Needed to watch videos privately in a nosy house, so I built this Bible vault app with a real-time panic mode",
      "subreddit": "SideProject",
      "url": "https://v.redd.it/1jhantmybhhg1",
      "author": "d-sonuga",
      "created_utc": "2026-02-04 13:28:00",
      "score": 124,
      "num_comments": 45,
      "upvote_ratio": 0.87,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/SideProject/comments/1qvojp2/needed_to_watch_videos_privately_in_a_nosy_house/",
      "domain": "v.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "o3j23ho",
          "author": "Embarrassed-Gap4148",
          "text": "Ayooo, I needed this when I was 16",
          "score": 59,
          "created_utc": "2026-02-04 13:47:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3j2r3a",
              "author": "d-sonuga",
              "text": "Haha, yeah I did too.  \nI thought I wouldn't need it anymore but I was proven wrong.",
              "score": 9,
              "created_utc": "2026-02-04 13:51:08",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3jjwtt",
          "author": "Individual-Algae-859",
          "text": "thats funny af ngl, godbess and godspeed",
          "score": 25,
          "created_utc": "2026-02-04 15:19:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3jlbsl",
              "author": "d-sonuga",
              "text": "Thank you, fellow algae",
              "score": 5,
              "created_utc": "2026-02-04 15:25:55",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3k438c",
          "author": "Tyhgujgt",
          "text": "😭 we have app for abusive households now",
          "score": 20,
          "created_utc": "2026-02-04 16:52:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3kg48u",
              "author": "d-sonuga",
              "text": "🫂",
              "score": 2,
              "created_utc": "2026-02-04 17:47:57",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3k1193",
          "author": "CrusherAWSRD",
          "text": "honestly, dipping your phone like that is sus ash. like genuinely idts a parent will see you doing a violent action like that and not be sus. plus a misclick and the bigass YOUR EYES ONLY is def another friction point. id work on these, great application nonethelss. you can/should integrate it somewhere else, something like a pdf opener for notes, so you can just download notes pdf of studying and then open this. something based on readera. also only videos is pretty cramped. ofc its a side project, just my 2 cents",
          "score": 19,
          "created_utc": "2026-02-04 16:38:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3kf1m4",
              "author": "d-sonuga",
              "text": "The phone doesn't have to dip that much. The dip is actually much more sensitive and will detect slight tilts. I only did it that way in the video to ensure that the viewer gets the point. But I get your view though.  \n  \nThe \"your eyes only\" entrance only shows up when you triple tap the passage you configured, so it's not just any clicking on any passage that opens it up.  \n  \nYeah, I think you're definitely right about the only videos thing.  \nThanks for your thoughts!",
              "score": 10,
              "created_utc": "2026-02-04 17:43:06",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3ku0xp",
                  "author": "popleteev",
                  "text": "Consider replacing the full-screen “For your eyes only” with a… standard search bar?",
                  "score": 7,
                  "created_utc": "2026-02-04 18:50:39",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3j2rpo",
          "author": "quantumsequrity",
          "text": "Watching porn",
          "score": 10,
          "created_utc": "2026-02-04 13:51:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3j3kzc",
              "author": "d-sonuga",
              "text": "Fair, people have all sorts of videos they want private.",
              "score": 11,
              "created_utc": "2026-02-04 13:55:34",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3mnvtb",
                  "author": "phylter99",
                  "text": "The list of video types narrows considerably when you talk about hiding them from religious family members. Though, when my wife was growing up she couldn't even watch a show that had a laugh track because the cult her parents were in taught against it.",
                  "score": 4,
                  "created_utc": "2026-02-05 00:16:39",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o3kleqw",
              "author": "ArtisticCandy3859",
              "text": "Definitely\n\n![gif](giphy|3ohhwiUWeg6QgIUT4I|downsized)",
              "score": 2,
              "created_utc": "2026-02-04 18:11:56",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3jgoti",
          "author": "thegreat4168",
          "text": "I’d do TikTok!!! I think this a is a unique idea but would be hard to sell in a normal ad, so maybe a tiktok video (literally of wha you took) and a caption like: when you download a fake bible app because you never have any privacy\n\nOr something like that!! I think your audience (assuming younger people who live with parents/roommates) is on tiktok/reels/shorts and the video you took in this post is engaging enough I feel. This is where you can do your more cheekier marketing too, without Apple flagging or anything like that.",
          "score": 6,
          "created_utc": "2026-02-04 15:03:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3jib66",
              "author": "d-sonuga",
              "text": "Hmmm, sounds like a great idea.\n\n![gif](giphy|hgPqvaSw6VsGebIZG1)",
              "score": 5,
              "created_utc": "2026-02-04 15:11:25",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3m50zh",
          "author": "zerok_nyc",
          "text": "Downloading this now! Not even for the fast switching, but because I love the idea of sarcastically reciting from the Bible while knowing what it’s secretly hiding.  \n\nAlso, would be great to put a privacy browser in there for streaming other content. As soon as you put it down, all tabs close and you are back to Bible mode.",
          "score": 3,
          "created_utc": "2026-02-04 22:34:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3omxqx",
              "author": "d-sonuga",
              "text": "That's great! Tell me if you encounter any issues.\n\nPrivacy browser sounds like a good idea, I think I'll try that, too.",
              "score": 1,
              "created_utc": "2026-02-05 08:18:27",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3j9txq",
          "author": "ThomasNowProductions",
          "text": "Ehhmmm, android? I mean, I can't say I won't use it",
          "score": 4,
          "created_utc": "2026-02-04 14:28:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3javwu",
              "author": "d-sonuga",
              "text": "Ah, Android, I didn't make an Android version.  \nI only use iOS myself. Maybe someday...",
              "score": 3,
              "created_utc": "2026-02-04 14:33:58",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3ljps5",
                  "author": "ThomasNowProductions",
                  "text": "You always can use a Android emulator on Mac i think",
                  "score": 1,
                  "created_utc": "2026-02-04 20:51:23",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3n6ys3",
          "author": "This-Concern-6331",
          "text": "Using Bible to hide your P03n addiction wasnt on my watchlist today lol ",
          "score": 2,
          "created_utc": "2026-02-05 02:04:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3jkuwk",
          "author": "oyldrr",
          "text": "bro just go a silent place and watch whatever you want",
          "score": 2,
          "created_utc": "2026-02-04 15:23:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3jm1xa",
              "author": "d-sonuga",
              "text": "Now that would definitely work in many situations.  \nBut in some other situations, such a place either does not exist.",
              "score": 3,
              "created_utc": "2026-02-04 15:29:21",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3krir1",
                  "author": "oyldrr",
                  "text": "Someone probably caught you, and you really think this is an actual problem. Come on, man! This is good practice, but I doubt even you'll use it.",
                  "score": 1,
                  "created_utc": "2026-02-04 18:39:30",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3k9pkd",
          "author": "kova98k",
          "text": "lmfao",
          "score": 1,
          "created_utc": "2026-02-04 17:18:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3kzjg1",
          "author": "Zteetch",
          "text": "For iPhones, try to see if you can implement the double tap on the back on the apple logo. That might be stealthier than dipping or moving the phone quickly.",
          "score": 1,
          "created_utc": "2026-02-04 19:15:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3la5e3",
              "author": "d-sonuga",
              "text": "Right, that may be a good idea, thanks.\n\nAnother thing is, the phone does not actually have to be moved quickly - I just did that so the viewers will get it.",
              "score": 1,
              "created_utc": "2026-02-04 20:05:43",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3l3gez",
          "author": "TheFern3",
          "text": "Cool but like do you live in prison? Wtf",
          "score": 1,
          "created_utc": "2026-02-04 19:33:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3laevx",
              "author": "d-sonuga",
              "text": "😂 nah, I don't",
              "score": 1,
              "created_utc": "2026-02-04 20:06:58",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3l93xk",
          "author": "joplin-store",
          "text": "for android?",
          "score": 1,
          "created_utc": "2026-02-04 20:00:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3lb9q6",
              "author": "d-sonuga",
              "text": "I didn't make an android version. I use iOS and I only made it for that.  \nI don't know why I didn't use a cross-platform framework 😔.",
              "score": 1,
              "created_utc": "2026-02-04 20:11:02",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3mw0ki",
          "author": "Timzor",
          "text": "Would your parents believe you if you got caught \"reading the bibe\" because that would probably arouse suspicion. ",
          "score": 1,
          "created_utc": "2026-02-05 01:01:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3no4zx",
          "author": "dmmrekcd",
          "text": "What if you had a web browser integration so you didn’t have to upload only specific videos that you’ve downloaded? That way you could watch YouTube, Reddit, etc…",
          "score": 1,
          "created_utc": "2026-02-05 03:44:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3nx01n",
          "author": "IOUnix",
          "text": "Man, this is great. Could you come up with a more subtle trigger? Like simply hitting the power or volume button. That way you could just keep your finger on it and press it without suspicion.",
          "score": 1,
          "created_utc": "2026-02-05 04:43:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3opvlt",
          "author": "Educational_Two7628",
          "text": "Cool project",
          "score": 1,
          "created_utc": "2026-02-05 08:46:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3je5c3",
          "author": "Disastrous-Mix6877",
          "text": "Heresy.",
          "score": 1,
          "created_utc": "2026-02-04 14:50:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3jennl",
              "author": "d-sonuga",
              "text": "Well, you gotta think outside the box (or the Bible).",
              "score": 3,
              "created_utc": "2026-02-04 14:53:16",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o3n79d7",
              "author": "ProgrammerKidCool",
              "text": "People genuinely have no morals now, disgusting",
              "score": 1,
              "created_utc": "2026-02-05 02:06:30",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qut7gv",
      "title": "I made a better time zone meeting planner",
      "subreddit": "SideProject",
      "url": "https://v.redd.it/kwczpxlvgahg1",
      "author": "Ok_Affect_1571",
      "created_utc": "2026-02-03 14:21:54",
      "score": 123,
      "num_comments": 62,
      "upvote_ratio": 0.97,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/SideProject/comments/1qut7gv/i_made_a_better_time_zone_meeting_planner/",
      "domain": "v.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "o3ctsim",
          "author": "ruibranco",
          "text": "clean UI, way less cluttered than worldtimebuddy. one suggestion - it would be super useful to have a 'link sharing' feature where the selected timezones are encoded in the URL params so you can bookmark specific team combinations. saves having to re-add the same zones every time you plan a recurring meeting",
          "score": 5,
          "created_utc": "2026-02-03 15:30:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3cwlag",
              "author": "Ok_Affect_1571",
              "text": "Thanks for the feedback. The tool has a copy link button at the top, so if you click that it will have the data. I will however also look into having it automatically update the url as that would be more intuitive. Plus you’re right it would also help with bookmarking.",
              "score": 2,
              "created_utc": "2026-02-03 15:43:36",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3cky59",
          "author": "BuyAMCnow",
          "text": "WIll def use it",
          "score": 3,
          "created_utc": "2026-02-03 14:46:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3co5e4",
              "author": "Ok_Affect_1571",
              "text": "That’s awesome. Thanks for trying it out.",
              "score": 1,
              "created_utc": "2026-02-03 15:02:47",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3cz4sp",
          "author": "Awardlesss",
          "text": "India time zone isn't aligned correctly.\n\nhttps://preview.redd.it/2dx5rqqlxahg1.png?width=1458&format=png&auto=webp&s=1797ffbf52c3c7d84039224d44d48f281d1b5ad8",
          "score": 2,
          "created_utc": "2026-02-03 15:55:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3d0mc1",
              "author": "Ok_Affect_1571",
              "text": "Oh you’re right. It’s because the offset is not a whole number. Thanks for letting me know. I’ll look into fixing it today.",
              "score": 3,
              "created_utc": "2026-02-03 16:02:44",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o3dr8jy",
              "author": "Ok_Affect_1571",
              "text": "It should be fixed now.",
              "score": 3,
              "created_utc": "2026-02-03 18:05:29",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3eqjic",
          "author": "SchwererGustavo",
          "text": "It sounds more aesthetically pleasing and beautiful; I wish you continued success.",
          "score": 2,
          "created_utc": "2026-02-03 20:48:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3evjan",
              "author": "Ok_Affect_1571",
              "text": " Thanks, you too.",
              "score": 1,
              "created_utc": "2026-02-03 21:11:49",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3cy5wi",
          "author": "digsmann",
          "text": "all tools look clean and easy to use. Thank you, and All the best!",
          "score": 1,
          "created_utc": "2026-02-03 15:51:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3cznsk",
              "author": "Ok_Affect_1571",
              "text": "Thanks so much. Glad you like them",
              "score": 1,
              "created_utc": "2026-02-03 15:58:09",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3eh605",
          "author": "rsagie",
          "text": "Well done, nice design and useful tool.  \nI invite you to try building more tools with my side-project  [https://quickshare.tools](https://quickshare.tools) which is a prompt-to-tool  service.   \nThis is the very early version of the project, so I whould be glad to get any type of feedback.",
          "score": 1,
          "created_utc": "2026-02-03 20:04:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3ekgyk",
              "author": "Ok_Affect_1571",
              "text": "Interesting, if you don’t mind sharing, what model does it use, or is it a custom model?",
              "score": 1,
              "created_utc": "2026-02-03 20:20:10",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3hk69b",
                  "author": "rsagie",
                  "text": "I am using **general models**, currently this is google gemeni3 flash.   \nThe point is that users can store their tools and share (private or public) with others.  \nUsers can also create tools in other AI websites e.g at gemini, claude, chatgpt and paste the html code.",
                  "score": 1,
                  "created_utc": "2026-02-04 06:31:27",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3ej8az",
          "author": "nerlenscrafter",
          "text": "Love the clean UI. What did you use to design the user interface? ",
          "score": 1,
          "created_utc": "2026-02-03 20:14:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3ek17c",
              "author": "Ok_Affect_1571",
              "text": "Thanks. Glad you like it. I used Figma for the initial mockup and styling.",
              "score": 1,
              "created_utc": "2026-02-03 20:18:06",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3hujz8",
          "author": "BP041",
          "text": "This looks like a fantastic project! Time zone coordination can be such a hassle. Have you considered incorporating features like automated reminders for users or integration with popular calendar apps? Those could really enhance the user experience and help people stay organized across different time zones.\n\nBut what is the actual difference from this and calendly or [cal.com](http://cal.com) and stuff like that though.",
          "score": 1,
          "created_utc": "2026-02-04 08:02:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3jatoh",
              "author": "Ok_Affect_1571",
              "text": "I’m looking into having it sync with google calendar or other options. The main difference with those other options is they require a login so it becomes harder to share with other people. However I haven’t used those specifically. Thanks for the feedback. I really appreciate it.",
              "score": 1,
              "created_utc": "2026-02-04 14:33:38",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3dra9v",
          "author": "PositiveUse",
          "text": "What’s up with the horrible domain though ? nyjournal?\n\nVery cool tool though.",
          "score": 0,
          "created_utc": "2026-02-03 18:05:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3du3fa",
              "author": "Ok_Affect_1571",
              "text": "Thanks, glad you like the tool. The domain is for my blog, so I post other tools and articles as well. It helps to not need to make a new website for each tool I add.",
              "score": 3,
              "created_utc": "2026-02-03 18:18:16",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qt6d2g",
      "title": "Scaled my B2B lead gen agency to 20 concurrent clients. Share what made It possible",
      "subreddit": "SideProject",
      "url": "https://www.reddit.com/r/SideProject/comments/1qt6d2g/scaled_my_b2b_lead_gen_agency_to_20_concurrent/",
      "author": "breakyouridea",
      "created_utc": "2026-02-01 18:28:15",
      "score": 102,
      "num_comments": 18,
      "upvote_ratio": 1.0,
      "text": "Running a LinkedIn lead gen agency solo for 3 years, and couldn't get more than 5 clients without hiring. But margins were too tight to bring on staff. That's why I spent 12-hour days just doing repetitive connection requests and follow-ups across different accounts.\n\nHate that feeling, like I was choosing between keeping my agency (and check) small forever or sacrificing quality to grow. So I took a risk last year and went on automation for all this copying and pasting, and focused on the strategy. I didn't expect that but my response rates went up, I hired a sales person and we managed to get 20 clients. And actually they don't care that most of the initial outreach is automated, they just see qualified conversations in their inbox.\n\nSo if are in doubt just as I did, go for it and try to integrate tools or AI models and agents or whatever to make your work faster and focus on optimization and strategy as a CEO.\n\nAnyone else struggled with this mental block around automating client work? How did you get past it?\n\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/SideProject/comments/1qt6d2g/scaled_my_b2b_lead_gen_agency_to_20_concurrent/",
      "domain": "self.SideProject",
      "is_self": true,
      "comments": [
        {
          "id": "o30kmj5",
          "author": "Oopsfoxy",
          "text": "What made you finally take the decision?",
          "score": 6,
          "created_utc": "2026-02-01 18:39:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o30ktng",
              "author": "breakyouridea",
              "text": "turned down 3 good clients in one month because I physically couldn't handle more work. Did the math on annual revenue and felt stupid XD",
              "score": 2,
              "created_utc": "2026-02-01 18:40:01",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o30mwa8",
                  "author": "Oopsfoxy",
                  "text": "I'm there right now",
                  "score": 1,
                  "created_utc": "2026-02-01 18:49:20",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o30kwsz",
          "author": "HGHall",
          "text": "what business? were pivoting our gtm team in opposite direction. hire part time semi-retired or independent industry experts & pay them for leads. it's so messy in lead gen at midcap / enterprise in software rn and wont get better. IE is your ai email rly better than the next guys? can you send more? whats the edge? on top of that you've got a finite pool of buyers who are getting less and less patient w the bullshit half assed slop.\n\nnot saying what you or many agencies do is slop - but it's just undifferentiated. i truly think the future is independent consulting experts for high-ticket shit. basically a contract domain expert. if you have an industry vertical you're partial to, or have a network in, i might try grabbing a handful of the best ppl you know and pimping them out on a pay per meeting / deal cut basis. you find the business and they make the intros or do the work.\n\nthat said - not everyone is in same industry.",
          "score": 2,
          "created_utc": "2026-02-01 18:40:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o30rjmg",
          "author": "RustedWarCrow",
          "text": "I'm stuck at exactly 6 clients right now for the same reason. How did you even begin automating without everything falling apart?",
          "score": 1,
          "created_utc": "2026-02-01 19:10:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o30s63z",
              "author": "breakyouridea",
              "text": "Started with just 1client who I had a really good relationship with. Told him that I want to try something new, if it doesn't work we'll revert. Ran automation for him for 2 months while still doing manual for everyone else. His results improved. That gave me confidence to ask others.",
              "score": 1,
              "created_utc": "2026-02-01 19:13:19",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o30sol8",
                  "author": "RustedWarCrow",
                  "text": "What exactly improved? Like metrics-wise?",
                  "score": 1,
                  "created_utc": "2026-02-01 19:15:43",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qrvkna",
      "title": "Turned my job rejections into a small interactive data viz site",
      "subreddit": "SideProject",
      "url": "https://v.redd.it/mlprrt86wmgg1",
      "author": "Capital_Pain_8718",
      "created_utc": "2026-01-31 07:07:23",
      "score": 98,
      "num_comments": 21,
      "upvote_ratio": 0.95,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/SideProject/comments/1qrvkna/turned_my_job_rejections_into_a_small_interactive/",
      "domain": "v.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "o2r50q9",
          "author": "Lost-Penalty4545",
          "text": "Git repo plz",
          "score": 8,
          "created_utc": "2026-01-31 07:24:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2r5axd",
              "author": "Capital_Pain_8718",
              "text": "it's pretty pretty messy. \n\n[https://github.com/adityaSharma6356/rejection\\_pool](https://github.com/adityaSharma6356/rejection_pool)",
              "score": 3,
              "created_utc": "2026-01-31 07:27:27",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2t7hfc",
          "author": "Alternative-Theme885",
          "text": "I love the creativity behind turning rejections into a data viz site - it's a fantastic way to spin a negative into a positive. Did you use a specific library or framework to build the interactive bubble visualization, and what inspired you to choose that approach?",
          "score": 4,
          "created_utc": "2026-01-31 16:23:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2t88q7",
              "author": "Capital_Pain_8718",
              "text": "Thanks for the compliment.\nThe idea was just spontaneous. \nAnd no. I only used vanilla js, canvas and some game physics logic like collision and gravity.",
              "score": 2,
              "created_utc": "2026-01-31 16:26:53",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2r4va9",
          "author": "Lost-Penalty4545",
          "text": "Cool",
          "score": 3,
          "created_utc": "2026-01-31 07:23:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2rezbo",
          "author": "abhijith1203",
          "text": "You're adding every company manually to the list. Why?\n\nWhy dont you add them via en excel, csv or maybe notion directly?",
          "score": 3,
          "created_utc": "2026-01-31 08:57:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2rfs53",
              "author": "Capital_Pain_8718",
              "text": "I made an extension to fetch from linkedin application page and python script to fetch company info. Combine them into a list automatically for all new jobs i got rejected from.\n \nThen i guess i will have to add them in the script file manually. But this was just a fun side project I didn't plan a lot. \n\nI will add a csv for the list as you said. Processing would be easier that way at least.\n\nI have no idea what Notion is. Really new to web dev so I'll check that out too. \nThanks.",
              "score": 2,
              "created_utc": "2026-01-31 09:05:31",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2rg3qq",
                  "author": "abhijith1203",
                  "text": "Cool. Checkout Notion app. It's a collaboration app with lot of cool features.",
                  "score": 1,
                  "created_utc": "2026-01-31 09:08:36",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2rd6cw",
          "author": "c4pl4b",
          "text": "My condolences, brother.",
          "score": 2,
          "created_utc": "2026-01-31 08:40:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2sw3j1",
          "author": "rahulkandoriya",
          "text": "I really like the bubble UI to give a fun touch with context. \n\nI also used similar bubble UI that you can pop on my microsaas: [offlist.me](https://www.offlist.me)",
          "score": 2,
          "created_utc": "2026-01-31 15:28:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3l48uv",
          "author": "hellohere2026",
          "text": "Sad but creative. Respect for sharing.",
          "score": 2,
          "created_utc": "2026-02-04 19:37:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3nustx",
          "author": "Old-Victory-406",
          "text": "Are they by size of impact? ",
          "score": 2,
          "created_utc": "2026-02-05 04:28:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3nv2xm",
              "author": "Capital_Pain_8718",
              "text": "No, by the amount of applications rejected. Some companies post a lot of jobs so i could collect multiple rejections.",
              "score": 2,
              "created_utc": "2026-02-05 04:30:14",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3nvit4",
                  "author": "Old-Victory-406",
                  "text": "Cool, just thought when You said that \\[Each bubble is an impact on my psyche\\], I thought You were a machine, unphased by rejection, any takers, so many attempts must have led to successes? ",
                  "score": 2,
                  "created_utc": "2026-02-05 04:33:13",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qu02wz",
      "title": "I spent a year building a U.S. political news app that aggregates policy, news, and social feeds into one place",
      "subreddit": "SideProject",
      "url": "https://govbase.io",
      "author": "ipromiseimcool",
      "created_utc": "2026-02-02 16:40:05",
      "score": 88,
      "num_comments": 17,
      "upvote_ratio": 0.96,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/SideProject/comments/1qu02wz/i_spent_a_year_building_a_us_political_news_app/",
      "domain": "govbase.io",
      "is_self": false,
      "comments": [
        {
          "id": "o376bhz",
          "author": "Dangerous-Guava-9232",
          "text": "Neat idea. Not many twitter accounts in the social feed though.",
          "score": 2,
          "created_utc": "2026-02-02 18:26:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o376q3n",
              "author": "ipromiseimcool",
              "text": "Thanks! Yeah the social feed is pretty new and I’m trying wrap my head around the api costs before I add every politician and agency. Definitely the plan though.",
              "score": 1,
              "created_utc": "2026-02-02 18:28:34",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3770l7",
          "author": "SadDate9398",
          "text": "Would be nice to have one news app with all the original facts and social posts within the story. I could see that as useful.",
          "score": 2,
          "created_utc": "2026-02-02 18:29:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o377nt5",
              "author": "ipromiseimcool",
              "text": "Yeah for now it’s a few different feeds but I’m working on connecting everything together so it’s all simpler to follow.",
              "score": 1,
              "created_utc": "2026-02-02 18:32:49",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o37da46",
          "author": "keksper",
          "text": "Really cool to see something that's grounded directly back to the source. I'll check it out!\n\nCivic action would be a cool addition, especially coming into midterms...",
          "score": 2,
          "created_utc": "2026-02-02 18:58:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o37ey3y",
              "author": "ipromiseimcool",
              "text": "Yep totally agree! Trying to figure out where to start with that now and what would be most helpful!",
              "score": 1,
              "created_utc": "2026-02-02 19:05:48",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o38wuru",
          "author": "mfreeze77",
          "text": "I like this, and have been working on something similar, but I have been focusing on daily hearing extraction, coupled with doner interests per legislator.  The thought is to be able to predict voting patterns based on contributors self interests.",
          "score": 2,
          "created_utc": "2026-02-02 23:26:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o38xl1h",
              "author": "ipromiseimcool",
              "text": "Super cool! I want to track impacts against politicians and integrate data from something like OpenSecrets (dark money info) - to see what they're voting on vs being funded by. One step at a time though.",
              "score": 2,
              "created_utc": "2026-02-02 23:30:46",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3g5n1f",
                  "author": "mfreeze77",
                  "text": "I pulled each legislators offical campaign contributions and doclinged the pdfs, and did a crewai deep dive on each person and entity, trying to osint each into a profile.  As I was going through this at a state level, i was surprised to find that a lot of elected legislators do not have social media.  I was thinking about a way to create a pipeline, that automatically reached out to their office for a statement as i process daily hearings and journals of floor votes, speeches' etc.  I was thinking about a tagging system for statements, or mainly contradictions.  like a hypocrisy grading scale.  I don't know how possible this is, but i will definitely be following your build.",
                  "score": 1,
                  "created_utc": "2026-02-04 01:08:51",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3fy6f8",
          "author": "midpointman",
          "text": "You mean there are ways to learn about the news besides just reading the top comments on reddit? Kidding aside, this seems cool I’ll give it a try. Well done for a side project. ",
          "score": 1,
          "created_utc": "2026-02-04 00:27:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o36nv6l",
          "author": "TeamThundercock",
          "text": "Not a problem that needs solving. This is an attempt to monetize political unrest. 2/10 final score. Waste",
          "score": -2,
          "created_utc": "2026-02-02 17:02:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o36p5ej",
              "author": "ipromiseimcool",
              "text": "Hey I’m sorry you feel that way! To be clear this is only monetized because I need to pay for server, AI, and api costs for certain data. It didn’t feel right to display ads next to impact assessments. \n\nI’m really inspired by sites like ground.news where it shows both sides of the news. I feel like the only way to move forward as a country is a clearer picture for everyone.",
              "score": 2,
              "created_utc": "2026-02-02 17:08:42",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o37iidj",
                  "author": "TeamThundercock",
                  "text": "Ground news doesn’t need an alternative",
                  "score": 1,
                  "created_utc": "2026-02-02 19:22:14",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qtx2oc",
      "title": "I built a tiny clipboard manager that lives where your cursor is",
      "subreddit": "SideProject",
      "url": "https://v.redd.it/fsvfng23h3hg1",
      "author": "International_Page93",
      "created_utc": "2026-02-02 14:50:44",
      "score": 81,
      "num_comments": 49,
      "upvote_ratio": 0.98,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/SideProject/comments/1qtx2oc/i_built_a_tiny_clipboard_manager_that_lives_where/",
      "domain": "v.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "o370dhc",
          "author": "jss1977",
          "text": "I freaking love this, well done!\n\nHowever... a couple of things which I think would really take it to the next level:\n\n1. I already use PastePal which also has the same Cmd+Shift+V shortcut, which then prevents yours from working. I would suggest a way to set an alternative shortcut.... OR\n\n2. For a truly \"cursor/mouse\" only experience, I would love to just be hold down a key and mouse click to bring up the clipboard menu. This would genuinely make me switch from PastePal as I always find it a bit clunky to have to use 3 key combos and then still click around to get to what I want. Being able to key+click just feels so much more elegant.",
          "score": 6,
          "created_utc": "2026-02-02 18:00:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3753gc",
              "author": "International_Page93",
              "text": "this makes so much sense.   \nI'm prioritizing the key + click idea  \n\\-> which key would feel natural to you? I'll build it for you and make it customizable later.",
              "score": 3,
              "created_utc": "2026-02-02 18:21:16",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o37jjw9",
                  "author": "jss1977",
                  "text": "I think Cmd+Click or Shift+Click would be best (Fn and Ctrl is already used with other apps like WhisprFlow etc)",
                  "score": 1,
                  "created_utc": "2026-02-02 19:27:04",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o36j3jg",
          "author": "mcbootysauce1",
          "text": "love the UX here. i like raycast but sometimes doing the key binding to bring up the clipboard takes me out of the flow",
          "score": 4,
          "created_utc": "2026-02-02 16:40:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o36kcy8",
              "author": "International_Page93",
              "text": "Thanks u/mcbootysauce1, UX was a big focus, so really glad to hear that.   \n  \nIf you give it a try, I'd love to hear your thoughts.  \n  \nthere's definitely room to improve. I'd love to polish every detail.",
              "score": 2,
              "created_utc": "2026-02-02 16:46:28",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o35z9fq",
          "author": "jNayden",
          "text": "Looks good does it work for passwords especially in terminal/iterm2 when have to paste a password for ssh for example?\n\nI was using another clipboard manager but it doesn't work on many terminal places especially passwords so I am looking for replacement",
          "score": 3,
          "created_utc": "2026-02-02 15:07:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o36daoq",
              "author": "International_Page93",
              "text": "Yes, it works in terminal and iterm2, including ssh passwords\n\nLet me know if you try it and run into any issues!",
              "score": 2,
              "created_utc": "2026-02-02 16:14:10",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o37648f",
          "author": "busuta",
          "text": "Hey, I really like the idea! I always wanted an app like this, thank you :)\n\nsome feedback;  \n1- It would be nice to edit what is copied, especially if I want to use it again and again.\n\n2- It would be nice to have customizable tabs. For example, when I lived in another country, I was constantly copy-pasting my name in different a language online. This app would be amazing. The same goes for addresses.\n\n3- A tab with a lock/password would be nice for sensitive information.\n\n4- I would like to pin (keep on top) this window when I'm copy-pasting multiple things. Right now, it closes right away.\n\n5- It would be nice to have an option to choose where this window pops up – either on the left or right side.\n\n6- Maybe ESC can close the window?\n\n7- Maybe a smart tab for links?\n\nthat's all for now, can't wait for the pro version :)",
          "score": 2,
          "created_utc": "2026-02-02 18:25:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o37f366",
              "author": "kkb294",
              "text": "+1 for almost every point 👍",
              "score": 2,
              "created_utc": "2026-02-02 19:06:27",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o37e2hh",
              "author": "International_Page93",
              "text": "Wow, that's a lot of great feedback. Let me go one by one:\n\n1. Do you mean editing the actual content? You can already edit the title from the preview screen or with ⌘R. If you mean the content itself, let me know and I'll look into it.\n\n2. I've been thinking about this as tags, something like \\[#work\\] item\\_title. Is that what you have in mind?\n\n3. Can you tell me more about what you mean? Like hiding the preview for items with a certain tag? Or a password-protected section?\n\n4. I'll look into it. Out of curiosity, have you tried multipaste queues? You can ⌘+click to select multiple items and then hit Enter to paste them in order. Would that cover your use case?\n\n5. Right now it opens to the right when possible, and flips to the left near the screen edge. But a custom option sounds good. adding it to the list.\n\n6. Fixed! It was broken, thanks for catching it. Will ship in the next update -> waiting on one more thing from another user before deploying.\n\n7. You can already search by #link to filter all links, and each link has an \"open in browser\" action in the preview window. What would your ideal flow look like?\n\nI'll ping you when the new version is out with the ESC fix, and keep you updated on the other points I mentioned I'd look into.\n\nThank you so much",
              "score": 1,
              "created_utc": "2026-02-02 19:01:44",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o37j9mp",
                  "author": "busuta",
                  "text": "1- I mean the content. especially pinned means I will use it more. so if I did copy wrongly I need to repeat all the process. Or if I realize later It would be nice to fix it. \n\n2- if I need to use search area to filter tags, thats too much work rather than 1 click.\n\n3- I would like to put my credit card number, or a password. so maybe for that. (just a specific tab with lock)\n\n4- I will check that, but I think it would be nice to have pin on top if I am trying out bunch of colors/hex codes for example\n\n5- thank you\n\n6- thank you\n\n7- thats cool, but also I would like to see tabs :)\n\nperfect, thank you so much!",
                  "score": 1,
                  "created_utc": "2026-02-02 19:25:44",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o37cpg1",
          "author": "MoveOverBieber",
          "text": "Nice!",
          "score": 2,
          "created_utc": "2026-02-02 18:55:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o38dn1o",
              "author": "International_Page93",
              "text": "thank you!",
              "score": 1,
              "created_utc": "2026-02-02 21:49:04",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3ffahn",
          "author": "Ok_Present7537",
          "text": "While pastepal is elegant, Maus is crazy quick and straightforward.\n\nHow I felt using the multi-selection:\n\nhttps://preview.redd.it/rdk7ctyaychg1.jpeg?width=597&format=pjpg&auto=webp&s=0ea2a5ca30bac569e17aef17a0e40d06dfbc2ced",
          "score": 2,
          "created_utc": "2026-02-03 22:45:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3fjgab",
              "author": "International_Page93",
              "text": "https://preview.redd.it/1sj2u4x92dhg1.png?width=548&format=png&auto=webp&s=4acf6419711244edd9da8579c9a11abd807f3ae1",
              "score": 2,
              "created_utc": "2026-02-03 23:07:29",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o35ygbx",
          "author": "CreativeForm3242",
          "text": "Cool !! You knew coding or vibe coding project ?",
          "score": 2,
          "created_utc": "2026-02-02 15:03:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o35z16k",
              "author": "International_Page93",
              "text": "Thank you!  \nmix of vibe coding and normal coding.   \nIf you try it, I'd love to hear any feedback!",
              "score": 3,
              "created_utc": "2026-02-02 15:06:10",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o35zm9g",
                  "author": "CreativeForm3242",
                  "text": "Your welcome ! I will download after a while ! Can you upload a virustotal report ? Or link",
                  "score": 3,
                  "created_utc": "2026-02-02 15:09:07",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o36kvzu",
          "author": "Direct-Attention8597",
          "text": "Love the idea here — a clipboard manager that stays right at your cursor sounds super smooth and focused on workflow 👌.  \nOne thing I’ve noticed in a lot of projects like this (including a few clipboard tools shared recently) is how *context switching* kills flow faster than any missing feature.\n\nSomething that helped me frame this kind of design decision is thinking of progress as *“what did I learn this week?”* instead of *“how many users I got”*.  \nWe actually had a long discussion about this exact topic in r/ShowinPublic  especially how builders deal with slow feedback loops and invisible progress.  \nThought it might resonate here too!",
          "score": 1,
          "created_utc": "2026-02-02 16:48:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o36lpwa",
              "author": "International_Page93",
              "text": "Yes, context switching was the #1 thing I wanted to solve.   \n  \nThat's why Maus shows up right at your cursor instead of a separate window.   \n  \nThank you",
              "score": 1,
              "created_utc": "2026-02-02 16:52:41",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o37r4gz",
          "author": "eiko64",
          "text": "Wow, impressive! How many hours of work did it take to achieve this result?",
          "score": 1,
          "created_utc": "2026-02-02 20:02:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o38e04q",
              "author": "International_Page93",
              "text": "thank you! honestly don't know. I've been working on it at night for a month now.",
              "score": 1,
              "created_utc": "2026-02-02 21:50:47",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o39mo8r",
          "author": "Inevitable-Contact-1",
          "text": "does it have dark mode brother?\n\nlooks sick",
          "score": 1,
          "created_utc": "2026-02-03 01:50:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3aqj0k",
              "author": "International_Page93",
              "text": "Yes, it follows your system appearance automatically.\n\nStill polishing some details there, but it works.\n\nAlso planning to add a toggle so you can choose light/dark independently of your system setting.",
              "score": 1,
              "created_utc": "2026-02-03 06:08:47",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3a391g",
          "author": "elihorne",
          "text": "This is so much fun (love the brand/name too!)",
          "score": 1,
          "created_utc": "2026-02-03 03:25:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3apdm5",
              "author": "International_Page93",
              "text": "Thank you!",
              "score": 1,
              "created_utc": "2026-02-03 05:59:20",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qs3rf5",
      "title": "Everyone's posting 10k MRR screenshots. I made 24. Here's what 30 days actually looks like.",
      "subreddit": "SideProject",
      "url": "https://www.reddit.com/r/SideProject/comments/1qs3rf5/everyones_posting_10k_mrr_screenshots_i_made_24/",
      "author": "Ryland990",
      "created_utc": "2026-01-31 14:28:17",
      "score": 69,
      "num_comments": 74,
      "upvote_ratio": 0.91,
      "text": "30 days ago I had never written a line of code. Today I have 2 apps live on the App Store, 2 apps scrapped, 2 landing pages, and another idea in the works. 52 downloads. $24 in revenue.\n\nI'm posting about it anyway because every AI thread is \"built this SaaS in 3 prompts\" and I sat reading all of it thinking maybe I'm just not cut for this.\n\nHere's the real timeline:\n\n**Days 1-3:** Copied a proven concept (photo cleaner app), used VibeCode to build it, submitted to App Store. Got rejected. Three times. Took 2 weeks to figure out the submission process. Nobody posts about that part.\n\n**Week 2:** Realized you don't use one AI tool—you use five. VibeCode, Windsurf, Claude, Nano Banana, [Aura.build](http://Aura.build), Expo. My monthly bill skyrocketed. Each tool does different things. Trying to use one for everything doesn't work.\n\n**Week 3:** Hit real bugs. State management issues. Gesture conflicts. A fullscreen viewer showing black screens. Spent hours learning why. AI can't debug what you can't explain.\n\n**Week 4:** Remotion came out. Everyone posting \"did this in 5 prompts.\" I spent 3.5 days struggling to understand motion effects and video composition. Still don't understand half of it.\n\nThen marketing. Posted on Reddit. r/iosapps went well. r/digitalminimalism? Permabanned. r/AppHookup? Removed. r/iphone? Blocked.\n\n**The numbers:**\n\n* 2 apps live, 2 scrapped\n* 52 downloads, $24 revenue\n* 1 permaban\n* 3 App Store rejections\n* 0 lines of code I could write from scratch\n\n**What I learned:**\n\nVibe coding is real but limited. The moment something breaks, you need to understand it. Marketing is harder than building—maybe 70% of the work. And $24 is not failure. 52 strangers downloaded something I made.\n\nI'm not quitting my job. I'm not posting \"quit your 9-5\" content. Just going to keep building and see if I can get to $100, then $1,000.\n\nIf you're thinking about starting: don't wait until you know enough. Ship something ugly. Get rejected. Make $24. It's a real start.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/SideProject/comments/1qs3rf5/everyones_posting_10k_mrr_screenshots_i_made_24/",
      "domain": "self.SideProject",
      "is_self": true,
      "comments": [
        {
          "id": "o2sn28z",
          "author": "Quasar_Columba",
          "text": "Don't compare your early days to their year 3.",
          "score": 13,
          "created_utc": "2026-01-31 14:40:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2uls88",
              "author": "sprowk",
              "text": "Dont compare your real revenue to their fake claims\\*",
              "score": 10,
              "created_utc": "2026-01-31 20:23:47",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2uxoh7",
                  "author": "Ryland990",
                  "text": "That is correct, but at the end of the day I need to make it work somehow, otherwise is just another hobby and $ spent",
                  "score": 3,
                  "created_utc": "2026-01-31 21:22:46",
                  "is_submitter": true,
                  "replies": []
                },
                {
                  "id": "o2xa7g8",
                  "author": "letsprogramnow",
                  "text": "I feel this comment but not everyone’s post that is high MRR is a fake claim tbh. We’ll never know whose being honest though",
                  "score": 1,
                  "created_utc": "2026-02-01 05:40:13",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o2spl65",
              "author": "Ryland990",
              "text": "That is so true, feels like everyone is running while I’m still walking 😅",
              "score": 2,
              "created_utc": "2026-01-31 14:54:21",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2sy10u",
          "author": "InternalEchidna2541",
          "text": "People make it sound easy. Not everything is sunshine and rainbows as they show. You made $24, congratulations! You can't have $10K before making $1. I also published my app with 4 months of struggle. Database issues, auth issues, things getting broken out of nowhere... They told me it was easy. Then it clicked. If it was easy, this would not be a thing. People make money off of showing it like it's easy. I launched my app last week and there are only like 5 ysers that I don't know. Rest are friends and family. And building something like this takes a mental toll as well. My own father did not believe in what I was doing and still does not. Couldn't care less, but it makes you question yourself at night sometimes. \n\n$24 is the first fruits of your efforts. Congratulations. I hope you will reach your goals with that.",
          "score": 7,
          "created_utc": "2026-01-31 15:37:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2t3hdh",
              "author": "Ryland990",
              "text": "Thank you so much! Really appreciate your support and I totally feel you! It does take a huge toll on your daily routine and I think the most important aspect is to enjoy the process. (It just some times it does feel like I am not moving the needle in the right direction ) \n\nHow are you doing now ? It’s been a few months, did you manage to discover a few marketing channels ?",
              "score": 2,
              "created_utc": "2026-01-31 16:03:59",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2txkme",
                  "author": "InternalEchidna2541",
                  "text": "I published it to Google Play Store last week. I have a simpler project in my mind, I will do it in February while creating content. I basically press every button, fun content, references to memes, storytelling with journey, advices to people (I am not remotely close to what I want to be but could help beginners by being real with them), aesthetics, etc. mostly short form content, until i get visibility and some kind of an audience. Right now i am just storing videos to share in a week or two to have a window to create more. This is just the beginning, though.\n\nI honestly was scared to even record. I am normally confident, been involved in many projects in Europe so I am kinda experienced with content as I was sharing stuff in my account to show friends funny words that mean different things in my language for example. I have been on live tv as well but i could not start content. wanted to do it for years but something was holding me back. i had to say \\`f- it we ball\\` to start at some point. I was scared of being cringe, not getting views, etc. but you know, the more you f- around, the more you find out. nobody knew what they were doing at the beginning. even me with my own app, i did not know. i still don't know how did i ship it. f- around and find out method made me do it. so i decided to apply the same to content stuff. Reddit is not really a place for distribution, nobody cares and everyone markets their stuff. people got fed of it. X  is overpopulated with build in public. i post once or twice a day because to get views or monetization there you either need to be very lucky or you need to have premium and as an unemployed cs drop out unfortunately it ain't possible. i just try to be me everywhere so that i wont sound like \\`just another one.\\` so i decided to switch my focus to video content as blowing up with even one video can drive thousands of people to my app. \n\nmost important thing i realized was marketing was more important than actual app. and i should not identify myself with my products because if i am interesting enough the product will get the engagement eventually. without me the app would not be there.\n\nanyway, i assume i yapped too much but if there is anything useful for you there, i'm glad to be helpful. \n\nand most importantly, thank you for asking.",
                  "score": 3,
                  "created_utc": "2026-01-31 18:27:35",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2t655t",
          "author": "Public-Salary1289",
          "text": "Love the hustle! It's great you're shipping, but not knowing how to code at all might hold you back in the long run. Just a thought.... also focus on that too",
          "score": 5,
          "created_utc": "2026-01-31 16:16:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2yyk6y",
              "author": "Ryland990",
              "text": "thanks and i think I agree with you right now, that might change though depending on how all these AI tools will evolve. But having a decent understanding would only serve you well in the long run",
              "score": 2,
              "created_utc": "2026-02-01 14:01:02",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2zfswi",
                  "author": "Public-Salary1289",
                  "text": "agree! these AI tools may even evolve more, so that there will be no need to learn anymore...",
                  "score": 1,
                  "created_utc": "2026-02-01 15:32:14",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2spmf8",
          "author": "curlymonster1911",
          "text": "What did you do that got banned/blocked on those channels?",
          "score": 3,
          "created_utc": "2026-01-31 14:54:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2stj15",
              "author": "Ryland990",
              "text": "I posted without reading the rules… made a post one evening and discovered the “crosspost” button… big mistake 😆  also was not an active contributor to the channels either (which some times would give some lenience)",
              "score": 5,
              "created_utc": "2026-01-31 15:15:09",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2sug5h",
          "author": "Southern-Movie-3913",
          "text": "How to you get the perfect idea which will work out ??",
          "score": 5,
          "created_utc": "2026-01-31 15:19:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2sxekp",
              "author": "Quasar_Columba",
              "text": "You discover those by working on other stuff. Just build and you will see many problems to be solved.",
              "score": 3,
              "created_utc": "2026-01-31 15:34:37",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2uy1qt",
                  "author": "Ryland990",
                  "text": "That is also my general assumption, however, it can become harder at times because I don’t see much progress… maybe I I forgot how is to start from ground up",
                  "score": 1,
                  "created_utc": "2026-01-31 21:24:33",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            },
            {
              "id": "o2sycf9",
              "author": "InternalEchidna2541",
              "text": "You don't wait for perfect. You will never have perfect conditions. If what you have as an idea is built already, make it better. Combine things and offer what your competitors can't.",
              "score": 2,
              "created_utc": "2026-01-31 15:39:12",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o2t499o",
              "author": "Ryland990",
              "text": "I didn’t find a perfect idea tbh, I just want to test something that is validated. In this way I can see where I am doing mistakes and what I need to figure out (if that makes any sense )",
              "score": 1,
              "created_utc": "2026-01-31 16:07:46",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2t6t54",
          "author": "Ok_Veterinarian446",
          "text": "Its absolutely the same with everything AI related. People are posting nonsense all around. Reminds me of crypto hype 2016-2017. Buy this and wake up millionaire. Might have happened for 10< ppl. Or more. Can’t prove exact statistics. But as a person who worked on 200+ SEO projects i can say: everything that looks too easy or too cheap is actually 10 times more expensive and 100 times harder than on those bs hooks which only goal is to drive engagement in socuals. I will never forget a post on fb, of a person creating children songs on youtube, for youtube kids. He had some 5min video explaining the process. Looked super simple. You generate images, animate them with hailuo, create the song with suno, edit with capcut, that all absolutely free and done in 20min, than those videos get viral on YT kids and you start earning day 3(thats what the person on the video explained). During this time when i watched this, i was actually on a holiday with friends(nerds, playing games in a distinct area in the mountain). So we collectively decided to try. Started the process. We created our first polished song after roughly 7 hours of collective efforts. It was a complete mess but looked similar to the one on the video. We created YT channel.(Would not even mention that due to limitations it costed us roughly 120$ for all the tools simply coz if we did not paid that, it would take is 170 hours only using free versions). So far, so good. The channel was live, the song uploaded, everything set as explained on the video. 24h later. Total 17 views. Most likely 16 of them were from the people who participated. Since im quite a dedicated person when i decide to create something(project, side hustle etc) during the course of the next 60 days(i managed to polish the process to roughly an hour a day for a song), posting 1 song a day, the final result was: 17 subscribers, net 600 views on YT.\nlesson learned the hard way.",
          "score": 2,
          "created_utc": "2026-01-31 16:20:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2uxab5",
              "author": "Ryland990",
              "text": "Wow, that was a lot to unpack, and let me say this, you’re writing skills are top! That was a long story and these days ( sometimes myself including) people tent to lose the topic of the story. \n\nThat said, I completely agree, I didn’t get into this thinking it was easy, I tried before in the dropshipping era, things were a lot more harder, tools lot less polished! This whole AI trend brings me back to that era on which I was too late! But now is a different story, the building aspect was reduced to a matter of days, and if I manage to get the marketing part right, you’ll have a real business in front of you of you. \n\nNot hoping to make millions but to increase my living standard yes, if I can keep being consistent",
              "score": 2,
              "created_utc": "2026-01-31 21:20:50",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2uxc95",
                  "author": "Ryland990",
                  "text": "Really appreciate your feedback 🙏",
                  "score": 2,
                  "created_utc": "2026-01-31 21:21:06",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2ucsj9",
          "author": "Dependent_Horror2501",
          "text": "Honestly, using AI when you know how to code is quite difficult itself. Having it write code you already understand like test code is pretty simple, but when I use code I don't fully understand, it always ends up awful and I spend more time debugging the issue than had I just wrote it myself.",
          "score": 2,
          "created_utc": "2026-01-31 19:39:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2v8iqz",
              "author": "Ryland990",
              "text": "so i have no idea how to code, however I noticed that if I tackle everything step by step I generally get pretty good results",
              "score": 1,
              "created_utc": "2026-01-31 22:16:06",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2uep7g",
          "author": "Elhadidi",
          "text": " Marketing was the hardest for me too—this quick AI-driven SEO blog post workflow helped me churn out content and get more traction: [https://youtu.be/sqynh-jtDOM](https://youtu.be/sqynh-jtDOM)",
          "score": 2,
          "created_utc": "2026-01-31 19:48:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2v84ky",
              "author": "Ryland990",
              "text": "thanks a lot for the feedback! That is exactly what I was working on last night... I added blog posts to my landing page related to the topic my app is trying to solve hoping that over time will rank up in google. Slow process but curious how is that gonna work over time",
              "score": 1,
              "created_utc": "2026-01-31 22:14:07",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2v7nuh",
          "author": "Common-Quiet-7054",
          "text": "Marketing is 70% of the work. The other 90% is easy.",
          "score": 2,
          "created_utc": "2026-01-31 22:11:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2vd1el",
              "author": "Ryland990",
              "text": "totally agree... with AI helping to create products so fast, the main difficulty remains marketing",
              "score": 1,
              "created_utc": "2026-01-31 22:39:17",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2smdnd",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 4,
          "created_utc": "2026-01-31 14:36:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2sov9o",
              "author": "Ryland990",
              "text": "Thank you ☺️",
              "score": 1,
              "created_utc": "2026-01-31 14:50:28",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2t1hwo",
          "author": "HovercraftLow6610",
          "text": ".",
          "score": 1,
          "created_utc": "2026-01-31 15:54:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2t4c2j",
              "author": "Ryland990",
              "text": "What do you mean",
              "score": 1,
              "created_utc": "2026-01-31 16:08:09",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2thsa8",
                  "author": "HovercraftLow6610",
                  "text": "I'm gonna read this post when I get free. I will just navigate to my profile for the comment.\nAnyways great work!! 😸",
                  "score": 2,
                  "created_utc": "2026-01-31 17:12:28",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2t1suv",
          "author": "saasbruh",
          "text": "I thought you meant like you made 24 posts about making $10k MRR LOL",
          "score": 1,
          "created_utc": "2026-01-31 15:55:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2t28zy",
              "author": "Ryland990",
              "text": "Oh no no, I wish that would be the case! I am not allowed to use $ sign in the title of the post….",
              "score": 1,
              "created_utc": "2026-01-31 15:58:02",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2vivnf",
          "author": "ForeverFellingTrees",
          "text": "Why did you only link aura build and not the others? Ad",
          "score": 1,
          "created_utc": "2026-01-31 23:10:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2wv8as",
              "author": "Ryland990",
              "text": "I had no clue it got linked tbh! If you’re thinking if I built that and pushing it gently with this post, I wish! 😂",
              "score": 1,
              "created_utc": "2026-02-01 03:55:28",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2vl83d",
          "author": "its_deego",
          "text": "Good stuff, keep going",
          "score": 1,
          "created_utc": "2026-01-31 23:23:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2wus05",
              "author": "Ryland990",
              "text": "Thanks )",
              "score": 1,
              "created_utc": "2026-02-01 03:52:27",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2y8sc5",
          "author": "Queasy-Tomorrow-2543",
          "text": "These are the kinds of honest take needed to help others see the reality. Thanks for sharing.",
          "score": 1,
          "created_utc": "2026-02-01 10:48:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2ya8ml",
              "author": "Ryland990",
              "text": "thank you as well! is refreshing to see that this resonates with soo many people",
              "score": 1,
              "created_utc": "2026-02-01 11:01:31",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2ydfrt",
          "author": "AnonymousVendetta04",
          "text": "Only the successful ones flaunt, the rest are quiet. Thats why we have such a skewed perception of the app market.",
          "score": 1,
          "created_utc": "2026-02-01 11:30:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2yy8rh",
              "author": "Ryland990",
              "text": "it's the same story with anything, right ? like the iceberg pic, most see only the success but not enough talked about all the failures that led to the success. Social media is specially good at that lol",
              "score": 1,
              "created_utc": "2026-02-01 13:59:10",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2z1xrk",
                  "author": "AnonymousVendetta04",
                  "text": "Yup ahaha but honestly they do get to me sometimes given I have projects that seem like failure as of yet and I see others succeeding with some dumb app that is a braindead copy of some other successful app haha",
                  "score": 1,
                  "created_utc": "2026-02-01 14:20:23",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qq7qfq",
      "title": "I built a tool to check if your website loads properly worldwide (FREE + Open Source)",
      "subreddit": "SideProject",
      "url": "https://v.redd.it/mtr3a97tbagg1",
      "author": "astronaut_611",
      "created_utc": "2026-01-29 12:52:14",
      "score": 69,
      "num_comments": 16,
      "upvote_ratio": 0.98,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/SideProject/comments/1qq7qfq/i_built_a_tool_to_check_if_your_website_loads/",
      "domain": "v.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "o2erq3s",
          "author": "Unusual-Big-6467",
          "text": "Is it a uptime monitor checker from 8 places ? \n\nThe way you worded I thought I will get screenshot of how it displays",
          "score": 3,
          "created_utc": "2026-01-29 13:49:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2f033t",
              "author": "astronaut_611",
              "text": "Gotcha, I can add that actually, would be slightly more time taking tho.\n\nCurious, if this shows screenshots then it would solve a problem for you?",
              "score": 0,
              "created_utc": "2026-01-29 14:33:12",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2f1jcb",
                  "author": "bodiam",
                  "text": "If you want, you could use [https://allscreenshots.com](https://allscreenshots.com), a service I run, which makes screenshots of websites. Ping me if you're interested, happy to help.",
                  "score": 1,
                  "created_utc": "2026-01-29 14:40:29",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2en386",
          "author": "Haunting_Age_2970",
          "text": "Add Web vitals too",
          "score": 2,
          "created_utc": "2026-01-29 13:24:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2ezqm5",
              "author": "astronaut_611",
              "text": "Thanks, would check how can i go about that.",
              "score": 1,
              "created_utc": "2026-01-29 14:31:25",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2enn69",
          "author": "ImaginationSpare8649",
          "text": "https://preview.redd.it/ep34x0bmiagg1.png?width=978&format=png&auto=webp&s=7e8847bbd6ee4eb9996f98d6ba41c841b62fd80a\n\n☹️",
          "score": 1,
          "created_utc": "2026-01-29 13:27:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2epf41",
              "author": "loyoan",
              "text": "That‘s actually wrong. I can open the website from germany.",
              "score": 2,
              "created_utc": "2026-01-29 13:37:27",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2etcd8",
                  "author": "ImaginationSpare8649",
                  "text": "i see, thank you.",
                  "score": 1,
                  "created_utc": "2026-01-29 13:58:11",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o2eztss",
              "author": "astronaut_611",
              "text": "Ohh, does your website blocks proxies in some way?",
              "score": 2,
              "created_utc": "2026-01-29 14:31:54",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2f2qfd",
                  "author": "ImaginationSpare8649",
                  "text": "i'm not sure, maybe because cloudflare",
                  "score": 1,
                  "created_utc": "2026-01-29 14:46:24",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qq9cdb",
      "title": "Launched 4 side projects in 18 months. All solved real problems. Only 1 made money.",
      "subreddit": "SideProject",
      "url": "https://www.reddit.com/r/SideProject/comments/1qq9cdb/launched_4_side_projects_in_18_months_all_solved/",
      "author": "F4rewll",
      "created_utc": "2026-01-29 14:01:35",
      "score": 67,
      "num_comments": 36,
      "upvote_ratio": 0.91,
      "text": "Built 4 different side projects between 2024-2025. All solved genuine problems I validated through interviews. All had paying customers willing to buy. But only 1 actually made consistent money. Took me 18 months to realize the difference wasn't product quality or problem validity. It was whether I could organically reach enough customers without paid ads. First project was CRM for real estate agents. Great product, agents loved it, charged $49/month. Problem was I couldn't reach real estate agents organically. They weren't on Reddit. No searchable keywords brought them. Needed LinkedIn ads or cold calling. Died at $340 MRR after 6 months because I couldn't afford customer acquisition.\n\nSecond project was analytics dashboard for Shopify stores. Solid tool, store owners wanted it. But Shopify app store was saturated. Getting discovered required paid ads competing against funded companies. Made $180 total before quitting. Distribution was impossible without budget.​ Third project was scheduling tool for healthcare clinics. Clinics needed it desperately. But healthcare sales cycle was 3-6 months, required demos, compliance questions, multiple stakeholders. As solo founder working nights, I couldn't handle that sales process. Gave up at 2 customers.​\n\nFourth project was content calendar for newsletter creators. Finally got distribution right. Newsletter creators gathered in 8 active subreddits, 5 Facebook groups, and searched specific keywords on Google. I could reach 10,000+ potential customers organically. Built tool in 5 weeks, launched everywhere they gathered, hit $6,400 MRR in 6 months. [Studied pattern in Founders database comparing side projects that succeeded versus failed](http://foundertoolkit.org). Successful ones had organic distribution channels accessible to solo founders. Failed ones required paid ads, long sales cycles, or access to audiences solo founders couldn't reach. Distribution feasibility mattered more than product-market fit.​\n\nThe framework I wish I knew earlier was validate distribution before building. Can you reach 5,000+ target customers through Reddit, SEO, or communities you access for free? If no, don't build it as side project. Save that idea for when you have budget or team. Submitted successful project to 95+ directories, ranked for buyer keywords within 6 weeks, engaged in communities daily. All free distribution that scaled. Previous 3 projects had no path to customers without spending money I didn't have.\n\nStop building side projects for markets you can't access organically. Start with distribution channels, then build for audiences you can reach.\n\nHow many of your side projects failed because of distribution, not product quality?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/SideProject/comments/1qq9cdb/launched_4_side_projects_in_18_months_all_solved/",
      "domain": "self.SideProject",
      "is_self": true,
      "comments": [
        {
          "id": "o2fgn3j",
          "author": "TemporaryKangaroo387",
          "text": "the framework of \"validate distribution before building\" is honestly underrated, most people do it backwards and wonder why they fail\n\none thing id add tho, the distribution channels themselves are shifting faster than ever now. like 2 years ago ranking for keywords was way easier, now you gotta factor in AI search eating clicks. reddit is still a goldmine but its getting more competitive too as more people catch on\n\nthe healthcare clinic one resonates hard, enterprise sales cycles are basically impossible as a solo founder working nights. by the time you close one deal youre burned out and your runway is gone\n\ncurious what subreddits worked best for the newsletter tool? that niche seems like it would have decent overlap with creator/indie hacker communities",
          "score": 5,
          "created_utc": "2026-01-29 15:50:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2f243e",
          "author": "MuslimKhan3040",
          "text": "due to the increasing amount of accessible apps this would seem realistic as most of them are free and easy to use",
          "score": 1,
          "created_utc": "2026-01-29 14:43:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2gorzf",
              "author": "chieferkieffer",
              "text": "Yeah, the saturation is real. With so many options out there, it really comes down to finding that unique angle or niche where you can actually connect with your audience without breaking the bank on ads.",
              "score": 2,
              "created_utc": "2026-01-29 19:08:31",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2f463m",
          "author": "Vumaster101",
          "text": "How are people distributing through Reddit? I saw something about people set up keywords and they Auto set up replies and stuff like that but I don't know any tools that do that.",
          "score": 1,
          "created_utc": "2026-01-29 14:53:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2f5kdz",
          "author": "centurytunamatcha",
          "text": "nobody warns you that distribution can quietly kill a great idea while you’re blaming yourself for not building well enoughh..",
          "score": 1,
          "created_utc": "2026-01-29 15:00:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2fx1aa",
          "author": "BP041",
          "text": "The healthcare clinic example is painfully relatable. I've seen founders build genuinely excellent B2B products that die because the sales cycle requires demos, procurement processes, and 6+ months of trust-building - impossible for solo founders with day jobs.\n\nYour framework of \"can I reach 5,000+ customers for free?\" is basically asking \"do I have a distribution unfair advantage?\" For most of us, that's Reddit, Twitter, or SEO-able keywords. If your customers aren't in those places, you're fighting uphill.\n\nOne thing I'd add: even within reachable communities, timing matters. Commenting on rising posts in niche subreddits has been way more effective for me than posting my own content. Less competition, better visibility as the post grows.\n\nWhat made you decide to keep trying after the third failure? That's a lot of pivots without giving up entirely.",
          "score": 1,
          "created_utc": "2026-01-29 17:03:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2h63al",
          "author": "maheshv1",
          "text": "This episode by A16Z (top VC company) captures this on what to focus. [https://open.spotify.com/episode/6lDPOsmvBWrxzmZOpyjgVP?si=VpzXC034QJi3sXsTeSF1VQ](https://open.spotify.com/episode/6lDPOsmvBWrxzmZOpyjgVP?si=VpzXC034QJi3sXsTeSF1VQ)",
          "score": 1,
          "created_utc": "2026-01-29 20:30:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2h9zhp",
          "author": "Zealousideal-End3405",
          "text": "Thanks for the enlightenment 🙏🏽",
          "score": 1,
          "created_utc": "2026-01-29 20:49:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2himw3",
          "author": "Altruistic_Minimum94",
          "text": "Super good insight on this. I've failed many times and it's defeating but still trying to keep on going.",
          "score": 1,
          "created_utc": "2026-01-29 21:31:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2exx5a",
          "author": "Twinuno_",
          "text": "I agree - many good ideas but distribution is challenging especially for b2b .  One other way is to start local and have conversations with those users to see what you can build",
          "score": 1,
          "created_utc": "2026-01-29 14:22:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ey8g6",
          "author": "BallerDay",
          "text": "Distribution is king. Big reason why the big guys often end up winning while being late to the party. Great post!",
          "score": 1,
          "created_utc": "2026-01-29 14:23:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ezazu",
          "author": "One_Perspective971",
          "text": "exploring strategies for organic customer acquisition in different niches sound helpful",
          "score": 0,
          "created_utc": "2026-01-29 14:29:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ezbvw",
          "author": "omegadev666",
          "text": "Thanks for this.",
          "score": 0,
          "created_utc": "2026-01-29 14:29:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ezuwu",
          "author": "BeardedWiseMagician",
          "text": "Lesson learned: If you can’t reach buyers cheaply and repeatedly, even great products stall. Validating access to an audience before writing code is the real PMF test now.",
          "score": 0,
          "created_utc": "2026-01-29 14:32:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2f1g34",
          "author": "Jacky-Intelligence",
          "text": "The distribution insight hits hard. It's frustrating how we're taught to obsess over building the perfect product, but nobody talks about the 18-month grind to find buyers. Really appreciate you sharing the specific numbers on what didn't work.",
          "score": 0,
          "created_utc": "2026-01-29 14:40:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2h7ua0",
          "author": "Big_Amphibian1100",
          "text": "Is this a ad?",
          "score": -36,
          "created_utc": "2026-01-29 20:39:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2inu0o",
              "author": "MichaelF-",
              "text": "Yes.",
              "score": 2,
              "created_utc": "2026-01-30 01:03:45",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qtuqns",
      "title": "Launched 4 side projects in 18 months. All solved real problems. Only 1 made money.",
      "subreddit": "SideProject",
      "url": "https://www.reddit.com/r/SideProject/comments/1qtuqns/launched_4_side_projects_in_18_months_all_solved/",
      "author": "ProfessionalLast4311",
      "created_utc": "2026-02-02 13:15:49",
      "score": 62,
      "num_comments": 46,
      "upvote_ratio": 0.82,
      "text": "Built 4 different side projects between 2024-2025. All solved genuine problems I validated through interviews. All had paying customers willing to buy. But only 1 actually made consistent money. Took me 18 months to realize the difference wasn't product quality or problem validity. It was whether I could organically reach enough customers without paid ads. First project was CRM for real estate agents. Great product, agents loved it, charged $49/month. Problem was I couldn't reach real estate agents organically. They weren't on Reddit. No searchable keywords brought them. Needed LinkedIn ads or cold calling. Died at $340 MRR after 6 months because I couldn't afford customer acquisition.\n\nSecond project was analytics dashboard for Shopify stores. Solid tool, store owners wanted it. But Shopify app store was saturated. Getting discovered required paid ads competing against funded companies. Made $180 total before quitting. Distribution was impossible without budget.​ Third project was scheduling tool for healthcare clinics. Clinics needed it desperately. But healthcare sales cycle was 3-6 months, required demos, compliance questions, multiple stakeholders. As solo founder working nights, I couldn't handle that sales process. Gave up at 2 customers.​\n\nFourth project was content calendar for newsletter creators. Finally got distribution right. Newsletter creators gathered in 8 active subreddits, 5 Facebook groups, and searched specific keywords on Google. I could reach 10,000+ potential customers organically. Built tool in 5 weeks, launched everywhere they gathered, hit $6,400 MRR in 6 months. [Studied pattern in Founders database comparing side projects that succeeded versus failed](http://foundertoolkit.org). Successful ones had organic distribution channels accessible to solo founders. Failed ones required paid ads, long sales cycles, or access to audiences solo founders couldn't reach. Distribution feasibility mattered more than product-market fit.​\n\nThe framework I wish I knew earlier was validate distribution before building. Can you reach 5,000+ target customers through Reddit, SEO, or communities you access for free? If no, don't build it as side project. Save that idea for when you have budget or team. Submitted successful project to 95+ directories, ranked for buyer keywords within 6 weeks, engaged in communities daily. All free distribution that scaled. Previous 3 projects had no path to customers without spending money I didn't have.\n\nStop building side projects for markets you can't access organically. Start with distribution channels, then build for audiences you can reach.\n\nHow many of your side projects failed because of distribution, not product quality?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/SideProject/comments/1qtuqns/launched_4_side_projects_in_18_months_all_solved/",
      "domain": "self.SideProject",
      "is_self": true,
      "comments": [
        {
          "id": "o3cynsf",
          "author": "virgin_dietcoke",
          "text": "the \"real problem + willing buyers ≠ revenue\" thing is so true\n\nive had 3 projects where people said theyd pay then ghosted when i launched. distribution and positioning matter more than product quality in the first 90 days\n\nwhat made the difference for your 1 successful project? was it the market or how you positioned it?\n\nfor me using giga create app to ship faster helped cause i could test 3 ideas in the time it used to take me to build 1. more shots on goal = better odds of finding the winner",
          "score": 3,
          "created_utc": "2026-02-03 15:53:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3db3xn",
              "author": "Ok_Stay_8530",
              "text": "curious what is giga? do you build a full product?",
              "score": 1,
              "created_utc": "2026-02-03 16:51:36",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o35ivy0",
          "author": "MuslimKhan3040",
          "text": "this hits hard. twitter makes it feel like you’re one tactic away from breakout growth, when in reality most of those threads are just recycled anecdotes without numbers.",
          "score": 6,
          "created_utc": "2026-02-02 13:39:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o366n2v",
          "author": "MetricCreator",
          "text": "Looks cool! How long did it take you to build this?",
          "score": 1,
          "created_utc": "2026-02-02 15:43:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o378lle",
          "author": "Ok_Row9465",
          "text": "Curious if you have a concrete workflow to validate “I can reach \\~5k people organically” before writing code.\n\nStuff like:\n\n\\- how you estimate reachable audience on Reddit (subs, post frequency, what tends to get upvoted, etc.)  \n\\- how you sanity check SEO (keyword intent, difficulty, how many pages you’d realistically ship)  \n\\- what signals make you say “this channel is actually accessible for a solo founder”\n\nBTW, building that distribution map feels like a side project in itself. Ever thought of building that?",
          "score": 1,
          "created_utc": "2026-02-02 18:37:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3845k7",
          "author": "Kindly_Subject",
          "text": "Yep. Distribution is the real gate. A great product in a place you can’t reach is basically invisible as a side project.",
          "score": 1,
          "created_utc": "2026-02-02 21:04:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o384tc0",
          "author": "stormlightz",
          "text": "sell before build",
          "score": 1,
          "created_utc": "2026-02-02 21:07:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o39uzn9",
          "author": "originx_games",
          "text": "How do you post in these communities? I also have a product but as I try to post either my post gets deleted or i account gets banned",
          "score": 1,
          "created_utc": "2026-02-03 02:37:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3aqaub",
          "author": "Then-Boysenberry2064",
          "text": "real",
          "score": 1,
          "created_utc": "2026-02-03 06:06:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o35y0dy",
          "author": "DobroMoutro",
          "text": "Another shameless ad for that toolkit…",
          "score": -29,
          "created_utc": "2026-02-02 15:01:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o35p1tf",
          "author": "bradium",
          "text": "This matches my experience exactly. The validate distribution before building framework would have saved me months on my first project. I built a tool that users loved but my target customers were scattered across LinkedIn, which meant paid ads or cold outreach.\n\nMeanwhile a simpler tool I built later for content creators took off because they all congregated in the same subreddits and Discords. The difference wasnt the quality of the product, it was whether I could reach them daily without spending money.\n\nNow I literally ask myself before any project: where do these people already hang out online, and can I get in front of them for free? If I cant answer that clearly, I dont build it.",
          "score": 1,
          "created_utc": "2026-02-02 14:14:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o38gquv",
              "author": "BlueberryMany7641",
              "text": "The main thing you nailed is turning “where do they hang out and can I reach them daily?” into a hard gate before you write code.\n\n\n\nOne extra layer that’s helped me is scoring ideas on 3 things before I start: 1) reachable audience size (subs, Discords, newsletters, search volume), 2) how often they experience the pain (daily > weekly > monthly), 3) how easy it is to show proof of value in a screenshot or 30s Loom. If a project doesn’t hit at least 2/3 high, I park it.\n\n\n\nThen I do a 1–2 week “distribution sprint” before building: post problem-focused questions, share a barebones Notion mock, pre-sell with a Stripe link, and see if I can get 5–10 people to pay or commit to a call. If that fails, that’s my signal, not a challenge.\n\n\n\nOn tools, I’ve used things like Sparktoro and TweetHunter to find active pockets, and Pulse for Reddit plus normal Reddit search to catch high-intent threads where my users are already ranting.\n\n\n\nMain point: treat easy, repeatable access to the same people as a non-negotiable prerequisite, not a nice bonus.",
              "score": 2,
              "created_utc": "2026-02-02 22:03:55",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o362m4n",
              "author": "Ryland990",
              "text": "I am also facing a similar situation, and the fact that your target customers are scattered can also be an opportunity, right ? It can be that that niche is less competitive because of that exact reason",
              "score": 1,
              "created_utc": "2026-02-02 15:23:52",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o35visv",
          "author": "OkSatisfaction1845",
          "text": "This is a masterclass in why \"Distribution-First\" is becoming the standard for bootstrapped founders. Your experience with the real estate CRM perfectly illustrates the \"CAC (Customer Acquisition Cost) vs. LTV (Lifetime Value)\" trap. If the only way to reach your audience is through high-intent paid channels or manual outreach, it’s nearly impossible to scale a $49/month product without significant funding.\n\n\n\nIt’s refreshing to see someone acknowledge that a \"great product\" isn't enough if the unit economics of discovery don't work. Now that you've identified organic reach as your primary filter, how has your vetting process changed for the ideation phase? Do you now discard ideas immediately if they don't have a clear \"watering hole\" (like a specific subreddit or niche community) where you can build presence for free?",
          "score": 1,
          "created_utc": "2026-02-02 14:48:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o35lf5v",
          "author": "Bading_na_green_Flag",
          "text": "do you think SEO and communities always win, or is that just because you stuck with them longer?",
          "score": 0,
          "created_utc": "2026-02-02 13:54:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o35t4ih",
              "author": "ProfessionalLast4311",
              "text": "partly time, but mostly intent. people searching or actively discussing a problem are already halfway to buying. everything else felt like interrupting strangers.",
              "score": 0,
              "created_utc": "2026-02-02 14:35:45",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o361ltf",
                  "author": "Ryland990",
                  "text": "This is solid advice!",
                  "score": 0,
                  "created_utc": "2026-02-02 15:18:56",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o35pwvj",
          "author": "bleach3434",
          "text": "the amount of hours people sink into “trying everything” without tracking conversions is wild. engagement feels productive until you check revenue and nothing moved.",
          "score": 0,
          "created_utc": "2026-02-02 14:18:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o35v2s7",
          "author": "droneandron",
          "text": "How did you find people for interviews to validate the idea? And much did you pay them to to talk to you?",
          "score": 0,
          "created_utc": "2026-02-02 14:45:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3620je",
          "author": "Ryland990",
          "text": "Great take on this ! How long did it take for SEO to take off ? Anything advice rankings? \n\nDid you also consider GEO ? Seems to get quite a buzz lately",
          "score": 0,
          "created_utc": "2026-02-02 15:20:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3666qe",
          "author": "ruibranco",
          "text": "The \"can you reach 5,000+ target customers for free\" filter is brutal but honest. I wasted months on a dev tool that was genuinely useful but targeted a niche that basically doesn't hang out anywhere online. No subreddits, no active forums, no searchable keywords. Great product, zero organic reach. Meanwhile a simpler tool I built for a community I was already active in got traction in weeks just from posting where those people already were.",
          "score": 0,
          "created_utc": "2026-02-02 15:41:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o36uzi9",
          "author": "Elhadidi",
          "text": " I've been in the same boat with organic reach. Automating SEO blog posts with this free n8n workflow really helped me rank buyer keywords faster—might be worth checking out: [https://youtu.be/sqynh-jtDOM](https://youtu.be/sqynh-jtDOM)",
          "score": 0,
          "created_utc": "2026-02-02 17:35:41",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qvy7r5",
      "title": "I built a website where you read one anonymous note from the person before you, then leave one for the person after you.",
      "subreddit": "SideProject",
      "url": "https://v.redd.it/iwsdhbfs3jhg1",
      "author": "TheHonestRedditer",
      "created_utc": "2026-02-04 19:27:02",
      "score": 57,
      "num_comments": 51,
      "upvote_ratio": 0.95,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/SideProject/comments/1qvy7r5/i_built_a_website_where_you_read_one_anonymous/",
      "domain": "v.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "o3l8yta",
          "author": "NWRegAgentJaq",
          "text": "This seems really sweet in theory, and I'd hope people would be respectful. Unfortunately, the first note I read was an angry expletive. What kinds of moderation or filtering are you using to keep the vibes right?",
          "score": 16,
          "created_utc": "2026-02-04 19:59:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3ldkb8",
              "author": "TheHonestRedditer",
              "text": "Implementing moderation (both automated filters and a reporting system) is my top priority and is exactly what I’m working on next.\n\nThanks for giving it a try despite the bad start!",
              "score": 6,
              "created_utc": "2026-02-04 20:22:02",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3o3w1k",
                  "author": "HeadCryptographer152",
                  "text": "I would recommend having a reserve of positive messages as well that you can swap in if a note that violates your rules is detected - ideally any troll messages should never be seen by the next person.",
                  "score": 2,
                  "created_utc": "2026-02-05 05:32:30",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o3le6l6",
                  "author": "NWRegAgentJaq",
                  "text": "That's great to hear! I love it as an idea - the world could honestly use more ways to lift each other up - and I'll come back if/when I remember tomorrow.\n\nI~~t might also be helpful to clarify and/or separate out the read and write functions? I read the note, closed the tab, and when I went back to the site I'm locked out of writing my own note because I needed to have done it before closing the tab I guess.~~ ETA: I can get around this with an incognito window at least, and just noticed that there's a dark mode too! Thanks for including that, it's way easier on the eyes for me. Aaaaaand now I can actually see the tiny text with the instructions I asked for haha",
                  "score": 1,
                  "created_utc": "2026-02-04 20:24:57",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o3la3aj",
              "author": "GuyNamedBrian",
              "text": "I promise that was not me... So good news is at least 2 people have used it since OP posted.",
              "score": 5,
              "created_utc": "2026-02-04 20:05:26",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3ljhu0",
          "author": "LongTermAgreement",
          "text": "https://preview.redd.it/bv0oebw2jjhg1.jpeg?width=1179&format=pjpg&auto=webp&s=66b9bf26da63be0bbbaad5aee4b3710921c4f15e\n\nthis is peak",
          "score": 12,
          "created_utc": "2026-02-04 20:50:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3lkdxi",
              "author": "TheHonestRedditer",
              "text": "Lmao. Honestly, part of me is torn on moderation, there is something kind of raw and real about the daily gamble of getting a wholesome quote or just a random \"fuck you.\" It’s definitely a risk every time you open the envelope!",
              "score": 8,
              "created_utc": "2026-02-04 20:54:36",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3lv31k",
                  "author": "imagine1149",
                  "text": "What id recommend is do a sentiment analysis of each message from 0-5 or something. 0 being mean or negative and 5 being positive and wholesome.\n\nThere should be a world vibe index in the homepage that is a rating based on all the messages that people have sent and at any given point it’ll be an index of how people are on the internet towards strangers unmoderated. \n\nYou can have interesting analytics: \n\n- how often do people reply to positive with negative, or negative with positive. \n\n- how often do people continue negativity or positivity. \n\nIt’d act as a pretty cool way to rate our society and maybe become a social experiment for how humans are when there are no chains no rules. \n\nHmu if you want help with any of this",
                  "score": 3,
                  "created_utc": "2026-02-04 21:45:32",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o3lywip",
                  "author": "letsprogramnow",
                  "text": "That shit is funny but I can see how it can make someone already in a poor headspace to feel wordt",
                  "score": 2,
                  "created_utc": "2026-02-04 22:03:48",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o3mfe5z",
                  "author": "LongTermAgreement",
                  "text": "I love the gamble my vote is keep it",
                  "score": 1,
                  "created_utc": "2026-02-04 23:29:41",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o3or5nr",
                  "author": "Feidhlim77",
                  "text": "I love it. Unless someone posts pro nazi stuff or some shit, leave it. I don't mind getting a \"fuck you\". It would make me chuckle",
                  "score": 1,
                  "created_utc": "2026-02-05 08:58:51",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3luqxx",
          "author": "raccoonizer3000",
          "text": "Was not disappointed. I got:\n\n\\> There’s kindness in this world, and boobs. I prefer boobs.",
          "score": 5,
          "created_utc": "2026-02-04 21:43:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3m5i3d",
              "author": "TheHonestRedditer",
              "text": "Peak message.",
              "score": 1,
              "created_utc": "2026-02-04 22:36:53",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o3nuy97",
              "author": "YendorZenitram",
              "text": "Better still to have kind boobs...or thw kind of boosld that make people want to be kind, or the kind of kindness thay makes peope want to show their boobs...or...",
              "score": 1,
              "created_utc": "2026-02-05 04:29:22",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3l6woa",
          "author": "Altruistic-Monk-777",
          "text": "This reminds me of the Android app - Slowly.\nIt is an interesting concept.",
          "score": 4,
          "created_utc": "2026-02-04 19:50:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3lp3ik",
          "author": "ygvq",
          "text": "\"trump is a kiddy diddler\" PEAK",
          "score": 3,
          "created_utc": "2026-02-04 21:16:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3lpywj",
              "author": "TheHonestRedditer",
              "text": "Lmao, I'm so glad you found the experience funny!",
              "score": 3,
              "created_utc": "2026-02-04 21:21:10",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3lqwtc",
                  "author": "ygvq",
                  "text": "its pure cinema bro",
                  "score": 2,
                  "created_utc": "2026-02-04 21:25:39",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3ljflb",
          "author": "DriftyaApp",
          "text": "Nice, but the message I received\n was not so nice. Maybe some report feature would be good.",
          "score": 2,
          "created_utc": "2026-02-04 20:50:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3lkqa1",
              "author": "TheHonestRedditer",
              "text": "Ah, I'm sorry to hear you got a bad one. A report feature is definitely on the roadmap to help clean things up a bit without losing the anonymous nature of it. Thanks for checking it out!",
              "score": 1,
              "created_utc": "2026-02-04 20:56:13",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3lxwox",
          "author": "AeroLMS",
          "text": "Depending on the demographic, it would either be filled with wholesome messages or you'll be forced to put filters on what you're about to see.",
          "score": 2,
          "created_utc": "2026-02-04 21:58:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3m5q9b",
              "author": "TheHonestRedditer",
              "text": "Yeah, I agree. So far, positive vibes have overwhelmed the negative which is nice to see.",
              "score": 1,
              "created_utc": "2026-02-04 22:38:01",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3mdo19",
          "author": "Goody91",
          "text": "I like it and to be honest i like the rawness of no moderation. I think the idea someome suggested of showing positive and negative notes is good also. Small feedback from me would be to limit characters so it stays short.",
          "score": 2,
          "created_utc": "2026-02-04 23:20:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3mivea",
              "author": "TheHonestRedditer",
              "text": "I'm glad you like it! And you are right, I should definitely add a limit to avoid spam.",
              "score": 2,
              "created_utc": "2026-02-04 23:49:09",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3mu0da",
          "author": "sandropuppo",
          "text": "cool concept, are people actually using it?",
          "score": 2,
          "created_utc": "2026-02-05 00:50:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3mx9gv",
              "author": "TheHonestRedditer",
              "text": "Yeah, I get plenty of daily users.",
              "score": 1,
              "created_utc": "2026-02-05 01:08:52",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3muxpu",
          "author": "vidalakistrajk",
          "text": "Had this idea like 2 years ago but never gotten to work on it. Love that somebody built it!",
          "score": 2,
          "created_utc": "2026-02-05 00:55:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3mx3r1",
              "author": "TheHonestRedditer",
              "text": "Thank you!",
              "score": 1,
              "created_utc": "2026-02-05 01:07:57",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3mx0vq",
          "author": "Impressive_Map_3964",
          "text": "This is cool. Are you planning on making an app version for it?",
          "score": 2,
          "created_utc": "2026-02-05 01:07:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3mxics",
              "author": "TheHonestRedditer",
              "text": "I thought about making it an app at first, but I felt like it would be better as a simple website instead to keep things simple.",
              "score": 2,
              "created_utc": "2026-02-05 01:10:17",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3ne32v",
          "author": "Buckwheat469",
          "text": "Nice. I hope the person's son gets cured of their cancer. I left an inspirational message for the next person.",
          "score": 2,
          "created_utc": "2026-02-05 02:45:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3orbqw",
              "author": "TheHonestRedditer",
              "text": "Thank you! That's honestly great to hear.",
              "score": 1,
              "created_utc": "2026-02-05 09:00:30",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3ns24i",
          "author": "sailormish980",
          "text": "I know money is not a major thing bit out of curiosity how you will monetise this becz this is great idea",
          "score": 2,
          "created_utc": "2026-02-05 04:10:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3orout",
              "author": "TheHonestRedditer",
              "text": "Thanks! Right now, I'm already getting some small donations through the Ko-fi link on the site which helps with the server costs. If it ends up getting a lot more traction, I’ll probably look into adding some very short, minimal ads (but only if I can do it in a way that doesn't ruin the clean, quiet experience.)",
              "score": 1,
              "created_utc": "2026-02-05 09:04:08",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3nu862",
          "author": "YendorZenitram",
          "text": "This is an adorable idea!",
          "score": 2,
          "created_utc": "2026-02-05 04:24:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3l40qa",
          "author": "GuyNamedBrian",
          "text": "I just left a note. Cool idea. I'm curious how it works if two people open the same note at the same time, or if I read a note but don't create one, will the next person see the same not I did?   I like the idea of a single 'chain' message  (although I'm not sure why) but curious how the stack of messages is handled.",
          "score": 1,
          "created_utc": "2026-02-04 19:36:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3l64w1",
              "author": "TheHonestRedditer",
              "text": "Glad you like the concept! As per your questions, It works like a log. If two people open it at the exact same moment, they will both see the same message (the current latest one). On the other hand, the message isn't \"consumed\" or deleted when you read it. If you read a note but leave without writing one, that note stays at the top of the stack. The next visitor will see it and hopefully continue the chain.",
              "score": 2,
              "created_utc": "2026-02-04 19:46:27",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3l58h3",
          "author": "Unlucky-Town-8060",
          "text": "Interesting",
          "score": 1,
          "created_utc": "2026-02-04 19:42:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3l66kr",
              "author": "TheHonestRedditer",
              "text": "I'm glad you found it interesting!",
              "score": 1,
              "created_utc": "2026-02-04 19:46:41",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3lnb9k",
          "author": "Longjumping_Onion424",
          "text": "I love this idea! My suggestion is that you have some sort of moderator who can kick or block people. Maybe a company could have a group where people leave inspirational quotes or feedback on a project.",
          "score": 1,
          "created_utc": "2026-02-04 21:08:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ndg60",
          "author": "jretamal",
          "text": "Me gusto mucho! lei y deje mi primer mensaje.",
          "score": 1,
          "created_utc": "2026-02-05 02:41:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3or9od",
              "author": "TheHonestRedditer",
              "text": "¡Me alegra que te guste! Hazlo una rutina diaria.",
              "score": 1,
              "created_utc": "2026-02-05 08:59:57",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3nkai5",
          "author": "Round-Illustrator243",
          "text": "This looks great! Which tech stack did you use?",
          "score": 1,
          "created_utc": "2026-02-05 03:21:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3orj6h",
              "author": "TheHonestRedditer",
              "text": "It’s built with React and Tailwind CSS, using Supabase for the database and auth logic. Animations are handled by Framer Motion.",
              "score": 1,
              "created_utc": "2026-02-05 09:02:35",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3oiz6t",
          "author": "MrPajamaLIama",
          "text": "Love this!",
          "score": 1,
          "created_utc": "2026-02-05 07:41:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3oqcjo",
          "author": "cheng-alvin",
          "text": "I love this design style! Does anybody know what this is called? If possible, OO, do you have a component library, fonts or anything you have used? \n\nThanks",
          "score": 1,
          "created_utc": "2026-02-05 08:51:07",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qqmzup",
      "title": "My side project from this community hit 10M messages. I quit my job to go all in.",
      "subreddit": "SideProject",
      "url": "https://v.redd.it/mf2fx5ogwcgg1",
      "author": "KingRushiSushi",
      "created_utc": "2026-01-29 22:19:08",
      "score": 56,
      "num_comments": 43,
      "upvote_ratio": 0.91,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/SideProject/comments/1qqmzup/my_side_project_from_this_community_hit_10m/",
      "domain": "v.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "o2jl54m",
          "author": "zeros-and-1s",
          "text": "aside from everything else... how the hell did you get that domain?",
          "score": 12,
          "created_utc": "2026-01-30 04:13:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2kmj6q",
              "author": "KingRushiSushi",
              "text": "got lucky! super grateful",
              "score": 2,
              "created_utc": "2026-01-30 09:05:49",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o2kd3u2",
              "author": "jrbp",
              "text": "A load of $$$ I'm guessing! But very surprised it was available",
              "score": 0,
              "created_utc": "2026-01-30 07:40:44",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2i89ff",
          "author": "gregb_parkingaccess",
          "text": "Is this with your company or did you go off on your own?",
          "score": 3,
          "created_utc": "2026-01-29 23:39:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2igny7",
              "author": "KingRushiSushi",
              "text": "it’s my own!",
              "score": 3,
              "created_utc": "2026-01-30 00:25:27",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2iey07",
          "author": "gmdmd",
          "text": "Pretty cool concept.. I wonder if something like this would work for my stock market investing signal group chat, but to keep track of when people say they are buying/selling etc.",
          "score": 2,
          "created_utc": "2026-01-30 00:16:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2igvp9",
              "author": "KingRushiSushi",
              "text": "hmmm fascinating use case, we are working on memory piece. this could potentially work! are you able to give me a example? \n\nmaybe i can even tweak if it supports your use case perhaps",
              "score": 3,
              "created_utc": "2026-01-30 00:26:36",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2ihwi1",
                  "author": "gmdmd",
                  "text": "Hmmm not sure.  It usually goes something like.. \n\nMe:hey anyone jumping on this copper bandwagon.  \n\nMy friend: yeah I bought a bunch.  \n\nMe: what the heck why didn't you tell me\n\nFriend: I did (show message from a few weeks back).\n\nAlso a lot of us are super busy (doctors etc) and the messages can get overwhelming in number so sometimes it would be nice to be able to summarize or notified when someone is actually making a buy.\n\n...\n\nmight be more of a vitamin than a pain killer for our use case though..",
                  "score": 1,
                  "created_utc": "2026-01-30 00:32:04",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2iy1fu",
          "author": "SaltPhotograph8506",
          "text": "epic! Can I feature your product for free in my newsletter?\n\nWe have 45k subs:\n\n[https://launch-llama.beehiiv.com/](https://launch-llama.beehiiv.com/)",
          "score": 2,
          "created_utc": "2026-01-30 02:00:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2iyyy9",
              "author": "KingRushiSushi",
              "text": "sure! go for it. \n\nlink me once it’s up :)",
              "score": 1,
              "created_utc": "2026-01-30 02:05:58",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2izk98",
                  "author": "SaltPhotograph8506",
                  "text": "DM you 🙂",
                  "score": 1,
                  "created_utc": "2026-01-30 02:09:19",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2iz7ii",
          "author": "Vegetable_Ease_5515",
          "text": "So you were spying on people's conversations?",
          "score": 2,
          "created_utc": "2026-01-30 02:07:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2izxhf",
              "author": "KingRushiSushi",
              "text": "conducted tons of user interviews and sent out surveys, that shaped my understanding of how people were using the product",
              "score": 1,
              "created_utc": "2026-01-30 02:11:22",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2jgjyo",
                  "author": "Fluffy-Extent2648",
                  "text": "Fair enough, that is what I was expecting you to say, but you never know. Congrats!",
                  "score": 2,
                  "created_utc": "2026-01-30 03:44:58",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2n4hqg",
          "author": "One_Tie900",
          "text": "You are able to read peoples conversations?",
          "score": 2,
          "created_utc": "2026-01-30 17:49:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2n89tm",
              "author": "KingRushiSushi",
              "text": "nope. im big on privacy and security as much as i can. your profile and convos encrypted",
              "score": 1,
              "created_utc": "2026-01-30 18:06:07",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2n9n2r",
                  "author": "One_Tie900",
                  "text": "So you only have access to the questions they ask? Do you use anything for advertising? How do you make money or is this more non profit tool.",
                  "score": 2,
                  "created_utc": "2026-01-30 18:12:03",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2iul2y",
          "author": "served_it_too_hot",
          "text": "How did get your first users?\n\nEdit - typo",
          "score": 1,
          "created_utc": "2026-01-30 01:41:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2iys1u",
              "author": "KingRushiSushi",
              "text": "honestly, the first users were simply friends and family. eventually it was useful enough where naturally word of mouth started happening. \n\ni also posted on this community to show my project and a few others to get feedback. then slowly it was increasing",
              "score": 1,
              "created_utc": "2026-01-30 02:04:55",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2jl0tt",
          "author": "flashmatrix",
          "text": "Thanks for sharing. Times have changed from a year ago and with the fast moving pace of AI tools, the barrier to build is low but barrier for distribution is still high. it might even be harder now because of the over saturation of apps that are being built. With the knowledge you've accumulated over the year, do you have any tips for new builders today?",
          "score": 1,
          "created_utc": "2026-01-30 04:12:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2kmrpj",
              "author": "KingRushiSushi",
              "text": "i would say thinking critically through your product makes you stand out quite easily. building is relatively easy but what to build still requires depth and clear thinking. most people falter at the latter\n\nhave fun building, try out bunch of things, and best of all talk to users and try to understand their problems. that usually helps guide your north star",
              "score": 2,
              "created_utc": "2026-01-30 09:07:57",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2jl8ao",
          "author": "DiesesInternet",
          "text": "Amazing and I hope to see you succed, but I fear people are really going to hate to have another Messenger. Alfi should be able to be added to a whatsapp group chat as a workaround. People then get to know the usefullness driving them organicly to the app.",
          "score": 1,
          "created_utc": "2026-01-30 04:13:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2kmxm5",
              "author": "KingRushiSushi",
              "text": "alfi is already available on sms, imessage, and whatsapp. unfortunately whatsapp group is blocked by their walled garden. hence our response. we’ll just make it and we’ll make it 10x better\n\nwe are still using 2012 tools to manage our 2026 social life. time for an upgrade! a meaningful one too :)",
              "score": 1,
              "created_utc": "2026-01-30 09:09:26",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2jwp2x",
          "author": "OkRespect7678",
          "text": "This is one of the best pivot stories I've read here. The insight about group chats being \"where plans go to die\" is so relatable - I've lost count of how many dinner plans have just faded into \"we should totally do this sometime\" oblivion.\n\n  \nReally curious about the transition from [text.ai](http://text.ai) to Alfi - what was the hardest part of letting go of the original product direction when you had 10M messages and clear traction? That's a tough call to make even when the data is pointing you somewhere new.\n\n  \nAlso love that you're keeping it small (1-8 people). So many social apps try to scale to everyone and lose what made them special. Best of luck with the launch!",
          "score": 1,
          "created_utc": "2026-01-30 05:29:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2knerd",
              "author": "KingRushiSushi",
              "text": "quite a bit was challenging but i would say thinking through first principles helped me quite a bit\n\ni always asked what are the assumptions we make when building for consumer messaging and what is lacking today, turns out there is quite a bit of room for improvement across systems. most of the messaging apps we use today are either default or well over a decade old. we’ve forgotten to make consumer apps fun and meaningful \n\nappreciate your kind support. hope you get a chance to try out Alfi",
              "score": 1,
              "created_utc": "2026-01-30 09:13:51",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2khwpg",
          "author": "OldNeedleworker5869",
          "text": "How did you get the distribution in good shape?",
          "score": 1,
          "created_utc": "2026-01-30 08:23:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2knhjx",
              "author": "KingRushiSushi",
              "text": "we started off with sms, so basically users didn’t need to download anything. simply text a number. low barrier to trying the product helps quite a bit. \n\nwe still use that today!",
              "score": 1,
              "created_utc": "2026-01-30 09:14:35",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2kka2l",
          "author": "TightPublic3143",
          "text": "Seems an incredible project! If you're searching for a software engineer to give you a hand feel free to DM me",
          "score": 1,
          "created_utc": "2026-01-30 08:45:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2knmws",
              "author": "KingRushiSushi",
              "text": "dm me, happy to take a look",
              "score": 1,
              "created_utc": "2026-01-30 09:15:55",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2kks9y",
          "author": "singleandavailable",
          "text": "What if you have no friends?",
          "score": 1,
          "created_utc": "2026-01-30 08:49:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2knlxf",
              "author": "KingRushiSushi",
              "text": "you can message Alfi directly as well. doesn’t have to be only with friends\n\nor you can message the Alfi team on there, we can be friends :)",
              "score": 1,
              "created_utc": "2026-01-30 09:15:41",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2kvv03",
                  "author": "singleandavailable",
                  "text": "\"Alfi, why is the Alfi team still in my living room eating all my chips. Tell them to go home it's well past midnight\"",
                  "score": 1,
                  "created_utc": "2026-01-30 10:30:19",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2koduk",
          "author": "AlekGir",
          "text": "Congrats on hitting 10M messages and going full-time! The insight about group chats being your real social network is spot on. Excited to see where you take Alfi next. Best of luck! 🚀",
          "score": 1,
          "created_utc": "2026-01-30 09:22:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2vwvjh",
          "author": "Lumpy-Low-6509",
          "text": "That's super cool - I liked the marketing / design as well. How did you create the app video demo you posted here?",
          "score": 1,
          "created_utc": "2026-02-01 00:28:31",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qqz18w",
      "title": "Meet Klipy by Tenor GIF Keyboard Team",
      "subreddit": "SideProject",
      "url": "https://www.reddit.com/r/SideProject/comments/1qqz18w/meet_klipy_by_tenor_gif_keyboard_team/",
      "author": "ProjectFluffy6065",
      "created_utc": "2026-01-30 07:37:36",
      "score": 53,
      "num_comments": 1,
      "upvote_ratio": 0.98,
      "text": "Hello everyone, I’m from KLIPY and I’d like to introduce our project.[ KLIPY](https://klipy.com) is co-founded and led by former[ Tenor](http://tenor.com) (Ex-Google) team members, including the ex-founder, CTO, Head of Content, Content Strategy, Search Ranking engineering team and others.\n\n* If you’re a developer, you can migrate to KLIPY in under 10 minutes, often with a simple base URL swap:[ https://klipy.com/migrate](https://klipy.com/migrate)\n* If you’re a creator, we can help you migrate and claim your Tenor profile by filling out this form:[ https://forms.gle/Z6N2fZwRLdw9N8WaA](https://forms.gle/Z6N2fZwRLdw9N8WaA)\n\nWe recently crossed 1500+ API key signups and we’re excited to support you. If you have any questions about migration, compatibility, search, or anything else, drop them here.\n\nYou can see more information about this in our subreddit r/klipycom",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/SideProject/comments/1qqz18w/meet_klipy_by_tenor_gif_keyboard_team/",
      "domain": "self.SideProject",
      "is_self": true,
      "comments": []
    },
    {
      "id": "1qt13zj",
      "title": "A different take on LLM context management inside Obsidian",
      "subreddit": "SideProject",
      "url": "https://v.redd.it/5syebmjwgwgg1",
      "author": "reart_ai",
      "created_utc": "2026-02-01 15:17:36",
      "score": 49,
      "num_comments": 1,
      "upvote_ratio": 0.92,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/SideProject/comments/1qt13zj/a_different_take_on_llm_context_management_inside/",
      "domain": "v.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "o2zcwgm",
          "author": "reart_ai",
          "text": "  \nHere is how the plugin looks like\n\nhttps://preview.redd.it/w57rtk41hwgg1.png?width=3248&format=png&auto=webp&s=d48b93841e4e305308215fed10062c45f491a077",
          "score": 1,
          "created_utc": "2026-02-01 15:18:01",
          "is_submitter": true,
          "replies": []
        }
      ]
    }
  ]
}