{
  "metadata": {
    "last_updated": "2026-02-03 17:18:12",
    "time_filter": "week",
    "subreddit": "SideProject",
    "total_items": 20,
    "total_comments": 322,
    "file_size_bytes": 285302
  },
  "items": [
    {
      "id": "1qp1xvu",
      "title": "I built an unique timer app that switches timers when you tilt the phone",
      "subreddit": "SideProject",
      "url": "https://v.redd.it/6oqzrf37u0gg1",
      "author": "vigneshvp",
      "created_utc": "2026-01-28 04:55:33",
      "score": 403,
      "num_comments": 112,
      "upvote_ratio": 0.93,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/SideProject/comments/1qp1xvu/i_built_an_unique_timer_app_that_switches_timers/",
      "domain": "v.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "o268ns1",
          "author": "Ugiwa",
          "text": "I'm struggling to find a real use case for this, and I'm sure timers would get switched accidentally all the time.  \nCool project nonetheless, but a bit gimmicky:)\n\np.s. I like the animations!",
          "score": 153,
          "created_utc": "2026-01-28 06:59:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o26s287",
              "author": "matkv",
              "text": "To be fair, OP built this based on physical timers with a digital display that work the same way. Those are already available on Amazon, something like [this](https://www.amazon.de/Pomodoro-Countdown-Zeitmanagement-K%C3%BCChenkochen-Verwendet/dp/B0DZ5SNRKD?crid=1BIBJFPECZUWJ&dib=eyJ2IjoiMSJ9.FG4yi0CJRS0EyfkwV-qL4ztmeS_I9u9vc7RvQ3fzsq3M1HPJuc2-xsa4CgyjVQy45lnqQQljNhW3XHiFVHG5RdAPQ1mLOocPTZNfUajA-MZqDlaBg0KqYYJJvOn8BQJpDgM94lu9czFFFFioNkctWh2h5umv3WYHTOwB9LB9v9IzO2iSAfv-jKPf0beYCUas1OMkR5Rxbh-J7y9KqGlHSjRTxrx51O1DoBlq1o_Idr_wGfJdr84KBa2za5Sz4x060Frt-zMTh2eSODL1MLqTGEWAw6KoXEYbbTl3otS_ZxY.8-A6J5DGJOFqy62OKT71rs9dpLNMBa4mo6jdL7i62l4&dib_tag=se&keywords=pomodoro+timer&qid=1769593885&sprefix=%2Caps%2C145&sr=8-6) for example, but there it makes more sense since it's a physical thing you leave on the desk in a certain position.",
              "score": 19,
              "created_utc": "2026-01-28 09:53:51",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o26zvku",
                  "author": "yv_MandelBug",
                  "text": "Kind of like Hour Glasses,",
                  "score": 4,
                  "created_utc": "2026-01-28 11:02:31",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o26zwmh",
                  "author": "Ssemander",
                  "text": "The problem is that the phone is flat",
                  "score": 3,
                  "created_utc": "2026-01-28 11:02:45",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o27c1bp",
                  "author": "vigneshvp",
                  "text": "Yes, that timer device was my main inspiration.",
                  "score": 1,
                  "created_utc": "2026-01-28 12:33:33",
                  "is_submitter": true,
                  "replies": []
                },
                {
                  "id": "o27r79x",
                  "author": "Best_Interest_5869",
                  "text": "If its a physical thing then somebody would definitely buy it but what is the use case of a app in our phone, not understanding the clear use case of the app but for sure its looking nice.",
                  "score": 1,
                  "created_utc": "2026-01-28 14:00:38",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o29nhgh",
              "author": "firifripries",
              "text": "I agree. I was here to tell how is OP intending to use it. Different orientations for different activities sounds right, but doesn't convince me enough. Nonetheless, looks cool.",
              "score": 2,
              "created_utc": "2026-01-28 19:05:48",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o27byp8",
              "author": "vigneshvp",
              "text": "My hands get a bit sweaty when I work out and I don’t use an interval timer because it has strict intervals. I simply set one side for working out and the other for resting and just tilts it.",
              "score": 3,
              "created_utc": "2026-01-28 12:33:03",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o26q063",
          "author": "Developer_Memento",
          "text": "![gif](giphy|s239QJIh56sRW|downsized)",
          "score": 36,
          "created_utc": "2026-01-28 09:35:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o26ko9i",
          "author": "Watching-Void239",
          "text": "The interaction sure doesn't feel natural but the way it is presented should teach the user very quickly.\n\n\nDon't think there are \"edge cases\" but rather the concept as a whole seems weird. If I accidentally touch/tilt my phone I will lose my timer progress. \n\n\nI have also never heard someone complain about the timer UX on their phone.\n\n\nAre you solving a problem thats pretty much nonexistant?",
          "score": 14,
          "created_utc": "2026-01-28 08:45:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o27cw3a",
              "author": "vigneshvp",
              "text": "Thanks for the feedback. The way I use it usually is when my hands are sweaty in a workout session, I just set a timer for each session and just tilt it. I understand most people won’t have an issue like this.",
              "score": 5,
              "created_utc": "2026-01-28 12:39:14",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o29nquf",
                  "author": "addycodes",
                  "text": "That’s a pretty cool use case, you should market it with this",
                  "score": 1,
                  "created_utc": "2026-01-28 19:06:56",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o275kif",
          "author": "flow_guy2",
          "text": "Neat idea. But seems abit impractical. I don’t always remember what side would be which timer. Plus it looks like it resets when you go back to it which kinda defeats the purpose. \n\nMaybe add names as have it just go back to that timer position at the proper time.",
          "score": 5,
          "created_utc": "2026-01-28 11:48:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o27dpbh",
              "author": "vigneshvp",
              "text": "Got it. Will add these in the next update. Thanks.",
              "score": 2,
              "created_utc": "2026-01-28 12:44:29",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o26rqtt",
          "author": "RazerHey",
          "text": "It works when you use it on a bespoke device, I believe the product is already out there, it's like a 3.5 inch screen that you can use as a productivity timer and is programmable like your app. Good job",
          "score": 2,
          "created_utc": "2026-01-28 09:50:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o27d271",
              "author": "vigneshvp",
              "text": "Yes, that timer device was my inspiration. Thanks.",
              "score": 1,
              "created_utc": "2026-01-28 12:40:22",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o27dwoh",
          "author": "Supportic",
          "text": "Reminds me of TK3 Pomodoro timer\nhttps://youtu.be/TDMfmsB58IE",
          "score": 2,
          "created_utc": "2026-01-28 12:45:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2cr8tv",
              "author": "fireantik",
              "text": "When you need a hundred page manual just to operate a clock",
              "score": 1,
              "created_utc": "2026-01-29 04:28:00",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o26w23q",
          "author": "aarynelle",
          "text": "it's a beautiful idea but the use cases you mentioned don't require 4 timers at once lol. Maybe there's a use case here for board games players? Phone position showing different player countdown timer / stats. Find a use case even if it's tiny.",
          "score": 1,
          "created_utc": "2026-01-28 10:29:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o27ddl7",
              "author": "vigneshvp",
              "text": "Never thought about the board game persona. Thanks mate, you are awesome.",
              "score": 1,
              "created_utc": "2026-01-28 12:42:24",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o28blgd",
                  "author": "aarynelle",
                  "text": "Keep going",
                  "score": 1,
                  "created_utc": "2026-01-28 15:39:16",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o2wfa0y",
                  "author": "notintheclouds",
                  "text": "Asked Gemini for use cases:\n\nProfessional & Technical\n1. Coding / Sprints: Portrait for ticketing and bug logs; Landscape for a \"Deep Code\" Pomodoro.\n2. Audio Engineering: Portrait for track levels; Landscape for a \"Recording\" duration clock.\n3. Aviation Pre-flight: Portrait for checklists; Landscape for a fuel-burn or leg timer.\n4. Livestreaming: Portrait for chat monitoring; Landscape for an \"On-Air\" duration counter.\n5. Dental Procedures: Portrait for patient notes; Landscape for a curing-light countdown.\n6. Mechanic / Oil Change: Portrait for parts lists; Landscape for a drain-time monitor.\n7. Video Editing: Portrait for scene metadata; Landscape for a render-time estimate.\n8. Surveying: Portrait for coordinate logging; Landscape for a GPS-lock stabilization timer.\n9. Teleprompting: Portrait for script editing; Landscape for the scrolling text and pace clock.\n10. Legal Billing: Portrait for client/case selection; Landscape for a \"Billable Hours\" active ticker.\nHealth & Wellness\n1. Sleep Coaching: Portrait for sleep hygiene tips; Landscape for a dim, blue-light-free wake-up countdown.\n2. Skin Care / Masks: Portrait for product instructions; Landscape for a \"Treatment\" timer.\n3. Physical Therapy: Portrait for exercise diagrams; Landscape for a \"Hold Position\" clock.\n4. Hydration Tracking: Portrait for daily water logs; Landscape for a \"Next Sip\" reminder.\n5. Intermittent Fasting: Portrait for calorie/window history; Landscape for the \"Fasting\" countdown.\n6. Medication Prep: Portrait for dosage instructions; Landscape for a \"Dissolve/Wait\" timer.\n7. Ice Baths / Sauna: Portrait for temperature logs; Landscape for an oversized \"Survival\" clock.\n8. Eye Strain Breaks: Portrait for schedule settings; Landscape for a \"20-20-20 Rule\" focus object.\n9. Hair Coloring: Portrait for dye formula notes; Landscape for the \"Processing Time\" alert.\n10. Tattoo Aftercare: Portrait for cleaning instructions; Landscape for a \"Soak/Air\" timer.\nEducation & Learning\n1. Standardized Testing: Portrait for practice questions; Landscape for a \"Remaining Time\" simulation.\n2. Language Learning: Portrait for vocabulary lists; Landscape for a \"Rapid Fire\" recall timer.\n3. Music Theory: Portrait for scale diagrams; Landscape for a \"Tempo/BPM\" visualizer.\n4. Debate Practice: Portrait for rebuttal notes; Landscape for a \"Speech Floor\" timer.\n5. Flashcards: Portrait for deck management; Landscape for a \"Speed Run\" challenge clock.\n6. Speed Reading: Portrait for text selection; Landscape for a \"Words-Per-Minute\" pacer.\n7. Library/Study: Portrait for bibliography notes; Landscape for a \"Silence\" session timer.\n8. Science Fair: Portrait for hypothesis data; Landscape for a \"Reaction Observation\" clock.\n9. Classroom Teaching: Portrait for lesson plans; Landscape for a \"Group Activity\" countdown.\n10. Museum Tours: Portrait for exhibit info; Landscape for a \"Time to Next Tour\" ticker.\nLifestyle & Home\n1. Grilling/BBQ: Portrait for meat temp guides; Landscape for a \"Flip the Steak\" timer.\n2. Laundry Room: Portrait for garment care symbols; Landscape for a \"Cycle Finish\" monitor.\n3. Tea Steeping: Portrait for tea leaf varieties; Landscape for a precise \"Brew\" countdown.\n4. Dog Training: Portrait for command logs; Landscape for a \"Stay/Wait\" duration clock.\n5. Nail Salon: Portrait for color palettes; Landscape for a \"UV Dry\" timer.\n6. Gaming / Speedrunning: Portrait for level splits; Landscape for a \"Personal Best\" total-run clock.\n7. Plant Watering: Portrait for plant species care; Landscape for a \"Soak Depth\" timer.\n8. Wine Aeration: Portrait for bottle details; Landscape for a \"Decanting\" clock.\n9. Kids' Toothbrushing: Portrait for reward stickers; Landscape for a \"Brush Zones\" visual timer.\n10. Holiday Cooking: Portrait for recipe scaling; Landscape for an \"Oven Occupied\" master clock.\nCreative & Hobby\n1. Pottery/Kiln: Portrait for clay type notes; Landscape for a \"Cool Down\" monitor.\n2. Model Painting: Portrait for paint mix ratios; Landscape for a \"Dry-to-Touch\" timer.\n3. Astronomy: Portrait for star maps; Landscape for a \"Long Exposure\" shutter clock.\n4. Gardening / Compost: Portrait for pH logs; Landscape for a \"Turn the Pile\" frequency timer.\n5. Jewelry Making: Portrait for inventory lists; Landscape for a \"Solder Cooling\" timer.\n6. Soap Making: Portrait for oil saponification tables; Landscape for a \"Trace\" timer.\n7. Board Game Drafting: Portrait for card abilities; Landscape for a \"Draft Pick\" shot clock.\n8. Knitting/Crochet: Portrait for pattern rows; Landscape for a \"Project Session\" tracker.\n9. Bread Baking: Portrait for hydration math; Landscape for a \"Bulk Fermentation\" clock.\n10. Magic Tricks: Portrait for sleight-of-hand steps; Landscape for a \"Performance Pacing\" timer.",
                  "score": 1,
                  "created_utc": "2026-02-01 02:16:48",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o2wfasn",
                  "author": "notintheclouds",
                  "text": "If you want to lean into the \"Multi-Timer\" aspect specifically—where the orientation shift doesn't just change the view but actually swaps between distinct timers—here are 50 use cases where having two (or more) separate clocks based on how you hold the phone is incredibly practical:\nKitchen & Culinary\n1. Pasta & Sauce: Portrait tracks the boiling water; Landscape tracks the simmering sauce.\n2. Steak & Sides: Portrait for the meat's rest time; Landscape for the vegetables in the oven.\n3. Baking: Portrait for the dough rise; Landscape for the final bake time.\n4. Tea Brewing: Portrait for the water heating; Landscape for the specific leaf steeping time.\n5. Coffee Barista: Portrait for the bloom phase; Landscape for the total pour-over duration.\n6. Meal Prep: Portrait for the active chopping task; Landscape for the total session time.\n7. Grilling: Portrait for the flip interval; Landscape for the total cook time.\n8. Pizza Making: Portrait for the stone pre-heat; Landscape for the 90-second bake.\n9. Wine Chilling: Portrait for the freezer \"quick chill\"; Landscape for the decanting time.\n10. Dishwasher: Portrait for the wash cycle; Landscape for the \"clean\" air-dry duration.\nFitness & Health\n1. HIIT Training: Portrait for the work interval; Landscape for the rest period.\n2. Circuit Training: Portrait for the station time; Landscape for the total gym session.\n3. Yoga: Portrait for the pose hold; Landscape for the total meditation block.\n4. Physical Therapy: Portrait for the active stretch; Landscape for the ice-pack application.\n5. Running: Portrait for the sprint interval; Landscape for the recovery walk.\n6. Intermittent Fasting: Portrait for the eating window; Landscape for the fasting countdown.\n7. Skin Care: Portrait for the chemical exfoliant; Landscape for the hydrating mask.\n8. Medication: Portrait for the time between doses; Landscape for the \"wait before eating\" timer.\n9. Ice Baths: Portrait for the immersion time; Landscape for the gradual warm-up period.\n10. Eye Health: Portrait for the screen-time limit; Landscape for the 20-second eye rest.\nProductivity & Work\n1. Pomodoro: Portrait for the 25-minute focus; Landscape for the 5-minute break.\n2. Freelance Billing: Portrait for Project A; Landscape for Project B.\n3. Meetings: Portrait for the current speaker; Landscape for the total meeting agenda.\n4. Coding: Portrait for the build/compile time; Landscape for the focus sprint.\n5. Public Speaking: Portrait for the section time; Landscape for the total stage time.\n6. Email Management: Portrait for the \"Inbox Zero\" sprint; Landscape for the break until next check.\n7. Brainstorming: Portrait for the idea generation phase; Landscape for the selection/review phase.\n8. Interviewing: Portrait for the candidate's answer; Landscape for the total interview slot.\n9. Studying: Portrait for the reading block; Landscape for the flashcard review.\n10. Deep Work: Portrait for the task at hand; Landscape for the \"Unavailable\" status duration.\nHome & Hobby\n1. Laundry: Portrait for the washer; Landscape for the dryer.\n2. Parenting: Portrait for \"Screen Time\"; Landscape for \"Time Out.\"\n3. Gardening: Portrait for the sprinkler duration; Landscape for the seed-soak time.\n4. Gaming: Portrait for the respawn timer; Landscape for the ultimate ability cooldown.\n5. Model Making: Portrait for the glue drying; Landscape for the paint curing.\n6. Pet Training: Portrait for the \"Stay\" command; Landscape for the total training session.\n7. Photography: Portrait for the shutter exposure; Landscape for the film development.\n8. Reading: Portrait for the daily reading goal; Landscape for the \"Focus\" session.\n9. Cleaning: Portrait for the specific room \"Power Hour\"; Landscape for the whole-house goal.\n10. Instrument Practice: Portrait for the scale warm-up; Landscape for the song rehearsal.\nTechnical & Niche\n1. Laboratory: Portrait for the centrifuge run; Landscape for the chemical reaction.\n2. 3D Printing: Portrait for the current layer time; Landscape for the total print job.\n3. Auto Repair: Portrait for the penetrant oil soak; Landscape for the battery charge time.\n4. Pottery: Portrait for the wheel time; Landscape for the kiln drying phase.\n5. Board Games: Portrait for Player 1's turn; Landscape for the global game clock.\n6. Livestreaming: Portrait for the \"Starting Soon\" countdown; Landscape for the live duration.\n7. Beauty: Portrait for the hair dye processing; Landscape for the nail polish drying.\n8. Event Planning: Portrait for the current vendor setup; Landscape for the \"Doors Open\" countdown.\n9. Travel: Portrait for the walking time to gate; Landscape for the flight departure countdown.\n10. Meditation: Portrait for the breathing cycles; Landscape for the total silence duration.",
                  "score": 1,
                  "created_utc": "2026-02-01 02:16:56",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o270ljt",
          "author": "Vandercoon",
          "text": "Cool. Why?",
          "score": 1,
          "created_utc": "2026-01-28 11:08:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o27deic",
              "author": "vigneshvp",
              "text": "Thanks. Fun!",
              "score": 1,
              "created_utc": "2026-01-28 12:42:34",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2738ax",
          "author": "LucVolders",
          "text": "You should add a text field for each timer so you can see at what timmer you are looking at.  \nCan't test: I am on android",
          "score": 1,
          "created_utc": "2026-01-28 11:29:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o27dhp2",
              "author": "vigneshvp",
              "text": "Planning for that in the next version.",
              "score": 1,
              "created_utc": "2026-01-28 12:43:08",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o275tpv",
          "author": "el_yanuki",
          "text": "what happens if the phone is flat on a desk?",
          "score": 1,
          "created_utc": "2026-01-28 11:49:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o27dtud",
              "author": "vigneshvp",
              "text": "Whichever was the last timer you switched, it will be there till the next tilt.",
              "score": 1,
              "created_utc": "2026-01-28 12:45:17",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o276dps",
          "author": "mumBa_",
          "text": "I mean funny idea, just completely impractical. You're charging 15$ a year for what? Why would anyone pay for a timer...",
          "score": 1,
          "created_utc": "2026-01-28 11:54:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o27e642",
              "author": "vigneshvp",
              "text": "Thanks for the feedback. I'm reducing the price. \n\n\"Why would anyone pay for a timer?\" There are lots of apps in the App Store.",
              "score": 1,
              "created_utc": "2026-01-28 12:47:29",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o27f2sb",
                  "author": "mumBa_",
                  "text": "The base iPhone already has a timer. You added incorporated the gyroscope. I myself would never download an app that is just a timer that rotates inconveniently. It looks cool, but I think that is where your use case ends. \n\nJust because there's a lot of apps that replicate this behaviour, does not mean that someone would pay for it. Just my two cents.",
                  "score": 1,
                  "created_utc": "2026-01-28 12:53:09",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o27ai7z",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-28 12:23:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o27e9p2",
              "author": "vigneshvp",
              "text": "Some people will find it usable.",
              "score": 1,
              "created_utc": "2026-01-28 12:48:06",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o27bk97",
          "author": "Revolutionary_Gap183",
          "text": "cool",
          "score": 1,
          "created_utc": "2026-01-28 12:30:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2essds",
              "author": "vigneshvp",
              "text": "Thanks",
              "score": 1,
              "created_utc": "2026-01-29 13:55:17",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o27e7yy",
          "author": "Mountagad1",
          "text": "Is it worth it",
          "score": 1,
          "created_utc": "2026-01-28 12:47:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2esrp9",
              "author": "vigneshvp",
              "text": "Maybe",
              "score": 2,
              "created_utc": "2026-01-29 13:55:11",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o27iec8",
          "author": "darthnilus",
          "text": "This solves a problem I have never had, nor did I need it solved.",
          "score": 1,
          "created_utc": "2026-01-28 13:13:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2esqg1",
              "author": "vigneshvp",
              "text": "Appreciate your feedback.",
              "score": 1,
              "created_utc": "2026-01-29 13:55:00",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o27l469",
          "author": "SWISS_KISS",
          "text": "I love these kind of micro interactions. Good work!",
          "score": 1,
          "created_utc": "2026-01-28 13:28:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2espdl",
              "author": "vigneshvp",
              "text": "Thanks :)",
              "score": 1,
              "created_utc": "2026-01-29 13:54:51",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o27up3s",
          "author": "barcode972",
          "text": "If it didn’t start over it’d make more sense",
          "score": 1,
          "created_utc": "2026-01-28 14:18:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2esodg",
              "author": "vigneshvp",
              "text": ":)",
              "score": 1,
              "created_utc": "2026-01-29 13:54:42",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o27xfwt",
          "author": "alzho12",
          "text": "This is cool. I don’t use timers much but I could see people really digging this app.",
          "score": 1,
          "created_utc": "2026-01-28 14:32:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2esnif",
              "author": "vigneshvp",
              "text": "Thanks :)",
              "score": 1,
              "created_utc": "2026-01-29 13:54:35",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o281dkt",
          "author": "UniekLee",
          "text": "Just came to say that the UI is beautiful 🤩",
          "score": 1,
          "created_utc": "2026-01-28 14:51:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2esmj3",
              "author": "vigneshvp",
              "text": "Thanks :)",
              "score": 1,
              "created_utc": "2026-01-29 13:54:26",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o282vm8",
          "author": "khureNai05",
          "text": "This is a smart use of tilt feels intuitive and cuts down on screen interaction without addint UI clutter. Only concern is accidental switching while moving, but that seems solvable with a lock or sensitivity threshold.",
          "score": 1,
          "created_utc": "2026-01-28 14:59:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2esl63",
              "author": "vigneshvp",
              "text": "I'm planning to add a lock mechanism.",
              "score": 1,
              "created_utc": "2026-01-29 13:54:15",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o28tkso",
          "author": "bouncer-1",
          "text": "*a unique, don’t ask why 😅",
          "score": 1,
          "created_utc": "2026-01-28 16:57:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2esipl",
              "author": "vigneshvp",
              "text": ":)",
              "score": 1,
              "created_utc": "2026-01-29 13:53:54",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2965fg",
          "author": "biere",
          "text": "Totally useless. Remove it at once.",
          "score": 1,
          "created_utc": "2026-01-28 17:51:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2esi09",
              "author": "vigneshvp",
              "text": ":(",
              "score": 1,
              "created_utc": "2026-01-29 13:53:47",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2rvkum",
                  "author": "biere",
                  "text": "A time is supposed to be easy to set and then just works. Don't have problems with any current time apps I've used. I would never have a use for this, it's just confusing.",
                  "score": 1,
                  "created_utc": "2026-01-31 11:34:07",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o29ax4p",
          "author": "phunk8",
          "text": "nice idea out of the box. not sure the problem it’s trying to solve? no offense",
          "score": 1,
          "created_utc": "2026-01-28 18:12:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2esgza",
              "author": "vigneshvp",
              "text": "Appreciate your feedback. Thanks.",
              "score": 1,
              "created_utc": "2026-01-29 13:53:38",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o29lk7o",
          "author": "hasibhaque",
          "text": "Cool idea.",
          "score": 1,
          "created_utc": "2026-01-28 18:57:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2esg7x",
              "author": "vigneshvp",
              "text": "Thanks :)",
              "score": 1,
              "created_utc": "2026-01-29 13:53:31",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o29mzb3",
          "author": "One_Tie900",
          "text": "Its stupid but fun",
          "score": 1,
          "created_utc": "2026-01-28 19:03:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2esfmo",
              "author": "vigneshvp",
              "text": "Thanks :)",
              "score": 1,
              "created_utc": "2026-01-29 13:53:26",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o29uwc4",
          "author": "You_are_the_Castle",
          "text": "That looks really cool!",
          "score": 1,
          "created_utc": "2026-01-28 19:38:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2esetv",
              "author": "vigneshvp",
              "text": "Thanks :)",
              "score": 1,
              "created_utc": "2026-01-29 13:53:20",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2a2d4q",
          "author": "redditindisguise",
          "text": "Just remember OP, these haters and broke commenters aren’t your buyers. Cool idea. Timers, stopwatches, and alarms are annoying on iOS. Any creativity in that space is welcomed IMO. I could see this being helpful for the gym, especially if there’s a sound component to remind you it’s time for your next set.",
          "score": 1,
          "created_utc": "2026-01-28 20:12:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2eschx",
              "author": "vigneshvp",
              "text": "Appreciate your feedback. I'm planning to post on some workout commuties. Thanks.",
              "score": 1,
              "created_utc": "2026-01-29 13:52:59",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2a3pe9",
          "author": "oVerde",
          "text": "This is a recreation of that fake ad of a cube clock, nice way to revenge that shit",
          "score": 1,
          "created_utc": "2026-01-28 20:18:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2es85c",
              "author": "vigneshvp",
              "text": ":)",
              "score": 1,
              "created_utc": "2026-01-29 13:52:21",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2b3tko",
          "author": "opafmoremedic",
          "text": "If you add an option to \"not reset on flip\" or something similar, this could be used for all sorts of games where each player has to keep a running timer but alternate turns. Things like chess and other similar things. However most people would prefer the phone to lay flat and they simply press a button.\n\nNonetheless, nice job! Neat side project.",
          "score": 1,
          "created_utc": "2026-01-28 23:00:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2es75x",
              "author": "vigneshvp",
              "text": "I'm palling to add a Lock mechanism.",
              "score": 1,
              "created_utc": "2026-01-29 13:52:13",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2b7f1n",
          "author": "potentialfriens",
          "text": "I love this I have a real one (like a cube) it saved my life my gf bought me it for Christmas, that’s so cool",
          "score": 1,
          "created_utc": "2026-01-28 23:18:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2es5co",
              "author": "vigneshvp",
              "text": "That cube was one of my inspiration.",
              "score": 1,
              "created_utc": "2026-01-29 13:51:58",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2b8eh1",
          "author": "poladermaster",
          "text": "I’ll be fidgeting with my phone all day. Definitely a cool thing to build.",
          "score": 1,
          "created_utc": "2026-01-28 23:23:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2es3im",
              "author": "vigneshvp",
              "text": "Thank you :)",
              "score": 1,
              "created_utc": "2026-01-29 13:51:41",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2bk38b",
          "author": "BackgroundGrand3525",
          "text": "I think it’s cool but I wouldn’t use it since you can set multiple iphone timers at once and you can name them (if you gave an option to name your timer, you wouldn’t lose track of timers) but I wouldn’t use it. Keep up the good work though.",
          "score": 1,
          "created_utc": "2026-01-29 00:24:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2es27e",
              "author": "vigneshvp",
              "text": "Appreciate your feedback. Thanks.",
              "score": 1,
              "created_utc": "2026-01-29 13:51:30",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2hp8qw",
          "author": "oximbecile",
          "text": "Nice idea, I like the effect, though not sure where the uses lies,  but again there's lots of people out there that just wants something funky to play with. Like a fidget app.   \nThere's a physical timer you can buy in IKEA which when you rotate it on each of it's face, it would show a different timer/temperature function.",
          "score": 1,
          "created_utc": "2026-01-29 22:02:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2jdw0f",
              "author": "vigneshvp",
              "text": "That physical timer is one of the inspiration.",
              "score": 1,
              "created_utc": "2026-01-30 03:29:28",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2k2b6u",
          "author": "Odd-Teacher3361",
          "text": "I personally like this. I bought a physical productivity timer which is a similar concept but it’s a cube which I really like. But it eats batteries like there’s no tomorrow. I’m not sure what your target use case is but I could see myself using this as a productivity timer while working at my computer. Although I’d prefer it if functioned like: having the phone as flat is its default state where it runs out the timer, when the user tilts the phone one of the 90 degrees it sets the timer to that time, the user then lays the phone flat again and lets the timer run out.",
          "score": 1,
          "created_utc": "2026-01-30 06:11:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2mcjtc",
          "author": "Blakequake717",
          "text": "Why do I always see apps here that are only on iOS. Isn't it supposed to be easier and cheaper to put them on Android? Why not do both",
          "score": 1,
          "created_utc": "2026-01-30 15:44:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2savbh",
          "author": "srch4aheartofgold",
          "text": "This is a solid approach. One thing that helped me in past projects was talking to users early, even before everything felt ‘ready’. It saved a lot of time later.",
          "score": 1,
          "created_utc": "2026-01-31 13:29:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2swg2h",
          "author": "Popular-Button7387",
          "text": "are you going to make an Android version by any chance?",
          "score": 1,
          "created_utc": "2026-01-31 15:29:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2vtaky",
          "author": "theukdave-",
          "text": "I do love the UI, the bounce as it rotates and jiggles into place.  But my concerns would be:  \n1. How do I know what oritentation is the one I need?  \n2. When my phone falls over, my timer changes and resets\n\nIt's novel, and I want to like it, but I worry that it has practical problems :( ",
          "score": 1,
          "created_utc": "2026-02-01 00:08:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2x9ods",
          "author": "Upbeat_Panic_2646",
          "text": "There is more space for the error to happen accidentally. But it looks cool",
          "score": 1,
          "created_utc": "2026-02-01 05:36:13",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qt51ww",
      "title": "PSA: If you post your side project here, prepare for war",
      "subreddit": "SideProject",
      "url": "https://www.reddit.com/r/SideProject/comments/1qt51ww/psa_if_you_post_your_side_project_here_prepare/",
      "author": "TheHol1day",
      "created_utc": "2026-02-01 17:42:35",
      "score": 374,
      "num_comments": 117,
      "upvote_ratio": 0.89,
      "text": "posted my AI side project here about a week ago. got some great feedback.\n\nalso got:\n\n* 10+ new accounts per minute, all bots\n* all of them spamming the AI chat with the same prompts trying to extract system prompts and API keys\n* hundreds of requests to /.env, /config, /.git\n* puppeteer scripts hammering the site\n* python bots doing god knows what\n\nwe hadn't hardened security yet because it's a side project with like 12 users. that changed real fast.\n\nsome things that helped:\n\n* rate limiting (should've had this day 1)\n* blocking obvious bot patterns\n* making sure no secrets were exposed in obvious places\n\nanyway, consider this your warning. the moment you post here, assume someone is already trying to break in.\n\nweirdly a badge of honor though? like thanks for thinking my project was worth hacking i guess.\n\nif anyone's curious about what i'm building, happy to drop the link in comments. just didn't want this to be a promo post.\n\nstay safe out there.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/SideProject/comments/1qt51ww/psa_if_you_post_your_side_project_here_prepare/",
      "domain": "self.SideProject",
      "is_self": true,
      "comments": [
        {
          "id": "o30dtbs",
          "author": "velvet-thunder-2019",
          "text": "\\> making sure no secrets were exposed in obvious places\n\n\n\nThis should be: making sure no secrets were exposed In \\*ANY\\* place. \n\nSecrets should well be secret!",
          "score": 216,
          "created_utc": "2026-02-01 18:08:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o30e2y7",
              "author": "HypnoticLion",
              "text": "![gif](giphy|S5n7Wkhhw5A2IrfKER)",
              "score": 108,
              "created_utc": "2026-02-01 18:09:58",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o30wdeg",
              "author": "TheHol1day",
              "text": "Didnt have them exposed but didn't stop them from tryin 😅",
              "score": 17,
              "created_utc": "2026-02-01 19:33:01",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o34kqxn",
                  "author": "ilogik",
                  "text": "This happens all the time. Whenever you have a public http server you will get spammed all the time to find secrets",
                  "score": 4,
                  "created_utc": "2026-02-02 09:06:45",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o35otdt",
                  "author": "True-Strike7696",
                  "text": "Time to set some automod features",
                  "score": 1,
                  "created_utc": "2026-02-02 14:12:45",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o30g8as",
          "author": "InfamousJack9",
          "text": "Honestly, I might have to share my project here to get a free security audit haha",
          "score": 67,
          "created_utc": "2026-02-01 18:19:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o31zx8l",
              "author": "ZeroTwoMod",
              "text": "Hahhaha this was my attitude like 2 weeks ago I got hacked by some dudes in Singapore and Italy and stayed up for \\~3 days straight locking my site down as much as possible. Figured out I had to use CSRF token tied to IP address but took me forever to figure it out and in the meantime I had a couple pushes where users got locked out of the api. Was like the most brutal experience i've had since starting a business",
              "score": 17,
              "created_utc": "2026-02-01 22:46:45",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o322xxn",
                  "author": "InfamousJack9",
                  "text": "Dang that sounds like an awful experience. There should be a subreddit similar to this one where we can ask other SWEs/cybersecurity folks “safety” attempt to hack our apps to catch any vulnerabilities. Kinda like a bounty. \n\nI’m scared to release my app because it has to do with financial data, although the only integration point is Plaid and I only utilize read access, dealing with financial data is a bit daunting.",
                  "score": 7,
                  "created_utc": "2026-02-01 23:02:45",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3087x2",
          "author": "trusic_",
          "text": "Brb, gonna launch a honeypot",
          "score": 101,
          "created_utc": "2026-02-01 17:43:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o30r0j3",
              "author": "sillypoint_",
              "text": " Free penetration testing!",
              "score": 23,
              "created_utc": "2026-02-01 19:08:00",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o309u7z",
              "author": "TheHol1day",
              "text": "my work here is done",
              "score": 33,
              "created_utc": "2026-02-01 17:51:05",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o3172uc",
              "author": "rivkinnator",
              "text": "Haha was just about to do the same then collect all the IPs and use them as a blacklist.",
              "score": 7,
              "created_utc": "2026-02-01 20:24:29",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o30bkkj",
              "author": "PolliticalScience",
              "text": "A must have to get rid of 95% of them!",
              "score": 5,
              "created_utc": "2026-02-01 17:58:53",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o318wb3",
              "author": "ashvy",
              "text": "Lawful Good Epstein",
              "score": 3,
              "created_utc": "2026-02-01 20:33:26",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o31b840",
          "author": "fullstack_ing",
          "text": "/wp-admin has joined the chat.",
          "score": 16,
          "created_utc": "2026-02-01 20:44:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o31re97",
              "author": "Ok-Fruit823",
              "text": "Love it to see it in the logs 😂",
              "score": 6,
              "created_utc": "2026-02-01 22:03:41",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3215bv",
                  "author": "fullstack_ing",
                  "text": "I fail2ban anything .php at this point. Instaban",
                  "score": 5,
                  "created_utc": "2026-02-01 22:53:11",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o30k338",
          "author": "hygroscopy",
          "text": "most of this is just the background radiation of the internet, everything exposed publicly gets hammered constantly. It really has nothing to do with this sub.",
          "score": 14,
          "created_utc": "2026-02-01 18:36:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o30fbo6",
          "author": "CrimsonVixenPixie",
          "text": "Why does everyone write so weird now?",
          "score": 33,
          "created_utc": "2026-02-01 18:15:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o30g8ry",
              "author": "avocadorancher",
              "text": "Most content here is written by AI. Some is written by people who use AI so much that they now write like it too. Honestly best to ignore it all.",
              "score": 48,
              "created_utc": "2026-02-01 18:19:42",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o30hg49",
                  "author": "CrimsonVixenPixie",
                  "text": "I guess it's just really jarring to me because it's all lowercase, so I assumed differently. Just something about the way I keep seeing this thing I can't explain it but people write like \"blah blah blah, blah, blah blah, blah blah blah.\" I read it in my head in this really weird cadence like all rushed and smashed together just because of the way it's written it's actually really starting to get on my nerves now.",
                  "score": 10,
                  "created_utc": "2026-02-01 18:25:04",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o312dew",
              "author": "Oli_Picard",
              "text": "Because slop people slop so hard they can’t even be arsed to write anything original on Reddit.",
              "score": 7,
              "created_utc": "2026-02-01 20:01:33",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o30oq0p",
              "author": "TheRealArthur",
              "text": "feel like anyone that writes a semi well formatted post gets accused of using AI lol. Its annoying to think AI is used for everything but at the same time its the direction we're going in.  I dont think its going away",
              "score": 8,
              "created_utc": "2026-02-01 18:57:31",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o33cf9g",
              "author": "TheBear8878",
              "text": "Because they aren't actually writing, it's AI slop",
              "score": 2,
              "created_utc": "2026-02-02 03:18:39",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o36paro",
              "author": "ExAstrisDivitae",
              "text": "Probably for the same reason that people use a word in the form of an adjective when it should be an adverb… most people have never been very good at writing, and now those people use ai to write things",
              "score": 1,
              "created_utc": "2026-02-02 17:09:25",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o30wim1",
              "author": "TheHol1day",
              "text": "AI and I writing together is not a good mix apparently",
              "score": -2,
              "created_utc": "2026-02-01 19:33:42",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o30yqpk",
                  "author": "vep",
                  "text": "No, it’s not.  Just write to us like we are people",
                  "score": 11,
                  "created_utc": "2026-02-01 19:44:18",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o30twvf",
          "author": "Buffett_Goes_OTM",
          "text": "I had someone conduct a legit DDOS attack against my site in an area I didn’t have rate limiting enabled - now everything is locked down. I ended up reporting to the FBI because of its scale and how highly coordinated it seemed. Now I’m in active contact with the FBI, they followed up about 2 weeks after the report submission and every couple weeks.",
          "score": 6,
          "created_utc": "2026-02-01 19:21:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o30azcp",
          "author": "Bjeaurn",
          "text": "Good lesson learned quick. I wish more people would be aware of these things.",
          "score": 10,
          "created_utc": "2026-02-01 17:56:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o30vlvx",
          "author": "jakeStacktrace",
          "text": "Crazy so you have to make your site secure because it is on the public internet. What a shocking revelation.",
          "score": 14,
          "created_utc": "2026-02-01 19:29:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o31bjtc",
          "author": "fullstack_ing",
          "text": "https://preview.redd.it/c7t371go3ygg1.jpeg?width=1000&format=pjpg&auto=webp&s=e16ad994092326f7baea7cadf9851d287ff4353b",
          "score": 4,
          "created_utc": "2026-02-01 20:46:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o31uk2l",
          "author": "thedolceway",
          "text": "**Draft:**\n\nHackers doing more QA than your actual users. Classic side project experience.​​​​​​​​​​​​​​​​",
          "score": 2,
          "created_utc": "2026-02-01 22:19:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o326v76",
          "author": "bodiam",
          "text": "I'm only allowing signups with Google and Github, that seems to significantly reduce spam accounts ",
          "score": 2,
          "created_utc": "2026-02-01 23:24:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o34trfw",
              "author": "TheHol1day",
              "text": "Good call. In hindsight, email login/signup was a pathway for bots. Also I allow non logged in users to try out the website which even added more incentive for bots.",
              "score": 1,
              "created_utc": "2026-02-02 10:33:38",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3299fx",
          "author": "TheFern3",
          "text": "Don’t put anything online is not secured lol is that simple is common sense not war bro lmao",
          "score": 2,
          "created_utc": "2026-02-01 23:37:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o34ttkb",
              "author": "TheHol1day",
              "text": "![gif](giphy|C3OMX8yQB60IU)",
              "score": 2,
              "created_utc": "2026-02-02 10:34:12",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o34e82p",
          "author": "rjyo",
          "text": "and blocking /.env requests should be on everyone's day 0 checklist. The bots don't sleep!",
          "score": 2,
          "created_utc": "2026-02-02 08:04:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o359g84",
              "author": "HazKaz",
              "text": "i don't understand how could an ai chat bot have access to your .env ?",
              "score": 1,
              "created_utc": "2026-02-02 12:41:04",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3c318r",
                  "author": "explodedgiraffe",
                  "text": "Want to know that too",
                  "score": 1,
                  "created_utc": "2026-02-03 13:07:29",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o30ig40",
          "author": "ashafaei",
          "text": "Appreciate the heads up. Bookmarking this for when I launch.",
          "score": 2,
          "created_utc": "2026-02-01 18:29:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o30ktt7",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-01 18:40:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o30mrf3",
              "author": "rsmike",
              "text": "> the /.git one is especially sneaky because a lot of people forget to block that in nginx. \n\nUnder no circumstances should it be anywhere on your server, let alone in the document root, in the first place.",
              "score": 1,
              "created_utc": "2026-02-01 18:48:43",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3215rq",
          "author": "Opposite-Alfalfa-700",
          "text": "Yeah, i understand, but at some point you need to get traffic on your website, but i alwas looking for interesting projects here!",
          "score": 1,
          "created_utc": "2026-02-01 22:53:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o33ch7y",
          "author": "Altruistic_Minimum94",
          "text": "This happened to me as well when I advertised mines",
          "score": 1,
          "created_utc": "2026-02-02 03:18:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o33vnlt",
          "author": "gabos91",
          "text": "Oof that's rough... it's why I haven't publicly posted my little chat bot in the two years that I've had it... I have put some security measures on there, but it's been low priority. I do send it to some friends and family who try to break it tho and thats always fun. \n\nIt was flattering when some of told me they weren't able to prompt inject or get the api key, and they pointed out things I needed to add to the ol' TODO** list  (those things are still on that list lol)",
          "score": 1,
          "created_utc": "2026-02-02 05:24:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o34exjz",
          "author": "omarous",
          "text": "blocking obvious bot patterns -> now you are potentially blocking lots of legitimate users. many of these ips are shared/hijacked. You can't win this. Just get cheap/free bandwidth and secure your site. Cloudflare firewall is the worst.",
          "score": 1,
          "created_utc": "2026-02-02 08:10:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o34i9kq",
          "author": "RareDestroyer8",
          "text": "That’s the primary reason I stay away from LLMs unless they’re hosted manually by me. If someone sees an opportunity to easily burn through your entire API budget for fun, they’ll do it. It sort of becomes a game and puzzle for the user to see how quickly they can break an app of that sort.",
          "score": 1,
          "created_utc": "2026-02-02 08:42:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o34sgxn",
          "author": "Subject-Potential968",
          "text": "Damn free testing hack",
          "score": 1,
          "created_utc": "2026-02-02 10:21:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o366q5u",
          "author": "worldflier1980",
          "text": "Thank you for pointing this out. This potentially helped me, as I just released my own fashion and lifestyle analysis app lifegeek.ai, for which I put a separate post. Before posting, I saw your advice and fixed a few things. It turned out that API keys were hardcoded, instead of being saved in the GCP secret manager, which is much safer. Good luck with your project.",
          "score": 1,
          "created_utc": "2026-02-02 15:43:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o38k93f",
          "author": "Kindly-Concentrate93",
          "text": "Share it would\nLike to see it. Or dm me either or thanks in advance.",
          "score": 1,
          "created_utc": "2026-02-02 22:21:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3b3z41",
          "author": "Turbulent_Eagle2070",
          "text": "That’s utterly disgusting people do that. \n\nIf they don’t repent of being miserable thieves, they are in very serious danger of ending up in a very hot place for eternity after they die. ",
          "score": 1,
          "created_utc": "2026-02-03 08:08:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3chyae",
          "author": "codycodescode",
          "text": "The bots (and everyone else) ignored my project when I posted 🥲",
          "score": 1,
          "created_utc": "2026-02-03 14:30:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o32m6n9",
          "author": "Significant-Radish30",
          "text": "You need to understand one thing. The people who are here ARE YOUR COMPETITORS. I'm not going to generalize, but almost 100% of people want to see your project, get the data from it, and out of jealousy or other ridiculous reasons, copy you, or create something based on your idea if they think it's promising, and yes... almost 100% of the people here (and if anyone reading this is bothered by this truth, I hope they go to hell).",
          "score": 1,
          "created_utc": "2026-02-02 00:48:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o32e1wp",
          "author": "Used-Call-3503",
          "text": "this is hilarous",
          "score": 1,
          "created_utc": "2026-02-02 00:04:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o32fpzc",
          "author": "ShorelineStatic",
          "text": "What is ⁠rate limiting?",
          "score": 1,
          "created_utc": "2026-02-02 00:13:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o34huqk",
              "author": "RareDestroyer8",
              "text": "Limiting the rate at which a user can perform a certain task.\n\nIf in a note taking application I rate limit note creation to 10 notes per minute, that means a user can only create a maximum of 10 notes in a minute\n\nIn OP’s case it would prob be an account can only use x amount of tokens an hour, or only x amount of accounts can be created at a certain IP address, or something along those lines.",
              "score": 2,
              "created_utc": "2026-02-02 08:38:53",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o30xeq0",
          "author": "qqbbomg1",
          "text": "What telemetry logging tool do you guys use? I’m having hard time tracing these calls",
          "score": 0,
          "created_utc": "2026-02-01 19:37:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o31blpm",
              "author": "fullstack_ing",
              "text": "log4j\n\nEdit: RRRRRRRREeEEEEEEeeeeee, that down vote lol. You know someone got hurt",
              "score": 1,
              "created_utc": "2026-02-01 20:46:47",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o30cchz",
          "author": "stuaird1977",
          "text": "Would anyone like to look at mine, it's still in test mode and I've yet to build 3 more sections. It's aimed at helping small business and contractors and uses AI to build risk assessments. I'll be adding hazard tours, tool box talk generator and investigations next. Safety is my field and I see gaps all over the place. \n\n\nDemo mode will generate two lines of an assessment for free \n\n\n\nhttps://produce-rams.com/",
          "score": -1,
          "created_utc": "2026-02-01 18:02:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o30oq6i",
              "author": "746865626c617a",
              "text": "404's",
              "score": 0,
              "created_utc": "2026-02-01 18:57:33",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o31cdju",
                  "author": "stuaird1977",
                  "text": "My bad, link was wrong, I've edited it ",
                  "score": 0,
                  "created_utc": "2026-02-01 20:50:37",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o30xrk8",
          "author": "Ambitious-Style-1087",
          "text": "good to know lol smart move on the rate limiting. any other safety measures you used?",
          "score": 0,
          "created_utc": "2026-02-01 19:39:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3138w0",
          "author": "anywhereblue",
          "text": "Great warning.   Thank you.",
          "score": 0,
          "created_utc": "2026-02-01 20:05:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o31k9jm",
          "author": "matarrwolfenstein",
          "text": "I had the same experience, someone was trying to extract source code information from my AI support tool, however I'm experienced enough to have prepared for this",
          "score": 0,
          "created_utc": "2026-02-01 21:29:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o32emou",
          "author": "someGuyyya",
          "text": "Thank you for sharing this!",
          "score": 0,
          "created_utc": "2026-02-02 00:07:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o32rbmp",
          "author": "kubetson",
          "text": "before i read that i felt quite save to publish my project\n\nit's coded by AI but i tech personal that make choices to promote good patterns and safety.  \n  \nwhat i can recommend to any to use tech stack/frameworks that take care about security by default and make bad things harder to introduce.  \n  \nmy framework of choice in rails. maybe models are not as proficient as for ts/js shit. but the outcome should be safer\n\nbut now time for some audits :)",
          "score": 0,
          "created_utc": "2026-02-02 01:17:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o30b1dk",
          "author": "Vivid-Atmosphere5328",
          "text": "these attackers don't have anything else to do?\nI  had my telegram string session by mistake pushed to githib once because i was using it for creating a bot in tg that forward videos and that was mtproto authenticated because i wanted to send files that were in huge size.then one random mf logged in using that session i wasn't even able to log him out. that b*txh was using VPN too 1 second he was in France next second he was in Australia. I was forced to delete my Telegram Account. I made such a rookie mistake not adding .gitgnore file before pushing to github.🤧",
          "score": -1,
          "created_utc": "2026-02-01 17:56:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o30ggv8",
              "author": "InfamousJack9",
              "text": "Are commit histories public even if the repo is private?",
              "score": 2,
              "created_utc": "2026-02-01 18:20:42",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o30k7k5",
                  "author": "Vivid-Atmosphere5328",
                  "text": "the repo was public.🥲",
                  "score": 0,
                  "created_utc": "2026-02-01 18:37:17",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o30md51",
          "author": "Norris2906",
          "text": "Why do they do this? What are aiming to get out of it? What’s the end goal of even botting websites?",
          "score": -1,
          "created_utc": "2026-02-01 18:46:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o30z0rd",
              "author": "vep",
              "text": "I assume it’s automated and they just want to grab anything and everything to sort through later",
              "score": 0,
              "created_utc": "2026-02-01 19:45:38",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o31nt1s",
          "author": "rsagie",
          "text": "What do you think, Is that phenomenal specific to this sub reddit or to posting In reddit in general?",
          "score": -1,
          "created_utc": "2026-02-01 21:46:15",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qpqu1w",
      "title": "My family always sent me tiktok links, so I developed a site to watch them without an account.",
      "subreddit": "SideProject",
      "url": "https://v.redd.it/ba9ud48j66gg1",
      "author": "lIlIlIKXKXlIlIl",
      "created_utc": "2026-01-28 22:53:25",
      "score": 289,
      "num_comments": 110,
      "upvote_ratio": 0.86,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/SideProject/comments/1qpqu1w/my_family_always_sent_me_tiktok_links_so_i/",
      "domain": "v.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "o2dhuk8",
          "author": "geek_at",
          "text": "would be more useful as a whatsapp bot that you can forward a video link which will download and then post into chat",
          "score": 71,
          "created_utc": "2026-01-29 07:53:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2edysy",
              "author": "Inujel",
              "text": "That would be so great...",
              "score": 6,
              "created_utc": "2026-01-29 12:28:27",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o2ez98j",
              "author": "BeardedWiseMagician",
              "text": "This.",
              "score": 1,
              "created_utc": "2026-01-29 14:28:59",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o2i863c",
              "author": "Intelligent-Syrup-43",
              "text": "Those.",
              "score": 1,
              "created_utc": "2026-01-29 23:39:28",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o365cza",
              "author": "oscaritoburito",
              "text": "this, but also for telegram",
              "score": 1,
              "created_utc": "2026-02-02 15:37:05",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2c7wxc",
          "author": "rickyspears",
          "text": "https://preview.redd.it/5be5hzk897gg1.png?width=346&format=png&auto=webp&s=b70804a2f7f603cee464d73a7f0ff401e8e11b64\n\n**Wait! What kind of witchcraft is this?**  \nWe don't really have to select ***every*** cell that has part of a traffic light in it?  \nI thought we had to also select the top three cells in the second column because they have parts of the traffic lights in them? And then I would also select the bottom cell in the first column because it has a small piece of a traffic light in it. 🤯",
          "score": 91,
          "created_utc": "2026-01-29 02:33:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2dk8gm",
              "author": "someGuyyya",
              "text": "I thought the same exact thing!\n\nI was thinking \"That's not gonna pas... Wait it passed?!?!\"",
              "score": 15,
              "created_utc": "2026-01-29 08:15:15",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2emr4x",
                  "author": "Girafferage",
                  "text": "Pretty sure some of them were just used for training computer vision models by forcing people to do the validation for Google.",
                  "score": 5,
                  "created_utc": "2026-01-29 13:22:49",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o2cmbs3",
              "author": "recursive_knight",
              "text": "It's German Witchcraft, these people do really scary things, and they're apparently everywhere......",
              "score": 7,
              "created_utc": "2026-01-29 03:56:32",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o2di55k",
              "author": "drdrero",
              "text": "I never understood why would you select the square that has 2 pixels of fire hydrant. The raster should include clearly identifying pieces of the thing imo",
              "score": 6,
              "created_utc": "2026-01-29 07:56:26",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o2e9hud",
              "author": "wick3dr0se",
              "text": "That's the pole",
              "score": 2,
              "created_utc": "2026-01-29 11:57:09",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2fetel",
                  "author": "ContextualData",
                  "text": "Do you not see pieces of the traffic light in those squares though?",
                  "score": 1,
                  "created_utc": "2026-01-29 15:42:31",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o2g3kux",
              "author": "RareDestroyer8",
              "text": "Actually these tests don’t only test which squares you select, but they also watch how you select them. Humans select the tiles in a certain order and often have a variable delay between selection. You don’t have to select every little tile, just got to select a few of the obvious ones, that’s usually enough to prove you’re a human.",
              "score": 2,
              "created_utc": "2026-01-29 17:33:08",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o2e9i6w",
              "author": "TrieKach",
              "text": "there’s no standard annotation guide provided. do as you please.",
              "score": 1,
              "created_utc": "2026-01-29 11:57:13",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o2eq6w2",
              "author": "khanspam",
              "text": "This shows how annoying this captcha is and I was wondering if OP could replace it with a simpler checkmark?",
              "score": 1,
              "created_utc": "2026-01-29 13:41:35",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o2f22d8",
              "author": "-Nano",
              "text": "Most time are just six to select, the other his is just ignore",
              "score": 1,
              "created_utc": "2026-01-29 14:43:06",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2d3shz",
          "author": "Educational_Detail28",
          "text": "In which world this is something that you can use daily ? \nI mean, you need to copy, open a website paste the link, validate a captcha then you can watch the video…\nIt’s way too time consuming.",
          "score": 105,
          "created_utc": "2026-01-29 05:55:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2db8k5",
              "author": "CommercialComputer15",
              "text": "This is typical German software design 😂",
              "score": 66,
              "created_utc": "2026-01-29 06:56:11",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2dztb8",
                  "author": "Trikecarface",
                  "text": "No it isn't, it hasn't apologised or opened a window yet ",
                  "score": 11,
                  "created_utc": "2026-01-29 10:39:24",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o2dn1ko",
                  "author": "PositiveUse",
                  "text": "🤣😭",
                  "score": 3,
                  "created_utc": "2026-01-29 08:41:35",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o2eygwm",
                  "author": "gonnabuysomewindows",
                  "text": "There are definitely smoother variants for Android. https://addons.mozilla.org/en-US/firefox/addon/tiknot/\n\nI make an extension for iOS that does this by simply trimming the query parameters in the url. https://apps.apple.com/us/app/openclip-for-safari/id6708240044",
                  "score": 0,
                  "created_utc": "2026-01-29 14:24:59",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o2dsmr8",
              "author": "[deleted]",
              "text": "[removed]",
              "score": 3,
              "created_utc": "2026-01-29 09:34:36",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2dugvu",
                  "author": "Educational_Detail28",
                  "text": "Tbh I was expecting a shortcut when you click share or smthg like that 🤣",
                  "score": 3,
                  "created_utc": "2026-01-29 09:51:36",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o2dsjco",
              "author": "SVD_NL",
              "text": "Right, an obvious improvement would be to have something (Hosts file, DNS, proxy) redirect tiktok to this website that parses the url and does this automatically. That requires a bit more commitment though...",
              "score": 2,
              "created_utc": "2026-01-29 09:33:41",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2e6u2o",
                  "author": "_Nuutti",
                  "text": "Or just make it into an app and use it as a default for opening tiktok links, so clicking a tiktok link will open the viewer app instead.\n\nThese types of apps already exist tho.",
                  "score": 3,
                  "created_utc": "2026-01-29 11:37:29",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o2ec7gc",
              "author": "Relevant-Magic-Card",
              "text": "Much better than installing state run propaganda farm in tiktok ",
              "score": 2,
              "created_utc": "2026-01-29 12:16:23",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o2echbp",
              "author": "lIlIlIKXKXlIlIl",
              "text": "For me as somebody who gets daily like 2-3 tiktoks its okay, but I get your point. I will try to solve this issue. Furthermore its just to watch tiktosk you got sent without wanting the app on your mobile phone.",
              "score": 2,
              "created_utc": "2026-01-29 12:18:18",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o2yixel",
              "author": "Original-Body-5794",
              "text": " You can already see it without an account, just open it in your phone's browser.",
              "score": 1,
              "created_utc": "2026-02-01 12:15:42",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2dd3r3",
          "author": "BlackHazeRus",
          "text": "You should rephrase it and actually highlight that you are not watching it online, but downloading to your device.\n\nHonestly, I expected something like fixup.com for x.com links — just add a few words to a link and it will be played online. That would be really amazing! \n\nDownloading TikTok videos service is good too, but, personally, I would really like the link service, since watching TikTok links on mobile without having TikTok app is PITA (you need to click on a link and open site in a desktop mode).",
          "score": 8,
          "created_utc": "2026-01-29 07:11:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2dgfw1",
          "author": "spurkle",
          "text": "This is infinitely slower than just... opening the link?",
          "score": 13,
          "created_utc": "2026-01-29 07:41:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2djwag",
              "author": "monsieurninja",
              "text": "you can't on mobile. you have to have the app. i guess OP doesn't want to install tik tok. neither do i",
              "score": 7,
              "created_utc": "2026-01-29 08:12:08",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2dkd5i",
                  "author": "spurkle",
                  "text": "Yes you can? Just open the link in browser and click 'Not now' when it asks for the app. That's how I've been watching hundreds of tiktoks that my friend sends to me.",
                  "score": 13,
                  "created_utc": "2026-01-29 08:16:26",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o2dkf9x",
                  "author": "OmeBoon",
                  "text": "you can just delete the cookie part of the link and it works...",
                  "score": 3,
                  "created_utc": "2026-01-29 08:16:59",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o2e5h51",
                  "author": "theskywaspink",
                  "text": "I just tap a link and it opens in the phones browser",
                  "score": 1,
                  "created_utc": "2026-01-29 11:26:44",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2dafed",
          "author": "Fun_Blackberry_864",
          "text": "Downloading tiktok is faster 😭",
          "score": 19,
          "created_utc": "2026-01-29 06:49:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2dkpe2",
              "author": "Crinkez",
              "text": "Downloading it requires an account. No thanks.",
              "score": 7,
              "created_utc": "2026-01-29 08:19:38",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o2dk6ju",
              "author": "YMiMJ",
              "text": "But not safer.",
              "score": 11,
              "created_utc": "2026-01-29 08:14:45",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2dctug",
          "author": "puresea88",
          "text": "Why not create a whatsapp bot that automatically gives you the video from pasting the tiktok link to it?",
          "score": 3,
          "created_utc": "2026-01-29 07:09:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2deeb7",
              "author": "Late_Film_1901",
              "text": "Or even better - one that watches it for you and comments on the content without you wasting time for TikTok!",
              "score": 11,
              "created_utc": "2026-01-29 07:23:13",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2erox0",
                  "author": "puresea88",
                  "text": "You think theres market for that?",
                  "score": 0,
                  "created_utc": "2026-01-29 13:49:33",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2dpjx0",
          "author": "hiccupq",
          "text": "Please for the love of god don't use recaptcha. I immediately leave the sites that use it. It never lets me in, I usually have to do it 4 times and sometimes it still doesn't let me in. It's horrible.\nUse cloudflare or something that detects bots automatically.",
          "score": 2,
          "created_utc": "2026-01-29 09:05:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2b3ixb",
          "author": "lIlIlIKXKXlIlIl",
          "text": "[savett.xyz](http://savett.xyz) is the link",
          "score": 4,
          "created_utc": "2026-01-28 22:58:56",
          "is_submitter": true,
          "replies": [
            {
              "id": "o2e6qde",
              "author": "vitorhugods",
              "text": "It would be handy if you got a domain like \\`tiktoknoacc.com\\` or similar.  \nSo users could copy/paste, and just transform the link to \\`vm.tiktoknoacc.com/AISUDHIUAS\\` or similar.\n\nIt would redirect to \\`savett.xyz\\` and prefill all the stuff.",
              "score": 5,
              "created_utc": "2026-01-29 11:36:41",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2ecl1u",
                  "author": "lIlIlIKXKXlIlIl",
                  "text": "Really good point Thank you",
                  "score": 3,
                  "created_utc": "2026-01-29 12:19:01",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            },
            {
              "id": "o2e66jt",
              "author": "ThePatientIdiot",
              "text": "People are not going to use this at its current version. Who is spending 40 seconds to watch a 15 second clip? Either go back to the drawing board or quit honestly, I think you should quit and save your time. This has to be like the worst user design and flow I’ve seen in months.",
              "score": -1,
              "created_utc": "2026-01-29 11:32:21",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2e9mmu",
                  "author": "LaserSharked8",
                  "text": "Username doesn't check out :(",
                  "score": 5,
                  "created_utc": "2026-01-29 11:58:06",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2djc0g",
          "author": "D217K",
          "text": "Nice idea, I have the same problem and I definitely am not going to download TikTok ever. However, I get the point of people saying it’s complicated / needs a lot of time. \n\nDo you think it would be possible to use a dynamic slug? So you could simply have savett.xyz/{tiktoklink}? That would open the doors to create straight automations and so on… not sure how you could handle the captcha then but maybe via recaptcha v3 (token instead of puzzle) or cloudflare.",
          "score": 2,
          "created_utc": "2026-01-29 08:07:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2dzpt8",
              "author": "jasonweaver",
              "text": "This is the way. Super useful as a share intent.",
              "score": 2,
              "created_utc": "2026-01-29 10:38:33",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2djlnj",
          "author": "decebaldecebal",
          "text": "This is actually useful!\n\nBut I think the friction of having to paste the link in the site is too much for most people...",
          "score": 2,
          "created_utc": "2026-01-29 08:09:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2dldcj",
          "author": "Potatoheadkid",
          "text": "my short attention span would rather create a dummy account instead",
          "score": 1,
          "created_utc": "2026-01-29 08:25:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2dng8f",
          "author": "PocketManey",
          "text": "Just load the TikTok website as desktop and refresh it and it will show the video to play 😆",
          "score": 1,
          "created_utc": "2026-01-29 08:45:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2dnm4n",
          "author": "mostawesomepersonevr",
          "text": "But now you need to delete that Nazi app!",
          "score": 1,
          "created_utc": "2026-01-29 08:46:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2donjo",
          "author": "Shaernobill",
          "text": "just open the link in brave, problem solved",
          "score": 1,
          "created_utc": "2026-01-29 08:56:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2dpb9x",
          "author": "edaroni",
          "text": "This looks like a horrible experience to use… just download the app",
          "score": 1,
          "created_utc": "2026-01-29 09:02:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2drxi3",
          "author": "MrZArmin",
          "text": "You can just select the option on mobile to \"show desktop site\" and you can watch it without a problem.",
          "score": 1,
          "created_utc": "2026-01-29 09:27:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2dsaxe",
          "author": "Typical-Tangerine660",
          "text": "Definitely will be easier if you can make a redirect-based approach similar to \"ssyoutube.com\", where you add two letters before the link to get to the download page right away from savefrom website.",
          "score": 1,
          "created_utc": "2026-01-29 09:31:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2dsfci",
          "author": "Educational_Two7628",
          "text": "My son, said no one.",
          "score": 1,
          "created_utc": "2026-01-29 09:32:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2dts74",
          "author": "dxbmax",
          "text": "44 seconds and multiple steps to watch a 6 second video? At this point you should just make the account",
          "score": 1,
          "created_utc": "2026-01-29 09:45:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2dtsiz",
          "author": "IohannesMatrix",
          "text": "You can change the browser into desktop mode and it works lol. And it stays that way. No need for this 😂😂",
          "score": 1,
          "created_utc": "2026-01-29 09:45:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2e0joe",
          "author": "dragon_idli",
          "text": "i would rather give a thumbsup and not forget it than go through the hassle which is as convoluted as unlocking swiss bank locker.",
          "score": 1,
          "created_utc": "2026-01-29 10:45:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2e17nw",
          "author": "Free-Pound-6139",
          "text": "Google tiktok download, none of this bullshit.",
          "score": 1,
          "created_utc": "2026-01-29 10:51:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2e1tdq",
          "author": "Different_Fly_6409",
          "text": "The pain point is real, a lot of us want to watch a shared TikTok without creating an account or getting pulled into the app. That said, the solution feels a bit heavy right now. If the flow could be simplified, the value would be much stronger.",
          "score": 1,
          "created_utc": "2026-01-29 10:56:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2e60uh",
          "author": "N0misB",
          "text": "Hammergeil, brauch ich auch unbedingt.",
          "score": 1,
          "created_utc": "2026-01-29 11:31:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2e6hrb",
          "author": "exe_CUTOR",
          "text": "Vibecoders solving problems no one had.",
          "score": 1,
          "created_utc": "2026-01-29 11:34:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2e6ikg",
          "author": "Present_Material9587",
          "text": "I just use a Firefox addon for Android https://addons.mozilla.org/en-US/android/addon/tiktok-url-cleaner/",
          "score": 1,
          "created_utc": "2026-01-29 11:35:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2e9tx2",
          "author": "j0nimost",
          "text": "That's a lot of friction for a normal user, no?",
          "score": 1,
          "created_utc": "2026-01-29 11:59:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2edosj",
          "author": "Ebreton2",
          "text": "The 👍 got me hahaha",
          "score": 1,
          "created_utc": "2026-01-29 12:26:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ee3f5",
          "author": "bouncer-1",
          "text": "Yeh I’ll just create an account",
          "score": 1,
          "created_utc": "2026-01-29 12:29:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2epso4",
          "author": "omi108591",
          "text": "better to just take video as parameter so in your url just type website and paste video url it plays it…no wait for website to load and then to paste url",
          "score": 1,
          "created_utc": "2026-01-29 13:39:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2f8kwj",
          "author": "fss71",
          "text": "Too many steps - might as well make a TikTok account",
          "score": 1,
          "created_utc": "2026-01-29 15:14:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2fh7h6",
          "author": "TopMandemG",
          "text": "Too much work just to watch a video. Make something with almost no friction, and then people will start using ur tool.",
          "score": 1,
          "created_utc": "2026-01-29 15:53:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2fszy6",
          "author": "TrueRecording6064",
          "text": "For some reason I feel this was more of a joke than an actual side project. Works like both though. I can understand the pain of receiving TikTok’s in WhatsApp and not being able to open them up. Creates a sort of mini friction when your friends need to download the reel and send it to you. So this could work, but I’m sensing it’s really niche, which is good as well.",
          "score": 1,
          "created_utc": "2026-01-29 16:45:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2gav6i",
          "author": "Bored_Aziz",
          "text": "👍",
          "score": 1,
          "created_utc": "2026-01-29 18:05:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2gwwe8",
          "author": "ElegantCount8648",
          "text": "🤣👌",
          "score": 1,
          "created_utc": "2026-01-29 19:46:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2hk9bc",
          "author": "devils-advocacy",
          "text": "Grab my upvote. Just deleted tiktok today and my buddy sent me a link that I couldn’t open, but remembered your post and came back to it. Great job. \n\nSmall UI issue on mobile: \nThe bottom sections for why use this downloader and recent links have a larger width than the other panels",
          "score": 1,
          "created_utc": "2026-01-29 21:38:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2i175e",
          "author": "LeiNaD_87_",
          "text": "I just open the web in desktop mode, so I can watch ticktik videos without app or account",
          "score": 1,
          "created_utc": "2026-01-29 23:02:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2j9vpf",
          "author": "keebmat",
          "text": "share menu?",
          "score": 1,
          "created_utc": "2026-01-30 03:06:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2jh2us",
          "author": "Direct_Turn_1484",
          "text": "“Guys I told you I don’t use TikTok.” The end.",
          "score": 1,
          "created_utc": "2026-01-30 03:48:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2joopt",
          "author": "HypnoticLion",
          "text": "Is everyone here a bot? Am I the only human? That was obviously an S tier Rick Roll right? No way everyone here actually thinks this is a real project, good job sir",
          "score": 1,
          "created_utc": "2026-01-30 04:35:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2k4cas",
          "author": "skillzz_24",
          "text": "Ain’t nobody doing all that gang",
          "score": 1,
          "created_utc": "2026-01-30 06:28:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2kv52w",
          "author": "Disastrous-Island430",
          "text": "bro rick rolled us in a clever way",
          "score": 1,
          "created_utc": "2026-01-30 10:23:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2rmnr0",
          "author": "According_Cook_2035",
          "text": "nicee",
          "score": 1,
          "created_utc": "2026-01-31 10:11:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ut37t",
          "author": "TehTacow",
          "text": "Plottwist: it always rickrolls you",
          "score": 1,
          "created_utc": "2026-01-31 21:00:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o302j3w",
          "author": "Top_Bumblebee_7762",
          "text": "👍",
          "score": 1,
          "created_utc": "2026-02-01 17:17:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o31aw3t",
          "author": "zakmac85",
          "text": "OMG I need this. My mom (in her 60's) lives on TikTok and I (elder millennial) do not get it lol.",
          "score": 1,
          "created_utc": "2026-02-01 20:43:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2dgy2b",
          "author": "ittrut",
          "text": "its nice idea but no way peeps gonna use 40 seconds to go see a 15 second video, you should make it an app so it just opens directly.",
          "score": 1,
          "created_utc": "2026-01-29 07:45:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2c35nc",
          "author": "Dark_Mesh",
          "text": "That's pretty cool",
          "score": -3,
          "created_utc": "2026-01-29 02:08:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2dkdoa",
          "author": "someGuyyya",
          "text": "Are you saving the video temporarily in storage (s3, etc) and deleting them later?",
          "score": 0,
          "created_utc": "2026-01-29 08:16:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2dk1z6",
          "author": "YMiMJ",
          "text": "Heck yeah, save those TT's!",
          "score": -1,
          "created_utc": "2026-01-29 08:13:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2devbi",
          "author": "Hamzavibes",
          "text": "This is pretty cool, does it work for other social media like Instagram?",
          "score": -5,
          "created_utc": "2026-01-29 07:27:21",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qt6qvi",
      "title": "I built a pixel office that animates in real-time based on your Claude Code sessions — 100k views and 450+ beta users in 48 hours",
      "subreddit": "SideProject",
      "url": "https://v.redd.it/02v9spe9hxgg1",
      "author": "Waynedevvv",
      "created_utc": "2026-02-01 18:41:32",
      "score": 229,
      "num_comments": 53,
      "upvote_ratio": 0.97,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/SideProject/comments/1qt6qvi/i_built_a_pixel_office_that_animates_in_realtime/",
      "domain": "v.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "o30yhaf",
          "author": "Ambitious-Style-1087",
          "text": "so cooool",
          "score": 17,
          "created_utc": "2026-02-01 19:43:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o31r8av",
              "author": "Waynedevvv",
              "text": "thanks!",
              "score": 0,
              "created_utc": "2026-02-01 22:02:52",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o31rwqm",
          "author": "LiveMinute5598",
          "text": "I would use this but wish it was open source. Hard to trust anything these days when people can use Claude to clone it.",
          "score": 14,
          "created_utc": "2026-02-01 22:06:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o355y2f",
              "author": "Waynedevvv",
              "text": "Totally understandable. It’s partially open sourced. From the iOS side, terminal broadcasting the events via local network to mobile app. And the broadcasting code is open sourced so don’t need to worry about sensitive data leaked. https://github.com/waynedev9598/PixelHQ-bridge\n\nBut macOS side is just local file reading which is harder to proof security unless I open source the whole thing. Will think about it… thanks for your interest tho.",
              "score": 2,
              "created_utc": "2026-02-02 12:15:52",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o31cgpd",
          "author": "Superguy795",
          "text": "Very cool!",
          "score": 3,
          "created_utc": "2026-02-01 20:51:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o31n4ju",
          "author": "No-Loss4301",
          "text": "That's look like the kano kit exploration world!!",
          "score": 3,
          "created_utc": "2026-02-01 21:42:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o343z5p",
          "author": "PottsPointPilgrim",
          "text": "Would be perfect on the Apple TV",
          "score": 3,
          "created_utc": "2026-02-02 06:32:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3562st",
              "author": "Waynedevvv",
              "text": "Are you solo builder or a team? If there many teams requesting it might consider it!",
              "score": 1,
              "created_utc": "2026-02-02 12:16:50",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o31nb8o",
          "author": "neogener",
          "text": "How to try it?",
          "score": 2,
          "created_utc": "2026-02-01 21:43:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o31r7fh",
              "author": "Waynedevvv",
              "text": "[https://testflight.apple.com/join/qqTPmvCd](https://testflight.apple.com/join/qqTPmvCd)",
              "score": 2,
              "created_utc": "2026-02-01 22:02:45",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o34y47r",
                  "author": "Ste_XD",
                  "text": "Would love to see this on other platforms!",
                  "score": 2,
                  "created_utc": "2026-02-02 11:12:54",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3206ko",
          "author": "QuackDB",
          "text": "This is pretty cool. Is their a git page or a way I can try this out",
          "score": 2,
          "created_utc": "2026-02-01 22:48:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3569sy",
              "author": "Waynedevvv",
              "text": "Yeah you can try it here (beta on iOS/macOS): https://testflight.apple.com/join/qqTPmvCd",
              "score": 1,
              "created_utc": "2026-02-02 12:18:17",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3243oc",
          "author": "Ok-Access-7480",
          "text": "soooooo cool broo",
          "score": 2,
          "created_utc": "2026-02-01 23:09:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o356a6w",
              "author": "Waynedevvv",
              "text": "Thankssss",
              "score": 2,
              "created_utc": "2026-02-02 12:18:22",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o335mph",
          "author": "humanexperimentals",
          "text": "That's a dope as idea",
          "score": 2,
          "created_utc": "2026-02-02 02:39:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o356ajm",
              "author": "Waynedevvv",
              "text": "Thanks!",
              "score": 1,
              "created_utc": "2026-02-02 12:18:26",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o33gz1g",
          "author": "alpha_dosa",
          "text": "This is the coolest side project I've seen. Amazing!!",
          "score": 2,
          "created_utc": "2026-02-02 03:46:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o356bgb",
              "author": "Waynedevvv",
              "text": "Wow what a compliment!",
              "score": 1,
              "created_utc": "2026-02-02 12:18:37",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o33j1id",
          "author": "SereneAlps3789",
          "text": "Wow awesome! Did Claude create the assets too or tell you how to create the assets?",
          "score": 2,
          "created_utc": "2026-02-02 03:58:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o356bze",
              "author": "Waynedevvv",
              "text": "O sourced the assets",
              "score": 2,
              "created_utc": "2026-02-02 12:18:44",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o33q14w",
          "author": "Nightshade_Chronicle",
          "text": "This is so cool. Makes me miss all the pixel games I grew up playing. Nice job! What was your favorite part of creating this project?",
          "score": 2,
          "created_utc": "2026-02-02 04:44:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o33zb4l",
          "author": "Vashe00",
          "text": "Love it",
          "score": 2,
          "created_utc": "2026-02-02 05:53:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o342fks",
          "author": "Expert-Drawer9510",
          "text": "Wow that looks cool",
          "score": 2,
          "created_utc": "2026-02-02 06:18:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o346vhe",
          "author": "Sojechan",
          "text": "Looks like workadventure, which is also self-hostable",
          "score": 2,
          "created_utc": "2026-02-02 06:57:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o34dwym",
          "author": "c4pl4b",
          "text": "Pokémon ❤️",
          "score": 2,
          "created_utc": "2026-02-02 08:01:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o356dev",
              "author": "Waynedevvv",
              "text": "Exactly!",
              "score": 1,
              "created_utc": "2026-02-02 12:19:02",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o34fwo8",
          "author": "rjyo",
          "text": "The real-time sync with Claude Code is slick - how are you hooking into the session activity? Polling the API, file watchers, or something else? Also curious about the animation triggers - does each tool call get its own animation?",
          "score": 2,
          "created_utc": "2026-02-02 08:20:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o356ibv",
              "author": "Waynedevvv",
              "text": "Simply file water. And yes but animation is still very simple yet. Like a simple bubble. But will add more fun stuff soon!",
              "score": 1,
              "created_utc": "2026-02-02 12:20:02",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o34y2eu",
          "author": "Ste_XD",
          "text": "Looks inspired by Kairosoft games! <3",
          "score": 2,
          "created_utc": "2026-02-02 11:12:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o356j3d",
              "author": "Waynedevvv",
              "text": "What is that!",
              "score": 1,
              "created_utc": "2026-02-02 12:20:11",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o35w09c",
                  "author": "Ste_XD",
                  "text": "Search, it's a game dev studio with a similar style, I assumed you were inspired by it.",
                  "score": 1,
                  "created_utc": "2026-02-02 14:50:46",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o32069r",
          "author": "jakeStacktrace",
          "text": "No going postal option yet?",
          "score": 1,
          "created_utc": "2026-02-01 22:48:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o35he4v",
          "author": "ChoiceSeason3519",
          "text": "Not even 3mb? Impressive 🫨",
          "score": 1,
          "created_utc": "2026-02-02 13:31:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o35lkxn",
              "author": "Waynedevvv",
              "text": "1.8! It’s light 😆",
              "score": 1,
              "created_utc": "2026-02-02 13:54:57",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o35rij3",
          "author": "projectile55",
          "text": "Using swift ?",
          "score": 1,
          "created_utc": "2026-02-02 14:27:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o36lbtg",
          "author": "djpiperson",
          "text": "Mang I wish there was something like this for cursor on Linux/Windows. ",
          "score": 1,
          "created_utc": "2026-02-02 16:50:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o37ar2d",
          "author": "justleave-mealone",
          "text": "i freaking love this",
          "score": 1,
          "created_utc": "2026-02-02 18:46:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o37ere2",
          "author": "TomatoWasabi",
          "text": "Have you thought about adding a funny animation or a when a user hits the limit?",
          "score": 1,
          "created_utc": "2026-02-02 19:04:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3byfu8",
          "author": "CarpetApart7335",
          "text": "Reminds me of Pokémon Firered",
          "score": 1,
          "created_utc": "2026-02-03 12:37:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o315fwv",
          "author": "PositiveUse",
          "text": "Amazing idea lol the neckbeards gonna love it",
          "score": 2,
          "created_utc": "2026-02-01 20:16:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o32tnip",
          "author": "obaidnadeem",
          "text": "W",
          "score": 1,
          "created_utc": "2026-02-02 01:31:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o31r6jk",
          "author": "Waynedevvv",
          "text": "Join beta for free here (ios/macOS): [https://testflight.apple.com/join/qqTPmvCd](https://testflight.apple.com/join/qqTPmvCd)",
          "score": -4,
          "created_utc": "2026-02-01 22:02:38",
          "is_submitter": true,
          "replies": []
        },
        {
          "id": "o33rmqs",
          "author": "BP041",
          "text": "That sounds like a really fun and innovative project! Real-time animation based on coding sessions could add a unique layer of engagement and creativity to the development process. I’m curious about how you handle the performance aspect—do you have any tips for ensuring smooth animations while maintaining session responsiveness?",
          "score": -5,
          "created_utc": "2026-02-02 04:55:40",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qr6qna",
      "title": "I built a visual Python tool that turns AI generated code into reusable blocks",
      "subreddit": "SideProject",
      "url": "https://v.redd.it/paot2zxxwhgg1",
      "author": "lem_of_noland",
      "created_utc": "2026-01-30 14:20:49",
      "score": 176,
      "num_comments": 47,
      "upvote_ratio": 0.97,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/SideProject/comments/1qr6qna/i_built_a_visual_python_tool_that_turns_ai/",
      "domain": "v.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "o2m888m",
          "author": "imabev",
          "text": "Upvoted just because it looks pretty.",
          "score": 11,
          "created_utc": "2026-01-30 15:25:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2m8mtv",
              "author": "lem_of_noland",
              "text": "Thanks!",
              "score": 1,
              "created_utc": "2026-01-30 15:27:01",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2ma3vj",
          "author": "roncz",
          "text": "Interesting concept indeed.",
          "score": 6,
          "created_utc": "2026-01-30 15:33:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2mbn6d",
              "author": "lem_of_noland",
              "text": "Thank you",
              "score": 1,
              "created_utc": "2026-01-30 15:40:38",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2mrv7r",
          "author": "upvotes2doge",
          "text": "Excellent. Love your idea. Visual programming with dynamic blocks",
          "score": 6,
          "created_utc": "2026-01-30 16:53:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2myuce",
              "author": "lem_of_noland",
              "text": "Thanks!  \n  \nTbh, using it for pure \"visual programming\" can be a bad idea. I think It is more suitable for nodes containing some complex logic and you connect everything to gain time.\n\nAnd beyond the visual aspect, you still can export the flow as a Python script at the end.",
              "score": 2,
              "created_utc": "2026-01-30 17:24:17",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2mb0wo",
          "author": "2bake",
          "text": "Pretty neat!",
          "score": 3,
          "created_utc": "2026-01-30 15:37:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2mbowp",
              "author": "lem_of_noland",
              "text": "Thanks!",
              "score": 1,
              "created_utc": "2026-01-30 15:40:52",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2n23v4",
          "author": "ok_olive_02",
          "text": "I don't have a use case right now but I am going to give it a try and will give you honest feedback.\nBut upvoting just for the idea and visuals",
          "score": 3,
          "created_utc": "2026-01-30 17:39:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2n32kn",
              "author": "lem_of_noland",
              "text": "Yes please, thank you!  \nI'm solo developing this, so it is still a bit rough and honest feedbacks are more than welcome!",
              "score": 1,
              "created_utc": "2026-01-30 17:43:25",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2nefv4",
          "author": "s_u_r_a_j",
          "text": "Great work!",
          "score": 3,
          "created_utc": "2026-01-30 18:32:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2nemzq",
              "author": "lem_of_noland",
              "text": "Thank you!",
              "score": 1,
              "created_utc": "2026-01-30 18:33:43",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2nqztt",
          "author": "EtsyCorn",
          "text": "so block coding for python. Interesting!",
          "score": 3,
          "created_utc": "2026-01-30 19:28:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2nr795",
              "author": "lem_of_noland",
              "text": "Exactly!",
              "score": 1,
              "created_utc": "2026-01-30 19:29:27",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2ntiol",
                  "author": "EtsyCorn",
                  "text": "very cool",
                  "score": 1,
                  "created_utc": "2026-01-30 19:40:07",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2oqee3",
          "author": "zekirobi",
          "text": "Any thoughts on doing the same for Web Development tools? Like JS, PHP. Any other Programming language?",
          "score": 2,
          "created_utc": "2026-01-30 22:15:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2orvyo",
              "author": "lem_of_noland",
              "text": "Unfortunately, no. I'm limiting it to only Python, knowing I'm solo developing it and it's a bit hard to maintain and debug multiple \"language translator\" of the DAG (Directed Acyclic Graph) by myself.",
              "score": 2,
              "created_utc": "2026-01-30 22:23:27",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2osioc",
                  "author": "zekirobi",
                  "text": "Thats ok, either way congrats. Then i would go do some research on how to possibly do that same idea you did but with programming languages. \n\nAny tips, resources?",
                  "score": 2,
                  "created_utc": "2026-01-30 22:26:38",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2paztc",
          "author": "[deleted]",
          "text": "[deleted]",
          "score": 2,
          "created_utc": "2026-01-31 00:05:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2pc2fp",
              "author": "lem_of_noland",
              "text": "All the UI is React-flow (xyflow) + Tailwind CSS.\n\nI hope this answers your question.",
              "score": 4,
              "created_utc": "2026-01-31 00:11:30",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2pdcvz",
          "author": "Complete-Syrup-9179",
          "text": "That looks pretty good, well done",
          "score": 2,
          "created_utc": "2026-01-31 00:18:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2ryvjx",
              "author": "lem_of_noland",
              "text": "Thank you",
              "score": 1,
              "created_utc": "2026-01-31 12:02:08",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2qkl4o",
          "author": "Hairy_Beartoe",
          "text": "This is super cool! Side note/question, how do you make these types of videos? Is it a software?",
          "score": 2,
          "created_utc": "2026-01-31 04:40:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2rj7r5",
              "author": "lem_of_noland",
              "text": "It's an app called Screen Studio.",
              "score": 1,
              "created_utc": "2026-01-31 09:38:39",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2qu690",
          "author": "flagrande",
          "text": "I know next to nothing about python other than some people seem to know how to turn it into money, but this looks super cool!",
          "score": 2,
          "created_utc": "2026-01-31 05:51:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2rjb66",
              "author": "lem_of_noland",
              "text": "Thank you",
              "score": 1,
              "created_utc": "2026-01-31 09:39:34",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2rm484",
          "author": "protomota",
          "text": "The reusability problem with AI code is real - I've hit the same wall. You get something that works, but it's so tightly coupled to the context you described that extracting it for reuse feels like starting over. The block library approach is clever because it forces you to think about interfaces and boundaries upfront rather than after the fact. Curious how you handle versioning - when a block's internal logic needs to change but it's already wired into multiple workflows?",
          "score": 2,
          "created_utc": "2026-01-31 10:06:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2rnr10",
              "author": "lem_of_noland",
              "text": "You described this issue so well.\n\nFor the versioning part, it is a bit tricky: you can imagine if a block has its inputs/outputs names and types change completely, what to do in this case? Knowing that links between nodes are typed (meaning you can only link edges with compatible types).\n\nFor now I chose the approach that you need to manually put the new block in the flow to replace the old one. Upgrading or updating a block does not impact existing ones in an already created flow (for now).\n\nMaybe I have to think about a much clever and robust solution for a future version. But I think it's a hard problem (at least from my perspective).",
              "score": 1,
              "created_utc": "2026-01-31 10:22:06",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2p9qmw",
          "author": "INVENTADORMASTER",
          "text": "Great !",
          "score": 1,
          "created_utc": "2026-01-30 23:58:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2pau26",
          "author": "One-Lingonberry-4048",
          "text": "thanks for sharing",
          "score": 1,
          "created_utc": "2026-01-31 00:04:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2sbhyj",
          "author": "srch4aheartofgold",
          "text": "what are you using for zooming effects while recording?",
          "score": 1,
          "created_utc": "2026-01-31 13:33:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2y26yw",
              "author": "lem_of_noland",
              "text": "An app called Screen Studio",
              "score": 2,
              "created_utc": "2026-02-01 09:48:17",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o361v23",
                  "author": "srch4aheartofgold",
                  "text": "thank you",
                  "score": 1,
                  "created_utc": "2026-02-02 15:20:11",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2xdv1q",
          "author": "mossaicc",
          "text": "Amazing, What tech did you use to build this?",
          "score": 1,
          "created_utc": "2026-02-01 06:08:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2y2cl6",
              "author": "lem_of_noland",
              "text": "It's an Electron app, using Nextjs as a renderer (React-flow as core element). So using JS tondo the interface with Python.",
              "score": 2,
              "created_utc": "2026-02-01 09:49:42",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2y2m80",
          "author": "Opening-Clock-7603",
          "text": "Perfect!",
          "score": 1,
          "created_utc": "2026-02-01 09:52:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2yp4pv",
          "author": "Upbeat_Panic_2646",
          "text": "pretty cool!",
          "score": 1,
          "created_utc": "2026-02-01 13:02:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o30umb5",
          "author": "Vijay_17205",
          "text": "Niceee, did scratch inspire you to make dis?",
          "score": 1,
          "created_utc": "2026-02-01 19:24:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o310ljv",
              "author": "lem_of_noland",
              "text": "No, it was a mix of using Dataiku and DBT.",
              "score": 1,
              "created_utc": "2026-02-01 19:53:09",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o310344",
          "author": "Ambitious-Style-1087",
          "text": "👀👀👀",
          "score": 1,
          "created_utc": "2026-02-01 19:50:43",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qt6d2g",
      "title": "Scaled my B2B lead gen agency to 20 concurrent clients. Share what made It possible",
      "subreddit": "SideProject",
      "url": "https://www.reddit.com/r/SideProject/comments/1qt6d2g/scaled_my_b2b_lead_gen_agency_to_20_concurrent/",
      "author": "breakyouridea",
      "created_utc": "2026-02-01 18:28:15",
      "score": 101,
      "num_comments": 18,
      "upvote_ratio": 1.0,
      "text": "Running a LinkedIn lead gen agency solo for 3 years, and couldn't get more than 5 clients without hiring. But margins were too tight to bring on staff. That's why I spent 12-hour days just doing repetitive connection requests and follow-ups across different accounts.\n\nHate that feeling, like I was choosing between keeping my agency (and check) small forever or sacrificing quality to grow. So I took a risk last year and went on automation for all this copying and pasting, and focused on the strategy. I didn't expect that but my response rates went up, I hired a sales person and we managed to get 20 clients. And actually they don't care that most of the initial outreach is automated, they just see qualified conversations in their inbox.\n\nSo if are in doubt just as I did, go for it and try to integrate tools or AI models and agents or whatever to make your work faster and focus on optimization and strategy as a CEO.\n\nAnyone else struggled with this mental block around automating client work? How did you get past it?\n\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/SideProject/comments/1qt6d2g/scaled_my_b2b_lead_gen_agency_to_20_concurrent/",
      "domain": "self.SideProject",
      "is_self": true,
      "comments": [
        {
          "id": "o30kmj5",
          "author": "Oopsfoxy",
          "text": "What made you finally take the decision?",
          "score": 6,
          "created_utc": "2026-02-01 18:39:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o30ktng",
              "author": "breakyouridea",
              "text": "turned down 3 good clients in one month because I physically couldn't handle more work. Did the math on annual revenue and felt stupid XD",
              "score": 2,
              "created_utc": "2026-02-01 18:40:01",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o30mwa8",
                  "author": "Oopsfoxy",
                  "text": "I'm there right now",
                  "score": 1,
                  "created_utc": "2026-02-01 18:49:20",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o30kwsz",
          "author": "HGHall",
          "text": "what business? were pivoting our gtm team in opposite direction. hire part time semi-retired or independent industry experts & pay them for leads. it's so messy in lead gen at midcap / enterprise in software rn and wont get better. IE is your ai email rly better than the next guys? can you send more? whats the edge? on top of that you've got a finite pool of buyers who are getting less and less patient w the bullshit half assed slop.\n\nnot saying what you or many agencies do is slop - but it's just undifferentiated. i truly think the future is independent consulting experts for high-ticket shit. basically a contract domain expert. if you have an industry vertical you're partial to, or have a network in, i might try grabbing a handful of the best ppl you know and pimping them out on a pay per meeting / deal cut basis. you find the business and they make the intros or do the work.\n\nthat said - not everyone is in same industry.",
          "score": 2,
          "created_utc": "2026-02-01 18:40:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o30rjmg",
          "author": "RustedWarCrow",
          "text": "I'm stuck at exactly 6 clients right now for the same reason. How did you even begin automating without everything falling apart?",
          "score": 1,
          "created_utc": "2026-02-01 19:10:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o30s63z",
              "author": "breakyouridea",
              "text": "Started with just 1client who I had a really good relationship with. Told him that I want to try something new, if it doesn't work we'll revert. Ran automation for him for 2 months while still doing manual for everyone else. His results improved. That gave me confidence to ask others.",
              "score": 1,
              "created_utc": "2026-02-01 19:13:19",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o30sol8",
                  "author": "RustedWarCrow",
                  "text": "What exactly improved? Like metrics-wise?",
                  "score": 1,
                  "created_utc": "2026-02-01 19:15:43",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qrvkna",
      "title": "Turned my job rejections into a small interactive data viz site",
      "subreddit": "SideProject",
      "url": "https://v.redd.it/mlprrt86wmgg1",
      "author": "Capital_Pain_8718",
      "created_utc": "2026-01-31 07:07:23",
      "score": 91,
      "num_comments": 15,
      "upvote_ratio": 0.95,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/SideProject/comments/1qrvkna/turned_my_job_rejections_into_a_small_interactive/",
      "domain": "v.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "o2r50q9",
          "author": "Lost-Penalty4545",
          "text": "Git repo plz",
          "score": 5,
          "created_utc": "2026-01-31 07:24:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2r5axd",
              "author": "Capital_Pain_8718",
              "text": "it's pretty pretty messy. \n\n[https://github.com/adityaSharma6356/rejection\\_pool](https://github.com/adityaSharma6356/rejection_pool)",
              "score": 3,
              "created_utc": "2026-01-31 07:27:27",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2r4va9",
          "author": "Lost-Penalty4545",
          "text": "Cool",
          "score": 3,
          "created_utc": "2026-01-31 07:23:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2rezbo",
          "author": "abhijith1203",
          "text": "You're adding every company manually to the list. Why?\n\nWhy dont you add them via en excel, csv or maybe notion directly?",
          "score": 3,
          "created_utc": "2026-01-31 08:57:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2rfs53",
              "author": "Capital_Pain_8718",
              "text": "I made an extension to fetch from linkedin application page and python script to fetch company info. Combine them into a list automatically for all new jobs i got rejected from.\n \nThen i guess i will have to add them in the script file manually. But this was just a fun side project I didn't plan a lot. \n\nI will add a csv for the list as you said. Processing would be easier that way at least.\n\nI have no idea what Notion is. Really new to web dev so I'll check that out too. \nThanks.",
              "score": 2,
              "created_utc": "2026-01-31 09:05:31",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2rg3qq",
                  "author": "abhijith1203",
                  "text": "Cool. Checkout Notion app. It's a collaboration app with lot of cool features.",
                  "score": 1,
                  "created_utc": "2026-01-31 09:08:36",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2t7hfc",
          "author": "Alternative-Theme885",
          "text": "I love the creativity behind turning rejections into a data viz site - it's a fantastic way to spin a negative into a positive. Did you use a specific library or framework to build the interactive bubble visualization, and what inspired you to choose that approach?",
          "score": 3,
          "created_utc": "2026-01-31 16:23:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2t88q7",
              "author": "Capital_Pain_8718",
              "text": "Thanks for the compliment.\nThe idea was just spontaneous. \nAnd no. I only used vanilla js, canvas and some game physics logic like collision and gravity.",
              "score": 1,
              "created_utc": "2026-01-31 16:26:53",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2rd6cw",
          "author": "c4pl4b",
          "text": "My condolences, brother.",
          "score": 2,
          "created_utc": "2026-01-31 08:40:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2sw3j1",
          "author": "rahulkandoriya",
          "text": "I really like the bubble UI to give a fun touch with context. \n\nI also used similar bubble UI that you can pop on my microsaas: [offlist.me](https://www.offlist.me)",
          "score": 2,
          "created_utc": "2026-01-31 15:28:07",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qu02wz",
      "title": "I spent a year building a U.S. political news app that aggregates policy, news, and social feeds into one place",
      "subreddit": "SideProject",
      "url": "https://govbase.io",
      "author": "ipromiseimcool",
      "created_utc": "2026-02-02 16:40:05",
      "score": 88,
      "num_comments": 15,
      "upvote_ratio": 0.96,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/SideProject/comments/1qu02wz/i_spent_a_year_building_a_us_political_news_app/",
      "domain": "govbase.io",
      "is_self": false,
      "comments": [
        {
          "id": "o376bhz",
          "author": "Dangerous-Guava-9232",
          "text": "Neat idea. Not many twitter accounts in the social feed though.",
          "score": 2,
          "created_utc": "2026-02-02 18:26:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o376q3n",
              "author": "ipromiseimcool",
              "text": "Thanks! Yeah the social feed is pretty new and I’m trying wrap my head around the api costs before I add every politician and agency. Definitely the plan though.",
              "score": 1,
              "created_utc": "2026-02-02 18:28:34",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3770l7",
          "author": "SadDate9398",
          "text": "Would be nice to have one news app with all the original facts and social posts within the story. I could see that as useful.",
          "score": 2,
          "created_utc": "2026-02-02 18:29:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o377nt5",
              "author": "ipromiseimcool",
              "text": "Yeah for now it’s a few different feeds but I’m working on connecting everything together so it’s all simpler to follow.",
              "score": 1,
              "created_utc": "2026-02-02 18:32:49",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o37da46",
          "author": "keksper",
          "text": "Really cool to see something that's grounded directly back to the source. I'll check it out!\n\nCivic action would be a cool addition, especially coming into midterms...",
          "score": 2,
          "created_utc": "2026-02-02 18:58:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o37ey3y",
              "author": "ipromiseimcool",
              "text": "Yep totally agree! Trying to figure out where to start with that now and what would be most helpful!",
              "score": 1,
              "created_utc": "2026-02-02 19:05:48",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o38wuru",
          "author": "mfreeze77",
          "text": "I like this, and have been working on something similar, but I have been focusing on daily hearing extraction, coupled with doner interests per legislator.  The thought is to be able to predict voting patterns based on contributors self interests.",
          "score": 2,
          "created_utc": "2026-02-02 23:26:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o38xl1h",
              "author": "ipromiseimcool",
              "text": "Super cool! I want to track impacts against politicians and integrate data from something like OpenSecrets (dark money info) - to see what they're voting on vs being funded by. One step at a time though.",
              "score": 1,
              "created_utc": "2026-02-02 23:30:46",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o36nv6l",
          "author": "TeamThundercock",
          "text": "Not a problem that needs solving. This is an attempt to monetize political unrest. 2/10 final score. Waste",
          "score": -2,
          "created_utc": "2026-02-02 17:02:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o36p5ej",
              "author": "ipromiseimcool",
              "text": "Hey I’m sorry you feel that way! To be clear this is only monetized because I need to pay for server, AI, and api costs for certain data. It didn’t feel right to display ads next to impact assessments. \n\nI’m really inspired by sites like ground.news where it shows both sides of the news. I feel like the only way to move forward as a country is a clearer picture for everyone.",
              "score": 2,
              "created_utc": "2026-02-02 17:08:42",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o37iidj",
                  "author": "TeamThundercock",
                  "text": "Ground news doesn’t need an alternative",
                  "score": 1,
                  "created_utc": "2026-02-02 19:22:14",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qtx2oc",
      "title": "I built a tiny clipboard manager that lives where your cursor is",
      "subreddit": "SideProject",
      "url": "https://v.redd.it/fsvfng23h3hg1",
      "author": "International_Page93",
      "created_utc": "2026-02-02 14:50:44",
      "score": 79,
      "num_comments": 38,
      "upvote_ratio": 0.98,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/SideProject/comments/1qtx2oc/i_built_a_tiny_clipboard_manager_that_lives_where/",
      "domain": "v.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "o370dhc",
          "author": "jss1977",
          "text": "I freaking love this, well done!\n\nHowever... a couple of things which I think would really take it to the next level:\n\n1. I already use PastePal which also has the same Cmd+Shift+V shortcut, which then prevents yours from working. I would suggest a way to set an alternative shortcut.... OR\n\n2. For a truly \"cursor/mouse\" only experience, I would love to just be hold down a key and mouse click to bring up the clipboard menu. This would genuinely make me switch from PastePal as I always find it a bit clunky to have to use 3 key combos and then still click around to get to what I want. Being able to key+click just feels so much more elegant.",
          "score": 8,
          "created_utc": "2026-02-02 18:00:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3753gc",
              "author": "International_Page93",
              "text": "this makes so much sense.   \nI'm prioritizing the key + click idea  \n\\-> which key would feel natural to you? I'll build it for you and make it customizable later.",
              "score": 3,
              "created_utc": "2026-02-02 18:21:16",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o37jjw9",
                  "author": "jss1977",
                  "text": "I think Cmd+Click or Shift+Click would be best (Fn and Ctrl is already used with other apps like WhisprFlow etc)",
                  "score": 1,
                  "created_utc": "2026-02-02 19:27:04",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o36j3jg",
          "author": "mcbootysauce1",
          "text": "love the UX here. i like raycast but sometimes doing the key binding to bring up the clipboard takes me out of the flow",
          "score": 5,
          "created_utc": "2026-02-02 16:40:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o36kcy8",
              "author": "International_Page93",
              "text": "Thanks u/mcbootysauce1, UX was a big focus, so really glad to hear that.   \n  \nIf you give it a try, I'd love to hear your thoughts.  \n  \nthere's definitely room to improve. I'd love to polish every detail.",
              "score": 2,
              "created_utc": "2026-02-02 16:46:28",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o35z9fq",
          "author": "jNayden",
          "text": "Looks good does it work for passwords especially in terminal/iterm2 when have to paste a password for ssh for example?\n\nI was using another clipboard manager but it doesn't work on many terminal places especially passwords so I am looking for replacement",
          "score": 3,
          "created_utc": "2026-02-02 15:07:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o36daoq",
              "author": "International_Page93",
              "text": "Yes, it works in terminal and iterm2, including ssh passwords\n\nLet me know if you try it and run into any issues!",
              "score": 2,
              "created_utc": "2026-02-02 16:14:10",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o37648f",
          "author": "busuta",
          "text": "Hey, I really like the idea! I always wanted an app like this, thank you :)\n\nsome feedback;  \n1- It would be nice to edit what is copied, especially if I want to use it again and again.\n\n2- It would be nice to have customizable tabs. For example, when I lived in another country, I was constantly copy-pasting my name in different a language online. This app would be amazing. The same goes for addresses.\n\n3- A tab with a lock/password would be nice for sensitive information.\n\n4- I would like to pin (keep on top) this window when I'm copy-pasting multiple things. Right now, it closes right away.\n\n5- It would be nice to have an option to choose where this window pops up – either on the left or right side.\n\n6- Maybe ESC can close the window?\n\n7- Maybe a smart tab for links?\n\nthat's all for now, can't wait for the pro version :)",
          "score": 2,
          "created_utc": "2026-02-02 18:25:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o37f366",
              "author": "kkb294",
              "text": "+1 for almost every point 👍",
              "score": 2,
              "created_utc": "2026-02-02 19:06:27",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o37e2hh",
              "author": "International_Page93",
              "text": "Wow, that's a lot of great feedback. Let me go one by one:\n\n1. Do you mean editing the actual content? You can already edit the title from the preview screen or with ⌘R. If you mean the content itself, let me know and I'll look into it.\n\n2. I've been thinking about this as tags, something like \\[#work\\] item\\_title. Is that what you have in mind?\n\n3. Can you tell me more about what you mean? Like hiding the preview for items with a certain tag? Or a password-protected section?\n\n4. I'll look into it. Out of curiosity, have you tried multipaste queues? You can ⌘+click to select multiple items and then hit Enter to paste them in order. Would that cover your use case?\n\n5. Right now it opens to the right when possible, and flips to the left near the screen edge. But a custom option sounds good. adding it to the list.\n\n6. Fixed! It was broken, thanks for catching it. Will ship in the next update -> waiting on one more thing from another user before deploying.\n\n7. You can already search by #link to filter all links, and each link has an \"open in browser\" action in the preview window. What would your ideal flow look like?\n\nI'll ping you when the new version is out with the ESC fix, and keep you updated on the other points I mentioned I'd look into.\n\nThank you so much",
              "score": 1,
              "created_utc": "2026-02-02 19:01:44",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o37j9mp",
                  "author": "busuta",
                  "text": "1- I mean the content. especially pinned means I will use it more. so if I did copy wrongly I need to repeat all the process. Or if I realize later It would be nice to fix it. \n\n2- if I need to use search area to filter tags, thats too much work rather than 1 click.\n\n3- I would like to put my credit card number, or a password. so maybe for that. (just a specific tab with lock)\n\n4- I will check that, but I think it would be nice to have pin on top if I am trying out bunch of colors/hex codes for example\n\n5- thank you\n\n6- thank you\n\n7- thats cool, but also I would like to see tabs :)\n\nperfect, thank you so much!",
                  "score": 1,
                  "created_utc": "2026-02-02 19:25:44",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o37cpg1",
          "author": "MoveOverBieber",
          "text": "Nice!",
          "score": 2,
          "created_utc": "2026-02-02 18:55:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o38dn1o",
              "author": "International_Page93",
              "text": "thank you!",
              "score": 1,
              "created_utc": "2026-02-02 21:49:04",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o35ygbx",
          "author": "CreativeForm3242",
          "text": "Cool !! You knew coding or vibe coding project ?",
          "score": 2,
          "created_utc": "2026-02-02 15:03:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o35z16k",
              "author": "International_Page93",
              "text": "Thank you!  \nmix of vibe coding and normal coding.   \nIf you try it, I'd love to hear any feedback!",
              "score": 3,
              "created_utc": "2026-02-02 15:06:10",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o35zm9g",
                  "author": "CreativeForm3242",
                  "text": "Your welcome ! I will download after a while ! Can you upload a virustotal report ? Or link",
                  "score": 3,
                  "created_utc": "2026-02-02 15:09:07",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o36kvzu",
          "author": "Direct-Attention8597",
          "text": "Love the idea here — a clipboard manager that stays right at your cursor sounds super smooth and focused on workflow 👌.  \nOne thing I’ve noticed in a lot of projects like this (including a few clipboard tools shared recently) is how *context switching* kills flow faster than any missing feature.\n\nSomething that helped me frame this kind of design decision is thinking of progress as *“what did I learn this week?”* instead of *“how many users I got”*.  \nWe actually had a long discussion about this exact topic in r/ShowinPublic  especially how builders deal with slow feedback loops and invisible progress.  \nThought it might resonate here too!",
          "score": 1,
          "created_utc": "2026-02-02 16:48:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o36lpwa",
              "author": "International_Page93",
              "text": "Yes, context switching was the #1 thing I wanted to solve.   \n  \nThat's why Maus shows up right at your cursor instead of a separate window.   \n  \nThank you",
              "score": 1,
              "created_utc": "2026-02-02 16:52:41",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o37r4gz",
          "author": "eiko64",
          "text": "Wow, impressive! How many hours of work did it take to achieve this result?",
          "score": 1,
          "created_utc": "2026-02-02 20:02:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o38e04q",
              "author": "International_Page93",
              "text": "thank you! honestly don't know. I've been working on it at night for a month now.",
              "score": 1,
              "created_utc": "2026-02-02 21:50:47",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o39mo8r",
          "author": "Inevitable-Contact-1",
          "text": "does it have dark mode brother?\n\nlooks sick",
          "score": 1,
          "created_utc": "2026-02-03 01:50:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3aqj0k",
              "author": "International_Page93",
              "text": "Yes, it follows your system appearance automatically.\n\nStill polishing some details there, but it works.\n\nAlso planning to add a toggle so you can choose light/dark independently of your system setting.",
              "score": 1,
              "created_utc": "2026-02-03 06:08:47",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3a391g",
          "author": "elihorne",
          "text": "This is so much fun (love the brand/name too!)",
          "score": 1,
          "created_utc": "2026-02-03 03:25:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3apdm5",
              "author": "International_Page93",
              "text": "Thank you!",
              "score": 1,
              "created_utc": "2026-02-03 05:59:20",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qq9cdb",
      "title": "Launched 4 side projects in 18 months. All solved real problems. Only 1 made money.",
      "subreddit": "SideProject",
      "url": "https://www.reddit.com/r/SideProject/comments/1qq9cdb/launched_4_side_projects_in_18_months_all_solved/",
      "author": "F4rewll",
      "created_utc": "2026-01-29 14:01:35",
      "score": 67,
      "num_comments": 36,
      "upvote_ratio": 0.91,
      "text": "Built 4 different side projects between 2024-2025. All solved genuine problems I validated through interviews. All had paying customers willing to buy. But only 1 actually made consistent money. Took me 18 months to realize the difference wasn't product quality or problem validity. It was whether I could organically reach enough customers without paid ads. First project was CRM for real estate agents. Great product, agents loved it, charged $49/month. Problem was I couldn't reach real estate agents organically. They weren't on Reddit. No searchable keywords brought them. Needed LinkedIn ads or cold calling. Died at $340 MRR after 6 months because I couldn't afford customer acquisition.\n\nSecond project was analytics dashboard for Shopify stores. Solid tool, store owners wanted it. But Shopify app store was saturated. Getting discovered required paid ads competing against funded companies. Made $180 total before quitting. Distribution was impossible without budget.​ Third project was scheduling tool for healthcare clinics. Clinics needed it desperately. But healthcare sales cycle was 3-6 months, required demos, compliance questions, multiple stakeholders. As solo founder working nights, I couldn't handle that sales process. Gave up at 2 customers.​\n\nFourth project was content calendar for newsletter creators. Finally got distribution right. Newsletter creators gathered in 8 active subreddits, 5 Facebook groups, and searched specific keywords on Google. I could reach 10,000+ potential customers organically. Built tool in 5 weeks, launched everywhere they gathered, hit $6,400 MRR in 6 months. [Studied pattern in Founders database comparing side projects that succeeded versus failed](http://foundertoolkit.org). Successful ones had organic distribution channels accessible to solo founders. Failed ones required paid ads, long sales cycles, or access to audiences solo founders couldn't reach. Distribution feasibility mattered more than product-market fit.​\n\nThe framework I wish I knew earlier was validate distribution before building. Can you reach 5,000+ target customers through Reddit, SEO, or communities you access for free? If no, don't build it as side project. Save that idea for when you have budget or team. Submitted successful project to 95+ directories, ranked for buyer keywords within 6 weeks, engaged in communities daily. All free distribution that scaled. Previous 3 projects had no path to customers without spending money I didn't have.\n\nStop building side projects for markets you can't access organically. Start with distribution channels, then build for audiences you can reach.\n\nHow many of your side projects failed because of distribution, not product quality?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/SideProject/comments/1qq9cdb/launched_4_side_projects_in_18_months_all_solved/",
      "domain": "self.SideProject",
      "is_self": true,
      "comments": [
        {
          "id": "o2fgn3j",
          "author": "TemporaryKangaroo387",
          "text": "the framework of \"validate distribution before building\" is honestly underrated, most people do it backwards and wonder why they fail\n\none thing id add tho, the distribution channels themselves are shifting faster than ever now. like 2 years ago ranking for keywords was way easier, now you gotta factor in AI search eating clicks. reddit is still a goldmine but its getting more competitive too as more people catch on\n\nthe healthcare clinic one resonates hard, enterprise sales cycles are basically impossible as a solo founder working nights. by the time you close one deal youre burned out and your runway is gone\n\ncurious what subreddits worked best for the newsletter tool? that niche seems like it would have decent overlap with creator/indie hacker communities",
          "score": 5,
          "created_utc": "2026-01-29 15:50:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2f243e",
          "author": "MuslimKhan3040",
          "text": "due to the increasing amount of accessible apps this would seem realistic as most of them are free and easy to use",
          "score": 1,
          "created_utc": "2026-01-29 14:43:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2gorzf",
              "author": "chieferkieffer",
              "text": "Yeah, the saturation is real. With so many options out there, it really comes down to finding that unique angle or niche where you can actually connect with your audience without breaking the bank on ads.",
              "score": 2,
              "created_utc": "2026-01-29 19:08:31",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2f463m",
          "author": "Vumaster101",
          "text": "How are people distributing through Reddit? I saw something about people set up keywords and they Auto set up replies and stuff like that but I don't know any tools that do that.",
          "score": 1,
          "created_utc": "2026-01-29 14:53:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2f5kdz",
          "author": "centurytunamatcha",
          "text": "nobody warns you that distribution can quietly kill a great idea while you’re blaming yourself for not building well enoughh..",
          "score": 1,
          "created_utc": "2026-01-29 15:00:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2fx1aa",
          "author": "BP041",
          "text": "The healthcare clinic example is painfully relatable. I've seen founders build genuinely excellent B2B products that die because the sales cycle requires demos, procurement processes, and 6+ months of trust-building - impossible for solo founders with day jobs.\n\nYour framework of \"can I reach 5,000+ customers for free?\" is basically asking \"do I have a distribution unfair advantage?\" For most of us, that's Reddit, Twitter, or SEO-able keywords. If your customers aren't in those places, you're fighting uphill.\n\nOne thing I'd add: even within reachable communities, timing matters. Commenting on rising posts in niche subreddits has been way more effective for me than posting my own content. Less competition, better visibility as the post grows.\n\nWhat made you decide to keep trying after the third failure? That's a lot of pivots without giving up entirely.",
          "score": 1,
          "created_utc": "2026-01-29 17:03:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2h63al",
          "author": "maheshv1",
          "text": "This episode by A16Z (top VC company) captures this on what to focus. [https://open.spotify.com/episode/6lDPOsmvBWrxzmZOpyjgVP?si=VpzXC034QJi3sXsTeSF1VQ](https://open.spotify.com/episode/6lDPOsmvBWrxzmZOpyjgVP?si=VpzXC034QJi3sXsTeSF1VQ)",
          "score": 1,
          "created_utc": "2026-01-29 20:30:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2h9zhp",
          "author": "Zealousideal-End3405",
          "text": "Thanks for the enlightenment 🙏🏽",
          "score": 1,
          "created_utc": "2026-01-29 20:49:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2himw3",
          "author": "Altruistic_Minimum94",
          "text": "Super good insight on this. I've failed many times and it's defeating but still trying to keep on going.",
          "score": 1,
          "created_utc": "2026-01-29 21:31:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2exx5a",
          "author": "Twinuno_",
          "text": "I agree - many good ideas but distribution is challenging especially for b2b .  One other way is to start local and have conversations with those users to see what you can build",
          "score": 1,
          "created_utc": "2026-01-29 14:22:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ey8g6",
          "author": "BallerDay",
          "text": "Distribution is king. Big reason why the big guys often end up winning while being late to the party. Great post!",
          "score": 1,
          "created_utc": "2026-01-29 14:23:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ezazu",
          "author": "One_Perspective971",
          "text": "exploring strategies for organic customer acquisition in different niches sound helpful",
          "score": 0,
          "created_utc": "2026-01-29 14:29:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ezbvw",
          "author": "omegadev666",
          "text": "Thanks for this.",
          "score": 0,
          "created_utc": "2026-01-29 14:29:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ezuwu",
          "author": "BeardedWiseMagician",
          "text": "Lesson learned: If you can’t reach buyers cheaply and repeatedly, even great products stall. Validating access to an audience before writing code is the real PMF test now.",
          "score": 0,
          "created_utc": "2026-01-29 14:32:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2f1g34",
          "author": "Jacky-Intelligence",
          "text": "The distribution insight hits hard. It's frustrating how we're taught to obsess over building the perfect product, but nobody talks about the 18-month grind to find buyers. Really appreciate you sharing the specific numbers on what didn't work.",
          "score": 0,
          "created_utc": "2026-01-29 14:40:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2h7ua0",
          "author": "Big_Amphibian1100",
          "text": "Is this a ad?",
          "score": -36,
          "created_utc": "2026-01-29 20:39:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2inu0o",
              "author": "MichaelF-",
              "text": "Yes.",
              "score": 2,
              "created_utc": "2026-01-30 01:03:45",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qq7qfq",
      "title": "I built a tool to check if your website loads properly worldwide (FREE + Open Source)",
      "subreddit": "SideProject",
      "url": "https://v.redd.it/mtr3a97tbagg1",
      "author": "astronaut_611",
      "created_utc": "2026-01-29 12:52:14",
      "score": 67,
      "num_comments": 16,
      "upvote_ratio": 0.98,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/SideProject/comments/1qq7qfq/i_built_a_tool_to_check_if_your_website_loads/",
      "domain": "v.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "o2erq3s",
          "author": "Unusual-Big-6467",
          "text": "Is it a uptime monitor checker from 8 places ? \n\nThe way you worded I thought I will get screenshot of how it displays",
          "score": 3,
          "created_utc": "2026-01-29 13:49:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2f033t",
              "author": "astronaut_611",
              "text": "Gotcha, I can add that actually, would be slightly more time taking tho.\n\nCurious, if this shows screenshots then it would solve a problem for you?",
              "score": 0,
              "created_utc": "2026-01-29 14:33:12",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2f1jcb",
                  "author": "bodiam",
                  "text": "If you want, you could use [https://allscreenshots.com](https://allscreenshots.com), a service I run, which makes screenshots of websites. Ping me if you're interested, happy to help.",
                  "score": 1,
                  "created_utc": "2026-01-29 14:40:29",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2en386",
          "author": "Haunting_Age_2970",
          "text": "Add Web vitals too",
          "score": 2,
          "created_utc": "2026-01-29 13:24:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2ezqm5",
              "author": "astronaut_611",
              "text": "Thanks, would check how can i go about that.",
              "score": 1,
              "created_utc": "2026-01-29 14:31:25",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2enn69",
          "author": "ImaginationSpare8649",
          "text": "https://preview.redd.it/ep34x0bmiagg1.png?width=978&format=png&auto=webp&s=7e8847bbd6ee4eb9996f98d6ba41c841b62fd80a\n\n☹️",
          "score": 1,
          "created_utc": "2026-01-29 13:27:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2epf41",
              "author": "loyoan",
              "text": "That‘s actually wrong. I can open the website from germany.",
              "score": 2,
              "created_utc": "2026-01-29 13:37:27",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2etcd8",
                  "author": "ImaginationSpare8649",
                  "text": "i see, thank you.",
                  "score": 1,
                  "created_utc": "2026-01-29 13:58:11",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o2eztss",
              "author": "astronaut_611",
              "text": "Ohh, does your website blocks proxies in some way?",
              "score": 2,
              "created_utc": "2026-01-29 14:31:54",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2f2qfd",
                  "author": "ImaginationSpare8649",
                  "text": "i'm not sure, maybe because cloudflare",
                  "score": 1,
                  "created_utc": "2026-01-29 14:46:24",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qs3rf5",
      "title": "Everyone's posting 10k MRR screenshots. I made 24. Here's what 30 days actually looks like.",
      "subreddit": "SideProject",
      "url": "https://www.reddit.com/r/SideProject/comments/1qs3rf5/everyones_posting_10k_mrr_screenshots_i_made_24/",
      "author": "Ryland990",
      "created_utc": "2026-01-31 14:28:17",
      "score": 62,
      "num_comments": 74,
      "upvote_ratio": 0.9,
      "text": "30 days ago I had never written a line of code. Today I have 2 apps live on the App Store, 2 apps scrapped, 2 landing pages, and another idea in the works. 52 downloads. $24 in revenue.\n\nI'm posting about it anyway because every AI thread is \"built this SaaS in 3 prompts\" and I sat reading all of it thinking maybe I'm just not cut for this.\n\nHere's the real timeline:\n\n**Days 1-3:** Copied a proven concept (photo cleaner app), used VibeCode to build it, submitted to App Store. Got rejected. Three times. Took 2 weeks to figure out the submission process. Nobody posts about that part.\n\n**Week 2:** Realized you don't use one AI tool—you use five. VibeCode, Windsurf, Claude, Nano Banana, [Aura.build](http://Aura.build), Expo. My monthly bill skyrocketed. Each tool does different things. Trying to use one for everything doesn't work.\n\n**Week 3:** Hit real bugs. State management issues. Gesture conflicts. A fullscreen viewer showing black screens. Spent hours learning why. AI can't debug what you can't explain.\n\n**Week 4:** Remotion came out. Everyone posting \"did this in 5 prompts.\" I spent 3.5 days struggling to understand motion effects and video composition. Still don't understand half of it.\n\nThen marketing. Posted on Reddit. r/iosapps went well. r/digitalminimalism? Permabanned. r/AppHookup? Removed. r/iphone? Blocked.\n\n**The numbers:**\n\n* 2 apps live, 2 scrapped\n* 52 downloads, $24 revenue\n* 1 permaban\n* 3 App Store rejections\n* 0 lines of code I could write from scratch\n\n**What I learned:**\n\nVibe coding is real but limited. The moment something breaks, you need to understand it. Marketing is harder than building—maybe 70% of the work. And $24 is not failure. 52 strangers downloaded something I made.\n\nI'm not quitting my job. I'm not posting \"quit your 9-5\" content. Just going to keep building and see if I can get to $100, then $1,000.\n\nIf you're thinking about starting: don't wait until you know enough. Ship something ugly. Get rejected. Make $24. It's a real start.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/SideProject/comments/1qs3rf5/everyones_posting_10k_mrr_screenshots_i_made_24/",
      "domain": "self.SideProject",
      "is_self": true,
      "comments": [
        {
          "id": "o2sn28z",
          "author": "Quasar_Columba",
          "text": "Don't compare your early days to their year 3.",
          "score": 11,
          "created_utc": "2026-01-31 14:40:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2uls88",
              "author": "sprowk",
              "text": "Dont compare your real revenue to their fake claims\\*",
              "score": 9,
              "created_utc": "2026-01-31 20:23:47",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2uxoh7",
                  "author": "Ryland990",
                  "text": "That is correct, but at the end of the day I need to make it work somehow, otherwise is just another hobby and $ spent",
                  "score": 5,
                  "created_utc": "2026-01-31 21:22:46",
                  "is_submitter": true,
                  "replies": []
                },
                {
                  "id": "o2xa7g8",
                  "author": "letsprogramnow",
                  "text": "I feel this comment but not everyone’s post that is high MRR is a fake claim tbh. We’ll never know whose being honest though",
                  "score": 1,
                  "created_utc": "2026-02-01 05:40:13",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o2spl65",
              "author": "Ryland990",
              "text": "That is so true, feels like everyone is running while I’m still walking 😅",
              "score": 2,
              "created_utc": "2026-01-31 14:54:21",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2sy10u",
          "author": "InternalEchidna2541",
          "text": "People make it sound easy. Not everything is sunshine and rainbows as they show. You made $24, congratulations! You can't have $10K before making $1. I also published my app with 4 months of struggle. Database issues, auth issues, things getting broken out of nowhere... They told me it was easy. Then it clicked. If it was easy, this would not be a thing. People make money off of showing it like it's easy. I launched my app last week and there are only like 5 ysers that I don't know. Rest are friends and family. And building something like this takes a mental toll as well. My own father did not believe in what I was doing and still does not. Couldn't care less, but it makes you question yourself at night sometimes. \n\n$24 is the first fruits of your efforts. Congratulations. I hope you will reach your goals with that.",
          "score": 7,
          "created_utc": "2026-01-31 15:37:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2t3hdh",
              "author": "Ryland990",
              "text": "Thank you so much! Really appreciate your support and I totally feel you! It does take a huge toll on your daily routine and I think the most important aspect is to enjoy the process. (It just some times it does feel like I am not moving the needle in the right direction ) \n\nHow are you doing now ? It’s been a few months, did you manage to discover a few marketing channels ?",
              "score": 2,
              "created_utc": "2026-01-31 16:03:59",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2txkme",
                  "author": "InternalEchidna2541",
                  "text": "I published it to Google Play Store last week. I have a simpler project in my mind, I will do it in February while creating content. I basically press every button, fun content, references to memes, storytelling with journey, advices to people (I am not remotely close to what I want to be but could help beginners by being real with them), aesthetics, etc. mostly short form content, until i get visibility and some kind of an audience. Right now i am just storing videos to share in a week or two to have a window to create more. This is just the beginning, though.\n\nI honestly was scared to even record. I am normally confident, been involved in many projects in Europe so I am kinda experienced with content as I was sharing stuff in my account to show friends funny words that mean different things in my language for example. I have been on live tv as well but i could not start content. wanted to do it for years but something was holding me back. i had to say \\`f- it we ball\\` to start at some point. I was scared of being cringe, not getting views, etc. but you know, the more you f- around, the more you find out. nobody knew what they were doing at the beginning. even me with my own app, i did not know. i still don't know how did i ship it. f- around and find out method made me do it. so i decided to apply the same to content stuff. Reddit is not really a place for distribution, nobody cares and everyone markets their stuff. people got fed of it. X  is overpopulated with build in public. i post once or twice a day because to get views or monetization there you either need to be very lucky or you need to have premium and as an unemployed cs drop out unfortunately it ain't possible. i just try to be me everywhere so that i wont sound like \\`just another one.\\` so i decided to switch my focus to video content as blowing up with even one video can drive thousands of people to my app. \n\nmost important thing i realized was marketing was more important than actual app. and i should not identify myself with my products because if i am interesting enough the product will get the engagement eventually. without me the app would not be there.\n\nanyway, i assume i yapped too much but if there is anything useful for you there, i'm glad to be helpful. \n\nand most importantly, thank you for asking.",
                  "score": 3,
                  "created_utc": "2026-01-31 18:27:35",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2t655t",
          "author": "Public-Salary1289",
          "text": "Love the hustle! It's great you're shipping, but not knowing how to code at all might hold you back in the long run. Just a thought.... also focus on that too",
          "score": 4,
          "created_utc": "2026-01-31 16:16:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2yyk6y",
              "author": "Ryland990",
              "text": "thanks and i think I agree with you right now, that might change though depending on how all these AI tools will evolve. But having a decent understanding would only serve you well in the long run",
              "score": 2,
              "created_utc": "2026-02-01 14:01:02",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2zfswi",
                  "author": "Public-Salary1289",
                  "text": "agree! these AI tools may even evolve more, so that there will be no need to learn anymore...",
                  "score": 1,
                  "created_utc": "2026-02-01 15:32:14",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2spmf8",
          "author": "curlymonster1911",
          "text": "What did you do that got banned/blocked on those channels?",
          "score": 5,
          "created_utc": "2026-01-31 14:54:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2stj15",
              "author": "Ryland990",
              "text": "I posted without reading the rules… made a post one evening and discovered the “crosspost” button… big mistake 😆  also was not an active contributor to the channels either (which some times would give some lenience)",
              "score": 4,
              "created_utc": "2026-01-31 15:15:09",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2sug5h",
          "author": "Southern-Movie-3913",
          "text": "How to you get the perfect idea which will work out ??",
          "score": 5,
          "created_utc": "2026-01-31 15:19:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2sxekp",
              "author": "Quasar_Columba",
              "text": "You discover those by working on other stuff. Just build and you will see many problems to be solved.",
              "score": 3,
              "created_utc": "2026-01-31 15:34:37",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2uy1qt",
                  "author": "Ryland990",
                  "text": "That is also my general assumption, however, it can become harder at times because I don’t see much progress… maybe I I forgot how is to start from ground up",
                  "score": 1,
                  "created_utc": "2026-01-31 21:24:33",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            },
            {
              "id": "o2sycf9",
              "author": "InternalEchidna2541",
              "text": "You don't wait for perfect. You will never have perfect conditions. If what you have as an idea is built already, make it better. Combine things and offer what your competitors can't.",
              "score": 2,
              "created_utc": "2026-01-31 15:39:12",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o2t499o",
              "author": "Ryland990",
              "text": "I didn’t find a perfect idea tbh, I just want to test something that is validated. In this way I can see where I am doing mistakes and what I need to figure out (if that makes any sense )",
              "score": 1,
              "created_utc": "2026-01-31 16:07:46",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2t6t54",
          "author": "Ok_Veterinarian446",
          "text": "Its absolutely the same with everything AI related. People are posting nonsense all around. Reminds me of crypto hype 2016-2017. Buy this and wake up millionaire. Might have happened for 10< ppl. Or more. Can’t prove exact statistics. But as a person who worked on 200+ SEO projects i can say: everything that looks too easy or too cheap is actually 10 times more expensive and 100 times harder than on those bs hooks which only goal is to drive engagement in socuals. I will never forget a post on fb, of a person creating children songs on youtube, for youtube kids. He had some 5min video explaining the process. Looked super simple. You generate images, animate them with hailuo, create the song with suno, edit with capcut, that all absolutely free and done in 20min, than those videos get viral on YT kids and you start earning day 3(thats what the person on the video explained). During this time when i watched this, i was actually on a holiday with friends(nerds, playing games in a distinct area in the mountain). So we collectively decided to try. Started the process. We created our first polished song after roughly 7 hours of collective efforts. It was a complete mess but looked similar to the one on the video. We created YT channel.(Would not even mention that due to limitations it costed us roughly 120$ for all the tools simply coz if we did not paid that, it would take is 170 hours only using free versions). So far, so good. The channel was live, the song uploaded, everything set as explained on the video. 24h later. Total 17 views. Most likely 16 of them were from the people who participated. Since im quite a dedicated person when i decide to create something(project, side hustle etc) during the course of the next 60 days(i managed to polish the process to roughly an hour a day for a song), posting 1 song a day, the final result was: 17 subscribers, net 600 views on YT.\nlesson learned the hard way.",
          "score": 2,
          "created_utc": "2026-01-31 16:20:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2uxab5",
              "author": "Ryland990",
              "text": "Wow, that was a lot to unpack, and let me say this, you’re writing skills are top! That was a long story and these days ( sometimes myself including) people tent to lose the topic of the story. \n\nThat said, I completely agree, I didn’t get into this thinking it was easy, I tried before in the dropshipping era, things were a lot more harder, tools lot less polished! This whole AI trend brings me back to that era on which I was too late! But now is a different story, the building aspect was reduced to a matter of days, and if I manage to get the marketing part right, you’ll have a real business in front of you of you. \n\nNot hoping to make millions but to increase my living standard yes, if I can keep being consistent",
              "score": 2,
              "created_utc": "2026-01-31 21:20:50",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2uxc95",
                  "author": "Ryland990",
                  "text": "Really appreciate your feedback 🙏",
                  "score": 2,
                  "created_utc": "2026-01-31 21:21:06",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2ucsj9",
          "author": "Dependent_Horror2501",
          "text": "Honestly, using AI when you know how to code is quite difficult itself. Having it write code you already understand like test code is pretty simple, but when I use code I don't fully understand, it always ends up awful and I spend more time debugging the issue than had I just wrote it myself.",
          "score": 2,
          "created_utc": "2026-01-31 19:39:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2v8iqz",
              "author": "Ryland990",
              "text": "so i have no idea how to code, however I noticed that if I tackle everything step by step I generally get pretty good results",
              "score": 1,
              "created_utc": "2026-01-31 22:16:06",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2uep7g",
          "author": "Elhadidi",
          "text": " Marketing was the hardest for me too—this quick AI-driven SEO blog post workflow helped me churn out content and get more traction: [https://youtu.be/sqynh-jtDOM](https://youtu.be/sqynh-jtDOM)",
          "score": 2,
          "created_utc": "2026-01-31 19:48:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2v84ky",
              "author": "Ryland990",
              "text": "thanks a lot for the feedback! That is exactly what I was working on last night... I added blog posts to my landing page related to the topic my app is trying to solve hoping that over time will rank up in google. Slow process but curious how is that gonna work over time",
              "score": 1,
              "created_utc": "2026-01-31 22:14:07",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2v7nuh",
          "author": "Common-Quiet-7054",
          "text": "Marketing is 70% of the work. The other 90% is easy.",
          "score": 2,
          "created_utc": "2026-01-31 22:11:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2vd1el",
              "author": "Ryland990",
              "text": "totally agree... with AI helping to create products so fast, the main difficulty remains marketing",
              "score": 1,
              "created_utc": "2026-01-31 22:39:17",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2smdnd",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 4,
          "created_utc": "2026-01-31 14:36:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2sov9o",
              "author": "Ryland990",
              "text": "Thank you ☺️",
              "score": 1,
              "created_utc": "2026-01-31 14:50:28",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2t1hwo",
          "author": "HovercraftLow6610",
          "text": ".",
          "score": 1,
          "created_utc": "2026-01-31 15:54:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2t4c2j",
              "author": "Ryland990",
              "text": "What do you mean",
              "score": 1,
              "created_utc": "2026-01-31 16:08:09",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2thsa8",
                  "author": "HovercraftLow6610",
                  "text": "I'm gonna read this post when I get free. I will just navigate to my profile for the comment.\nAnyways great work!! 😸",
                  "score": 2,
                  "created_utc": "2026-01-31 17:12:28",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2t1suv",
          "author": "saasbruh",
          "text": "I thought you meant like you made 24 posts about making $10k MRR LOL",
          "score": 1,
          "created_utc": "2026-01-31 15:55:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2t28zy",
              "author": "Ryland990",
              "text": "Oh no no, I wish that would be the case! I am not allowed to use $ sign in the title of the post….",
              "score": 1,
              "created_utc": "2026-01-31 15:58:02",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2vivnf",
          "author": "ForeverFellingTrees",
          "text": "Why did you only link aura build and not the others? Ad",
          "score": 1,
          "created_utc": "2026-01-31 23:10:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2wv8as",
              "author": "Ryland990",
              "text": "I had no clue it got linked tbh! If you’re thinking if I built that and pushing it gently with this post, I wish! 😂",
              "score": 1,
              "created_utc": "2026-02-01 03:55:28",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2vl83d",
          "author": "its_deego",
          "text": "Good stuff, keep going",
          "score": 1,
          "created_utc": "2026-01-31 23:23:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2wus05",
              "author": "Ryland990",
              "text": "Thanks )",
              "score": 1,
              "created_utc": "2026-02-01 03:52:27",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2y8sc5",
          "author": "Queasy-Tomorrow-2543",
          "text": "These are the kinds of honest take needed to help others see the reality. Thanks for sharing.",
          "score": 1,
          "created_utc": "2026-02-01 10:48:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2ya8ml",
              "author": "Ryland990",
              "text": "thank you as well! is refreshing to see that this resonates with soo many people",
              "score": 1,
              "created_utc": "2026-02-01 11:01:31",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2ydfrt",
          "author": "AnonymousVendetta04",
          "text": "Only the successful ones flaunt, the rest are quiet. Thats why we have such a skewed perception of the app market.",
          "score": 1,
          "created_utc": "2026-02-01 11:30:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2yy8rh",
              "author": "Ryland990",
              "text": "it's the same story with anything, right ? like the iceberg pic, most see only the success but not enough talked about all the failures that led to the success. Social media is specially good at that lol",
              "score": 1,
              "created_utc": "2026-02-01 13:59:10",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2z1xrk",
                  "author": "AnonymousVendetta04",
                  "text": "Yup ahaha but honestly they do get to me sometimes given I have projects that seem like failure as of yet and I see others succeeding with some dumb app that is a braindead copy of some other successful app haha",
                  "score": 1,
                  "created_utc": "2026-02-01 14:20:23",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qtuqns",
      "title": "Launched 4 side projects in 18 months. All solved real problems. Only 1 made money.",
      "subreddit": "SideProject",
      "url": "https://www.reddit.com/r/SideProject/comments/1qtuqns/launched_4_side_projects_in_18_months_all_solved/",
      "author": "ProfessionalLast4311",
      "created_utc": "2026-02-02 13:15:49",
      "score": 61,
      "num_comments": 45,
      "upvote_ratio": 0.83,
      "text": "Built 4 different side projects between 2024-2025. All solved genuine problems I validated through interviews. All had paying customers willing to buy. But only 1 actually made consistent money. Took me 18 months to realize the difference wasn't product quality or problem validity. It was whether I could organically reach enough customers without paid ads. First project was CRM for real estate agents. Great product, agents loved it, charged $49/month. Problem was I couldn't reach real estate agents organically. They weren't on Reddit. No searchable keywords brought them. Needed LinkedIn ads or cold calling. Died at $340 MRR after 6 months because I couldn't afford customer acquisition.\n\nSecond project was analytics dashboard for Shopify stores. Solid tool, store owners wanted it. But Shopify app store was saturated. Getting discovered required paid ads competing against funded companies. Made $180 total before quitting. Distribution was impossible without budget.​ Third project was scheduling tool for healthcare clinics. Clinics needed it desperately. But healthcare sales cycle was 3-6 months, required demos, compliance questions, multiple stakeholders. As solo founder working nights, I couldn't handle that sales process. Gave up at 2 customers.​\n\nFourth project was content calendar for newsletter creators. Finally got distribution right. Newsletter creators gathered in 8 active subreddits, 5 Facebook groups, and searched specific keywords on Google. I could reach 10,000+ potential customers organically. Built tool in 5 weeks, launched everywhere they gathered, hit $6,400 MRR in 6 months. [Studied pattern in Founders database comparing side projects that succeeded versus failed](http://foundertoolkit.org). Successful ones had organic distribution channels accessible to solo founders. Failed ones required paid ads, long sales cycles, or access to audiences solo founders couldn't reach. Distribution feasibility mattered more than product-market fit.​\n\nThe framework I wish I knew earlier was validate distribution before building. Can you reach 5,000+ target customers through Reddit, SEO, or communities you access for free? If no, don't build it as side project. Save that idea for when you have budget or team. Submitted successful project to 95+ directories, ranked for buyer keywords within 6 weeks, engaged in communities daily. All free distribution that scaled. Previous 3 projects had no path to customers without spending money I didn't have.\n\nStop building side projects for markets you can't access organically. Start with distribution channels, then build for audiences you can reach.\n\nHow many of your side projects failed because of distribution, not product quality?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/SideProject/comments/1qtuqns/launched_4_side_projects_in_18_months_all_solved/",
      "domain": "self.SideProject",
      "is_self": true,
      "comments": [
        {
          "id": "o35ivy0",
          "author": "MuslimKhan3040",
          "text": "this hits hard. twitter makes it feel like you’re one tactic away from breakout growth, when in reality most of those threads are just recycled anecdotes without numbers.",
          "score": 5,
          "created_utc": "2026-02-02 13:39:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3cynsf",
          "author": "virgin_dietcoke",
          "text": "the \"real problem + willing buyers ≠ revenue\" thing is so true\n\nive had 3 projects where people said theyd pay then ghosted when i launched. distribution and positioning matter more than product quality in the first 90 days\n\nwhat made the difference for your 1 successful project? was it the market or how you positioned it?\n\nfor me using giga create app to ship faster helped cause i could test 3 ideas in the time it used to take me to build 1. more shots on goal = better odds of finding the winner",
          "score": 2,
          "created_utc": "2026-02-03 15:53:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3db3xn",
              "author": "Ok_Stay_8530",
              "text": "curious what is giga? do you build a full product?",
              "score": 1,
              "created_utc": "2026-02-03 16:51:36",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o366n2v",
          "author": "MetricCreator",
          "text": "Looks cool! How long did it take you to build this?",
          "score": 1,
          "created_utc": "2026-02-02 15:43:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o378lle",
          "author": "Ok_Row9465",
          "text": "Curious if you have a concrete workflow to validate “I can reach \\~5k people organically” before writing code.\n\nStuff like:\n\n\\- how you estimate reachable audience on Reddit (subs, post frequency, what tends to get upvoted, etc.)  \n\\- how you sanity check SEO (keyword intent, difficulty, how many pages you’d realistically ship)  \n\\- what signals make you say “this channel is actually accessible for a solo founder”\n\nBTW, building that distribution map feels like a side project in itself. Ever thought of building that?",
          "score": 1,
          "created_utc": "2026-02-02 18:37:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3845k7",
          "author": "Kindly_Subject",
          "text": "Yep. Distribution is the real gate. A great product in a place you can’t reach is basically invisible as a side project.",
          "score": 1,
          "created_utc": "2026-02-02 21:04:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o384tc0",
          "author": "stormlightz",
          "text": "sell before build",
          "score": 1,
          "created_utc": "2026-02-02 21:07:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o39uzn9",
          "author": "originx_games",
          "text": "How do you post in these communities? I also have a product but as I try to post either my post gets deleted or i account gets banned",
          "score": 1,
          "created_utc": "2026-02-03 02:37:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3aqaub",
          "author": "Then-Boysenberry2064",
          "text": "real",
          "score": 1,
          "created_utc": "2026-02-03 06:06:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o35p1tf",
          "author": "bradium",
          "text": "This matches my experience exactly. The validate distribution before building framework would have saved me months on my first project. I built a tool that users loved but my target customers were scattered across LinkedIn, which meant paid ads or cold outreach.\n\nMeanwhile a simpler tool I built later for content creators took off because they all congregated in the same subreddits and Discords. The difference wasnt the quality of the product, it was whether I could reach them daily without spending money.\n\nNow I literally ask myself before any project: where do these people already hang out online, and can I get in front of them for free? If I cant answer that clearly, I dont build it.",
          "score": 1,
          "created_utc": "2026-02-02 14:14:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o38gquv",
              "author": "BlueberryMany7641",
              "text": "The main thing you nailed is turning “where do they hang out and can I reach them daily?” into a hard gate before you write code.\n\n\n\nOne extra layer that’s helped me is scoring ideas on 3 things before I start: 1) reachable audience size (subs, Discords, newsletters, search volume), 2) how often they experience the pain (daily > weekly > monthly), 3) how easy it is to show proof of value in a screenshot or 30s Loom. If a project doesn’t hit at least 2/3 high, I park it.\n\n\n\nThen I do a 1–2 week “distribution sprint” before building: post problem-focused questions, share a barebones Notion mock, pre-sell with a Stripe link, and see if I can get 5–10 people to pay or commit to a call. If that fails, that’s my signal, not a challenge.\n\n\n\nOn tools, I’ve used things like Sparktoro and TweetHunter to find active pockets, and Pulse for Reddit plus normal Reddit search to catch high-intent threads where my users are already ranting.\n\n\n\nMain point: treat easy, repeatable access to the same people as a non-negotiable prerequisite, not a nice bonus.",
              "score": 2,
              "created_utc": "2026-02-02 22:03:55",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o362m4n",
              "author": "Ryland990",
              "text": "I am also facing a similar situation, and the fact that your target customers are scattered can also be an opportunity, right ? It can be that that niche is less competitive because of that exact reason",
              "score": 1,
              "created_utc": "2026-02-02 15:23:52",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o35visv",
          "author": "OkSatisfaction1845",
          "text": "This is a masterclass in why \"Distribution-First\" is becoming the standard for bootstrapped founders. Your experience with the real estate CRM perfectly illustrates the \"CAC (Customer Acquisition Cost) vs. LTV (Lifetime Value)\" trap. If the only way to reach your audience is through high-intent paid channels or manual outreach, it’s nearly impossible to scale a $49/month product without significant funding.\n\n\n\nIt’s refreshing to see someone acknowledge that a \"great product\" isn't enough if the unit economics of discovery don't work. Now that you've identified organic reach as your primary filter, how has your vetting process changed for the ideation phase? Do you now discard ideas immediately if they don't have a clear \"watering hole\" (like a specific subreddit or niche community) where you can build presence for free?",
          "score": 1,
          "created_utc": "2026-02-02 14:48:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o35y0dy",
          "author": "DobroMoutro",
          "text": "Another shameless ad for that toolkit…",
          "score": -28,
          "created_utc": "2026-02-02 15:01:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o35lf5v",
          "author": "Bading_na_green_Flag",
          "text": "do you think SEO and communities always win, or is that just because you stuck with them longer?",
          "score": 0,
          "created_utc": "2026-02-02 13:54:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o35t4ih",
              "author": "ProfessionalLast4311",
              "text": "partly time, but mostly intent. people searching or actively discussing a problem are already halfway to buying. everything else felt like interrupting strangers.",
              "score": 0,
              "created_utc": "2026-02-02 14:35:45",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o361ltf",
                  "author": "Ryland990",
                  "text": "This is solid advice!",
                  "score": 0,
                  "created_utc": "2026-02-02 15:18:56",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o35pwvj",
          "author": "bleach3434",
          "text": "the amount of hours people sink into “trying everything” without tracking conversions is wild. engagement feels productive until you check revenue and nothing moved.",
          "score": 0,
          "created_utc": "2026-02-02 14:18:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o35v2s7",
          "author": "droneandron",
          "text": "How did you find people for interviews to validate the idea? And much did you pay them to to talk to you?",
          "score": 0,
          "created_utc": "2026-02-02 14:45:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3620je",
          "author": "Ryland990",
          "text": "Great take on this ! How long did it take for SEO to take off ? Anything advice rankings? \n\nDid you also consider GEO ? Seems to get quite a buzz lately",
          "score": 0,
          "created_utc": "2026-02-02 15:20:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3666qe",
          "author": "ruibranco",
          "text": "The \"can you reach 5,000+ target customers for free\" filter is brutal but honest. I wasted months on a dev tool that was genuinely useful but targeted a niche that basically doesn't hang out anywhere online. No subreddits, no active forums, no searchable keywords. Great product, zero organic reach. Meanwhile a simpler tool I built for a community I was already active in got traction in weeks just from posting where those people already were.",
          "score": 0,
          "created_utc": "2026-02-02 15:41:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o36uzi9",
          "author": "Elhadidi",
          "text": " I've been in the same boat with organic reach. Automating SEO blog posts with this free n8n workflow really helped me rank buyer keywords faster—might be worth checking out: [https://youtu.be/sqynh-jtDOM](https://youtu.be/sqynh-jtDOM)",
          "score": 0,
          "created_utc": "2026-02-02 17:35:41",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qqmzup",
      "title": "My side project from this community hit 10M messages. I quit my job to go all in.",
      "subreddit": "SideProject",
      "url": "https://v.redd.it/mf2fx5ogwcgg1",
      "author": "KingRushiSushi",
      "created_utc": "2026-01-29 22:19:08",
      "score": 57,
      "num_comments": 43,
      "upvote_ratio": 0.91,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/SideProject/comments/1qqmzup/my_side_project_from_this_community_hit_10m/",
      "domain": "v.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "o2jl54m",
          "author": "zeros-and-1s",
          "text": "aside from everything else... how the hell did you get that domain?",
          "score": 10,
          "created_utc": "2026-01-30 04:13:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2kmj6q",
              "author": "KingRushiSushi",
              "text": "got lucky! super grateful",
              "score": 2,
              "created_utc": "2026-01-30 09:05:49",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o2kd3u2",
              "author": "jrbp",
              "text": "A load of $$$ I'm guessing! But very surprised it was available",
              "score": 0,
              "created_utc": "2026-01-30 07:40:44",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2i89ff",
          "author": "gregb_parkingaccess",
          "text": "Is this with your company or did you go off on your own?",
          "score": 3,
          "created_utc": "2026-01-29 23:39:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2igny7",
              "author": "KingRushiSushi",
              "text": "it’s my own!",
              "score": 3,
              "created_utc": "2026-01-30 00:25:27",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2iey07",
          "author": "gmdmd",
          "text": "Pretty cool concept.. I wonder if something like this would work for my stock market investing signal group chat, but to keep track of when people say they are buying/selling etc.",
          "score": 2,
          "created_utc": "2026-01-30 00:16:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2igvp9",
              "author": "KingRushiSushi",
              "text": "hmmm fascinating use case, we are working on memory piece. this could potentially work! are you able to give me a example? \n\nmaybe i can even tweak if it supports your use case perhaps",
              "score": 3,
              "created_utc": "2026-01-30 00:26:36",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2ihwi1",
                  "author": "gmdmd",
                  "text": "Hmmm not sure.  It usually goes something like.. \n\nMe:hey anyone jumping on this copper bandwagon.  \n\nMy friend: yeah I bought a bunch.  \n\nMe: what the heck why didn't you tell me\n\nFriend: I did (show message from a few weeks back).\n\nAlso a lot of us are super busy (doctors etc) and the messages can get overwhelming in number so sometimes it would be nice to be able to summarize or notified when someone is actually making a buy.\n\n...\n\nmight be more of a vitamin than a pain killer for our use case though..",
                  "score": 1,
                  "created_utc": "2026-01-30 00:32:04",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2iy1fu",
          "author": "SaltPhotograph8506",
          "text": "epic! Can I feature your product for free in my newsletter?\n\nWe have 45k subs:\n\n[https://launch-llama.beehiiv.com/](https://launch-llama.beehiiv.com/)",
          "score": 2,
          "created_utc": "2026-01-30 02:00:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2iyyy9",
              "author": "KingRushiSushi",
              "text": "sure! go for it. \n\nlink me once it’s up :)",
              "score": 1,
              "created_utc": "2026-01-30 02:05:58",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2izk98",
                  "author": "SaltPhotograph8506",
                  "text": "DM you 🙂",
                  "score": 1,
                  "created_utc": "2026-01-30 02:09:19",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2iz7ii",
          "author": "Vegetable_Ease_5515",
          "text": "So you were spying on people's conversations?",
          "score": 2,
          "created_utc": "2026-01-30 02:07:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2izxhf",
              "author": "KingRushiSushi",
              "text": "conducted tons of user interviews and sent out surveys, that shaped my understanding of how people were using the product",
              "score": 1,
              "created_utc": "2026-01-30 02:11:22",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2jgjyo",
                  "author": "Fluffy-Extent2648",
                  "text": "Fair enough, that is what I was expecting you to say, but you never know. Congrats!",
                  "score": 2,
                  "created_utc": "2026-01-30 03:44:58",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2n4hqg",
          "author": "One_Tie900",
          "text": "You are able to read peoples conversations?",
          "score": 2,
          "created_utc": "2026-01-30 17:49:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2n89tm",
              "author": "KingRushiSushi",
              "text": "nope. im big on privacy and security as much as i can. your profile and convos encrypted",
              "score": 1,
              "created_utc": "2026-01-30 18:06:07",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2n9n2r",
                  "author": "One_Tie900",
                  "text": "So you only have access to the questions they ask? Do you use anything for advertising? How do you make money or is this more non profit tool.",
                  "score": 2,
                  "created_utc": "2026-01-30 18:12:03",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2iul2y",
          "author": "served_it_too_hot",
          "text": "How did get your first users?\n\nEdit - typo",
          "score": 1,
          "created_utc": "2026-01-30 01:41:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2iys1u",
              "author": "KingRushiSushi",
              "text": "honestly, the first users were simply friends and family. eventually it was useful enough where naturally word of mouth started happening. \n\ni also posted on this community to show my project and a few others to get feedback. then slowly it was increasing",
              "score": 1,
              "created_utc": "2026-01-30 02:04:55",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2jl0tt",
          "author": "flashmatrix",
          "text": "Thanks for sharing. Times have changed from a year ago and with the fast moving pace of AI tools, the barrier to build is low but barrier for distribution is still high. it might even be harder now because of the over saturation of apps that are being built. With the knowledge you've accumulated over the year, do you have any tips for new builders today?",
          "score": 1,
          "created_utc": "2026-01-30 04:12:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2kmrpj",
              "author": "KingRushiSushi",
              "text": "i would say thinking critically through your product makes you stand out quite easily. building is relatively easy but what to build still requires depth and clear thinking. most people falter at the latter\n\nhave fun building, try out bunch of things, and best of all talk to users and try to understand their problems. that usually helps guide your north star",
              "score": 2,
              "created_utc": "2026-01-30 09:07:57",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2jl8ao",
          "author": "DiesesInternet",
          "text": "Amazing and I hope to see you succed, but I fear people are really going to hate to have another Messenger. Alfi should be able to be added to a whatsapp group chat as a workaround. People then get to know the usefullness driving them organicly to the app.",
          "score": 1,
          "created_utc": "2026-01-30 04:13:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2kmxm5",
              "author": "KingRushiSushi",
              "text": "alfi is already available on sms, imessage, and whatsapp. unfortunately whatsapp group is blocked by their walled garden. hence our response. we’ll just make it and we’ll make it 10x better\n\nwe are still using 2012 tools to manage our 2026 social life. time for an upgrade! a meaningful one too :)",
              "score": 1,
              "created_utc": "2026-01-30 09:09:26",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2jwp2x",
          "author": "OkRespect7678",
          "text": "This is one of the best pivot stories I've read here. The insight about group chats being \"where plans go to die\" is so relatable - I've lost count of how many dinner plans have just faded into \"we should totally do this sometime\" oblivion.\n\n  \nReally curious about the transition from [text.ai](http://text.ai) to Alfi - what was the hardest part of letting go of the original product direction when you had 10M messages and clear traction? That's a tough call to make even when the data is pointing you somewhere new.\n\n  \nAlso love that you're keeping it small (1-8 people). So many social apps try to scale to everyone and lose what made them special. Best of luck with the launch!",
          "score": 1,
          "created_utc": "2026-01-30 05:29:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2knerd",
              "author": "KingRushiSushi",
              "text": "quite a bit was challenging but i would say thinking through first principles helped me quite a bit\n\ni always asked what are the assumptions we make when building for consumer messaging and what is lacking today, turns out there is quite a bit of room for improvement across systems. most of the messaging apps we use today are either default or well over a decade old. we’ve forgotten to make consumer apps fun and meaningful \n\nappreciate your kind support. hope you get a chance to try out Alfi",
              "score": 1,
              "created_utc": "2026-01-30 09:13:51",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2khwpg",
          "author": "OldNeedleworker5869",
          "text": "How did you get the distribution in good shape?",
          "score": 1,
          "created_utc": "2026-01-30 08:23:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2knhjx",
              "author": "KingRushiSushi",
              "text": "we started off with sms, so basically users didn’t need to download anything. simply text a number. low barrier to trying the product helps quite a bit. \n\nwe still use that today!",
              "score": 1,
              "created_utc": "2026-01-30 09:14:35",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2kka2l",
          "author": "TightPublic3143",
          "text": "Seems an incredible project! If you're searching for a software engineer to give you a hand feel free to DM me",
          "score": 1,
          "created_utc": "2026-01-30 08:45:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2knmws",
              "author": "KingRushiSushi",
              "text": "dm me, happy to take a look",
              "score": 1,
              "created_utc": "2026-01-30 09:15:55",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2kks9y",
          "author": "singleandavailable",
          "text": "What if you have no friends?",
          "score": 1,
          "created_utc": "2026-01-30 08:49:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2knlxf",
              "author": "KingRushiSushi",
              "text": "you can message Alfi directly as well. doesn’t have to be only with friends\n\nor you can message the Alfi team on there, we can be friends :)",
              "score": 1,
              "created_utc": "2026-01-30 09:15:41",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2kvv03",
                  "author": "singleandavailable",
                  "text": "\"Alfi, why is the Alfi team still in my living room eating all my chips. Tell them to go home it's well past midnight\"",
                  "score": 1,
                  "created_utc": "2026-01-30 10:30:19",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2koduk",
          "author": "AlekGir",
          "text": "Congrats on hitting 10M messages and going full-time! The insight about group chats being your real social network is spot on. Excited to see where you take Alfi next. Best of luck! 🚀",
          "score": 1,
          "created_utc": "2026-01-30 09:22:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2vwvjh",
          "author": "Lumpy-Low-6509",
          "text": "That's super cool - I liked the marketing / design as well. How did you create the app video demo you posted here?",
          "score": 1,
          "created_utc": "2026-02-01 00:28:31",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qp6mek",
      "title": "My budgeting app flopped after a year of work. What I built next made money in weeks.",
      "subreddit": "SideProject",
      "url": "https://www.reddit.com/r/SideProject/comments/1qp6mek/my_budgeting_app_flopped_after_a_year_of_work/",
      "author": "VivienMahe",
      "created_utc": "2026-01-28 09:19:03",
      "score": 53,
      "num_comments": 38,
      "upvote_ratio": 0.78,
      "text": "So last year I spent 12 months on a budgeting app. Clean UI, solid features, I was pretty proud of it honestly.\n\nTotal users: 1. Yep.\n\n15 years as a developer. I can build stuff. Marketing though? No clue.\n\nLooking back it's obvious why it failed. Crowded market, nothing special about it, and I just built what I wanted. Not what anyone asked for. B2C with no audience is rough.\n\nAnyway. I took a break and thought about what I actually know that people would pay for.\n\nAnd it was right there. I've been building mobile apps for years. Every single project I end up rebuilding the same crap: auth, push notifications, payments, CI/CD. Takes weeks before you even start on actual features.\n\nSo I just packaged all that into a [starter kit](https://www.kmpship.app/) for other devs.\n\nLaunched mid-June last year. Got customers in the first week. Hit $1k in 3 months. Now almost at $3k. Still early but that's more than the budgeting app made in a year lol.\n\nIt's a mobile app starter kit for Kotlin Multiplatform. One guy said it saved him 50+ hours. Another made back 4x the cost within weeks of shipping his app. (Way more satisfying than a budgeting app nobody used 😅)\n\nOne more thing. Kotlin Multiplatform is becoming a serious option next to React Native and Flutter. But almost no one is building tooling for it yet. So I figured why not be early. Worst case I learned a lot. Best case I'm one of the few options when KMP blows up.\n\nAnyway, curious what you guys think. Open to feedback or if anyone's worked with KMP I'd love to hear how it went.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/SideProject/comments/1qp6mek/my_budgeting_app_flopped_after_a_year_of_work/",
      "domain": "self.SideProject",
      "is_self": true,
      "comments": [
        {
          "id": "o27czyr",
          "author": "Dapper_Air_3956",
          "text": "Very insightful!\n\nYou changed your point of view and it paid off! Thanks for sharing.",
          "score": 6,
          "created_utc": "2026-01-28 12:39:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o27hd2z",
              "author": "VivienMahe",
              "text": "Thank you! Yes exactly, it was necessary to avoid another fail.",
              "score": 1,
              "created_utc": "2026-01-28 13:07:00",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2aw1wp",
          "author": "Low_Mistake_7748",
          "text": "\\*something about shovels during a gold rush\\*",
          "score": 6,
          "created_utc": "2026-01-28 22:22:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2ayvab",
              "author": "VivienMahe",
              "text": "You couldn't have said it better!",
              "score": 3,
              "created_utc": "2026-01-28 22:36:15",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o279zi0",
          "author": "finah1995",
          "text": "Let me say with Microsoft being Microsoft, you might make lot of💰.\n\nfew of developers in .net, want native apps to link back to their .net based systems and they are not exactly thrilled with how Microsoft going about with cross-platform dev.",
          "score": 2,
          "created_utc": "2026-01-28 12:19:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o27bhc1",
              "author": "VivienMahe",
              "text": "I am not sure what Microsoft is doing with .NET but it is true that we don't really see them on the cross-platform market for now.\n\nIt is true that I have no problem trusting JetBrains (the company behind KMP and CMP) going in the right direction!",
              "score": 2,
              "created_utc": "2026-01-28 12:29:49",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o28le9h",
          "author": "brennhill",
          "text": "I love the inspiration. I'm working now on another side project. First few side projects flopped. One \"made money\" but not enough to be anywhere worth it and doing the necessary support was rough.  Taught me a ton though.  Gotta keep pushing and building.  Enjoy the journey.",
          "score": 2,
          "created_utc": "2026-01-28 16:21:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o291gr7",
              "author": "VivienMahe",
              "text": "Oh yeah, I totally get it. We have to try, fail and iterate until something works. Because we learn so much along the way, that we are less and less likely to fail.\n\nThank you, you too!",
              "score": 2,
              "created_utc": "2026-01-28 17:31:37",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2ddgiq",
          "author": "letsprogramnow",
          "text": "I feel this. First 8 projects, one each year flopped. Never made more than $100.\n\nThen 2025 Jan I release an app and then $2k first month. \n\nIt’s been a year and it’s still doing great",
          "score": 2,
          "created_utc": "2026-01-29 07:15:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2deuxw",
              "author": "VivienMahe",
              "text": "I think this is a very common pattern amongst solopreneurs. We need to fail first then learn from it before finally succeeding.",
              "score": 2,
              "created_utc": "2026-01-29 07:27:16",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2dff2z",
                  "author": "letsprogramnow",
                  "text": "Yup. I think back often. A very young naive person eager to make their first dollar and thought they knew it all!\n\nTurns out I knew nothing but now I do",
                  "score": 2,
                  "created_utc": "2026-01-29 07:32:13",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o2u9hti",
              "author": "eividass",
              "text": "You probably wouldn't be where you are now without those failed projects, the necessary learning steps most of us take. Congrats on the success!",
              "score": 1,
              "created_utc": "2026-01-31 19:23:59",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o28c43x",
          "author": "Gamingleaguesxyz",
          "text": "Ship fast?",
          "score": 1,
          "created_utc": "2026-01-28 15:41:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o28ib5t",
              "author": "VivienMahe",
              "text": "You could say it is the Ship Fast of mobile apps if you want.",
              "score": 1,
              "created_utc": "2026-01-28 16:08:20",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o28deji",
          "author": "focused_reddit",
          "text": "what was the budgeting app? im curious",
          "score": 1,
          "created_utc": "2026-01-28 15:47:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o28i6lz",
              "author": "VivienMahe",
              "text": "It's called [Bloomeo](https://bloomeo.app/). It's still live on the stores but I didn't update it in months",
              "score": 1,
              "created_utc": "2026-01-28 16:07:49",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o29h87x",
                  "author": "tesla2018El",
                  "text": "I’m building one but a different take. Probably same outcome.",
                  "score": 1,
                  "created_utc": "2026-01-28 18:39:05",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o28jaaq",
          "author": "who_am_i_to_say_so",
          "text": "I’ve banged out several MVP’s over the past year and they all are barely hanging by a thread getting little traffic except one. \n\nSo far? Nothing has worked. But I’m constantly reassessing. Determined to crack the code.\n\nOne piece of advice that has stuck is targeting prosumers- not consumers. I’m running with that. And that’s exactly what you did. Congrats!",
          "score": 1,
          "created_utc": "2026-01-28 16:12:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2915qp",
              "author": "VivienMahe",
              "text": "Oh yes, there is a huge difference between traffic and customers. That's why it's also important to work on the CVR.\n\nWe can only iterate until we find something that works. There's no magic :)\n\nThank you!",
              "score": 2,
              "created_utc": "2026-01-28 17:30:18",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o29hzpc",
                  "author": "who_am_i_to_say_so",
                  "text": "For sure! Traffic is a catch 22. You need traffic but low quality traffic is just as bad as having none. And worse- you’re scaling and paying more in server costs for nothing.",
                  "score": 2,
                  "created_utc": "2026-01-28 18:42:19",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2dwyuz",
          "author": "Legitimate_Key8501",
          "text": "The B2C → B2B pivot makes total sense. B2C with no audience = shouting into void. B2B = solving a problem you personally experienced = validation is built-in.  \n  \nThe \"saved him 50+ hours\" is the killer metric. That's what developers actually buy - time. Not features, not tech stack, not \"clean code.\" Time.  \n  \nCurious: when you demo KMP Ship, how do you handle showing client projects that used it? Or do you avoid showing real examples and stick to generic demos?  \n  \n(I've found that showing real projects = massive credibility boost, but client NDAs make it complicated)",
          "score": 1,
          "created_utc": "2026-01-29 10:14:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2i8w33",
              "author": "VivienMahe",
              "text": "On the landing page, you can find 2 apps built with KMPShip being showcased.\nI'll keep adding more with time!",
              "score": 1,
              "created_utc": "2026-01-29 23:43:23",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2u91rf",
          "author": "eividass",
          "text": "Happy for your success! I wonder if code templates are still viable? Seems like this is becoming pretty saturated, but I guess differentiating on tech stack is a possibility",
          "score": 1,
          "created_utc": "2026-01-31 19:21:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2y0x8g",
              "author": "VivienMahe",
              "text": "Thank you!\n\nI agree it is a bit saturated at the moment, but mostly for web templates. For mobile you don't have many options yet and mine is niche because it's for Kotlin Multiplatform mobile apps. There are not many out there.",
              "score": 1,
              "created_utc": "2026-02-01 09:36:24",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o26p42b",
          "author": "TemporaryKangaroo387",
          "text": " also love the KMP angle being first mover in a growing space beats being 100th in a crowded one",
          "score": 1,
          "created_utc": "2026-01-28 09:26:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o26pb29",
              "author": "VivienMahe",
              "text": "Yes exactly. KMP is a niche but if it keeps growing like this, it won't be a niche anymore so I'm placing a bet on the future!",
              "score": 2,
              "created_utc": "2026-01-28 09:28:24",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o26wqh6",
          "author": "mbtonev",
          "text": "Very useful, thanks!",
          "score": 1,
          "created_utc": "2026-01-28 10:35:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o26xr6v",
              "author": "VivienMahe",
              "text": "Thank you, glad you find it useful!",
              "score": 1,
              "created_utc": "2026-01-28 10:44:32",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qtg0w5",
      "title": "I built a tool that lets you create n8n/Clay-style workflows in minutes\n   — looking for beta testers",
      "subreddit": "SideProject",
      "url": "https://www.reddit.com/r/SideProject/comments/1qtg0w5/i_built_a_tool_that_lets_you_create_n8nclaystyle/",
      "author": "TheHealthlover101",
      "created_utc": "2026-02-02 00:34:49",
      "score": 51,
      "num_comments": 20,
      "upvote_ratio": 0.91,
      "text": "  Hey everyone,                                                                 \n\n  I've been building [**Arnies.ai**](http://Arnies.ai) — a workflow automation tool where you describe  \n\n  what you want and it builds the workflow for you.                             \n\n  Instead of dragging nodes around and debugging connections for hours, you just\n\n   tell it what you need and it puts the whole thing together.                  \n\n  **What it does:**                                                                 \n\n  \\- Creates full automation workflows from a description                        \n\n  \\- Connects to 2500+ apps (CRMs, enrichment tools, databases, etc.)            \n\n  \\- Handles the logic, data mapping, and API connections for you                \n\n  \\- What takes hours in n8n or Clay takes minutes here                          \n\n  **Looking for beta testers who:**                                                 \n\n  \\- Currently use Clay, n8n, Make, or Zapier                                    \n\n  \\- Run outbound/sales ops, lead enrichment, or data workflows                  \n\n  \\- Want to break things and give honest feedback                               \n\n  If you're interested, drop a comment or DM me and I'll get you early access.  \n\n  Happy to answer any questions about how it works under the hood.         \n\nHere's a short video showing how it works: [https://youtu.be/orkt3Jwpxs4](https://youtu.be/orkt3Jwpxs4)",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/SideProject/comments/1qtg0w5/i_built_a_tool_that_lets_you_create_n8nclaystyle/",
      "domain": "self.SideProject",
      "is_self": true,
      "comments": [
        {
          "id": "o335av0",
          "author": "imissgfl94",
          "text": "I’m definitely interested",
          "score": 1,
          "created_utc": "2026-02-02 02:37:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o337flt",
              "author": "TheHealthlover101",
              "text": "hey please go here and sign up [https://arnies.ai](https://arnies.ai)   \nI will send you an email and invite you to our whatsapp community once you signed up :)",
              "score": 1,
              "created_utc": "2026-02-02 02:49:29",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o33r816",
          "author": "BP041",
          "text": "This sounds like a fantastic tool! Workflow automation can really save time and streamline processes. Have you considered incorporating feedback loops or conditional triggers? They can add a lot of flexibility to workflows, especially for more complex tasks. Best of luck with the beta testing!",
          "score": 1,
          "created_utc": "2026-02-02 04:52:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o33v61e",
              "author": "TheHealthlover101",
              "text": "Yes we have integrated both ",
              "score": 1,
              "created_utc": "2026-02-02 05:21:06",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o343tw6",
                  "author": "TheHealthlover101",
                  "text": "please do make sure to sign up here ; [https://arnies.ai](https://arnies.ai)",
                  "score": 1,
                  "created_utc": "2026-02-02 06:30:47",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o344mqx",
          "author": "Worldly_Expression43",
          "text": "How are you offering support for so many connectors/integrations?",
          "score": 1,
          "created_utc": "2026-02-02 06:37:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o34hv7u",
              "author": "TheHealthlover101",
              "text": "Well actually we are working with an api provider (pipedream), but also users can integrate their own custom apis (tehy can actually convert their own custom apis into tools that any ai model can use). so technically the world is your limit",
              "score": 1,
              "created_utc": "2026-02-02 08:39:01",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o34ed53",
          "author": "rjyo",
          "text": "The describe-to-workflow concept is clever - cuts out the steep learning curve of node-based tools. What's the workflow validation like? Does it warn you if something downstream will break?",
          "score": 1,
          "created_utc": "2026-02-02 08:05:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o34hs5y",
              "author": "TheHealthlover101",
              "text": "It is indeed, we have validation before api calls and post api calls, so there is validaoin in every single layer indeed, we also validate the json structure before inputs :)",
              "score": 1,
              "created_utc": "2026-02-02 08:38:12",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o34hz1a",
                  "author": "TheHealthlover101",
                  "text": "We have immediate self-healing, but we plan to add long term self healing with limits sothat the ai can automatically fix the workflows without you needing to worry",
                  "score": 1,
                  "created_utc": "2026-02-02 08:40:04",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o34lsd5",
          "author": "Forsaken_Lie_8606",
          "text": "ime ive been playing around with n8n and clay for a while now and i gotta say, the whole node-dragging thing can get pretty tedious, especially when youre dealing with complex workflows. id love to try out arnies.ai and see if it can really cut down the time it takes to set up a workflow - imo, if it can deliver on that promise, it could be a total game changer. one thing id be interested in seeing is how well it handles errors and edge cases, since thats often where these kinds of tools fall down. ngl, ive spent hours debugging connections in n8n only to find out it was some silly mistake on my part, so if arnies.ai can help mitigate that, im all in curious what others think",
          "score": 1,
          "created_utc": "2026-02-02 09:16:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o34vea3",
              "author": "TheHealthlover101",
              "text": "hey brother - please sign up here [https://arnies.ai](https://arnies.ai) \\- you will not be disappointed, it's going to be a revolutionary product",
              "score": 1,
              "created_utc": "2026-02-02 10:48:39",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o354c0c",
          "author": "Neuro_TruthSeeker",
          "text": "hey interested to test it out",
          "score": 1,
          "created_utc": "2026-02-02 12:03:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o35h6nz",
              "author": "TheHealthlover101",
              "text": "hey please go here: [https://arnies.ai](https://arnies.ai) \\- i will send you an email to get started",
              "score": 1,
              "created_utc": "2026-02-02 13:30:07",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o35btz7",
          "author": "Ecstatic_Law3753",
          "text": "that’s cool! Could you also make some tools for writing agent skills and deploy them in workflows with simple descriptions!",
          "score": 1,
          "created_utc": "2026-02-02 12:57:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o35h9c3",
              "author": "TheHealthlover101",
              "text": "yep [https://arnies.ai](https://arnies.ai) \\- sign up to the waitlist and we'll show you",
              "score": 1,
              "created_utc": "2026-02-02 13:30:32",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o35jz2u",
          "author": "Sea-Client2256",
          "text": "That's good. Let's do a collab.",
          "score": 1,
          "created_utc": "2026-02-02 13:46:01",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qt13zj",
      "title": "A different take on LLM context management inside Obsidian",
      "subreddit": "SideProject",
      "url": "https://v.redd.it/5syebmjwgwgg1",
      "author": "reart_ai",
      "created_utc": "2026-02-01 15:17:36",
      "score": 49,
      "num_comments": 1,
      "upvote_ratio": 0.92,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/SideProject/comments/1qt13zj/a_different_take_on_llm_context_management_inside/",
      "domain": "v.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "o2zcwgm",
          "author": "reart_ai",
          "text": "  \nHere is how the plugin looks like\n\nhttps://preview.redd.it/w57rtk41hwgg1.png?width=3248&format=png&auto=webp&s=d48b93841e4e305308215fed10062c45f491a077",
          "score": 1,
          "created_utc": "2026-02-01 15:18:01",
          "is_submitter": true,
          "replies": []
        }
      ]
    },
    {
      "id": "1qqb0x8",
      "title": "My side project hit 1.7k impressions/week. Here is the boring manual work that actually caused it",
      "subreddit": "SideProject",
      "url": "https://www.reddit.com/r/SideProject/comments/1qqb0x8/my_side_project_hit_17k_impressionsweek_here_is/",
      "author": "GeneralDare6933",
      "created_utc": "2026-01-29 15:06:57",
      "score": 44,
      "num_comments": 40,
      "upvote_ratio": 0.82,
      "text": "Most of us here are builders. We spend weeks in that 'vibe-code' flow state, polishing the UI and shipping features, but then we launch to absolute silence. I fell into that exact trap with my latest project. I thought if the code was clean and the problem was real, the traffic would just show up.\n\nSpoiler: It didn't. I was stuck in the loop of 'Launch Day' dopamine hits followed by 0-user weeks. I realized that as a solo builder, my side projects were essentially invisible because I was ignoring the boring foundation of authority.\n\nI realized that as a solopreneur, I needed a channel that compounds so I don't have to be \"on\" 24/7. That meant SEO, but I didn't have the budget for an agency or 25 hours a week to become a guru.\n\nPhase 1: The Authority Foundation - I slowed down writing blog posts and started building domain authority. Without it, you’re invisible. I researched myself and spent about 5 days doing a \"slow-drip\" of directory submissions, about 10 a day to keep it looking organic for Google’s crawlers. I wanted to build \"trust signals\" before I started pushing content.\n\nPhase 2: The \"Patience\" Gap - The first few weeks were dead quiet. This is where most solo founders quit. But if you look at the crawl data (not able to attach image in this community), Google was actually starting to visit the site more often because of those directory backlinks.\n\nPhase 3: The Payoff Around month two, the \"authority floor\" was high enough that my pages actually started ranking. I’m now seeing 1.76k+ impressions weekly and hitting 500+ organic users signups. The best part? This traffic converts way better than my cold outreach did because these people are actually searching for a solution.\n\nThe Takeaway: If you’re a solopreneur burning out on the social media treadmill, try spending one week on your SEO foundation. It’s boring, manual work at first, but it’s the only marketing that gets easier the longer you do it.\n\nI honestly think the reason most people skip this is that it’s just incredibly boring manual work. It took me 25+ hours of data entry to get those first 50 submissions done right. Since I’ve already got my researched list and the workflow open for my own projects, I’m happy to help a few other founders out if you'd rather stay in the 'vibe-code' flow state than fill out forms.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/SideProject/comments/1qqb0x8/my_side_project_hit_17k_impressionsweek_here_is/",
      "domain": "self.SideProject",
      "is_self": true,
      "comments": [
        {
          "id": "o2fg8vj",
          "author": "JealousBid3992",
          "text": "I sense an ad from the vibe written post but i don't see an ad, hm",
          "score": 12,
          "created_utc": "2026-01-29 15:48:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2fh92f",
              "author": "GeneralDare6933",
              "text": "Haha, eagle eye!  \nI’m a founder building in public, so the 'vibe' is definitely there. I’m not running a paid ad, just sharing the results of the manual grind I put into my own SEO. Honestly, if it feels like an ad, I’ll take that as a compliment on the results.",
              "score": 1,
              "created_utc": "2026-01-29 15:53:19",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2fa5e1",
          "author": "Twinuno_",
          "text": "Can you talk about your crawler approach",
          "score": 5,
          "created_utc": "2026-01-29 15:21:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2faezj",
              "author": "GeneralDare6933",
              "text": "Sure mate, DM me",
              "score": 0,
              "created_utc": "2026-01-29 15:22:46",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2g52nt",
          "author": "triwats",
          "text": "What are the directories here that you speak of?",
          "score": 3,
          "created_utc": "2026-01-29 17:40:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2g64y4",
              "author": "GeneralDare6933",
              "text": "DM me",
              "score": -2,
              "created_utc": "2026-01-29 17:44:49",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2gteln",
                  "author": "imagine1149",
                  "text": "Can I also know the directories?",
                  "score": 2,
                  "created_utc": "2026-01-29 19:30:15",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2f7a9s",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 2,
          "created_utc": "2026-01-29 15:08:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2f7un4",
              "author": "GeneralDare6933",
              "text": "Exactly brother, It took me 5 days to do those 50 submissions.",
              "score": 1,
              "created_utc": "2026-01-29 15:10:50",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2fg5uf",
          "author": "Jacky-Intelligence",
          "text": "The patience gap is so real. Most people romanticize the launch but can't stomach those dead quiet weeks where nothing seems to be happening. Sounds like you basically powered through by trusting the process, which is way harder than it looks from the outside.",
          "score": 2,
          "created_utc": "2026-01-29 15:48:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2fgzlq",
              "author": "GeneralDare6933",
              "text": "Exactly. the grind is real",
              "score": 1,
              "created_utc": "2026-01-29 15:52:09",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2fjbjw",
          "author": "BBCyberPancake",
          "text": "SEO angle is cool, but I’m hung up on the conversion math. Getting 500+ signups from 1.76k impressions is like a \\~30% conversion rate, which is wild.\n\nJust to make sure I’m reading this right: is that 1.7k search impressions (people just seeing your link on Google) or 1.7k actual visitors hitting the site? If it’s impressions, your CTR is insane. If it’s visitors, your landing page is doing serious work. Either way, I’m super curious how you’re turning that many people into signups.",
          "score": 2,
          "created_utc": "2026-01-29 16:02:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2fjx05",
              "author": "GeneralDare6933",
              "text": "Its the impressions. I have done an researched about some directories and did an unsexy work of submitting them accurately and strategically ",
              "score": -1,
              "created_utc": "2026-01-29 16:05:10",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2g44os",
          "author": "donjawns",
          "text": "What would you classify as \"seo foundation?\" Thanks!",
          "score": 2,
          "created_utc": "2026-01-29 17:35:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2g4nwu",
              "author": "GeneralDare6933",
              "text": "It's all about creating 'trust signals' so Google actually bothers to crawl your site. For me, it is DA, indexability and the patience",
              "score": 1,
              "created_utc": "2026-01-29 17:38:07",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2gq9zl",
          "author": "gmdmd",
          "text": "Do yourself a favor and have your favorite AI agents (Claude, Codex, Gemini) separately do audits of your site's SEO, and have them create an SEO.md or similar to periodically have them keep up to date on your SEO strategy.\n\nI was having too much fun building out [stockdips.ai](https://stockdips.ai) features and never stopped to consider how important this is. I didn't realize we didn't even have a sitemap.xml, google search console and bing submissions, and much more.  Ask the agents to come up with a checklist of manual SEO tasks for you to do.\n\nWe've only started to get impressions and clicks from google ('technical analysis NVDA/HOOD' etc) and it was because we had dozens of individual pages for stock tickers that were simply not getting indexed by google because our site is React native and we didn't have a good strategy for that.\n\nWish I had stopped to think about this sort of stuff weeks ago when we first got started and we might have had a lot more traction by now.",
          "score": 2,
          "created_utc": "2026-01-29 19:15:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2j90sz",
              "author": "GeneralDare6933",
              "text": "Thats also a really great idea. Appreciated your comment!",
              "score": 2,
              "created_utc": "2026-01-30 03:01:42",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2hdhrq",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 2,
          "created_utc": "2026-01-29 21:06:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2ja01i",
              "author": "GeneralDare6933",
              "text": "Yeah, you have to build the trust signals over time.",
              "score": 1,
              "created_utc": "2026-01-30 03:07:19",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2k506d",
          "author": "Adventurous-Date9971",
          "text": "Main point: the “boring” authority work you’re doing is probably the most leveraged thing a solo dev can do once the product basically works.\n\nWhat helped me systemize this kind of grind: treat it like ops, not marketing. One spreadsheet with columns for directory, category, DR/traffic, status, UTM, and next-review date. Batch similar fields (taglines, short/long desc, use cases) so you’re copy-pasting, not rewriting your life 50 times. I’d also write 2–3 angle variants (use case, feature-first, outcome-first) and rotate them so you can see which actually drives signups instead of just clicks.\n\nIf you ever want to scale beyond directories, layering in stuff like Ahrefs for topic discovery, F5Bot for simple keyword alerts, and then something like Pulse for Reddit to catch high-intent threads where people ask for tools in your niche keeps the “manual” part focused where it actually moves numbers.\n\nMain point: boring, repeatable authority systems beat launch-day spikes every time.",
          "score": 2,
          "created_utc": "2026-01-30 06:33:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2khgfb",
              "author": "GeneralDare6933",
              "text": "Exactly the thing needed for solopreneurs.",
              "score": 1,
              "created_utc": "2026-01-30 08:19:17",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2fl4t4",
          "author": "vep",
          "text": "This reads exactly like how Gemini talks.      Did AI write it - what are your actual ideas?",
          "score": 3,
          "created_utc": "2026-01-29 16:10:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2flsmm",
              "author": "GeneralDare6933",
              "text": "I’m a big fan of using AI to structure my thoughts. it’s how I manage to run multiple projects as a solo founder. But the ideas are from the 25+ hours I spent grinding through those first 50 manual submissions.",
              "score": 0,
              "created_utc": "2026-01-29 16:13:31",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2fvh2r",
                  "author": "vep",
                  "text": "as a reader, I need to know when to commit my time - and AI slop is everywhere and getting worse - so my alarm bells were ringing.  Using AI for your own processes is fine, but for sharing with others it makes you look less credible.   There is so much filler and fluff that it really dilutes the message too.   Some folks are fine reading what an ai told someone else of course.",
                  "score": 1,
                  "created_utc": "2026-01-29 16:56:34",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2ifi98",
          "author": "Impressive-Pack9746",
          "text": "1700 impressions / week doesnt sound like a lot tbh.",
          "score": 1,
          "created_utc": "2026-01-30 00:19:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2ja8op",
              "author": "GeneralDare6933",
              "text": "1700 impressions and 535+ signups in for a 2 month old saas is I think a good signal",
              "score": 1,
              "created_utc": "2026-01-30 03:08:41",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o2r4c2m",
              "author": "AIStoryStream",
              "text": "Most people would kill for those numbers when starting up. 500 plus sign-ups would be life changing for me. If you have done better, please tell us how. We are all here doing our best to succeed and would value your input.",
              "score": 1,
              "created_utc": "2026-01-31 07:18:31",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2jop2h",
          "author": "Ryantrange",
          "text": "dm me with your help",
          "score": 1,
          "created_utc": "2026-01-30 04:35:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ovtku",
          "author": "AIStoryStream",
          "text": "You underplay the effort. It's a  monumental task! I did one listing today (Capterra) and it took hours. I am hoping it gets easier the more I do. Hats off to you. It's not something I would do for money.",
          "score": 1,
          "created_utc": "2026-01-30 22:43:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2qh3fh",
              "author": "GeneralDare6933",
              "text": "Appreciate your comment!",
              "score": 2,
              "created_utc": "2026-01-31 04:15:59",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qupjec",
      "title": "I made a better Duolingo",
      "subreddit": "SideProject",
      "url": "https://www.reddit.com/r/SideProject/comments/1qupjec/i_made_a_better_duolingo/",
      "author": "ImpossibleAgent3833",
      "created_utc": "2026-02-03 11:31:15",
      "score": 44,
      "num_comments": 22,
      "upvote_ratio": 0.77,
      "text": "Hey guys, I've always struggled to learn languages, especially because apps like Duolingo don't work, they make you write or choose some options instead of actually speak, so I started building something focused only on real conversation.\n\nIt’s basically Duolingo if the entire app revolved around talking instead of translating sentences and collecting streaks.\n\nThe idea is simple: you open it and immediately start speaking with an AI tutor that listens in real time, corrects you while you talk, and adapts to your level, just conversation.\n\nSome of the things we’ve been building into it:\n\n* real-time pronunciation and phrasing feedback while you speak\n* conversation scenarios (travel, work, casual chat, restaurants….)\n* adaptive difficulty depending on how you respond\n* corrections that explain why something sounds unnatural\n* memory system that brings back words you keep messing up\n* natural pacing so it feels like an actual human exchange\n* hands free mode so you can practice while walking or driving\n\nIt’s currently in beta access and right now it’s just a waiting list, but the site explains everything in detail if you’re curious. Take a look at it [here](https://www.orali.ai/)!\n\nWould love feedback from people who’ve tried learning languages seriously, what do you feel apps are still missing?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/SideProject/comments/1qupjec/i_made_a_better_duolingo/",
      "domain": "self.SideProject",
      "is_self": true,
      "comments": [
        {
          "id": "o3c30ub",
          "author": "kl0wo",
          "text": "re: \"I made a better Duolingo\" - no you didn't.\n\nThere is exactly zero functionality at the url you provided. Nice way to collect emails tho.",
          "score": 5,
          "created_utc": "2026-02-03 13:07:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3ciz7j",
              "author": "Unlucky_Base5516",
              "text": "real",
              "score": 1,
              "created_utc": "2026-02-03 14:36:16",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3bsaim",
          "author": "jambla",
          "text": "Cool idea, but the site doesn’t back it up at all. None of the homepage links go anywhere, so when you say ‘the site explains everything in detail’… it really doesn’t. There’s basically nothing to react to yet. Also, not gonna lie, the name is rough. ‘Orali’ has a pretty obvious sexual vibe, which is going to turn some people off right away. Might want to fix those before asking for serious feedback.",
          "score": 10,
          "created_utc": "2026-02-03 11:53:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3c06xj",
          "author": "GrabWorking3045",
          "text": "I've been on this sub long enough to spot an astroturfed post.",
          "score": 3,
          "created_utc": "2026-02-03 12:49:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3c1kbf",
              "author": "TheRealDave24",
              "text": "What do you mean by an astroturfed post?",
              "score": 1,
              "created_utc": "2026-02-03 12:58:16",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3c2hid",
                  "author": "GrabWorking3045",
                  "text": "Fake comments, fake votes, probably from the same person.",
                  "score": 3,
                  "created_utc": "2026-02-03 13:04:03",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3bxic8",
          "author": "Ok_Platypus_4475",
          "text": "Took one look and it’s already screaming weak-vibe SaaS",
          "score": 2,
          "created_utc": "2026-02-03 12:31:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3bpvnq",
          "author": "Critical_Cod_2965",
          "text": "Finally someone building for speaking instead of gamification. Respect.",
          "score": 8,
          "created_utc": "2026-02-03 11:34:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3btk6e",
          "author": "FreshPin2589",
          "text": "I’d honestly pay just to have infinite conversation reps without annoying a real person",
          "score": 2,
          "created_utc": "2026-02-03 12:02:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3czv2u",
              "author": "emin3sku",
              "text": "Try my app if you have a newer iPhone, it has a chat mode with Apple Intelligence and a module to train your pronunciation https://apps.apple.com/ro/app/articulate-ai-pronunciation/id6753924420",
              "score": 1,
              "created_utc": "2026-02-03 15:59:07",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3c10pb",
          "author": "Duedeldueb",
          "text": "Would be nice if you could at least sneak peak before giving away your mail.",
          "score": 1,
          "created_utc": "2026-02-03 12:54:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3cg7in",
          "author": "dgamr",
          "text": "Like the idea but the site really doesn't explain anything in any detail.",
          "score": 1,
          "created_utc": "2026-02-03 14:21:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3bspop",
          "author": "SituationOwn7773",
          "text": "love hte concept!... As someone learning multiple languages, this is exactly what I’ve been missing.",
          "score": 0,
          "created_utc": "2026-02-03 11:56:31",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qtvpc3",
      "title": "ADHD solopreneur here. This is the first project I've actually finished in years.",
      "subreddit": "SideProject",
      "url": "https://v.redd.it/tgm31n6b73hg1",
      "author": "Ok-Tap3993",
      "created_utc": "2026-02-02 13:56:24",
      "score": 43,
      "num_comments": 21,
      "upvote_ratio": 0.98,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/SideProject/comments/1qtvpc3/adhd_solopreneur_here_this_is_the_first_project/",
      "domain": "v.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "o35m9gr",
          "author": "Wild_Gold1045",
          "text": "I need a too hard rn button for my life 😃",
          "score": 2,
          "created_utc": "2026-02-02 13:58:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o35me08",
              "author": "Ok-Tap3993",
              "text": "haha I feel you!",
              "score": 2,
              "created_utc": "2026-02-02 13:59:25",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o35qcog",
          "author": "Tall_Detail3648",
          "text": "love the simple ux",
          "score": 2,
          "created_utc": "2026-02-02 14:21:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o35qqwl",
              "author": "Ok-Tap3993",
              "text": "thanks, really appreciate it! I made a conscious effort in making it as minimalist as I can, I can’t function well with all the clutter and noise personally",
              "score": 2,
              "created_utc": "2026-02-02 14:23:08",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o36daf7",
          "author": "Dansvidania",
          "text": "I fit the suspect description :) going to try it out ",
          "score": 2,
          "created_utc": "2026-02-02 16:14:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o36dw9e",
              "author": "Dansvidania",
              "text": "Update. For starters it looks great",
              "score": 2,
              "created_utc": "2026-02-02 16:16:55",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o36fne0",
                  "author": "Ok-Tap3993",
                  "text": "Love to hear feedback like that ☺️",
                  "score": 1,
                  "created_utc": "2026-02-02 16:25:03",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            },
            {
              "id": "o36e11e",
              "author": "Ok-Tap3993",
              "text": "Sure thing, be so kind and DM me if you find anything that could be better. Or reply here :)",
              "score": 1,
              "created_utc": "2026-02-02 16:17:32",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o37agg0",
          "author": "TomatoWasabi",
          "text": "![gif](giphy|jrutBd1N7ZhsINAPzs)",
          "score": 2,
          "created_utc": "2026-02-02 18:45:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o37c3dr",
              "author": "Ok-Tap3993",
              "text": "![gif](giphy|yxy69FCE06Ql0Fjk4Z)",
              "score": 2,
              "created_utc": "2026-02-02 18:52:48",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o37dui6",
                  "author": "TomatoWasabi",
                  "text": "Your app is great, it’s exactly what I need, with no unnecessary bloat. However, I’ve noticed some friction when trying to capture a thought quickly.\n\nCurrently, starting a Quick Note takes 4 steps:\n\n1. Open the app.\n2. Tap 'New Task'.\n3. Tap the '+' icon.\n4. Select the type and finally type in the field.\n\nThat’s a lot of friction for a simple note. \n\nTo make the app even more efficient, I have two suggestions:\n\n- Dedicated Buttons: Have one distinct button for 'Quick Notes' and another for 'Tasks' right on the home screen.\n\n- Instant Input: Display a 'Quick Task' input field immediately upon opening the app.\n\nThe goal is to make capturing information as fast as possible. \n\nKeep up the good work!",
                  "score": 2,
                  "created_utc": "2026-02-02 19:00:43",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o37el28",
          "author": "mcbootysauce1",
          "text": "i like the UI/UX! did you create it from scratch on figma?",
          "score": 2,
          "created_utc": "2026-02-02 19:04:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o37g960",
              "author": "Ok-Tap3993",
              "text": "Appreciate the kind words! I did play around in figma, but honestly it wasn't much help for me because I'm not too familiar with the tools there. I did create most of it from scratch in SwiftUI though. Just had a vision and crafted something together then started removing stuff.  The end goal was ultra minimalism from the beginning, I can't function with distractions.",
              "score": 1,
              "created_utc": "2026-02-02 19:11:49",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o37ra7b",
          "author": "eiko64",
          "text": "It’s very cool ! Good job !",
          "score": 2,
          "created_utc": "2026-02-02 20:03:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o37s84s",
              "author": "Ok-Tap3993",
              "text": "Appreciate you!",
              "score": 1,
              "created_utc": "2026-02-02 20:07:46",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3abbap",
          "author": "elihorne",
          "text": "hey, this is really cool. nicely done!",
          "score": 2,
          "created_utc": "2026-02-03 04:16:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3ahu58",
              "author": "Ok-Tap3993",
              "text": "thanks!",
              "score": 1,
              "created_utc": "2026-02-03 05:01:51",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o37bbbp",
          "author": "ToadPres",
          "text": "Great job bro. I also have ADHD plus Bipolar🥲 Please also try my product: [https://frism.pixelraft.com](https://frism.pixelraft.com/introducing)",
          "score": 1,
          "created_utc": "2026-02-02 18:49:18",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}