{
  "metadata": {
    "last_updated": "2025-12-31 04:49:58",
    "time_filter": "week",
    "subreddit": "softwarearchitecture",
    "total_items": 15,
    "total_comments": 54,
    "file_size_bytes": 84982
  },
  "items": [
    {
      "id": "1puv46h",
      "title": "Presentations for the Architectural Metapatterns book",
      "subreddit": "softwarearchitecture",
      "url": "https://www.reddit.com/r/softwarearchitecture/comments/1puv46h/presentations_for_the_architectural_metapatterns/",
      "author": "_descri_",
      "created_utc": "2025-12-24 19:19:50",
      "score": 82,
      "num_comments": 9,
      "upvote_ratio": 0.95,
      "text": "Here are presentations that summarize the main content of my book *Architectural Metapatterns* (which is, surprisingly, an overview of architectural patterns):\n\n___\n\n[**Patterns of Patterns**](https://speakerdeck.com/denyspoltorak/patterns-of-patterns-c322149c-fcdd-4df6-8c6c-f273c7ab17dd), and why we need them:\n\n* The misery of having thousands of patterns.\n* Local and distributed architectures are not dissimilar.\n* Structure determines function.\n* There are only so many elementary geometries.\n* Which means that hundreds of patterns condense into several metapatterns.\n\n___\n\n[**Basic Architectures**](https://speakerdeck.com/denyspoltorak/basic-architectures), the building blocks for complex systems:\n\n* *Monolith* – a cohesive codebase.\n* *Shards* – multiple instances of a (sub)system.\n* *Layers* – subdivision by the level of abstractness.\n* *Services* – components, dedicated to subdomains.\n* *Pipeline* – a chain of data processing steps.\n\n… and common variants of each of the architectures.\n\n___\n\n[**Architectural Extensions**](https://speakerdeck.com/denyspoltorak/architectural-extensions-c3e506c0-6472-4e2c-8113-b3d8ffa20d63). Making use of specialized components:\n\n* *Middleware* – communication and deployment.\n* *Shared Repository* – persistence and synchronization.\n* *Proxy* – protocols, routing, and security.\n* *Orchestrator* – integration and use cases.\n* *Combined Component* – multiple aspects.\n\n___\n\n[**Fragmented Architectures**](https://speakerdeck.com/denyspoltorak/fragmented-architectures-bf4d129f-4cd1-46bf-9fb0-248879872b25). Patterns with smaller components:\n\n* *Layered Services* – divide into services, then into layers.\n* *Polyglot Persistence* – employ multiple databases.\n* *Backends for Frontends* (*BFF*) – dedicate a service to each kind of client.\n* *Service-Oriented Architecture* (*SOA*) – divide into layers, then into services.\n* *Hierarchy* – recursive subdivision.\n\n___\n\n[**Implementation Patterns**](https://speakerdeck.com/denyspoltorak/implementation-patterns). The high-level design of system components:\n\n* *Plugins* customize the component’s behavior.\n* *Hexagonal Architecture* isolates the business logic from external dependencies.\n* *Microkernel* mediates between resource providers and resource consumers.\n* *Mesh* maintains a decentralized system.\n\n___\n\nI hope that the presentations will help you quickly find out if you are interested in the book.\n\nMerry Christmas!",
      "is_original_content": false,
      "link_flair_text": "Article/Video",
      "permalink": "https://reddit.com/r/softwarearchitecture/comments/1puv46h/presentations_for_the_architectural_metapatterns/",
      "domain": "self.softwarearchitecture",
      "is_self": true,
      "comments": [
        {
          "id": "nvsmtjq",
          "author": "bunsenhoneydew007",
          "text": "Thanks for sharing this! It’s Christmas morning and I’m a little hung over so I’ll have a proper look later on 😆",
          "score": 4,
          "created_utc": "2025-12-24 23:38:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvslkju",
          "author": "Effective-Total-2312",
          "text": "Hello Denys ! I've been following your work almost all year. It's an endeavor I would have probably started in the future years, had not already done it yourself now. Congratulations on such a nice, comprehensive, and exhaustive investigation on Software Architecture ! Definitely something that should be of interest of all software engineers, be them architects or not.\n\nWill take a closer look at the presentations the following days, have a merry christmas and happy new year !",
          "score": 4,
          "created_utc": "2025-12-24 23:29:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvuay82",
              "author": "_descri_",
              "text": "Thank you!  \nMerry Christmas!",
              "score": 4,
              "created_utc": "2025-12-25 07:45:12",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nw8mble",
          "author": "One_Elephant_8917",
          "text": "I was doing similar research the other day with chatGPT and it gave me almost similar answers lol…but yeah nice one for a quick glance",
          "score": 1,
          "created_utc": "2025-12-27 19:29:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "nw8mjtm",
              "author": "_descri_",
              "text": "Answers to which question?",
              "score": 1,
              "created_utc": "2025-12-27 19:30:25",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwd6r91",
                  "author": "One_Elephant_8917",
                  "text": "rearchitecting for pluggable/scalable arch, production architectures and patterns out there",
                  "score": 1,
                  "created_utc": "2025-12-28 14:18:26",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1pz9v5b",
      "title": "Is it still true that 30 percent of the workforce runs 100 percent of the project?",
      "subreddit": "softwarearchitecture",
      "url": "https://www.reddit.com/r/softwarearchitecture/comments/1pz9v5b/is_it_still_true_that_30_percent_of_the_workforce/",
      "author": "StillUnkownProfile",
      "created_utc": "2025-12-30 05:39:34",
      "score": 70,
      "num_comments": 45,
      "upvote_ratio": 0.88,
      "text": "I recently hit a point of total burnout and frustration. I finally went to my manager to complain that I was doing all the work, that others weren’t contributing much, and their unfinished tasks were constantly being pushed onto my plate. His response was pretty blunt: he said that’s just the reality of corporate life, especially in IT, where only about 30% of the team actually contributes to the project. I’m wondering if this is still a common, accepted truth in the industry?",
      "is_original_content": false,
      "link_flair_text": "Discussion/Advice",
      "permalink": "https://reddit.com/r/softwarearchitecture/comments/1pz9v5b/is_it_still_true_that_30_percent_of_the_workforce/",
      "domain": "self.softwarearchitecture",
      "is_self": true,
      "comments": [
        {
          "id": "nwp0kus",
          "author": "mistyharsh",
          "text": "As much as it may sound like Pareto Principle but it is not. Pareto Principle is about systems and their interconnections. Your manager saying this is wrong assumption on human capability.\n\nThe situation you describe is a case of bad management and bad assimilation of knowledge. The bad management because they have failed to build proper performance culture and haven't been able to incentivize teams/people to finish the projects or tasks. The bad assimilation of knowledge in team because likely the case that people are not possessing enough knowledge about the system to get the projects to the finish line.\n\nYour manager is just normalizing bad management and cloaking it with some misunderstood principle. Remember that Pareto is about explaining the natural uneven distribution within the system and not about the uneven distribution of work within the group of people. One classic example is \"Google Search and Ads\" is 70% of Google revenue (uneven earning compared to other services but can be explained by Pareto Principles) but that doesn't mean their Android or Cloud teams are useless.\n\nConsider this situation as a first red flag. There are ways to measure organization's health. If you see more red flags, it is time that you leave that place immediately.",
          "score": 35,
          "created_utc": "2025-12-30 07:34:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwph7rf",
              "author": "OkTrade8132",
              "text": "got any pointers with regards to measuring an organizations health?",
              "score": 4,
              "created_utc": "2025-12-30 10:08:36",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nwpb4o2",
              "author": "StillUnkownProfile",
              "text": "It clarified a lot of what I have been sensing. Thank you.",
              "score": 2,
              "created_utc": "2025-12-30 09:11:57",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwp6xo1",
          "author": "Oliceh",
          "text": "I have worked for 20 years now in various large organizations. 80% of the people is absolutely useless. Of that 80% there is a group of 25%-ish that is actively harming progress with their incompetence. They are even worse than useless. This isn't intentional incompetence, this is them doing their best. \n\nWhat I learned is... stick to the 20% that actually do stuff and learn and work with them.",
          "score": 10,
          "created_utc": "2025-12-30 08:32:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwu27ip",
              "author": "Extreme_Elderberry16",
              "text": "The 25% that actively harm the process with their incompetence is so true (at least at my company). I usually realize this when for a few weeks you are not constantly in firefighting mode. This is usually during yearly vacation periods when a large portion of said people are ooo",
              "score": 1,
              "created_utc": "2025-12-31 01:05:20",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nwpcrdz",
              "author": "StillUnkownProfile",
              "text": "Appreciate you sharing that. I will do my best to stay in the 20% that learns and gets things done.",
              "score": 1,
              "created_utc": "2025-12-30 09:27:27",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwoo9i6",
          "author": "OneHumanBill",
          "text": "It's the good old 80/20, aka the Pareto Principle.  Twenty percent of the people contribute roughly eighty percent of the value.  It's true in any industry.  Always has been.  In the old days it was the 20% that you'd be looking to get into leadership roles as they got into their forties and fifties.\n\nWhat's going to be interesting in the next few years is if AI is going to be effectively replacing the eighty percent of the workforce that only contributes the twenty percent.  If you're frustrated just remember which side of that divide you want to be on, and how you build your reputation for value productivity.",
          "score": 39,
          "created_utc": "2025-12-30 05:50:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwor9be",
              "author": "StillUnkownProfile",
              "text": "I understand that dynamic, and I’m already on the value side. My question is whether being on that side now also means accepting burnout as normal, or if there’s still an expectation that it’s managed better.",
              "score": 10,
              "created_utc": "2025-12-30 06:14:04",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwpuaco",
                  "author": "bezik7124",
                  "text": "Take it easy man, I was like that doing extreme overtime on top of it for a few years. It's unmanageable in the long run, and destroys your health. Do what you're comfortable with, take things slower when you're not feeling like it, find time to relax and take frequent breaks at work. And clock out exactly when your shift ends. You're still going to be more productive than the 80%, and while this might be counter-intuitive, it's probably not going to hinder your career in any way - people generally respect you more when you value your time and don't overwork yourself.",
                  "score": 6,
                  "created_utc": "2025-12-30 12:03:22",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nwpwd2b",
                  "author": "OneHumanBill",
                  "text": "I've been at this a long long time now.  I'm on what I hope will be my final software project as I'm approaching 50.\n\nYeah you have to accept this to some extent.  Frequent breaks and clocking out exactly on time blah blah blah will rather quickly put you on the non-value side because people are looking to you to set the pace.  If you slow down, they'll get worse. \n\nSo instead what you do is look to improve team performance via process.  Look at metrics.  Invent them if necessary.  Hey involved in methodological comparisons.  Give XP a close look.  Look to improve team accountability.  If you can improve the teams' productivity even a little bit you can then try to evade burnout.  You won't always be able to, especially when you're personal life hands you emergencies right around crunch times.\n\nOn your side, look into mental disciplines like stoicism.  Don't laugh, it's helped me.  My next trick is getting into yoga.  Software creation the highest levels does take a toll on your body and mine doesn't quite handle the physical stress like it did thirty years ago when I was getting started.\n\nThe more you try to embrace process improvements the more you'll be pulled into leadership, sales, staffing, and non-technical type of roles.  I've pushed back on this for years but I'm finally at the age where I feel like I have nothing left to prove in the technical arena.  Like I said I'm on my final project as an architect/tech lead, and starting to make that transition.  I'll be a hobbyist again, and I think I'll be able to really enjoy writing software just for fun again like I did as a kid. \n\nThis isn't the answer you're looking for probably but I've had a pretty fulfilling career, including the burnout parts.  I hope it helps.",
                  "score": 3,
                  "created_utc": "2025-12-30 12:19:30",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nwp7i92",
              "author": "IndividualShape2468",
              "text": "And the 20% are over in the overemployed subreddit ",
              "score": 2,
              "created_utc": "2025-12-30 08:38:17",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nwpwz1f",
                  "author": "OneHumanBill",
                  "text": "No.  The overemployed are screwing us all over and kidding themselves with how productive they think they are.  I've fired maybe a dozen of these assholes who try to overclock meetings and think that nobody notices.  Somebody like me will because their productivity is in the bottom 4%, Pareto squared territory, and investigate.  And if nobody notices then they're still not in the top 20%.",
                  "score": 1,
                  "created_utc": "2025-12-30 12:24:06",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nwppozw",
              "author": "Ok-Craft4844",
              "text": "Judging by my evaluations, im perceived to be be on the 20% doing 80% side, but tbh, that won't help in the pictured scenario.\n\nIf AI really replaces 80% of the workforce, there is no one left for the 20% to sell the shit we build to, and you don't need most of the 20% either.",
              "score": 1,
              "created_utc": "2025-12-30 11:25:19",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nwptvct",
                  "author": "ALAS_POOR_YORICK_LOL",
                  "text": "You cant really know that with any kind of confidence. There are so many variables here it's hard to confidently project how it will change the workforce.",
                  "score": 1,
                  "created_utc": "2025-12-30 12:00:05",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nwpwjgs",
                  "author": "OneHumanBill",
                  "text": "I'm aware.  It's one of those things that the powers that be haven't thought through very well.  I don't have any good solutions though.  Do you?",
                  "score": 1,
                  "created_utc": "2025-12-30 12:20:51",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwoxl5i",
          "author": "Qinistral",
          "text": "I’m surprised no one is commenting on your managers response. That’s pretty crap IMO. His job is to balance out the work and make sure people are pulling their weight. This should be HIS problem, not yours.\n\nThere are a couple main levers that lead to inequality. 1. Ability. 2. Effort. Not everyone will be high ability and high effort. Some will be medium ability and medium effort. But your manager needs to be culling low ability and/or low effort. Work is a team sport and low performers kill morale.",
          "score": 12,
          "created_utc": "2025-12-30 07:07:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwoy8sn",
              "author": "StillUnkownProfile",
              "text": "Couldn’t agree more. The manager should be managing the workload and addressing low performers, it’s not really the team’s responsibility to carry that.",
              "score": 1,
              "created_utc": "2025-12-30 07:13:14",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "nwp5y1y",
              "author": "Rincho",
              "text": "Well, not really. Manager's needs to make sure they deliver in time, costs etc. How it is done may differ",
              "score": 1,
              "created_utc": "2025-12-30 08:23:37",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nwopx1a",
          "author": "GrauDiamand",
          "text": "Just dont do much either lol",
          "score": 6,
          "created_utc": "2025-12-30 06:03:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwoqmn9",
              "author": "StillUnkownProfile",
              "text": "Doing the same now :)",
              "score": 3,
              "created_utc": "2025-12-30 06:09:02",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwormx0",
          "author": "larowin",
          "text": "Do what you can, be communicative, and document everything. You’ll float a level up, or you’ll survive the next cull. It’s easy to float in environments like this, but it’s easy to get cut as well.",
          "score": 3,
          "created_utc": "2025-12-30 06:17:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwoty3k",
              "author": "StillUnkownProfile",
              "text": "I’m working as a consultant so my company has no idea of what I will do, and client doesn’t care how I will do.",
              "score": 2,
              "created_utc": "2025-12-30 06:36:19",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwoxw4z",
                  "author": "Qinistral",
                  "text": "Sounds like your best strategy is to tune for learning as much as you can so you can get a job elsewhere with better coworkers.",
                  "score": 3,
                  "created_utc": "2025-12-30 07:10:08",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwounzs",
          "author": "justUseAnSvm",
          "text": "I'd put concerns about your co-workers out of your mind, that stuff all averages out in the end, burnout is a far greater concern and amplifies all those anxieties about co-workers.\n\nI hope your manager helped you develop a plan, but for me, the combination of deciding to let certain things go, and being consistent in my schedule (have to walk the dog), and always tempering my effort and expectations has worked really well.\n\nJust hang in there! Burnout happens when you put work in and don't get the reward. Our brain can't help but \"learn\" that activity isn't something worth doing anymore, so celebrate your wins when you can!",
          "score": 3,
          "created_utc": "2025-12-30 06:42:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwow3la",
              "author": "StillUnkownProfile",
              "text": "I get what you’re saying, but being in the same cubicle and seeing others not contribute makes it tough to just let go. How do you keep your focus in that kind of environment?",
              "score": 1,
              "created_utc": "2025-12-30 06:54:35",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwoyahf",
                  "author": "justUseAnSvm",
                  "text": "Be very deliberate about letting go of things you can't control. This thesis is the idea behind Stoicism, and although that belief system is largely replaced, it's survived so long because at its core is a powerful idea.\n\nIt isn't always easy, but accepting your coworkers failings make your work harder, is a far more effective belief to hold because it centers your concern wholly on what you can do.",
                  "score": 2,
                  "created_utc": "2025-12-30 07:13:39",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwonvqd",
          "author": "Rygel_XV",
          "text": "The pareto principle. 80% of the work is being done by 20% of the people. It's a truth of life. But it is sad that your manager is ok with putting all work on you. This does not sound like a healthy place.",
          "score": 7,
          "created_utc": "2025-12-30 05:47:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwoobkn",
              "author": "StillUnkownProfile",
              "text": "Yeah, given the current market situation, making a shift is nearly impossible, so I’ll have to put up with this environment or project for now.",
              "score": 3,
              "created_utc": "2025-12-30 05:51:02",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwqi5g2",
          "author": "dmangd",
          "text": "My response would be: ok, the Fire the non-contributing 70% and give me their salary",
          "score": 2,
          "created_utc": "2025-12-30 14:35:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwoodrb",
          "author": "FreshPrinceOfRivia",
          "text": "Somebody at my org complained that 20% of people do 80% of the work and mentioned the Pareto principle. I'm not sure it's actually that bad, but a few people do take a disproportionate amount of tasks consistently.",
          "score": 2,
          "created_utc": "2025-12-30 05:51:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwor47q",
              "author": "StillUnkownProfile",
              "text": "It’s not that they will take more tasks, the other people are not able to deliver on time and I’m being pulled into it.",
              "score": 1,
              "created_utc": "2025-12-30 06:12:57",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwpbtjp",
                  "author": "FreshPrinceOfRivia",
                  "text": "I've experienced that this year also. At least I'm getting promoted soon, but it sucks being pulled into projects because the \"owners\" cannot handle it on their own.",
                  "score": 2,
                  "created_utc": "2025-12-30 09:18:30",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwovz10",
          "author": "gbrennon",
          "text": "I think i underrstood ur \"pain\"... But thats life 😢\n\nTry to motivate other contributors so u don't carry the whole company.... \n\nIve experienced this several times and it proved that the company doesnt even isnt autonomous....\n\nIn this scenario if 1 persona got involved in any accident the businness willl be impacted",
          "score": 1,
          "created_utc": "2025-12-30 06:53:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwozmey",
              "author": "StillUnkownProfile",
              "text": "True, they’re senior, so feedback might not go anywhere. But I guess it’s worth a try since there aren’t many other options.",
              "score": 1,
              "created_utc": "2025-12-30 07:25:29",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwpbaif",
          "author": "wonder_grove",
          "text": "Are we sure the 20(30, whatever)% do a good job with the 80(70)% of the work? In my recent experience, there are devs who start a project/feature, they leave to the next sexy thing and the others are left with their bugs/leftovers.",
          "score": 1,
          "created_utc": "2025-12-30 09:13:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwprpj7",
              "author": "StillUnkownProfile",
              "text": "Yeah, that happens too. I think it really varies by organization and culture. In my case, the frustration is that I end up doing both: building new features and cleaning up bugs left behind by others.",
              "score": 1,
              "created_utc": "2025-12-30 11:42:35",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwpjy0m",
          "author": "quincycs",
          "text": "Hi, been there.  It’s alluring to become part of the problem by having unfinished work too. \n\nTry to verify some accusations you may be having and make a friend with another manager or someone above your manager. \n\n1. Is it really true that the manager is doing nothing nor sees it as a problem to solve?  Or was it just a way of the manager giving you validation that it is a problem.  I can’t imagine the 80/20 rule being enough to explain away the situation to a higher up.  Everyone should be contributing to the team’s performance appropriate to their level.  If not a contributor… boom. \n\n2. Gather data so it’s not just your own feelings of burn out talking.  Are there metrics that are tracked today?  Find a way to explain that the organization can be significantly more efficient and craft a measurement system.  The measurement could be as simple as tickets completed per sprint.  Then the managers job should be to identify individuals who are consistently underperforming to the team’s avg.   Consider level (junior/senior) as another factor whether someone should be contributing more or less.",
          "score": 1,
          "created_utc": "2025-12-30 10:33:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwpl4cy",
          "author": "quincycs",
          "text": "Consider also you may just be experiencing growing pains of seniority.  Generally the more good you get, the more lonely it can feel.  This “loneliness” is a way of framing the pain you feel of “why am I the only…”.   Sometimes the answer is simply because you care more or worked harder or had better parents.  Try and pick a lost sheep who has potential in being trained to be more like you — mentor someone & find someone to mentor you.",
          "score": 1,
          "created_utc": "2025-12-30 10:44:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwpp7q5",
          "author": "Ok-Craft4844",
          "text": "Tbh, \"70% not contributing\" is optimistic, it's more like 30% not contributing, 20% trying to contribute at a net loss (but maybe will be there some day) and 20% actively working against the project, be it with forcing discussions over fictional or already solved concerns, introducing bullshit compliance or \"best practices\".",
          "score": 1,
          "created_utc": "2025-12-30 11:21:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwq6zjf",
          "author": "gormami",
          "text": "I would say in terms of contribution, that may be correct, depending on how you define the project team.  As a security practitioner, I need to be aware of projects, and have my own items to check off, but don't contribute to what most people think of as the project.  The same is true of operations and support roles, depending on exactly how the definitions fall.  They are there to receive information, and perhaps steer things a bit, but don't contribute to the execution of the project directly, they just make sure the exit criteria are met so that they can do their jobs once it is launched.\n\nThat is very different than having tasks assigned to others moved to you when they are not completed by the original assignee.  That is a management problem.  If those persons work for your manager, they should be held directly accountable for delivery.  If they work for other teams, it could be performance that your manager should address with theirs, or it could be poor project planning/management.  If that person's supervisor was not made aware of the workload of the project, and agreed to it before it got started, then it is not surprising that other tasks for their team might be preventing them from completing the ones for this project.  This is one of the biggest failures I've seen in project management, grabbing someone, particularly SMEs, for a project, but never getting their boss's agreement, so they don't have the time to do what the project wants. \"Matrix organizations\" are famous for that, in the end, you can't really serve more than one master.  Some**one** has to have the final say on your time and production.",
          "score": 1,
          "created_utc": "2025-12-30 13:31:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwqf5ha",
          "author": "dashingThroughSnow12",
          "text": "It varies over time and part of your manager’s job is to fix this.\n\nYou can do a task in an hour that Jim would take two days and a lengthy review to do. It is obvious why you get the task. But Jim is a perfectly smart guy. He needs coaching and opportunities to get better. Given enough experience in your stack, Jim can do that task in half a day and an easy review. Debora likewise. She works on a bunch of small tickets because her confidence sucks. Your manager needs to get her out of her comfort zone and have her do larger, more impactful tasks. To be the primary contributor to a small project instead of only ever a helper.\n\nI was in the scenario you describe yourself in earlier this year. My manager fixed it by upskilling many of the team mates.",
          "score": 0,
          "created_utc": "2025-12-30 14:19:09",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pvdzs5",
      "title": "What would you read/do next to become a strong System/Solution Architect in 2026?",
      "subreddit": "softwarearchitecture",
      "url": "https://www.reddit.com/r/softwarearchitecture/comments/1pvdzs5/what_would_you_readdo_next_to_become_a_strong/",
      "author": "Disastrous-Outside47",
      "created_utc": "2025-12-25 14:01:48",
      "score": 65,
      "num_comments": 18,
      "upvote_ratio": 0.98,
      "text": "Hi all - I'm building towards a System/Solution Architect role and I'm looking for advanced, practical resources to supplement my formal training.\n\nBackground: I've completed an IT Architecture Foundation certification and I'm planning the System Architecture (Practitioner) follow-up in the Danish \"Dansk IT\" model, which is broadly aligned with TOGAF + a local public-sector reference architecture (FDA/OIO). The practitioner course is built around Rozanski & Woods (viewpoints/perspectives, stakeholder-driven architecture documentation, etc.).\n\nWhat I'm already covering:\n\n\\- Rozanski & Woods (2nd ed) as the main text\n\n\\- TOGAF ADM (as a method/reference)\n\n\\- Local reference architecture material (FDA/OIO)\n\nWhat I'm looking for from you:\n\nIf you could recommend 3-5 resources that are modern, practical, and usable at work, what would they be?\n\nI'm especially interested in things that help with:\n\n\\- Turning requirements + quality attributes into architecture decisions/tradeoffs\n\n\\- Documenting and communicating architecture effectively (views, ADRs, templates)\n\n\\- Real-world system design in distributed systems (integration, events, data, resiliency)\n\n\\- Governance/standards without heavy enterprise \"ceremony\"\n\nBooks, papers, blogs, courses, or \"do this hands-on\" suggestions are all welcome - ideally things you've personally seen work in real teams.",
      "is_original_content": false,
      "link_flair_text": "Discussion/Advice",
      "permalink": "https://reddit.com/r/softwarearchitecture/comments/1pvdzs5/what_would_you_readdo_next_to_become_a_strong/",
      "domain": "self.softwarearchitecture",
      "is_self": true,
      "comments": [
        {
          "id": "nw0q3ga",
          "author": "ERP_Architect",
          "text": "You’re already on a solid theoretical base. What usually accelerates architects beyond this point is shifting from frameworks to decision making under constraints.\n\nA few things I’ve seen work well in practice:\n\nOne, spend time with architecture decision records and tradeoff analysis, not just views. Writing and defending ADRs forces clarity far more than drawing diagrams. Even lightweight ones.\n\nTwo, study real failure and scaling stories. Postmortems from large platforms, architecture blogs that explain why decisions were made and later reversed. That’s where quality attributes and tradeoffs become concrete.\n\nThree, practice architecture by doing small but end to end designs. Take a real problem at work or a hypothetical one and explicitly walk through requirements, quality attributes, constraints, and decisions. Document it as if you had to convince skeptical stakeholders.\n\nFour, learn to communicate with non architects. The best architects I’ve worked with were excellent translators. They could explain the same system differently to developers, product, ops, and leadership without losing intent.",
          "score": 12,
          "created_utc": "2025-12-26 13:19:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvwvrk8",
          "author": "bunsenhoneydew007",
          "text": "The C4 system and IcePanel are fantastic. Also read ‘The Software Architect Elevator’ by Gregor Hohpe. \n\nhttps://amzn.asia/d/4WzTXMm",
          "score": 4,
          "created_utc": "2025-12-25 19:39:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvxdktd",
              "author": "Veuxdo",
              "text": "Note that the author of C4, Simon Brown, recently said that 95% of teams that set out to use C4 end up using only levels 1 and 2. To me, this is evidence that it's no longer a good fit for modern architectures and probably needs to be redesigned/rethought.",
              "score": 7,
              "created_utc": "2025-12-25 21:28:34",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nvzvdzs",
                  "author": "simon-brown",
                  "text": "lol 😂",
                  "score": 7,
                  "created_utc": "2025-12-26 08:26:11",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nw0ksv6",
                  "author": "caosordenado",
                  "text": "Depends on the usage, 95% of engineers do not work as architects or high level solutions",
                  "score": 1,
                  "created_utc": "2025-12-26 12:38:47",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nw1tdgd",
          "author": "GMorgs3",
          "text": "(Sorry this is brief writing this on my phone)\n\nId definitely recommend 'building' as well as studying - do some design katas and build some high level architectures, you don't need to go nuts with lots of internal code just make sure you can do enough to test out concepts in reality without wasting loads of time on unnecessary detail.\n\nIn the interest of keeping studying I recommend Fundamentals of Software Architecture (2nd ed) - there are lots of great books I could recommend but this one covers the entire spectrum of what is expected of an architect and how to succeed in the role.\n\nRozanski & Woods Software Systems Architecture book has served me incredibly well in my architecture career with foundations of how to describe and document architectures - along with Simon Browns C4 method. BUT - beware in reality nobody wants this level of detail (except for you, and you won't have time to do it exactly to spec), so the most important thing is to adapt the core ideas and produce 'just enough' design and documentation (shout out to George Fairbanks) which caters specifically for your stakeholders. This is truly an art which solidifies your value as an architect if people can find, understand, get value from and contribute to your architecture documentation - if they can't, it's a problem that needs resolving via collaboration and iteration until this becomes possible.\n\nBest of luck",
          "score": 2,
          "created_utc": "2025-12-26 17:10:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwnaruz",
          "author": "ScanSet_io",
          "text": "From my own experience, spending time in systems engineering and solutions engineering helped me more than any single framework. Being forced to think about real constraints, tradeoffs, and failure modes made architecture much more concrete.\n\nPairing that with a strong focus on software fundamentals like composition, clear boundaries, and common patterns has gone a long way in shaping how I architect systems in practice.",
          "score": 2,
          "created_utc": "2025-12-30 00:55:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw0eoss",
          "author": "m0n0x41d",
          "text": "I would keep learning systems engineering and FPF",
          "score": 1,
          "created_utc": "2025-12-26 11:44:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvxp95k",
          "author": "AliveShine",
          "text": "Architect is a dying role",
          "score": -13,
          "created_utc": "2025-12-25 22:40:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvyfxpi",
              "author": "Saraphite",
              "text": "Absolutely wrong. If anything is dying it's the developer who doesn't care much for thinking through solutions and just wants to type code.",
              "score": 6,
              "created_utc": "2025-12-26 01:33:48",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nvxv6ml",
              "author": "Disastrous-Outside47",
              "text": "Explain?",
              "score": 3,
              "created_utc": "2025-12-25 23:18:48",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "nvz4bgg",
              "author": "PotentialCopy56",
              "text": "Don't worry it 100% is. These people act like developers can't architect just because they don't memorize a bunch of rules. Companies are cutting bloat and glorified planners are bloat.",
              "score": 0,
              "created_utc": "2025-12-26 04:24:57",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nw0axgc",
                  "author": "BigCombination2470",
                  "text": "I am confused. Being a software architect is like being a staff engineer, you have to go through the junior-mid-senior levels. Staff engineers are devs lol. Did you think soft architect was not a developer role? soft architect is just a staff engineer role. eg at Google we have L1(Junior)-L7(Staff).   \n  \nAnd why would higher level roles die, literally if we look at the market today, the data says otherwise. Everyone is hiring seniors ONLY, staff/architect jobs have a shortage, companies are competing for the same staff engineers as they fire or stop hiring mid level and junior jobs, junior jobs are impossible to land now. More automatable jobs, easy stuff like writing CRUD, graphql APIs can be done by AI, writing to redis, copy paste code from stackoverflow e.t.c while higher level jobs like planning and designing microservice communication, database schema design, the type where context matter and  cannot be done by AI, at least not yet, have the highest demand. Today its hard to find anyone hiring juniors, but everyone is hiring qualified architects/staff engineers.\n\nAnd being a software architect involves more than just \"memorizing a bunch of rules\". Classic Dunning-Kruger Effect. One thing you learn hopefully pretty early, is that there are tradeoffs to every technical decision/implementation. This is precisely the type of role you might never get/fit into if you have not been lucky enough to be exposed to these trade offs at a senior/junior role. You cannot afford to learn on the job, as the costs of bad architectural decisions are super high. You think bringing down production for a day is tough? try managing 6 team's time and salaries for 6 months only to come up with a subpar implementation that you have to scrap. You either have the experience or you do not, there is no room for expensive mistakes. You can read system design all you want, your knowledge will always be theoretical. Architectural decisions require wisdom and exposure. They involve more process level decisions than technical ones. you will often have to communicate with diff teams and map out the organizations leadership structures and chains of responsibility more than you will push code. You need to think about things like hiring for the technical decisions you made, documentation, making it easy for the organization to replace you, telemetry, GDPR and other privacy concerns. I hope you get a chance to work at a senior/staff role where you have to manage deployments, set the standards for other people to follow, and write internal libraries to speed up senior engineers time, then you'll understand",
                  "score": 1,
                  "created_utc": "2025-12-26 11:07:35",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1pyimcw",
      "title": "How do you work with AI as a long-term architect (docs + decisions + staying up-to-date)?",
      "subreddit": "softwarearchitecture",
      "url": "https://www.reddit.com/r/softwarearchitecture/comments/1pyimcw/how_do_you_work_with_ai_as_a_longterm_architect/",
      "author": "Acceptable-End-4636",
      "created_utc": "2025-12-29 10:08:31",
      "score": 25,
      "num_comments": 8,
      "upvote_ratio": 0.8,
      "text": "I’m looking for practical setups people use when working as an architect / platform owner on long-running projects (1–3 years).\n\nWhat I’m trying to optimize for:\n\n* one main workspace\n* chat with an AI assistant who can do research (also in web)\n* assistant should uses project documentation as context\n* can edit docs (e.g. Markdown or integrate with Conflu), not just answer questions\n* minimal context switching - ideally one tool\n* collaboration (let others do the same in the workspace)\n\nAdditionally, could be a separate tool for:\n\n* staying up-to-date with latest tech changes (OpenAI, Anthropic, Microsoft, Google, etc.), key aspect of new versions of frameworks etc - with ability to edit list of my interest.\n\n  \nAt the moment I have some licenses in my organization - MS Copilot license (and entire MS 365 ecosystem), Github copilot license, Confluence, and privately ChatGPT Go. But I am open for any toolsets. ",
      "is_original_content": false,
      "link_flair_text": "Discussion/Advice",
      "permalink": "https://reddit.com/r/softwarearchitecture/comments/1pyimcw/how_do_you_work_with_ai_as_a_longterm_architect/",
      "domain": "self.softwarearchitecture",
      "is_self": true,
      "comments": [
        {
          "id": "nwj1yoz",
          "author": "arikisfruits",
          "text": "It kind of depends, but you should look into:\n* A workflow that keeps your documentation up to date, and ensures that each system and process have clear information on the scope, constraints, data models, contracts, etc. If this drifts, you’re always starting from a losing position if you want to maximise correctness of the AI outputs. This can be AI assisted. \n* Governance of architectural decisions (clear why, options, decided approach, etc). Similar to the above, it ensures that you, your peers and AI have correct context.\n\nOnce you have the above, and the governance around it, you can centralise it in e.g. a git repo, and teach your LLM of choice about it. You can use pretty much any provider, but Anthropic models, especially Opus 4.5 (even Sonnet) work great with it.\n\nThis also very much depends on the size, scope and the goals you’re trying to achieve. For more complex setups and tasks, I’d advise getting deep into the ecosystem of skills, MCPs, sub agents, etc.",
          "score": 8,
          "created_utc": "2025-12-29 11:27:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwj3y99",
              "author": "Acceptable-End-4636",
              "text": "Regarding centralizing in a repo - I was thinking about the same (e.g. VS Code + Github Copilot). By teaching our LLM, do you think of creating a custom system prompt that would let the agent work in more 'architect' role ? Since it is not coding, do you think Sonnet could act also great when it comes to architectural thinking, decision making, research (including tools from different players).",
              "score": 1,
              "created_utc": "2025-12-29 11:44:05",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwj69w3",
                  "author": "arikisfruits",
                  "text": "In essence, what you want is that the LLM always has enough quality context dependent on what goal you're trying to achieve. You do this by ensuring:  \n  \n1. You have machine-readable context (e.g. md files)  \n2. That the model is instructed to use that context, and that you steer it to behave in a certain way (boundaries, reasoning, examples of output) by giving it instructions in e.g. [CLAUDE.md](http://CLAUDE.md) file.\n\nRE: architect role, it very much depends on the quality of context you give it to—that's what you want to focus on. Saying \"please write architectural documentation for an order management system\" is going to give you *something*, but most likely not what you want. On the other hand, steering the model in the right way can give you absolutely great output.\n\nRE: research capabilities—not sure, someone else can chime in.",
                  "score": 1,
                  "created_utc": "2025-12-29 12:02:57",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwnky2j",
          "author": "Lekrii",
          "text": "I'm an architect for everything in three lines of business (shortest projects are a few months long, the longest running project I have has been going for 2 1/2 years so far).\n\nI occasionally ask AI questions the same as I would search on Google, but other than that I don't really use AI.  My most valuable asset is my personal knowledge.  This is just my opinion, but I'd rather put in more time and be able to do the work myself.\n\nI know a lot of people will disagree, but I'm of the mindset that AI causes as many problems as it solves.  I use it very hesitantly.",
          "score": 2,
          "created_utc": "2025-12-30 01:52:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwpi3sd",
              "author": "Acceptable-End-4636",
              "text": "Here's the confusion - I do use my knowledge, but creating a detailed System Design document with a lot of things (architecture, infrastructure, security, business logic and more) - it takes a lot of time. My idea is like - talking to chat gpt within a Project, he gets my points but produces a clean, well-structured white paper, that it can keep updating when something comes up to my mind. Also, as you might know we could give it a specific role and behavior, which may result in challenging my thoughts and sometimes bringing up topics I forgot to put into white paper. Based on such documentation, you could later easily define tasks for developers or share it with higher management.",
              "score": 1,
              "created_utc": "2025-12-30 10:16:42",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwmp34l",
          "author": "gmosalazar",
          "text": "Depending on how far down the rabbit hole you want to go, I might also suggest using a local version of an LLM model instead of the cloud provided ones. That’d be one or two iterations deep.\n\nOverall I’m interested about this too, I just have a dedicated project with a major LLM provider that tracks .md files that I provide.",
          "score": 1,
          "created_utc": "2025-12-29 22:57:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwmy59y",
          "author": "SirOk748",
          "text": "At some point, the decisions you make may not make sense to others without context. Collaboration across teams or individuals will be easier when everyone can easily find answers or access to previous decisions. I highly recommend this short read : [https://decisionrecords.org/blog/how-should-teams-document-important-decisions](https://decisionrecords.org/blog/how-should-teams-document-important-decisions) \\- A tool I can recommend on this topic is [decisionrecords.org](http://decisionrecords.org)",
          "score": 1,
          "created_utc": "2025-12-29 23:46:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwu01ey",
          "author": "ElectronicFrame5726",
          "text": "You might be interested in [Where Architects Sit in the Era of AI](https://www.infoq.com/articles/architects-ai-era/) which is more of a meta perspective than a practical setup for an architect's workstation. As far as tooling is concerned, take a look at [Ask the Software Architect](https://www.exploravention.com/products/askarch/) which helps architects formulate plans for large initiatives such as major feature enhancements or paying down tech debt. In the context of the article, the tool would be an example of an AOTL model.",
          "score": 1,
          "created_utc": "2025-12-31 00:52:58",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pxpop7",
      "title": "Microservices as an Architecture vs. a Management Pattern",
      "subreddit": "softwarearchitecture",
      "url": "https://youtu.be/eEiKM8njGvk",
      "author": "parsaeisa",
      "created_utc": "2025-12-28 11:57:35",
      "score": 18,
      "num_comments": 1,
      "upvote_ratio": 0.83,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Article/Video",
      "permalink": "https://reddit.com/r/softwarearchitecture/comments/1pxpop7/microservices_as_an_architecture_vs_a_management/",
      "domain": "youtu.be",
      "is_self": false,
      "comments": [
        {
          "id": "nwe1u8c",
          "author": "SeniorIdiot",
          "text": "That was always the point. Conway's Law and DDD bounded contexts making a baby.",
          "score": 8,
          "created_utc": "2025-12-28 17:04:29",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pyppzt",
      "title": "Recommendations for Postgraduate Programs or MBAs in Software Architecture?",
      "subreddit": "softwarearchitecture",
      "url": "https://www.reddit.com/r/softwarearchitecture/comments/1pyppzt/recommendations_for_postgraduate_programs_or_mbas/",
      "author": "manubecks",
      "created_utc": "2025-12-29 15:51:17",
      "score": 10,
      "num_comments": 1,
      "upvote_ratio": 0.92,
      "text": "Hi everyone,\n\nI’m looking for recommendations for a postgraduate program or an MBA focused on Software Architecture.\n\nMy main interest is in programs that go beyond theory and cover real-world architectural decision making, such as:\n\nSystem design and architectural patterns\n\nScalability and distributed systems\n\nMicroservices vs monoliths\n\nCloud architecture and trade-offs\n\nDocumentation and communication of architecture\n\nOnline or on-site programs are both fine.\nIf you’ve taken a course yourself or have direct experience with one, I’d really appreciate your thoughts (pros/cons, depth, applicability in real projects, etc.).\n\nThanks in advance!",
      "is_original_content": false,
      "link_flair_text": "Discussion/Advice",
      "permalink": "https://reddit.com/r/softwarearchitecture/comments/1pyppzt/recommendations_for_postgraduate_programs_or_mbas/",
      "domain": "self.softwarearchitecture",
      "is_self": true,
      "comments": [
        {
          "id": "nwtvrj2",
          "author": "Great_Pattern_1988",
          "text": "You might not need a degree. SEI offers a certificate program that covers a lot of what you've listed.  Three courses and an exam.  You should at least look into it.",
          "score": 1,
          "created_utc": "2025-12-31 00:29:42",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pyniw7",
      "title": "How do you enforce escalation processes across teams?",
      "subreddit": "softwarearchitecture",
      "url": "https://www.reddit.com/r/softwarearchitecture/comments/1pyniw7/how_do_you_enforce_escalation_processes_across/",
      "author": "StartingVibe",
      "created_utc": "2025-12-29 14:23:26",
      "score": 10,
      "num_comments": 4,
      "upvote_ratio": 0.92,
      "text": "In environments with multiple teams and external dependencies, how do you enforce that escalation processes are actually respected?\n\nSpecifically:\n\n* required inputs are always provided\n* ownership is clear\n* escalations don’t rely on calls or tribal knowledge\n\nOr does it still mostly depend on people chasing others on Slack?\n\nLooking for real experiences, not theoretical frameworks.",
      "is_original_content": false,
      "link_flair_text": "Discussion/Advice",
      "permalink": "https://reddit.com/r/softwarearchitecture/comments/1pyniw7/how_do_you_enforce_escalation_processes_across/",
      "domain": "self.softwarearchitecture",
      "is_self": true,
      "comments": [
        {
          "id": "nwk66nc",
          "author": "ERP_Architect",
          "text": "In practice, escalation only works when it’s designed into the workflow, not documented as a process people are expected to remember.\n\nThe teams I’ve seen succeed do three things consistently. First, they make escalation entry structured. If required inputs aren’t there, the escalation literally can’t be raised. That removes back and forth and Slack chasing. Second, ownership is role based, not person based. A queue or rotation beats “ask whoever is around.” Third, escalations are visible by default. A shared board or system that shows status, age, and next action creates pressure without anyone nagging.\n\nIf escalation depends on calls or DMs, it’s already broken. People will always route around friction. The goal is to make the right path the easiest path, and the wrong one annoying enough that it fades out naturally.\n\nMost real improvements come from tightening intake and visibility, not adding more rules.",
          "score": 6,
          "created_utc": "2025-12-29 15:40:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwk8rn7",
              "author": "StartingVibe",
              "text": ">",
              "score": 2,
              "created_utc": "2025-12-29 15:52:43",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwjvcd6",
          "author": "ProbsNotManBearPig",
          "text": "My experience is only top down enforced processes work to cut across teams. You need actual standardized forms/templates and enforce they are filled out between handoffs as evidence. But if someone at the top isn’t enforcing people follow it, no one will. Or some will, but it doesn’t work if some don’t follow it. I find this to be an issue at larger companies where the only common upper management across teams might be VP level and they aren’t getting involved in these things. So then the solution is some levels of management down the chain need to coordinate and agree and they tend to be in their own worlds at big companies, not focused on coordinating with other directors on processes. \n\nSo all that is to say, it’s real easy in theory, but my experience is it’s hard at big companies where management of all the teams involved are not necessarily tightly synced on processes and their views on enforcing/following them. At smaller companies, the VP of engineering might actually be involved in these things and enforce that the different teams involved actually follow the processes. \n\nJust my experience. I’m sure some larger companies have their shit together, but I haven’t seen it myself.",
          "score": 2,
          "created_utc": "2025-12-29 14:45:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwjwlt3",
              "author": "StartingVibe",
              "text": "This matches what I’ve seen as well at my company. Defining processes and templates is the easy part. Enforcement is where things break, especially as orgs grow and management attention gets diluted.\n\nCurious: have you ever seen enforcement work *without* constant top-down pressure, or does it always come back to people chasing others?",
              "score": 1,
              "created_utc": "2025-12-29 14:51:50",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1pzj71f",
      "title": "Alternatives to apigee? anyone else frustrated just us",
      "subreddit": "softwarearchitecture",
      "url": "https://www.reddit.com/r/softwarearchitecture/comments/1pzj71f/alternatives_to_apigee_anyone_else_frustrated/",
      "author": "Ron_Swanson_1990",
      "created_utc": "2025-12-30 14:15:51",
      "score": 10,
      "num_comments": 5,
      "upvote_ratio": 1.0,
      "text": "We're on apigee and honestly considering other options, the GCP lock-in is annoying since we use multiple clouds, and our bill keeps climbing for features we barely use. Setting up new apis feels overly complicated with all the XML configs, and nobody on our team really understands how half of it works anymore.\n\nThe part that's frustrating is we started using kafka heavily this year and apigee doesn't support it at all so now we're managing two completely separate systems for apis and event streams. Anyone else dealing with this or found alternatives that handle both?",
      "is_original_content": false,
      "link_flair_text": "Discussion/Advice",
      "permalink": "https://reddit.com/r/softwarearchitecture/comments/1pzj71f/alternatives_to_apigee_anyone_else_frustrated/",
      "domain": "self.softwarearchitecture",
      "is_self": true,
      "comments": [
        {
          "id": "nwqga05",
          "author": "SpaceGerbil",
          "text": "Why would an API Gateway support event streams? Two completely different interface implementations. You may want to look at Kong as an API gateway alternative if you still need something enterprise worthy. If you want something no fuss lightweight, I've used Spring API Gateway",
          "score": 7,
          "created_utc": "2025-12-30 14:25:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwr3pu1",
              "author": "gaelfr38",
              "text": "I'm not sure I would ever recommend using this pattern (exposing Kafka through an API GW) but it does exist in several products, like in [Gravitee](https://www.gravitee.io/platform/kafka-gateway)",
              "score": 2,
              "created_utc": "2025-12-30 16:22:57",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nwqigkv",
          "author": "Exterminate007",
          "text": "google is clearly pushing everyone towards full gcp with apigeex, the on-prem version is basically abandonware at this point",
          "score": 4,
          "created_utc": "2025-12-30 14:37:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwqidvp",
          "author": "This_Minimum3579",
          "text": "the xml policy configuration in apigee is painful, feels like we're stuck in 2010",
          "score": 1,
          "created_utc": "2025-12-30 14:37:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwqiiq1",
          "author": "Maleficent_Mine_6741",
          "text": "we switched off apigee, we consolidated everything into gravitee handles both apis and kafka natively in one platform, the no code policy stuff is way easier than apigees xml configs and the developer portal auto generates docs from openapi spec, but real talk gravitee's graphql support is limited and the community is way smaller so troubleshooting obscure issues takes longer but at least we're not juggling two separate systems anymore",
          "score": 1,
          "created_utc": "2025-12-30 14:37:57",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pxefhk",
      "title": "A browser automation pattern for avoiding bot detection",
      "subreddit": "softwarearchitecture",
      "url": "https://www.reddit.com/r/softwarearchitecture/comments/1pxefhk/a_browser_automation_pattern_for_avoiding_bot/",
      "author": "8ta4",
      "created_utc": "2025-12-28 01:27:06",
      "score": 9,
      "num_comments": 2,
      "upvote_ratio": 0.72,
      "text": "Browser automation feels like an arms race. A framework like Playwright can leave a fingerprint that bot detectors are built to catch. So I started playing with a different approach: controlling your day-to-day browser.\n\n[What I built](https://github.com/8ta4/see) is a CLI that talks to a browser extension. It uses my browser's fingerprint. The goal is a clean bill of stealth.\n\nBut this approach has its downsides.\n\n- It relies on a companion extension, which adds setup friction. I yak-shaved [a tool](https://github.com/8ta4/extension) to automate installing extensions, so this is a solvable problem.\n\n- It's not built to run at a massive scale. You could spin up a bunch of browsers, but that's not a feature out of the box.\n\n- It lacks the interactivity of other frameworks. As u/Chromix_ pointed out in [another post](https://old.reddit.com/r/LocalLLaMA/comments/1o1u9ia/a_cli_to_scrape_pages_for_agents_by_piggybacking), not moving the mouse or typing could look suspicious. If you want to add that stuff, you have to change the extension's code yourself. That said, it hasn't been a problem in small-scale use so far.\n\n- A script gets access to your logged-in browser. That comes with a whole different set of risks, especially if you hook an LLM up to it.\n\nI put my thinking on this stuff into [a brain dump](https://github.com/8ta4/see/blob/81137f1139d5451cc3a2699f5bf05c804a176860/DONTREADME.md).\n\nWhat other approaches have you found effective for stealthy browser automation?",
      "is_original_content": false,
      "link_flair_text": "Discussion/Advice",
      "permalink": "https://reddit.com/r/softwarearchitecture/comments/1pxefhk/a_browser_automation_pattern_for_avoiding_bot/",
      "domain": "self.softwarearchitecture",
      "is_self": true,
      "comments": [
        {
          "id": "nwasgc1",
          "author": "asdfdelta",
          "text": "My day to day work deals with defeating some of these methods used at-scale and for huge profits. I've also created some anti-bot software myself.\n\nThe level of sophistication out there already is incredible. There is a ton of malware that only scrapes browser fingerprints, then you purchase them in bulk and run them all across your distributed bot network.\n\nOne area that seems to be in constant struggle is the client environment itself. Emulating human actions in a controlled method is super tricky, and a bot's greatest strength (numbers) is also the way it gets caught (aggregate data).",
          "score": 3,
          "created_utc": "2025-12-28 02:46:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwdb7kx",
              "author": "[deleted]",
              "text": "[deleted]",
              "score": 0,
              "created_utc": "2025-12-28 14:45:26",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nwdcuhe",
                  "author": "asdfdelta",
                  "text": "By fighting against bots that commit fraud with stolen credit cards? Sure, man...",
                  "score": 1,
                  "created_utc": "2025-12-28 14:55:02",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1pz3vkb",
      "title": "This is a detailed breakdown of a FinTech project from my consulting career.",
      "subreddit": "softwarearchitecture",
      "url": "https://lukasniessen.medium.com/this-is-a-detailed-breakdown-of-a-fintech-project-from-my-consulting-career-9ec61603709c",
      "author": "trolleid",
      "created_utc": "2025-12-30 00:59:09",
      "score": 9,
      "num_comments": 0,
      "upvote_ratio": 0.77,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Article/Video",
      "permalink": "https://reddit.com/r/softwarearchitecture/comments/1pz3vkb/this_is_a_detailed_breakdown_of_a_fintech_project/",
      "domain": "lukasniessen.medium.com",
      "is_self": false,
      "comments": []
    },
    {
      "id": "1pw5mgf",
      "title": "How do you design filters assuming the filters can evolve over time? Does it depend on how facts are already stored/designed in database on which filters act?",
      "subreddit": "softwarearchitecture",
      "url": "https://www.reddit.com/r/softwarearchitecture/comments/1pw5mgf/how_do_you_design_filters_assuming_the_filters/",
      "author": "lone-struggler",
      "created_utc": "2025-12-26 14:31:45",
      "score": 6,
      "num_comments": 2,
      "upvote_ratio": 0.88,
      "text": "EAV? JSON? rules/policy as facts? Filtering happening in application/db? What would be the best way if it needs to done fast but extensible so that it can turn to ideal design/",
      "is_original_content": false,
      "link_flair_text": "Discussion/Advice",
      "permalink": "https://reddit.com/r/softwarearchitecture/comments/1pw5mgf/how_do_you_design_filters_assuming_the_filters/",
      "domain": "self.softwarearchitecture",
      "is_self": true,
      "comments": [
        {
          "id": "nwj1ms9",
          "author": "RipProfessional3375",
          "text": "I'm not 100% sure what you mean by filters, but when I made a projector that needed to display a list of stored objects with various filters that could change over time, I created a postgres DB with 1 objects table which holds ID, binary, and one table of \"labels\" which holds object\\_id, key, value. I then populate the labels with some code to scan the objects and append the labels as needed.\n\nYou could also use a jsonb column and index jsonb searches directly.",
          "score": 1,
          "created_utc": "2025-12-29 11:24:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw11gsq",
          "author": "flavius-as",
          "text": "Using the appropriate database like solr or elasticsearch.",
          "score": -1,
          "created_utc": "2025-12-26 14:35:41",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pyoy5u",
      "title": "recommendations on books to architecture",
      "subreddit": "softwarearchitecture",
      "url": "https://www.reddit.com/r/softwarearchitecture/comments/1pyoy5u/recommendations_on_books_to_architecture/",
      "author": "deadGrimReaper",
      "created_utc": "2025-12-29 15:21:22",
      "score": 6,
      "num_comments": 4,
      "upvote_ratio": 0.8,
      "text": "I want to learn strategies to build software like DDD and the architectural patterns like onion or hexagonal, and then implementation patterns like CQRS, I don't want to be confused. is there a book that introduces these hierarchies? or if there are multiple books for each concept. I'm open to other sources like YouTube, too. thanks",
      "is_original_content": false,
      "link_flair_text": "Discussion/Advice",
      "permalink": "https://reddit.com/r/softwarearchitecture/comments/1pyoy5u/recommendations_on_books_to_architecture/",
      "domain": "self.softwarearchitecture",
      "is_self": true,
      "comments": [
        {
          "id": "nwkq5mz",
          "author": "Alzyros",
          "text": "There's a book recommendation megathread in this sub that's quite helpful",
          "score": 5,
          "created_utc": "2025-12-29 17:15:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwl62jh",
              "author": "deadGrimReaper",
              "text": "thanks, that was actually helpful",
              "score": 3,
              "created_utc": "2025-12-29 18:28:59",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwqbqmu",
          "author": "A_Mosaibh",
          "text": "https://preview.redd.it/rzr6a2zwkcag1.jpeg?width=1179&format=pjpg&auto=webp&s=ac12160c0e9965fa762c4672f2c3441085b3b6eb\n\nThis is a really great book",
          "score": 1,
          "created_utc": "2025-12-30 13:59:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwsrdkc",
          "author": "HyperDanon",
          "text": "- \"Hexagonal Architecture\" by Alistair Cockburn\n- \"Enterprise architecture\" by Martin Fowler\n- \"Clean Architecture\" by Robert Martin",
          "score": 1,
          "created_utc": "2025-12-30 21:03:16",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pwqsnc",
      "title": "Built this DevOps game. Please review!",
      "subreddit": "softwarearchitecture",
      "url": "https://uptime9999.vercel.app/",
      "author": "SignificanceFalse688",
      "created_utc": "2025-12-27 06:22:55",
      "score": 5,
      "num_comments": 5,
      "upvote_ratio": 0.66,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Tool/Product",
      "permalink": "https://reddit.com/r/softwarearchitecture/comments/1pwqsnc/built_this_devops_game_please_review/",
      "domain": "uptime9999.vercel.app",
      "is_self": false,
      "comments": [
        {
          "id": "nw5h78x",
          "author": "SignificanceFalse688",
          "text": "Play it on laptop or pc though! I haven't worked on making it playable on mobile Ul wise.",
          "score": 5,
          "created_utc": "2025-12-27 06:28:12",
          "is_submitter": true,
          "replies": [
            {
              "id": "nw978ux",
              "author": "Flaky_Smoke_5127",
              "text": "Are u a student?",
              "score": 2,
              "created_utc": "2025-12-27 21:22:47",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nwb97a6",
                  "author": "SignificanceFalse688",
                  "text": "Yes i am",
                  "score": 1,
                  "created_utc": "2025-12-28 04:31:25",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nw9aa5h",
          "author": "waxroy-finerayfool",
          "text": "It's broken, complaining about needing an Open API key for the dev server 😬",
          "score": 1,
          "created_utc": "2025-12-27 21:39:06",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pv1dwx",
      "title": "How do you debug algorithms running on the cloud?",
      "subreddit": "softwarearchitecture",
      "url": "https://www.reddit.com/r/softwarearchitecture/comments/1pv1dwx/how_do_you_debug_algorithms_running_on_the_cloud/",
      "author": "FaithlessnessFar298",
      "created_utc": "2025-12-25 00:37:59",
      "score": 4,
      "num_comments": 7,
      "upvote_ratio": 0.67,
      "text": "I am working on a pipeline that processes very large pdfs to extract relevant info. I developed it locally and saved the output of each stage as a text file or a report with console logging. This gave me good insight into what was going on and I am able to debug pretty quickly. \n\nAfter this I modified the pipeline to just pass data without saving files and reports so that it can run in a Google Cloud Run instance. This made me lose a lot of my insight into what was actually going on. \n\nHow do people generally debug sw on the cloud? I was thinking about making a core extraction package that is shared locally and with my cloud backend but wanted to hear from you guys what best practices are.\n\nThanks in advance!",
      "is_original_content": false,
      "link_flair_text": "Discussion/Advice",
      "permalink": "https://reddit.com/r/softwarearchitecture/comments/1pv1dwx/how_do_you_debug_algorithms_running_on_the_cloud/",
      "domain": "self.softwarearchitecture",
      "is_self": true,
      "comments": [
        {
          "id": "nvswdbm",
          "author": "sfboots",
          "text": "We have some jobs that write intermediate files during the processing.  These files remain on the disk for a while (3 to 30 days) so we can debug anything that fails, at least if we notice it quickly.   We do have a cron job that monitors free disk space after removing the older temporary files.  We are on AWS EC2 tho, not google.",
          "score": 6,
          "created_utc": "2025-12-25 00:44:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvsx9ij",
              "author": "Pto2",
              "text": "Super pragmatic approach: just automate what works locally!",
              "score": 1,
              "created_utc": "2025-12-25 00:51:06",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nvszb8n",
              "author": "FaithlessnessFar298",
              "text": "Thanks. This was helpful.",
              "score": 1,
              "created_utc": "2025-12-25 01:06:20",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nvvoe16",
          "author": "ERP_Architect",
          "text": "I’ve run into this exact transition pain. The mistake most people make is treating cloud debugging like local debugging, just without files.\n\nWhat usually works is making observability a first class part of the pipeline. Structured logs at stage boundaries, correlation IDs per document, and small sampled payload snapshots instead of full dumps. You don’t need everything, just enough to reconstruct what happened.\n\nSharing a core extraction package between local and cloud is a solid move. Keep it deterministic and side effect free, then wrap it differently for local inspection versus Cloud Run execution. Locally you can persist artifacts, in the cloud you emit metrics, timings, and selective debug output behind flags.\n\nIn practice, debugging in the cloud becomes less about stepping through code and more about asking “where did this diverge” using logs, metrics, and traces. Once you design for that, you regain most of the visibility you had locally without slowing the pipeline down.",
          "score": 2,
          "created_utc": "2025-12-25 15:21:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvwdjoq",
              "author": "polotek",
              "text": "I also recommend leaning into observability. A good framework is thinking \"what kind of days would help me debug problems like this in the future?\" Then instrument those things in the codebase and validate that the data comes through. You start to build a picture of your system that can give you confidence in near realtime any time you want.",
              "score": 1,
              "created_utc": "2025-12-25 17:53:08",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nvxgzc9",
          "author": "GrogRedLub4242",
          "text": "you don't debug algorithms but programs\n\nprograms (and algorithms) dont run on the cloud. programs run on computers. some computers could be described as being in The Cloud, which seems to be used as synonym for The Internet and often VMs rented from hosting providers like AWS",
          "score": 0,
          "created_utc": "2025-12-25 21:49:23",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pzobpu",
      "title": "Question on Data Aggregation",
      "subreddit": "softwarearchitecture",
      "url": "https://www.reddit.com/r/softwarearchitecture/comments/1pzobpu/question_on_data_aggregation/",
      "author": "Anoop_sdas",
      "created_utc": "2025-12-30 17:37:13",
      "score": 3,
      "num_comments": 4,
      "upvote_ratio": 0.8,
      "text": "Hello Guys ,\n\nCould any one please help on the below\n\n# Background\n\nClient has  bunch of monitoring tools which seems to monitor application health and all\n\n# Requirement\n\nAsk is that the data (output from these monitoring tools ) needs to be aggregated so that it could be feed into a command center(Dashboards  et al).\n\n# Question \n\nIs this a Data Engineering task or can we use any Agentic AI solution to this .\n\ncould any one please give some hints to form a solution to this requirement ?",
      "is_original_content": false,
      "link_flair_text": "Discussion/Advice",
      "permalink": "https://reddit.com/r/softwarearchitecture/comments/1pzobpu/question_on_data_aggregation/",
      "domain": "self.softwarearchitecture",
      "is_self": true,
      "comments": [
        {
          "id": "nwro35a",
          "author": "Lekrii",
          "text": "Honestly, that's not enough information.  I'd ask for wireframes of the dashboards they're expecting.  Without real, detailed requirements, you can't start thinking about a solution\n\nBefore giving a solution, I'd:\n\n1. Document the current state of the monitoring tools (contextual and software architecture)\n2. Document the data design of the data their tools use\n3. Wireframe the required dashboards they expect\n4. Ask for any standards (including approved technologies) you'd be expected to follow\n\nOnly after those are done would I start thinking about a solution",
          "score": 2,
          "created_utc": "2025-12-30 17:57:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwrsw1o",
          "author": "asdfdelta",
          "text": "Nothing production-grade is fully Agentic capable (yet). You will want data engineers to review the approach and the code generated in two separate steps.\n\nCoding assistants still remain, imho, a decent starting place as long as its use is guided by professionals who know what they're doing. In no uncertain terms is the outcome of AI by an unskilled hand going to produce anything other than problems and waste.",
          "score": 1,
          "created_utc": "2025-12-30 18:19:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwrxwgt",
          "author": "never-starting-over",
          "text": "First thing to come to mind for me is [Trino](https://trino.io/). It's free and open-source.\n\nI considered using it in the past for a similar problem. It lets you aggregate data of various shapes and sizes into SQL-queryable information. At that point you could prob go ahead and use that for the dashboards.\n\nSetting up Trino and the dashboards is something you could leverage agentic AI for.",
          "score": 1,
          "created_utc": "2025-12-30 18:42:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwsm277",
          "author": "gmosalazar",
          "text": "In addition to the other comments, I’d ask:\n- what’s the rate of change of the data?\n- what’s the format?\n- how often do are they expecting to be refreshed?\n- how much data are they hoping to track?\n- do they expect aggregates to be stored? If so, how long?\n\nPlenty of unknowns to solve for us strangers to help you.",
          "score": 1,
          "created_utc": "2025-12-30 20:37:53",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}