{
  "metadata": {
    "last_updated": "2026-02-14 02:59:58",
    "time_filter": "week",
    "subreddit": "softwarearchitecture",
    "total_items": 20,
    "total_comments": 87,
    "file_size_bytes": 132220
  },
  "items": [
    {
      "id": "1qy7oet",
      "title": "How to Design Systems That Actually Scale? Think Like a Senior Engineer",
      "subreddit": "softwarearchitecture",
      "url": "https://javarevisited.substack.com/p/how-to-scale-like-a-senior-engineer",
      "author": "javinpaul",
      "created_utc": "2026-02-07 07:36:48",
      "score": 82,
      "num_comments": 9,
      "upvote_ratio": 0.89,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Article/Video",
      "permalink": "https://reddit.com/r/softwarearchitecture/comments/1qy7oet/how_to_design_systems_that_actually_scale_think/",
      "domain": "javarevisited.substack.com",
      "is_self": false,
      "comments": [
        {
          "id": "o42a4ou",
          "author": "Ad3763_Throwaway",
          "text": "I rather have a developer which tells you that every problem requires another solution than one who re-iterates things like mentioned in the article.\n\n90% of scalability is just optimizing database queries. Learn how to monitor, troubleshoot and fix these and you can solve most scalability issues. SQL Server easily handles multiple thousands of requests per second.\n\nMultiple web servers / load balancing is mainly needed for always online systems, so you can take one offline to do updates on the other. Most software will never reach the point that the webserver is the limiting factor. You can easily do thousands of request per sec on most as long as you handle requests efficiently.\n\nSecurity is in most case just not inventing the wheel yourself. Use frameworks and don't write your own hashing / encryption algorithms.",
          "score": 33,
          "created_utc": "2026-02-07 11:12:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o42gvs7",
              "author": "bittrance",
              "text": "I would rather say that 90% of scalability is picking the right storage solution. RDBMs can indeed handle thousands of queries per seconds. That does not really qualify as scale. No amount of RDBM will serve millions of requests per second unaided.\n\nIt is indeed true that most software systems will never reach a scale worth mentioning. Unfortunately, this has produced a cadre of developers who do not know how to address non-trivial scale, leading them into diminishing return query optimization.",
              "score": 10,
              "created_utc": "2026-02-07 12:12:14",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o43g3n5",
                  "author": "FlatProtrusion",
                  "text": "How do you learn to address non-trivial scale?",
                  "score": 1,
                  "created_utc": "2026-02-07 15:44:11",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o449vbc",
              "author": "Ambitious-Sense2769",
              "text": "At scale we’re usually talking about millions of requests/transactions per second. Not thousands. Just having one sql db with proper indexing and query optimization still cannot handle millions of transactions per second. So that’s why people have to learn about things like sharding, load balancing, caching, etc. I agree most people won’t touch that scale but that isn’t really the point of “designing systems that scale”.",
              "score": 6,
              "created_utc": "2026-02-07 18:10:43",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o45glf8",
                  "author": "PmMeCuteDogsThanks",
                  "text": "But it is, there are so many clueless developers out there that think that everything needs to ”scale”. \n\nI agree, with millions of transactions per second you can’t use a single database. \n\nBut very few systems have that, and many of those can be optimised in-place. ",
                  "score": 3,
                  "created_utc": "2026-02-07 21:53:38",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o4f5eso",
                  "author": "ThlintoRatscar",
                  "text": "Scaling isn't just about mass.  It's about running out of possible resources and dealing with how to add more.\n\nSharding ( partitioning work into independent batches, dispatching the requests to the appropriate nodes, and coordinating answers and errors ), load balancing ( smoothing resource spikes ), and caching ( read sharding ) aren't just for databases.",
                  "score": 1,
                  "created_utc": "2026-02-09 12:09:22",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o46akik",
              "author": "yoggolian",
              "text": "Totally - a really good skill to have is being able to tell a scale problem from a tuning problem. An app we had with 25k users and maybe 1000 concurrent doesn’t need scaling solutions, it needs tuning (along with a bit of common sense, like don’t deploy 4x servers in a cluster to run a single container instance with auto scaling turned off, that’s also defined as the smallest possible size - I’m going to pull about $60k in annual cloud cost savings at $work there). ",
              "score": 2,
              "created_utc": "2026-02-08 00:50:13",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4e8iqu",
          "author": "TheLox95",
          "text": "[Let's handle 1 million requests per second](https://youtu.be/W4EwfEU8CGA?si=zgq03gv0GbkAu7Fu)",
          "score": 1,
          "created_utc": "2026-02-09 07:00:38",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r22ddq",
      "title": "How to Make Architecture Decisions: RFCs, ADRs, and Getting Everyone Aligned",
      "subreddit": "softwarearchitecture",
      "url": "https://lukasniessen.medium.com/how-to-make-architecture-decisions-rfcs-adrs-and-getting-everyone-aligned-ab82e5384d2f",
      "author": "trolleid",
      "created_utc": "2026-02-11 16:43:15",
      "score": 79,
      "num_comments": 6,
      "upvote_ratio": 0.99,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Article/Video",
      "permalink": "https://reddit.com/r/softwarearchitecture/comments/1r22ddq/how_to_make_architecture_decisions_rfcs_adrs_and/",
      "domain": "lukasniessen.medium.com",
      "is_self": false,
      "comments": [
        {
          "id": "o4tvk73",
          "author": "gantamk",
          "text": "Really solid breakdown, especially the priorities-over-pros/cons framing. That reframe alone would've saved me from a few bad decisions early on.\n\nOne thing I keep running into though - the RFC process works great when people actually have the context to evaluate options. But in practice, the architectural knowledge needed to write a good RFC (system boundaries, existing decisions, dependency chains) is often locked in someone's head or scattered across old docs.\n\nThe \"nobody comments\" problem you mentioned? I think a one of the reason might be people \"can't\" comment meaningfully because they don't have enough visibility into the system to know if Option B will break something three services away. Could they be just hesitant?\n\nThanks for writing this up.",
          "score": 15,
          "created_utc": "2026-02-11 17:08:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4wb206",
              "author": "devsgonewild",
              "text": "Thanks for the write up OP.\n\nIMO priorities should really be decided on before an RFC is presented. IME decision meetings can get off track and end up purely about the priorities. Especially in orgs where people (leadership incl.) don't read the RFCs in advance of decision meetings. My ideal approach is to approach stakeholders well before the RFC is presented and gather business priorities before exploring any options in an RFC, otherwise it can be a serious waste of time. \n\nI also like to include a list of \"non-priorities\". The latter in particular helped keep conversations on track (assuming we all agreed on them).\n\nI will say, given enough time I think people can gain context but the environment has to allow it. For example if there's a weekly/bi-weekly time blocked for presenting RFCs, each team can assign a representative and ideally that individual is given the time and space to gain the context needed, as questions and leave comments well before the meeting.\n\nIf they're not commenting consistently IMO that may be work environment issue.",
              "score": 2,
              "created_utc": "2026-02-12 00:19:18",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4zvcxb",
          "author": "spenpal_dev",
          "text": "!RemindMe 7 days",
          "score": 1,
          "created_utc": "2026-02-12 15:36:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4zvhte",
              "author": "RemindMeBot",
              "text": "I will be messaging you in 7 days on [**2026-02-19 15:36:26 UTC**](http://www.wolframalpha.com/input/?i=2026-02-19%2015:36:26%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/softwarearchitecture/comments/1r22ddq/how_to_make_architecture_decisions_rfcs_adrs_and/o4zvcxb/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fsoftwarearchitecture%2Fcomments%2F1r22ddq%2Fhow_to_make_architecture_decisions_rfcs_adrs_and%2Fo4zvcxb%2F%5D%0A%0ARemindMe%21%202026-02-19%2015%3A36%3A26%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201r22ddq)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
              "score": 1,
              "created_utc": "2026-02-12 15:37:06",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o51elt7",
          "author": "moqs",
          "text": "I dont see how it is feasible in a company with less then 20 engineer",
          "score": 1,
          "created_utc": "2026-02-12 19:55:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o55gtnv",
          "author": "Strikeman83",
          "text": "I would argue that an ADR with status \"draft\" is as good as an RFC. Also good to keep in source control, so you can see the thought process of the team why some drafts got proposed-> rejected or accepted",
          "score": 1,
          "created_utc": "2026-02-13 12:15:10",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r2ozez",
      "title": "I curated 106 software design resources — ADRs, architecture testing, real-world case studies from Spotify/Discord/Shopify",
      "subreddit": "softwarearchitecture",
      "url": "https://www.reddit.com/r/softwarearchitecture/comments/1r2ozez/i_curated_106_software_design_resources_adrs/",
      "author": "Ok-Recognition6223",
      "created_utc": "2026-02-12 09:26:06",
      "score": 75,
      "num_comments": 0,
      "upvote_ratio": 0.95,
      "text": "I've been organizing software design resources for a while and finally put together a curated list. Not a link dump - I went through hundreds and kept only what I'd actually recommend to a teammate.\n\n\n\nWhat makes it different from existing lists:\n\n\n\n• **14 real-world ADR examples** \\- Kubernetes KEPs, Spotify's ADR practice, Rust RFCs, [GOV.UK](http://GOV.UK) RFCs. Reading how these teams document decisions is more valuable than any template.\n\n• **Design verification tools** \\- ArchUnit (Java), arkitect (PHP), arch-go, konsist (Kotlin), dependency-cruiser (JS/TS). Architecture rules that run in CI, not rot in Confluence.\n\n• **Case studies over theory** \\- Shopify's modular monolith, Discord's Cassandra→ScyllaDB migration, Figma's CRDT-based multiplayer, Stripe's API versioning approach.\n\n• **Reference implementations** \\- not toy examples but production-grade repos with DDD, CQRS, Event Sourcing across Go, PHP, C#.\n\n[https://github.com/QDenka/awesome-software-design](https://github.com/QDenka/awesome-software-design)\n\n\n\nCurious what resources shaped your approach to software design the most? Always looking for things I might have missed.",
      "is_original_content": false,
      "link_flair_text": "Discussion/Advice",
      "permalink": "https://reddit.com/r/softwarearchitecture/comments/1r2ozez/i_curated_106_software_design_resources_adrs/",
      "domain": "self.softwarearchitecture",
      "is_self": true,
      "comments": []
    },
    {
      "id": "1r124hz",
      "title": "How do you keep software architecture documentation in sync with reality?",
      "subreddit": "softwarearchitecture",
      "url": "https://www.reddit.com/r/softwarearchitecture/comments/1r124hz/how_do_you_keep_software_architecture/",
      "author": "Elan8-com",
      "created_utc": "2026-02-10 14:25:17",
      "score": 54,
      "num_comments": 28,
      "upvote_ratio": 0.93,
      "text": "I’m trying to understand how people actually deal with architecture drift in real systems.\n\nIn most teams I’ve worked with:\n\n* There was a system or container diagram at some point\n* The code evolved faster than the diagrams\n* After a while, nobody fully trusts the architecture docs anymore\n* Updating them feels like overhead with little payoff\n\n\n\nTypical outcomes seem to be:\n\n* “The code is the documentation”\n* Diagrams only updated for onboarding or audits\n* Architecture knowledge living mostly in senior engineers’ heads\n\n\n\nI’m curious how this plays out in your environment:\n\n1. Do you actively maintain architecture diagrams? If yes, how?\n2. What usually causes them to become outdated?\n3. Have you found any approach that actually scales over time?\n4. Or did you consciously decide that keeping them in sync is not worth it?\n\nI’m asking because I’m experimenting with a more model-driven, text-based way of describing architecture that could be versioned and potentially checked against the codebase — but I’m not convinced this is a real problem for most teams.\n\nWould appreciate honest experiences, including “this is a solved problem” or “we stopped caring”.",
      "is_original_content": false,
      "link_flair_text": "Discussion/Advice",
      "permalink": "https://reddit.com/r/softwarearchitecture/comments/1r124hz/how_do_you_keep_software_architecture/",
      "domain": "self.softwarearchitecture",
      "is_self": true,
      "comments": [
        {
          "id": "o4mpq5a",
          "author": "zorecknor",
          "text": "Let me start by saying that if the code evove faster than the diagrams, then they are not Architectural diagrams but Technical Documentation. Software Architecture is the stuff that does not change that much over time.\n\nThink of it via the Building analogy. The Architecture Documentation would be the drawings of the facade (which  almost never change), the main blueprint stating where the structural/weight supporting columns/walls are, and guiding principles like windows should be either in the North or the Sourth so the building do not get too hot, or that exit doors to the building must open to the outside. Technical Documentation would be the blueprint with the layout of each floor, including electrical and plumbing.\n\nSo a sequence diagram describing the information flow of a particular Use Case? Not part of the architecture. A sequence diagram showing how any generic interaction between the Web client and the App will work, down to the database and potential cache interactions, without describing any particular implementation? That is part of the architecture.\n\n  \nThat said, in reality most teams just don't care because business don't care and do not want to pay the cost of having good, up-to-date technical documentation. So anything that could automate the generation of said documentation without too much friction will be a welcomed tool.",
          "score": 28,
          "created_utc": "2026-02-10 15:41:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4nx959",
              "author": "flavius-as",
              "text": "The code doesn't evolve faster than the diagrams.\n\nThe post is AI slop.",
              "score": 1,
              "created_utc": "2026-02-10 19:01:26",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4vprod",
                  "author": "LynxAfricaCan",
                  "text": "What ? Are you saying code waits for diagrams ? Devs wait for architecture ?",
                  "score": 1,
                  "created_utc": "2026-02-11 22:23:12",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o4r51yp",
                  "author": "gantamk",
                  "text": "With today's coding agents, it possibly could?",
                  "score": 0,
                  "created_utc": "2026-02-11 05:52:32",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4mhmmk",
          "author": "dimudesigns",
          "text": "I think this is ultimately more about culture than systems. If you cannot get your team to care about and value good documentation, then it will fall by the way side.\n\nFundamentally, most people are lazy. If they can justify not doing a task (and get away with that justification) they will simply not do it. The thing with technical debt is that it takes time to pile up. By the time it does, many devs have come and gone and they don't have to deal with the repercussions of it.\n\nAs a technical lead you'll have to actively engage in people engineering/wrangling. You'll have to find ways to make devs take ownership of their bits of the codebase and maintain them. Far easier said than done. And honestly there is no magic bullet that will get you there. \n\nThere are things you can try - SRE(Site Reliability Engineering) has really become a thing over the last few years and it has standard approaches that may help. Google's Well-Architected Framework may also provide some insights.\n\nWhatever path you take, dealing with people is always messy. You'll still have to figure out what works best for your organization and what doesn't.",
          "score": 6,
          "created_utc": "2026-02-10 15:01:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4pgqyk",
          "author": "younes_s",
          "text": "1. The code is and remains the source of truth\n2. I document concepts, technical and architectural decisions. The documentation is not here to explain the code, it's here to help the reader build a mental image that's not too detailed (otherwise they get lost and it gets outdated fast), and not too vague (otherwise it feels like marketing).",
          "score": 3,
          "created_utc": "2026-02-10 23:29:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4nlald",
          "author": "cto_resources",
          "text": "I agree with u/ohmygoditseverywhere \n\nYou do not need architecture documentation that requires updating with every pull request. Architecture is the stuff that does not change quickly. \n\nI would add that every time a product is released to production, core architecture documents should be reviewed for accuracy and updated. The agile concept of “done-done” applies to the release. \n\nOf course, for some teams, release to production happens very frequently as part of an automated CI/CD tool chain. Those teams will benefit for documents generated from code. Most other teams will not.\n\nSo if you are evaluating whether to build a tool, make sure (1) it can be run in a CI/CD tool chain to auto-update documents, (2) it is easy to debug and regenerate the documents to fix errors, and (3) recognize that it is producing low value documentation (which means you should not expect a large market value for the product).",
          "score": 3,
          "created_utc": "2026-02-10 18:07:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4qpjrw",
          "author": "mattsmith321",
          "text": "It’s not easy. First, someone has to care and make it a priority. Then they have to convince others it should be a priority. Then you have to get agreement on the diagram context. Overcoming the inertia and getting the organization is probably harder than doing the actual work. \n\nIn my case, I fell in love with the C4Model and the way Simon talked about context at different levels and focusing on one thing at a time. But where C4 focused on systems > applications > components > code, I needed something that looked up and not down to the code. The platform I supported is made up of ~250 applications which talked to a middleware platform even larger which talked to the legacy not a mainframe but essentially a mainframe. I needed something that started at the enterprise level like group/locations which contain platforms which host systems made up of applications deployed to different tiers. \n\nSo over the past five years I’ve built a helper system with a SQLite database which tracks my entities and the relationships, an ASP.NET web app which pulls the data from the db and renders dot output which I feed to Graphviz which renders the nodes and edges as an SVG image that I display in the browser which I can then drill up or down levels to change my context and what is displayed. I can then push a modified version of the dot graph into our wiki on to pages for each location / platform / system / tier / application. Oh, and I had someone build a utility which scans our config files to pull any external endpoints on a quarterly basis. I use that output to update my app links in my database. \n\nAnd yes, there are enterprise tools that can do this type of stuff for you but for a variety of reasons it is easier to just entertain myself with this project versus trying to jump through the bureaucracy hoops. But I think the biggest frustration is that so many people look at them and don’t quite get the value of having a canonical taxonomy of our applications and references to/from other applications. For me, when the latest consultant comes in and says we should replace the old SOAP service and it shouldn’t be that hard, I can show them the 30 other apps that call that SOAP service and all the apps that depend on that app. It brings reality into the conversation quickly. Or when our client doesn’t understand why we can’t just move to the cloud, I show a diagram with 200 applications and all of their relationships and interconnectedness and it usually gets quiet.\n\nAnyway, I like what I’ve built. Wish I could share. I know others have built more impressive things. But this scratched an itch I had for a long time.",
          "score": 3,
          "created_utc": "2026-02-11 03:57:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4r72tm",
              "author": "gantamk",
              "text": "\nYour impact analysis examples are exactly the use case that static diagrams can't touch. Showing someone the 30 apps calling that SOAP service must have changed the conversation.\n\nI am actually building something for this gap - Makes architectural relationships queryable across roles.\nYou've clearly thought deeply about this problem. Would love an opportunity to engage further and value your feedback if you're interested. Thank you",
              "score": 1,
              "created_utc": "2026-02-11 06:09:23",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4shizj",
                  "author": "mattsmith321",
                  "text": "You might check out this post as well. They needed and built something similar: https://www.reddit.com/r/programming/s/9CSRob8KSk",
                  "score": 1,
                  "created_utc": "2026-02-11 12:52:03",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4mpimk",
          "author": "Glove_Witty",
          "text": "I’ve had moderate success generating diagrams from the system. It needs to have a consistent structure though - eg cicd platform. There are some vendors on AWS that build tools for this - at least for the deployment architecture.",
          "score": 1,
          "created_utc": "2026-02-10 15:40:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4msvb9",
          "author": "Zzetttt",
          "text": "I agree with what you said, the bigger the project the more complex it is to keep design and code in sync. At one point the design gets so huge that nobody knows anymore which change in the code requires an update in the design.\n\nI know what people will say now: You are doing it wrong! You should first update the design and then start the implementation! The point is, especially when it is about refactoring (renaming/splitting/introducing new classes, moving methods around etc.) it is much more cumbersome to refactor a \"text\" than it is with actual code where the IDE knows all the dependencies and can trace where methods are called, classes are used and do the update resulting in a consistent state.\n\nMy experience what works out to some extent:\n\n\\- If you really do the design first (prescriptive), then you should be able to generate code or sync your existing code base with it\n\n\\- If you are happy with a design that documents your code (descriptive), then you could e.g. create a script that automatically generates PlantUML diagrams etc. based on your class structure\n\n\\- A good tracing also helps e.g. if you can trace design items to your code base (e.g. by introducing special tags) then everybody should better see where an update is necessary",
          "score": 1,
          "created_utc": "2026-02-10 15:56:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4mszb9",
          "author": "kikkoman23",
          "text": "it also doesn't make it easier with the code assist tools. meaning, they churn out .md files like nobody's business.  \nI know we can add custom prompts to iterate and clean up the docs.\n\nbut in reality, it all depends on the project and how far behind it is. b/c I'm sure you know. when things move fast, docs, are one thing people don't keep up with as much as they should....or maybe that's just been my experience.",
          "score": 1,
          "created_utc": "2026-02-10 15:56:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4n64q7",
          "author": "OhMyGodItsEverywhere",
          "text": "**One idea:** Combination of culture, process, and discipline.\n\nYou have to be working in an organization with a culture that won't punish you for spending the required time on documentation maintenance and process gates, versus shipping something with direct and apparent business (money) value.\n\nIf you could get that culture, you can set a process of: 1) Break work down into small, quick to deliver chunks, 2) Enforce relevant document updates in every PR, 3) Have a non-author review each PR, 4) *Always* reject if the documentation updates aren't adequate and correct, otherwise allow the merge. Documentation updates can potentially be automated, but still need review.\n\nIf you and your group can maintain the discipline to carry that process out, then the documentation stays more in sync. Practically speaking: between the force to deliver direct value ASAP and people making general mistakes, the drift is inevitable over time.\n\n**Another idea:** Identify which documentation is expected to drift, and treat it as disposable. Maintain the rest, naturally infrequently.\n\nAnother comment had an excellent point that there are architecture docs, and technical docs. Architecture docs should not be expected to change often, and updates to them can be enforced during PR review when the reality of the architecture changes. Technical documentation can be used as a launching pad to communicate ideas and get an implementation started up, but since these implementations can change requirements so often, the documentation might not be worth keeping once the software is written.\n\nSomething like user documentation might be another thing entirely, which could need updates frequently but is also important to keep and maintain; whether that is an external document, an in-application document, guide, or tutorial, or something else. Avoiding duplication of information reduces maintenance needs, but I guess that has to be balanced with formatting information properly for different audiences that need it too.",
          "score": 1,
          "created_utc": "2026-02-10 16:57:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4o34u3",
          "author": "GrogRedLub4242",
          "text": "I revise it",
          "score": 1,
          "created_utc": "2026-02-10 19:28:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4pztc8",
          "author": "narcisd",
          "text": "18 years of software development and I have yet to see a company that truely updates doc.\n\nMy theory is that most of the things we are building are not worth it. I assume the F35 fighter software is well documented. A eye surgery robotic firmware is well documented. Nuclear power stations software is well documented.\n\nAnother ERP, or you run of the mill business app, probably needs less docs and it’s still doable.\n\nJust some thoughts",
          "score": 1,
          "created_utc": "2026-02-11 01:19:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4r8w0n",
          "author": "gantamk",
          "text": "OP, \n\nIt's a real problem I think. Every team I've talked to follows the same pattern you described — diagrams start strong, code evolves faster, gap widens, and eventually architecture knowledge lives in people's heads. I, myself experienced this personally.\n\nThis problem is set to grow as codebase changes/changes due to coding agents, like Claude code. Eventually it would very difficult humans to track.\n\nThe model-driven, text-based approach you're experimenting with is the right direction I feel. \n\nBy the way, I'm building something in this space, focused on making architectural knowledge queryable rather than maintaining static diagrams. Happy to compare notes if useful.",
          "score": 1,
          "created_utc": "2026-02-11 06:24:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4rkqlh",
          "author": "rangorn",
          "text": "GitHub copilot. I have never had such a well documented project before.",
          "score": 1,
          "created_utc": "2026-02-11 08:12:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4tzjh1",
          "author": "piecepaper",
          "text": "in short: you dont.",
          "score": 1,
          "created_utc": "2026-02-11 17:27:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4v6i42",
          "author": "GozerDestructor",
          "text": "https://preview.redd.it/4higxd5ghxig1.png?width=640&format=png&auto=webp&s=7df9a6948f4ec8f3a18149f4f126b44014f0254a\n\n",
          "score": 1,
          "created_utc": "2026-02-11 20:50:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o526xz8",
          "author": "SamfromLucidSoftware",
          "text": "You can keep one high-level diagram where people can see what a change might affect. The problems with diagrams start when they try to match every detail in the code.\n\nKeep it small and treat it like code. If a PR changes dependencies or data flow, you can update the diagram in that PR. If it doesn’t, you can leave it alone.\n\nIf the diagram isn’t helping someone make a call, it’s probably too detailed. I would trim it back or drop it. But by keeping things relatively simple like this, it’s a lot easier to keep your documentation up to date.",
          "score": 1,
          "created_utc": "2026-02-12 22:11:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4mguww",
          "author": "alien3d",
          "text": "old time , any changes must reflect data flow diagram . New era might call as business requirement document or new modern one update to md file . md - markdown .",
          "score": 1,
          "created_utc": "2026-02-10 14:57:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4n0vgj",
          "author": "realsgy",
          "text": "I put it in my CLAUDE.md to update documentation with every commit.\n\nSometimes I need to prompt for missing updates but in general, it is doing a good job.",
          "score": -6,
          "created_utc": "2026-02-10 16:33:17",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qzv32f",
      "title": "How do you validate architecture decisions early without senior review?",
      "subreddit": "softwarearchitecture",
      "url": "https://www.reddit.com/r/softwarearchitecture/comments/1qzv32f/how_do_you_validate_architecture_decisions_early/",
      "author": "MainWild1290",
      "created_utc": "2026-02-09 04:53:26",
      "score": 48,
      "num_comments": 36,
      "upvote_ratio": 0.94,
      "text": "When designing systems I often struggle with questions like:\n\n* Will this Kafka setup handle real production load?\n* Should I scale DB with replicas or caching first?\n* Is this architecture fine or secretly fragile?\n\nSenior architecture reviews are valuable but not always accessible, and generic AI answers often feel shallow.\n\n**I'm curious:**\n\nHow do experienced engineers validate architecture decisions early?\n\n* Do you rely on design patterns?\n* Internal review processes?\n* Load testing?\n* Something else?\n\nI'm exploring ways to structure architecture reasoning better, so really interested in hearing real workflows from this community.",
      "is_original_content": false,
      "link_flair_text": "Discussion/Advice",
      "permalink": "https://reddit.com/r/softwarearchitecture/comments/1qzv32f/how_do_you_validate_architecture_decisions_early/",
      "domain": "self.softwarearchitecture",
      "is_self": true,
      "comments": [
        {
          "id": "o4e6zu4",
          "author": "ronakg",
          "text": "You should be discussing important architectural decisions with other members of the team during other forums or 1:1s. Brainstorming ideas is one of the most important aspects of designing something big. When I finally have the design doc ready, I mention all such folks as contributors to the design. Don't try to build things on your own.",
          "score": 30,
          "created_utc": "2026-02-09 06:47:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4evpog",
              "author": "SkyPL",
              "text": "Remember the dangers of the design by committee - any such group discussion should be made with an appropriate means of mitigating the risks of outspoken people with Dunning-Kruger derailing the architecture.",
              "score": 8,
              "created_utc": "2026-02-09 10:46:04",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4f05vf",
                  "author": "Ok_Slide4905",
                  "text": "Yeah that’s why most docs have approved reviewers. Anyone can view and comment but only approved reviewers can sign off. No different from code review.",
                  "score": 2,
                  "created_utc": "2026-02-09 11:26:20",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4dzn3c",
          "author": "WhirlyDurvy",
          "text": "A lot of my prevalidation comes from experience. When I don't have experience in a particular technology, I set up a dummy load test in isolation to try to break it, then scale accordingly. \n\nBut before launching something major that's going to see large load quickly, you want to understand your account service limits, have a full model of the scaling profile of each technology, a real integration scale test in dev, and a fall back plan.",
          "score": 18,
          "created_utc": "2026-02-09 05:44:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4e1xr2",
              "author": "MainWild1290",
              "text": "Do you follow a checklist when evaluating architecture risks, or is it more intuition built from experience? one thing i m exploring is whether structural reasoning prompts could help less experienced engineers think through these same steps earlier.",
              "score": 3,
              "created_utc": "2026-02-09 06:03:35",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4e4qrs",
                  "author": "No-Risk-7677",
                  "text": "When it comes to risks ATAM might be what you are looking for: https://youtu.be/fsLe8Q3oTEQ?si=gGeqObdcE5u7y9Fd",
                  "score": 3,
                  "created_utc": "2026-02-09 06:27:20",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o4gai3y",
              "author": "LordWecker",
              "text": "I like that you renamed it _pre_validation. \n\nWith experience people get better at guessing what will be valid, but real validation is whether or not it performs its goals.",
              "score": 1,
              "created_utc": "2026-02-09 16:06:06",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4gvu8w",
          "author": "BanaTibor",
          "text": "The telltale sign of a good architecture that it is easy to change. The real question is not \"will this handle the load?\" but \"how hard will it be to change?\".",
          "score": 6,
          "created_utc": "2026-02-09 17:47:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4kgdbe",
              "author": "MainWild1290",
              "text": "Yaa thats great, thank you",
              "score": 2,
              "created_utc": "2026-02-10 05:35:40",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4dztll",
          "author": "flavius-as",
          "text": "Disclaimer: the following has been generated with AI, by a prompt I've been working on for over a year, with many biases built-in (over 100 rules and principles). Specifically for your questions I've instructed it specifically to focus on the time dimension of decision making.\n\nHere it goes, as if I worded it, only better (English is not my native language) and properly formatted.\n\n**Architecture is not an engineering standard; it is a derivative function of business intent.**\n\nThe mistake most developers make is trying to validate their designs against \"Best Practices\" or abstract notions of \"Scale.\" A Senior Architect doesn't do that. They validate against the organization's runway.\n\nIf you lack a mentor to review your work, you must simulate this mindset by filtering every decision through the current stage of your company.\n\n### 1. The \"Survival\" Filter (Pre-Product/Market Fit)\nIn this phase, the organization is testing hypotheses. The biggest risk isn't \"system failure\"; it's building the wrong thing efficiently.\n*   **Validation Rule:** Optimize for **Reversibility**.\n*   **The Kafka Decision:** If you ask \"Will Kafka handle the load?\", you are asking the wrong question. The right question is: \"Does the operational tax of running Kafka prevent us from pivoting next month?\"\n*   **Verdict:** Kafka is likely invalid here. It forces structural rigidity. A monolith with a simple Postgres job queue is \"valid\" because it’s easy to delete or change when the business idea fails.\n\n### 2. The \"Sales Promise\" Filter (Growth Phase)\nOnce the business has traction, validation shifts from \"Can we change it?\" to \"Can we honor the contract?\"\n*   **Validation Rule:** Optimize for **The specific promise Sales made.**\n*   **Replica vs. Caching:** Don't choose based on tech blogs. Look at the Service Level Agreement (SLA).\n    *   **Scenario A:** Sales sold a financial reporting tool. The promise is **Accuracy**. Caching is now a liability because stale data breaks the promise. You validate by proving you can scale via Read Replicas (ACID compliance).\n    *   **Scenario B:** Sales sold a social feed. The promise is **Responsiveness**. Stale data is annoying but acceptable. You validate by implementing aggressive Caching (Redis/CDN).\n\n### 3. The \"Fermi\" Filter (The Math Check)\nExperienced engineers rarely guess about load. We use **Fermi Estimation** to prove safety before writing code. This is your strongest tool against \"Imposter Syndrome.\"\n\n**The Calculation:**\nDon't worry about \"Real Production Load\" in the abstract. Calculate it.\n*   **Formula:** `Total Users` × `Daily Active %` × `Requests Per User` ÷ `Seconds in Day`.\n*   **Example:** 100k users. 10% active. 50 clicks each.\n    *   `10,000 users * 50 reqs = 500,000 reqs/day`.\n    *   `500,000 / 86,400 seconds = ~5.7 requests per second`.\n*   **The Validation:** A Raspberry Pi can handle 6 requests per second. You don't need Kubernetes; you need a single VPS. Decision validated.\n\n### 4. The \"Bus Factor\" Filter (Secret Fragility)\nYou asked: *\"Is this architecture fine or secretly fragile?\"*\n\nFragility is rarely about code breaking; it's about **Cognitive Solvency**. The \"cost\" of an architecture is the amount of human memory required to operate it.\n\n*   **The Test:** If you (the architect) are asleep or hit by a bus, can the most junior person on the team fix a critical bug at 3 AM?\n*   **The Trap:** If your \"valid\" architecture requires understanding Event Sourcing, three different message brokers, and a custom sharding layer, it is structurally insolvent for a small team.\n\n**Summary:**\nTo validate early, stop looking for \"correctness.\" Look for alignment.\n*   **Early Stage:** Valid = Reversible.\n*   **Growth Stage:** Valid = Honors the SLA.\n*   **Scale Stage:** Valid = Reduces Cognitive Load per developer.\n\nFor what it's worth, I've seen more startups die from over-engineering \"Google-scale\" solutions for zero users than from their servers melting down. Build for the problem you have right now.",
          "score": 11,
          "created_utc": "2026-02-09 05:46:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4el2wl",
              "author": "DER_PROKRASTINATOR",
              "text": "This is really good, AI-generated or not. Optimizing for reversibility in the beginning was a huge take-away over my career, after seeing projects fail.",
              "score": 5,
              "created_utc": "2026-02-09 09:01:15",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o4e1gst",
              "author": "flavius-as",
              "text": "It's crazy people don't look at the actual content. A shame.",
              "score": 6,
              "created_utc": "2026-02-09 05:59:41",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o4e5bzl",
              "author": "No-Risk-7677",
              "text": "Awesome explanations.\n\nWhere can I read more about theses filters 1 - 4?",
              "score": 1,
              "created_utc": "2026-02-09 06:32:26",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4e5u97",
                  "author": "flavius-as",
                  "text": "It leans a lot into 3X by Kent Beck.\n\nhttps://www.oreilly.com/library/view/tidy-first/9781098151232/",
                  "score": 3,
                  "created_utc": "2026-02-09 06:36:53",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o4g1qpe",
              "author": "flavius-as",
              "text": "What I use to plan the switch from one strategy to the next:\n\nPlanning meetings with business people which I shadow, to gauge where they want to take the company in the next 3, 6, 12, 24 months.",
              "score": 1,
              "created_utc": "2026-02-09 15:23:38",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o4y1sb4",
              "author": "autisticpig",
              "text": "Good addition to this thread",
              "score": 1,
              "created_utc": "2026-02-12 07:38:34",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4i6skt",
          "author": "theycanttell",
          "text": "Performance testing",
          "score": 2,
          "created_utc": "2026-02-09 21:35:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4kh0md",
              "author": "MainWild1290",
              "text": "Yaa, sometimes real performance testing gives much clearer signals than just guessing early.",
              "score": 1,
              "created_utc": "2026-02-10 05:40:45",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4jc54z",
          "author": "Both-Fondant-4801",
          "text": "How do you validate architecture decisions early without senior review? .. well most of the time you don't and you can't. Hence the usual practice would be to develop POC's, proof of concepts to validate that the system is feasible.. and with some load testing, be able to show with numbers and some level of objectivity how the system would eventually scale. ",
          "score": 2,
          "created_utc": "2026-02-10 01:18:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4kieut",
              "author": "MainWild1290",
              "text": "Yaa, got it, building POCs and validating with real numbers seems like a practical way to reduce uncertainty early. Thanks you",
              "score": 2,
              "created_utc": "2026-02-10 05:51:53",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4e7w0w",
          "author": "JackSpyder",
          "text": "Discuss, design, hypothesise and test to validate.\n\nIf youre making a big change to solve X. You need to measure X now, and measure X afterwards. Otherwise you're just pissing in the wind.",
          "score": 2,
          "created_utc": "2026-02-09 06:54:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4fzwpo",
              "author": "MainWild1290",
              "text": "Got it and do you usually decide what to measure before making the change?",
              "score": 1,
              "created_utc": "2026-02-09 15:14:21",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4g082e",
                  "author": "JackSpyder",
                  "text": "Are you changing something or building new?\n\nWhat are the goals and outcomes?\n\nThis really becomes a bit boring typical \"it depends\" lol.",
                  "score": 2,
                  "created_utc": "2026-02-09 15:16:00",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4ebuvu",
          "author": "dariusbiggs",
          "text": "You don't even consider those questions initially.\n\nKeep it as simple as possible, the biggest costs to focus on are Security, Privacy, Observability, and Testing. Everything else is a secondary concern.\n\nLoad testing is a part of Testing, this gives you actionable data from your Observability systems. Only with good Observability can intelligent and informed decisions be made on the questions you asked regarding horizontal and vertical scaling of various components.\n\nReal data from your Observability systems provide the necessary information needed about how and what the end users need/use.\n\nAll of the third party systems are interfaces to a service. Your database service, your event notification bus is a service, etc. You don't care at the design time about what implementation is used, all you care about is what you need the service to do.\n\nYou should know and understand the basic tools and patterns, idempotency, CQRS, event sourcing, event streaming, BDD, TDD, DDD, REST, PubSub, Database normalization, etc. That allows you to identify which pattern or approach is best for the various components of the things being designed.",
          "score": 2,
          "created_utc": "2026-02-09 07:31:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4fzbd9",
              "author": "MainWild1290",
              "text": "Do you usually plan monitoring and logging from the beginning, or add it later as the system grows?",
              "score": 1,
              "created_utc": "2026-02-09 15:11:20",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4ht1ft",
                  "author": "dariusbiggs",
                  "text": "Observability from the start, without it you know nothing about your software.",
                  "score": 3,
                  "created_utc": "2026-02-09 20:27:31",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4du6bn",
          "author": "alien3d",
          "text": "real advise as senior . stop thinking . Delegate delegate . Is this static information rarely change - cdn . It is reusable session cross server - redis . Even some old senior trap in this scenario, we want all those  latest thing but it is really working ?",
          "score": 3,
          "created_utc": "2026-02-09 05:03:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4eb99x",
          "author": "Charming-Raspberry77",
          "text": "A senior review is not always fool proof either. I am a firm believer on clean architecture + early load testing on the dev/staging environment. Just keep it simple and load it yourself, even at the poc stage most ghosts will come out.",
          "score": 2,
          "created_utc": "2026-02-09 07:25:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4frxry",
              "author": "MainWild1290",
              "text": "When you do early load testing, do you try to simulate real user behavior or just push the system hard to see where it breaks?",
              "score": 1,
              "created_utc": "2026-02-09 14:31:49",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4h16pt",
                  "author": "Charming-Raspberry77",
                  "text": "I write small scenarios with a tool such as gatling. Any system/ hardware will break the how is very important.",
                  "score": 2,
                  "created_utc": "2026-02-09 18:12:47",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qzib6d",
      "title": "Caching in 2026: Fundamentals, Invalidation, and Why It Matters More Than Ever",
      "subreddit": "softwarearchitecture",
      "url": "https://lukasniessen.medium.com/caching-in-2026-fundamentals-invalidation-and-why-it-matters-more-than-ever-867fee46e98b",
      "author": "trolleid",
      "created_utc": "2026-02-08 19:30:26",
      "score": 29,
      "num_comments": 1,
      "upvote_ratio": 0.91,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Article/Video",
      "permalink": "https://reddit.com/r/softwarearchitecture/comments/1qzib6d/caching_in_2026_fundamentals_invalidation_and_why/",
      "domain": "lukasniessen.medium.com",
      "is_self": false,
      "comments": [
        {
          "id": "o51x2a6",
          "author": "shufflepoint",
          "text": "Good succinct overview of Caching. ",
          "score": 1,
          "created_utc": "2026-02-12 21:23:39",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r218t5",
      "title": "Server performance metrics for an architecture audit",
      "subreddit": "softwarearchitecture",
      "url": "https://www.reddit.com/r/softwarearchitecture/comments/1r218t5/server_performance_metrics_for_an_architecture/",
      "author": "s3ktor_13",
      "created_utc": "2026-02-11 16:01:23",
      "score": 22,
      "num_comments": 4,
      "upvote_ratio": 0.96,
      "text": "Hi everyone,\n\nI’m transitionating into an Architecture role at my company and have the opportunity to define our observability strategy from scratch, giving us the chance to redesign the architecture for greater resilience and scalability if needed.\n\nI want to avoid just dumping default metrics (CPU, RAM, generic HTTP counts) onto a dashboard that nobody looks at. I want to build a baseline that actually reveals the architectural health and stability of the platform.\n\nI have been reading several blog posts like [this](https://raygun.com/blog/server-performance-metrics/). but I know theory often diverges from reality, so I wanted to get different perspectives from the community.\n\nIf you were auditing a system from scratch and could only pick a handful of metrics to determine if the architecture is sound (or burning down), what would be on your \"Must-Have\" list?\n\nThanks for sharing your wisdom!",
      "is_original_content": false,
      "link_flair_text": "Discussion/Advice",
      "permalink": "https://reddit.com/r/softwarearchitecture/comments/1r218t5/server_performance_metrics_for_an_architecture/",
      "domain": "self.softwarearchitecture",
      "is_self": true,
      "comments": [
        {
          "id": "o4ti0rx",
          "author": "diroussel",
          "text": "Make sure you choose some metrics that are meaningful to the business and the end user. Then you can see how they correlate to technical metrics. No point in fretting about requests per second if it has no impact on value creation.",
          "score": 8,
          "created_utc": "2026-02-11 16:05:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4u2ah4",
          "author": "ccb621",
          "text": "Read this: https://www.honeycomb.io/observability-engineering-oreilly-book\n\nYou need logs and traces that are relevant to actual user behavior. Your server can be perfectly “healthy” while end users experience errors or high latency. ",
          "score": 5,
          "created_utc": "2026-02-11 17:40:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4tj3o5",
          "author": "gantamk",
          "text": " I don't have deep observability expertise specifically, but one thing I've seen repeatedly when teams set up architectural health monitoring from scratch:\nThe metrics themselves might not be harder part, \nBut  keeping track of it.\n\nSince you're building this from scratch, I'd suggest documenting the reasoning behind each metric alongside the dashboards - not just \"we track X\" but \"we track X because it reveals Y about our service boundaries.\"\n\n That context is what makes the difference between a dashboard people use vs one that \"nobody looks at\" (exactly the problem you described wanting to avoid).\n\nCurious what architecture pattern you're working with - microservices, modular monolith, something else?",
          "score": 2,
          "created_utc": "2026-02-11 16:10:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4xepbo",
          "author": "Ok_Cranberry4354",
          "text": "Avoiding a wall of default infrastructure metrics is exactly the right instinct, CPU and memory have their place but they rarely explain why users are unhappy or whether the architecture itself is under stress. What has worked well for me in my last projects is designing around a few simple questions instead of a giant grid of graphs like \"are we slower than we should be\", and if so, \"what are we waiting on?\", etc, shift our perspective a bit as software engineers\n\nWhen responses start stretching, the service you're staring at usually isn't the real problem, it's waiting on something else like a database call, a cache lookup, another internal service, some external API or dependency. That's why if you can see how a request's time is actually broken down across those hops you can pinpoint where the issue is, which is why we even bother with this observability stuff in the first place.\n\nOn my projects I care a lot about knowing how close we are to an actual bottleneck so I can sleep at night, because a service can sit at 70-80% and be perfectly stable,what worries me is when utilization is high and you see in-flight requests climbing, connection pools filling up, queue depth increasing and latency starting to stretch under the same load. This is the combination that usually means you're no longer just \"busy\", you're hitting a constraint somewehre and the system is starting to amplify it. From an architectural standpoint, that's a very different signal than a box that's simply working hard.\n\nIf I were doing this from scratch, I'd optimize for direction. When something feels off, you should be able to open a dashboard and quickly answer \"are users actually slower\", \"which layer stretched first\", and \"what is it waiting on\"? If your setup makes those answers obvious, you're in good shape. You can also add facts to the questions list that ensure your system is healthy, think of it as conditions and targets that the system always needs to behave and achieve otherwise probably something's off, that's why it's hard to simply give you a set of questions, a lot of it is also thinking around your project's business model so you can have a strategy that makes more sense, at least in terms of priority when you're just starting\n\nI very recently helped write an article that walks through a concrete example of this approach if you want to take a look (it focuses a lot on setting stuff up but the mental flow in there should help you a bit in the process of creating the list of questions you're looking for)\n\n[https://arg-software.medium.com/how-we-debug-slow-microservices-in-18-minutes-not-4-hours-a-prometheus-opentelemetry-guide-0d7b551d1722](https://arg-software.medium.com/how-we-debug-slow-microservices-in-18-minutes-not-4-hours-a-prometheus-opentelemetry-guide-0d7b551d1722)\n\nThe article is obviously only one slice of observability, it can go much deeper. I'm always interested in what other teams rely on as their early warning signals and to discuss and learn from them.",
          "score": 2,
          "created_utc": "2026-02-12 04:24:44",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r08fhs",
      "title": "Event sourcing vs event streams",
      "subreddit": "softwarearchitecture",
      "url": "https://www.reddit.com/r/softwarearchitecture/comments/1r08fhs/event_sourcing_vs_event_streams/",
      "author": "Ok-Scientist9904",
      "created_utc": "2026-02-09 16:15:18",
      "score": 20,
      "num_comments": 11,
      "upvote_ratio": 0.86,
      "text": "I am having a fairly hard time try to differentiate at a high level how event sourcing and event streams are different. Is it just that event sourcing came from DDD world and event streams from the internet companies. Both give me immutability, both allow me to build my views/projections from the events, both give me audit, both allow other processes to listen and do something. So are they the same?",
      "is_original_content": false,
      "link_flair_text": "Discussion/Advice",
      "permalink": "https://reddit.com/r/softwarearchitecture/comments/1r08fhs/event_sourcing_vs_event_streams/",
      "domain": "self.softwarearchitecture",
      "is_self": true,
      "comments": [
        {
          "id": "o4hdfkt",
          "author": "jacobatz",
          "text": "Event sourcing means using events as the source of truth for the state of your system. Ie. you need to project the state from the recorded events to know the state of the system.\n\nEvent streaming on the other hand just means using a stream of events for some purpose. For instance to communicate change to the domain between systems.",
          "score": 11,
          "created_utc": "2026-02-09 19:10:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4gczco",
          "author": "flavius-as",
          "text": "Event sourcing goes through an event stream, one event at a time, to create a projection into an aggregate root.",
          "score": 10,
          "created_utc": "2026-02-09 16:17:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ge6sa",
          "author": "ch1pch4p",
          "text": "No, not the same. \n\nEvent Sourcing - events are stored sequentially and can be used to recreate a state of the app (like you said, be projected from to represent a relational data model, if you so pleased). \nEvent Streaming - could mean one or more things: how the events are transported (think Kafka or Kinesis). Or could mean instead of batching things, it's done one after another, which then those streams can be \"widened\" to allow for more parallel event processing to take place\n\nAt least that's my 0.05 cents (bye bye pennies)\n\nBig morale of the story - Ubiquitous language strikes again. Might be a good app idea... Tech Dictionary! Probably already out there.",
          "score": 7,
          "created_utc": "2026-02-09 16:23:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4gmw9x",
              "author": "gbrennon",
              "text": "🤣",
              "score": 1,
              "created_utc": "2026-02-09 17:04:51",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4imaxe",
          "author": "No_Package_9237",
          "text": "https://event-driven.io/en/event_streaming_is_not_event_sourcing/ is an excellent article on the topic you mention",
          "score": 3,
          "created_utc": "2026-02-09 22:54:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4gs13l",
          "author": "ufukty",
          "text": "They are as same as Java and JavaScript ;)\n\nThere is a quite good conference recording on YouTube explaining many reasons and quirks of event sourcing in a very short amount of time and in a very clear way. I don’t remember the name sadly. He was talking about ES experience in banking, cost of ES decreasing with storage prices, storing previous versions of the application to be able to restore the previous state from snapshots later etc.",
          "score": 2,
          "created_utc": "2026-02-09 17:29:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4hyuot",
          "author": "utilitydelta",
          "text": "Event Sourcing == deterministic, per-aggregate ordering && optimistic concurrency control on append. that's an event sourcing database. Everything else is Event Streaming. For example, if Kafka implemented [https://issues.apache.org/jira/browse/KAFKA-2260](https://issues.apache.org/jira/browse/KAFKA-2260) you could classify it as an event sourcing database, as long as you used the aggregate id as the message key and never re-balanced partitions.",
          "score": 2,
          "created_utc": "2026-02-09 20:55:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4l2hgi",
          "author": "lutzh-reddit",
          "text": "Unfortunately \"event stream\" is not very well defined. It's also used for a sequence of events in event sourcing that are connected, e.g. relate to the same entity. Case in point: [https://docs.kurrent.io/getting-started/concepts.html#event-stream](https://docs.kurrent.io/getting-started/concepts.html#event-stream)",
          "score": 1,
          "created_utc": "2026-02-10 08:55:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4l2tuo",
          "author": "lutzh-reddit",
          "text": "Event Sourcing: A persistence strategy within a service.  \nEvent Streaming: A communication pattern between services.\n\nI try to explain it in this blog post: [https://www.reactivesystems.eu/2022/06/09/event-collaboration-event-sourcing.html](https://www.reactivesystems.eu/2022/06/09/event-collaboration-event-sourcing.html)\n\nhttps://preview.redd.it/m3pi4cq8tmig1.jpeg?width=640&format=pjpg&auto=webp&s=763c7eb44f577268754943578d055c420d901384",
          "score": 1,
          "created_utc": "2026-02-10 08:58:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4gr2uk",
          "author": "kqr_one",
          "text": "event sourcing - storing data within module \n\nevent stream - moving data between modules",
          "score": 1,
          "created_utc": "2026-02-09 17:24:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4irh64",
          "author": "paradroid78",
          "text": "An event stream is exactly what it says. A stream of events. It makes no statement about where the events come from, what they mean, or how they should be consumed. As per another comment, it's just a way of moving data around.\n\nEvent sourcing is when your actual source of truth is a list of events rather than a traditional relational model, and the only way to reason about the current state of your data is to replay those events and aggregate them into a meaningful model (which is usually snapshotted at regularly intervals to save you having to replay every event from the start of time just to run simple queries against your data). It's inspired by accounting ledgers, and typically paired with CQRS, which means different consumers of your events can do their own aggregation and maintain their own \"projections\".\n\nIn its most purist form, this is often not a great fit for a lot of problem spaces, so a lot of real-world systems are built on hybrid architectures instead, meaning they adopt parts of event sourcing, but the system of record remains a traditional database.",
          "score": 0,
          "created_utc": "2026-02-09 23:22:00",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r3c8aw",
      "title": "Looking to understand backend architecture challenges - 10Y AWS experience, happy to discuss",
      "subreddit": "softwarearchitecture",
      "url": "https://www.reddit.com/r/softwarearchitecture/comments/1r3c8aw/looking_to_understand_backend_architecture/",
      "author": "Busy_Weather_7064",
      "created_utc": "2026-02-13 01:48:03",
      "score": 18,
      "num_comments": 26,
      "upvote_ratio": 0.88,
      "text": "Hey r/softwarearchitecture,\n\n\n\nI spent the last 10 years at AWS working on backend systems and scalability. During that time, I saw patterns across hundreds of teams - what works, what doesn't, and where teams typically struggle.\n\n\n\nI'm now working on some ideas in the developer tooling space and I'm really interested in learning more about the real-world architecture challenges that teams are facing today. Specifically curious about:\n\n\n\n\\- Teams going through refactoring or re-architecture \n\n\\- Common pain points when scaling backend systems\n\n\\- Architecture decisions that are hard to make without senior input\n\n\\- Challenges freelancers/contractors face with architecture\n\n\n\nIf you're dealing with any of these, I'd love to hear about what you're working on and exchange thoughts. I find that the best way to understand problems is through real conversations, not theoretical discussions.\n\n\n\nHappy to share what I learned at AWS and hear what challenges you're facing. No sales pitch - genuinely just want to understand the space better.\n\n\n\nDrop a comment or DM if you'd like to chat!",
      "is_original_content": false,
      "link_flair_text": "Discussion/Advice",
      "permalink": "https://reddit.com/r/softwarearchitecture/comments/1r3c8aw/looking_to_understand_backend_architecture/",
      "domain": "self.softwarearchitecture",
      "is_self": true,
      "comments": [
        {
          "id": "o53bs3g",
          "author": "Effective-Total-2312",
          "text": "Biggest challenge: the person or persons who are in charge of deciding, are not open to discussions and take really bad decisions.\n\nSecond biggest challenge: management doesn't care about anything other than delivering as soon as possible at whatever cost.\n\nThird biggest challenge: the same person or persons in charge of deciding, change of mind every 3-6 months.",
          "score": 19,
          "created_utc": "2026-02-13 02:03:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o53cres",
              "author": "Busy_Weather_7064",
              "text": "I see, these are some real pain points on \"when to do\", \"if we should do\"  \nSending a DM.",
              "score": 2,
              "created_utc": "2026-02-13 02:09:38",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o54rjz4",
              "author": "budulai89",
              "text": "Hmm, let me search through the book which Design Pattern might fit in here.",
              "score": 1,
              "created_utc": "2026-02-13 08:31:52",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o546ljv",
          "author": "mnemonikerific",
          "text": "just some initial half-awake thoughts \n\n1. Feels like the entry barrier is too high now, when joining a new project,  crawling through terraform files is the only option to really ”know” what’s going on\n\n2. too many choices but no “recommendations” due to which everyone keeps reinventing the wheel - whys it so complicated to decide the mechanism to run backend jobs in 2026? \n\n3. why aren’t step functions way more popular yet? \n\n4. when will “best way to do X” stabilise instead of changing every 8-12 months ?",
          "score": 3,
          "created_utc": "2026-02-13 05:29:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o56z36k",
              "author": "Busy_Weather_7064",
              "text": "First problem is real.\nSecond : ideally the seniors/architect in your team should know this.\nThird: they are, for the teams who are not afraid of AWS costs.\nFourth : IMO there's never a best way to do X. There's a best way to do X with a lot of constraints. ",
              "score": 2,
              "created_utc": "2026-02-13 17:01:52",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o56zokn",
                  "author": "mnemonikerific",
                  "text": "About the second point, the truth is no senior person sticks around in a team long enough to see more than two phases getting rolled out. Either they become senior enough to be moved into something else or they just quit for a pay raise. I should know. 😂 \n\nI always leave a team with more documentation than what I got when I inherited it - my wrists Hate me for it",
                  "score": 1,
                  "created_utc": "2026-02-13 17:04:47",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o53ag8f",
          "author": "Extension_Kangaroo47",
          "text": "I am interested too. Hehe",
          "score": 1,
          "created_utc": "2026-02-13 01:55:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o53tvd8",
          "author": "kareesi",
          "text": "Biggest challenge for us right now is keeping architecture quality high as the team grows. We have a modular monolith which has very consistent patterns across the codebase because we consistently refactor. As new folks join, the patterns are not always immediately obvious to them, and new code (both AI and human authored) gets introduced that unintentionally breaks architecture patterns.\n\nWe’ve been looking into ways to enforce patterns we care about via automation/linting/AI rules etc, but feels like an uphill battle.",
          "score": 1,
          "created_utc": "2026-02-13 03:58:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o53u73z",
              "author": "Busy_Weather_7064",
              "text": "Is code review bot and then manual code review not able to maintain the consistency ?",
              "score": 2,
              "created_utc": "2026-02-13 04:00:15",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o53xgi3",
                  "author": "kareesi",
                  "text": "Unfortunately no to CR bot and manual review. We’ve scaled so much in the last 6 months (>40 new hires) that there are not enough engineers who have context and understand the system to do manual reviews on the sheer volume of (mostly AI generated) new code. CR reviews catch most stylistic things that we haven’t been able to get into linters, but architectural drift accumulates over time because it’s harder to catch at review time.",
                  "score": 1,
                  "created_utc": "2026-02-13 04:22:44",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o53udfs",
              "author": "Busy_Weather_7064",
              "text": "\\> architecture quality high\n\nWhat exactly does this \"quality\" mean ? scaling ? performance ? code structure ? or something else ?",
              "score": 1,
              "created_utc": "2026-02-13 04:01:27",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o53ydhq",
                  "author": "kareesi",
                  "text": "By quality in this case I primarily mean consistent with patterns we’ve established for codebase structure, API standards, and design approach. We’ve also had a hard time keeping the boundaries between modules clear. We’ve seen a huge uptick in bug volume and poor app performance.",
                  "score": 1,
                  "created_utc": "2026-02-13 04:29:07",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o53xfnj",
              "author": "yeticoder1989",
              "text": "Have you tried enforcing rules for this ?? I’m looking into ArchUnit for Java application but other languages would have something similar. ",
              "score": 1,
              "created_utc": "2026-02-13 04:22:34",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o54f8xj",
                  "author": "kareesi",
                  "text": "Yes! Big fan of ArchUnit, it’s been working well for us. As things come up in PR review we build it into the test suites. It just has been a slow process getting knowledge out of people’s heads and into the tests — because we grew so much so fast we were a bit unprepared for the sudden scaling problems.",
                  "score": 1,
                  "created_utc": "2026-02-13 06:40:26",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o53v565",
          "author": "RTM179",
          "text": "As someone who wants to get a Solutions Architect role at AWS, with some experience in backend dev. (Recently developed an end to end ai patent search tool for a New York law company). How can l break into the role? I have a comp sci degree and 2 AWS creds. But I don’t feel qualified, like I’d be an imposter?",
          "score": 1,
          "created_utc": "2026-02-13 04:06:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o543r31",
          "author": "Natural_Tea484",
          "text": "Can I ask what is your best recommendation in terms of resources(books, courses)for someone who is new to architecture and system design? Thank you!",
          "score": 1,
          "created_utc": "2026-02-13 05:07:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o56y0hd",
              "author": "Busy_Weather_7064",
              "text": "You've asked a hard question - assuming many blogs, articles or YouTube videos didn't help you 🤔. \nStill - look for YouTube videos by Arpit Bhayani. They should cover most of the needs. \nIn the end - you should try to actually build one to solve a problem. That's the only way to learn it for life.",
              "score": 1,
              "created_utc": "2026-02-13 16:56:39",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o566vab",
          "author": "UnknownZeroz",
          "text": "Do you teach? I want to learn",
          "score": 1,
          "created_utc": "2026-02-13 14:46:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o58pdzk",
              "author": "Busy_Weather_7064",
              "text": "I am very happy to educate, current commitments don't allow time for it. And I'm still happy to connect if you're facing some challenges with your architecture or Adding new features in your products.",
              "score": 1,
              "created_utc": "2026-02-13 22:06:49",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o56g4sl",
          "author": "mnemonikerific",
          "text": "so more shower thoughts\n\nI can confirm that I have seen more debates among AWS experts about how to solve a specific problem, than I have seen between Azure and AWS and GCM experts interacting about a  problem \n\nThe absence of recommendedopinions is frustrating",
          "score": 1,
          "created_utc": "2026-02-13 15:31:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o58euju",
          "author": "sandrodz",
          "text": "No, but I really want to do repatriation. Cloud costs have gone crazy for us.",
          "score": 1,
          "created_utc": "2026-02-13 21:15:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o59hiph",
          "author": "prawnsalad",
          "text": "Number one issue I've seen over many places: decision makers reading some blog about how some big tech org solved a problem they had and thinking that's the way to go because \"if it's right for them it's right for us\".\n\nFor most people it's hard to argue against because hey, it worked for big org, and sure it technically would work us, and we don't have big tech experience to argue against it. But 95% of places it's actually the wrong choice because they don't have the same problems (yet).",
          "score": 1,
          "created_utc": "2026-02-14 00:48:03",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r28jti",
      "title": "Improving architectural intuition",
      "subreddit": "softwarearchitecture",
      "url": "https://www.reddit.com/r/softwarearchitecture/comments/1r28jti/improving_architectural_intuition/",
      "author": "PickleIndividual1073",
      "created_utc": "2026-02-11 20:25:48",
      "score": 17,
      "num_comments": 9,
      "upvote_ratio": 0.88,
      "text": "Hello guys !\n\nNeed to know opinions, insights on improving architectural intuition\n\nSo,\n\nI know the math formulas (let’s say 5 architectural patterns) and then I get a problem (real life application to build or to work on or to onboard complex product onto)\n\nComplexity is to understand problem and apply formula - sometimes it may not have an answerable formula and you might have to customize and build some of your own.\n\nHow do I build that muscle of understanding and being creative.\n\nEspecially in different scenarios like Greenfield vs big project vs mid onboarding etc variants.\n\nSuggestions or any learning items welcomed\n\nCheers !",
      "is_original_content": false,
      "link_flair_text": "Discussion/Advice",
      "permalink": "https://reddit.com/r/softwarearchitecture/comments/1r28jti/improving_architectural_intuition/",
      "domain": "self.softwarearchitecture",
      "is_self": true,
      "comments": [
        {
          "id": "o4v8b8w",
          "author": "asdfdelta",
          "text": "Chiefly, architecture isn't a mathematical formula. Though I don't doubt that some companies would be better off if they used a formula.\n\nArchitecture is the phenomena of two or more systems interacting with eachother. This could be modules within an application, two independent services, or two massive tech companies linking together.\n\nArchitecture happens whether or not an architect is present. Architects are masters of this phenomena, and understand how systems behave in a given environment.\n\nSo a couple of things here:\n1) Being a good architect means understanding your environment, constraints, and problem space.\n2) Improving this requires more knowledge and experience in seeing how different systems interact. Not just technology, but people systems as well.\n3) It is very difficult to get solid architectural experience from a tutorial, course, or book. So much of the work is hands on and in the weeds.\n4) The variations on each of the factors in the real world are immense. Most architects specialize in atleast an industry. Retail, SaaS, FinTech, MedTech, etc.\n5) Look at the pinned megathread for more resources if you want to keep learning, but lived experience will always be better. Make something real and put it out into the world!",
          "score": 22,
          "created_utc": "2026-02-11 20:58:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5153k8",
              "author": "PickleIndividual1073",
              "text": "Agree - any books you can suggest to improve and learn from experience of companies or architects on scenarios?",
              "score": 2,
              "created_utc": "2026-02-12 19:10:08",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o51avkb",
                  "author": "asdfdelta",
                  "text": "There are tons! We have a pinned megathread with everything we've uncovered so far. Anything with 'fundamentals' in the title would be good to start with. There are also roadmaps you can look at to chart your course.\n\nGood luck!",
                  "score": 1,
                  "created_utc": "2026-02-12 19:37:52",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o57md0l",
              "author": "ericmutta",
              "text": "> Being a good architect means understanding your environment, constraints, and problem space.\n\n\nIf this is the only thing you'd put in the (awesome) list, the list would still be complete! It's amazing to me how many people are trying to write software without even basic knowledge of the underlying machine and its constraints. It's difficult to build skyscrapers on soil you know nothing about :)",
              "score": 2,
              "created_utc": "2026-02-13 18:53:47",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4w16pm",
          "author": "never-starting-over",
          "text": "To capitalize on what u/asdfdelta said, it's really just experience. Perhaps also accompanied by deliberate learning.\n\nYou **could** set yourself up by at least learning about the things you should be aware of. It seems you're already thinking about architectural characteristics, which is good, but I invite you to also consider things beyond tech: the business as a whole.\n\nPersonally, I benefited quite a bit from picking up some business analysis and project management skills, like going through Eliyahu Goldratt's literature or TOGAF. TOGAF in specific is super overkill for any project I ever worked on, but learning about it and its concepts - which cover enterprise in general, way beyond IT - helped me have a more holistic view to interpret business situations and come up with software solutions that actually fit the businesses I work with.\n\nKind of a random idea, and it's something I try to **not** do to avoid working for free, but could be useful if you just want to practice the muscle: Go through a list of RFPs or software development project posts and see what you can come up with for how you'd approach a system based on what the business person says on the post/specs. You could probably also find similar exercises online and compare them with the answers. I find myself consulting AWS's architecture blog posts more and more often nowadays, e.g. this one: https://aws.amazon.com/blogs/apn/building-a-third-party-saas-metering-and-billing-integration-on-aws/ (I was building something similar, then compared it against what they were doing to learn new things)",
          "score": 7,
          "created_utc": "2026-02-11 23:23:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o514yar",
              "author": "PickleIndividual1073",
              "text": "That’s great\nSo\nProject management skills (peripherals)\nRFPs for going through and practising\n\nGot it",
              "score": 1,
              "created_utc": "2026-02-12 19:09:25",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4x0rcg",
          "author": "sfboots",
          "text": "An important point is software architecture needs to be driven by business needs and practical concerns about the team and cost.  \n\nA new startup for B2B expecting 500 customer companies is success.  Very different from B2C where less than 200k users is failure.",
          "score": 3,
          "created_utc": "2026-02-12 02:53:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5136vw",
              "author": "PickleIndividual1073",
              "text": "Agree,  driving decisions with business engaged and reviewing flows with business early in process. Helps to define valuable constraints and variables.\n\nAsking whether features are really must’ve or sides helps.",
              "score": 1,
              "created_utc": "2026-02-12 19:00:57",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4xbxkf",
          "author": "dragon_idli",
          "text": "While many may not vibe with this pov. For me architecture has always been about understanding load characteristics of different systems involved and pairing it properly to achieve the needed metrics. \n\nWhen you program in low level languages for a long time, you start to visualise operations executing at a system level. And that grows into how multi tiered systems are visualised as well. \n\nIt's not always about formulae but most companies/products are better off to be based on formulae. Because that will atleast safeguard from over/under engineering a solution.",
          "score": 1,
          "created_utc": "2026-02-12 04:05:18",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r3cnpg",
      "title": "How do teams actually prevent architecture drift after year 2–3?",
      "subreddit": "softwarearchitecture",
      "url": "https://www.reddit.com/r/softwarearchitecture/comments/1r3cnpg/how_do_teams_actually_prevent_architecture_drift/",
      "author": "disciplemarc",
      "created_utc": "2026-02-13 02:06:55",
      "score": 13,
      "num_comments": 20,
      "upvote_ratio": 0.79,
      "text": "I’ve noticed that most teams have clear architectural intent early on (docs, ADRs, diagrams), but after a few years the codebase slowly diverges, especially during high-velocity periods.\n\nCode review catches style and logic issues, but architectural drift often slips through because reviewers don’t have the full context every time.\n\nI’ve been experimenting with enforcing architecture rules at PR time by comparing changes against repo-defined architecture docs and “gold standard” patterns, not generic best practices.\n\nCurious how others are dealing with this today:\n\n\t•\tStrict module boundaries?\n\n\t•\tHeavy docs + discipline?\n\n\t•\tTooling?\n\nWhat’s actually worked long-term for you?",
      "is_original_content": false,
      "link_flair_text": "Discussion/Advice",
      "permalink": "https://reddit.com/r/softwarearchitecture/comments/1r3cnpg/how_do_teams_actually_prevent_architecture_drift/",
      "domain": "self.softwarearchitecture",
      "is_self": true,
      "comments": [
        {
          "id": "o53eel4",
          "author": "ReturnOfNogginboink",
          "text": "What you are calling \"drift,\" others might call \"evolution.\"\n\nWhy do you believe architecture shouldn't change over time?",
          "score": 18,
          "created_utc": "2026-02-13 02:19:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o53rboi",
              "author": "UnreasonableEconomy",
              "text": "Ah yes, the good old evolved codebase, for when the intelligent designer has left the company 😆",
              "score": 5,
              "created_utc": "2026-02-13 03:41:01",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o53hpr1",
              "author": "disciplemarc",
              "text": "I agree architecture should evolve—the problem isn’t change, it’s unintentional change. Drift happens when boundaries erode without discussion or conscious tradeoffs. Guardrails plus review help ensure evolution is deliberate, not accidental.",
              "score": 1,
              "created_utc": "2026-02-13 02:40:05",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o583ita",
              "author": "General-Jaguar-8164",
              "text": "Documentation is a snapshot of the source of truth at the time, that's the code itself",
              "score": 1,
              "created_utc": "2026-02-13 20:18:16",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o53y5i3",
          "author": "christoforosl08",
          "text": "Having the software check itself is the only way. Check out ArchUnit",
          "score": 5,
          "created_utc": "2026-02-13 04:27:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o54x1pi",
              "author": "disciplemarc",
              "text": "ArchUnit is solid, especially for JVM teams, but it assumes architecture can be fully expressed as static rules inside the codebase.\n\nIn practice, a lot of architectural intent lives outside the compiler: ADRs, diagrams, historical decisions, and scope-based exceptions. Once you have multiple architectures or polyglot repos, “the software checking itself” becomes necessary but not sufficient",
              "score": 1,
              "created_utc": "2026-02-13 09:24:00",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o54xivu",
                  "author": "christoforosl08",
                  "text": "For these items you mention, (ADRs, diagrams, etc)  I use jQAssistant. [https://github.com/jqassistant](https://github.com/jqassistant)   \nBut is a little tricky to setup. ",
                  "score": 1,
                  "created_utc": "2026-02-13 09:28:38",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o54x7yb",
              "author": "disciplemarc",
              "text": "I’ve been exploring this problem space with ArchRails (archrails.io).",
              "score": 1,
              "created_utc": "2026-02-13 09:25:40",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o546pfd",
          "author": "flavius-as",
          "text": "Executable guardrails, built right into the process or the environment.\n\nIt never fails because if it does, something stops: the thing breaks in production, the SDLC breaks, monitoring alerts, etc.\n\nArchUnit was mentioned. Others are unit tests (proper definition of \"unit\"), permissions, sql views, DSLs, MBE tools, strongly typed languages, build systems, etc.",
          "score": 1,
          "created_utc": "2026-02-13 05:30:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5524wd",
          "author": "KaleRevolutionary795",
          "text": "You can lock in certain guidelines set out by the implementing team before it is forgotten by the maintenance team years later by making architecture tests a part of the ci/cd pipeline. \n\n\nFor example: ArchUnit testing. \n\nCodify your naming convention, good practices and hexagonal structure, allow/dissalow adapter integrations with each infra and sonar rules for security coverage",
          "score": 1,
          "created_utc": "2026-02-13 10:12:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o56ud2s",
          "author": "Electronic_Yam_6973",
          "text": "Usually because of time pressure, too much contractor turnover it’s hard to keep the vision of the early teams goals",
          "score": 1,
          "created_utc": "2026-02-13 16:39:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o59gfhd",
              "author": "disciplemarc",
              "text": "That’s exactly it, architecture usually doesn’t “fail,” it fades.\nTime pressure + turnover means the original intent lives in people’s heads, not the code.\nThe teams I’ve seen do better are the ones that encode architectural intent somewhere enforceable, not just in docs or tribal knowledge.",
              "score": 1,
              "created_utc": "2026-02-14 00:41:29",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o53giqi",
          "author": "Effective-Total-2312",
          "text": "I've been experimenting with some linter tools that enforce module boundaries, I like them but still haven't enforced them in a production team. Even so, you need to review carefully, some people can put SQL directly in your endpoints. You could also put a linter that leverages LLMs to prevent PRs to be merged if certain architecture patterns aren't met.",
          "score": -1,
          "created_utc": "2026-02-13 02:32:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o53ip0w",
              "author": "disciplemarc",
              "text": "I’m cautious about making the LLM the judge. Deterministic rules should decide pass/fail, with the LLM explaining why and suggesting fixes.",
              "score": -1,
              "created_utc": "2026-02-13 02:46:09",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o53j1h5",
                  "author": "Effective-Total-2312",
                  "text": "Yes, completely agree with you. But let's be fair, LLMs are at least good enough to understand simple and brief rules, on small contexts like a PR. To follow architecture patterns, they don't need to understand the codebase, just enforce them. Of course, I'm talking from the viewpoint of someone who works with LLMs, I don't know how this looks from otherwise.",
                  "score": 0,
                  "created_utc": "2026-02-13 02:48:17",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1r3jjib",
      "title": "System Design: Real-time chat + hot groups (Airbnb interview) — Please check my approach?",
      "subreddit": "softwarearchitecture",
      "url": "https://www.reddit.com/r/softwarearchitecture/comments/1r3jjib/system_design_realtime_chat_hot_groups_airbnb/",
      "author": "nian2326076",
      "created_utc": "2026-02-13 08:08:38",
      "score": 13,
      "num_comments": 6,
      "upvote_ratio": 0.78,
      "text": "I’m preparing for a system design interview with Airbnb and working through this system design interview question:\n\n**Design a real-time chat system (similar to an in-app messaging feature) that supports:**\n\n* 1:1 and group conversations\n* Real-time delivery over WebSockets (or equivalent)\n* Message persistence and history sync\n* Read receipts (at least per-user “last read”)\n* Multi-device users (same user logged in on multiple clients)\n* High availability / disaster recovery considerations\n\nAdditional requirement:\n\n* The system must **optimize for the Top N “hottest” group chats** (e.g., groups with extremely high message throughput and/or many concurrently online participants). Explain what “hot” means and how you detect it.\n\nThe interviewer expects particular attention to:\n\n* A clear high-level architecture\n* A concrete **data schema** (tables/collections, keys, indexes)\n* How messages get routed when you have **multiple WebSocket gateway servers**\n* Scalability and performance trade-offs\n\nHere’s how I approach this question:\n\n1️⃣ High-level architecture\n\n\\- WebSocket gateway layer (stateless, horizontally scalable)\n\n\\- Chat service (message validation + fanout)\n\n\\- Message persistence (e.g. sharded DB)\n\n\\- Redis for:\n\n\\- online user registry\n\n\\- hot group detection\n\n\\- Message queue (Kafka / similar) for decoupling fanout from write path\n\n2️⃣ Routing problem (multiple WS gateways)\n\nMy assumption:\n\n\\- Each WebSocket server keeps an in-memory map of connected users\n\n\\- A distributed presence store (Redis) maps user\\_id → gateway\\_id\n\n\\- For group fanout:\n\n\\- Publish message to topic\n\n\\- Gateways subscribed to relevant partitions push to local users\n\n3️⃣ Detecting “hot groups”\n\nDefinition candidates:\n\n\\- Message rate per group (messages/sec)\n\n\\- Concurrent online participants\n\n\\- Fanout cost (messages × online members)\n\nUse sliding window counters + sorted set to track Top N groups.\n\nQuestion:\n\nIs this usually pre-computed continuously, or triggered reactively once thresholds are exceeded?\n\n4️⃣ Hot group optimization ideas\n\n\\- Dedicated partitions per hot group\n\n\\- Separate fanout workers\n\n\\- Batch push\n\n\\- Tree-based fanout\n\n\\- Push via multicast-like strategy\n\n\\- Precomputed membership snapshots\n\n\\- Backpressure + rate limiting\n\nI’d love feedback on:\n\n1. What’s the cleanest way to route messages across multiple WebSocket gateways without turning Redis into a bottleneck?\n2. For very hot groups (10k+ concurrent users), is per-user fanout the wrong abstraction?\n3. Would you dynamically re-shard hot groups?\n4. What are the common failure modes people underestimate in chat systems?\n\nAppreciate any critique — especially from folks who’ve built messaging systems at scale.\n\nhttps://preview.redd.it/qjps693cz7jg1.png?width=1856&format=png&auto=webp&s=f2eac5aeea770fef5c937df3bac36afed38cba26\n\n[](https://preview.redd.it/system-design-real-time-chat-hot-groups-airbnb-interview-v0-om4rb91rv7jg1.png?width=1856&format=png&auto=webp&s=42b0786d8e45ee89ef5249435ba03e6e123f6b7b)\n\nResource: [PracHub](https://prachub.com/?utm_source=reddit)",
      "is_original_content": false,
      "link_flair_text": "Discussion/Advice",
      "permalink": "https://reddit.com/r/softwarearchitecture/comments/1r3jjib/system_design_realtime_chat_hot_groups_airbnb/",
      "domain": "self.softwarearchitecture",
      "is_self": true,
      "comments": [
        {
          "id": "o59575n",
          "author": "DeterminedQuokka",
          "text": "I kind of love the idea that everyone except Airbnb is using design Airbnb as their system design question.",
          "score": 2,
          "created_utc": "2026-02-13 23:34:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o56arnj",
          "author": "ch1pch4p",
          "text": "Hmm... I wish I could contribute but I'd like to follow. \n\nSomething to check out may be \n\nhttps://learn.microsoft.com/en-us/dotnet/orleans/overview?pivots=orleans-10-0\n\nIf not for \"use this framework!\" but perhaps a different perspective on how they scale.\n\nGood luck",
          "score": 1,
          "created_utc": "2026-02-13 15:05:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o569n2y",
          "author": "SaltyAmphibian1",
          "text": "lol didn’t realize Airbnb lets you use AI for the interview. Stop with the slop. ",
          "score": 1,
          "created_utc": "2026-02-13 15:00:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o571z8k",
              "author": "Beginning_Tale_6545",
              "text": "This is helpful, doesn't look like AI slop at all. I was practicing the same question and this visual help to better get things at one place and then solve.\n\nI encourage you to share some valuable stuff.",
              "score": 2,
              "created_utc": "2026-02-13 17:16:01",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o574119",
                  "author": "SaltyAmphibian1",
                  "text": "Didn't need to but ran it through an AI detector. Big surprise - 100% AI. We all use AI for learning, but stop pretending that it's your own work and stop posting the slop. ",
                  "score": 1,
                  "created_utc": "2026-02-13 17:25:59",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1r0yj92",
      "title": "AI, Entropy, and the Illusion of Convergence in Modern Software",
      "subreddit": "softwarearchitecture",
      "url": "https://www.abelenekes.com/when-change-becomes-cheaper-than-commitment",
      "author": "TranslatorRude4917",
      "created_utc": "2026-02-10 11:43:19",
      "score": 11,
      "num_comments": 4,
      "upvote_ratio": 0.87,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Article/Video",
      "permalink": "https://reddit.com/r/softwarearchitecture/comments/1r0yj92/ai_entropy_and_the_illusion_of_convergence_in/",
      "domain": "abelenekes.com",
      "is_self": false,
      "comments": [
        {
          "id": "o4mf1ns",
          "author": "asdfdelta",
          "text": "From a mod perspective, I've seen content like this go really well in the sub if it is fundamentals focused and not singularly aimed at AI. Very few architects are doing what you're doing, so it has less general appeal. There is still a ton of value in posting AI-centered content (it has to go somewhere lol), but you aren't likely to get a lot of traction.\n\nSimilarly, posting the long-form here with a link for more info is what generates the most engagement and true discussion.\n\nAs far as convergence/divergence theory in software, I'm still wrapping my head around residuality theory lol.",
          "score": 5,
          "created_utc": "2026-02-10 14:48:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4mrygz",
              "author": "TranslatorRude4917",
              "text": "Hey, thanks for the feedback!    \nI'm not aiming for posting AI-centered content, I'd rather call this post ai-adjecent. But I totally get it, using AI as the first word in the title sets the tone. :D Should have found a more fitting title.   \nI'm planning to write some less theoretical, more hands-on post regarding test architecture, that will probably be a better fit.\n\nBy long form do you mean posting the whole post nearly as is on my blog? \n\nResiduality theory sounds intriguing, I'll check out the Barry O'Reilly video :)  ",
              "score": 2,
              "created_utc": "2026-02-10 15:51:57",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4n9hd9",
          "author": "Tyhgujgt",
          "text": "I liked it. I think it's a useful formalization of what people feel about AI work but (to my knowledge) never expressed it in such a concise model.\n\n\nId only add a tldr in the top of the article. The idea is simple enough you don't have to walk people through the logic to explain the gist of it",
          "score": 3,
          "created_utc": "2026-02-10 17:12:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4odhno",
              "author": "TranslatorRude4917",
              "text": "Hey, I'm glad you liked it!\nTldr is a good idea, I'll add it next time! If it piques one's interest they can always read the whole piece :)",
              "score": 2,
              "created_utc": "2026-02-10 20:16:58",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r3ycmu",
      "title": "I just shipped v1.0 of EDA Visuals – a free collection of visuals explaining event-driven architecture",
      "subreddit": "softwarearchitecture",
      "url": "https://www.reddit.com/r/softwarearchitecture/comments/1r3ycmu/i_just_shipped_v10_of_eda_visuals_a_free/",
      "author": "boyneyy123",
      "created_utc": "2026-02-13 19:18:52",
      "score": 11,
      "num_comments": 4,
      "upvote_ratio": 0.93,
      "text": "Hey folks,\n\nToday I released v1.0 of EDA Visuals, a collection of over 100 visuals to help you learn about event-driven architecture.\n\n2 years ago I followed the Zettelkasten method to learn more about event-driven architecture and dive deep. I started to collect notes, references, and my own thoughts into designs, and I've been sharing them online since.\n\n  \nIf you want to learn more about event-driven architecture and dive deeper you can find them here:\n\nWebsite: [https://eda-visuals.boyney.io/](https://eda-visuals.boyney.io/)\n\nDirect download: [https://eda-visuals.boyney.io/visuals/eda-visuals.pdf](https://eda-visuals.boyney.io/visuals/eda-visuals.pdf)\n\nI enjoy creating these, and hope they help anyone else wanting to learn.\n\nCheers",
      "is_original_content": false,
      "link_flair_text": "Article/Video",
      "permalink": "https://reddit.com/r/softwarearchitecture/comments/1r3ycmu/i_just_shipped_v10_of_eda_visuals_a_free/",
      "domain": "self.softwarearchitecture",
      "is_self": true,
      "comments": [
        {
          "id": "o58m8oe",
          "author": "bunsenhoneydew007",
          "text": "Just wanted to say thank you for releasing these and for giving them away for free! I’ve used them on serverlessland before but it’s great to see you’ve kept going with them. Thanks also for EventCatalog, it’s become the hub of our documentation!",
          "score": 2,
          "created_utc": "2026-02-13 21:51:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o590c92",
              "author": "boyneyy123",
              "text": "🙌, that's awesome to hear. Glad you like them. Would love to hear how you are getting on with EventCatalog too, if you ever have the chance, feel free to reach out to me!",
              "score": 2,
              "created_utc": "2026-02-13 23:05:38",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5a0a3o",
                  "author": "bunsenhoneydew007",
                  "text": "I will do! In the meantime, briefly we're currently upgrading our use significantly (just gone from open source to a scale licence) and are looking to build it into our CI/CD pipeline for automated schema validation along with EventBridge integration. Among a bunch of other things we're thinking of.",
                  "score": 1,
                  "created_utc": "2026-02-14 02:47:00",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o59w92a",
          "author": "ProfessionalMajor904",
          "text": "Thank you sir for this. In my opinion, EDA is a natural way  to architect systems.",
          "score": 1,
          "created_utc": "2026-02-14 02:21:16",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r1bsu7",
      "title": "6 months frontend dev, working on a SaaS startup — need guidance on frontend architecture",
      "subreddit": "softwarearchitecture",
      "url": "https://www.reddit.com/r/softwarearchitecture/comments/1r1bsu7/6_months_frontend_dev_working_on_a_saas_startup/",
      "author": "Mukilan_M12553366272",
      "created_utc": "2026-02-10 20:15:22",
      "score": 9,
      "num_comments": 4,
      "upvote_ratio": 0.8,
      "text": "Hi guys,\n\nI’m a frontend developer working at a startup. We’re building a SaaS product, and I’m the only frontend dev in the team (we have 3 backend developers).\n\nI have around 6 months of experience. I’d say my frontend skills are intermediate, not advanced or senior level yet.\n\nRight now, I really want to learn frontend architecture — how to structure large apps, handle scalability, performance, best practices, etc.\n\nRecently, I’ve already started implementing things like:\n\nTree shaking\n\nCode splitting\n\nPagination\n\nBasic performance optimizations\n\nBut I feel there’s a bigger architectural picture that I’m missing.\n\nIf anyone has good resources (articles, blogs, courses, repos, or real-world examples), or advice from experience, it would really help 🙏",
      "is_original_content": false,
      "link_flair_text": "Discussion/Advice",
      "permalink": "https://reddit.com/r/softwarearchitecture/comments/1r1bsu7/6_months_frontend_dev_working_on_a_saas_startup/",
      "domain": "self.softwarearchitecture",
      "is_self": true,
      "comments": [
        {
          "id": "o4oopp8",
          "author": "Old_Butterfly_3660",
          "text": "When it comes to courses Frontend Masters is top tier. I think they have one on front end system design. When it comes to the architecture: I think the most important is knowing what are you building, for whom and why. How long the product will live: 2 years, 5 years, 15? You are 1 person so you are architect for yourself and that makes things simpler, but it won’t be always like that. How big is the domain? How complex? How complex the UI will be. There are many factors here, not only strictly technical.",
          "score": 3,
          "created_utc": "2026-02-10 21:09:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4q32w1",
          "author": "Prior-Yak6694",
          "text": "I follow the rule of three in programming, it’s a must to prevent premature abstraction. \n\nInstead of creating a reusable function that only 1 component will use, just declare it inside that component and copy-paste it until you notice that there’s a need for a reusable hook/function.",
          "score": 3,
          "created_utc": "2026-02-11 01:38:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4psb38",
          "author": "who_am_i_to_say_so",
          "text": "When you’re starting out like you are, think in terms of keep your code DRY and SOLID. And if you haven’t started already, look into TDD. Guessing js, so Vitest. That alone has enough gas keep you improving for many years.",
          "score": 1,
          "created_utc": "2026-02-11 00:34:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4seni8",
          "author": "qrzychu69",
          "text": "If you are a solo frontend dev I'd go with singing like Vue or svelte - tree shaking, code splitting and compression are just saying on the publish command\n\nFocus on good code patterns that match how YOU think. Try two or three out, see which one you like more. \n\nConsider using svelte kit (or whatever there is for Vue, nuxt?), to have a backend for frontend. It would mostly just redirect to your proper backend, but in some cases having control on the in-between can be useful.\n\nYou can can cache things from backend without asking them to do it.\n\nYou can implement your own data conversions, and so on, and it doesn't take too much to set it up.\n\nMaybe even at some point they can give you a read only connection to some view in the database, do that you can make your own queries any way you like.",
          "score": 1,
          "created_utc": "2026-02-11 12:33:05",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r2rll2",
      "title": "The 12-Factor App - 15 Years later. Does it Still Hold Up in 2026?",
      "subreddit": "softwarearchitecture",
      "url": "https://lukasniessen.medium.com/the-12-factor-app-15-years-later-does-it-still-hold-up-in-2026-c8af494e8465",
      "author": "trolleid",
      "created_utc": "2026-02-12 12:01:30",
      "score": 9,
      "num_comments": 0,
      "upvote_ratio": 0.99,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Article/Video",
      "permalink": "https://reddit.com/r/softwarearchitecture/comments/1r2rll2/the_12factor_app_15_years_later_does_it_still/",
      "domain": "lukasniessen.medium.com",
      "is_self": false,
      "comments": []
    },
    {
      "id": "1r2wnfd",
      "title": "Is MCP effectively introducing a probabilistic orchestration layer above our APIs?",
      "subreddit": "softwarearchitecture",
      "url": "https://www.reddit.com/r/softwarearchitecture/comments/1r2wnfd/is_mcp_effectively_introducing_a_probabilistic/",
      "author": "thedamfr",
      "created_utc": "2026-02-12 15:37:47",
      "score": 7,
      "num_comments": 5,
      "upvote_ratio": 0.71,
      "text": "I work at leboncoin (main French classified/marketplace). We recently shipped an application on the ChatGPT store. If you’re not in France it’s probably not very useful to try it. But building it forced us to rethink how we approach MCP.\n\nInitially, we let teams experiment freely.\n\nEach feature team built its own MCP connector on top of existing services. It worked for demos, but after a few iterations we ended up with a collection of MCP connectors that weren’t really orchestrable together.\n\nAt some point it became clear that MCP wasn’t just “a plug-and-play connector”.\n\nGiven our context (thousands of microservices, domain-level aggregator APIs), MCP had to be treated as a layer in its own right. A full abstraction layer.\n\nWhat changed for us: MCP became responsible for interpreting user intent, not just forwarding calls\n\nIn practice, MCP behaves less like an integration and more like a probabilistic orchestration layer sitting above the information system. Full write up on [medium](https://medium.com/@leboncoin_tech/from-observer-to-production-how-leboncoin-adopted-mcp-to-architect-the-agentic-era-d4e52966927d)\n\nWhich raises architectural questions:\n\n* Do you centralize MCP orchestration or keep it domain-scoped?\n* Where do you enforce determinism?\n* How do you observe and debug intent → call choreography failures? (Backend return 200OK, but MCP fetched a wrong query, user got nothing from what was expected)\n* Do you reshape your API surface for models, or protect it with strict mediation?\n\nFor engineers and architects working on agentic systems:\n\nHave you treated MCP (or similar patterns) as a first-class service? Or are you isolating it behind hard boundaries to protect your core systems?\n\nLooking to read similar experience from other software engineers.",
      "is_original_content": false,
      "link_flair_text": "Article/Video",
      "permalink": "https://reddit.com/r/softwarearchitecture/comments/1r2wnfd/is_mcp_effectively_introducing_a_probabilistic/",
      "domain": "self.softwarearchitecture",
      "is_self": true,
      "comments": [
        {
          "id": "o51k4zq",
          "author": "BC_MARO",
          "text": "I’d separate two things: MCP is the protocol/transport for tool calls. The probabilistic part is the planner (LLM + the host/agent) deciding *which* calls to make.\n\nArchitecturally I treat MCP servers like any other integration surface: keep them small, typed, and idempotent. Put “real” orchestration as close to the domain as you can. Centralize only the cross-cutting bits (auth, secrets, policy, logging).\n\nWhere to enforce determinism: at the edges. Validate tool args, constrain queries, require explicit IDs, and make writes go through a dry-run + confirm step.\n\nFor observability, log the full tool-call trace (prompt/tool args/result) with correlation IDs so you can replay “intent -> calls -> outcome”. If you need approvals/audit, add a HITL gate. Peta (peta.io) is one option that packages vault + managed MCP runtime + audit/approvals, but you can also build the same pattern in-house.",
          "score": 8,
          "created_utc": "2026-02-12 20:22:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o51l2kj",
              "author": "thedamfr",
              "text": "Thanks for sharing your thoughts. About logging we didn't log prompts to avoid issues with Privacy/Legal. How do you work with this matter ?",
              "score": 0,
              "created_utc": "2026-02-12 20:26:50",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o51uqgj",
                  "author": "BC_MARO",
                  "text": "We usually log tool-call metadata by default (tool name, args schema, status, latency, correlation ID) and keep raw prompts/results behind stricter controls. For privacy we redact/tokenize before write, set short retention, and let customers pick their own log sink. If legal says no prompts, you can still store structured summaries plus hashes so you can trace issues without storing the content.",
                  "score": 2,
                  "created_utc": "2026-02-12 21:12:42",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o501is3",
          "author": "micseydel",
          "text": "It looks like the Medium link might not be published, but I'm curious what you think of this interesting comment I recently came across: [https://www.reddit.com/r/informatik/comments/1r1s84w/comment/o4rrh6x/](https://www.reddit.com/r/informatik/comments/1r1s84w/comment/o4rrh6x/)",
          "score": 0,
          "created_utc": "2026-02-12 16:05:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5045f8",
              "author": "thedamfr",
              "text": "Multiple ideas coming to mind\n\nWe have been using AI and GenAI models in production for years with more than 60 usecase. Each one of those are very easy to monitor in production. For example when you add a listing, you need to label it to a category. We use a classifier that found the best matches based on the classified title and it improved conversion in the submission funnel. We also have a new feature that allow the user to generate the listing body from the pictures in on click. This is based on Haiku and required a lot of prompt engineering. This is never a layer above the tower. This is always a probabilistic component being boxed with deterministic software.\n\nAgentic is about having agents like ChatGPT offering features to the user on top of our software without the user having a clear interaction with our systems. And this agent is probabilistic. MCP is a layer above deterministic software that needs to solve the probabilistics nature of those LLM-agents.",
              "score": 0,
              "created_utc": "2026-02-12 16:17:32",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qzjvzh",
      "title": "Functional<>Logical<>Physical Architecture in Software Intensive Systems",
      "subreddit": "softwarearchitecture",
      "url": "/r/systems_engineering/comments/1qzjvfa/functionallogicalphysical_architecture_in/",
      "author": "PeakofConsciousness",
      "created_utc": "2026-02-08 20:29:56",
      "score": 6,
      "num_comments": 1,
      "upvote_ratio": 1.0,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Discussion/Advice",
      "permalink": "https://reddit.com/r/softwarearchitecture/comments/1qzjvzh/functionallogicalphysical_architecture_in/",
      "domain": "",
      "is_self": false,
      "comments": [
        {
          "id": "o4d9nl5",
          "author": "asdfdelta",
          "text": "Your question is correct, you are overcomplicating it.\n\nBehaviors, functions, and requirements are not sequential steps but viewpoints of the same thing.\n\nIn software, we create systems that are n-dimensional in nature. It is a simple structure of logical components, but behavior and requirements (among many other things) are all constructs humans layer on top of the logical components to make sense of it all. It exists detached and purely for our benefit, so that we may design more elegant software systems. The software itself doesn't benefit from behavior analysis or architectural fitness or performance... It just *does*. Same as with Systems Engineering.\n\nSo, separating the real from the imagined we can see that the behavior of a system is one viewpoint we would design. The requirements is another synonym of behavior, but a subset of behaviors that is strictly required. Non-functional requirements are still required, just harder for stakeholders to articulate. Things that if catastrophe arrived, the stakeholders would say 'of course I want that!' Do they want it reasonably performant? Do they want it to be observed so errors are clear and remedies quickly? Do they want failover in case a data center goes out?\n\nAll that to say, your perception of a sequential flow of designing a software intensive system is incorrect.\n\n1) Start with functional requirements\n2) Add non-functional requirements\n3) Identify True Constraints (versus imagined constraints)\n4) Decide what to optimize for, in pursuit of the larger goal\n5) Use comfortable tools & techniques to design your system\n6) Use the previous 5 steps as a guide to redesign what you just made, but to be easily manufactured (coded, released, maintained, and deprecated)",
          "score": 2,
          "created_utc": "2026-02-09 02:55:41",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r3maqt",
      "title": "Decentralized Microfrontend Module Federation Architecture",
      "subreddit": "softwarearchitecture",
      "url": "https://www.reddit.com/r/softwarearchitecture/comments/1r3maqt/decentralized_microfrontend_module_federation/",
      "author": "Accurate-Screen8774",
      "created_utc": "2026-02-13 11:01:54",
      "score": 6,
      "num_comments": 2,
      "upvote_ratio": 0.8,
      "text": "[https://positive-intentions.com/docs/technical/architecture](https://positive-intentions.com/docs/technical/architecture)\n\ni cooked a bit too hard on this. \n\ni was already using microfrontends for my project. when i came across [dynamic remotes](https://positive-intentions.com/docs/technical/architecture), i figured i could use it for statics redundency management. (tbh... a problem that doesnt exist.)\n\nmy project is far from finished and it would make sense to add additional safety nets for static-resource-integrity, but the basic concept seems to work and i wanted to share some details ive put together.",
      "is_original_content": false,
      "link_flair_text": "Article/Video",
      "permalink": "https://reddit.com/r/softwarearchitecture/comments/1r3maqt/decentralized_microfrontend_module_federation/",
      "domain": "self.softwarearchitecture",
      "is_self": true,
      "comments": [
        {
          "id": "o57l5zn",
          "author": "BrodinGG",
          "text": "All this, to just render a <button > and a <h1>. Success!",
          "score": 3,
          "created_utc": "2026-02-13 18:48:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o59i4xd",
              "author": "PabloZissou",
              "text": "Is not over engineering if it has a buzzword bingo name!",
              "score": 1,
              "created_utc": "2026-02-14 00:51:48",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r3g1vj",
      "title": "Where can I find who can review my system architecture?",
      "subreddit": "softwarearchitecture",
      "url": "https://www.reddit.com/r/softwarearchitecture/comments/1r3g1vj/where_can_i_find_who_can_review_my_system/",
      "author": "Inside-Aromatic",
      "created_utc": "2026-02-13 04:51:14",
      "score": 5,
      "num_comments": 4,
      "upvote_ratio": 0.78,
      "text": "I'm currently a dev early in my career and I enjoy building products in my free time but I feel as if my system design is suboptimal as I'm still learning. \n\nAre there any platforms or places where I can get feedback/thoughts from more seasoned engineers? ",
      "is_original_content": false,
      "link_flair_text": "Discussion/Advice",
      "permalink": "https://reddit.com/r/softwarearchitecture/comments/1r3g1vj/where_can_i_find_who_can_review_my_system/",
      "domain": "self.softwarearchitecture",
      "is_self": true,
      "comments": [
        {
          "id": "o5439on",
          "author": "narrow-adventure",
          "text": "I don’t know of any such platform but I’ll gladly give you design feedback you can dm me here with a git repo",
          "score": 3,
          "created_utc": "2026-02-13 05:04:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o543t00",
          "author": "UnreasonableEconomy",
          "text": "1) all designs are suboptimal\n2) post it here, plenty of people willing to give feedback and/or learn from it :)",
          "score": 3,
          "created_utc": "2026-02-13 05:08:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o548gc8",
              "author": "Inside-Aromatic",
              "text": "Perfect, thank you!",
              "score": 2,
              "created_utc": "2026-02-13 05:44:02",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o54gvfp",
          "author": "Busy_Weather_7064",
          "text": "Hey - if you don't want to post it openly, I can help reviewing it over a meet call. Have 10yoe at AWS. ",
          "score": 3,
          "created_utc": "2026-02-13 06:54:26",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}