{
  "metadata": {
    "last_updated": "2026-02-03 17:18:12",
    "time_filter": "week",
    "subreddit": "softwarearchitecture",
    "total_items": 20,
    "total_comments": 143,
    "file_size_bytes": 210063
  },
  "items": [
    {
      "id": "1qol5xl",
      "title": "Have we reached \"Peak Backend Architecture\"?",
      "subreddit": "softwarearchitecture",
      "url": "https://www.reddit.com/r/softwarearchitecture/comments/1qol5xl/have_we_reached_peak_backend_architecture/",
      "author": "Brief_Ad_5019",
      "created_utc": "2026-01-27 17:56:22",
      "score": 481,
      "num_comments": 105,
      "upvote_ratio": 0.95,
      "text": "I’ve been working as a Software Architect primarily in the .NET ecosystem for a while, and I’ve noticed a fascinating trend: The architectural \"culture war\" seems to be cooling down.\nA few years ago, every conference was shouting \"Microservices or death.\" \nToday, it feels like the industry leaders, top-tier courses, and senior architects have landed on the same \"Golden Stack\" of pragmatism. It feels like we've reached a state of Architectural Maturity.\n\nThe \"Modern Standard\" as I see it:\n - Modular Monolith First (The Boundary Incubator): This is the default to start. It’s the best way to discover and stabilize your Bounded Contexts. Refactoring a boundary inside a monolith is an IDE shortcut; refactoring it between services is a cross-team nightmare. You don't split until you know your boundaries are stable.\n\n- The Internal Structure: The \"Hexagonal\" (Ports & Adapters) approach has won. If the domain logic is complex, Clean Architecture and DDD (Domain-Driven Design) are the gold standards to keep the \"Modulith\" maintainable.\n   \n - Microservices as a Social Fix (Conway’s Law): We’ve finally admitted that Microservices are primarily an organizational tool. They solve the \"too many cooks in the kitchen\" problem, allowing teams to work independently. They are a solution to human scaling, not necessarily technical performance.\n\n - The \"Boring\" Infrastructure:\n   * DB: PostgreSQL for almost everything.\n   * Caching: Redis is the de-facto standard.\n   * Observability: OpenTelemetry (OTEL) is the baseline for logs, metrics, and traces.\n\n - Scalability – The Two-Step Approach:\n   * Horizontal Scaling: Before splitting anything, we scale the Monolith horizontally. Put it behind a load balancer, spin up multiple replicas, and let it rip. It’s easier, cheaper, and keeps data consistency simple.\n   * Extraction as a Last Resort: Only carve out a module if it has unique resource demands (e.g., high CPU/GPU) or requires a different tech stack. But you pay the \"Distribution Tax\": The moment you extract, you must implement the Outbox Pattern to maintain consistency, alongside resiliency patterns (circuit breakers, retries) and strict idempotency across boundaries.\n\nIs the debate over?\nIt feels like we’ve finally settled on a pragmatic middle ground. But I wonder if this is just my .NET/C# bubble.\n\nI’d love to hear from other ecosystems:\n - Java/Spring Boot: Does the Spring world align with this \"modern standard\"?\n - Node.js/TypeScript: With the rise of frameworks like NestJS, are you guys also moving toward strict Clean Architecture patterns, or is the \"keep it lean and fast\" vibe still dominant?\n - Go/Rust: Are you seeing the same push toward Hexagonal patterns, or does the nature of these languages push you toward a more procedural, \"flat\" structure?\n\nIs there a \"Next Big Thing\" on the horizon, or have we actually reached \"Peak Backend Architecture\" where the core principles won't change for the next decade?",
      "is_original_content": false,
      "link_flair_text": "Discussion/Advice",
      "permalink": "https://reddit.com/r/softwarearchitecture/comments/1qol5xl/have_we_reached_peak_backend_architecture/",
      "domain": "self.softwarearchitecture",
      "is_self": true,
      "comments": [
        {
          "id": "o22ervg",
          "author": "OtterZoomer",
          "text": "This discussion also reminds me of how the initial hype around NoSQL caused a lot of us to misstep and try to wholesale use only NoSQL due to its scaling advantage.\n\nThe problem I think many of us then ran into is that while there is some data that's well suited to simple key-value lookup scenarios, \\*most\\* data is actually highly-relational in nature.  And so this means that if you're hell-bent on \\*only\\* using NoSQL because you are religious about your horizontal-scaling story, you end up having to piece-together a poor-man's version of SQL on top of NoSQL, which ends up being a Frankensteinian mess as well as a metaphorical poor reinvention of the wheel.\n\nI learned it all the hard way <sigh>.  And I eventually just settled on PostgreSQL, as you did.  :)",
          "score": 52,
          "created_utc": "2026-01-27 18:50:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o296n8f",
              "author": "mikaball",
              "text": "NoSQL was a marketing stunt. It doesn't scale as people think it does in real world software. At least not for operational databases.\n\nThe most blunt examples that I see in real world production software is devs realizing how bad it is for highly-relational data (as you stated). Then proceed to put everything in the same documents (to facilitate the retrive of relational data), generating deep nested JSON structures.\n\nWhat they don't realize is that these deep JSON structures:\n\n* are not normalized and suffer from fan-out issues on write operations\n* what would be an insert is now an update deep in the structure, raising the probability of concurrency issues and completely fucks up scalability. Scalability is very related with database contention, the problem NoSQL was trying to resolve in the first place, ironically.\n\nKnowing that, a relational DB like PostgreSQL is by far the best starting point for any operational DB; and we generally start with operations. Analytics comes after gathering data.",
              "score": 4,
              "created_utc": "2026-01-28 17:53:56",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o31qwvj",
                  "author": "yetiflask",
                  "text": "Bro, DynamoDB scales like a motherfucker.",
                  "score": 1,
                  "created_utc": "2026-02-01 22:01:18",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o289fn7",
              "author": "Petesaurus",
              "text": "Very inexperienced, is there a technical reason that the horizontal scaling features of NoSQL couldn't be applied to a relational DBMS?",
              "score": 2,
              "created_utc": "2026-01-28 15:29:33",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o291f9b",
                  "author": "OtterZoomer",
                  "text": "The level of functionality provided by a true RDBMS is \\*far far\\* beyond what is provided by your typical NoSQL DB.  An RDBMS like PostgreSQL or MariaDB supports queries using SQL, which is an extremely expressive and powerful way to manipulate data. NoSQL, as its name implies, has no ability to support SQL.  NoSQL for the most part is a very simple key-value lookup.  This is also what makes it easier to implement NoSQL systems that can be spread across multiple nodes (so-called horizontal scaling).\n\nIf you take maybe an hour or two to introduce yourself to SQL (learning basic insert/update/select/delete but especially learning queries that involve multiple tables with foreign keys so that the light-bulb goes off in your head and you begin to see the power of SQL for manipulating relational data), then you will likely understand how a simple key-value table can't compare in functionality.  Ask ChatGPT to tutor you oh these basics so that you can quickly gain this insight. Knowing SQL will open a whole new world to you when it comes to backend and data manipulation.  It's very empowering and an essential part of  any dev's toolbox.\n\nAnd this level of power with SQL is magnified as the number of related tables increases.  A complex database will often have many dozens of related tables. The power of both RDBMS and SQL is that they are optimized for such highly-relational data, for storage, data access, and SQL query efficiency and elegance.\n\nWhat I see happening a lot is that people who are using on NoSQL DBs end up cobbling-together a sort of pseudo SQL (very much lacking  the true power of SQL) in order to gain some form of control over the relational data - of which there's typically a lot.",
                  "score": 2,
                  "created_utc": "2026-01-28 17:31:26",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o2979p9",
                  "author": "OtterZoomer",
                  "text": "Oh sorry I didn’t answer your question. Horizontal scaling of an RDBMS is a lot harder than horizontal scaling of NoSQL mostly due to the fact that RDBMS DBs are far more complex. There are two projects doing this though, cockroach and yugabyte. Both attempt Postgres compatible tooling.",
                  "score": 1,
                  "created_utc": "2026-01-28 17:56:31",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o2o28to",
                  "author": "lukebryant9",
                  "text": "Relational DBMSes are typically ACID compliant and NoSQL databases typically aren't. ACID compliance has a performance cost.",
                  "score": 1,
                  "created_utc": "2026-01-30 20:20:52",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o22670k",
          "author": "general_dispondency",
          "text": "This ebbs and flows every 10 or so years. Currently monolith is on top, in a few years microservices will come back rebranded as something else (see SOA), then the added complexity of orchestration will drive everyone back to the monolith. The worst part of this industry is that no one studies the past and looks at how we got where we are. Everyone wants to do the new cool thing, not realizing that we've already done that, and there's a reason that only the people who need it still do it.",
          "score": 127,
          "created_utc": "2026-01-27 18:14:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o22ekb3",
              "author": "robhanz",
              "text": "I think this is less \"monolith on top\" and more \"monolith with internal boundaries as an intermediate step towards microservices, *if* they become necessary.\"\n\nIt's a good pattern, because it's one based on evolution, not on a single architecture that will never change.  It honors the changing requirements of services while also creating enough structure to avoid problems going forward.",
              "score": 58,
              "created_utc": "2026-01-27 18:49:24",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o2286lm",
              "author": "Brief_Ad_5019",
              "text": "Very true! Cloud Providers clearly love to help you with all the complexity and sell you serverless or something. Even if this complexity is often more accidental than essential ;)",
              "score": 18,
              "created_utc": "2026-01-27 18:22:33",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o275hty",
              "author": "randoomkiller",
              "text": "This makes me think, I like to study history, and therefore notice repeating patterns but how can someone at the age of 26 and 1.5YoE see the past 20-30 years of trends and general large overview history of software infra/approaches/why they failed/why some succeeded?",
              "score": 2,
              "created_utc": "2026-01-28 11:47:33",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o28ebqf",
                  "author": "general_dispondency",
                  "text": "Read and talk to people you work with that have been doing it a long time and learn from their wisdom. You don't have to be their best friend or agree with any personal choices they make. Just be friendly and ask questions that make it sound like you've done a small amount of homework. As someone who's done this for a while, there's nothing I enjoy more then sharing my passion with other people who are just getting into it. Not everyone is like that, but you probably work with one or more people who have that same mindset.",
                  "score": 3,
                  "created_utc": "2026-01-28 15:51:13",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o2vpgwz",
              "author": "ericmutta",
              "text": "Indeed. The coolest most depressing thing about software development is that all the important things were discovered before you were born (think 50+ years ago at this point)...so there's nothing new, just new people rediscovering history they ignored.",
              "score": 2,
              "created_utc": "2026-01-31 23:47:06",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2281e8",
          "author": "OtterZoomer",
          "text": "One thing I don't see people talking about much is how incredibly \\*high\\* the ceiling now is on vertical scaling.  In the past (15 yrs ago) if you wanted decent scalability you were forced to go horizontal. But that's really not the case anymore.  A single compute can now be outfitted with four top-end EPYC CPUs with 2TB ECC memory and that machine can run 1536 \\*concurrent\\* threads, theoretically all sharing the same process address space of memory (no process context switch and TLB switching for virtual memory).  Not only is this equivalent to 1536 computers of the past (a cloud in a single box), but that shared memory between threads is an enormous advantage in two ways: 1) performance; 2) simplicity of architecture (sharing memory between threads enables much simpler code versus distributed message passing across nodes) - the state is in a single place versus spread about, and access to it requires simple synchronization primitives rather than more complex message passing etc.\n\nAnd this vertical ceiling continues to rise.",
          "score": 52,
          "created_utc": "2026-01-27 18:21:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o229zmh",
              "author": "Brief_Ad_5019",
              "text": "Fascinating fact and numbers! Just think about NVIDIA telling us a whole row in a Datacenter \"behaves like a single GPU\"!\nIt would be super interesting to see how many millions of users you could serve with vertical scalability...",
              "score": 9,
              "created_utc": "2026-01-27 18:30:07",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o22ch3g",
                  "author": "OtterZoomer",
                  "text": "Exactly.  I bought into the whole serverless/microservices hype a few years ago and through hard experience learned the many cons of that approach.  Given the incredibly high ceiling on vertical scaling, my stack is now:\n\nGo API (incredible for network services) - network requests are handled efficiently with both async and threading, maximizing hardware utilization.  My implementation stays simple because it's a single process, yet it scales to incredible levels with threading and a massively multi-core machine.  Yeah you don't start out with the max provisioned machine - you start out cheap and periodically provision more resources as needed.  You can start using a cheap VPS, allocating more RAM and faster CPU and more cores as needed.  Eventually you migrate over to a physical host.  It does mean you need a redundancy story for PostgreSQL but that can be done in multiple ways.  If you don't need 5-6 9's uptime (if you're not a bank) then it's reasonable for you to have a few minutes of downtime at 3am in your most populous user zone for an occasional re-provisioning reboot.  And you can still do load balancing (use NGINX) for the more static-read type of stuff.  Using PostgreSQL as a standard edge, and a host/VPS as your environment, makes it so easy to avoid vendor lock-in too.  You can easily move your solution about to various alternate hosting configs.\n\nAnd it can be a hell of a lot cheaper!",
                  "score": 10,
                  "created_utc": "2026-01-27 18:40:38",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o2lotr6",
                  "author": "JackSpyder",
                  "text": "Especially if you had bare metal it woukd be a LOT.",
                  "score": 1,
                  "created_utc": "2026-01-30 13:49:42",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o25rrwz",
              "author": "truechange",
              "text": "This is true but I think the use case is more on redundancy / HA.",
              "score": 5,
              "created_utc": "2026-01-28 04:54:11",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o25lo83",
              "author": "missedalmostallofit",
              "text": "And the database?  You systematically put it on different server?  For an app with 1000 users.  Or you increase THE power of one beast?",
              "score": 2,
              "created_utc": "2026-01-28 04:15:53",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o2cflsq",
              "author": "TylerDurdenFan",
              "text": "Adding to this: today a single, individual PCIe 5 NVMe SSD can provide more disk (IOPS millions!) and bandwidth (tens of GB/s), than an enteprise SAN did just 10 years ago, which means your acid relational database can reeeeally scale up IO before clustering becomes necessary.",
              "score": 2,
              "created_utc": "2026-01-29 03:16:19",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o2d0w16",
              "author": "VertigoOne1",
              "text": "I had the same/similar discussion with an architect that was hell bent on micro services and he basically didn’t consider the “network” cost at all, didn’t think about it in context of what that means. Sure you can do 40Gb/s highly coupled and willing to  fork the $$$ but as soon as you leave the cpu/cache/mem block you incur a several orders of magnitude latency hit on getting all your data moving around and that is before you consider the extra cost of routing/ha/dns and everything else to just even support the flows reliably. I’m all for micro architectures but it has to make sense, like highly variable workload, lots of async, analysis offloading, etc. knee jerking because of “we need to improve performance” is like the last reason to scale horizontal.",
              "score": 2,
              "created_utc": "2026-01-29 05:34:05",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o23av1u",
          "author": "lIIllIIlllIIllIIl",
          "text": "I do believe C#/.NET lives in a bubble.\n\nVery few ecosystems are as homogeneous as .NET, and altough homogeneity has some advantages, it has drawbacks too, the main one being stagnation.\n\nFrameworks have a [\"cost of convenience\"](https://surma.dev/things/cost-of-convenience/) to them. They can make some things easier, but it usually comes at the cost of making other things harder.\n\nMost micro-services have ill defined boundaries, and people constantly argue over whether services should be brought together or separated.\n\nConway's law has been [misinterpreted into the opposite of what he meant](https://youtu.be/5IUj1EZwpJY?si=je5ZPNPbuf_9jjTz). Conway wanted to warn people about the dangers of rigid communication structures creating arbitrary fractures in code where there shouldn't be one, but nowadays people use Conway's law to justify creating the very fractures he was trying to prevent.\n\nSOLID, DDD, Clean Architecture & Clean Code are all vaguely defined principles that don't objectively increase productivity and reduce defects. The amount of ceremony required to adhere to these subjective principles often outweigh the benefits they might bring.\n\nI could go on, but I think you get the point. I don't think we reached peak architecture yet, and doubt we ever will. Every piece of software is different.",
          "score": 15,
          "created_utc": "2026-01-27 21:13:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o27pebj",
              "author": "HateToSayItBut",
              "text": "Microsoft is an insulated bubble. No modern, innovative startup says \"let's start building with .Net!\"",
              "score": 1,
              "created_utc": "2026-01-28 13:51:18",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2hnbsr",
                  "author": "Legitimate-School-59",
                  "text": "What's wrong with .net? ",
                  "score": 1,
                  "created_utc": "2026-01-29 21:53:21",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o2ug4ts",
                  "author": "quantum-fitness",
                  "text": "Well .Net isnt sexy but everyone I know who have worked professionally with modern .Net seems to love it.",
                  "score": 1,
                  "created_utc": "2026-01-31 19:55:55",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o2hnej9",
              "author": "Legitimate-School-59",
              "text": "Why is .net ecosystem in a bubble?",
              "score": 1,
              "created_utc": "2026-01-29 21:53:43",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2hqe5m",
                  "author": "lIIllIIlllIIllIIl",
                  "text": "All ecosystems are bubbles, but what OP said applies specifically to the .NET bubble in my opinion.\n\n.NET's main appeal is that its ecosystem is homogeneous. Everyone uses ASP NET, everyone uses the same libraries by Microsoft, and everyone uses the same coding standards. This mainly draws enterprise companies which have huge codebases and a huge number of employees. This naturally leads to the .NET ecosystem to favor backend architectures and patterns that are meant for very large enterprise applications, and claim that it is the only right way to do things. Because it's homogeneous, diverging opinions have a hard time gaining traction.\n\nRust, Go, JavaScript and Python are all bubbles of their own, but they hold different beliefs.",
                  "score": 1,
                  "created_utc": "2026-01-29 22:07:56",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o22ej64",
          "author": "iMac_Hunt",
          "text": "To be honest even a monolith with hexagonal pattern + DDD is overkill for a lot of applications out there. Transaction boundaries become tricky and getting many teams to abide to it well can be an uphill battle. I am not saying don’t do it but it shouldn’t be the default.\n\nWe have not reached peak backend architecture and we never will because all software is different in terms of needs, size and complexity.",
          "score": 28,
          "created_utc": "2026-01-27 18:49:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o22i833",
              "author": "Brief_Ad_5019",
              "text": "Agree!\nI learned the problems with transaction boundaries with domain events being processed eventually consistent the hard way: My FE reloaded an overview directly after the POST call returned -  and I got data that was not yet fully updated.. so what to do? Timeout? 😂 Websockets? Or just process domain events before returning?\n\nThat's why I intentionally added to use DDD only for domains that are actually complex enough.",
              "score": 4,
              "created_utc": "2026-01-27 19:05:00",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o23q65d",
              "author": "Emotional-Dust-1367",
              "text": "Why does monolith make transaction boundaries tricky?",
              "score": 2,
              "created_utc": "2026-01-27 22:21:59",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o244yoa",
                  "author": "iMac_Hunt",
                  "text": "The monolith part is fine, I’m referring to hexagonal and DDD",
                  "score": 3,
                  "created_utc": "2026-01-27 23:35:01",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o22hbg1",
          "author": "atika",
          "text": ">Horizontal Scaling: Before splitting anything, we scale the Monolith horizontally. Put it behind a load balancer, spin up multiple replicas, and let it rip. It’s easier, cheaper, and keeps data consistency simple.\n\nAll the scalability \"best practices\" that architects swear by today, were born when the most powerful server box you could get had two dual core CPUs and memory was measured in megabytes.  \n\nRight now, we have CPUs with hundreds of cores per socket, memory in terrabyte sizes, and hyperconverged storage solutions to easily reach petabytes using prosumer hardware.\n\nStart designing your systems to run on modern hardware.",
          "score": 8,
          "created_utc": "2026-01-27 19:01:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o22jz1u",
              "author": "Brief_Ad_5019",
              "text": "Definitely a key takeaway reading though the comments.\nI still think that horizontal scalability can be helpful for separations of concerns: you can make sure that your sync calls are not getting affected by async work. Or keep your /reports routes away from /overview.",
              "score": 1,
              "created_utc": "2026-01-27 19:12:37",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o22cq9k",
          "author": "mountainlifa",
          "text": "Great post and agree 💯. Currently refactoring a Frankenstein micro services app built upon AWS serverless into a monolith. It took months just to understand what the heck was going on. Lambdas calling lambdas, Rube Goldberg would be proud! We're likely using fastapi containerized on ecs. As a former SA at AWS I think a lot of noise has gone away because Amazon, Microsoft etc has fired a lot of their \"dev evangelist\" teams and sort of given up to focus on AI shiny objects. They've submitted to the fact that in reality no one outside of amazon is building massively complex applications in this way. Ironically Amazon's payments API is a monolith and no plans to change it lol.",
          "score": 12,
          "created_utc": "2026-01-27 18:41:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o28oryh",
              "author": "Brief_Ad_5019",
              "text": "Appreciate that! I would love to see your context-map 😁 Serverless Big Ball Of Mud - what a time to be alive!",
              "score": 2,
              "created_utc": "2026-01-28 16:36:17",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2374we",
          "author": "PizzaHuttDelivery",
          "text": "DDD did not receive a major shake up. It is very much the same thing evans and vernon proselitized 10 years ago. If it wasnt for microservices and api design practices, DDD would have been probably dead. \n\nDon't get me wrong. DDD is useful, but if you look at all other techniques, they all kind of went an evolution/revolution. Many ideas have been challenged and overturned all across the board. But DDD is still almost the same as 20 years ago.",
          "score": 4,
          "created_utc": "2026-01-27 20:56:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o22o7az",
          "author": "CzyDePL",
          "text": "And it's going to trash because now we need \"agentic architecture\"",
          "score": 3,
          "created_utc": "2026-01-27 19:31:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o28lb8a",
              "author": "asdfdelta",
              "text": "Enshittification-as-a-Service",
              "score": 4,
              "created_utc": "2026-01-28 16:21:16",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o25e72l",
          "author": "Longjumping_Status71",
          "text": "There is nothing you described that doesn’t match my clients enterprise system, a lot of which is there because of me and the same understandings that you have outlined and I have come to believe as the best way to do things as well. Microservice vs monolith has bounced back and forth in the blogosphere , but once the organization reaches a critical mass I think everyone ends up with some microservices… usually supporting a monolith as well.",
          "score": 5,
          "created_utc": "2026-01-28 03:32:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o29x8sh",
          "author": "ConstructionInside27",
          "text": "Yeah, I think we might be. It still surprises me that we don't yet have well accepted frameworks to reproduce the independence enforcement benefits of microservices without actually putting a network boundary in there.\n\nIt's a complex problem to solve build times and dependencies but worth something. Or what about monorepo? Core library maintainers can keep pushing their latest and greatest versions out, make breaking changes they can unbreak on all the callers in the same PR. \n\nAgain, a technical challenge but I can't believe we're still in this situation where companies must choose between sophisticated ball of mud vs a puddle archipelago of shallow, repetitive, immature",
          "score": 3,
          "created_utc": "2026-01-28 19:49:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2cdf1z",
          "author": "TylerDurdenFan",
          "text": "I really hope people are actually understanding that Microservices are an optimization for large, multi-team organizations where autonomous decision-making across domains creates actual business value. The cargo cult has run for long enough IMHO. I wonder if AI will delay the point at which microservices become necessary / worth it. If the initial team can do much more thanks to AI, then the organizational need for separate teams/services should appear later than it did before AI, and many won't get there.",
          "score": 3,
          "created_utc": "2026-01-29 03:03:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o251cla",
          "author": "markojov78",
          "text": "I really disagree that microservices are some kind of internal organisation tool.\n\nIt's a design pattern for decoupling which has implications on scalability and resilience. Like any other design pattern it's not good for every case but it is all about how software performs in production, not about people who made it.\n\nTreating it as internal organisation tool is what caused so many awful attempts at microservices where boundaries were merely \"administrative\" and never contributed to any decoupling ...",
          "score": 3,
          "created_utc": "2026-01-28 02:23:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o22ryzx",
          "author": "EagleSwiony",
          "text": "Kinda agree beside the DDD and PostgreSQL point. \n\nRegarding Postgre I would not say it's THE standard. IT depends on the industry. In Fintech, I would say MSSQL or even Oracle DB are more prominent and used in those huge Enterprises.",
          "score": 2,
          "created_utc": "2026-01-27 19:48:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o25vo3u",
          "author": "flavius-as",
          "text": "There's one more trick with the performance of a modulith behind the LB: you (soft) redirect certain use cases to certain nodes in order to keep the caches warmer.\n\nAnd one more trick to make problems surface: you give each module in the modulith its own db credentials and connection. Guardrail: you keep in check what each module is able to read or write via schemas and permissions.",
          "score": 2,
          "created_utc": "2026-01-28 05:20:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o266ipg",
          "author": "vbilopav89",
          "text": "No we haven't. I'm known to be a notorious DDD hater and I do hate anything DDD/CA/HA with passion. \n\n\nAlthough, I do admit that DDD had some good parts, only two actually (language, context), but those concepts existed even before.\n\n\nAnything else is crap and nonsense amd I've been writing and ranting about it for years now on LinkedIn. Here's my latest:\nhttps://www.linkedin.com/posts/vb-software_here-is-a-really-really-interesting-side-by-side-activity-7421810292365590528-hJyE?utm_source=share&utm_medium=member_android&rcm=ACoAAAFChn4BJtC3te8HO2_kZu5V6dFh8zzjQq8",
          "score": 2,
          "created_utc": "2026-01-28 06:42:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o26fmte",
          "author": "YahenP",
          "text": "These are tough times in the industry. There's no money, projects are being scrapped, jobs are being cut. At times like these, religious wars about architecture and other abstract matters usually subside. Most are focused on their work and how to avoid wasting it. Doing more with less. When (and if) the industry emerges from the crisis, all these debates will flare up with renewed vigor.",
          "score": 2,
          "created_utc": "2026-01-28 07:59:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o27i8y7",
          "author": "tr14l",
          "text": "Modular monolith requires a certain amount of guard dogging, too. \n\nPersonally, Conway's law is the driver for me. I let deployment/ownership needs drive segregation. Where there is a unit of people, that unit should map to business function, and they should have their own deployable artifacts that do not require coordination with anyone else. \n\nI also demand people are ruthless about mitigation of outside dependency elsewhere in the company. If you don't control it, you should be bitching about using it. Obviously third party tools with support are more of an exception, but a culture of wanting full control should be in place. You want me to use your email gateway? How about go eff yourself. I can do that myself and I'm not coming to you every time I need a template change for a feature.\n\nYou want me to use your special search service? Nah son. I can handle elastic search myself. Thanks. \n\nYou want me to use your special sauce feature flag BS? Make me.",
          "score": 2,
          "created_utc": "2026-01-28 13:12:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2bpmag",
          "author": "Serializedrequests",
          "text": "How about the active record pattern? Much too maligned today. It's the foundation of rapid development in Rails, along with solid DDD. It might struggle with complexity of different use cases, but only for the 5% of your app that gets complex.\n\n\nCheck out the source code of Fizzy: https://github.com/basecamp/fizzy It's nothing like anything in OP, but super readable.",
          "score": 2,
          "created_utc": "2026-01-29 00:53:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2gnuuk",
              "author": "Brief_Ad_5019",
              "text": "I needed to look this pattern up - but I really agree that this looks super cool. I wouldn’t be aware of any dotnet implementations though..\n\nIf I am not mistaken I have used that in php with Laravel couple of years ago in a CRM app! I remember well that I was quite surprised how far php frameworks have become - super good for fast development.\nThanks for bringing nostalgia!",
              "score": 1,
              "created_utc": "2026-01-29 19:04:14",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2ibulv",
                  "author": "Serializedrequests",
                  "text": "I haven't seen it used to very great effect in Java-like frameworks in a while. In Rails it is basically a code generator. Inspects the database and generates all the CRUD on startup. I wouldn't want to try that in C#. The frameworks that do this are all annotation driven, which I have a very low opinion of.",
                  "score": 1,
                  "created_utc": "2026-01-29 23:59:26",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2d8ae1",
          "author": "HosseinKakavand",
          "text": "This captures really well what we've seen in the Golang/enterprise ecosystem at [Luther](https://www.reddit.com/r/luthersystems/). Domains captured in a bounded context as a single transaction, cross-domain involves orchestration. Totally agree microservices are best used for solving organizational problems, although there are edge cases where it makes sense for security. Personally, we also keep logic decoupled from integrations via eventing and a single connector hub service (multiple replicas), but I don't know how common this is.",
          "score": 2,
          "created_utc": "2026-01-29 06:31:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2fk7v8",
          "author": "livecodelife",
          "text": "I think this is an accurate take. I actually believe the next “architecture” shift will be more about how we define the system and manage the code itself more than how we choose to structure it. AI code generation lends itself to this “boring” modular style so I think people will double down on it. Additionally though, I think we’ll see a rise of external evaluation tools for the system behavior because we’ll want something outside the codebase to test the system. Chad Fowler has a great series on this called the [Phoenix Architecture](https://aicoding.leaflet.pub/)",
          "score": 2,
          "created_utc": "2026-01-29 16:06:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2glttx",
              "author": "Brief_Ad_5019",
              "text": "Define you mean to explore the domain and find out what to build actually? Or more in the direction of “plan.md”?",
              "score": 1,
              "created_utc": "2026-01-29 18:54:54",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2h40iq",
                  "author": "livecodelife",
                  "text": "Neither actually. I mean building external, durable evaluation tests to define/validate the behavior of the system so that no matter how many times the code for the system is generated or regenerated by AI, we can know that it performs correctly as long as those evaluations pass. Basically  deterministic harness for the non-deterministic code generation. And this is easier if you follow this boring but proven architecture",
                  "score": 1,
                  "created_utc": "2026-01-29 20:20:59",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2gi1iq",
          "author": "Ok_Reality6261",
          "text": ",I work with Spring and it is pretty much the same: Hexagonal, DDD, EDA, PostgreSQL, Redis...  I would not call that \"peak backend architecture\" tho, just a way of doing things because it is the most common practice right now and microservicess suit big orgs\n\nThat said, the current margin strecth and cost efficiency that is happening across all industrie may change things like \"yeah well, lets assume a bigger domain so we do not end up with 3 services for that crap\" (which to be honest its something I am fine with. I have seen unjustified levels of granularity just for the sake of it)",
          "score": 2,
          "created_utc": "2026-01-29 18:37:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2glcln",
              "author": "Brief_Ad_5019",
              "text": "Great finally a spring guy, interesting to hear that! Can you recommend any template? It has been quite a while since I saw a spring backend - would be fun!\n\nBtw if someone is interested in a great dotnet CA template, [this one](https://github.com/amantinband/clean-architecture) I really like 😉",
              "score": 1,
              "created_utc": "2026-01-29 18:52:45",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2pspj9",
          "author": "RainierMallol",
          "text": "I wholeheartedly agree. My work is mainly on new software for enterprises, government and private. This is the way to go when a new software development is actually required.\n\nAnd what I suspect what is an unpopular opinion here: Sometimes just push for a quick low code solution using something that connects already existing software that the org has access to, such as Power Automate + Sharepoint + some type of db pipeline to have a single source of thruth with the organization's core business software. Quick, easy to deploy and integrate, not so scalable in terms of funcionality but allows to test and improve, and even decide to build or buy something later on when the current tech doesn't fit the business requirements anymore.",
          "score": 2,
          "created_utc": "2026-01-31 01:46:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o228nrg",
          "author": "HowIsDigit8888",
          "text": "None of the good backend architecture has been made yet. We haven't even gotten started except at the drawing board. Everything in deployment is jank",
          "score": 1,
          "created_utc": "2026-01-27 18:24:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o22bec2",
              "author": "Brief_Ad_5019",
              "text": "Honestly even this is a bit harsh - I also need to agree that even if this \"Modern Standard\" is now somewhat popular - a lot of new services that I see still don't mind and go crazy..",
              "score": 3,
              "created_utc": "2026-01-27 18:36:08",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o22c2u1",
                  "author": "HowIsDigit8888",
                  "text": "Yeah I guess I did exaggerate the harshness, there are open source stacks that aren't really janky these days",
                  "score": 1,
                  "created_utc": "2026-01-27 18:39:00",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o23cos0",
          "author": "ConquerQuestOnline",
          "text": "I think that that's a pretty standard architecture these days for apps with strong consistency. Vertical slices, a little DDD flavoring, etc. It's what I'm doing for my current side-project.\n\nAt work, we're very much EDA with event-sourcing, and mostly, it's the right choice.",
          "score": 1,
          "created_utc": "2026-01-27 21:21:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o24cm22",
          "author": "symbiat0",
          "text": "Actually I think it depends on use cases for your application. Sometimes a monolith makes sense, sometimes it doesn’t, I’ve been on both sides of that the past few years…",
          "score": 1,
          "created_utc": "2026-01-28 00:14:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o25htpa",
          "author": "NTXL",
          "text": "In my humble uneducated opinion  i don’t think it gets better than serverless",
          "score": 1,
          "created_utc": "2026-01-28 03:53:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o28mk4y",
              "author": "asdfdelta",
              "text": "If I had a nickel for every time I've heard that haha.\n\nThere is one constant in software - everything always changes. Especially constraints, which shift the value of different stacks.",
              "score": 1,
              "created_utc": "2026-01-28 16:26:42",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2etww8",
                  "author": "NTXL",
                  "text": "I swear I was joking. I actually have nightmares about serverless lol",
                  "score": 2,
                  "created_utc": "2026-01-29 14:01:14",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o2clckd",
              "author": "TylerDurdenFan",
              "text": "Back in 2023 Amazon posted an article ( [https://www.primevideotech.com/video-streaming/scaling-up-the-prime-video-audio-video-monitoring-service-and-reducing-costs-by-90](https://www.primevideotech.com/video-streaming/scaling-up-the-prime-video-audio-video-monitoring-service-and-reducing-costs-by-90) now gone, understandably ) titled: \"Scaling up the Prime Video audio/video monitoring service and reducing costs by 90%\"\n\nSubtitled: The move from a distributed microservices architecture to a monolith application helped achieve higher scale, resilience, and reduce costs.\n\nMost of the \"90% cost savings\" came from leaving AWS Step Functions (Lambda). The article really made the rounds. And it was on Amazon Prime's website, talk of credibility!. It's a very interesting read, and although Amazon has since removed it, PDF copies can still be found online.",
              "score": 1,
              "created_utc": "2026-01-29 03:50:32",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2e5xlr",
                  "author": "Odd_Ordinary_7722",
                  "text": "That's a lesson in refactoring, not that serverless is bad",
                  "score": 1,
                  "created_utc": "2026-01-29 11:30:22",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o26o15h",
          "author": "Few_Cauliflower2069",
          "text": "Nope. The tooling and infrastructure around microservices failed, it was harder to debug and keep track of the system landscape so now people are going back to monoliths. Microservices are far superior in terms of scalability, security, maintenance, development speed and many more areas though",
          "score": 1,
          "created_utc": "2026-01-28 09:16:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o27j64a",
          "author": "[deleted]",
          "text": "[deleted]",
          "score": 1,
          "created_utc": "2026-01-28 13:17:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2goda1",
              "author": "Brief_Ad_5019",
              "text": "So let’s review their code and give helpful comments so they improve! Remember we all have been there!",
              "score": 1,
              "created_utc": "2026-01-29 19:06:37",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2nm3ty",
          "author": "evoludigit",
          "text": "I do not know if we have reached peak software architecture, software engineering is still in its infancy if we compare it to most technologies.\n\nI come from the Python world, and was frustrated by the lack of tools for architecting a Saas with a very complex domain (think 50+ entities).\n\nI came up with https://fraiseql.dev, the core innovation is to use CQRS and have both:\n- a normalized model, that use tb_ tables with all the constraints, indexes etc. SOLID principles that have long been optimized in the DB world,\n- a read side with composed JSONB views.\n\n\nEach query is just 'SELECT data FROM v_{entity} WHERE ...', and the framework just selects the required keys from the json payload and camelCase them for direct consumption by the frontend.  \n\nEarly results significantly outperform more conventional approaches simply because the data path is extremely short: DB → JSON → HTTP.\n\nI’m rewriting the core in Rust, and schemas will be authorable in any language.\n\nBecause the query pattern is so simple, the approach isn’t tied to a single database. Any engine that can store JSON can support it—v2 will target PostgreSQL, SQL Server, SQLite, and MySQL.\n\nAt least for me, this approach has meaningfully improved both the ease of maintenance and the performance of large, complex codebases.",
          "score": 1,
          "created_utc": "2026-01-30 19:06:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2qa9sh",
          "author": "fungkadelic",
          "text": "Microservices can scale up and down to meet demand, it’s not just social. Don’t be silly?",
          "score": 1,
          "created_utc": "2026-01-31 03:31:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2svcq5",
          "author": "czlowiek4888",
          "text": "I'm from node js world, this is basically the same on my side.\n\nBut imho the web dev I not really that hard to came up with good architecture.\n\nI started writing my own game engine, this is sick.",
          "score": 1,
          "created_utc": "2026-01-31 15:24:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2y0na5",
              "author": "Brief_Ad_5019",
              "text": "Can you recommend any good starter template or resources on a well architected Node Js backend?\n\nFor web development I have personally more struggles to architect that nicely. From my experience every Frontend looks very different...",
              "score": 1,
              "created_utc": "2026-02-01 09:33:47",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2y0xvo",
                  "author": "czlowiek4888",
                  "text": "This is what I work right now \nhttps://github.com/czlowiek488/node-starter\n\nBut be aware I'm pushing changes to the registration module and finishing it right now.",
                  "score": 2,
                  "created_utc": "2026-02-01 09:36:35",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2t81fm",
          "author": "iocompletion",
          "text": "Hexagonal is good but a bit overrated. Functional core/imperative shell is better and a bit underrated.",
          "score": 1,
          "created_utc": "2026-01-31 16:25:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2wlj1r",
          "author": "eggucated",
          "text": "I’m in agreement OP",
          "score": 1,
          "created_utc": "2026-02-01 02:54:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o22w3mp",
          "author": "justUseAnSvm",
          "text": "*Let me tell you something, I haven't even begun to peak. And when I do peak, you'll know. Because I'm gonna peak so hard that everybody in Philadelphia's gonna feel it.*",
          "score": 1,
          "created_utc": "2026-01-27 20:06:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o226inz",
          "author": "atika",
          "text": "Fuck no. DDD is a horrible way to decompose your system.",
          "score": -3,
          "created_utc": "2026-01-27 18:15:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2283a7",
              "author": "dbcoder",
              "text": "what is your preferred methodology?",
              "score": 8,
              "created_utc": "2026-01-27 18:22:09",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o22f0x7",
                  "author": "atika",
                  "text": "Let's not get into a religious debate here, m'kay?\n\nBut look at [this video](https://www.youtube.com/watch?v=Q6RfMmMwhvM), somewhere around 5 min. mark, he starts to get into service granularity.",
                  "score": -5,
                  "created_utc": "2026-01-27 18:51:20",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o22951x",
              "author": "Brief_Ad_5019",
              "text": "Oh you think so? After a learning curve I am big believer. I found that things like ubiquitous language and a clean domain model is super helpful - especially during testing.\n\nSomehow I feel that we have forgotten the fundamentals of how a class should encapsulate data AND it's domain logic while we have  have adopted EntityFramework, created an anemic domain model and put everything in the controller 😂",
              "score": 7,
              "created_utc": "2026-01-27 18:26:34",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o22jx56",
                  "author": "CzyDePL",
                  "text": "Yup, it's not even about DDD - it's basic OOP. I blame Java for \"class oriented programming\" vs proper OOP",
                  "score": 2,
                  "created_utc": "2026-01-27 19:12:23",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o237qq5",
          "author": "Charming-Raspberry77",
          "text": "Get to a few thousand requests per second and your modulith on pg will look less attractive by the day. Big scale breaks everything.",
          "score": 0,
          "created_utc": "2026-01-27 20:59:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2cj7d3",
              "author": "TylerDurdenFan",
              "text": "[https://openai.com/index/scaling-postgresql/](https://openai.com/index/scaling-postgresql/)\n\nit'd seem attention and read replicas is all you need.",
              "score": 1,
              "created_utc": "2026-01-29 03:37:35",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2d4cnm",
                  "author": "Charming-Raspberry77",
                  "text": "I know. I have seen both global pg and dynamo at scale, for example. Dynamo scales endlessly with no maintenance, and is cheaper. PG replicas not so much.",
                  "score": 1,
                  "created_utc": "2026-01-29 06:00:12",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o227ig1",
          "author": "InternationalEnd8934",
          "text": "nowhere close peak. that will be quantum computers and quantum entanglement data transmission that is faster than light",
          "score": -8,
          "created_utc": "2026-01-27 18:19:45",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qtw76q",
      "title": "We skipped system design patterns, and paid the price",
      "subreddit": "softwarearchitecture",
      "url": "https://www.reddit.com/r/softwarearchitecture/comments/1qtw76q/we_skipped_system_design_patterns_and_paid_the/",
      "author": "Icy_Screen3576",
      "created_utc": "2026-02-02 14:16:04",
      "score": 226,
      "num_comments": 34,
      "upvote_ratio": 0.97,
      "text": "We ran into something recently that made me rethink a system design decision while working on an event-driven architecture. We have multiple Kafka topics and worker services chained together, a kind of mini workflow.\n\n[Mini Workflow](https://preview.redd.it/fgm3nejx93hg1.png?width=3750&format=png&auto=webp&s=7965432a4731f2658c648475b1d90593a0f69282)\n\nThe entry point is a legacy system. It reads data from an integration database, builds a JSON file, and publishes the entire file directly into the first Kafka topic.\n\n# The problem\n\nOne day, some of those JSON files started exceeding Kafka’s default message size limit. Our first reaction was to ask the DevOps team to increase the Kafka size limit. It worked, but it felt similar to increasing a database connection pool size.\n\nThen one of the JSON files kept growing. At that point, the DevOps team pushed back on increasing the Kafka size limit any further, so the team decided to implement chunking logic inside the legacy system itself, splitting the file before sending it into Kafka.\n\nThat worked too, but now we had custom batching/chunking logic affecting the stability of an existing working system.\n\n# The solution\n\nWhile looking into system design patterns, I came across the Claim-Check pattern.\n\n[Claim-Check Pattern](https://preview.redd.it/3lmiy1t9a3hg1.png?width=3332&format=png&auto=webp&s=890aa3c5d542d979c9e7eb0d564dcfa576aa9276)\n\nInstead of batching inside the legacy system, the idea is to store the large payload in external storage, send only a small message with a reference, and let consumers fetch the payload only when they actually need it.\n\n# The realization\n\nWhat surprised me was realizing that simply looking into existing system design patterns could have saved us a lot of time building all of this.\n\nIt’s a good reminder to pause and check those patterns when making system design decisions, instead of immediately implementing the first idea that comes to mind.",
      "is_original_content": false,
      "link_flair_text": "Discussion/Advice",
      "permalink": "https://reddit.com/r/softwarearchitecture/comments/1qtw76q/we_skipped_system_design_patterns_and_paid_the/",
      "domain": "self.softwarearchitecture",
      "is_self": true,
      "comments": [
        {
          "id": "o35sph1",
          "author": "Estel-3032",
          "text": "I remember that in my first job one of the other engineers said 'so let's check what kind of wheels people are using out there before we start inventing our own' to a roughly similar situation and it stuck with me.",
          "score": 96,
          "created_utc": "2026-02-02 14:33:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o35yybb",
              "author": "Icy_Screen3576",
              "text": "Sounds like a pragmatic engineer.",
              "score": 21,
              "created_utc": "2026-02-02 15:05:46",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o363lmg",
          "author": "czlowiek4888",
          "text": "Yeah, this is exactly what you should do.\n\nDon't treat messages in your system as a data storage ( it is convenient though ) but more like notifications.\n\nYou just want to send event telling you what happened, not necessarily why, how, where and when. All those other information you should get on your own from database or other storage when you think it's necessary.\n\nIn real time system you usually want to have each message under ~1.4kb this is the frame size in which your messages are send over the network.\n\nBecause if you need to pass larger messages you will need wait for the all other frames that together create single message.\n\nThis way if you send only 1 frame you can go crazy fast.\n\nAlso Kafka uses stores messages to be replied when necessary, you will be able to store more messages.\n\nYou also may want to think about private replies of messages. For example you have service that receives http request, you send event and await other in response. You need to know how to send a response event to the instance of app that holds http socket file to be able to respond to the http request with the event data.\n\nIt's a bit more advanced but it is what many event driven systems need.",
          "score": 22,
          "created_utc": "2026-02-02 15:28:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o36bjxc",
              "author": "Icy_Screen3576",
              "text": "Well said. Keeping messages small and event-focused made things a lot simpler.",
              "score": 4,
              "created_utc": "2026-02-02 16:06:02",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3663cp",
          "author": "bigkahuna1uk",
          "text": "I think everyone should read [Enterprise Integration Patterns](https://www.enterpriseintegrationpatterns.com/patterns/messaging/toc.html) by Gregor Hophe  .\n\nOver 20 years old but still highly relevant today.",
          "score": 34,
          "created_utc": "2026-02-02 15:40:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3694rz",
              "author": "bobaduk",
              "text": "Came here to say exactly this. IIRC the patterns are all described online, so you can skim and get a vague sense, then go back to look deeper when you need something.\n\nMessaging patterns have been established for a long time, and it's worth being familiar with the prior art.",
              "score": 7,
              "created_utc": "2026-02-02 15:54:46",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o369oto",
              "author": "Icy_Screen3576",
              "text": "Thanks for sharing!",
              "score": 2,
              "created_utc": "2026-02-02 15:57:19",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o3bmq78",
              "author": "garden_variety_sp",
              "text": "And every pattern has been implemented by Apache Camel, the GOAT of integration frameworks. And 100% free and open source.",
              "score": 1,
              "created_utc": "2026-02-03 11:07:15",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o35qx62",
          "author": "AzureMate",
          "text": "Clever! Thanks for sharing!",
          "score": 14,
          "created_utc": "2026-02-02 14:24:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o35uopk",
              "author": "Icy_Screen3576",
              "text": "You are welcome! Glad it helped.",
              "score": 1,
              "created_utc": "2026-02-02 14:43:56",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o363xwc",
          "author": "tesseraphim",
          "text": "It worked, the system kept chugging for quite some time. That's a win. It could have worked for 10 years, some systems do. The question is, how much change you needed to do. Trick is not to build up front, but make sure the seams are there so you can easily change.",
          "score": 6,
          "created_utc": "2026-02-02 15:30:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o35y599",
          "author": "Few_Wallaby_9128",
          "text": "It does come at a price, right? an extra single point of failure, extra latency, possible network failures and managament (dns/cert renewals/fws), and logic to handle the lifecycle, synchronization and deletion of the data in the storage. If the growing json was the problem, dynamic zipping of it could have worked wonders at a fraction of the total cost of maintenance.",
          "score": 12,
          "created_utc": "2026-02-02 15:01:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o35zedo",
              "author": "europeanputin",
              "text": "Software engineering is always full of trade-offs. I have a non-fixed size JSONs, but due to compliance reasons there's no way that they could be pulled on-demand, and I simply have to store them all, regardless of their size. Some documents are about the size of 10mb after doing the compression.",
              "score": 13,
              "created_utc": "2026-02-02 15:08:02",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o364msa",
              "author": "czlowiek4888",
              "text": "You shouldn't think about it as a trade off.\nThis is the one and only correct way.\n\nSending events with the data is anti pattern imho.\nWhat if you want to add CQRS and you regenerate your state from commands?\nAnd now data you hold in your messages is no longer valid because it was changed how app processes things so your message as a storage approach make you not able to perform state regeneration.",
              "score": 2,
              "created_utc": "2026-02-02 15:33:36",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3650bk",
                  "author": "czlowiek4888",
                  "text": "Also what if your messages store personal information that you are obligated to remove in certain situations.\nYou will be deleting messages and this will lead to inability to regenerate state as disaster recovery mechanism.",
                  "score": 3,
                  "created_utc": "2026-02-02 15:35:24",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o38r9ib",
                  "author": "pins17",
                  "text": "For OP's scenario I agree. But in general it really depends on the use case.\n\nFor example, in high-frequency scenarios like price updates on energy or commodity markets, it is standard practice to include the market data directly in the event. That is the whole point. Doing a lookup for every event would introduce unacceptable latency and massive load on the source system. The same applies to telemetry data in fleet management.\n\nClaim Check has its merits, as you mentioned, but it also has downsides. While the producer is free from temporal/runtime coupling, the consumer is not, which negates one of the main benefits of asynchronous architecture.",
                  "score": 2,
                  "created_utc": "2026-02-02 22:56:43",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o35s577",
          "author": "cstopher89",
          "text": "This is a nice pattern. I use it for Azure Service Bus messages to handle large payloads.",
          "score": 2,
          "created_utc": "2026-02-02 14:30:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o35w6va",
              "author": "Icy_Screen3576",
              "text": "In our case it was an on-prem Kafka broker, with the payload in external storage. Do you usually pair Service Bus with Blob Storage for this?",
              "score": 2,
              "created_utc": "2026-02-02 14:51:42",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o37zfxv",
                  "author": "01acidburn",
                  "text": "Yep",
                  "score": 1,
                  "created_utc": "2026-02-02 20:42:12",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o38qc8h",
                  "author": "cstopher89",
                  "text": "Yeah blob storage works well for this",
                  "score": 1,
                  "created_utc": "2026-02-02 22:51:56",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o36mkf6",
          "author": "nt2g",
          "text": "Great post and great reminder, thank you for sharing!",
          "score": 2,
          "created_utc": "2026-02-02 16:56:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o37a0ej",
          "author": "dukemanh",
          "text": "question: what will happen and what should we do if the tiny message already arrived at the consumer but the large payload is not yet available on the file storage?",
          "score": 2,
          "created_utc": "2026-02-02 18:43:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o37x2tn",
              "author": "Primary-Juice-4888",
              "text": "Consumer - retry message processing until file is available, perhaps with exponential backoff.\n\nor\n\nProducer - only send a message after the storage write was confirmed.",
              "score": 5,
              "created_utc": "2026-02-02 20:30:56",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o36raxr",
          "author": "Samrit_buildss",
          "text": "Really nice write-up. The claim-check pattern here is a great reminder that many scaling problems already have well-known solutions we just forget to look for them under pressure.",
          "score": 3,
          "created_utc": "2026-02-02 17:18:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o35utna",
          "author": "Constant_Physics8504",
          "text": "Could’ve been turned into a Dispatch system with MQ quite easily",
          "score": 1,
          "created_utc": "2026-02-02 14:44:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o363d0a",
              "author": "Icy_Screen3576",
              "text": "Yep, we only use claim-check for large payloads. Most messages go through the message broker.",
              "score": 3,
              "created_utc": "2026-02-02 15:27:28",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o37gnoz",
          "author": "bunsenhoneydew007",
          "text": "We use the claim check pattern extensively on a similar workflow like system. It works extremely well and allows the payload to be agnostic to the event transfer mechanism, which can provide other benefits regarding data processing in the services. (We use eventbridge rather than Kafka).",
          "score": 1,
          "created_utc": "2026-02-02 19:13:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o37ktml",
          "author": "Careless-Childhood66",
          "text": "Amen",
          "score": 1,
          "created_utc": "2026-02-02 19:33:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o38o6pt",
          "author": "ErgodicMage",
          "text": "I develop distrubuted workflow systems and use Claims all the time.",
          "score": 1,
          "created_utc": "2026-02-02 22:40:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3bmwkd",
          "author": "garden_variety_sp",
          "text": "Did you consider using a more compact wire format like Avro or Protobuf?",
          "score": 1,
          "created_utc": "2026-02-03 11:08:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3c3yre",
              "author": "Icy_Screen3576",
              "text": "Considered avro, still we would be pushing in the wrong direction. Thinking in tiny events made things simpler. I dont think message brokers are made for large payloads.",
              "score": 1,
              "created_utc": "2026-02-03 13:13:07",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qsz7w5",
      "title": "[META] AI generated posts are no longer allowed",
      "subreddit": "softwarearchitecture",
      "url": "https://www.reddit.com/r/softwarearchitecture/comments/1qsz7w5/meta_ai_generated_posts_are_no_longer_allowed/",
      "author": "asdfdelta",
      "created_utc": "2026-02-01 14:01:24",
      "score": 153,
      "num_comments": 15,
      "upvote_ratio": 0.97,
      "text": "Following the poll that was posted last week, the community has overwhelmingly voted to remove any kind of post or comment that we clearly generated by AI.\n\nPosts and comments can now be reported for AI generated text, and will be removed as I see the reports or posts. **Please report what you see!**\n\nThis rule applies to all posts and comments following the timestamp of this one, it will not retroactively affect any content on the sub.\n\nAdvice for those that wish to use AI to translate or inprove English as it is not your first language: write the overall structure of your post yourself and let an AI tool like Grammarly's inline capabilities (free) to improve the sentence structure and word choice. This has been around for a long time and continues to get better. Fully generating your posts will result in removal, repeat offenders will be banned. I'm open to pinning a post that has a list of good alternatives if we can crowdsource it from experience.\n\nThank you to everyone who voted in the poll! Keeping the sub healthy takes everyone's effort. Thank you especially for those that called for mod action, they spurred this new rule into existence.",
      "is_original_content": false,
      "link_flair_text": "Discussion/Advice",
      "permalink": "https://reddit.com/r/softwarearchitecture/comments/1qsz7w5/meta_ai_generated_posts_are_no_longer_allowed/",
      "domain": "self.softwarearchitecture",
      "is_self": true,
      "comments": [
        {
          "id": "o2z2krn",
          "author": "bobaduk",
          "text": "Delighted to see this, personally. If I want ChatGPTs output, I'll ask for it myself.",
          "score": 41,
          "created_utc": "2026-02-01 14:23:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o315oo0",
          "author": "tomByrer",
          "text": "I 100% agree, but I'm also wondering about the folks who don't speak English, & have to use a translator to communicate....",
          "score": 7,
          "created_utc": "2026-02-01 20:17:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o31du5v",
              "author": "asdfdelta",
              "text": "I am as well. If you know of any methods that can be used or tools that won't write 100% of the post, please let me know.",
              "score": 2,
              "created_utc": "2026-02-01 20:57:52",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2zbsa8",
          "author": "CompetitiveProof3078",
          "text": "Great news",
          "score": 6,
          "created_utc": "2026-02-01 15:12:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o31vu29",
          "author": "donz0r",
          "text": "Does the rule apply to comments as well?",
          "score": 3,
          "created_utc": "2026-02-01 22:25:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o35hg1p",
              "author": "asdfdelta",
              "text": "Yes! But the timestamp must be after this post was published.",
              "score": 2,
              "created_utc": "2026-02-02 13:31:39",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2z41sm",
          "author": "IlliterateJedi",
          "text": "Disappointing.  Reporting all the AI posts on here gave me something to do during my daily ablutions every morning.",
          "score": 12,
          "created_utc": "2026-02-01 14:32:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2z8k0u",
              "author": "uusu",
              "text": "That's literally what OP is asking us to do. You can't 100% be certain a post is AI generated, so the report helps you know whether the community is okay with removing a post.\n\nAdditionally, now your reporting actually has an effect thanks to this rule.",
              "score": 8,
              "created_utc": "2026-02-01 14:56:05",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o326zgr",
          "author": "UnreasonableEconomy",
          "text": "Regarding translation: I think the problem isn't translation, but generation. Specifically, people using \"translation\" and ESL as a moral mask for generated content.\n\nThis is just an idea, and I don't know how good it is - but perhaps allowing translation with any tool, including chatgpt - would be acceptable, as long as the OP includes the original as a comment.",
          "score": 2,
          "created_utc": "2026-02-01 23:24:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o35htwf",
              "author": "asdfdelta",
              "text": "That might be a good idea, I'll add it to the list of possibilities. Thank you!",
              "score": 2,
              "created_utc": "2026-02-02 13:33:53",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o30f4ag",
          "author": "wjrasmussen",
          "text": "I appreciate that we are going this direction.  Brought to you by Carl's Jr.",
          "score": 6,
          "created_utc": "2026-02-01 18:14:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o31e7l3",
              "author": "asdfdelta",
              "text": "I can't bring myself to rewatch Idiocracy anymore, it's just too much 😂",
              "score": 5,
              "created_utc": "2026-02-01 20:59:44",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o300jvn",
          "author": "Gunny2862",
          "text": "Amen.",
          "score": 1,
          "created_utc": "2026-02-01 17:08:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o30jzkf",
          "author": "777ortale",
          "text": "Nice! Beep boop.",
          "score": 1,
          "created_utc": "2026-02-01 18:36:19",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qsqft5",
      "title": "Architecture for beginners",
      "subreddit": "softwarearchitecture",
      "url": "https://www.reddit.com/r/softwarearchitecture/comments/1qsqft5/architecture_for_beginners/",
      "author": "EviliestBuckle",
      "created_utc": "2026-02-01 06:05:06",
      "score": 79,
      "num_comments": 37,
      "upvote_ratio": 0.98,
      "text": "Are there any recommended resources for beginners to study and understand and start their journey towards software architects?\n\nBackground: worded in frontend and backend with just basic crud api\n\nExperience: 4yrs but afraid to have a repeated 1 year of experience for four years. Need to justify my experience after 10 years",
      "is_original_content": false,
      "link_flair_text": "Discussion/Advice",
      "permalink": "https://reddit.com/r/softwarearchitecture/comments/1qsqft5/architecture_for_beginners/",
      "domain": "self.softwarearchitecture",
      "is_self": true,
      "comments": [
        {
          "id": "o2xdkiw",
          "author": "coffeemahn",
          "text": "Books\n\nDesigning Data Intensive Applications,\nSoftware Architecture the hard parts\n\nEdit: added comma",
          "score": 43,
          "created_utc": "2026-02-01 06:06:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2xgqry",
              "author": "EviliestBuckle",
              "text": "Is there any practical application resources on these?",
              "score": 3,
              "created_utc": "2026-02-01 06:32:35",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o2y87dl",
              "author": "httpgo",
              "text": "/u/BookFinderBot",
              "score": 1,
              "created_utc": "2026-02-01 10:43:14",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2y8ato",
                  "author": "BookFinderBot",
                  "text": "**Designing Data Intensive Applications for Modern Systems Principles, Trade-Offs, and Architectures for Reliable and Scalable Data Platforms** by Zeon Aric\n\n\n>Designing modern data platforms is not about finding perfect solutions-it is about understanding trade-offs. Every architectural decision affects consistency, latency, fault tolerance, complexity, and compliance in ways that are rarely obvious at first glance. Designing Data-Intensive Applications for Modern Systems takes a system-level view of data architecture, guiding readers through the principles that underpin today's distributed databases, streaming platforms, and analytics systems. Building on core concepts, this volume examines how large-scale systems are structured, why they fail, and how they evolve over time.\n>\n>The book explores consistency models, distributed coordination, event-driven architectures, and data governance concerns such as privacy and regulatory compliance. Readers will gain the tools to evaluate architectural options, reason about failure modes, and design platforms that balance performance with operational simplicity. Aimed at senior engineers, technical leads, and system architects, this volume provides the architectural insight needed to design data-intensive systems that are resilient, scalable, and prepared for future growth.\n\n\n**Software Architecture: The Hard Parts** by Neal Ford, Mark Richards, Pramod Sadalage, Zhamak Dehghani\n\n\n>There are no easy decisions in software architecture. Instead, there are many hard parts--difficult problems or issues with no best practices--that force you to choose among various compromises. With this book, you'll learn how to think critically about the trade-offs involved with distributed architectures. Architecture veterans and practicing consultants Neal Ford, Mark Richards, Pramod Sadalage, and Zhamak Dehghani discuss strategies for choosing an appropriate architecture.\n>\n>By interweaving a story about a fictional group of technology professionals--the Sysops Squad--they examine everything from how to determine service granularity, manage workflows and orchestration, manage and decouple contracts, and manage distributed transactions to how to optimize operational characteristics, such as scalability, elasticity, and performance. By focusing on commonly asked questions, this book provides techniques to help you discover and weigh the trade-offs as you confront the issues you face as an architect. Analyze trade-offs and effectively document your decisions Make better decisions regarding service granularity Understand the complexities of breaking apart monolithic applications Manage and decouple contracts between services Handle data in a highly distributed architecture Learn patterns to manage workflow and transactions when breaking apart applications\n\n\n*I'm a bot, built by your friendly reddit developers at* /r/ProgrammingPals. *Reply to any comment with /u/BookFinderBot - I'll reply with book information. If I have made a mistake, accept my apology.*",
                  "score": 2,
                  "created_utc": "2026-02-01 10:44:07",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o2xezyq",
              "author": "EviliestBuckle",
              "text": "Okokokok.",
              "score": 1,
              "created_utc": "2026-02-01 06:17:57",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2xp8jl",
                  "author": "GMKrey",
                  "text": "Btw “Software Architecture: The Hard Parts” is actually a sequel. There’s a fundamentals book you should read first\n\nEdit: Since people are asking, this is the first book https://a.co/d/gyilGiK (Amazon)\n\nThe authors talk about how they basically tried to bucket architectural patterns by difficulty. Anything that they felt was too much for their first book got placed into a separate pile. Later making “The Hard Parts”. More detail on their rational are in the first bits of the sequel",
                  "score": 9,
                  "created_utc": "2026-02-01 07:47:58",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2xls2d",
          "author": "MatchLittle5000",
          "text": "I would advise these books:\n\n1. Clean Architecture.\n2. Designing Data Intensive Applications.\n3. Learning Domain Driven Design (good intro).\n4. And some book describing how to operate on Staff+ roles effectively.",
          "score": 12,
          "created_utc": "2026-02-01 07:16:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2ya6q7",
              "author": "MatchLittle5000",
              "text": "Plus these books which are a level higher:\n\n5. Building Microservices: Designing Fine Grained Systems\n\n6. Refactoring by Martin Fowler\n\n7. Patterns of Enterprise Application Architecture\n\n8. Implementing Domain Driven Design \n\n9. Test Driven Development by Example",
              "score": 9,
              "created_utc": "2026-02-01 11:01:03",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o2y4l6m",
              "author": "e__NV__y",
              "text": "Can you name some books for (4)",
              "score": 2,
              "created_utc": "2026-02-01 10:10:01",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2y5fhy",
                  "author": "MatchLittle5000",
                  "text": "This one: https://staffeng.com/book/",
                  "score": 2,
                  "created_utc": "2026-02-01 10:17:43",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o2y8k2t",
              "author": "httpgo",
              "text": "/u/BookFinderBot",
              "score": 1,
              "created_utc": "2026-02-01 10:46:27",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2y8ox9",
                  "author": "BookFinderBot",
                  "text": "**Clean Architecture A Craftsman's Guide to Software Structure and Design** by Robert C. Martin\n\n\n>Practical Software Architecture Solutions from the Legendary Robert C. Martin (“Uncle Bob”) By applying universal rules of software architecture, you can dramatically improve developer productivity throughout the life of any software system. Now, building upon the success of his best-selling books Clean Code and The Clean Coder, legendary software craftsman Robert C. Martin (“Uncle Bob”) reveals those rules and helps you apply them. Martin’s Clean Architecture doesn’t merely present options. Drawing on over a half-century of experience in software environments of every imaginable type, Martin tells you what choices to make and why they are critical to your success.\n>\n>As you’ve come to expect from Uncle Bob, this book is packed with direct, no-nonsense solutions for the real challenges you’ll face–the ones that will make or break your projects. Learn what software architects need to achieve–and core disciplines and practices for achieving it Master essential software design principles for addressing function, component separation, and data management See how programming paradigms impose discipline by restricting what developers can do Understand what’s critically important and what’s merely a “detail” Implement optimal, high-level structures for web, database, thick-client, console, and embedded applications Define appropriate boundaries and layers, and organize components and services See why designs and architectures go wrong, and how to prevent (or fix) these failures Clean Architecture is essential reading for every current or aspiring software architect, systems analyst, system designer, and software manager–and for every programmer who must execute someone else’s designs. Register your product for convenient access to downloads, updates, and/or corrections as they become available.\n\n\n**Designing Data Intensive Applications for Modern Systems Principles, Trade-Offs, and Architectures for Reliable and Scalable Data Platforms** by Zeon Aric\n\n\n>Designing modern data platforms is not about finding perfect solutions-it is about understanding trade-offs. Every architectural decision affects consistency, latency, fault tolerance, complexity, and compliance in ways that are rarely obvious at first glance. Designing Data-Intensive Applications for Modern Systems takes a system-level view of data architecture, guiding readers through the principles that underpin today's distributed databases, streaming platforms, and analytics systems. Building on core concepts, this volume examines how large-scale systems are structured, why they fail, and how they evolve over time.\n>\n>The book explores consistency models, distributed coordination, event-driven architectures, and data governance concerns such as privacy and regulatory compliance. Readers will gain the tools to evaluate architectural options, reason about failure modes, and design platforms that balance performance with operational simplicity. Aimed at senior engineers, technical leads, and system architects, this volume provides the architectural insight needed to design data-intensive systems that are resilient, scalable, and prepared for future growth.\n\n\n**Learning Domain-Driven Design Aligning Software Architecture and Business Strategy** by Vladik Khononov\n\n\n>Today, more than ever, building software is hard. Not only we have to chase ever-changing technological trends, but we also have to grasp business domains that we are building the software for. The latter is often overseen, and it explains why so many projects are doomed to fail. After all, how can you build a solution if you don't understand the problem?\n>\n>Through this book, you will learn the Domain-Driven Design (DDD) methodology which provides a set of core patterns, principles, and practices for analyzing business domains, understanding business strategy, and, most importantly, aligning software design with its business needs. These include Ubiquitous Language, Bounded Contexts, Event Storming, and others. You will see how these practices not only lead to robust implementation of business logic, but also to future-proof software design and architecture. You will also learn the relationship between DDD and other methodologies to ensure that you are able to make architectural decisions that will meet the business needs.\n>\n>The final section puts all of this into practice using a real life story of implementing Domain-Driven Design in a startup company. Reading the book will allow you to use DDD for analyzing business domains, aligning software and business strategies, and making socio-technical design decisions. By the end of this book, you will be able to:-Build a shared understanding of a business domain-Analyze a company's business domain and competitive strategy-Decompose a system into bounded contexts-Coordinate the work of multiple teams working together-Gradually start implementing domain-driven design\n\n\n*I'm a bot, built by your friendly reddit developers at* /r/ProgrammingPals. *Reply to any comment with /u/BookFinderBot - I'll reply with book information. If I have made a mistake, accept my apology.*",
                  "score": 2,
                  "created_utc": "2026-02-01 10:47:40",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2xj7it",
          "author": "HurricaneCecil",
          "text": "I focused on architecture during my SWE master’s, here’s how it was taught:\n\nbasics: read Just Enough Software Architecture by George Fairbanks and then discuss the 4 + 1 View Model of Software Architecture by Philippe Krutchen. It helps if you have a real-life project to look through and talk about.\n\nintermediate: read Fundamentals of Software Architecture by Mark Richards and Neal Ford and Patterns of Enterprise Application Architecture by Martin Fowler.\n\napplication: here we used Enterprise Integration Patterns as a guide and built a semester long project with source control and CI/CD. I thought “practicing” architecture with realistic tooling was super valuable\n\nadvanced: reading research papers on more specific and niche topics. ACM TOSEM and IEEE TSE are decent sources, Distributed Computing from Springer is cool if you want to get very specific and very technical.",
          "score": 9,
          "created_utc": "2026-02-01 06:53:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2y94n6",
              "author": "httpgo",
              "text": "/u/BookFinderBot",
              "score": 1,
              "created_utc": "2026-02-01 10:51:33",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2y96fr",
                  "author": "BookFinderBot",
                  "text": "**Just Enough Software Architecture A Risk-driven Approach** by George Fairbanks\n\n\n>This book teaches risk-driven architecting and describes a way to do just enough architecture. It avoids the one-size-fits all process tarp pit with advice on how to tune your design effort based on the risks you face. This book seeks to make architecture relevant to all software developers. Developers need to understand how to use constraints as guiderails that ensure desired outcomes.\n>\n>This book focuses on the technical parts of software development and what developers do to ensure the system works-not the job titles or processes. It shows you how to build models and analyze architectures so that you can make principled design tradeoffs. It describes the techniques software designers use to reason about medium to large sized problems and points out where you learn specialized techniques in more detail. The approach in this book embraces drill-down/pop-up behavior by describing models that have various levels of abstraction, from architecture to data structure design.\n\n\n**Fundamentals of Software Architecture An Engineering Approach** by Mark Richards, Neal Ford\n\n\n>Salary surveys worldwide regularly place software architect in the top 10 best jobs, yet no real guide exists to help developers become architects. Until now. This book provides the first comprehensive overview of software architecture’s many aspects. Aspiring and existing architects alike will examine architectural characteristics, architectural patterns, component determination, diagramming and presenting architecture, evolutionary architecture, and many other topics.\n>\n>Mark Richards and Neal Ford—hands-on practitioners who have taught software architecture classes professionally for years—focus on architecture principles that apply across all technology stacks. You’ll explore software architecture in a modern light, taking into account all the innovations of the past decade. This book examines: Architecture patterns: The technical basis for many architectural decisions Components: Identification, coupling, cohesion, partitioning, and granularity Soft skills: Effective team management, meetings, negotiation, presentations, and more Modernity: Engineering practices and operational approaches that have changed radically in the past few years Architecture as an engineering discipline: Repeatable results, metrics, and concrete valuations that add rigor to software architecture\n\n\n**Patterns of Enterprise Application Architecture** by Martin Fowler\n\n\n>Patterns of Enterprise Application Architecture By Martin Fowler\n\n\n**Enterprise Integration Patterns Designing, Building, and Deploying Messaging Solutions** by Gregor Hohpe, Bobby Woolf\n\n\n>Enterprise Integration Patterns provides an invaluable catalog of sixty-five patterns, with real-world solutions that demonstrate the formidable of messaging and help you to design effective messaging solutions for your enterprise. The authors also include examples covering a variety of different integration technologies, such as JMS, MSMQ, TIBCO ActiveEnterprise, Microsoft BizTalk, SOAP, and XSL. A case study describing a bond trading system illustrates the patterns in practice, and the book offers a look at emerging standards, as well as insights into what the future of enterprise integration might hold. This book provides a consistent vocabulary and visual notation framework to describe large-scale integration solutions across many technologies.\n>\n>It also explores in detail the advantages and limitations of asynchronous messaging architectures. The authors present practical advice on designing code that connects an application to a messaging system, and provide extensive information to help you determine when to send a message, how to route it to the proper destination, and how to monitor the health of a messaging system. If you want to know how to manage, monitor, and maintain a messaging system once it is in use, get this book.\n\n\n**Distributed Computing Fundamentals, Simulations, and Advanced Topics** by Hagit Attiya, Jennifer Welch\n\n\n>* Comprehensive introduction to the fundamental results in the mathematical foundations of distributed computing * Accompanied by supporting material, such as lecture notes and solutions for selected exercises * Each chapter ends with bibliographical notes and a set of exercises * Covers the fundamental models, issues and techniques, and features some of the more advanced topics\n\n\n*I'm a bot, built by your friendly reddit developers at* /r/ProgrammingPals. *Reply to any comment with /u/BookFinderBot - I'll reply with book information. If I have made a mistake, accept my apology.*",
                  "score": 3,
                  "created_utc": "2026-02-01 10:52:00",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2yecdu",
          "author": "IlliterateJedi",
          "text": "If you have a Python background, the single best book I think you'll find is [Architecture Patterns with Python](https://www.cosmicpython.com/book/preface.html).  The book is free, and it has the most beautiful git repository I've ever seen for a book.  Every chapter builds on the last chapter in how the architecture evolves, and they have a branch for each chapter so you can easily switch between branches to see how they changed the code and structure as the book goes along.  It made really examining the code a breeze.  I can't rave enough about this book.",
          "score": 3,
          "created_utc": "2026-02-01 11:37:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2z1ono",
              "author": "bobaduk",
              "text": "Also, if you read it and hate it, you can come here to the software architecture subreddit and argue with the authors!",
              "score": 2,
              "created_utc": "2026-02-01 14:18:59",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2zrylh",
          "author": "IshanSethi",
          "text": "I'd be honest, just reading books on architecture won't help you much... Once you know the concept, the main work is to apply it... You can try solving problems on www.designheist.com, they have good architecture problems ",
          "score": 5,
          "created_utc": "2026-02-01 16:29:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o30tpf2",
              "author": "EviliestBuckle",
              "text": "I was also thinking the same thing. Thanks for pointing it out",
              "score": 1,
              "created_utc": "2026-02-01 19:20:29",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2xexh0",
          "author": "Great_Pattern_1988",
          "text": "SEI offers a certificate in Software Architecture.  Three courses that contain an actionable process to creating and evaluating software architectures.  Best course I've ever taken.",
          "score": 3,
          "created_utc": "2026-02-01 06:17:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2xf2j6",
              "author": "EviliestBuckle",
              "text": "Can you plz share the respective link?",
              "score": 1,
              "created_utc": "2026-02-01 06:18:32",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2xfys2",
                  "author": "Great_Pattern_1988",
                  "text": "https://www.sei.cmu.edu/credentials/sei-software-architecture-professional-certificate/",
                  "score": 2,
                  "created_utc": "2026-02-01 06:25:59",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2xfbyw",
          "author": "sdsdkkk",
          "text": "I read the Architecture of Open Source Application book about 10 years ago to improve my architecture knowledge. But my primary focus at the time was to understand how influential real-life software projects were designed and architected.\nhttps://aosabook.org/en/",
          "score": 3,
          "created_utc": "2026-02-01 06:20:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2xg3yf",
              "author": "EviliestBuckle",
              "text": "Same motivation here. Actually here in subcontinent no one get to work on high impact software",
              "score": 1,
              "created_utc": "2026-02-01 06:27:11",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2z1hoe",
          "author": "bobaduk",
          "text": "My go-to guide for \"how to architect things\" is the practical programmer: https://leanpub.com/practical-software-architecture\n\nThere used to be a website with all that info, but it seems to have been subsumed into a book, but the material was great - high level enough not to be overwhelming, and rooted in practicality.\n\nIn terms of avoiding \"1 year repeated ten times\", my honest advice is to take jobs that scare the crap out of you, and spend as much time as you can in start ups.",
          "score": 3,
          "created_utc": "2026-02-01 14:17:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o37912o",
          "author": "SwampApes",
          "text": "Read Designing Data Intensive Applications. \n\nThere are a lot of papers discussing systems.   \nSome examples: Dynamo, Spanner, TAO, Cassandra, Lamport, Paxos, Raft, Borg. \n\nDon't bother with the other suggestions here if the author literally does nothing but write books / consulting.  Clean code / clean architecture, some of the books here written by ThoughtWorks employees are those. ",
          "score": 2,
          "created_utc": "2026-02-02 18:39:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2xoa1u",
          "author": "gbrennon",
          "text": "Books",
          "score": 1,
          "created_utc": "2026-02-01 07:39:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o32xeal",
          "author": "garathk",
          "text": "https://developertoarchitect.com/\n\nMark Richards has been mentioned a bunch. I actually took a live course by him about 8 years ago. Found it excellent. He referenced his website here. Lots of very practical bite sized resources.",
          "score": 1,
          "created_utc": "2026-02-02 01:52:53",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qrpvdc",
      "title": "Most people confuse \"Application Logic\" with \"Business Logic\" in MVC/MVVM. Here is my \"CLI Test\" to define a true Model.",
      "subreddit": "softwarearchitecture",
      "url": "https://www.reddit.com/r/softwarearchitecture/comments/1qrpvdc/most_people_confuse_application_logic_with/",
      "author": "FancyComfort435",
      "created_utc": "2026-01-31 02:25:43",
      "score": 62,
      "num_comments": 47,
      "upvote_ratio": 0.81,
      "text": "Too often, I see projects where the \"Model\" is treated just as a DTO (Data Transfer Object) for the database, and all the logic is shoved into the ViewModel or Controller. This leads to massive, unmaintainable \"God Classes.\"\n\nI believe the root cause is a misunderstanding of the Model's boundary.\n\n**My definition of a Model is simple:**\n\n>**The \"CLI Test\"** If I asked you to replace your GUI (React/WPF) with a CLI (Console App) tomorrow:\n\n1. Would your Model class work without modification? -> **Pass** (It's a true Model)\n2. Would it fail because of dependencies on UI libraries or notification logic? -> **Fail** (It's polluted)\n\nFor example, in a Calculator app, the `Calculator` class should hold the current state (accumulator, current operand) and calculation logic. If you put that state in the ViewModel, you are binding your core logic to the View.\n\nI wrote a short article diving deeper into this with diagrams and examples. I'd love to hear your thoughts on this definition.",
      "is_original_content": false,
      "link_flair_text": "Discussion/Advice",
      "permalink": "https://reddit.com/r/softwarearchitecture/comments/1qrpvdc/most_people_confuse_application_logic_with/",
      "domain": "self.softwarearchitecture",
      "is_self": true,
      "comments": [
        {
          "id": "o2qqrnt",
          "author": "Comfortable_Ask_102",
          "text": "That is one of the concepts Uncle Bob tried to communicate with his \"Clean\\* Architecture\" thing. Each Use Case is meant to be one *action* that can be done in the system, and all Use Cases must be independent of any UI or 3rd party, the sum of all Use Cases is *our* application.\n\nAt one project I literally used that as prefixes (like \\`AddOrderUseCase\\`), it's a decent name for a place that calls all the different upstream services, and has some custom, business-dependent logic or some sort of orchestration.\n\nThe dudes from Domain-Driven Design also give good ideas about how to Model a system.\n\nAnd yeah, 100%, a lot of people confuse \"Model\" with the \"ActiveRecord\" pattern, popularized by frameworks like Laravel, RoR and Django it's my guess.",
          "score": 26,
          "created_utc": "2026-01-31 05:25:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2qxw79",
              "author": "FancyComfort435",
              "text": "**Yes! You nailed it.**\n\nThe confusion absolutely comes from the \"Active Record\" pattern in frameworks like Laravel/Rails/Django. They taught a generation of devs that \"Model = A class that maps to a DB table.\"\n\nBut in true MVC (or Clean Architecture), the Model is the **layer** that handles business rules, not just a row in a database.\n\nI'm glad you brought up Uncle Bob. His \"Use Cases\" are exactly what I consider part of the \"Model\" in the broad sense—the code that must survive even if the UI disappears.\n\n**If you're interested, I uploaded a sample code (C#) on GitHub demonstrating this exact \"CLI vs GUI\" separation. It might be a bit rough, but it proves the point.**",
              "score": 5,
              "created_utc": "2026-01-31 06:22:13",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2rh9f8",
                  "author": "zdzisuaw",
                  "text": "Fancy sharing you github or article?",
                  "score": 4,
                  "created_utc": "2026-01-31 09:19:38",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o2rqat2",
                  "author": "FetaMight",
                  "text": "Al?",
                  "score": 5,
                  "created_utc": "2026-01-31 10:46:16",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o2sl5mi",
                  "author": "aefalcon",
                  "text": "Active Record is actually a Domain Model pattern though.  It's a domain model coupled with some data layer functions.  It does not violate MVC when used correctly, but often the app is either simple CRUD with no real business logic or the developer didn't understand the pattern and it turned into purely Data Model.",
                  "score": 1,
                  "created_utc": "2026-01-31 14:29:49",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o2v4mm0",
              "author": "hcboi232",
              "text": "DHH’s ruby on rails and its consequences",
              "score": 1,
              "created_utc": "2026-01-31 21:56:44",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o31xk8y",
                  "author": "Comfortable_Ask_102",
                  "text": "I mean, it is a good framework. Lots of people build stuff with it which comes with its downsides.\n\nIt's so popular that people believe it's THE way to make software. Similar to people who believe Java is THE way to make OOP.",
                  "score": 1,
                  "created_utc": "2026-02-01 22:34:29",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2r33fe",
          "author": "flavius-as",
          "text": "This has been as old as hexagonal architecture. Having a different driving adapter.",
          "score": 9,
          "created_utc": "2026-01-31 07:07:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2rk6jy",
              "author": "FancyComfort435",
              "text": "**Exactly. You get it.**\n\nIt is essentially the same concept as swapping a **Driving Adapter** in Hexagonal Architecture.\n\nI just framed it as a \"CLI Test\" for MVC because many developers find \"Hexagonal\" too academic or intimidating. But the core principle is identical: the UI is just a plugin.",
              "score": -2,
              "created_utc": "2026-01-31 09:48:02",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2rkbov",
                  "author": "flavius-as",
                  "text": "Hexagonal is neither academic nor complicated.\n\nThe official \"book\" on it is... a leaflet. It's that simple: dependency inversion applied architecturally.",
                  "score": 8,
                  "created_utc": "2026-01-31 09:49:24",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2qp8ma",
          "author": "aefalcon",
          "text": "Yep.  I've used \"test harness\" in a similar argument.",
          "score": 7,
          "created_utc": "2026-01-31 05:13:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2qq4wl",
              "author": "FancyComfort435",
              "text": "**Exactly! The \"CLI\" is basically just a primitive test harness.**\n\nIf your model can't run in a simple harness (like a console app or unit test) without dragging in the entire UI framework, it's not really a Model. I just use the \"CLI\" metaphor because it's easier to visualize for people who are stuck in the \"Model = DTO\" mindset.",
              "score": 1,
              "created_utc": "2026-01-31 05:20:25",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2qmn43",
          "author": "theBosworth",
          "text": "Damn, just straight up, uncurated AI slop.",
          "score": 13,
          "created_utc": "2026-01-31 04:54:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2qo51a",
              "author": "FancyComfort435",
              "text": "English is not my first language, so I used AI to translate and format my thoughts.\n\nActually, the initial AI output was too verbose, so I wrote the core draft from scratch and just used AI to handle the translation. If it still looks \"too clean\" or \"excessive\" to you, that might be a fair critique, and I can edit it down.\n\nBut I want to ask you: Does your comment mean you think the *content itself* lacks substance? Or do you just hate AI?\n\nThe \"CLI Test\" concept comes from my 15+ years of software architecture experience, not an LLM hallucination. If you have actual feedback on the architecture itself, I'm all ears.\n\nP.S. Yes, I used Gemini to write this reply too.",
              "score": 2,
              "created_utc": "2026-01-31 05:05:37",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2rqpk9",
                  "author": "FetaMight",
                  "text": "The CLI Test idea is fine. \n\n\nWhat trips me up is the sycophantic writing style typical with LLMs.  Real people don't talk that way so there's an uncanny valley effect happening when I read your comments. \n\n\nI don't think there's any harm in using AI to help you translate your thoughts, but maybe include that as a disclaimer?",
                  "score": 3,
                  "created_utc": "2026-01-31 10:50:03",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o2tfrrm",
                  "author": "no_onions_pls_ty",
                  "text": "Its slop because its just not true.  Not many developers in the wild are making this \"mistake\".  This concept is as decades old.  There is nothing of interest in this post, just standard programming concepts with some added marketing flair trying to communicate an issue having significant breadth.\n\nIt might be really novel for a freshman in college.  But no.  Its just slop.  \n\nIts like going to a car mechanic forum and telling all thr master mechanics that making sure the oil and wiper fluid don't get mixed up is somehow enlightening",
                  "score": 2,
                  "created_utc": "2026-01-31 17:02:38",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o2qv18b",
                  "author": "theBosworth",
                  "text": "It’s just literally copy-pasted straight out of the client you’re using without so much as formatting changes so it sticks out.\n\nI think seeing a hallucination in text which took the form of stating, in bold that a definition would be supplied, then skipping to test conditions outlining what should have been defined undermines the context you’re replying with. It seems like a reply from an AI, not a mere translation.\n\nI don’t even hate AI. You’ve just beat around the bush of a definition that I could agree with, but lacks substance at its core. The CLI test is a fundamental to this, but at a scalar level, this a trivial distinction due to other common classes’ responsibilities—request providers and handlers come to mind here. Your definition of a model is so loose that it includes the DAL.\n\nIt sounds more like you’ve seen a lot of messy student projects without day0 design discussions if you’re mentioning so-called “god classes”.",
                  "score": 3,
                  "created_utc": "2026-01-31 05:58:42",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o2r25ap",
              "author": "epegar",
              "text": "To me it looks good. \nI mean if you manage to identify it as Ai due to the content not being good enough, then I think it's fair. But if you see a rich format being used, then I think it's a good use of Ai.",
              "score": 0,
              "created_utc": "2026-01-31 06:58:58",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2q7s42",
          "author": "LoveThemMegaSeeds",
          "text": "Seems like a weird arbitrary way to define a model.",
          "score": 3,
          "created_utc": "2026-01-31 03:15:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2qpsfd",
              "author": "robhanz",
              "text": "\"Can this work with a different frontend\" is a pretty good and common way to handle that.  And a CLI is the easiest one to make.",
              "score": 13,
              "created_utc": "2026-01-31 05:17:49",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o2qel35",
              "author": "FancyComfort435",
              "text": "Interesting take. Why do you find it arbitrary?\n\nTo me, it's not arbitrary at all—it's a specific stress test for **\"Separation of Concerns.\"** The \"CLI\" is just a proxy for **\"Zero UI Dependency.\"**\n\nIf your business logic depends on a specific UI framework (like expecting a specific View structure), it becomes impossible to test in isolation or reuse. The CLI test is just the simplest way to prove your logic is decoupled from the presentation layer.\n\nIn my view, the Model represents the **\"Business Rules\"** that should exist regardless of whether the app is Web, Mobile, or CLI. If the Model fails to run on a CLI, it usually means it's polluted with UI logic (like routing, notifications, etc.).\n\n**How do you define a Model's boundary in your projects?** Do you prefer keeping logic in the ViewModel/Controller?",
              "score": 7,
              "created_utc": "2026-01-31 03:59:22",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o2qrli5",
              "author": "TheRealStepBot",
              "text": "Not as weird as making a stateful calculator",
              "score": -3,
              "created_utc": "2026-01-31 05:31:32",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2qxg2g",
                  "author": "FancyComfort435",
                  "text": "**I chose the \"Calculator\" example specifically because it is the simplest form of a State Machine.**\n\nA physical calculator is inherently stateful. It has registers, an accumulator, and pending operations. If the Model doesn't hold that state, the ViewModel has to. And that's exactly what I'm arguing against—leaking domain state into the presentation layer.\n\nDo you prefer managing `PendingOperation` or `Accumulator` in your ViewModels?",
                  "score": 2,
                  "created_utc": "2026-01-31 06:18:30",
                  "is_submitter": true,
                  "replies": []
                },
                {
                  "id": "o2u6aq2",
                  "author": "WhenSummerIsGone",
                  "text": "how do you calculate without state?",
                  "score": 1,
                  "created_utc": "2026-01-31 19:08:45",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2sctip",
          "author": "mexicocitibluez",
          "text": "This is called DDD.",
          "score": 1,
          "created_utc": "2026-01-31 13:41:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2twj31",
          "author": "Classic_Chemical_237",
          "text": "It’s not that deep. MVC is just super thin basic layer when you don’t want to over engineer. MVVM focuses on objects, VIPER focuses on responsibilities. A proper app with complicated logic should be able to run interactor, entity (model) and VM in CLI.\n\nBetter yet, use React Native. You will naturally separate business logic into a library which can be shared by both web and app with all the unit tests and integration tests. Apps will only have presentation logic",
          "score": 1,
          "created_utc": "2026-01-31 18:22:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2v5ews",
          "author": "hcboi232",
          "text": "why are we using MVC for the backend/usecases? The thick client is long gone and DHH thought it would be nice to butcher that term to be used for a service based architecture. I wouldn’t structure the frontend around Hexagonal because I would be ignoring different control structures relevant to the UI.",
          "score": 1,
          "created_utc": "2026-01-31 22:00:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2rtktr",
          "author": "BleLLL",
          "text": "vertical slice architecture has entered the chat",
          "score": 0,
          "created_utc": "2026-01-31 11:16:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2ru2z8",
              "author": "FancyComfort435",
              "text": "Vertical Slice Architecture has left the chat.",
              "score": 1,
              "created_utc": "2026-01-31 11:20:46",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qr44dn",
      "title": "How Replacing Developers With AI is Going Horribly Wrong",
      "subreddit": "softwarearchitecture",
      "url": "https://youtu.be/ts0nH_pSAdM?si=Kn2m9MqmWmdL6739",
      "author": "BlazorPlate",
      "created_utc": "2026-01-30 12:29:05",
      "score": 55,
      "num_comments": 4,
      "upvote_ratio": 0.93,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Article/Video",
      "permalink": "https://reddit.com/r/softwarearchitecture/comments/1qr44dn/how_replacing_developers_with_ai_is_going/",
      "domain": "youtu.be",
      "is_self": false,
      "comments": [
        {
          "id": "o2lkefu",
          "author": "commanderdgr8",
          "text": "I don't think this should be labeled as going horribly wrong - relying on a technology you don't understand fully and giving it free-hand was amatuerish and the company who gave ai free-hand suffered. but that gave us the learnings, ofcourse companies might be hiring developers again after doing mass layoff, but this time there would be more automation, not less. Kind of the second phase of full ai automation started.",
          "score": 4,
          "created_utc": "2026-01-30 13:25:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ngjld",
          "author": "Lord_Farkwad",
          "text": "This video is nonsense",
          "score": 2,
          "created_utc": "2026-01-30 18:42:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3coz7w",
          "author": "Constant_Physics8504",
          "text": "It’s actually going well at my job. We separated monolith legacy teams into product based teams, and used the existing codebase with SME input to train the AI. \n\nEven new devs now are cranking code out and testing it in a couple hours",
          "score": 1,
          "created_utc": "2026-02-03 15:06:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2mpw9m",
          "author": "[deleted]",
          "text": "[deleted]",
          "score": 0,
          "created_utc": "2026-01-30 16:44:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2nlca9",
              "author": "CthuluSurvivor",
              "text": "You aren’t making a distinction, but instead are attempting to reframe the context in a different light. Imagine you have 3 developers all doing the same job. The company starts using LLM coding assistants and the workload of these 3 developers is now replaced by 1 developer + 1 coding agent. Two developers are fired and one remains. The one did not simply get more efficient. Instead, the role of that one developer shifted to a developer + code agent role instead of simply a developer role. At least two developers have been replaced by this new role. One developer was laterally shifted into a role that now includes the coding agent. Someone could say that three developer roles were, in fact, replaced - as the old roles no longer exist due to the new. \n\nWhile 3 developer roles were replaced, only 2 developers were fired. The distinction in this case is between developer roles and developers. Either way, with roles or people, the job of two people were taken on by one + coding agent and this is leading to higher tech debt.",
              "score": 1,
              "created_utc": "2026-01-30 19:02:59",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qr6byf",
      "title": "Configuration behaves like code at runtime — but we don’t design it like code. Why?",
      "subreddit": "softwarearchitecture",
      "url": "https://www.reddit.com/r/softwarearchitecture/comments/1qr6byf/configuration_behaves_like_code_at_runtime_but_we/",
      "author": "FreePipe4239",
      "created_utc": "2026-01-30 14:04:30",
      "score": 22,
      "num_comments": 23,
      "upvote_ratio": 0.87,
      "text": "In most modern systems, configuration is:\n- parsed\n- validated (sometimes)\n- interpreted\n- and directly affects runtime behavior\n\nYet compared to application code, config usually has:\n- weaker type guarantees\n- fewer correctness checks\n- limited tooling\n- poor failure visibility\n\nThis seems to be a recurring root cause in incident postmortems.\n\nFrom a software architecture perspective:\nWhy do we still treat configuration as second-class compared to code?\nIs this a tooling gap, a design tradeoff, or something else?\n",
      "is_original_content": false,
      "link_flair_text": "Discussion/Advice",
      "permalink": "https://reddit.com/r/softwarearchitecture/comments/1qr6byf/configuration_behaves_like_code_at_runtime_but_we/",
      "domain": "self.softwarearchitecture",
      "is_self": true,
      "comments": [
        {
          "id": "o2lv7y3",
          "author": "PabloZissou",
          "text": "Serious applications would validate the validity of its config and exit if that validation fails. I don't think this is a general problem but project specific.",
          "score": 13,
          "created_utc": "2026-01-30 14:22:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2mgws5",
              "author": "Jedkea",
              "text": "Exiting does not solve the problem though in and of itself. If you rollout a change to a bunch of clusters and they all fail to start, well now the whole thing is down.\n\nAlso the config might be valid in one place, but invalid in another. Things like incorrect network addresses are an example.",
              "score": 3,
              "created_utc": "2026-01-30 16:04:20",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2naxsq",
                  "author": "Pto2",
                  "text": "Rollback then? Code could also fail.",
                  "score": 3,
                  "created_utc": "2026-01-30 18:17:41",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o31ucxp",
                  "author": "ncmentis",
                  "text": "You need canary deploys. Exiting plus staged rollouts allows you to abort before a significant chunk of resources are devoted to a failing service. And you can then rollback.",
                  "score": 1,
                  "created_utc": "2026-02-01 22:18:18",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o2rphbr",
              "author": "ryan_the_dev",
              "text": "Every single application I work on, this is a requirement. Configuration is validated on startup and application fails if invalid.",
              "score": 2,
              "created_utc": "2026-01-31 10:38:39",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2wrwtk",
                  "author": "hxtk3",
                  "text": "Yes but there's a valid point that if you update a config map, every pod sees the changes more or less instantly (although they probably don't act on the changes until the process restarts), which is very different from how you'd roll out a code change (update the container image target, which would trigger a rolling replacement of the deployment with the new image).\n\nConfiguration changes are (often by design, as a feature) synchronized replacements of resources rather than gradual rollouts. Most of the big tech outages from the 2010s that you heard about if you don't work at the company that had them are caused by bad configuration updates, and we're not categorically done with them; one of Cloudflare's big outages last year was identified as an argument for them to universally implement gradual configuration rollouts because that would have averted it.",
                  "score": 2,
                  "created_utc": "2026-02-01 03:34:04",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o2o44hx",
              "author": "gaelfr38",
              "text": "Same feeling here. This doesn't sound like a general problem to me at all.",
              "score": 1,
              "created_utc": "2026-01-30 20:29:45",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2lskv2",
          "author": "FreePipe4239",
          "text": "One thing I keep noticing is that config often gets validated only syntactically,\nnot semantically — the system accepts it, but behaves very differently than intended.\n\nCurious if people here have seen languages, frameworks, or tooling\nthat actually close this gap effectively.",
          "score": 5,
          "created_utc": "2026-01-30 14:09:10",
          "is_submitter": true,
          "replies": [
            {
              "id": "o2ltbt1",
              "author": "flavius-as",
              "text": "Of course, I've seen this compiled and validated semantically, it's called a programming language.\n\nInstead of writing it in yaml or whatever other error prone semi-formal language, write it in a strongly typed language.",
              "score": 4,
              "created_utc": "2026-01-30 14:12:58",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2ol7ft",
          "author": "DoubleAway6573",
          "text": "https://mikehadlow.blogspot.com/2012/05/configuration-complexity-clock.html\n\n\nYou remind me this. You are like 4 or 5 o clock.",
          "score": 2,
          "created_utc": "2026-01-30 21:50:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2lwono",
          "author": "systemic-engineer",
          "text": "I always really, really liked dhall.  \nAnd never had the opportunity to use it in anger.\n\nhttps://dhall-lang.org/",
          "score": 3,
          "created_utc": "2026-01-30 14:29:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2m1yo6",
          "author": "ewoolly271",
          "text": "Great question. At multiple jobs, I’ve been told the business users need to have direct control over the application. But then, we get a ton of problems because they don’t fully understand how the config changes interact with the application. \n\nSo you have to trust the business users to communicate their changes, test them, time them with releases, etc\n\nHow is that any better than, say, working with them to update a YML or JSON file with CI/CD? It’s not. Doesn’t save any time or energy. It’s just engineering leaders being too weak to tell the business leaders it’s a bad idea",
          "score": 1,
          "created_utc": "2026-01-30 14:55:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2meunm",
          "author": "violentlymickey",
          "text": "One consideration is that config can be changed easily whereas code may need to be redeployed or rebuilt. I think you should always reasonably validate your config though, and many libraries exist to do that.",
          "score": 1,
          "created_utc": "2026-01-30 15:55:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2mxy0k",
          "author": "Physical-Compote4594",
          "text": "One of the (many) awesome things about Lisp is that configuration files are just code, because in Lisp code and data have the same representation.\n\nYou often write Lisp macros to define a DSL for configurations, and that's where you add type guarantees and correctness checks, which can be done with the full power of the language.",
          "score": 1,
          "created_utc": "2026-01-30 17:20:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2o47vh",
          "author": "supercargo",
          "text": "Configuration is a double edged sword.  It increases (runtime) flexibility at the expense of complexity. I don’t think there is any special reason why it doesn’t get treated more rigorously, just the usual: not enough time, not a priority.  Like most tech debt, it’s either strategically appropriate or the risks weren’t understood.\n\nEngineering effort spent on config validators has always been worthwhile in my experience.  If your post mortem root cause is a bad config, the correct next question to ask is “what can we do to reject this config earlier in the process”. Do this a few times and some patterns and best practices should emerge that you can use proactively. Clear error messages are also critical, don’t just reject a config, indicate what is wrong, why it’s wrong, and where in the file.",
          "score": 1,
          "created_utc": "2026-01-30 20:30:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2y4008",
          "author": "FreePipe4239",
          "text": "What I’m taking away from this thread is that the issue isn’t\n\n“config vs code”, but that config changes have very different\n\nrollout semantics and blast radius than code changes.\n\n\n\nEven with validation, the difficulty seems to be:\n\n\\- understanding the \\*effect\\* of a config change\n\n\\- across environments\n\n\\- before it’s applied everywhere\n\n\n\nThat gap feels under-tooled today.",
          "score": 1,
          "created_utc": "2026-02-01 10:04:43",
          "is_submitter": true,
          "replies": []
        },
        {
          "id": "o2lwbbi",
          "author": "ukaeh",
          "text": "I’d say look into protobufs for type guarantees and checks/tooling etc. As a good starting point.\n\nAnother aspect is indeed a lack of design - configs get (re)used across layers/stack likely when they mean different things semantically and that is 100% a trade off for simplicity whether or not that’s intentional. For example, configuration (and/or parts of) should never be in limbo but often systems end up with things like ‘oh these fields aren’t setup yet’ which is mostly a design issue.",
          "score": 1,
          "created_utc": "2026-01-30 14:28:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2lwrnq",
          "author": "Isogash",
          "text": "It really depends on how you view config.\n\nIf you view the system as a whole and are only concerned with delivery of a specific business behaviour e.g. in a bespoke enterprise system, then \"config\" is just another part of delivering that behaviour, and so its distinction from code is not that clear.\n\nInstead, if you view the system as being something configurable, and the config as specific to a particular deployment or use case e.g. for different environments, products or users, then the distinction is quite clear: your system should accept all valid combinations of configuration, and whether or not the config is correct for the end user is something *they* should be testing.\n\nEither way, I don't disagree that file-driven config could benefit from some of the features of programming languages, and that users should have tests that their configuration is correct for their intended use case.",
          "score": 1,
          "created_utc": "2026-01-30 14:30:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2lvb56",
          "author": "jhartikainen",
          "text": "There's lots of places which handle configs as code. JS/TS projects is one, but I guess those don't really give you a lot of guarantees about anything. I vaguely recall seeing some Haskell projects using regular Haskell code as configs as well, where you can get fairly strong guarantees of the correctness.\n\nI guess the biggest issue is that configs usually are intended to be something you can modify without needing to recompile the whole project. Making them code often kinda gets in the way of that.",
          "score": 1,
          "created_utc": "2026-01-30 14:23:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2m3ciu",
          "author": "Adorable-Fault-5116",
          "text": "This is because XML was seen as uncool, and JSON / YAML took off as configuration because how nice it was for a developer to read was prioritised over correctness.\n\nThese days I think the way to solve this, since we aren't going back, is to just make configuration code. Then you can a) not annoy developers will scary ugly text, b) have strong typing etc.",
          "score": 1,
          "created_utc": "2026-01-30 15:02:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2rkzjh",
              "author": "One_Elephant_8917",
              "text": "Exactly xml had schema that validates it, compared to json",
              "score": 1,
              "created_utc": "2026-01-31 09:55:46",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2q6qft",
          "author": "klimaheizung",
          "text": "We do. Just use the right programming language, that's all there is to it.",
          "score": 0,
          "created_utc": "2026-01-31 03:09:31",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qp2ifs",
      "title": "How do you automate your architecture inner loop?",
      "subreddit": "softwarearchitecture",
      "url": "https://www.reddit.com/r/softwarearchitecture/comments/1qp2ifs/how_do_you_automate_your_architecture_inner_loop/",
      "author": "vmgolubev",
      "created_utc": "2026-01-28 05:23:50",
      "score": 20,
      "num_comments": 12,
      "upvote_ratio": 0.95,
      "text": "Hi!\nRecently I realized that my current approach with ADRs and diagrams in drawio sucks:)\nDrawio is great at the beginning, but after some time it becomes hard to manage with updates in all of the c4 diagrams that was created.\nI want to have the same experience as developer - think, write, commit! Any advice on tools that might help me? ",
      "is_original_content": false,
      "link_flair_text": "Discussion/Advice",
      "permalink": "https://reddit.com/r/softwarearchitecture/comments/1qp2ifs/how_do_you_automate_your_architecture_inner_loop/",
      "domain": "self.softwarearchitecture",
      "is_self": true,
      "comments": [
        {
          "id": "o27jxge",
          "author": "ch1pch4p",
          "text": "Without you defining what truly is \"inner loop architecture\", I'll assume you mean \"you architechting on your own, regardless if it's been shared or not.\" \n\nYou can take a crack at mermaid/puml. Text based diagramming. What you lose (or just becomes a bit hard) on the placement of the diagram you gain in text based work: proper source control, quick interations, etc.\n\nMermaid is also rendered in github so that's helpful for devs, not quite for business. You could make a github action, though, to bundle and export your diagrams to pdf or use your doc repo (I'm thinking Confluence) API to update pages. I know draw io can take in mermaid docs as import, so you may need to get creative on how the rubber meets the road on that one.\n\nI use dendron for all my notes. Dead repo now, but still useful in current form. Use schemas to organize your thoughts, and use the lookup to find what you were working on faster.\n\nI'm a text based guy at heart - I figure if I can describe what I know, well, in words, pictures can augment the information.\n\nI say all this, typing on my phone, with highly questionable grammar haha",
          "score": 3,
          "created_utc": "2026-01-28 13:21:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2argg6",
              "author": "HandsOnArch",
              "text": "Architecture as Code (Structurizr etc) gives you a dev-like workflow, but you’ll still need draw.io for many stakeholders.\nPersonally, I find the update effort in draw.io negligible, since architecture changes are usually rare and very deliberate.",
              "score": 2,
              "created_utc": "2026-01-28 22:02:25",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o27tvae",
              "author": "never-starting-over",
              "text": "Seconded on mermaid.\n\nThey even have a (kinda janky) visual editor at https://mermaid.live/play\n\nI also use LLMs to help mr write documentation and I think diagrams as text really help them understand what I'm conveying.\n\nWith that said, I wanted so hard for PlantUML to work, but the extra setup required and no native integration with GitHub just makes it a shoehorn choice for the kind of businesses I work with. How I wish it were as batteries included and supported as mermaid is on GitHub and Notion.",
              "score": 1,
              "created_utc": "2026-01-28 14:14:27",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2cvnzo",
                  "author": "[deleted]",
                  "text": "[removed]",
                  "score": 1,
                  "created_utc": "2026-01-29 04:57:21",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o27wa48",
                  "author": "ch1pch4p",
                  "text": "LLM are a force multiplier, for sure. \n\nI'd recommend using a local plug-in in vscode. I hate dumping ideas into the internet... You lose control of them.\n\nFor puml, try the jetty server with docker. It really is a breeze to set up if you haven't tried. But.. Yea no github rendering, so if that's your jam, then skip it.",
                  "score": -1,
                  "created_utc": "2026-01-28 14:26:42",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o28ji2h",
          "author": "SolarNachoes",
          "text": "Likec4 (use AI to spin up a vite app)\n\nD4\n\nMermaid\n\nPlantUML\n\nI use AI now exclusively to edit said documents. Either from scratch or from an exiting app.",
          "score": 0,
          "created_utc": "2026-01-28 16:13:30",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qqsg3o",
      "title": "Feeling pigeonholed as an “Integration Engineer”, how to reposition into real engineering roles without starting from scratch?",
      "subreddit": "softwarearchitecture",
      "url": "https://www.reddit.com/r/softwarearchitecture/comments/1qqsg3o/feeling_pigeonholed_as_an_integration_engineer/",
      "author": "BinariesGoalls",
      "created_utc": "2026-01-30 02:07:05",
      "score": 13,
      "num_comments": 9,
      "upvote_ratio": 1.0,
      "text": "Hey folks,\n\nI could really use some perspective from more experienced people here.\n\nI’m a professional with \\~5 years of experience in tech, the last 3 working as a Data/Systems Integration Specialist at a SaaS company.\n\nMy job on this company is basically to onboard new customers by integrating their data, from ERPs, databases, APIs, and third-party systems, into our platform.  Basically a post-sale software delivery developer job. This involves reading API docs, handling authentication, data mapping, validation, troubleshooting failed requests, supporting integrations running in production, etc.\n\nSo I work with REST APIs, Postman, SQL, JSON/XML, webhooks, error handling, etc. on a daily basis.\n\nThe problem is: lately I’ve startied to feel heavily pigeonholed as “the integration guy”.\n\nI don’t build applications from scratch.  \nI don’t build systems end-to-end.  \nI don’t design architectures.  \nI don’t write large codebases.\n\nAnd when I look at the market, especially internationally (I'm from Brazil), I see two very different paths:\n\n* SWE / Backend / Fullstack → clear growth ladder\n* Integration / Implementation → often seen as operational, repetitive, and not “real engineering”\n\nBut at the same time, I’ve seen many roles like Solutions Engineer that look very aligned with what I do, but at a much deeper technical/architectural level.\n\nI realized my issue might not be the career itself, but the level at which I’m operating.\n\nIt feels like I entered the right field through the wrong door.\n\nInstead of evolving into someone who understands systems, architecture, APIs deeply and can design integrations, I just became good at executing systems integrations.\n\nIt took a couple of years, but now I’m trying to correct that.\n\nI think my current goal is not to switch to full backend/SWE roles and \"restart\" my career. I want to evolve into a stronger Integration / Solutions / Systems Engineer, the kind that is valued in the market.\n\nSo, for those of you who have seen or worked with this type of role:\n\n* What should I study to move from “integration executor” to “solutions engineer”?\n* What technical gaps usually separate these profiles?\n* What kind of projects or knowledge would reposition me correctly?\n* Is this a viable path, or is it truly a career dead-end?\n\nI’d really appreciate guidance from people who’ve seen this from the inside.\n\nThanks a lot.",
      "is_original_content": false,
      "link_flair_text": "Discussion/Advice",
      "permalink": "https://reddit.com/r/softwarearchitecture/comments/1qqsg3o/feeling_pigeonholed_as_an_integration_engineer/",
      "domain": "self.softwarearchitecture",
      "is_self": true,
      "comments": [
        {
          "id": "o2j10l6",
          "author": "systemic-engineer",
          "text": "Give me a rundown of a typical day right now. \n\nThen give me a rundown of what you imagine your day would look like, if you were to switch. \n\nWhat's the delta?  \nWhich changes would you expect?  \nWhere do you see growth potential?  \n\n\nSoftware engineers are ambiguity resolvers.  \nWe solve human problems through technology.  \n(And if we're not careful we add problems.)\n\nHow do you solve problems right now?  \nHow do you wish you'd solve them?",
          "score": 3,
          "created_utc": "2026-01-30 02:17:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2j8mjb",
              "author": "FearlessAmbition9548",
              "text": "What’s a rundown",
              "score": 2,
              "created_utc": "2026-01-30 02:59:26",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o2jbxw3",
              "author": "BinariesGoalls",
              "text": "A typical day for me today is very post-sale and demand-driven.\n\nI work for a company that provides an AI-based platform of inventory optimization for retailers , and I’m the person responsible for all customer data integrations for my country.\n\nWhenever a new customer comes in, I run technical discovery meetings with them to understand how their data is structured, ERPs, APIs, databases, file exports, whatever they use.\n\nOn our side, we already have a defined data blueprint, a very specific data requirement model that our system expects. My job is basically to design and build a simple pipeline that extracts the customer’s data and transforms it into that required format so our platform can consume it.\n\nSo most of my work is about:\n\n- Reading and understanding ERP/API documentation.\n\n- Figuring out where each required data point lives in the customer system.\n\n- Handling authentication, endpoints, formats.\n\n- Building data pipelines that extract, transform and load the data.\n\n- Aligning business rules with the client for each data type.\n\n-Troubleshooting production issues and handling integration tickets.\n\nI don’t work on the core product design. I don’t design APIs. I don’t build systems end-to-end.\n\nI work almost exclusively on the ingestion side, moving and shaping data so it fits into an existing system.\n\nWhat I’m looking for next is the opportunity to work on a wider variety of problems, architectures and platforms instead of repeatedly solving the same integration pattern around a single product.\n\nToday, my work is constrained by the fact that every solution must ultimately fit into one predefined system. \n\nThat means most of my effort goes into adapting external systems to match our platform’s requirements.\n\nWhat I want is to design integrations and solutions end-to-end, with more flexibility to evaluate the customer’s scenario and define the best technical approach for that context.\n\nInstead of always asking “how do I make this system fit ours?”, I want to be able to ask “what is the best way to connect these systems together?”\n\nI’m very motivated by the challenge of working with different architectures, different stacks, and different integration strategies depending on the problem, APIs, databases, data pipelines, middleware, cloud services, or whatever makes the most sense technically.\n\nRight now, I specialize in making one platform work with many different customer environments.\n\nI want to evolve into a role where I use that same experience to design solutions across many platforms and scenarios.\n\nThat’s where I see the growth potential.",
              "score": 2,
              "created_utc": "2026-01-30 03:18:18",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2lba6d",
                  "author": "systemic-engineer",
                  "text": "Thank you for taking the time.  \n\nI read that you want to work more end2end.  \nAnd that you're still interested in connecting systems. \n\nI'm intrigued.  \nAnd busy. \n\nI'll write a longer response later. 🌈",
                  "score": 1,
                  "created_utc": "2026-01-30 12:30:31",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2j251b",
          "author": "macromind",
          "text": "This is a super common spot to be in, and its not a dead end if you move up the abstraction level.\n\nThe solutions/architecture jump usually means: drawing the system boundaries, defining contracts, handling non-functional requirements (latency, failure modes, security), and making tradeoffs explicit.\n\nIf you want to study topics that map directly: distributed systems basics, API design, event-driven architecture, and practical integration patterns (outbox, saga, idempotency keys).\n\nSmall suggestion too: write 1 short architecture note per week about something you handled at work, even anonymized. Its surprisingly powerful for interviews. If youre batching content, something like https://www.promarkia.com/ can help you schedule it and keep momentum.",
          "score": 3,
          "created_utc": "2026-01-30 02:23:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2rqizp",
          "author": "OptionalEmotion",
          "text": "You are in a better spot compared to a traditional software engineer. I started in development only to move to devops and later into cloud solutions engineering. Higher level roles such as tech lead or architect requires what you already do day to day. You can switch to a tech lead role for a smaller company data team and execute the delivery of one team while helping them develop the solution inside the system boundary you defined. You can take over the integration of that team's solution into the rest of the business, which is literally what the job of a tech lead is.",
          "score": 2,
          "created_utc": "2026-01-31 10:48:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2jdg8n",
          "author": "Charming-Raspberry77",
          "text": "It is not a dead end, but you are not on the path to being a software engineer. This article sums it up real well and offers advice: https://www.noidea.dog/glue",
          "score": 1,
          "created_utc": "2026-01-30 03:26:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2jmzw8",
          "author": "macromind",
          "text": "Architecturally, you are already close, you just need to shift from task execution to designing the patterns. Learn and apply a few core concepts: canonical data model vs point to point mappings, versioning strategy, idempotency keys, replayability, and explicit contracts (OpenAPI, AsyncAPI). Also get comfortable with documenting tradeoffs and constraints, that is basically the job. If you can lead a discovery call, propose 2 options, and explain the risks in plain language, you are in solutions territory. And if you are writing those learnings up, batching and scheduling them makes it sustainable, https://www.promarkia.com/ can help with that.",
          "score": 1,
          "created_utc": "2026-01-30 04:24:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2wtp8n",
          "author": "engiNARF",
          "text": "I'm an electrical engineer but I was in a similar spot early in my career. I found myself in an IT support job I was \"meh\" about but wanted to do \"real engineering\".  What I did was to slowly take roles that leveraged my current experience but had more and more overlap with circuit design. It took a while but along the way I was always able to ask for a higher salary (because I always had relevant experience) and I got to see different aspects of engineering.   \n  \nI actually found that while design work is rewarding in its own way, the role has a different vibe from customer facing roles. I personally find that in customer facing roles I get to solve technically challenging issues but don't have to deal with as much office politics. Often I find more of a teamwork mindset among coworkers (even the Sales guys) when in a Support role. Obviously it depends on the company but I've seen similar dynamics at my past 2 employers. \n\nNow my job has a mix of design work and customer support which I'm pretty pleased with. Hope you find what you're looking for!",
          "score": 1,
          "created_utc": "2026-02-01 03:45:28",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qq3mvo",
      "title": "Resiliency in System Design: What It Actually Means",
      "subreddit": "softwarearchitecture",
      "url": "https://lukasniessen.medium.com/resiliency-in-system-design-what-it-actually-means-2bc72713ebf5",
      "author": "trolleid",
      "created_utc": "2026-01-29 09:03:47",
      "score": 11,
      "num_comments": 1,
      "upvote_ratio": 0.87,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Article/Video",
      "permalink": "https://reddit.com/r/softwarearchitecture/comments/1qq3mvo/resiliency_in_system_design_what_it_actually_means/",
      "domain": "lukasniessen.medium.com",
      "is_self": false,
      "comments": [
        {
          "id": "o2io5mb",
          "author": "shufflepoint",
          "text": "What it means for me is that the chaos monkey can do me no harm.",
          "score": 1,
          "created_utc": "2026-01-30 01:05:32",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qrfrmp",
      "title": "What architecture as code tools you are using, besides AI?",
      "subreddit": "softwarearchitecture",
      "url": "https://www.reddit.com/r/softwarearchitecture/comments/1qrfrmp/what_architecture_as_code_tools_you_are_using/",
      "author": "vmgolubev",
      "created_utc": "2026-01-30 19:42:38",
      "score": 11,
      "num_comments": 7,
      "upvote_ratio": 0.87,
      "text": "How do you understand AaC approach? Should you get all artifacts automatically or just some?\nSpecifics:\nDiagrams as code - but which one? Structurizr, D2 or anything else?\nAny docs gen software, that will generate your artifacts automatically?\n\n",
      "is_original_content": false,
      "link_flair_text": "Discussion/Advice",
      "permalink": "https://reddit.com/r/softwarearchitecture/comments/1qrfrmp/what_architecture_as_code_tools_you_are_using/",
      "domain": "self.softwarearchitecture",
      "is_self": true,
      "comments": [
        {
          "id": "o2qabtw",
          "author": "avinds",
          "text": "likec4",
          "score": 2,
          "created_utc": "2026-01-31 03:32:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2o08nt",
          "author": "themessymiddle",
          "text": "I’ve been working on arch docs that auto-update, are accessible via MCP, and are beautiful to navigate: https://gjalla.io if you want to take a look! I struggled with some other tools that didn’t auto-update, and even docs generated by Claude Code were too high level. So far the gjalla generated arch artifacts reduce token use, turns, and time of the agents working on code, and I always know the docs I’m looking at are up to date",
          "score": 2,
          "created_utc": "2026-01-30 20:11:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2r1u7z",
              "author": "chipstastegood",
              "text": "your site is slow to load for me on mobile and doesn’t explain what the product actually does",
              "score": 2,
              "created_utc": "2026-01-31 06:56:11",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2r63so",
                  "author": "themessymiddle",
                  "text": "Thanks for the feedback, live architecture docs and enforcement of architecture rules",
                  "score": 1,
                  "created_utc": "2026-01-31 07:34:54",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2rqw6o",
          "author": "bills2go",
          "text": "Can you try [revibe.codes](https://www.revibe.codes)? I'm building it. It generates architecture and other flow diagrams in mermaid format, from the codebase.",
          "score": 1,
          "created_utc": "2026-01-31 10:51:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2xg7rz",
          "author": "MatchLittle5000",
          "text": "I recently built a related tool called pacta: https://github.com/pacta-dev/pacta-cli\n\nIt helps you to treat architecture as an artifact instead of multiple diagrams stored in confluence that are slowly becoming outdated. \n\nYou describe architecture in special file, add rules, and validate the current code. But the main feature is the ability to keep a history of architecture evolution and observe different trends throughout the time. For example, you can get charts catching a change of the dependency number or coupling in your system and understand when and why the drift occurred. There is also a GitHub action, adding a summary of the architecture change for each PR.\n\nI will add support for diagrams in the future too.",
          "score": 1,
          "created_utc": "2026-02-01 06:28:04",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qqxln7",
      "title": "How do IDEs like Cursor / Antigravity implement diff based code editing with accept/reject option while modifying existing code",
      "subreddit": "softwarearchitecture",
      "url": "https://www.reddit.com/r/softwarearchitecture/comments/1qqxln7/how_do_ides_like_cursor_antigravity_implement/",
      "author": "CapableAd9320",
      "created_utc": "2026-01-30 06:15:03",
      "score": 9,
      "num_comments": 8,
      "upvote_ratio": 0.81,
      "text": "when modifying a exiting code using these tools, instead of rewriting the whole file, the tool proposes changes inline , shows a diff, and lets you **accept/reject** the change (sometimes even per hunk). it feels very similar to `git add -p`.\n\nFrom what I can tell, the rough flow is:\n\n* take the original code\n* LLM generate a modified version\n* compute a diff/patch\n* preview it\n* apply or discard based on user input\n\nI’m interested in implementing this myself (probably as a CLI tool first, not an IDE), and I’m wondering:\n\n* Is this pattern formally called something?\n* how exactly is the modified code/diffs added into the source code\n* how is the accept/reject functionality implemented\n* Are there good open-source tools or libraries that already implement this workflow?\n* How do i go about implementing this",
      "is_original_content": false,
      "link_flair_text": "Discussion/Advice",
      "permalink": "https://reddit.com/r/softwarearchitecture/comments/1qqxln7/how_do_ides_like_cursor_antigravity_implement/",
      "domain": "self.softwarearchitecture",
      "is_self": true,
      "comments": [
        {
          "id": "o2kq4uv",
          "author": "Isogash",
          "text": "Isn't it just using git?",
          "score": 3,
          "created_utc": "2026-01-30 09:38:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2yvd82",
              "author": "CapableAd9320",
              "text": "Do you by any chance have any resources for how git is used for this?",
              "score": 1,
              "created_utc": "2026-02-01 13:42:00",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2z0pay",
                  "author": "Isogash",
                  "text": "No, I'm just guessing because it's the way I'd do it",
                  "score": 1,
                  "created_utc": "2026-02-01 14:13:28",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o2kt98n",
              "author": "ProfessionNo3952",
              "text": "I guess not all time because git diff cannot show difference between each round of code generation if you don’t commit anything",
              "score": -1,
              "created_utc": "2026-01-30 10:07:13",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2ktkc8",
                  "author": "Isogash",
                  "text": "Sure you can, it can commit these to a special branch or stash them, I'm not saying that it has to commit them to your main branch.",
                  "score": 2,
                  "created_utc": "2026-01-30 10:09:57",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qrchw8",
      "title": "The hidden costs of additions to a system",
      "subreddit": "softwarearchitecture",
      "url": "https://leomax.fyi/blog/the-hidden-costs-of-additions-to-a-system/",
      "author": "Particular-Dog7256",
      "created_utc": "2026-01-30 17:48:38",
      "score": 7,
      "num_comments": 0,
      "upvote_ratio": 1.0,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Article/Video",
      "permalink": "https://reddit.com/r/softwarearchitecture/comments/1qrchw8/the_hidden_costs_of_additions_to_a_system/",
      "domain": "leomax.fyi",
      "is_self": false,
      "comments": []
    },
    {
      "id": "1qu4aaf",
      "title": "Why does enterprise architecture assume everything will live forever?",
      "subreddit": "softwarearchitecture",
      "url": "https://www.reddit.com/r/softwarearchitecture/comments/1qu4aaf/why_does_enterprise_architecture_assume/",
      "author": "eurz",
      "created_utc": "2026-02-02 19:05:15",
      "score": 7,
      "num_comments": 21,
      "upvote_ratio": 0.6,
      "text": "Hi everyone!\n\nWorking in a large org right now and everything is designed like it’ll still be running in 2045. Layers on layers, endless review boards, “strategic” platforms no team can change without six approvals. Meanwhile, half the systems get sunset quietly or replaced by the next reorg. I get the need for stability, but it feels like we optimize for theoretical longevity more than actual delivery.\n\nFor people who like enterprise architecture - what problem is it really solving well, and where does it usually go wrong?",
      "is_original_content": false,
      "link_flair_text": "Discussion/Advice",
      "permalink": "https://reddit.com/r/softwarearchitecture/comments/1qu4aaf/why_does_enterprise_architecture_assume/",
      "domain": "self.softwarearchitecture",
      "is_self": true,
      "comments": [
        {
          "id": "o37gb2r",
          "author": "ClideLennon",
          "text": "Because we're still running systems that were designed in 2005?",
          "score": 70,
          "created_utc": "2026-02-02 19:12:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o37h3cb",
              "author": "LessChen",
              "text": "I would have said the 1980's - so much in the banking world is very old but still works for example.",
              "score": 30,
              "created_utc": "2026-02-02 19:15:39",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o37h2do",
          "author": "Glathull",
          "text": "Because in the enterprise, things *do* live forever.",
          "score": 49,
          "created_utc": "2026-02-02 19:15:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o37yfql",
              "author": "BeABetterHumanBeing",
              "text": "To be more precise: in enterprise, a thing lives for as long as the business it's supporting, which is frequently longer than the existence of the company (because business units get spun off in acquisitions, live through bankruptcy, and so on).",
              "score": 7,
              "created_utc": "2026-02-02 20:37:25",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o37gxbp",
          "author": "ratczar",
          "text": "I was reading Clean Architecture recently, and the part that jumped out and grabbed me by the throat is the idea that good architecture defers big decisions for as long as possible.   \n  \nIt sounds like your org is maybe trying to finalize plans for a big, long-term system, which is a trap that I find a lot of engineers fall into - they want to construct the beautiful, perfect, hyper-efficient machine.   \n  \nBut the business sometimes changes what it wants the machine to do, and if you're tied to a 20 year roadmap then you're a bit fucked when winds change. \n\nFor that reason, you can draw up whatever plans you want, but you should really only move to implementation when you *absolutely have to.*\n\nGreat example: we've had plans for an enterprise-wide address verification service for awhile, but we only moved on it when it became absolutely critical for a client. ",
          "score": 15,
          "created_utc": "2026-02-02 19:14:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o37imki",
              "author": "ziksy9",
              "text": ">Great example: we've had plans for an enterprise-wide address verification service for awhile, but we only moved on it when it became absolutely critical for a client. \n\nGiven that is was needed by a client, even if it was implemented there were probably requirements that came in late for that client, so doing it preemptively would have still requires changes, right?\n\nGreat example.",
              "score": 3,
              "created_utc": "2026-02-02 19:22:47",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o37jet5",
                  "author": "ratczar",
                  "text": "It really came down to some minor details in the implementation, e.g. are we going full hypermedia or are we cramming some critical data into the initial return.\n\nWe ended up deciding to cut a corner initially and crammed it into the initial return, and will refactor later when we have more use cases for the related data.",
                  "score": 1,
                  "created_utc": "2026-02-02 19:26:25",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o394cg7",
              "author": "phluber",
              "text": "A well-designed enterprise architecture does not leave you fucked when winds change. A well-designed architecture allows for a great amount of flexibility and room for new features.",
              "score": 2,
              "created_utc": "2026-02-03 00:07:56",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o37kwij",
          "author": "ByMunro",
          "text": "IMO enterprise architecture is about flexibility (coupling and cohesion). we dont know what will be in 2045 and hell we dont even know what will be in 3 years from now. all we can do is try to stay as flexible as possible. some systems will stay, so make sure they're designed well. some systems will go, so make sure you can replace them as effortlessly as possible. \n\nand well, you can be quite sure about what is tomorrow. on a enterprise scale you probably (should) also know whats gonna happen in 6 months quite precisely. the more you look into the future, the more abstract it gets. i dont think anyone is planning on exactly your enterprise architecture will look like in 2045. but you'll want to have visions, guidelines, something abstract, so everyone is going in the same direction. as 2045 comes closer, your vision gets more precise. so make sure you can adapt, keep your landscape flexible. \n\nEDIT: should probably add, that this is a perfect world scenario. time, money, politics have quite some\ninfluence",
          "score": 4,
          "created_utc": "2026-02-02 19:33:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o38inn4",
          "author": "internetuser",
          "text": "Because the people who are paid to facilitate the process get paid more when the process takes a long time.",
          "score": 3,
          "created_utc": "2026-02-02 22:13:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o38qqgv",
          "author": "edgmnt_net",
          "text": "Just a comment from someone who dislikes it. I hope we're talking about the same thing, though, because I'm not really sure...\n\nI don't think that's the real reason. One thing might be horizontal dev scaling: plenty of businesses barely build upon anything, it's an endless crunch to appease one customer, then the next and so on. Architecture is simply an attempt to install guardrails so they can hire en masse with low costs and divide up work. Something a very average dev (mediocre even) can handle, because you want lots of them. Another thing is the expectation that software is write-once, especially when they accumulate tons of half-baked features and tech debt that's difficult to repay, they try to extract as much as possible (and impossible).\n\nIn a nutshell, it's trying to scale up work as cheaply as possible, because ultimately a lot of business is just trying to get money to work. As for where and whether it goes wrong objectively, this is also debatable. I would say the main issues are (1) unrealistic expectations and (2) they're missing out on higher impact, more efficient software development that really taps into the potential of this domain (but you need a strong vision for this, it's not just a matter of spending).\n\nIn practical terms, you'll see silos, you'll see layers upon layers that give the impression that everything is decoupled (yet it isn't, the spaghetti is on another level), you'll see work getting split in ways that makes absolutely no sense and results in huge amounts of duplication. Do reduced hiring costs make up for this? Maybe, although I doubt it can beat a small team of people with enough expertise cutting through the bullshit and working under a well-determined, restricted scope. Scope creep and tech debt tends to balloon up costs, so even if it looks like you can satisfy hundreds of customers early on, things eventually slow down greatly and you have to keep adding to the headcount and reducing margins. Until the costs become insane and the project gets sunset (often quite early).",
          "score": 3,
          "created_utc": "2026-02-02 22:53:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o37h0or",
          "author": "Ugiwa",
          "text": "Products don't die that fast.. (unless you're working for Google ig)",
          "score": 2,
          "created_utc": "2026-02-02 19:15:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o39cs1z",
          "author": "gbrennon",
          "text": "Because applications that runs in the backend of ur bank were deployed in 1980?",
          "score": 2,
          "created_utc": "2026-02-03 00:53:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o37inz5",
          "author": "europeanputin",
          "text": "Architecture it's not just about technical designs, but it must also fit the organizational structure. We have a lot of instances where we would benefit from event driven systems and concepts, but we remain strictly RESTful because we don't have the knowledge to support it. When making designs in such cases, it's important to be mindful that at some point this would change, because the other way around increases cost i.e on operations. Hence the designs go into series of discussions which tradeoff to choose, and enterprise architecture essentially helps making these decisions as it allows to estimate the cost for the current project and the cost of changing it in the future. Comparing this to projections of other cost like cost of running operations or other non functionals help making smart business decisions.\n\nAs cost of change needs to be minimized and eventually management will come to their senses, enterprise architecture is sadly required for technical people to cope with ever changing nature of business demands.",
          "score": 1,
          "created_utc": "2026-02-02 19:22:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o37ny9k",
          "author": "BarfingOnMyFace",
          "text": "It solves the problem of why we have jobs really well 😄",
          "score": 1,
          "created_utc": "2026-02-02 19:47:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o37o8bs",
          "author": "BarfingOnMyFace",
          "text": "Forever is a long time. I’d argue most software should be architected to survive 3-5 decades. Maybe in some cases in the future, a century or so.",
          "score": 1,
          "created_utc": "2026-02-02 19:48:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o37tfwc",
          "author": "D4n1oc",
          "text": "I can't imagine how this would influence your design.\nWe could either do a good architecture that fits the needs or we don't and live with the consequences.\n\nWhat would be the actual design difference for a system that lives 3-5 decades or 10 decades?\n\nWe know one thing for sure. Bad architecture decisions are very expensive and can influence the whole system across all teams causing huge amounts of unknown costs and sometimes make it impossible to change the running system in a necessary way.\n\nWe know the costs for a clean architectural design that minimizes this risk.\n\nIn most cases it's the most expensive part to write software. Because it always creates legacy, technical deps, complexity and needs to be supported.\n\nWriting software should be the last resort. \nIt's much cheaper to make 10 plans and throw them away.",
          "score": 1,
          "created_utc": "2026-02-02 20:13:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o37w1sf",
          "author": "Mediocre_Date1071",
          "text": "I hear two different things happening here\n\n- “layers on layers”. This sounds like design optimized for loose coupling, which gives the ability to change out pieces. This architecture for the assumption that things will not be around forever.  \n\n“Endless review boards…platforms no one can change without 6 approvals”. This is large organizations being large. There is so much miscommunication and need to generate buy-in across a large org, just so the pieces fit together reasonably well, that you get these heavy processes. \n\nThis isn’t to say that your company is doing optimal planning and architecture, just that the reasons for what you see may not the presumption of longevity that you surmise. ",
          "score": 1,
          "created_utc": "2026-02-02 20:26:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o39lg5e",
          "author": "Dicethrower",
          "text": "It's even funnier with games. \"This needs to last 5y, so let's spend 2y making what should take 6 months, and not see the irony in spending 4 times as long to \"\"save time\"\". Oh woops, funding is gone and/or game didn't do so well.\"\n\nYAGNI is not just a catchy phrase. Time saved is time you can spend refactoring when the actual need arises. Anything made before you know it's needed is a waste of time, every time.",
          "score": 1,
          "created_utc": "2026-02-03 01:43:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3blm37",
          "author": "BeastyBaiter",
          "text": "I work as a software dev at an F100 megacorp you've heard of. We retired our mainframes 4 years ago and have numerous critical internal apps from the 1990's.",
          "score": 1,
          "created_utc": "2026-02-03 10:57:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3bpmt1",
          "author": "garden_variety_sp",
          "text": "I call it crystal ball architecture, and it’s the most wasteful way to design and build. Design for now and know that evolution is a thing. I view enterprise architecture in much the same way as I view intelligent design. It takes some serious mental gymnastics to believe in it, and those that do are most likely brainwashed.",
          "score": 1,
          "created_utc": "2026-02-03 11:32:06",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qrc4rv",
      "title": "System Design for beginners!",
      "subreddit": "softwarearchitecture",
      "url": "https://www.reddit.com/r/softwarearchitecture/comments/1qrc4rv/system_design_for_beginners/",
      "author": "Substantial-Tax-472",
      "created_utc": "2026-01-30 17:35:51",
      "score": 6,
      "num_comments": 7,
      "upvote_ratio": 0.81,
      "text": "Hello guys, I'm a final year CSE student. Can anyone suggest the roadmap for beginning System Design, like from basic till advanced concepts and scenarios. I had begun with the ByteByteGo, but I didn't feel the completeness. So, any suggestions would help a lot.",
      "is_original_content": false,
      "link_flair_text": "Discussion/Advice",
      "permalink": "https://reddit.com/r/softwarearchitecture/comments/1qrc4rv/system_design_for_beginners/",
      "domain": "self.softwarearchitecture",
      "is_self": true,
      "comments": [
        {
          "id": "o2n6etv",
          "author": "VortexOfPessimism",
          "text": "Probably [https://www.hellointerview.com/learn/system-design/core-concepts/api-design](https://www.hellointerview.com/learn/system-design/core-concepts/api-design) for something more structured",
          "score": 5,
          "created_utc": "2026-01-30 17:58:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2o26f0",
          "author": "Veuxdo",
          "text": "Ask your professors, that's what they're there for.",
          "score": 2,
          "created_utc": "2026-01-30 20:20:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2xller",
          "author": "MatchLittle5000",
          "text": "If you want something practical watch this: https://youtube.com/@hello_interview?si=uz0nebtCACHS1uHF\n\nIt helped me a lot to pass an interview to Senior position. Might help also in academic purposes.",
          "score": 1,
          "created_utc": "2026-02-01 07:14:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2y9p6d",
          "author": "lmagarati",
          "text": "bro, stop treating system design like a college exam. ByteByteGo is the gold standard, but you’re feeling 'incomplete' because you’re reading instead of doing. pick a feature, design it, and break it... that’s the only way to build the judgment needed for an interview process that is frankly a total 'shit show' and largely dependent on the whims of your interviewer. accept that you’ll fail a few for reasons outside your control, so stop hunting for a perfect roadmap; you'll slowly learn to design by building skin in the game.",
          "score": 1,
          "created_utc": "2026-02-01 10:56:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2zolet",
          "author": "IshanSethi",
          "text": "After completing understanding basic concepts of system design, you can go & practise questions on https://www.designheist.com, they have good interview level questions... Atlassian & uber & few other companies ask system design questions & mostly are similar to what are mentioned on the platform",
          "score": 1,
          "created_utc": "2026-02-01 16:13:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3412pf",
          "author": "Comfortable-Fan-580",
          "text": "Check this out - https://pradyumnachippigiri.substack.com/s/system-design",
          "score": 1,
          "created_utc": "2026-02-02 06:07:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o34br2u",
          "author": "bills2go",
          "text": "I'm building [revibe.codes](https://revibe.codes), which you can use to analyze open source systems of your interest. It shows the architecture, flow diagrams and guided code navigation. Not a regular learning platform - its kind of seeing how other systems are built and learning from that.",
          "score": 1,
          "created_utc": "2026-02-02 07:41:07",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qrek69",
      "title": "What would you change in this architecture?",
      "subreddit": "softwarearchitecture",
      "url": "https://www.reddit.com/r/softwarearchitecture/comments/1qrek69/what_would_you_change_in_this_architecture/",
      "author": "Complex_Ring210",
      "created_utc": "2026-01-30 19:00:00",
      "score": 6,
      "num_comments": 5,
      "upvote_ratio": 0.75,
      "text": "[Test Architecture](https://drive.google.com/file/d/1tad2EjG_wQ7KGoBRXIAVRN-GWBIN3Ey1/view?usp=sharing)\n\nI am learning system design and trying to make a kind of reddit + ai system. I know there can be many things added in this which are currently in reddit, but keeping it simple for now.\n\nPostgres is the main database, Neo4j is for social graph, S3/Minio is for storing media files, Qdrant is for vector embeddings (for media files in chat and long term LLM memory). All services either use Node.js or Python for now.  \nClient is a mobile or web user.\n\nThese are a few things I know, I have to add:\n\n1. Caching (other than the one Valkey node being used for caching SFU server health checks)\n2. The live chat is not connected at the moment\n\nI would love suggestions on how to make this architecture faster or any general improvements. Any suggestions on improvements is welcomed, even if you think I should use php.\n\nAlso all of this was done in [draw.io](http://draw.io) and I know this is so not the way to draw system diagrams. So, it would be great if anyone can let me know how to actually diagram and which tools I should use to draw the diagram",
      "is_original_content": false,
      "link_flair_text": "Discussion/Advice",
      "permalink": "https://reddit.com/r/softwarearchitecture/comments/1qrek69/what_would_you_change_in_this_architecture/",
      "domain": "self.softwarearchitecture",
      "is_self": true,
      "comments": [
        {
          "id": "o2nrd68",
          "author": "Hopeful-Programmer25",
          "text": "If this is for actual use btw, I don’t think MinIO is free any more… though you said for learning so, ok",
          "score": 3,
          "created_utc": "2026-01-30 19:30:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2nstx4",
              "author": "Complex_Ring210",
              "text": "Yeah I mean I don't want to give $1 per month to AWS to host 5 cat photos",
              "score": 1,
              "created_utc": "2026-01-30 19:36:58",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2soquz",
                  "author": "Glove_Witty",
                  "text": "You’d be well under the free tier threshold by the sound of it.",
                  "score": 1,
                  "created_utc": "2026-01-31 14:49:48",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o2pfnfd",
              "author": "Complex_Ring210",
              "text": "What do you think about the architecture?\nCan I improve it?",
              "score": 1,
              "created_utc": "2026-01-31 00:31:03",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2rggmg",
                  "author": "Hopeful-Programmer25",
                  "text": "If you can post a screenshot here I could have a look.",
                  "score": 1,
                  "created_utc": "2026-01-31 09:12:00",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qshikv",
      "title": "Deployed an ML Model on GCP with Full CI/CD Automation (Cloud Run + GitHub Actions)",
      "subreddit": "softwarearchitecture",
      "url": "https://www.reddit.com/r/softwarearchitecture/comments/1qshikv/deployed_an_ml_model_on_gcp_with_full_cicd/",
      "author": "gringobrsa",
      "created_utc": "2026-01-31 23:15:56",
      "score": 5,
      "num_comments": 0,
      "upvote_ratio": 0.78,
      "text": "Hey folks\n\nI just published Part 2 of a tutorial showing how to deploy an ML model on GCP using Cloud Run and then evolve it from manual deployment to full CI/CD automation with GitHub Actions.\n\nOnce set up, deployment is as simple as:\n\n    git tag v1.1.0\n    git push origin v1.1.0\n\nFull post:  \n[https://medium.com/@rasvihostings/deploy-your-ml-model-on-gc-part-2-evolving-from-manual-deployments-to-ci-cd-399b0843c582](https://medium.com/@rasvihostings/deploy-your-ml-model-on-gc-part-2-evolving-from-manual-deployments-to-ci-cd-399b0843c582)",
      "is_original_content": false,
      "link_flair_text": "Article/Video",
      "permalink": "https://reddit.com/r/softwarearchitecture/comments/1qshikv/deployed_an_ml_model_on_gcp_with_full_cicd/",
      "domain": "self.softwarearchitecture",
      "is_self": true,
      "comments": []
    },
    {
      "id": "1qtuyi1",
      "title": "Have to extract large number of records from the DB and store to a Multipart csv file",
      "subreddit": "softwarearchitecture",
      "url": "https://www.reddit.com/r/softwarearchitecture/comments/1qtuyi1/have_to_extract_large_number_of_records_from_the/",
      "author": "MasterA96",
      "created_utc": "2026-02-02 13:25:17",
      "score": 5,
      "num_comments": 4,
      "upvote_ratio": 1.0,
      "text": "I have to design a flow for a new requirement. Our product code base is quite huge and the initial architects have made sure that no one has to write data intensive code themselves. They have pre-written frameworks/utilities for most of the things. \n\nBasically, we hardly get to design any such thing ourselves hence I lack much experience of it and my post might seem naive so please excuse me for it.\n\n(EDITED) The requirement was that we will be using RabbitMQ so the user request to service A will send a message to the queue and there will be a consumer service B which would use Apache Camel, would go through routes (I mean so it's already asynchronous) to finally requesting records from the join of tables. (Just a simple inner join, nothing complex) Those records might or might not need processing and have to be written to a multipart file of type csv, which would be sent to another API to another service C.\n\nWe're using PostgreSQL. I've figured out the Camel routing part (again using existing utilities). Designed a sort of LLD. Now the real question was fetching records and writing to csv without running into OOM issue. It seems to be the main focus of my technical architect.\n\nI've decided on using - (EDITED)\n\nJdbcTemplate.query using RowCallBackHandler\n\n(Might use JdbcTemplate.queryForStream(...), since I'm on Java 17 so better to use streams rather than RowCallBackHandler, but there are other factors like connection stays open, fetchSize on individual statement isn't possible)\n\nWould be using a setFetchSize(500) - Might change the value depending on the tradeoffs as per further discussions.\n\nMight use setMaxRows as well.\n\nThe query would be time period based so can add that time duration in the query itself.\n\nThen I'll be using CSVWriter/ByteArrayOutputStream to write it to the Multipart file (which is in memory not on disk). [Not so clear on this, still figuring out]\n\nI know it's nothing complex but I want to do it right. I used to work on a C# project (shit project) for 4.5 yrs and moved to Java, 2 yrs back. Roast me but help me get better please. Thank you. ",
      "is_original_content": false,
      "link_flair_text": "Discussion/Advice",
      "permalink": "https://reddit.com/r/softwarearchitecture/comments/1qtuyi1/have_to_extract_large_number_of_records_from_the/",
      "domain": "self.softwarearchitecture",
      "is_self": true,
      "comments": [
        {
          "id": "o37uxvj",
          "author": "two-point-zero",
          "text": "Look a bit confusing to me. Help me to understand:\n\n-Why rabbit?it means that the  process that read the file (call it the producer) is not on the same software/machine/system of the one that read them? ( Call it the consumer). So producer read from your db, write messages in rabbit and a different system will read and build the csv?\n\n- camel is not enough to be \"automatically async\" because of routes. A route can be fully sync, and to be honest in most case you want to be sync ( for example if you are dealing with transactions). The async is because of Rabbit,and it's async between producer and consumer still the consumer part might or might not be sync with the thread that read from rabbit.\n\n- if messages goes from postgeres to the CVS producer via rabbit,the advance of using streamed query highly depends on how you write on rabbit.do you send rows in bulk ( 10,100,1000s each rabbit message) or one message each row ( very poor performance wise)?\n\n- by the way if performance is a concerns,don't use text formats for rabbit messages (Jason,XML ) goes for a binary serialization library.\n\n- what is a multiparty csv? There are csv payload and multipart http requests. Multipart csv look new to me.\n\nClarify these please and we can continue...\n\nEdit: and most important how \"big\" is big here? Thousands of records?millions? billions? A 10MB csv, 100 MB? GB?",
          "score": 2,
          "created_utc": "2026-02-02 20:20:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3adv7z",
              "author": "MasterA96",
              "text": "Sure, I'll elaborate. RabbitMQ is used just after we receive the user request. Basically the request message will go to RabbitMQ and gets consumed by another service which would then produce the file and send to a 3rd service.\n\nWe can rule out the Camel routing part here. I just mentioned RabbitMQ and Camel to tell that DB call would happen on a separate thread so it's already non-blocking in one way.\n\nSo the DB call and CSV formation both are part of the RabbitMQ consumer service.\n\nIt will be sending the Multipart File which will be of type CSV. \n\nHow the 3rd service will send/display that file to the user is completely out of my control.\n\nNumber of records currently atmost are 100k, but will increase with time. The table is already monthly partitioned and indexed.\n\nAlso, I know it might not take that much memory right now but my team's main concern is that we should still not bring and store everything in memory.\n\nEdit: To summarize I want to know how can I use JdbcTemplate in a better way as per this usecase.",
              "score": 1,
              "created_utc": "2026-02-03 04:34:06",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3b2ahx",
                  "author": "two-point-zero",
                  "text": "Ok.nice.\n\nStarting form the end. If you want to keep a minimum of streaming features you probably want to use chunked data (if http 1) or DATA frames (if http/2) but you need to be sure that both your http client and API server are able to manage them (which should be..but check to be sure).\n\nIf not, you have to send the CVS file all in once,that means load in memory all at once. Or you might want to save it on some third party storage and send link to the external API to retrieve if it too big.\n\nConsidering you can actually send data in streaming fashion, I think I would go for paginate the query on db assign each page to a different thread, read and process In parallel (you may want to track some row key or page number to reorder data at the end),and then compose and reorder it need. With camel should be matter of a couple of stages to accomplish that, patterns of scatter and recompose is well supported.\n\nThen you can buffer your rows,once processed and reordered and send them when ready again in chunk,or data as said before.\n\nBut keep in mind,if you need  any summarized data (like the average of some value,thing like that )you cannot avoid to load  everything in memory at least once.\n\nI would keep thing parametric like:\n\n- records in a page \n- number of thread for reading\n -dimension of chunk\n- dimension of http post body buffer\n\nAnd play a bit to see what fit best. Speed and Memory and resources are always connected,high speed, more parallelism,more memory and more resources but faster.\n\nLess parellism,or smaller db pages,will consume less resources but requires more time to complete..you need to try and tweak.\n\nIdeally if you want to stream directly from db to API,you cannot use more that one thread for db page (no parallelism, one page at time, out of db through API sync)\n\nThe more parallel thread you will use the more memory you need because worst case, to build an ordered chunk you might need to keep in Memory all the required pages until you fill the write buffer. I.e. you spin 3 thread and read page 1,2,3 but thread 3 finish first. To send all the records ordered you need to wait for thread 1 an 2 to complete, so worst case you need all 3 Db pages to be loaded in memory for reordering.\n\nso keep main parameters variables using external properties ( possibly with hot reload or JMX access to change them while running) and find your sweet spot.",
                  "score": 1,
                  "created_utc": "2026-02-03 07:52:38",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3bqdba",
          "author": "garden_variety_sp",
          "text": "Camel SQL producer will give you a ResultSetIterator. You can stream from that. Transform if you need to. The Camel file producer will happily take a stream as input and will even chunk it for you if required.",
          "score": 1,
          "created_utc": "2026-02-03 11:38:08",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qtsd8g",
      "title": "Questions about adding ElasticSearch to my system",
      "subreddit": "softwarearchitecture",
      "url": "https://www.reddit.com/r/softwarearchitecture/comments/1qtsd8g/questions_about_adding_elasticsearch_to_my_system/",
      "author": "Illustrious-Bass4357",
      "created_utc": "2026-02-02 11:18:39",
      "score": 4,
      "num_comments": 2,
      "upvote_ratio": 0.84,
      "text": "so Im trying to use elastic search in my app for 2 search functions one for foods , and the other for meals , anyways I have some questions\n\n\n\nQ1. Should Elasticsearch indices be created manually (DevOps/Kibana/Terraform), or should the application be responsible for creating them at runtime , or is there's something like db migrations but for ES ?\n\nQ2. If Elasticsearch indices are managed outside the application, how should the app safely depend on them without crashing if an index is missing or renamed? For example, is it okay to just return an empty list when Elasticsearch responds with an error?\n\nQ3. Without migrations like SQL, how are index mapping changes managed over time?  \n\n\nQ4. Should the application be responsible for pushing data into Elasticsearch when DB data changes, or should this be handled externally via CDC (e.g., Debezium) or am I over engineering ?\n\n",
      "is_original_content": false,
      "link_flair_text": "Discussion/Advice",
      "permalink": "https://reddit.com/r/softwarearchitecture/comments/1qtsd8g/questions_about_adding_elasticsearch_to_my_system/",
      "domain": "self.softwarearchitecture",
      "is_self": true,
      "comments": [
        {
          "id": "o39q8ii",
          "author": "james-dev89",
          "text": "For index creation and management look into Index lifecycle management ILM, usually you create an alias and the alias is responsible for rotating the index. \nYou can configure the shards and everything. \nNewer versions of ES have better index management than older ones. \n\nFor data yeah a CDC makes sense but for us, we do index write as a batch operation, after we write to the database we fire off an event that writes to elastic search. \n\nHope this helps.",
          "score": 1,
          "created_utc": "2026-02-03 02:10:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3as015",
          "author": "Low_Satisfaction_819",
          "text": "As someone who has managed a few elasticsearch clusters in my life, consider typesense.",
          "score": 1,
          "created_utc": "2026-02-03 06:21:01",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qtsopq",
      "title": "Selenium IDE test Case Migration",
      "subreddit": "softwarearchitecture",
      "url": "https://www.reddit.com/r/softwarearchitecture/comments/1qtsopq/selenium_ide_test_case_migration/",
      "author": "amfromeverywhere",
      "created_utc": "2026-02-02 11:36:05",
      "score": 4,
      "num_comments": 1,
      "upvote_ratio": 0.76,
      "text": "I am trying to design migrating a 20 year old JSF based system to rest controllers + angular. Tough but I feel a vanilla migration for this forum. \n\nWhat's new is they have about 5000 selenium ide suites that only runs on an ancient version of Firefox over a well designed kubernetes cluster and takes in between 5 to 15 hrs depending on how much resources you can dedicate for a run.\n\n  \nThose tests are really really thorough but are the only source of truth of the application functionality. No documents or unit or integration tests are present.\n\n  \nSo question for anyone who has experienced a migration like this:\n\n  \n1. Any effective way of speedy refactoring without waiting for 10 hours for tests feedback?\n\n2. What happens to the tests post migration? There are decades of edge case bug fixes being guarded by this regression suite but no one knows what the tests do. The historical assertions in those tests is what is keeping the system running and we don't want to lose it.",
      "is_original_content": false,
      "link_flair_text": "Discussion/Advice",
      "permalink": "https://reddit.com/r/softwarearchitecture/comments/1qtsopq/selenium_ide_test_case_migration/",
      "domain": "self.softwarearchitecture",
      "is_self": true,
      "comments": [
        {
          "id": "o36edyw",
          "author": "flavius-as",
          "text": "Run the test suite with code coverage on.\n\nThis gives you all tests grouped by use case.\n\nThen split the tests by use case and run only the relevant tests.\n\nThen refactor the code behind the scene for only that use case. One use case at a time.\n\nThen create the rest api which uses the same code like jsf. Write tests for that. Introduce mutation testing. Either both selenium and the new test suite fails, or both succeed.\n\nOnce you got enough mass, you switch users to the new UI and remove the old tests.\n\nI'd suggest a gradual Roadmap in which you migrate certain use cases to the new UI, via the infrastructure routing.",
          "score": 3,
          "created_utc": "2026-02-02 16:19:11",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}