{
  "metadata": {
    "last_updated": "2026-02-01 08:57:56",
    "time_filter": "week",
    "subreddit": "softwarearchitecture",
    "total_items": 20,
    "total_comments": 141,
    "file_size_bytes": 188605
  },
  "items": [
    {
      "id": "1qol5xl",
      "title": "Have we reached \"Peak Backend Architecture\"?",
      "subreddit": "softwarearchitecture",
      "url": "https://www.reddit.com/r/softwarearchitecture/comments/1qol5xl/have_we_reached_peak_backend_architecture/",
      "author": "Brief_Ad_5019",
      "created_utc": "2026-01-27 17:56:22",
      "score": 472,
      "num_comments": 101,
      "upvote_ratio": 0.95,
      "text": "I’ve been working as a Software Architect primarily in the .NET ecosystem for a while, and I’ve noticed a fascinating trend: The architectural \"culture war\" seems to be cooling down.\nA few years ago, every conference was shouting \"Microservices or death.\" \nToday, it feels like the industry leaders, top-tier courses, and senior architects have landed on the same \"Golden Stack\" of pragmatism. It feels like we've reached a state of Architectural Maturity.\n\nThe \"Modern Standard\" as I see it:\n - Modular Monolith First (The Boundary Incubator): This is the default to start. It’s the best way to discover and stabilize your Bounded Contexts. Refactoring a boundary inside a monolith is an IDE shortcut; refactoring it between services is a cross-team nightmare. You don't split until you know your boundaries are stable.\n\n- The Internal Structure: The \"Hexagonal\" (Ports & Adapters) approach has won. If the domain logic is complex, Clean Architecture and DDD (Domain-Driven Design) are the gold standards to keep the \"Modulith\" maintainable.\n   \n - Microservices as a Social Fix (Conway’s Law): We’ve finally admitted that Microservices are primarily an organizational tool. They solve the \"too many cooks in the kitchen\" problem, allowing teams to work independently. They are a solution to human scaling, not necessarily technical performance.\n\n - The \"Boring\" Infrastructure:\n   * DB: PostgreSQL for almost everything.\n   * Caching: Redis is the de-facto standard.\n   * Observability: OpenTelemetry (OTEL) is the baseline for logs, metrics, and traces.\n\n - Scalability – The Two-Step Approach:\n   * Horizontal Scaling: Before splitting anything, we scale the Monolith horizontally. Put it behind a load balancer, spin up multiple replicas, and let it rip. It’s easier, cheaper, and keeps data consistency simple.\n   * Extraction as a Last Resort: Only carve out a module if it has unique resource demands (e.g., high CPU/GPU) or requires a different tech stack. But you pay the \"Distribution Tax\": The moment you extract, you must implement the Outbox Pattern to maintain consistency, alongside resiliency patterns (circuit breakers, retries) and strict idempotency across boundaries.\n\nIs the debate over?\nIt feels like we’ve finally settled on a pragmatic middle ground. But I wonder if this is just my .NET/C# bubble.\n\nI’d love to hear from other ecosystems:\n - Java/Spring Boot: Does the Spring world align with this \"modern standard\"?\n - Node.js/TypeScript: With the rise of frameworks like NestJS, are you guys also moving toward strict Clean Architecture patterns, or is the \"keep it lean and fast\" vibe still dominant?\n - Go/Rust: Are you seeing the same push toward Hexagonal patterns, or does the nature of these languages push you toward a more procedural, \"flat\" structure?\n\nIs there a \"Next Big Thing\" on the horizon, or have we actually reached \"Peak Backend Architecture\" where the core principles won't change for the next decade?",
      "is_original_content": false,
      "link_flair_text": "Discussion/Advice",
      "permalink": "https://reddit.com/r/softwarearchitecture/comments/1qol5xl/have_we_reached_peak_backend_architecture/",
      "domain": "self.softwarearchitecture",
      "is_self": true,
      "comments": [
        {
          "id": "o22ervg",
          "author": "OtterZoomer",
          "text": "This discussion also reminds me of how the initial hype around NoSQL caused a lot of us to misstep and try to wholesale use only NoSQL due to its scaling advantage.\n\nThe problem I think many of us then ran into is that while there is some data that's well suited to simple key-value lookup scenarios, \\*most\\* data is actually highly-relational in nature.  And so this means that if you're hell-bent on \\*only\\* using NoSQL because you are religious about your horizontal-scaling story, you end up having to piece-together a poor-man's version of SQL on top of NoSQL, which ends up being a Frankensteinian mess as well as a metaphorical poor reinvention of the wheel.\n\nI learned it all the hard way <sigh>.  And I eventually just settled on PostgreSQL, as you did.  :)",
          "score": 52,
          "created_utc": "2026-01-27 18:50:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o296n8f",
              "author": "mikaball",
              "text": "NoSQL was a marketing stunt. It doesn't scale as people think it does in real world software. At least not for operational databases.\n\nThe most blunt examples that I see in real world production software is devs realizing how bad it is for highly-relational data (as you stated). Then proceed to put everything in the same documents (to facilitate the retrive of relational data), generating deep nested JSON structures.\n\nWhat they don't realize is that these deep JSON structures:\n\n* are not normalized and suffer from fan-out issues on write operations\n* what would be an insert is now an update deep in the structure, raising the probability of concurrency issues and completely fucks up scalability. Scalability is very related with database contention, the problem NoSQL was trying to resolve in the first place, ironically.\n\nKnowing that, a relational DB like PostgreSQL is by far the best starting point for any operational DB; and we generally start with operations. Analytics comes after gathering data.",
              "score": 3,
              "created_utc": "2026-01-28 17:53:56",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o289fn7",
              "author": "Petesaurus",
              "text": "Very inexperienced, is there a technical reason that the horizontal scaling features of NoSQL couldn't be applied to a relational DBMS?",
              "score": 2,
              "created_utc": "2026-01-28 15:29:33",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o291f9b",
                  "author": "OtterZoomer",
                  "text": "The level of functionality provided by a true RDBMS is \\*far far\\* beyond what is provided by your typical NoSQL DB.  An RDBMS like PostgreSQL or MariaDB supports queries using SQL, which is an extremely expressive and powerful way to manipulate data. NoSQL, as its name implies, has no ability to support SQL.  NoSQL for the most part is a very simple key-value lookup.  This is also what makes it easier to implement NoSQL systems that can be spread across multiple nodes (so-called horizontal scaling).\n\nIf you take maybe an hour or two to introduce yourself to SQL (learning basic insert/update/select/delete but especially learning queries that involve multiple tables with foreign keys so that the light-bulb goes off in your head and you begin to see the power of SQL for manipulating relational data), then you will likely understand how a simple key-value table can't compare in functionality.  Ask ChatGPT to tutor you oh these basics so that you can quickly gain this insight. Knowing SQL will open a whole new world to you when it comes to backend and data manipulation.  It's very empowering and an essential part of  any dev's toolbox.\n\nAnd this level of power with SQL is magnified as the number of related tables increases.  A complex database will often have many dozens of related tables. The power of both RDBMS and SQL is that they are optimized for such highly-relational data, for storage, data access, and SQL query efficiency and elegance.\n\nWhat I see happening a lot is that people who are using on NoSQL DBs end up cobbling-together a sort of pseudo SQL (very much lacking  the true power of SQL) in order to gain some form of control over the relational data - of which there's typically a lot.",
                  "score": 2,
                  "created_utc": "2026-01-28 17:31:26",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o2979p9",
                  "author": "OtterZoomer",
                  "text": "Oh sorry I didn’t answer your question. Horizontal scaling of an RDBMS is a lot harder than horizontal scaling of NoSQL mostly due to the fact that RDBMS DBs are far more complex. There are two projects doing this though, cockroach and yugabyte. Both attempt Postgres compatible tooling.",
                  "score": 1,
                  "created_utc": "2026-01-28 17:56:31",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o2o28to",
                  "author": "lukebryant9",
                  "text": "Relational DBMSes are typically ACID compliant and NoSQL databases typically aren't. ACID compliance has a performance cost.",
                  "score": 1,
                  "created_utc": "2026-01-30 20:20:52",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o22670k",
          "author": "general_dispondency",
          "text": "This ebbs and flows every 10 or so years. Currently monolith is on top, in a few years microservices will come back rebranded as something else (see SOA), then the added complexity of orchestration will drive everyone back to the monolith. The worst part of this industry is that no one studies the past and looks at how we got where we are. Everyone wants to do the new cool thing, not realizing that we've already done that, and there's a reason that only the people who need it still do it.",
          "score": 127,
          "created_utc": "2026-01-27 18:14:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o22ekb3",
              "author": "robhanz",
              "text": "I think this is less \"monolith on top\" and more \"monolith with internal boundaries as an intermediate step towards microservices, *if* they become necessary.\"\n\nIt's a good pattern, because it's one based on evolution, not on a single architecture that will never change.  It honors the changing requirements of services while also creating enough structure to avoid problems going forward.",
              "score": 58,
              "created_utc": "2026-01-27 18:49:24",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o2286lm",
              "author": "Brief_Ad_5019",
              "text": "Very true! Cloud Providers clearly love to help you with all the complexity and sell you serverless or something. Even if this complexity is often more accidental than essential ;)",
              "score": 16,
              "created_utc": "2026-01-27 18:22:33",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o275hty",
              "author": "randoomkiller",
              "text": "This makes me think, I like to study history, and therefore notice repeating patterns but how can someone at the age of 26 and 1.5YoE see the past 20-30 years of trends and general large overview history of software infra/approaches/why they failed/why some succeeded?",
              "score": 2,
              "created_utc": "2026-01-28 11:47:33",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o28ebqf",
                  "author": "general_dispondency",
                  "text": "Read and talk to people you work with that have been doing it a long time and learn from their wisdom. You don't have to be their best friend or agree with any personal choices they make. Just be friendly and ask questions that make it sound like you've done a small amount of homework. As someone who's done this for a while, there's nothing I enjoy more then sharing my passion with other people who are just getting into it. Not everyone is like that, but you probably work with one or more people who have that same mindset.",
                  "score": 3,
                  "created_utc": "2026-01-28 15:51:13",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o2vpgwz",
              "author": "ericmutta",
              "text": "Indeed. The coolest most depressing thing about software development is that all the important things were discovered before you were born (think 50+ years ago at this point)...so there's nothing new, just new people rediscovering history they ignored.",
              "score": 2,
              "created_utc": "2026-01-31 23:47:06",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2281e8",
          "author": "OtterZoomer",
          "text": "One thing I don't see people talking about much is how incredibly \\*high\\* the ceiling now is on vertical scaling.  In the past (15 yrs ago) if you wanted decent scalability you were forced to go horizontal. But that's really not the case anymore.  A single compute can now be outfitted with four top-end EPYC CPUs with 2TB ECC memory and that machine can run 1536 \\*concurrent\\* threads, theoretically all sharing the same process address space of memory (no process context switch and TLB switching for virtual memory).  Not only is this equivalent to 1536 computers of the past (a cloud in a single box), but that shared memory between threads is an enormous advantage in two ways: 1) performance; 2) simplicity of architecture (sharing memory between threads enables much simpler code versus distributed message passing across nodes) - the state is in a single place versus spread about, and access to it requires simple synchronization primitives rather than more complex message passing etc.\n\nAnd this vertical ceiling continues to rise.",
          "score": 55,
          "created_utc": "2026-01-27 18:21:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o229zmh",
              "author": "Brief_Ad_5019",
              "text": "Fascinating fact and numbers! Just think about NVIDIA telling us a whole row in a Datacenter \"behaves like a single GPU\"!\nIt would be super interesting to see how many millions of users you could serve with vertical scalability...",
              "score": 6,
              "created_utc": "2026-01-27 18:30:07",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o22ch3g",
                  "author": "OtterZoomer",
                  "text": "Exactly.  I bought into the whole serverless/microservices hype a few years ago and through hard experience learned the many cons of that approach.  Given the incredibly high ceiling on vertical scaling, my stack is now:\n\nGo API (incredible for network services) - network requests are handled efficiently with both async and threading, maximizing hardware utilization.  My implementation stays simple because it's a single process, yet it scales to incredible levels with threading and a massively multi-core machine.  Yeah you don't start out with the max provisioned machine - you start out cheap and periodically provision more resources as needed.  You can start using a cheap VPS, allocating more RAM and faster CPU and more cores as needed.  Eventually you migrate over to a physical host.  It does mean you need a redundancy story for PostgreSQL but that can be done in multiple ways.  If you don't need 5-6 9's uptime (if you're not a bank) then it's reasonable for you to have a few minutes of downtime at 3am in your most populous user zone for an occasional re-provisioning reboot.  And you can still do load balancing (use NGINX) for the more static-read type of stuff.  Using PostgreSQL as a standard edge, and a host/VPS as your environment, makes it so easy to avoid vendor lock-in too.  You can easily move your solution about to various alternate hosting configs.\n\nAnd it can be a hell of a lot cheaper!",
                  "score": 10,
                  "created_utc": "2026-01-27 18:40:38",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o2lotr6",
                  "author": "JackSpyder",
                  "text": "Especially if you had bare metal it woukd be a LOT.",
                  "score": 1,
                  "created_utc": "2026-01-30 13:49:42",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o25rrwz",
              "author": "truechange",
              "text": "This is true but I think the use case is more on redundancy / HA.",
              "score": 4,
              "created_utc": "2026-01-28 04:54:11",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o25lo83",
              "author": "missedalmostallofit",
              "text": "And the database?  You systematically put it on different server?  For an app with 1000 users.  Or you increase THE power of one beast?",
              "score": 2,
              "created_utc": "2026-01-28 04:15:53",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o2cflsq",
              "author": "TylerDurdenFan",
              "text": "Adding to this: today a single, individual PCIe 5 NVMe SSD can provide more disk (IOPS millions!) and bandwidth (tens of GB/s), than an enteprise SAN did just 10 years ago, which means your acid relational database can reeeeally scale up IO before clustering becomes necessary.",
              "score": 2,
              "created_utc": "2026-01-29 03:16:19",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o2d0w16",
              "author": "VertigoOne1",
              "text": "I had the same/similar discussion with an architect that was hell bent on micro services and he basically didn’t consider the “network” cost at all, didn’t think about it in context of what that means. Sure you can do 40Gb/s highly coupled and willing to  fork the $$$ but as soon as you leave the cpu/cache/mem block you incur a several orders of magnitude latency hit on getting all your data moving around and that is before you consider the extra cost of routing/ha/dns and everything else to just even support the flows reliably. I’m all for micro architectures but it has to make sense, like highly variable workload, lots of async, analysis offloading, etc. knee jerking because of “we need to improve performance” is like the last reason to scale horizontal.",
              "score": 2,
              "created_utc": "2026-01-29 05:34:05",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o23av1u",
          "author": "lIIllIIlllIIllIIl",
          "text": "I do believe C#/.NET lives in a bubble.\n\nVery few ecosystems are as homogeneous as .NET, and altough homogeneity has some advantages, it has drawbacks too, the main one being stagnation.\n\nFrameworks have a [\"cost of convenience\"](https://surma.dev/things/cost-of-convenience/) to them. They can make some things easier, but it usually comes at the cost of making other things harder.\n\nMost micro-services have ill defined boundaries, and people constantly argue over whether services should be brought together or separated.\n\nConway's law has been [misinterpreted into the opposite of what he meant](https://youtu.be/5IUj1EZwpJY?si=je5ZPNPbuf_9jjTz). Conway wanted to warn people about the dangers of rigid communication structures creating arbitrary fractures in code where there shouldn't be one, but nowadays people use Conway's law to justify creating the very fractures he was trying to prevent.\n\nSOLID, DDD, Clean Architecture & Clean Code are all vaguely defined principles that don't objectively increase productivity and reduce defects. The amount of ceremony required to adhere to these subjective principles often outweigh the benefits they might bring.\n\nI could go on, but I think you get the point. I don't think we reached peak architecture yet, and doubt we ever will. Every piece of software is different.",
          "score": 15,
          "created_utc": "2026-01-27 21:13:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o27pebj",
              "author": "HateToSayItBut",
              "text": "Microsoft is an insulated bubble. No modern, innovative startup says \"let's start building with .Net!\"",
              "score": 1,
              "created_utc": "2026-01-28 13:51:18",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2hnbsr",
                  "author": "Legitimate-School-59",
                  "text": "What's wrong with .net? ",
                  "score": 1,
                  "created_utc": "2026-01-29 21:53:21",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o2ug4ts",
                  "author": "quantum-fitness",
                  "text": "Well .Net isnt sexy but everyone I know who have worked professionally with modern .Net seems to love it.",
                  "score": 1,
                  "created_utc": "2026-01-31 19:55:55",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o2hnej9",
              "author": "Legitimate-School-59",
              "text": "Why is .net ecosystem in a bubble?",
              "score": 1,
              "created_utc": "2026-01-29 21:53:43",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2hqe5m",
                  "author": "lIIllIIlllIIllIIl",
                  "text": "All ecosystems are bubbles, but what OP said applies specifically to the .NET bubble in my opinion.\n\n.NET's main appeal is that its ecosystem is homogeneous. Everyone uses ASP NET, everyone uses the same libraries by Microsoft, and everyone uses the same coding standards. This mainly draws enterprise companies which have huge codebases and a huge number of employees. This naturally leads to the .NET ecosystem to favor backend architectures and patterns that are meant for very large enterprise applications, and claim that it is the only right way to do things. Because it's homogeneous, diverging opinions have a hard time gaining traction.\n\nRust, Go, JavaScript and Python are all bubbles of their own, but they hold different beliefs.",
                  "score": 1,
                  "created_utc": "2026-01-29 22:07:56",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o22ej64",
          "author": "iMac_Hunt",
          "text": "To be honest even a monolith with hexagonal pattern + DDD is overkill for a lot of applications out there. Transaction boundaries become tricky and getting many teams to abide to it well can be an uphill battle. I am not saying don’t do it but it shouldn’t be the default.\n\nWe have not reached peak backend architecture and we never will because all software is different in terms of needs, size and complexity.",
          "score": 26,
          "created_utc": "2026-01-27 18:49:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o22i833",
              "author": "Brief_Ad_5019",
              "text": "Agree!\nI learned the problems with transaction boundaries with domain events being processed eventually consistent the hard way: My FE reloaded an overview directly after the POST call returned -  and I got data that was not yet fully updated.. so what to do? Timeout? 😂 Websockets? Or just process domain events before returning?\n\nThat's why I intentionally added to use DDD only for domains that are actually complex enough.",
              "score": 4,
              "created_utc": "2026-01-27 19:05:00",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o23q65d",
              "author": "Emotional-Dust-1367",
              "text": "Why does monolith make transaction boundaries tricky?",
              "score": 2,
              "created_utc": "2026-01-27 22:21:59",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o244yoa",
                  "author": "iMac_Hunt",
                  "text": "The monolith part is fine, I’m referring to hexagonal and DDD",
                  "score": 3,
                  "created_utc": "2026-01-27 23:35:01",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o22hbg1",
          "author": "atika",
          "text": ">Horizontal Scaling: Before splitting anything, we scale the Monolith horizontally. Put it behind a load balancer, spin up multiple replicas, and let it rip. It’s easier, cheaper, and keeps data consistency simple.\n\nAll the scalability \"best practices\" that architects swear by today, were born when the most powerful server box you could get had two dual core CPUs and memory was measured in megabytes.  \n\nRight now, we have CPUs with hundreds of cores per socket, memory in terrabyte sizes, and hyperconverged storage solutions to easily reach petabytes using prosumer hardware.\n\nStart designing your systems to run on modern hardware.",
          "score": 9,
          "created_utc": "2026-01-27 19:01:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o22jz1u",
              "author": "Brief_Ad_5019",
              "text": "Definitely a key takeaway reading though the comments.\nI still think that horizontal scalability can be helpful for separations of concerns: you can make sure that your sync calls are not getting affected by async work. Or keep your /reports routes away from /overview.",
              "score": 1,
              "created_utc": "2026-01-27 19:12:37",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o22cq9k",
          "author": "mountainlifa",
          "text": "Great post and agree 💯. Currently refactoring a Frankenstein micro services app built upon AWS serverless into a monolith. It took months just to understand what the heck was going on. Lambdas calling lambdas, Rube Goldberg would be proud! We're likely using fastapi containerized on ecs. As a former SA at AWS I think a lot of noise has gone away because Amazon, Microsoft etc has fired a lot of their \"dev evangelist\" teams and sort of given up to focus on AI shiny objects. They've submitted to the fact that in reality no one outside of amazon is building massively complex applications in this way. Ironically Amazon's payments API is a monolith and no plans to change it lol.",
          "score": 13,
          "created_utc": "2026-01-27 18:41:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o28oryh",
              "author": "Brief_Ad_5019",
              "text": "Appreciate that! I would love to see your context-map 😁 Serverless Big Ball Of Mud - what a time to be alive!",
              "score": 2,
              "created_utc": "2026-01-28 16:36:17",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2374we",
          "author": "PizzaHuttDelivery",
          "text": "DDD did not receive a major shake up. It is very much the same thing evans and vernon proselitized 10 years ago. If it wasnt for microservices and api design practices, DDD would have been probably dead. \n\nDon't get me wrong. DDD is useful, but if you look at all other techniques, they all kind of went an evolution/revolution. Many ideas have been challenged and overturned all across the board. But DDD is still almost the same as 20 years ago.",
          "score": 6,
          "created_utc": "2026-01-27 20:56:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o22o7az",
          "author": "CzyDePL",
          "text": "And it's going to trash because now we need \"agentic architecture\"",
          "score": 3,
          "created_utc": "2026-01-27 19:31:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o28lb8a",
              "author": "asdfdelta",
              "text": "Enshittification-as-a-Service",
              "score": 4,
              "created_utc": "2026-01-28 16:21:16",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o25e72l",
          "author": "Longjumping_Status71",
          "text": "There is nothing you described that doesn’t match my clients enterprise system, a lot of which is there because of me and the same understandings that you have outlined and I have come to believe as the best way to do things as well. Microservice vs monolith has bounced back and forth in the blogosphere , but once the organization reaches a critical mass I think everyone ends up with some microservices… usually supporting a monolith as well.",
          "score": 4,
          "created_utc": "2026-01-28 03:32:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o29x8sh",
          "author": "ConstructionInside27",
          "text": "Yeah, I think we might be. It still surprises me that we don't yet have well accepted frameworks to reproduce the independence enforcement benefits of microservices without actually putting a network boundary in there.\n\nIt's a complex problem to solve build times and dependencies but worth something. Or what about monorepo? Core library maintainers can keep pushing their latest and greatest versions out, make breaking changes they can unbreak on all the callers in the same PR. \n\nAgain, a technical challenge but I can't believe we're still in this situation where companies must choose between sophisticated ball of mud vs a puddle archipelago of shallow, repetitive, immature",
          "score": 3,
          "created_utc": "2026-01-28 19:49:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2cdf1z",
          "author": "TylerDurdenFan",
          "text": "I really hope people are actually understanding that Microservices are an optimization for large, multi-team organizations where autonomous decision-making across domains creates actual business value. The cargo cult has run for long enough IMHO. I wonder if AI will delay the point at which microservices become necessary / worth it. If the initial team can do much more thanks to AI, then the organizational need for separate teams/services should appear later than it did before AI, and many won't get there.",
          "score": 3,
          "created_utc": "2026-01-29 03:03:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o251cla",
          "author": "markojov78",
          "text": "I really disagree that microservices are some kind of internal organisation tool.\n\nIt's a design pattern for decoupling which has implications on scalability and resilience. Like any other design pattern it's not good for every case but it is all about how software performs in production, not about people who made it.\n\nTreating it as internal organisation tool is what caused so many awful attempts at microservices where boundaries were merely \"administrative\" and never contributed to any decoupling ...",
          "score": 5,
          "created_utc": "2026-01-28 02:23:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o22ryzx",
          "author": "EagleSwiony",
          "text": "Kinda agree beside the DDD and PostgreSQL point. \n\nRegarding Postgre I would not say it's THE standard. IT depends on the industry. In Fintech, I would say MSSQL or even Oracle DB are more prominent and used in those huge Enterprises.",
          "score": 2,
          "created_utc": "2026-01-27 19:48:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o25vo3u",
          "author": "flavius-as",
          "text": "There's one more trick with the performance of a modulith behind the LB: you (soft) redirect certain use cases to certain nodes in order to keep the caches warmer.\n\nAnd one more trick to make problems surface: you give each module in the modulith its own db credentials and connection. Guardrail: you keep in check what each module is able to read or write via schemas and permissions.",
          "score": 2,
          "created_utc": "2026-01-28 05:20:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o266ipg",
          "author": "vbilopav89",
          "text": "No we haven't. I'm known to be a notorious DDD hater and I do hate anything DDD/CA/HA with passion. \n\n\nAlthough, I do admit that DDD had some good parts, only two actually (language, context), but those concepts existed even before.\n\n\nAnything else is crap and nonsense amd I've been writing and ranting about it for years now on LinkedIn. Here's my latest:\nhttps://www.linkedin.com/posts/vb-software_here-is-a-really-really-interesting-side-by-side-activity-7421810292365590528-hJyE?utm_source=share&utm_medium=member_android&rcm=ACoAAAFChn4BJtC3te8HO2_kZu5V6dFh8zzjQq8",
          "score": 2,
          "created_utc": "2026-01-28 06:42:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o26fmte",
          "author": "YahenP",
          "text": "These are tough times in the industry. There's no money, projects are being scrapped, jobs are being cut. At times like these, religious wars about architecture and other abstract matters usually subside. Most are focused on their work and how to avoid wasting it. Doing more with less. When (and if) the industry emerges from the crisis, all these debates will flare up with renewed vigor.",
          "score": 2,
          "created_utc": "2026-01-28 07:59:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o27i8y7",
          "author": "tr14l",
          "text": "Modular monolith requires a certain amount of guard dogging, too. \n\nPersonally, Conway's law is the driver for me. I let deployment/ownership needs drive segregation. Where there is a unit of people, that unit should map to business function, and they should have their own deployable artifacts that do not require coordination with anyone else. \n\nI also demand people are ruthless about mitigation of outside dependency elsewhere in the company. If you don't control it, you should be bitching about using it. Obviously third party tools with support are more of an exception, but a culture of wanting full control should be in place. You want me to use your email gateway? How about go eff yourself. I can do that myself and I'm not coming to you every time I need a template change for a feature.\n\nYou want me to use your special search service? Nah son. I can handle elastic search myself. Thanks. \n\nYou want me to use your special sauce feature flag BS? Make me.",
          "score": 2,
          "created_utc": "2026-01-28 13:12:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2bpmag",
          "author": "Serializedrequests",
          "text": "How about the active record pattern? Much too maligned today. It's the foundation of rapid development in Rails, along with solid DDD. It might struggle with complexity of different use cases, but only for the 5% of your app that gets complex.\n\n\nCheck out the source code of Fizzy: https://github.com/basecamp/fizzy It's nothing like anything in OP, but super readable.",
          "score": 2,
          "created_utc": "2026-01-29 00:53:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2gnuuk",
              "author": "Brief_Ad_5019",
              "text": "I needed to look this pattern up - but I really agree that this looks super cool. I wouldn’t be aware of any dotnet implementations though..\n\nIf I am not mistaken I have used that in php with Laravel couple of years ago in a CRM app! I remember well that I was quite surprised how far php frameworks have become - super good for fast development.\nThanks for bringing nostalgia!",
              "score": 1,
              "created_utc": "2026-01-29 19:04:14",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2ibulv",
                  "author": "Serializedrequests",
                  "text": "I haven't seen it used to very great effect in Java-like frameworks in a while. In Rails it is basically a code generator. Inspects the database and generates all the CRUD on startup. I wouldn't want to try that in C#. The frameworks that do this are all annotation driven, which I have a very low opinion of.",
                  "score": 1,
                  "created_utc": "2026-01-29 23:59:26",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2d8ae1",
          "author": "HosseinKakavand",
          "text": "This captures really well what we've seen in the Golang/enterprise ecosystem at [Luther](https://www.reddit.com/r/luthersystems/). Domains captured in a bounded context as a single transaction, cross-domain involves orchestration. Totally agree microservices are best used for solving organizational problems, although there are edge cases where it makes sense for security. Personally, we also keep logic decoupled from integrations via eventing and a single connector hub service (multiple replicas), but I don't know how common this is.",
          "score": 2,
          "created_utc": "2026-01-29 06:31:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2fk7v8",
          "author": "livecodelife",
          "text": "I think this is an accurate take. I actually believe the next “architecture” shift will be more about how we define the system and manage the code itself more than how we choose to structure it. AI code generation lends itself to this “boring” modular style so I think people will double down on it. Additionally though, I think we’ll see a rise of external evaluation tools for the system behavior because we’ll want something outside the codebase to test the system. Chad Fowler has a great series on this called the [Phoenix Architecture](https://aicoding.leaflet.pub/)",
          "score": 2,
          "created_utc": "2026-01-29 16:06:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2glttx",
              "author": "Brief_Ad_5019",
              "text": "Define you mean to explore the domain and find out what to build actually? Or more in the direction of “plan.md”?",
              "score": 1,
              "created_utc": "2026-01-29 18:54:54",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2h40iq",
                  "author": "livecodelife",
                  "text": "Neither actually. I mean building external, durable evaluation tests to define/validate the behavior of the system so that no matter how many times the code for the system is generated or regenerated by AI, we can know that it performs correctly as long as those evaluations pass. Basically  deterministic harness for the non-deterministic code generation. And this is easier if you follow this boring but proven architecture",
                  "score": 1,
                  "created_utc": "2026-01-29 20:20:59",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2gi1iq",
          "author": "Ok_Reality6261",
          "text": ",I work with Spring and it is pretty much the same: Hexagonal, DDD, EDA, PostgreSQL, Redis...  I would not call that \"peak backend architecture\" tho, just a way of doing things because it is the most common practice right now and microservicess suit big orgs\n\nThat said, the current margin strecth and cost efficiency that is happening across all industrie may change things like \"yeah well, lets assume a bigger domain so we do not end up with 3 services for that crap\" (which to be honest its something I am fine with. I have seen unjustified levels of granularity just for the sake of it)",
          "score": 2,
          "created_utc": "2026-01-29 18:37:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2glcln",
              "author": "Brief_Ad_5019",
              "text": "Great finally a spring guy, interesting to hear that! Can you recommend any template? It has been quite a while since I saw a spring backend - would be fun!\n\nBtw if someone is interested in a great dotnet CA template, [this one](https://github.com/amantinband/clean-architecture) I really like 😉",
              "score": 1,
              "created_utc": "2026-01-29 18:52:45",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o228nrg",
          "author": "HowIsDigit8888",
          "text": "None of the good backend architecture has been made yet. We haven't even gotten started except at the drawing board. Everything in deployment is jank",
          "score": 1,
          "created_utc": "2026-01-27 18:24:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o22bec2",
              "author": "Brief_Ad_5019",
              "text": "Honestly even this is a bit harsh - I also need to agree that even if this \"Modern Standard\" is now somewhat popular - a lot of new services that I see still don't mind and go crazy..",
              "score": 3,
              "created_utc": "2026-01-27 18:36:08",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o22c2u1",
                  "author": "HowIsDigit8888",
                  "text": "Yeah I guess I did exaggerate the harshness, there are open source stacks that aren't really janky these days",
                  "score": 1,
                  "created_utc": "2026-01-27 18:39:00",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o23cos0",
          "author": "ConquerQuestOnline",
          "text": "I think that that's a pretty standard architecture these days for apps with strong consistency. Vertical slices, a little DDD flavoring, etc. It's what I'm doing for my current side-project.\n\nAt work, we're very much EDA with event-sourcing, and mostly, it's the right choice.",
          "score": 1,
          "created_utc": "2026-01-27 21:21:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o24cm22",
          "author": "symbiat0",
          "text": "Actually I think it depends on use cases for your application. Sometimes a monolith makes sense, sometimes it doesn’t, I’ve been on both sides of that the past few years…",
          "score": 1,
          "created_utc": "2026-01-28 00:14:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o25htpa",
          "author": "NTXL",
          "text": "In my humble uneducated opinion  i don’t think it gets better than serverless",
          "score": 1,
          "created_utc": "2026-01-28 03:53:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o28mk4y",
              "author": "asdfdelta",
              "text": "If I had a nickel for every time I've heard that haha.\n\nThere is one constant in software - everything always changes. Especially constraints, which shift the value of different stacks.",
              "score": 1,
              "created_utc": "2026-01-28 16:26:42",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2etww8",
                  "author": "NTXL",
                  "text": "I swear I was joking. I actually have nightmares about serverless lol",
                  "score": 2,
                  "created_utc": "2026-01-29 14:01:14",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o2clckd",
              "author": "TylerDurdenFan",
              "text": "Back in 2023 Amazon posted an article ( [https://www.primevideotech.com/video-streaming/scaling-up-the-prime-video-audio-video-monitoring-service-and-reducing-costs-by-90](https://www.primevideotech.com/video-streaming/scaling-up-the-prime-video-audio-video-monitoring-service-and-reducing-costs-by-90) now gone, understandably ) titled: \"Scaling up the Prime Video audio/video monitoring service and reducing costs by 90%\"\n\nSubtitled: The move from a distributed microservices architecture to a monolith application helped achieve higher scale, resilience, and reduce costs.\n\nMost of the \"90% cost savings\" came from leaving AWS Step Functions (Lambda). The article really made the rounds. And it was on Amazon Prime's website, talk of credibility!. It's a very interesting read, and although Amazon has since removed it, PDF copies can still be found online.",
              "score": 1,
              "created_utc": "2026-01-29 03:50:32",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2e5xlr",
                  "author": "Odd_Ordinary_7722",
                  "text": "That's a lesson in refactoring, not that serverless is bad",
                  "score": 1,
                  "created_utc": "2026-01-29 11:30:22",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o26o15h",
          "author": "Few_Cauliflower2069",
          "text": "Nope. The tooling and infrastructure around microservices failed, it was harder to debug and keep track of the system landscape so now people are going back to monoliths. Microservices are far superior in terms of scalability, security, maintenance, development speed and many more areas though",
          "score": 1,
          "created_utc": "2026-01-28 09:16:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o27j64a",
          "author": "Jolly-Lie4269",
          "text": "Shit engineers are always going to create shitty stuff",
          "score": 1,
          "created_utc": "2026-01-28 13:17:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2goda1",
              "author": "Brief_Ad_5019",
              "text": "So let’s review their code and give helpful comments so they improve! Remember we all have been there!",
              "score": 1,
              "created_utc": "2026-01-29 19:06:37",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2nm3ty",
          "author": "evoludigit",
          "text": "I do not know if we have reached peak software architecture, software engineering is still in its infancy if we compare it to most technologies.\n\nI come from the Python world, and was frustrated by the lack of tools for architecting a Saas with a very complex domain (think 50+ entities).\n\nI came up with https://fraiseql.dev, the core innovation is to use CQRS and have both:\n- a normalized model, that use tb_ tables with all the constraints, indexes etc. SOLID principles that have long been optimized in the DB world,\n- a read side with composed JSONB views.\n\n\nEach query is just 'SELECT data FROM v_{entity} WHERE ...', and the framework just selects the required keys from the json payload and camelCase them for direct consumption by the frontend.  \n\nEarly results significantly outperform more conventional approaches simply because the data path is extremely short: DB → JSON → HTTP.\n\nI’m rewriting the core in Rust, and schemas will be authorable in any language.\n\nBecause the query pattern is so simple, the approach isn’t tied to a single database. Any engine that can store JSON can support it—v2 will target PostgreSQL, SQL Server, SQLite, and MySQL.\n\nAt least for me, this approach has meaningfully improved both the ease of maintenance and the performance of large, complex codebases.",
          "score": 1,
          "created_utc": "2026-01-30 19:06:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2pspj9",
          "author": "RainierMallol",
          "text": "I wholeheartedly agree. My work is mainly on new software for enterprises, government and private. This is the way to go when a new software development is actually required.\n\nAnd what I suspect what is an unpopular opinion here: Sometimes just push for a quick low code solution using something that connects already existing software that the org has access to, such as Power Automate + Sharepoint + some type of db pipeline to have a single source of thruth with the organization's core business software. Quick, easy to deploy and integrate, not so scalable in terms of funcionality but allows to test and improve, and even decide to build or buy something later on when the current tech doesn't fit the business requirements anymore.",
          "score": 1,
          "created_utc": "2026-01-31 01:46:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2qa9sh",
          "author": "fungkadelic",
          "text": "Microservices can scale up and down to meet demand, it’s not just social. Don’t be silly?",
          "score": 1,
          "created_utc": "2026-01-31 03:31:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2svcq5",
          "author": "czlowiek4888",
          "text": "I'm from node js world, this is basically the same on my side.\n\nBut imho the web dev I not really that hard to came up with good architecture.\n\nI started writing my own game engine, this is sick.",
          "score": 1,
          "created_utc": "2026-01-31 15:24:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2t81fm",
          "author": "iocompletion",
          "text": "Hexagonal is good but a bit overrated. Functional core/imperative shell is better and a bit underrated.",
          "score": 1,
          "created_utc": "2026-01-31 16:25:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2wlj1r",
          "author": "eggucated",
          "text": "I’m in agreement OP",
          "score": 1,
          "created_utc": "2026-02-01 02:54:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o22w3mp",
          "author": "justUseAnSvm",
          "text": "*Let me tell you something, I haven't even begun to peak. And when I do peak, you'll know. Because I'm gonna peak so hard that everybody in Philadelphia's gonna feel it.*",
          "score": 1,
          "created_utc": "2026-01-27 20:06:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o226inz",
          "author": "atika",
          "text": "Fuck no. DDD is a horrible way to decompose your system.",
          "score": -2,
          "created_utc": "2026-01-27 18:15:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2283a7",
              "author": "dbcoder",
              "text": "what is your preferred methodology?",
              "score": 8,
              "created_utc": "2026-01-27 18:22:09",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o22f0x7",
                  "author": "atika",
                  "text": "Let's not get into a religious debate here, m'kay?\n\nBut look at [this video](https://www.youtube.com/watch?v=Q6RfMmMwhvM), somewhere around 5 min. mark, he starts to get into service granularity.",
                  "score": -5,
                  "created_utc": "2026-01-27 18:51:20",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o22951x",
              "author": "Brief_Ad_5019",
              "text": "Oh you think so? After a learning curve I am big believer. I found that things like ubiquitous language and a clean domain model is super helpful - especially during testing.\n\nSomehow I feel that we have forgotten the fundamentals of how a class should encapsulate data AND it's domain logic while we have  have adopted EntityFramework, created an anemic domain model and put everything in the controller 😂",
              "score": 6,
              "created_utc": "2026-01-27 18:26:34",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o22jx56",
                  "author": "CzyDePL",
                  "text": "Yup, it's not even about DDD - it's basic OOP. I blame Java for \"class oriented programming\" vs proper OOP",
                  "score": 2,
                  "created_utc": "2026-01-27 19:12:23",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o237qq5",
          "author": "Charming-Raspberry77",
          "text": "Get to a few thousand requests per second and your modulith on pg will look less attractive by the day. Big scale breaks everything.",
          "score": 0,
          "created_utc": "2026-01-27 20:59:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2cj7d3",
              "author": "TylerDurdenFan",
              "text": "[https://openai.com/index/scaling-postgresql/](https://openai.com/index/scaling-postgresql/)\n\nit'd seem attention and read replicas is all you need.",
              "score": 1,
              "created_utc": "2026-01-29 03:37:35",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2d4cnm",
                  "author": "Charming-Raspberry77",
                  "text": "I know. I have seen both global pg and dynamo at scale, for example. Dynamo scales endlessly with no maintenance, and is cheaper. PG replicas not so much.",
                  "score": 1,
                  "created_utc": "2026-01-29 06:00:12",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o227ig1",
          "author": "InternationalEnd8934",
          "text": "nowhere close peak. that will be quantum computers and quantum entanglement data transmission that is faster than light",
          "score": -8,
          "created_utc": "2026-01-27 18:19:45",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qnn5ur",
      "title": "Can we please moderate ai slop?",
      "subreddit": "softwarearchitecture",
      "url": "https://www.reddit.com/r/softwarearchitecture/comments/1qnn5ur/can_we_please_moderate_ai_slop/",
      "author": "analcocoacream",
      "created_utc": "2026-01-26 17:49:21",
      "score": 69,
      "num_comments": 11,
      "upvote_ratio": 0.91,
      "text": "I came to this sub hoping for high quality discussions instead it just ai slop spam now",
      "is_original_content": false,
      "link_flair_text": "Discussion/Advice",
      "permalink": "https://reddit.com/r/softwarearchitecture/comments/1qnn5ur/can_we_please_moderate_ai_slop/",
      "domain": "self.softwarearchitecture",
      "is_self": true,
      "comments": [
        {
          "id": "o1zyonf",
          "author": "asdfdelta",
          "text": "This one has been tough to moderate, frankly.\n\nOftentimes these aren't bots but real people using AI to generate a post about a valid architectural topic. It technically fits within the spirit of the sub, but is just lower quality. Restricting lower quality posts gets really subjective when you take writing method into account. Some of the posts are written by non-English speakers that use AI to create a coherent discourse.\n\nI'm happy to add a rule and moderate as I can find (and is reported) if the community at large wants this.",
          "score": 1,
          "created_utc": "2026-01-27 11:33:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1uz0cw",
          "author": "Xgamer4",
          "text": "Ah come on, you don't want to figure out how software can give you temporal sovereignty? \n\n(+1 to the request)",
          "score": 26,
          "created_utc": "2026-01-26 18:00:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1wkupu",
              "author": "analcocoacream",
              "text": "I’d like to start by understanding what was at stake but I guess no one knows not even op",
              "score": 2,
              "created_utc": "2026-01-26 22:11:42",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1v0i9t",
          "author": "FlowOfAir",
          "text": "Dead internet theory 😩",
          "score": 15,
          "created_utc": "2026-01-26 18:06:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1vk8hk",
          "author": "Bonejob",
          "text": "Report it, if the moderators are not dealing with it, apply to be a moderator to help out.",
          "score": 3,
          "created_utc": "2026-01-26 19:29:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1wj645",
          "author": "GrogRedLub4242",
          "text": "It needs better moderation period. More posts truly about architecture. Less ESL. (English slop.)",
          "score": 3,
          "created_utc": "2026-01-26 22:03:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1w041w",
          "author": "SpaceGerbil",
          "text": "How can we use AI to solve this problem?\n\n\n*ducks*",
          "score": 4,
          "created_utc": "2026-01-26 20:39:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2nr15b",
          "author": "CompetitiveProof3078",
          "text": "Have noticed that a lot of dev related subreddits have been overrun by slop posts recently, honestly after being pretty addicted to Reddit for 15+ years it's finally making the platform crap enough for quitting to seem pretty attractive \n\n\nThe posts I've mainly seen seem to either fall into:\n- \"I made some slop product and will just promote it directly\"\n- \"I made some crappy slop product which I'll post a vague question related to and then mention in a eply with my other account\"\n- \"I got ChatGPT to write some generic post and I'll submit it to 100 subreddits to farm karma\"\n- \"I put a crappy AI studio app in an electron wrapper and think I'm a hard working indie dev\" \n\nThen of course the obligatory reply to every comment they make also being AI generated and claiming they just use AI to structure their sentences when called out (🤦) ",
          "score": 1,
          "created_utc": "2026-01-30 19:28:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1wp6z2",
          "author": "Tyhgujgt",
          "text": "But what about my groundbreaking new architecture 😰, diagrams in dms 😉",
          "score": 0,
          "created_utc": "2026-01-26 22:31:54",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qrpvdc",
      "title": "Most people confuse \"Application Logic\" with \"Business Logic\" in MVC/MVVM. Here is my \"CLI Test\" to define a true Model.",
      "subreddit": "softwarearchitecture",
      "url": "https://www.reddit.com/r/softwarearchitecture/comments/1qrpvdc/most_people_confuse_application_logic_with/",
      "author": "FancyComfort435",
      "created_utc": "2026-01-31 02:25:43",
      "score": 55,
      "num_comments": 46,
      "upvote_ratio": 0.8,
      "text": "Too often, I see projects where the \"Model\" is treated just as a DTO (Data Transfer Object) for the database, and all the logic is shoved into the ViewModel or Controller. This leads to massive, unmaintainable \"God Classes.\"\n\nI believe the root cause is a misunderstanding of the Model's boundary.\n\n**My definition of a Model is simple:**\n\n>**The \"CLI Test\"** If I asked you to replace your GUI (React/WPF) with a CLI (Console App) tomorrow:\n\n1. Would your Model class work without modification? -> **Pass** (It's a true Model)\n2. Would it fail because of dependencies on UI libraries or notification logic? -> **Fail** (It's polluted)\n\nFor example, in a Calculator app, the `Calculator` class should hold the current state (accumulator, current operand) and calculation logic. If you put that state in the ViewModel, you are binding your core logic to the View.\n\nI wrote a short article diving deeper into this with diagrams and examples. I'd love to hear your thoughts on this definition.",
      "is_original_content": false,
      "link_flair_text": "Discussion/Advice",
      "permalink": "https://reddit.com/r/softwarearchitecture/comments/1qrpvdc/most_people_confuse_application_logic_with/",
      "domain": "self.softwarearchitecture",
      "is_self": true,
      "comments": [
        {
          "id": "o2qqrnt",
          "author": "Comfortable_Ask_102",
          "text": "That is one of the concepts Uncle Bob tried to communicate with his \"Clean\\* Architecture\" thing. Each Use Case is meant to be one *action* that can be done in the system, and all Use Cases must be independent of any UI or 3rd party, the sum of all Use Cases is *our* application.\n\nAt one project I literally used that as prefixes (like \\`AddOrderUseCase\\`), it's a decent name for a place that calls all the different upstream services, and has some custom, business-dependent logic or some sort of orchestration.\n\nThe dudes from Domain-Driven Design also give good ideas about how to Model a system.\n\nAnd yeah, 100%, a lot of people confuse \"Model\" with the \"ActiveRecord\" pattern, popularized by frameworks like Laravel, RoR and Django it's my guess.",
          "score": 26,
          "created_utc": "2026-01-31 05:25:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2qxw79",
              "author": "FancyComfort435",
              "text": "**Yes! You nailed it.**\n\nThe confusion absolutely comes from the \"Active Record\" pattern in frameworks like Laravel/Rails/Django. They taught a generation of devs that \"Model = A class that maps to a DB table.\"\n\nBut in true MVC (or Clean Architecture), the Model is the **layer** that handles business rules, not just a row in a database.\n\nI'm glad you brought up Uncle Bob. His \"Use Cases\" are exactly what I consider part of the \"Model\" in the broad sense—the code that must survive even if the UI disappears.\n\n**If you're interested, I uploaded a sample code (C#) on GitHub demonstrating this exact \"CLI vs GUI\" separation. It might be a bit rough, but it proves the point.**",
              "score": 6,
              "created_utc": "2026-01-31 06:22:13",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2rh9f8",
                  "author": "zdzisuaw",
                  "text": "Fancy sharing you github or article?",
                  "score": 3,
                  "created_utc": "2026-01-31 09:19:38",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o2rqat2",
                  "author": "FetaMight",
                  "text": "Al?",
                  "score": 2,
                  "created_utc": "2026-01-31 10:46:16",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o2sl5mi",
                  "author": "aefalcon",
                  "text": "Active Record is actually a Domain Model pattern though.  It's a domain model coupled with some data layer functions.  It does not violate MVC when used correctly, but often the app is either simple CRUD with no real business logic or the developer didn't understand the pattern and it turned into purely Data Model.",
                  "score": 1,
                  "created_utc": "2026-01-31 14:29:49",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o2v4mm0",
              "author": "hcboi232",
              "text": "DHH’s ruby on rails and its consequences",
              "score": 1,
              "created_utc": "2026-01-31 21:56:44",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2r33fe",
          "author": "flavius-as",
          "text": "This has been as old as hexagonal architecture. Having a different driving adapter.",
          "score": 9,
          "created_utc": "2026-01-31 07:07:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2rk6jy",
              "author": "FancyComfort435",
              "text": "**Exactly. You get it.**\n\nIt is essentially the same concept as swapping a **Driving Adapter** in Hexagonal Architecture.\n\nI just framed it as a \"CLI Test\" for MVC because many developers find \"Hexagonal\" too academic or intimidating. But the core principle is identical: the UI is just a plugin.",
              "score": -1,
              "created_utc": "2026-01-31 09:48:02",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2rkbov",
                  "author": "flavius-as",
                  "text": "Hexagonal is neither academic nor complicated.\n\nThe official \"book\" on it is... a leaflet. It's that simple: dependency inversion applied architecturally.",
                  "score": 8,
                  "created_utc": "2026-01-31 09:49:24",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2qp8ma",
          "author": "aefalcon",
          "text": "Yep.  I've used \"test harness\" in a similar argument.",
          "score": 8,
          "created_utc": "2026-01-31 05:13:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2qq4wl",
              "author": "FancyComfort435",
              "text": "**Exactly! The \"CLI\" is basically just a primitive test harness.**\n\nIf your model can't run in a simple harness (like a console app or unit test) without dragging in the entire UI framework, it's not really a Model. I just use the \"CLI\" metaphor because it's easier to visualize for people who are stuck in the \"Model = DTO\" mindset.",
              "score": 1,
              "created_utc": "2026-01-31 05:20:25",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2qmn43",
          "author": "theBosworth",
          "text": "Damn, just straight up, uncurated AI slop.",
          "score": 9,
          "created_utc": "2026-01-31 04:54:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2qo51a",
              "author": "FancyComfort435",
              "text": "English is not my first language, so I used AI to translate and format my thoughts.\n\nActually, the initial AI output was too verbose, so I wrote the core draft from scratch and just used AI to handle the translation. If it still looks \"too clean\" or \"excessive\" to you, that might be a fair critique, and I can edit it down.\n\nBut I want to ask you: Does your comment mean you think the *content itself* lacks substance? Or do you just hate AI?\n\nThe \"CLI Test\" concept comes from my 15+ years of software architecture experience, not an LLM hallucination. If you have actual feedback on the architecture itself, I'm all ears.\n\nP.S. Yes, I used Gemini to write this reply too.",
              "score": 0,
              "created_utc": "2026-01-31 05:05:37",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2rqpk9",
                  "author": "FetaMight",
                  "text": "The CLI Test idea is fine. \n\n\nWhat trips me up is the sycophantic writing style typical with LLMs.  Real people don't talk that way so there's an uncanny valley effect happening when I read your comments. \n\n\nI don't think there's any harm in using AI to help you translate your thoughts, but maybe include that as a disclaimer?",
                  "score": 2,
                  "created_utc": "2026-01-31 10:50:03",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o2tfrrm",
                  "author": "no_onions_pls_ty",
                  "text": "Its slop because its just not true.  Not many developers in the wild are making this \"mistake\".  This concept is as decades old.  There is nothing of interest in this post, just standard programming concepts with some added marketing flair trying to communicate an issue having significant breadth.\n\nIt might be really novel for a freshman in college.  But no.  Its just slop.  \n\nIts like going to a car mechanic forum and telling all thr master mechanics that making sure the oil and wiper fluid don't get mixed up is somehow enlightening",
                  "score": 2,
                  "created_utc": "2026-01-31 17:02:38",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o2qv18b",
                  "author": "theBosworth",
                  "text": "It’s just literally copy-pasted straight out of the client you’re using without so much as formatting changes so it sticks out.\n\nI think seeing a hallucination in text which took the form of stating, in bold that a definition would be supplied, then skipping to test conditions outlining what should have been defined undermines the context you’re replying with. It seems like a reply from an AI, not a mere translation.\n\nI don’t even hate AI. You’ve just beat around the bush of a definition that I could agree with, but lacks substance at its core. The CLI test is a fundamental to this, but at a scalar level, this a trivial distinction due to other common classes’ responsibilities—request providers and handlers come to mind here. Your definition of a model is so loose that it includes the DAL.\n\nIt sounds more like you’ve seen a lot of messy student projects without day0 design discussions if you’re mentioning so-called “god classes”.",
                  "score": 3,
                  "created_utc": "2026-01-31 05:58:42",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o2r25ap",
              "author": "epegar",
              "text": "To me it looks good. \nI mean if you manage to identify it as Ai due to the content not being good enough, then I think it's fair. But if you see a rich format being used, then I think it's a good use of Ai.",
              "score": 0,
              "created_utc": "2026-01-31 06:58:58",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2q7s42",
          "author": "LoveThemMegaSeeds",
          "text": "Seems like a weird arbitrary way to define a model.",
          "score": 2,
          "created_utc": "2026-01-31 03:15:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2qpsfd",
              "author": "robhanz",
              "text": "\"Can this work with a different frontend\" is a pretty good and common way to handle that.  And a CLI is the easiest one to make.",
              "score": 13,
              "created_utc": "2026-01-31 05:17:49",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o2qel35",
              "author": "FancyComfort435",
              "text": "Interesting take. Why do you find it arbitrary?\n\nTo me, it's not arbitrary at all—it's a specific stress test for **\"Separation of Concerns.\"** The \"CLI\" is just a proxy for **\"Zero UI Dependency.\"**\n\nIf your business logic depends on a specific UI framework (like expecting a specific View structure), it becomes impossible to test in isolation or reuse. The CLI test is just the simplest way to prove your logic is decoupled from the presentation layer.\n\nIn my view, the Model represents the **\"Business Rules\"** that should exist regardless of whether the app is Web, Mobile, or CLI. If the Model fails to run on a CLI, it usually means it's polluted with UI logic (like routing, notifications, etc.).\n\n**How do you define a Model's boundary in your projects?** Do you prefer keeping logic in the ViewModel/Controller?",
              "score": 5,
              "created_utc": "2026-01-31 03:59:22",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o2qrli5",
              "author": "TheRealStepBot",
              "text": "Not as weird as making a stateful calculator",
              "score": -5,
              "created_utc": "2026-01-31 05:31:32",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2qxg2g",
                  "author": "FancyComfort435",
                  "text": "**I chose the \"Calculator\" example specifically because it is the simplest form of a State Machine.**\n\nA physical calculator is inherently stateful. It has registers, an accumulator, and pending operations. If the Model doesn't hold that state, the ViewModel has to. And that's exactly what I'm arguing against—leaking domain state into the presentation layer.\n\nDo you prefer managing `PendingOperation` or `Accumulator` in your ViewModels?",
                  "score": 2,
                  "created_utc": "2026-01-31 06:18:30",
                  "is_submitter": true,
                  "replies": []
                },
                {
                  "id": "o2u6aq2",
                  "author": "WhenSummerIsGone",
                  "text": "how do you calculate without state?",
                  "score": 1,
                  "created_utc": "2026-01-31 19:08:45",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2sctip",
          "author": "mexicocitibluez",
          "text": "This is called DDD.",
          "score": 1,
          "created_utc": "2026-01-31 13:41:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2twj31",
          "author": "Classic_Chemical_237",
          "text": "It’s not that deep. MVC is just super thin basic layer when you don’t want to over engineer. MVVM focuses on objects, VIPER focuses on responsibilities. A proper app with complicated logic should be able to run interactor, entity (model) and VM in CLI.\n\nBetter yet, use React Native. You will naturally separate business logic into a library which can be shared by both web and app with all the unit tests and integration tests. Apps will only have presentation logic",
          "score": 1,
          "created_utc": "2026-01-31 18:22:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2v5ews",
          "author": "hcboi232",
          "text": "why are we using MVC for the backend/usecases? The thick client is long gone and DHH thought it would be nice to butcher that term to be used for a service based architecture. I wouldn’t structure the frontend around Hexagonal because I would be ignoring different control structures relevant to the UI.",
          "score": 1,
          "created_utc": "2026-01-31 22:00:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2rtktr",
          "author": "BleLLL",
          "text": "vertical slice architecture has entered the chat",
          "score": 0,
          "created_utc": "2026-01-31 11:16:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2ru2z8",
              "author": "FancyComfort435",
              "text": "Vertical Slice Architecture has left the chat.",
              "score": 1,
              "created_utc": "2026-01-31 11:20:46",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qr44dn",
      "title": "How Replacing Developers With AI is Going Horribly Wrong",
      "subreddit": "softwarearchitecture",
      "url": "https://youtu.be/ts0nH_pSAdM?si=Kn2m9MqmWmdL6739",
      "author": "BlazorPlate",
      "created_utc": "2026-01-30 12:29:05",
      "score": 52,
      "num_comments": 3,
      "upvote_ratio": 0.92,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Article/Video",
      "permalink": "https://reddit.com/r/softwarearchitecture/comments/1qr44dn/how_replacing_developers_with_ai_is_going/",
      "domain": "youtu.be",
      "is_self": false,
      "comments": [
        {
          "id": "o2lkefu",
          "author": "commanderdgr8",
          "text": "I don't think this should be labeled as going horribly wrong - relying on a technology you don't understand fully and giving it free-hand was amatuerish and the company who gave ai free-hand suffered. but that gave us the learnings, ofcourse companies might be hiring developers again after doing mass layoff, but this time there would be more automation, not less. Kind of the second phase of full ai automation started.",
          "score": 4,
          "created_utc": "2026-01-30 13:25:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ngjld",
          "author": "Lord_Farkwad",
          "text": "This video is nonsense",
          "score": 2,
          "created_utc": "2026-01-30 18:42:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2mpw9m",
          "author": "[deleted]",
          "text": "[deleted]",
          "score": 0,
          "created_utc": "2026-01-30 16:44:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2nlca9",
              "author": "CthuluSurvivor",
              "text": "You aren’t making a distinction, but instead are attempting to reframe the context in a different light. Imagine you have 3 developers all doing the same job. The company starts using LLM coding assistants and the workload of these 3 developers is now replaced by 1 developer + 1 coding agent. Two developers are fired and one remains. The one did not simply get more efficient. Instead, the role of that one developer shifted to a developer + code agent role instead of simply a developer role. At least two developers have been replaced by this new role. One developer was laterally shifted into a role that now includes the coding agent. Someone could say that three developer roles were, in fact, replaced - as the old roles no longer exist due to the new. \n\nWhile 3 developer roles were replaced, only 2 developers were fired. The distinction in this case is between developer roles and developers. Either way, with roles or people, the job of two people were taken on by one + coding agent and this is leading to higher tech debt.",
              "score": 1,
              "created_utc": "2026-01-30 19:02:59",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qoapzj",
      "title": "The snake oil that is the Ai economy",
      "subreddit": "softwarearchitecture",
      "url": "https://www.reddit.com/r/softwarearchitecture/comments/1qoapzj/the_snake_oil_that_is_the_ai_economy/",
      "author": "ParsleyFeeling3911",
      "created_utc": "2026-01-27 10:55:50",
      "score": 43,
      "num_comments": 27,
      "upvote_ratio": 0.75,
      "text": "This might be the greatest scam in human history. Not because it's the most evil or the most profitable, though the numbers are staggering, but because of how perfectly it's designed. The product creates the illusion that justifies the investment. The investment funds better illusions, everyone involved, from the builders to the buyers, has reasons to believe it's real.\n\nHere's what's actually happening. Companies are spending hundreds of billions building data centers, chips, training runs. They're selling this on the promise of transformative intelligence, systems that understand and reason. What they're delivering is sophisticated pattern matching that needs constant supervision and makes up facts with complete confidence.\n\nThe gap between promise and delivery isn't new. But the scale is unprecedented, and the mechanism is interesting.\n\nHistorical snake oil actually contained stuff, alcohol, cocaine, morphine. It did things. The scam wasn't selling nothing, it was selling a cureall when you had a substance with narrow effects and bad side effects.\n\nModern AI has real capabilities. Text generation, translation, code assistance, image recognition. These work. The scam is in the wrapping—selling pattern-matching as intelligence, selling tools that need supervision as autonomous agents, selling probability distributions as understanding.\n\nWhen you sell cocaine as a miracle cure, customers feel better temporarily. When you sell pattern-matching as general intelligence, markets misprice the future. The difference is scale. This isn't twenty dollar bottles on street corners. It's company valuations in the hundreds of billions, government policy decisions, and infrastructure investment that makes sense only if the promises are true.\n\nChatbots work like cold readers. Not because anyone sat down and decided to copy psychics, but because the same optimization pressures produce the same behaviors.\n\nA cold reader mirrors your language to build rapport. An LLM predicts continuations that match your style. A cold reader makes high-probability guesses that sound insightful—everyone has experienced loss. An LLM generates statistically likely responses. Both deliver with confidence that makes vagueness feel authoritative. Both adapt based on feedback. Both fill gaps with plausible-sounding details, whether that's a spirit name or a fabricated citation. Both retreat to disclaimers when caught.\n\nThe psychological effect is identical. You feel understood. The system seems smart. The experience validates the marketing claims. And this isn't accidental—someone chose to optimize for helpfulness over accuracy, to sound confident, to avoid hedging, to mirror your tone. These design choices create the cold reading effect whether that's the stated goal or not.\n\nMarketing creates expectations for intelligence. The interface confirms those expectations through cold reading dynamics. Your experience validates the hype. Markets respond with investment. With billions on the line, companies need to maintain the perception of revolutionary capability, so marketing intensifies. To justify valuations, systems get tuned to be even more helpful, more confident—better at seeming smart. Which creates better user experiences. Which validates more marketing.\n\nEach cycle reinforces the others. The gap between capability and perception widens while appearing to narrow. And the longer it runs, the harder it becomes to reset expectations without market collapse.\n\nThe consequences compound. Capital misallocation on a massive scale—trillions in infrastructure for capabilities that may never arrive. Companies restructuring and cutting jobs for automation that doesn't work unsupervised. Critical systems integrating unreliable AI into healthcare, law, education. And every confidently generated falsehood makes it harder to distinguish truth from plausible-sounding fabrication.\n\nWhat makes this potentially the greatest scam in history isn't just the scale. It's that the people running it might be true believers. They're caught in their own hype cycle, pricing their equity on futures that can't materialize because they won't invest in the control infrastructure that could actually deliver on the promises.\n\nThe control systems needed—verification, grounding, deterministic replay, governance—cost almost nothing compared to the GPU budget. One training run could fund the entire reliability infrastructure. But there's no hype in guardrails. There's only hype in bigger models and claims about approaching AGI.\n\nSo we keep building capacity for a future that can't arrive, not because the technology is fundamentally incapable, but because the systems around it are optimized for hype over reliability.\n\nAnd here's what makes it perfect: If this is the greatest scam in history, it's also the most perfectly designed one—because the product actively participates in selling itself.\n\nCan you call it a scam if it is not the intent? Well, someone choose to design the chat bots to operate the way they do, and it’s a known problem that is effectively treated as unsolvable so I have to say that the faith in the future doesn't excuse the deception in the present.\n\n\n\n\n\n[https://github.com/thepoorsatitagain/Ai-control-](https://github.com/thepoorsatitagain/Ai-control-)",
      "is_original_content": false,
      "link_flair_text": "Discussion/Advice",
      "permalink": "https://reddit.com/r/softwarearchitecture/comments/1qoapzj/the_snake_oil_that_is_the_ai_economy/",
      "domain": "self.softwarearchitecture",
      "is_self": true,
      "comments": [
        {
          "id": "o226w6b",
          "author": "Worldly_Expression43",
          "text": "And yet this is an ai written post lmfao",
          "score": 14,
          "created_utc": "2026-01-27 18:17:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o23xsct",
              "author": "engiNARF",
              "text": "Ctrl + F \"—\" lol. Like copying your friend's CS homework without changing the variable names.",
              "score": 5,
              "created_utc": "2026-01-27 22:58:47",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o27eo1p",
                  "author": "magick_bandit",
                  "text": "I have a hiring manager friend who has started asking candidates what keyboard sequence creates an emdash when they see it on their cover letter, etc.",
                  "score": 3,
                  "created_utc": "2026-01-28 12:50:35",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o26bk4j",
              "author": "ParsleyFeeling3911",
              "text": "Did anyone say that ai did not have uses?",
              "score": -2,
              "created_utc": "2026-01-28 07:24:05",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2c0nbe",
                  "author": "engiNARF",
                  "text": "You have to see how the irony undercuts the credibility of the post, right? Here's a quote from your post,  \"*And every confidently generated falsehood makes it harder to distinguish truth from plausible-sounding fabrication*.\" How do I know whether that's what you believe or a plausible sounding approximation of what you believe? In fact, since your actions seem to contradict the sentiment of the post I'm inclined to think you only half-heartedly believe it. Which is fine btw! But there's a nuance idea that is personal to you that is obscured by having a chatbot write it out. And instead of adding a new perspective that I read and think, \"Huh, never thought of it that way...\" I see another emdash ridden post that makes me think, \"Huh, dead internet theory is no longer a theory.\" In other words I want to know what **you** think, not what a chatbot thinks you think.",
                  "score": 5,
                  "created_utc": "2026-01-29 01:54:22",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1zycto",
          "author": "ResidentTicket1273",
          "text": "Yes, this exposes a weakness in a system that optimises for specific set of circumstances whose interactions reinforce themselves within the system. It's a classic runaway/feedback loop problem. The system will re-balance itself, but the shock is going to be significant.",
          "score": 11,
          "created_utc": "2026-01-27 11:31:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1zyxo9",
              "author": "ParsleyFeeling3911",
              "text": "I think that there are ways to make AI almost as useful as they claim it to be, its jsut that no one is funding it because no one is being called out on deception.\n\nlet this article go viral (I knowit wont) and they will throw some money around and make it happen.",
              "score": 0,
              "created_utc": "2026-01-27 11:35:50",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o200kqd",
                  "author": "ResidentTicket1273",
                  "text": "In business automation, where non-deception is important, there is lots of money going into building guardrails to try and tame LLM responses, but the problem there is that you end up with systems that are 99% guardrails, and which, were the same effort expended into building a traditional system, would end up reproducing the same results without an expensive and inefficient LLM being located at the centre.",
                  "score": 7,
                  "created_utc": "2026-01-27 11:48:34",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o20jbkg",
          "author": "wllmsaccnt",
          "text": "There doesnt seem to be a downside from the perspective of the large tech companies. \n\n\nIf one of them actually matches the hype (a tall order), there is a whole new paradigm to control. Huge potential profits for the lottery ticket holder.\n\n\nIf things remain as-is, they will continue to expand and keep selling the hype.\n\n\nIf the hype dies down and investment stops, then they are still left with a bunch of data centers that they can sell or repurpose to loss lead traditional hosted services.",
          "score": 2,
          "created_utc": "2026-01-27 13:46:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2af3wd",
          "author": "therealslimshady1234",
          "text": "Yep, its a garbage psuedo intelligent no code tool. Pattern matching will never be intelligent",
          "score": 1,
          "created_utc": "2026-01-28 21:08:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o21n72w",
          "author": "Ascending_Valley",
          "text": "There is a large bubble populated with noise and distraction, but the kernel of validity and research is advancing very quickly.  The path is unpredictable, and short-term effects are likely overestimated, with headlines dominated by better bots of various types.\n\nHowever, the technology is advancing in directions that increasingly provide human-level capability and beyond in most disciplines.  From AlphaGo to AlphaFold to coding and math tools and image and text processing, you cannot dismiss much of AI progress as just hype.",
          "score": 1,
          "created_utc": "2026-01-27 16:52:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o26c0mz",
              "author": "ParsleyFeeling3911",
              "text": "Progress is definately happening, but is it happening inside the model, or outside of it?",
              "score": 1,
              "created_utc": "2026-01-28 07:28:03",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2bba9h",
                  "author": "Ascending_Valley",
                  "text": "Wow, downvoted..., ok.  FYI - I work with AI and design world-class models.  \n  \nI think the coming year will be dominated by methodology, model, and system structure, rather than pure training or inference time-compute scaling.",
                  "score": 1,
                  "created_utc": "2026-01-28 23:38:52",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o20jtxe",
          "author": "Adamzxd",
          "text": "If you don’t see the massive value of AI, as a developer, as a software architect, there is no hope for you. \n\nBut then again you used AI to write this 👋",
          "score": -2,
          "created_utc": "2026-01-27 13:49:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o222cxg",
              "author": "Clyde_Frag",
              "text": "The cost to use AI assisted tools will go up once the VC funding goes away but you’re just a weirdo Luddite if you think these tools don’t make you more productive. Times change, and it’s best to change with them.",
              "score": 0,
              "created_utc": "2026-01-27 17:57:47",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o2bqor7",
              "author": "Shot-Contribution786",
              "text": "Please, show me that. But show me that not in terms \"OMFG, I've became so much more productive\" show me that in hard proved researches which depicts that productivity increase.",
              "score": 0,
              "created_utc": "2026-01-29 00:59:12",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o217ue6",
              "author": "Lilacsoftlips",
              "text": "At this point it seems obvious that a large percentage of code changes 3-5 years from now will be made, merged and deployed via agents. And orgs that have been using continuous deployment/shift left stuff are in the best position to do so. Maybe if you are not in a modern org, it’s harder to see. ",
              "score": -5,
              "created_utc": "2026-01-27 15:45:35",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o206jpl",
          "author": "Rare_Huckleberry_734",
          "text": "The truth will always come out. When it does, won't be pretty for some.",
          "score": -1,
          "created_utc": "2026-01-27 12:31:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o26cg9z",
          "author": "[deleted]",
          "text": "I am working on Edge AI, and I only know that if war happens we have 0 chance to beat them. ",
          "score": 0,
          "created_utc": "2026-01-28 07:31:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o26mlho",
          "author": "alexduckkeeper_70",
          "text": "I can see AI is incredibly useful for programming (especially basic tasks, providing you monitor it), but I don't see a route to massive profitability for those supplying it. ",
          "score": 0,
          "created_utc": "2026-01-28 09:02:53",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qnaoid",
      "title": "software architecture over coding",
      "subreddit": "softwarearchitecture",
      "url": "https://www.reddit.com/r/softwarearchitecture/comments/1qnaoid/software_architecture_over_coding/",
      "author": "Practical_Lake8826",
      "created_utc": "2026-01-26 08:39:47",
      "score": 21,
      "num_comments": 15,
      "upvote_ratio": 0.86,
      "text": "I heard a CEO say that software architecture jobs are going to replace coding jobs, how does it make sense",
      "is_original_content": false,
      "link_flair_text": "Discussion/Advice",
      "permalink": "https://reddit.com/r/softwarearchitecture/comments/1qnaoid/software_architecture_over_coding/",
      "domain": "self.softwarearchitecture",
      "is_self": true,
      "comments": [
        {
          "id": "o1sdlv9",
          "author": "virtualstaticvoid",
          "text": "They don't. Maybe the CEO believes that AI will replace the need for developers coding.",
          "score": 30,
          "created_utc": "2026-01-26 08:58:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1tpj8f",
              "author": "Lazy_Film1383",
              "text": "But he heard a cto say this.. you are more of an architect with agentic development. You handle agents and architect the solution",
              "score": 5,
              "created_utc": "2026-01-26 14:39:36",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1t2ely",
          "author": "BaronOfTheVoid",
          "text": "Don't take CEOs seriously. 90% of their job is guessing. And if they are correct accidentally then they boast how great their foresight and sense of responsibility is.\n\nActually, it would make more sense if AIs replace CEOs than any kind of developer or engineer. Guessing is what AIs are relatively good at.",
          "score": 16,
          "created_utc": "2026-01-26 12:28:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1u7i00",
              "author": "Thin_Driver_4596",
              "text": "There was a study that compared human CEOs with AI for a small sample and found that AI outperformed human CEOs 100% of times, often significantly.",
              "score": 4,
              "created_utc": "2026-01-26 16:01:39",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1tfhq5",
          "author": "beginetienne",
          "text": "Software architecture expertise and business domain expertise goes together.  Good programmers create code that is easy to read and maintain based off decisions made by architects...  Logs that are easy to parse that contain relevant data, proper error handling etc.\n\nA senior programmer will spot gaps in the architects design quickly.  Will the AI do that or will it try to please me?\n\nIf the architect creates garbage context for the AI, you will get garbage results.  It might be more even more difficult for a director/manager to identify who and what is causing the bottleneck in the project.\n\nI guess it can replace some coding jobs but not all.  Everybody is guessing like this CEO, time will tell.  In the business application world (ERPs, WMSs, CRMs, EDI etc) most of the time, bottlenecks are NOT caused by programmers (in my experience).",
          "score": 6,
          "created_utc": "2026-01-26 13:48:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1tpzv9",
              "author": "edgmnt_net",
              "text": ">In the business application world (ERPs, WMSs, CRMs, EDI etc) most of the time, bottlenecks are NOT caused by programmers (in my experience).\n\nThat's true, but it's more of a self-fulfilling prophecy because those businesses *choose* to work on stuff where code has reduced impact. It's a very large niche (possibly the largest), but it's hardly all there is to software development.\n\nIt appears that the CEO is under the impression that all coding is a code monkey job and that architects don't need to concern themselves with such details. I think that's a stretch even in the best case scenario because plenty of such businesses end up accumulating a lot of cruft and tech debt. This only sort of works in an extremely flat, purely horizontally-scaled project, but even then you generally have some sort of central platform which requires being mindful of what you do. As soon as you need to build on top of things and you need to manage complexity because you can't just throw 100 more devs at it, this fails spectacularly.\n\nE.g. you're building something that needs to be relatively safe and secure, which you really cannot do without higher abstraction or special techniques which neither mere architects nor code monkeys know. You can't just throw more simple tests at it. It's far, far more likely you need something deeply-embedded into the code and it has to be something which can be reasoned about.",
              "score": 3,
              "created_utc": "2026-01-26 14:41:54",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1sqnko",
          "author": "Consistent-Ad-180",
          "text": "Maybe,they think about a software architect + copilot.   \n  \nWhat is the problem of regular developer when they start a new project?  \n\\- They choose the technology they know, not the best for the needed work.  \n\\- They prompt to make that function and then make another. And everything become tigh coupled and impossible to read and manage.\n\nI started courses in \"archmentor.dev\" and there are a lot of examples of how to think in tehnologies and solutions, not in code. Because the developer knows how to code. The architect knows what to choose.",
          "score": 3,
          "created_utc": "2026-01-26 10:56:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1wjuuh",
          "author": "GrogRedLub4242",
          "text": "CEO jobs can be replaced with LLM chatbots",
          "score": 3,
          "created_utc": "2026-01-26 22:07:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1tq6lk",
          "author": "Gunny2862",
          "text": "CEOs have way more of a hive mind than you would think.",
          "score": 3,
          "created_utc": "2026-01-26 14:42:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1to7iq",
          "author": "Constant_Physics8504",
          "text": "Well architects and designers write requirements. There is a goal for requirements to be written as prompts to AI and for SWE teams to be dwindling",
          "score": 2,
          "created_utc": "2026-01-26 14:32:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ukq7t",
          "author": "Training_Bug2340",
          "text": "It does make sense to me",
          "score": 2,
          "created_utc": "2026-01-26 16:58:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1uumqx",
          "author": "the-fluent-developer",
          "text": "This is based on the notion that AI will automate away some or even all of the coding. Plus we need strong boundaries to reduce the blast radius of code changes that are made by AI without thorough human inspection.",
          "score": 2,
          "created_utc": "2026-01-26 17:41:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o24xzz8",
          "author": "Mysterious-Rent7233",
          "text": ">I heard a CEO say that software architecture jobs are going to replace coding jobs, how does it make sense\n\nMy own work has transitioned from 10% architecture to 90% coding to 80% architecture 20% coding due to AI. (putting aside all other aspects like communication, prioritization, etc.)\n\nSo yeah, that's one example of a software architecture job replacing a coding job.",
          "score": 1,
          "created_utc": "2026-01-28 02:05:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o29k18l",
          "author": "Sarwen",
          "text": "It doesn't. Actually not much of what is said about AI does. From experience, we can think of AI as a multiplier. It multiplies your productivity if and only if you know how to use it correctly. But it also multiply your flaws! Messy architecture get even uglier with agents able to produce hundreds of lines per minutes.\n\n\nAI is like driving a car at 200km/h. You arrive sooner only if you know how to drive your car at that speed. Otherwise you arrive in heaven.",
          "score": 1,
          "created_utc": "2026-01-28 18:50:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1t0a5b",
          "author": "Big_Conflict3293",
          "text": "If you don’t understand how ai is doing all of this, you’re already behind. ",
          "score": -1,
          "created_utc": "2026-01-26 12:13:27",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qr6byf",
      "title": "Configuration behaves like code at runtime — but we don’t design it like code. Why?",
      "subreddit": "softwarearchitecture",
      "url": "https://www.reddit.com/r/softwarearchitecture/comments/1qr6byf/configuration_behaves_like_code_at_runtime_but_we/",
      "author": "FreePipe4239",
      "created_utc": "2026-01-30 14:04:30",
      "score": 21,
      "num_comments": 22,
      "upvote_ratio": 0.89,
      "text": "In most modern systems, configuration is:\n- parsed\n- validated (sometimes)\n- interpreted\n- and directly affects runtime behavior\n\nYet compared to application code, config usually has:\n- weaker type guarantees\n- fewer correctness checks\n- limited tooling\n- poor failure visibility\n\nThis seems to be a recurring root cause in incident postmortems.\n\nFrom a software architecture perspective:\nWhy do we still treat configuration as second-class compared to code?\nIs this a tooling gap, a design tradeoff, or something else?\n",
      "is_original_content": false,
      "link_flair_text": "Discussion/Advice",
      "permalink": "https://reddit.com/r/softwarearchitecture/comments/1qr6byf/configuration_behaves_like_code_at_runtime_but_we/",
      "domain": "self.softwarearchitecture",
      "is_self": true,
      "comments": [
        {
          "id": "o2lv7y3",
          "author": "PabloZissou",
          "text": "Serious applications would validate the validity of its config and exit if that validation fails. I don't think this is a general problem but project specific.",
          "score": 13,
          "created_utc": "2026-01-30 14:22:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2mgws5",
              "author": "Jedkea",
              "text": "Exiting does not solve the problem though in and of itself. If you rollout a change to a bunch of clusters and they all fail to start, well now the whole thing is down.\n\nAlso the config might be valid in one place, but invalid in another. Things like incorrect network addresses are an example.",
              "score": 3,
              "created_utc": "2026-01-30 16:04:20",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2naxsq",
                  "author": "Pto2",
                  "text": "Rollback then? Code could also fail.",
                  "score": 3,
                  "created_utc": "2026-01-30 18:17:41",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o2rphbr",
              "author": "ryan_the_dev",
              "text": "Every single application I work on, this is a requirement. Configuration is validated on startup and application fails if invalid.",
              "score": 2,
              "created_utc": "2026-01-31 10:38:39",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2wrwtk",
                  "author": "hxtk3",
                  "text": "Yes but there's a valid point that if you update a config map, every pod sees the changes more or less instantly (although they probably don't act on the changes until the process restarts), which is very different from how you'd roll out a code change (update the container image target, which would trigger a rolling replacement of the deployment with the new image).\n\nConfiguration changes are (often by design, as a feature) synchronized replacements of resources rather than gradual rollouts. Most of the big tech outages from the 2010s that you heard about if you don't work at the company that had them are caused by bad configuration updates, and we're not categorically done with them; one of Cloudflare's big outages last year was identified as an argument for them to universally implement gradual configuration rollouts because that would have averted it.",
                  "score": 2,
                  "created_utc": "2026-02-01 03:34:04",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o2o44hx",
              "author": "gaelfr38",
              "text": "Same feeling here. This doesn't sound like a general problem to me at all.",
              "score": 1,
              "created_utc": "2026-01-30 20:29:45",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2lskv2",
          "author": "FreePipe4239",
          "text": "One thing I keep noticing is that config often gets validated only syntactically,\nnot semantically — the system accepts it, but behaves very differently than intended.\n\nCurious if people here have seen languages, frameworks, or tooling\nthat actually close this gap effectively.",
          "score": 6,
          "created_utc": "2026-01-30 14:09:10",
          "is_submitter": true,
          "replies": [
            {
              "id": "o2ltbt1",
              "author": "flavius-as",
              "text": "Of course, I've seen this compiled and validated semantically, it's called a programming language.\n\nInstead of writing it in yaml or whatever other error prone semi-formal language, write it in a strongly typed language.",
              "score": 3,
              "created_utc": "2026-01-30 14:12:58",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2lwono",
          "author": "systemic-engineer",
          "text": "I always really, really liked dhall.  \nAnd never had the opportunity to use it in anger.\n\nhttps://dhall-lang.org/",
          "score": 3,
          "created_utc": "2026-01-30 14:29:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2m1yo6",
          "author": "ewoolly271",
          "text": "Great question. At multiple jobs, I’ve been told the business users need to have direct control over the application. But then, we get a ton of problems because they don’t fully understand how the config changes interact with the application. \n\nSo you have to trust the business users to communicate their changes, test them, time them with releases, etc\n\nHow is that any better than, say, working with them to update a YML or JSON file with CI/CD? It’s not. Doesn’t save any time or energy. It’s just engineering leaders being too weak to tell the business leaders it’s a bad idea",
          "score": 1,
          "created_utc": "2026-01-30 14:55:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2meunm",
          "author": "violentlymickey",
          "text": "One consideration is that config can be changed easily whereas code may need to be redeployed or rebuilt. I think you should always reasonably validate your config though, and many libraries exist to do that.",
          "score": 1,
          "created_utc": "2026-01-30 15:55:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2mxy0k",
          "author": "Physical-Compote4594",
          "text": "One of the (many) awesome things about Lisp is that configuration files are just code, because in Lisp code and data have the same representation.\n\nYou often write Lisp macros to define a DSL for configurations, and that's where you add type guarantees and correctness checks, which can be done with the full power of the language.",
          "score": 1,
          "created_utc": "2026-01-30 17:20:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2o47vh",
          "author": "supercargo",
          "text": "Configuration is a double edged sword.  It increases (runtime) flexibility at the expense of complexity. I don’t think there is any special reason why it doesn’t get treated more rigorously, just the usual: not enough time, not a priority.  Like most tech debt, it’s either strategically appropriate or the risks weren’t understood.\n\nEngineering effort spent on config validators has always been worthwhile in my experience.  If your post mortem root cause is a bad config, the correct next question to ask is “what can we do to reject this config earlier in the process”. Do this a few times and some patterns and best practices should emerge that you can use proactively. Clear error messages are also critical, don’t just reject a config, indicate what is wrong, why it’s wrong, and where in the file.",
          "score": 1,
          "created_utc": "2026-01-30 20:30:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ol7ft",
          "author": "DoubleAway6573",
          "text": "https://mikehadlow.blogspot.com/2012/05/configuration-complexity-clock.html\n\n\nYou remind me this. You are like 4 or 5 o clock.",
          "score": 1,
          "created_utc": "2026-01-30 21:50:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2lwbbi",
          "author": "ukaeh",
          "text": "I’d say look into protobufs for type guarantees and checks/tooling etc. As a good starting point.\n\nAnother aspect is indeed a lack of design - configs get (re)used across layers/stack likely when they mean different things semantically and that is 100% a trade off for simplicity whether or not that’s intentional. For example, configuration (and/or parts of) should never be in limbo but often systems end up with things like ‘oh these fields aren’t setup yet’ which is mostly a design issue.",
          "score": 1,
          "created_utc": "2026-01-30 14:28:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2lwrnq",
          "author": "Isogash",
          "text": "It really depends on how you view config.\n\nIf you view the system as a whole and are only concerned with delivery of a specific business behaviour e.g. in a bespoke enterprise system, then \"config\" is just another part of delivering that behaviour, and so its distinction from code is not that clear.\n\nInstead, if you view the system as being something configurable, and the config as specific to a particular deployment or use case e.g. for different environments, products or users, then the distinction is quite clear: your system should accept all valid combinations of configuration, and whether or not the config is correct for the end user is something *they* should be testing.\n\nEither way, I don't disagree that file-driven config could benefit from some of the features of programming languages, and that users should have tests that their configuration is correct for their intended use case.",
          "score": 1,
          "created_utc": "2026-01-30 14:30:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2lvb56",
          "author": "jhartikainen",
          "text": "There's lots of places which handle configs as code. JS/TS projects is one, but I guess those don't really give you a lot of guarantees about anything. I vaguely recall seeing some Haskell projects using regular Haskell code as configs as well, where you can get fairly strong guarantees of the correctness.\n\nI guess the biggest issue is that configs usually are intended to be something you can modify without needing to recompile the whole project. Making them code often kinda gets in the way of that.",
          "score": 1,
          "created_utc": "2026-01-30 14:23:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2m3ciu",
          "author": "Adorable-Fault-5116",
          "text": "This is because XML was seen as uncool, and JSON / YAML took off as configuration because how nice it was for a developer to read was prioritised over correctness.\n\nThese days I think the way to solve this, since we aren't going back, is to just make configuration code. Then you can a) not annoy developers will scary ugly text, b) have strong typing etc.",
          "score": 1,
          "created_utc": "2026-01-30 15:02:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2rkzjh",
              "author": "One_Elephant_8917",
              "text": "Exactly xml had schema that validates it, compared to json",
              "score": 1,
              "created_utc": "2026-01-31 09:55:46",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o2s740i",
              "author": "redisgreener",
              "text": "While not as expressive as XSD, JSON does have [JSON Schema](https://json-schema.org).",
              "score": 1,
              "created_utc": "2026-01-31 13:04:46",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2q6qft",
          "author": "klimaheizung",
          "text": "We do. Just use the right programming language, that's all there is to it.",
          "score": 0,
          "created_utc": "2026-01-31 03:09:31",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qp2ifs",
      "title": "How do you automate your architecture inner loop?",
      "subreddit": "softwarearchitecture",
      "url": "https://www.reddit.com/r/softwarearchitecture/comments/1qp2ifs/how_do_you_automate_your_architecture_inner_loop/",
      "author": "vmgolubev",
      "created_utc": "2026-01-28 05:23:50",
      "score": 20,
      "num_comments": 12,
      "upvote_ratio": 0.95,
      "text": "Hi!\nRecently I realized that my current approach with ADRs and diagrams in drawio sucks:)\nDrawio is great at the beginning, but after some time it becomes hard to manage with updates in all of the c4 diagrams that was created.\nI want to have the same experience as developer - think, write, commit! Any advice on tools that might help me? ",
      "is_original_content": false,
      "link_flair_text": "Discussion/Advice",
      "permalink": "https://reddit.com/r/softwarearchitecture/comments/1qp2ifs/how_do_you_automate_your_architecture_inner_loop/",
      "domain": "self.softwarearchitecture",
      "is_self": true,
      "comments": [
        {
          "id": "o27jxge",
          "author": "ch1pch4p",
          "text": "Without you defining what truly is \"inner loop architecture\", I'll assume you mean \"you architechting on your own, regardless if it's been shared or not.\" \n\nYou can take a crack at mermaid/puml. Text based diagramming. What you lose (or just becomes a bit hard) on the placement of the diagram you gain in text based work: proper source control, quick interations, etc.\n\nMermaid is also rendered in github so that's helpful for devs, not quite for business. You could make a github action, though, to bundle and export your diagrams to pdf or use your doc repo (I'm thinking Confluence) API to update pages. I know draw io can take in mermaid docs as import, so you may need to get creative on how the rubber meets the road on that one.\n\nI use dendron for all my notes. Dead repo now, but still useful in current form. Use schemas to organize your thoughts, and use the lookup to find what you were working on faster.\n\nI'm a text based guy at heart - I figure if I can describe what I know, well, in words, pictures can augment the information.\n\nI say all this, typing on my phone, with highly questionable grammar haha",
          "score": 3,
          "created_utc": "2026-01-28 13:21:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2argg6",
              "author": "HandsOnArch",
              "text": "Architecture as Code (Structurizr etc) gives you a dev-like workflow, but you’ll still need draw.io for many stakeholders.\nPersonally, I find the update effort in draw.io negligible, since architecture changes are usually rare and very deliberate.",
              "score": 2,
              "created_utc": "2026-01-28 22:02:25",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o27tvae",
              "author": "never-starting-over",
              "text": "Seconded on mermaid.\n\nThey even have a (kinda janky) visual editor at https://mermaid.live/play\n\nI also use LLMs to help mr write documentation and I think diagrams as text really help them understand what I'm conveying.\n\nWith that said, I wanted so hard for PlantUML to work, but the extra setup required and no native integration with GitHub just makes it a shoehorn choice for the kind of businesses I work with. How I wish it were as batteries included and supported as mermaid is on GitHub and Notion.",
              "score": 1,
              "created_utc": "2026-01-28 14:14:27",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2cvnzo",
                  "author": "[deleted]",
                  "text": "[removed]",
                  "score": 1,
                  "created_utc": "2026-01-29 04:57:21",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o27wa48",
                  "author": "ch1pch4p",
                  "text": "LLM are a force multiplier, for sure. \n\nI'd recommend using a local plug-in in vscode. I hate dumping ideas into the internet... You lose control of them.\n\nFor puml, try the jetty server with docker. It really is a breeze to set up if you haven't tried. But.. Yea no github rendering, so if that's your jam, then skip it.",
                  "score": -1,
                  "created_utc": "2026-01-28 14:26:42",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o28ji2h",
          "author": "SolarNachoes",
          "text": "Likec4 (use AI to spin up a vite app)\n\nD4\n\nMermaid\n\nPlantUML\n\nI use AI now exclusively to edit said documents. Either from scratch or from an exiting app.",
          "score": 0,
          "created_utc": "2026-01-28 16:13:30",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qmw7bi",
      "title": "We’ve given up on keeping our initial arch docs up to date. Should I worry? Or are we setting ourselves up for pain later?",
      "subreddit": "softwarearchitecture",
      "url": "https://www.reddit.com/r/softwarearchitecture/comments/1qmw7bi/weve_given_up_on_keeping_our_initial_arch_docs_up/",
      "author": "Independent-Run-4364",
      "created_utc": "2026-01-25 21:34:34",
      "score": 15,
      "num_comments": 8,
      "upvote_ratio": 1.0,
      "text": "At my current team, we started out with decent arch docs “how the system works” pages. But then we shipped for a few weeks, priorities changed, a couple of us made small exceptions and now we don't use them anymore and they r lost in time.\n\nAs the one who’s supposed to keep things running long term, I’m not sure if this is just normal and harmless, or if it's gonna hurt us later.\n\nIf you’ve been in this situation: should we just accept it? If not when could it start to cause problems?",
      "is_original_content": false,
      "link_flair_text": "Discussion/Advice",
      "permalink": "https://reddit.com/r/softwarearchitecture/comments/1qmw7bi/weve_given_up_on_keeping_our_initial_arch_docs_up/",
      "domain": "self.softwarearchitecture",
      "is_self": true,
      "comments": [
        {
          "id": "o1p7wpq",
          "author": "Seawolf87",
          "text": "Put a few hours in every other sprint. Make it intentional and time boxed. It doesn't have to be a slog or an every day thing. Just trying your best will begin to develop good habits for the team. Slightly delayed docs are better than no docs.\nEdit: Definitely don't assign this to the same person every time, spread the load so it feels fair",
          "score": 9,
          "created_utc": "2026-01-25 21:51:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1pr7xy",
          "author": "SolarNachoes",
          "text": "Do you have retrospectives? That’s a good time to do a quick Q/A on any major architectural changes. Then you can go update docs and then update the team.\n\nOr you can use AI now to analyze recent changes and create a summary.",
          "score": 7,
          "created_utc": "2026-01-25 23:17:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1qeakh",
          "author": "anotherchrisbaker",
          "text": "Someone needs to own the arch docs. That doesn't mean they need to do all the updates themselves, but they're on the hook of they get out of date",
          "score": 2,
          "created_utc": "2026-01-26 01:10:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1s7ywi",
          "author": "Ambitious_Fruit6231",
          "text": "It causes problems further down the line when team members believe none of the documentation can be trusted. This may or may not be true ( perhaps 60% is still valid) but once people think that way they don't read or trust it and it becomes of no value. And then everyone is just poking around in the code. \n\nI know it sounds obvious, but try to focus on the big / important stuff and ensure it keeps up to date. If possible partition / organize it accordingly so it's easier to manage and keep the top level stuff separate and 100% correct.",
          "score": 1,
          "created_utc": "2026-01-26 08:07:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1sgulo",
          "author": "vladis466",
          "text": "I disagree with the other comments. As long as there is a way to trace the evolution of the arch- 90% of the value is in people putting thoughts down in a coherent way to agree on a strategy.",
          "score": 1,
          "created_utc": "2026-01-26 09:28:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1yq57b",
          "author": "Qinistral",
          "text": "Hate to say it but this is something AI is pretty decent at. You can make a rule to have AI do it when it makes changes or on PR, or just do it ad-hoc. Point it at your recent set of tickets/prs and say \"update these docs\".",
          "score": 1,
          "created_utc": "2026-01-27 05:13:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1zbhkq",
          "author": "HenryWolf22",
          "text": "It’s normal early on, but gaps compound. Missing docs hurt onboarding, debugging, and scaling. Even minimal updates prevent future headaches. Schedule lightweight reviews to keep them usable.",
          "score": 1,
          "created_utc": "2026-01-27 08:05:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1zc694",
          "author": "virtualstaticvoid",
          "text": "Yes, there will be pain. \n\nI've found that including documentation  with our ADRs, not only provides a log of the architecture changes, but also the context, so they remain relevant and don't need to be updated to make sense. \n\nThen, when the architecture changes, you add a new ADR and new documentation as part of the work to implement. \n\nInclude the time needed as part of the task / ticket / story points, etc.",
          "score": 1,
          "created_utc": "2026-01-27 08:12:03",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qsqft5",
      "title": "Architecture for beginners",
      "subreddit": "softwarearchitecture",
      "url": "https://www.reddit.com/r/softwarearchitecture/comments/1qsqft5/architecture_for_beginners/",
      "author": "EviliestBuckle",
      "created_utc": "2026-02-01 06:05:06",
      "score": 12,
      "num_comments": 12,
      "upvote_ratio": 0.93,
      "text": "Are there any recommended resources for beginners to study and understand and start their journey towards software architects?\n\nBackground: worded in frontend and backend with just basic crud api\n\nExperience: 4yrs but afraid to have a repeated 1 year of experience for four years. Need to justify my experience after 10 years",
      "is_original_content": false,
      "link_flair_text": "Discussion/Advice",
      "permalink": "https://reddit.com/r/softwarearchitecture/comments/1qsqft5/architecture_for_beginners/",
      "domain": "self.softwarearchitecture",
      "is_self": true,
      "comments": [
        {
          "id": "o2xdkiw",
          "author": "coffeemahn",
          "text": "Books\n\nDesigning Data Intensive Applications,\nSoftware Architecture the hard parts\n\nEdit: added comma",
          "score": 16,
          "created_utc": "2026-02-01 06:06:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2xezyq",
              "author": "EviliestBuckle",
              "text": "Okokokok.",
              "score": 2,
              "created_utc": "2026-02-01 06:17:57",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2xp8jl",
                  "author": "GMKrey",
                  "text": "Btw “Software Architecture: The Hard Parts” is actually a sequel. There’s a fundamentals book you should read first",
                  "score": 2,
                  "created_utc": "2026-02-01 07:47:58",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o2xgqry",
              "author": "EviliestBuckle",
              "text": "Is there any practical application resources on these?",
              "score": 2,
              "created_utc": "2026-02-01 06:32:35",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2xls2d",
          "author": "MatchLittle5000",
          "text": "I would advise these books:\n\n1. Clean Architecture.\n2. Designing Data Intensive Applications.\n3. Learning Domain Driven Design (good intro).\n4. And some book describing how to operate on Staff+ roles effectively.",
          "score": 3,
          "created_utc": "2026-02-01 07:16:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2xj7it",
          "author": "HurricaneCecil",
          "text": "I focused on architecture during my SWE master’s, here’s how it was taught:\n\nbasics: read Just Enough Software Architecture by George Fairbanks and then discuss the 4 + 1 View Model of Software Architecture by Philippe Krutchen. It helps if you have a real-life project to look through and talk about.\n\nintermediate: read Fundamentals of Software Architecture by Mark Richards and Neal Ford and Patterns of Enterprise Application Architecture by Martin Fowler.\n\napplication: here we used Enterprise Integration Patterns as a guide and built a semester long project with source control and CI/CD. I thought “practicing” architecture with realistic tooling was super valuable\n\nadvanced: reading research papers on more specific and niche topics. ACM TOSEM and IEEE TSE are decent sources, Distributed Computing from Springer is cool if you want to get very specific and very technical.",
          "score": 2,
          "created_utc": "2026-02-01 06:53:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2xexh0",
          "author": "Great_Pattern_1988",
          "text": "SEI offers a certificate in Software Architecture.  Three courses that contain an actionable process to creating and evaluating software architectures.  Best course I've ever taken.",
          "score": 1,
          "created_utc": "2026-02-01 06:17:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2xf2j6",
              "author": "EviliestBuckle",
              "text": "Can you plz share the respective link?",
              "score": 1,
              "created_utc": "2026-02-01 06:18:32",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2xfys2",
                  "author": "Great_Pattern_1988",
                  "text": "https://www.sei.cmu.edu/credentials/sei-software-architecture-professional-certificate/",
                  "score": 2,
                  "created_utc": "2026-02-01 06:25:59",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2xfbyw",
          "author": "sdsdkkk",
          "text": "I read the Architecture of Open Source Application book about 10 years ago to improve my architecture knowledge. But my primary focus at the time was to understand how influential real-life software projects were designed and architected.\nhttps://aosabook.org/en/",
          "score": 1,
          "created_utc": "2026-02-01 06:20:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2xg3yf",
              "author": "EviliestBuckle",
              "text": "Same motivation here. Actually here in subcontinent no one get to work on high impact software",
              "score": 1,
              "created_utc": "2026-02-01 06:27:11",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2xoa1u",
          "author": "gbrennon",
          "text": "Books",
          "score": 1,
          "created_utc": "2026-02-01 07:39:12",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qqsg3o",
      "title": "Feeling pigeonholed as an “Integration Engineer”, how to reposition into real engineering roles without starting from scratch?",
      "subreddit": "softwarearchitecture",
      "url": "https://www.reddit.com/r/softwarearchitecture/comments/1qqsg3o/feeling_pigeonholed_as_an_integration_engineer/",
      "author": "BinariesGoalls",
      "created_utc": "2026-01-30 02:07:05",
      "score": 11,
      "num_comments": 9,
      "upvote_ratio": 1.0,
      "text": "Hey folks,\n\nI could really use some perspective from more experienced people here.\n\nI’m a professional with \\~5 years of experience in tech, the last 3 working as a Data/Systems Integration Specialist at a SaaS company.\n\nMy job on this company is basically to onboard new customers by integrating their data, from ERPs, databases, APIs, and third-party systems, into our platform.  Basically a post-sale software delivery developer job. This involves reading API docs, handling authentication, data mapping, validation, troubleshooting failed requests, supporting integrations running in production, etc.\n\nSo I work with REST APIs, Postman, SQL, JSON/XML, webhooks, error handling, etc. on a daily basis.\n\nThe problem is: lately I’ve startied to feel heavily pigeonholed as “the integration guy”.\n\nI don’t build applications from scratch.  \nI don’t build systems end-to-end.  \nI don’t design architectures.  \nI don’t write large codebases.\n\nAnd when I look at the market, especially internationally (I'm from Brazil), I see two very different paths:\n\n* SWE / Backend / Fullstack → clear growth ladder\n* Integration / Implementation → often seen as operational, repetitive, and not “real engineering”\n\nBut at the same time, I’ve seen many roles like Solutions Engineer that look very aligned with what I do, but at a much deeper technical/architectural level.\n\nI realized my issue might not be the career itself, but the level at which I’m operating.\n\nIt feels like I entered the right field through the wrong door.\n\nInstead of evolving into someone who understands systems, architecture, APIs deeply and can design integrations, I just became good at executing systems integrations.\n\nIt took a couple of years, but now I’m trying to correct that.\n\nI think my current goal is not to switch to full backend/SWE roles and \"restart\" my career. I want to evolve into a stronger Integration / Solutions / Systems Engineer, the kind that is valued in the market.\n\nSo, for those of you who have seen or worked with this type of role:\n\n* What should I study to move from “integration executor” to “solutions engineer”?\n* What technical gaps usually separate these profiles?\n* What kind of projects or knowledge would reposition me correctly?\n* Is this a viable path, or is it truly a career dead-end?\n\nI’d really appreciate guidance from people who’ve seen this from the inside.\n\nThanks a lot.",
      "is_original_content": false,
      "link_flair_text": "Discussion/Advice",
      "permalink": "https://reddit.com/r/softwarearchitecture/comments/1qqsg3o/feeling_pigeonholed_as_an_integration_engineer/",
      "domain": "self.softwarearchitecture",
      "is_self": true,
      "comments": [
        {
          "id": "o2j10l6",
          "author": "systemic-engineer",
          "text": "Give me a rundown of a typical day right now. \n\nThen give me a rundown of what you imagine your day would look like, if you were to switch. \n\nWhat's the delta?  \nWhich changes would you expect?  \nWhere do you see growth potential?  \n\n\nSoftware engineers are ambiguity resolvers.  \nWe solve human problems through technology.  \n(And if we're not careful we add problems.)\n\nHow do you solve problems right now?  \nHow do you wish you'd solve them?",
          "score": 3,
          "created_utc": "2026-01-30 02:17:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2j8mjb",
              "author": "FearlessAmbition9548",
              "text": "What’s a rundown",
              "score": 2,
              "created_utc": "2026-01-30 02:59:26",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o2jbxw3",
              "author": "BinariesGoalls",
              "text": "A typical day for me today is very post-sale and demand-driven.\n\nI work for a company that provides an AI-based platform of inventory optimization for retailers , and I’m the person responsible for all customer data integrations for my country.\n\nWhenever a new customer comes in, I run technical discovery meetings with them to understand how their data is structured, ERPs, APIs, databases, file exports, whatever they use.\n\nOn our side, we already have a defined data blueprint, a very specific data requirement model that our system expects. My job is basically to design and build a simple pipeline that extracts the customer’s data and transforms it into that required format so our platform can consume it.\n\nSo most of my work is about:\n\n- Reading and understanding ERP/API documentation.\n\n- Figuring out where each required data point lives in the customer system.\n\n- Handling authentication, endpoints, formats.\n\n- Building data pipelines that extract, transform and load the data.\n\n- Aligning business rules with the client for each data type.\n\n-Troubleshooting production issues and handling integration tickets.\n\nI don’t work on the core product design. I don’t design APIs. I don’t build systems end-to-end.\n\nI work almost exclusively on the ingestion side, moving and shaping data so it fits into an existing system.\n\nWhat I’m looking for next is the opportunity to work on a wider variety of problems, architectures and platforms instead of repeatedly solving the same integration pattern around a single product.\n\nToday, my work is constrained by the fact that every solution must ultimately fit into one predefined system. \n\nThat means most of my effort goes into adapting external systems to match our platform’s requirements.\n\nWhat I want is to design integrations and solutions end-to-end, with more flexibility to evaluate the customer’s scenario and define the best technical approach for that context.\n\nInstead of always asking “how do I make this system fit ours?”, I want to be able to ask “what is the best way to connect these systems together?”\n\nI’m very motivated by the challenge of working with different architectures, different stacks, and different integration strategies depending on the problem, APIs, databases, data pipelines, middleware, cloud services, or whatever makes the most sense technically.\n\nRight now, I specialize in making one platform work with many different customer environments.\n\nI want to evolve into a role where I use that same experience to design solutions across many platforms and scenarios.\n\nThat’s where I see the growth potential.",
              "score": 2,
              "created_utc": "2026-01-30 03:18:18",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2lba6d",
                  "author": "systemic-engineer",
                  "text": "Thank you for taking the time.  \n\nI read that you want to work more end2end.  \nAnd that you're still interested in connecting systems. \n\nI'm intrigued.  \nAnd busy. \n\nI'll write a longer response later. 🌈",
                  "score": 1,
                  "created_utc": "2026-01-30 12:30:31",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2j251b",
          "author": "macromind",
          "text": "This is a super common spot to be in, and its not a dead end if you move up the abstraction level.\n\nThe solutions/architecture jump usually means: drawing the system boundaries, defining contracts, handling non-functional requirements (latency, failure modes, security), and making tradeoffs explicit.\n\nIf you want to study topics that map directly: distributed systems basics, API design, event-driven architecture, and practical integration patterns (outbox, saga, idempotency keys).\n\nSmall suggestion too: write 1 short architecture note per week about something you handled at work, even anonymized. Its surprisingly powerful for interviews. If youre batching content, something like https://www.promarkia.com/ can help you schedule it and keep momentum.",
          "score": 3,
          "created_utc": "2026-01-30 02:23:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2jdg8n",
          "author": "Charming-Raspberry77",
          "text": "It is not a dead end, but you are not on the path to being a software engineer. This article sums it up real well and offers advice: https://www.noidea.dog/glue",
          "score": 1,
          "created_utc": "2026-01-30 03:26:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2jmzw8",
          "author": "macromind",
          "text": "Architecturally, you are already close, you just need to shift from task execution to designing the patterns. Learn and apply a few core concepts: canonical data model vs point to point mappings, versioning strategy, idempotency keys, replayability, and explicit contracts (OpenAPI, AsyncAPI). Also get comfortable with documenting tradeoffs and constraints, that is basically the job. If you can lead a discovery call, propose 2 options, and explain the risks in plain language, you are in solutions territory. And if you are writing those learnings up, batching and scheduling them makes it sustainable, https://www.promarkia.com/ can help with that.",
          "score": 1,
          "created_utc": "2026-01-30 04:24:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2rqizp",
          "author": "OptionalEmotion",
          "text": "You are in a better spot compared to a traditional software engineer. I started in development only to move to devops and later into cloud solutions engineering. Higher level roles such as tech lead or architect requires what you already do day to day. You can switch to a tech lead role for a smaller company data team and execute the delivery of one team while helping them develop the solution inside the system boundary you defined. You can take over the integration of that team's solution into the rest of the business, which is literally what the job of a tech lead is.",
          "score": 1,
          "created_utc": "2026-01-31 10:48:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2wtp8n",
          "author": "engiNARF",
          "text": "I'm an electrical engineer but I was in a similar spot early in my career. I found myself in an IT support job I was \"meh\" about but wanted to do \"real engineering\".  What I did was to slowly take roles that leveraged my current experience but had more and more overlap with circuit design. It took a while but along the way I was always able to ask for a higher salary (because I always had relevant experience) and I got to see different aspects of engineering.   \n  \nI actually found that while design work is rewarding in its own way, the role has a different vibe from customer facing roles. I personally find that in customer facing roles I get to solve technically challenging issues but don't have to deal with as much office politics. Often I find more of a teamwork mindset among coworkers (even the Sales guys) when in a Support role. Obviously it depends on the company but I've seen similar dynamics at my past 2 employers. \n\nNow my job has a mix of design work and customer support which I'm pretty pleased with. Hope you find what you're looking for!",
          "score": 1,
          "created_utc": "2026-02-01 03:45:28",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qnsteg",
      "title": "Probabilistic Processing Unit (PPU) — exact inference over massive discrete networks without sampling.",
      "subreddit": "softwarearchitecture",
      "url": "https://www.reddit.com/gallery/1qnsteg",
      "author": "Undo-life",
      "created_utc": "2026-01-26 21:01:28",
      "score": 11,
      "num_comments": 8,
      "upvote_ratio": 0.79,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Discussion/Advice",
      "permalink": "https://reddit.com/r/softwarearchitecture/comments/1qnsteg/probabilistic_processing_unit_ppu_exact_inference/",
      "domain": "reddit.com",
      "is_self": false,
      "comments": [
        {
          "id": "o1wb1qu",
          "author": "fabkosta",
          "text": "Sounds cool, but without any explanation whatsoever it's not really understandable what you did. You might want to share more details on the idea to get any engagement.",
          "score": 8,
          "created_utc": "2026-01-26 21:27:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1we4dt",
              "author": "Undo-life",
              "text": "Yeah so the core thing is probabilistic computing, what I did is just how probabilistic computing would be if it was purely on software: \n1.Core idea\nInstead of sampling (Monte-Carlo) or pretending everything is 0/1, I treat the whole puzzle as one big Bayesian network: 729 nodes (9 rows × 9 cols × 9 digits). Each node is a probability, 0-1.\n2.How it solves\nI wire up Sudoku rules as factors: “exactly one 5 in this row”, “exactly one 3 in this box”, etc. Then I run exact belief propagation—messages bounce around until every probability is consistent. No random numbers, no “maybe”, just closed-form updates.\n3.Why it’s fast\nBecause it’s exact, it converges in 3-4 iterations. No 100k samples to average out. My laptop (old Pentium) finishes in 0.3s; 100k MC samples still leave a 66% error rate after 5s.\n4.Current limits\nOnly works on finite discrete variables (so Sudoku is perfect). Continuous stuff needs discretisation → explosion of states. That’s the next hill to climb.",
              "score": 2,
              "created_utc": "2026-01-26 21:41:24",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1wfsuy",
          "author": "Undo-life",
          "text": "Op here I think the post got quite confusing but but I'll try to wrap up the core idea, I built a custom inference engine to see if a \"probabilistic\" approach could beat standard sampling on a classic constraint problem. As a test, I used Sudoku.\n\nThe method in simple terms:\n\n1. Model the puzzle as a network of 729 binary variables (81 cells x 9 digits).\n2. Encode the Sudoku rules as constraint equations linking these variables.\n3. Run a message-passing algorithm: each variable and constraint exchanges local probability updates.\n4. After a few iterations, the probabilities converge to 0% or 100%, giving the exact solution.\n\nThe result:\n\n· My method: 0.30695 seconds, 100% accuracy.\n· Monte Carlo (100k samples): 4.94645 seconds, ~33.3% accuracy.\n\nWhat this suggests:\nThe benchmark shows that for this structured problem, exact probabilistic inference via message-passing can be faster and more reliable than random sampling, even when simulated on conventional hardware.\n\nWhy I'm posting:\nThis is an early prototype. The underlying algorithm (a form of belief propagation on a factor graph) is known, but the efficiency on this problem was striking to me. I'm exploring if this approach generalizes to other domains like decoding or verification.\n\nI'm happy to discuss the algorithm details, the benchmark setup, or potential next problem domains.",
          "score": 2,
          "created_utc": "2026-01-26 21:48:49",
          "is_submitter": true,
          "replies": [
            {
              "id": "o1ym7vy",
              "author": "JrSoftDev",
              "text": "Congrats on doing something, and this sounds cool.\n\nAs people mentioned in your other post, it's not clear why would Monte Carlo be the best benchmark here. Doesn't look like the right problem for MC.\n\nIn other comment you mentioned the explosion of states as the next hill to climb... but that's a hill impossible to climb, isn't it? Maybe you'll find some problems that appear to be exponential but then they have some intrinsic structure that makes them more tractable, but I'm assuming that's the type of information about a problem that we can get beforehand.\n\nI would like to see how you're passing those messages and how each node handles them and enforces the known constraints.\n\nAlso, for more on Sudoku solvers specifically, this seems to be the right place to look [https://github.com/t-dillon/tdoku](https://github.com/t-dillon/tdoku)\n\nYour exploration for applications to other problems is interesting, I hope that brings you joy and other good things, and keep sharing your findings.",
              "score": 1,
              "created_utc": "2026-01-27 04:46:44",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1z0yuk",
                  "author": "Undo-life",
                  "text": "Thanks, and it's less about benchmarking the speed and more about solving it probabilistically, but your right that on a cpu the state explosion is a hill, but I think on a real ppu circuit, the nodes will talk among themselves simulatainiously so it won't won't be a problem, but right now it's just me simulating all of that on a cpu",
                  "score": 2,
                  "created_utc": "2026-01-27 06:35:33",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1yvdu6",
          "author": "DeterminedQuokka",
          "text": "I mean it’s interesting you are solving a deterministic problem with probability which is slightly over engineered but it’s also cool. \n\nI do similar things with Japanese puzzles so I totally get the urge.",
          "score": 1,
          "created_utc": "2026-01-27 05:51:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1z1uoh",
              "author": "Undo-life",
              "text": "Haha using probability on rock-solid Sudoku does feel like bringing a tank to a knife fight. I just wanted to see if the engine could still flex when clues aren’t 100% certain.\n\nWhich Japanese puzzles are you solving tho?",
              "score": 2,
              "created_utc": "2026-01-27 06:42:45",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1wlewt",
          "author": "heatdeathofpizza",
          "text": "[https://x.com/extropic](https://x.com/extropic)",
          "score": 0,
          "created_utc": "2026-01-26 22:14:18",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qq3mvo",
      "title": "Resiliency in System Design: What It Actually Means",
      "subreddit": "softwarearchitecture",
      "url": "https://lukasniessen.medium.com/resiliency-in-system-design-what-it-actually-means-2bc72713ebf5",
      "author": "trolleid",
      "created_utc": "2026-01-29 09:03:47",
      "score": 11,
      "num_comments": 1,
      "upvote_ratio": 0.8,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "Article/Video",
      "permalink": "https://reddit.com/r/softwarearchitecture/comments/1qq3mvo/resiliency_in_system_design_what_it_actually_means/",
      "domain": "lukasniessen.medium.com",
      "is_self": false,
      "comments": [
        {
          "id": "o2io5mb",
          "author": "shufflepoint",
          "text": "What it means for me is that the chaos monkey can do me no harm.",
          "score": 1,
          "created_utc": "2026-01-30 01:05:32",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qqxln7",
      "title": "How do IDEs like Cursor / Antigravity implement diff based code editing with accept/reject option while modifying existing code",
      "subreddit": "softwarearchitecture",
      "url": "https://www.reddit.com/r/softwarearchitecture/comments/1qqxln7/how_do_ides_like_cursor_antigravity_implement/",
      "author": "CapableAd9320",
      "created_utc": "2026-01-30 06:15:03",
      "score": 9,
      "num_comments": 4,
      "upvote_ratio": 0.81,
      "text": "when modifying a exiting code using these tools, instead of rewriting the whole file, the tool proposes changes inline , shows a diff, and lets you **accept/reject** the change (sometimes even per hunk). it feels very similar to `git add -p`.\n\nFrom what I can tell, the rough flow is:\n\n* take the original code\n* LLM generate a modified version\n* compute a diff/patch\n* preview it\n* apply or discard based on user input\n\nI’m interested in implementing this myself (probably as a CLI tool first, not an IDE), and I’m wondering:\n\n* Is this pattern formally called something?\n* how exactly is the modified code/diffs added into the source code\n* how is the accept/reject functionality implemented\n* Are there good open-source tools or libraries that already implement this workflow?\n* How do i go about implementing this",
      "is_original_content": false,
      "link_flair_text": "Discussion/Advice",
      "permalink": "https://reddit.com/r/softwarearchitecture/comments/1qqxln7/how_do_ides_like_cursor_antigravity_implement/",
      "domain": "self.softwarearchitecture",
      "is_self": true,
      "comments": [
        {
          "id": "o2kq4uv",
          "author": "Isogash",
          "text": "Isn't it just using git?",
          "score": 3,
          "created_utc": "2026-01-30 09:38:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2kt98n",
              "author": "ProfessionNo3952",
              "text": "I guess not all time because git diff cannot show difference between each round of code generation if you don’t commit anything",
              "score": -1,
              "created_utc": "2026-01-30 10:07:13",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2ktkc8",
                  "author": "Isogash",
                  "text": "Sure you can, it can commit these to a special branch or stash them, I'm not saying that it has to commit them to your main branch.",
                  "score": 2,
                  "created_utc": "2026-01-30 10:09:57",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qmr85v",
      "title": "Self Referencing Tables vs Closure Tables - Which one would you choose",
      "subreddit": "softwarearchitecture",
      "url": "https://www.reddit.com/r/softwarearchitecture/comments/1qmr85v/self_referencing_tables_vs_closure_tables_which/",
      "author": "LiveAccident5312",
      "created_utc": "2026-01-25 18:34:41",
      "score": 9,
      "num_comments": 9,
      "upvote_ratio": 0.92,
      "text": "I'm trying to create a schema design for large scale multi purpose e-commerce platform and while creating \"categories\" relation I found out that categories are hard to manage because products can have indefinite depth of sub-categories (such as, for Tshirts it can be Apparel -> Men -> Tshirts but for laptops it can be Electronics -> Laptops). So to solve this problem I've found two solutions-\n\n1. using self referencing tables and creating infinite category depth by referencing to parent category\n\n2. using clouser table to add ancestor\\_id and descent\\_id to each category with the depth value.\n\nBoth solutions come with its own advantages and drawbacks. What's your suggestion? Also it would be great if anyone can share his/her experience designing a practical ecommerce database schema.",
      "is_original_content": false,
      "link_flair_text": "Discussion/Advice",
      "permalink": "https://reddit.com/r/softwarearchitecture/comments/1qmr85v/self_referencing_tables_vs_closure_tables_which/",
      "domain": "self.softwarearchitecture",
      "is_self": true,
      "comments": [
        {
          "id": "o1obl7f",
          "author": "sfboots",
          "text": "Don't use option 2 or pure EAV, both are too complicated\n\nA simple Hierarchical model will be fine. (your option 1)\n\n  One thing I've see is for each node to have the string \"full path for display\" to allow UI display without extra queries to read the grandparents etc..  This make adding or editing categories more complicated but can be huge speedup for the more common read case.",
          "score": 5,
          "created_utc": "2026-01-25 19:30:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1o535h",
          "author": "Conscious_Plankton_8",
          "text": "go with option one for the categories works good as i see with my integrations with ecommerce apis that i work with 75% of them uses this approach that is the parent id for sub cats.\n\nthe most challenging thing is the products options and variants and variants types this is the true hell",
          "score": 2,
          "created_utc": "2026-01-25 19:01:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1o61os",
              "author": "LiveAccident5312",
              "text": "How do you manage it (variants, attributes and all). I'm thinking of using the EAV model (an attribute table for managing attributes and one composite table to connect it with products). Maybe a similar model for variants too.",
              "score": 2,
              "created_utc": "2026-01-25 19:05:53",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1o9nw1",
                  "author": "Conscious_Plankton_8",
                  "text": "it is based on how you want to manage things based on my experience it was more complicated than that like each variant can have a price and the main product can have no variant and can have variants with the same price as the main product also the variants can be tight to only one product or not also do we will support packages that is group of a product or not \n\nWE CAN go more deep \n\nbut my recommendation for you is that \ncheck the leaders ecommerce apis like shopify and try to understand the schema they applying \n\nalso go step by step for planning these models after understanding your project requirements for what you are building, There are no right or wrong its based on the use case",
                  "score": 1,
                  "created_utc": "2026-01-25 19:21:41",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o246fdz",
          "author": "severoon",
          "text": "Making this decision boils down to the query patterns you want to support. Collect together all of the ideas for how to structure this data, then all of the query patterns, and figure out the pros and cons of each approach for each query pattern.\n\nOne of the problems with option 1 is that it merges category information and hierarchical structure into the same table, which may not be a good thing over the long term. Option 2 also feels pretty heavyweight depending on the use cases.\n\nYou could think about a middleground, such as having a Categories table that just stores categories with no structure, and a hierarchy table that stores the immediate parent of each category as well as its full list of ancestors (including the immediate parent) as an array type. The advantage here is that you can create a multi-valued index on the ancestor column to allow for efficient querying for subtrees, while the parent column allows for fast querying of immediate children.\n\nIf you have a need to frequently and transactionally change nodes that are roots of large subtrees, this would obviously be disruptive because you need to lock all of the nodes in the subtree to update the ancestor lists. But there are strategies to deal with this, like in normal operation those kinds of changes could be saved up and applied in bulk at a scheduled time. Or, if that's not acceptable, when moving a large subtree you could create a new root node and tombstone the old one, and then move things over a bit at a time using only write locking. (This is an approach that would make sense in the context of a high-traffic, high-load distributed DB.)",
          "score": 2,
          "created_utc": "2026-01-27 23:42:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2fnsuf",
          "author": "gmx39",
          "text": "Actually interesting post",
          "score": 2,
          "created_utc": "2026-01-29 16:22:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1olmbm",
          "author": "therealkevinard",
          "text": "For science, check out the Nested Set Model (and its variants).   \nIt’s a really interesting (big IMO here) pattern for unbounded hierarchies. \n\nTldr: there’s _no_ direct relation (in the FK sense) between parent and child.   \nInstead, all records are assigned a geometric left and right integer value.   \nThe hierarchy, then, is implicitly derived as the set of records whose left and right values are within the bounds of the parent.  \n\nYou can visualize as a wall of legos or a flame graph where left/right draw a block on a coordinate plane, and the blocks that end up stacked on a parent block are child blocks.  \n\nIn numbers:  \nCat1 (0,5)     \nCat2 (6,10)     \nCat1a (1,3)    \nCat1b (2,4)    \n\nThen getting subcats of cat1 is `select id where left >= Cat1.left AND right <= Cat1.right` \n\nAll variants supported unbounded hierarchies- nesting at millions of levels is no sweat.     \n\n*this isn’t a general-purpose model. If it’s the right solution for the app, it’s amazing. If it’s not, you’ll hate every day of it.",
          "score": 1,
          "created_utc": "2026-01-25 20:15:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1ouq0u",
              "author": "LiveAccident5312",
              "text": "This one looks cool but I'm sure that I will end up in the situation you mentioned in the last.☠️",
              "score": 1,
              "created_utc": "2026-01-25 20:54:45",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qrfrmp",
      "title": "What architecture as code tools you are using, besides AI?",
      "subreddit": "softwarearchitecture",
      "url": "https://www.reddit.com/r/softwarearchitecture/comments/1qrfrmp/what_architecture_as_code_tools_you_are_using/",
      "author": "vmgolubev",
      "created_utc": "2026-01-30 19:42:38",
      "score": 9,
      "num_comments": 7,
      "upvote_ratio": 0.91,
      "text": "How do you understand AaC approach? Should you get all artifacts automatically or just some?\nSpecifics:\nDiagrams as code - but which one? Structurizr, D2 or anything else?\nAny docs gen software, that will generate your artifacts automatically?\n\n",
      "is_original_content": false,
      "link_flair_text": "Discussion/Advice",
      "permalink": "https://reddit.com/r/softwarearchitecture/comments/1qrfrmp/what_architecture_as_code_tools_you_are_using/",
      "domain": "self.softwarearchitecture",
      "is_self": true,
      "comments": [
        {
          "id": "o2o08nt",
          "author": "themessymiddle",
          "text": "I’ve been working on arch docs that auto-update, are accessible via MCP, and are beautiful to navigate: https://gjalla.io if you want to take a look! I struggled with some other tools that didn’t auto-update, and even docs generated by Claude Code were too high level. So far the gjalla generated arch artifacts reduce token use, turns, and time of the agents working on code, and I always know the docs I’m looking at are up to date",
          "score": 2,
          "created_utc": "2026-01-30 20:11:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2r1u7z",
              "author": "chipstastegood",
              "text": "your site is slow to load for me on mobile and doesn’t explain what the product actually does",
              "score": 2,
              "created_utc": "2026-01-31 06:56:11",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2r63so",
                  "author": "themessymiddle",
                  "text": "Thanks for the feedback, live architecture docs and enforcement of architecture rules",
                  "score": 1,
                  "created_utc": "2026-01-31 07:34:54",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2qabtw",
          "author": "avinds",
          "text": "likec4",
          "score": 1,
          "created_utc": "2026-01-31 03:32:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2rqw6o",
          "author": "bills2go",
          "text": "Can you try [revibe.codes](https://www.revibe.codes)? I'm building it. It generates architecture and other flow diagrams in mermaid format, from the codebase.",
          "score": 1,
          "created_utc": "2026-01-31 10:51:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2xg7rz",
          "author": "MatchLittle5000",
          "text": "I recently built a related tool called pacta: https://github.com/pacta-dev/pacta-cli\n\nIt helps you to treat architecture as an artifact instead of multiple diagrams stored in confluence that are slowly becoming outdated. \n\nYou describe architecture in special file, add rules, and validate the current code. But the main feature is the ability to keep a history of architecture evolution and observe different trends throughout the time. For example, you can get charts catching a change of the dependency number or coupling in your system and understand when and why the drift occurred. There is also a GitHub action, adding a summary of the architecture change for each PR.\n\nI will add support for diagrams in the future too.",
          "score": 1,
          "created_utc": "2026-02-01 06:28:04",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qoitur",
      "title": "[META] Add 'No AI Generated Posts/Comments' to sub rules",
      "subreddit": "softwarearchitecture",
      "url": "https://www.reddit.com/r/softwarearchitecture/comments/1qoitur/meta_add_no_ai_generated_postscomments_to_sub/",
      "author": "asdfdelta",
      "created_utc": "2026-01-27 16:36:18",
      "score": 8,
      "num_comments": 4,
      "upvote_ratio": 0.91,
      "text": "Response to a recent post asking for this rule to be added and reportable.\n\nI would also welcome any ideas on how to reliably flag AI posts, the reports thus far have been low on accuracy (though reports will always be manually reviewed).\n\nAs well, if anyone would like to step up and help I'm open to it if we match ideologically. Reach out!\n\n[View Poll](https://www.reddit.com/poll/1qoitur)",
      "is_original_content": false,
      "link_flair_text": "Discussion/Advice",
      "permalink": "https://reddit.com/r/softwarearchitecture/comments/1qoitur/meta_add_no_ai_generated_postscomments_to_sub/",
      "domain": "self.softwarearchitecture",
      "is_self": true,
      "comments": [
        {
          "id": "o236d1z",
          "author": "Certain-Researcher72",
          "text": "I feel like AI translation might be useful. Other than that I would say ban it.",
          "score": 7,
          "created_utc": "2026-01-27 20:52:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o25as2w",
              "author": "alien3d",
              "text": "i'm very sad last time , if me as long time developer whom know in out saying this come from ai .. My all word the same thing in my some in word  tutorial in a website(not promote here)",
              "score": 1,
              "created_utc": "2026-01-28 03:13:06",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o25d9p8",
              "author": "asdfdelta",
              "text": "That's the tough thing with enforcement, how do I differentiate the two? Automod checking AI scores on posts would trigger on translates as much as it would bulleted lists that read like a user story.",
              "score": 1,
              "created_utc": "2026-01-28 03:26:56",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o25a4af",
          "author": "alien3d",
          "text": "Yes i like this NO AI.   but the reality some of us using ai because slang issue - grammar.  If not enforce this , it will be healthy board.",
          "score": 3,
          "created_utc": "2026-01-28 03:09:27",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qng3uz",
      "title": "Service layer in MVC architecture",
      "subreddit": "softwarearchitecture",
      "url": "https://www.reddit.com/r/softwarearchitecture/comments/1qng3uz/service_layer_in_mvc_architecture/",
      "author": "sowhatelsee",
      "created_utc": "2026-01-26 13:32:36",
      "score": 8,
      "num_comments": 2,
      "upvote_ratio": 0.9,
      "text": "Does anyone make MVC diagrams and add a separate box like a service layer or engine? I tried to search for examples but I didn’t find any, i wanna know how it may look when adding a service layer\n\nI want to add it because my diagram right now has heavy loads on the controller, so if I want to separate it, the instructor said to use a separated class to avoid this design flow\n\nIf you have any resources that could be helpful here, I would rlly appreciate it! ",
      "is_original_content": false,
      "link_flair_text": "Discussion/Advice",
      "permalink": "https://reddit.com/r/softwarearchitecture/comments/1qng3uz/service_layer_in_mvc_architecture/",
      "domain": "self.softwarearchitecture",
      "is_self": true,
      "comments": [
        {
          "id": "o1tgq1y",
          "author": "ryan_the_dev",
          "text": "In my mind MVC is more of a frontend framework. You can bolt on the backend stuff, but I would treat MVC app like I would any frontend/bff. \n\nThat being said, of course you need to talk to dependencies. Using a service layer or any other integration type layer. \n\nIn terms of diagrams, I don’t typically map out application architecture. We usually have a predefined way we are going to structure the application. \n\nDifferent techniques for different needs.",
          "score": 3,
          "created_utc": "2026-01-26 13:54:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1tj9jo",
          "author": "PassengerExact9008",
          "text": "Absolutely, adding a service layer in MVC is a great way to offload business logic from controllers. In your diagram, place a Service/Engine box between the Controller and Model to show that controllers delegate processing to services, keeping each layer focused and clean. For clear, quick visual iteration of this and other architectural ideas, try Digital Blue Foam, it helps you sketch and refine diagrams fast without getting bogged down in tooling.",
          "score": -2,
          "created_utc": "2026-01-26 14:07:42",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qobhcf",
      "title": "I find system design abstract",
      "subreddit": "softwarearchitecture",
      "url": "https://www.reddit.com/r/softwarearchitecture/comments/1qobhcf/i_find_system_design_abstract/",
      "author": "piggy_piglet",
      "created_utc": "2026-01-27 11:37:32",
      "score": 7,
      "num_comments": 8,
      "upvote_ratio": 0.82,
      "text": "I’ve been reading system design interviews questions here and there.\n\nHowever, I find it very abstract and easy to forget afterwards. While reading, I sort of understand but I don’t think I fully understand. Afterwards, I forget about everything.\n\nIs it due to my lack of experience? Lack of knowledge? Being stupid? Or am I missing anything? Is it better that I just go ahead and build some personal projects instead? ",
      "is_original_content": false,
      "link_flair_text": "Discussion/Advice",
      "permalink": "https://reddit.com/r/softwarearchitecture/comments/1qobhcf/i_find_system_design_abstract/",
      "domain": "self.softwarearchitecture",
      "is_self": true,
      "comments": [
        {
          "id": "o200ku6",
          "author": "PrinceUkaegbu",
          "text": "You're not stupid lol, system design feels abstract because its abstraction without constraints. \n\nMost system design content is taught backwards. You're given solutions (caches, queues< sharding, cap) without first experiencing the pressure that makes those solutions necessary. Without pressure, nothing sticks. \n\nsystem design only becomes concrete when something breaks: Latency spikes, write conflicts, costs explode, or maybe one bad request takes everything down. \n\nUntil you've felt that, diagrams feel like trivia. This is why building small, real projects help. Not to practice system design, but to create failure modes. Once you hit those limits, the abstractions suddenly make sense and stay with you. \n\nInterviews compress years of experience into hypotheticals. reading them without context will always feel hallow. The concepts make sense once you've seen why they exist.",
          "score": 16,
          "created_utc": "2026-01-27 11:48:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o20p42n",
              "author": "Prateeeek",
              "text": "As a mid level developer, I always feel I have to cram all this information because I can't let the system fail and I want to get it right in the first place. This naturally makes me overengineer solutions sometimes, what are your views on failures in general?",
              "score": 2,
              "created_utc": "2026-01-27 14:16:21",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o20rswa",
                  "author": "PrinceUkaegbu",
                  "text": "Look this is something i battle with not even just in software development but life in general.\n\nwanting to \"get it right the first time\" is a common trap. Its rational when failure feels expensive, but it also pushes you towards designing for imagined futures instead of the one you're actually in.\n\nFailure isn't valuable by default, contained failure is. The goal isn't to let systems blow up, its to make sure when they do fail, the blast radius is small and informative.\n\nEarly on, it's usually better to bias towards simpler designs with clear limits, then watch where they break. That tells you what actually needs hardening. overengineering upfront just seems to hide those signals.\n\nMost good system design comes from asking \"what's the cheapest failure i can learn from?\" rather than \"how do i prevent all failure\"\n\nInterviews make it look like people design perfect systems in one pass, in reality, most systems are a series of corrections made after reality disagrees with the one diagram.\n\nThat's been my experience, at least. lol",
                  "score": 5,
                  "created_utc": "2026-01-27 14:29:46",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o201dvu",
          "author": "ImpossibleClub4045",
          "text": "I’d focus on your experience and being able to talk to specific pieces of your resume which are system design related.\n\nArchitecture is VERY use case specific, async / synchronous patterns, choreography/orchestration patterns, when cache is needed. When to use those, in what situation. It is… by design… abstract without a use case lol.\n\nHelps to have a good understanding of the toolkit you have used and what you are aware of in the market. What are good patterns across a full stack… not everyone knows everything but if you are aware of the software available and how it interacts from front end >> middleware >> backend ( including auth / controls / observability / etc,, ) you are well positioned to answer any questions or at least get close",
          "score": 2,
          "created_utc": "2026-01-27 11:54:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o20vr4n",
          "author": "Icy_Screen3576",
          "text": "The way i did it is to start with standalone system design patterns. Microsoft and AWS have great resources on that. The problem is that these are standalone and give shallow examples. Next, you need to apply them, better on your real projects, you will benefit from the discussions with teammates. \n\nOne thing that helped me is categorizing them like that.\n\nhttps://preview.redd.it/f9n2zw8rmwfg1.png?width=1536&format=png&auto=webp&s=6dea63e1207741cac8fa11b0bd41a257ec7b96a3\n\nYou see it is not an easy journey. The kind of pain that will surely provide you with long term gain.",
          "score": 2,
          "created_utc": "2026-01-27 14:49:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o20n46u",
          "author": "Ambitious_Fruit6231",
          "text": "Thinking about the design for something that you ( or anybody else) are not going to build is by its nature going to feel abstract. And so it doesn't really stick. Others have given good advice in this respect, so the only thing to add is to think about the \"why\". Why is this solution or pattern commonly used to solve this problem/provide this functionality. What makes it better than other options. \n\nExpanding on this is to develop criteria for evaluating design choices in addition to the functional requirements. Does portability matter? Does it matter more than performance? In the future might I sell this to another customer who wants much the same but with some different features / functionality - can I design with reuse in mind.\n\nTypically good architecture/design supports these additional criteria but there is a value in thinking about them in their own right",
          "score": 1,
          "created_utc": "2026-01-27 14:06:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o211mff",
          "author": "SolarNachoes",
          "text": "Start with small systems and learn them well. Redesign them and know the trade offs and why each choice was made. Do mock whiteboard interviews.",
          "score": 1,
          "created_utc": "2026-01-27 15:17:22",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qrc4rv",
      "title": "System Design for beginners!",
      "subreddit": "softwarearchitecture",
      "url": "https://www.reddit.com/r/softwarearchitecture/comments/1qrc4rv/system_design_for_beginners/",
      "author": "Substantial-Tax-472",
      "created_utc": "2026-01-30 17:35:51",
      "score": 7,
      "num_comments": 3,
      "upvote_ratio": 1.0,
      "text": "Hello guys, I'm a final year CSE student. Can anyone suggest the roadmap for beginning System Design, like from basic till advanced concepts and scenarios. I had begun with the ByteByteGo, but I didn't feel the completeness. So, any suggestions would help a lot.",
      "is_original_content": false,
      "link_flair_text": "Discussion/Advice",
      "permalink": "https://reddit.com/r/softwarearchitecture/comments/1qrc4rv/system_design_for_beginners/",
      "domain": "self.softwarearchitecture",
      "is_self": true,
      "comments": [
        {
          "id": "o2n6etv",
          "author": "VortexOfPessimism",
          "text": "Probably [https://www.hellointerview.com/learn/system-design/core-concepts/api-design](https://www.hellointerview.com/learn/system-design/core-concepts/api-design) for something more structured",
          "score": 2,
          "created_utc": "2026-01-30 17:58:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2o26f0",
          "author": "Veuxdo",
          "text": "Ask your professors, that's what they're there for.",
          "score": 2,
          "created_utc": "2026-01-30 20:20:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2xller",
          "author": "MatchLittle5000",
          "text": "If you want something practical watch this: https://youtube.com/@hello_interview?si=uz0nebtCACHS1uHF\n\nIt helped me a lot to pass an interview to Senior position. Might help also in academic purposes.",
          "score": 1,
          "created_utc": "2026-02-01 07:14:42",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}