{
  "metadata": {
    "last_updated": "2026-01-05 08:59:57",
    "time_filter": "week",
    "subreddit": "sre",
    "total_items": 6,
    "total_comments": 67,
    "file_size_bytes": 79341
  },
  "items": [
    {
      "id": "1q394qf",
      "title": "SRE at FAANG, what are the most interesting things you worked on in 2025?",
      "subreddit": "sre",
      "url": "https://www.reddit.com/r/sre/comments/1q394qf/sre_at_faang_what_are_the_most_interesting_things/",
      "author": "Juloblairot",
      "created_utc": "2026-01-03 23:07:00",
      "score": 80,
      "num_comments": 27,
      "upvote_ratio": 0.88,
      "text": "Hey!\n\nI'm currently working in a startup, and considering relocating and applying to FAANG companies.\nI'm wondering what's your job there compared to series A/B startups. \n\nBrag about the best/funniest/most interesting things you did last year as an SRE there! ",
      "is_original_content": false,
      "link_flair_text": "ASK SRE",
      "permalink": "https://reddit.com/r/sre/comments/1q394qf/sre_at_faang_what_are_the_most_interesting_things/",
      "domain": "self.sre",
      "is_self": true,
      "comments": [
        {
          "id": "nxl47x2",
          "author": "jldugger",
          "text": "I saved the company a million dollars by fixing some load balancer retry timeout configs that were making things much much worse rather than better. There would be random situations where the service scaled up to max pods, and then magically recover a few minutes later. So instead of 3 of a thing with autoscaling up and down as customer demand rose and fell over a day we were running 50 minimum just to reduce the odds of sympathetic failures. With my fix in place the service stopped doing that and I was able to lower min back to a sane level.\n\nThese settings had been in place for years, after being repeatedly copypasta'd from a proof of concept; when I first asked our staff+ engineer about it he insisted the settings were mandatory to achieve a 100% latency SLO and closed the PR. I had to wait for him to quit to revisit this. Now the monthly operational review metrics look better, costs are down and paging events are down.\n\nOh, and also my manager got promoted and reassigned me to another team, who immediately put me on loan to a third team. Welcome to FAANG leadership!",
          "score": 49,
          "created_utc": "2026-01-04 06:59:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxm39xg",
              "author": "Juloblairot",
              "text": "Good job! \nIf you don't mind, how did you find the root cause?\n\nRegarding the team changes, does that occur a lot in FAANG? Is that much of a pain or are you happy working on different stuff with different people? \n\nAlso, are people mostly excellent, with good mindset, or is it like in any company with plenty of cruise-along folks?",
              "score": 7,
              "created_utc": "2026-01-04 12:10:50",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nxome53",
                  "author": "jldugger",
                  "text": "> Good job! If you don't mind, how did you find the root cause?\n\nI'd been looking at it for a long time, and then one of the core committers on our OSS load-balancer tech mentioned that retry config was really request hedging, and that had me looking at the settings:\n\n1. 4 simultaneous retries\n2. The smallest possible exponential backoff\n3. A request hedging deadline of like 10 percent more than average request time\n\nAll those seemed bad and wrong for the particular service in question. In particular exponential backoff with jitter is intended to cure the exact problem we encountered. I'd also been studying facebook engineering's metastable failure concepts and retry logic was one of the examples I'd seen in the literature, so it was on my radar to review.\n\nWhen I went looking for the PR & associated analysis for the settings was when I realized they hadn't changed since pure guesswork was used in demo / proof of concept. So with the most senior engineer leaving the company to start his own, and the second most out on paternity leave, I was able to push through the change as an experiment to prove it doesn't impact latency SLOs and in fact improves reliability outcomes. \"Science progresses one funeral at a time.\"\n\n> Regarding the team changes, does that occur a lot in FAANG? Is that much of a pain or are you happy working on different stuff with different people? \n\nIn my observations it happens every time a manager leaves or gets promoted. There is no succession planning, only succession emergency responses. I was actually pretty lucky to join the company right as a manager got promoted into his new job, so the time under one manager was longer than typical. My new team has had like 5 managers in 8 years.\n\nBut it's a huge pain, because of how promotions work. I've been asking for a promotion for years now, and knew getting reassigned was a death knell in the first year; getting me a promotion would come at the cost of his other staff he started the year with. But the real pain was the annual review: \"I agree you're already performing at the next level, but unfortunately the next level promotion requires upper management approval and a cross-functional project and I don't have any of those, so don't expect a promotion.\"\n\nWorse, my last cross functional project fell apart. The first month I joined, the SWE leading the project took a month off work. When she came back the ML engineer we needed announced his retirement in two months. The EPM technically assigned was a no-show (\"focused on other high priority projects\"), and the aforementioned SWE was clearly underwater from the number of new technologies the project was adopting. So I had basically no usable system to evaluate as an SRE. Even the junior engineer assigned to implement Prometheus metrics quit the company.\n\n> Also, are people mostly excellent, with good mindset, or is it like in any company with plenty of cruise-along folks?\n\nAbout half of my peers seem to be rest-and-vest. It's so bad in some places that some managers responded to the \"3 day return to office\" mandate by requiring monday and friday to be in office just to stop people from doing stealth 4 day weekends. But given that I appear to be permanently sidelined, I might join their cause. Or just retire on all the money I've already made, and catch up on my steam backlog.\n\nThere are plenty of good people doing good work. One or two of them might even be able to do good work and maintain work-life balance. And for key \"an executive will be fired if this doesn't ship\" initiatives, there's plenty of work being done.",
                  "score": 5,
                  "created_utc": "2026-01-04 19:57:02",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nxr10ln",
              "author": "maaz",
              "text": "sounds like surge queue length. nicely done sir. the value behind some of the seemingly smallest changes is crazy. did people give you the appropriate amount of kudos for the money saved?",
              "score": 1,
              "created_utc": "2026-01-05 03:04:37",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nxs2qmi",
                  "author": "jldugger",
                  "text": "> sounds like surge queue length.\n\nIndeed better monitoring of LB metrics would have been wise and detected this sooner. Trouble is there's like a zillion metrics being collected and you never know which ones are important until you solve the problem.\n\n> did people give you the appropriate amount of kudos for the money saved?\n\nNope! The person most directly responsible for budgeting and cost reporting appears to have been fired without a replacement, and upper leadership is more concerned about AI training costs and deliverables. My new manager was impressed but not too impressed since it's not his budget.\n\nThe new group I'm supporting is an internal tool, so it has an annual cloud spend so low that it would take a 100% cost reduction to match the result. So I've mostly been focused on improving their alerting, outage detection and CI situation. They are also rudderless when it comes to finops; but due to reorgs that happened last month at the highest level I'm not about to press the issue.",
                  "score": 1,
                  "created_utc": "2026-01-05 07:18:15",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nxj1ydg",
          "author": "hawtdawtz",
          "text": "Revamped our internal incident response tool. Think incident.io, but home grown so all our data stays in house. Didn’t spend most of my time on it, but it was the most fun. Has near future parity and then some. \n\nSecond was an extensible tool used to determine whether a build is ready to be deployed. Has all sorts of checks, can easily add new ones for specific apps or all of them, caches results, used by nearly all our tools",
          "score": 27,
          "created_utc": "2026-01-03 23:29:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxjtc9l",
              "author": "blitzkrieg4",
              "text": "Was the \"data in house\" the only reason to build instead of buy?",
              "score": 3,
              "created_utc": "2026-01-04 01:56:06",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nxjuj5g",
                  "author": "hawtdawtz",
                  "text": "It’s definitely is a factor. We’re in a highly regulated industry. We’re not FAANG, but a large scale fintech filled with all ex-FAANG folks. We recently checked out SaaS solutions to replace it, but given no on-prem solution and that our existing solution could have 3-4 months of vibe coding features with Claude to reach feature parity we decided to save ourselves the bill. \n\nPlus whenever we want custom features or changes I can bang that shit out in hours or days often times rather than waiting on a company that already got our money. \n\nThat being said, shout out to the incident.io folks (and rootly), neat tools, just too much fun to build yourself as I had a good basis to build off of. Feel free to ask away, I loved working on it",
                  "score": 3,
                  "created_utc": "2026-01-04 02:02:39",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nxjch7s",
              "author": "weedv2",
              "text": "Nice! What sort of checks?",
              "score": 2,
              "created_utc": "2026-01-04 00:24:33",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nxjdl4u",
                  "author": "hawtdawtz",
                  "text": "Image exists, passes integration tests, was it deployed in lower environments, passed load tests, passed builds, critical hours (if it’s allowed to be deployed during peak hours), etc. \n\nSome checks can be bypassed with two party deployment approval, some cannot (if image doesn’t exist for instance, as there’s nothing to deploy lol). \n\nSome teams made very niche custom checks for their apps, but the ones I mentioned are generally universal. Lower environments have less checks and safeguards, all easily configurable in one place.",
                  "score": 7,
                  "created_utc": "2026-01-04 00:30:18",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nxm2q7r",
              "author": "Juloblairot",
              "text": "Amazing, that does look neat! \nDid you work on these by yourself? \nAnd what's your seniority if you mind? \n\nIsn't the second thing more a platform / CI/CD kinda thing?",
              "score": 1,
              "created_utc": "2026-01-04 12:06:15",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nxm3mf3",
                  "author": "hawtdawtz",
                  "text": "So I worked with one other guy on that one, who was actually a junior who got promoted to senior after the project, (I’m a senior). \n\nAnd yes it is more CI/CD, I actually hopped teams for a little bit while we rebuilt our SRE team. I’m now the guy they call when we want to make deploying more reliable, or when we want to improve the reliability of our system via some new mechanism via our deployment tooling. \n\nI honestly float around and do whatever I think is high impact or a quality of life improvement in our internal operations. Been here for years and survived loads of layoffs this way.",
                  "score": 3,
                  "created_utc": "2026-01-04 12:13:39",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nxpc2qx",
          "author": "Competitive-Ear-2106",
          "text": "I update dashboards (salesforce/Service now, Jira, Monday) \n\nThey call me an SRE.\n\nI might speak to my manger once a month",
          "score": 5,
          "created_utc": "2026-01-04 21:55:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxm1ocj",
          "author": "b1-88er",
          "text": "Doing the cpu weights on cgroups correctly. Having them set wrong when cpu is under load is a great way to make a perfect storm.",
          "score": 3,
          "created_utc": "2026-01-04 11:57:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxmhm58",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 3,
          "created_utc": "2026-01-04 13:50:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxpsvnj",
          "author": "liveprgrmclimb",
          "text": "Did AWS audit and saved company 1.5 million via ECS right sizing and RDS consolidation.",
          "score": 2,
          "created_utc": "2026-01-04 23:16:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxm4zxo",
          "author": "Far-Broccoli6793",
          "text": "Remindme! 2 months",
          "score": 1,
          "created_utc": "2026-01-04 12:24:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxm53fr",
              "author": "RemindMeBot",
              "text": "I will be messaging you in 2 months on [**2026-03-04 12:24:39 UTC**](http://www.wolframalpha.com/input/?i=2026-03-04%2012:24:39%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/sre/comments/1q394qf/sre_at_faang_what_are_the_most_interesting_things/nxm4zxo/?context=3)\n\n[**2 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fsre%2Fcomments%2F1q394qf%2Fsre_at_faang_what_are_the_most_interesting_things%2Fnxm4zxo%2F%5D%0A%0ARemindMe%21%202026-03-04%2012%3A24%3A39%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201q394qf)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
              "score": 1,
              "created_utc": "2026-01-04 12:25:25",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nxs7mhr",
          "author": "Legitimate_Mud9821",
          "text": "Remindme! 1 month",
          "score": 1,
          "created_utc": "2026-01-05 08:02:43",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1q11sgz",
      "title": "Google SRE-SWE to Meta PE?",
      "subreddit": "sre",
      "url": "https://www.reddit.com/r/sre/comments/1q11sgz/google_sreswe_to_meta_pe/",
      "author": "Altruistic-Mammoth",
      "created_utc": "2026-01-01 11:04:25",
      "score": 42,
      "num_comments": 18,
      "upvote_ratio": 0.88,
      "text": "Looking for feedback from Meta Production Engineers, current or former.\n\nTo add context, I was an SRE-SWE at Google for a while, oncall for large-scale mission-critical services. SRE-SWE takes the same interviews as SWE do, and can transfer between SRE and SWE without technical interviews, something that SE-SRE, i.e. Systems Engineer SRE can't do.\n\nI've been invited to interview for a Meta PE role, but I'm not sure if it's a good fit: it looks like there's a lot of low-level Linux / kernel / networking questions asked, whereas I'm more of a software person. I'm interested in the low-level stuff too and I'm happy to learn it, it's just not where I excel at, and at Google, unless you're working on a team that's specifically dealing the network, disk servers, or low-level Borg teams, you're going to be doing things at the application layer. I can't remember a time when I SSH'ed into a production server once in my whole time there.\n\nAre there different kinds of Production Engineers at Meta? Do they all take the same kind of interview?\n\n  \nEDIT: Thanks everyone for the replies. Looks like I won't be applying to Meta :).",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/sre/comments/1q11sgz/google_sreswe_to_meta_pe/",
      "domain": "self.sre",
      "is_self": true,
      "comments": [
        {
          "id": "nx2je6p",
          "author": "hawtdawtz",
          "text": "Google. My team is made of ex Google and meta folks. They couldn’t wait to leave meta",
          "score": 32,
          "created_utc": "2026-01-01 12:20:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx2pb3q",
          "author": "nderflow",
          "text": "I know 3-5 ex-Google SREs who went to Meta.  None remain there now.\n\nReasons probably vary.",
          "score": 25,
          "created_utc": "2026-01-01 13:12:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx6mbc8",
              "author": "aectann001",
              "text": "I know people who did Meta-Google-now Meta again. As usual with these companies, you will find all sorts of experiences (:",
              "score": 3,
              "created_utc": "2026-01-02 02:14:05",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nx4axmo",
          "author": "raulmazda",
          "text": "I was an SRE-SWE at Google (before they wrote the book), and I was a founding engineer in the PE org at Facebook (before the Meta rename).\n\nI have opinions.\n\nGoogle culture is very different than Facebook culture, and as a result SRE and PE are necessarily different. The role has to fit into the culture and org to be effective. Facebook/Meta was more adhoc and flexible, Google has always been structured and organized (and mired in process).\n\nNeither is better than the other, it's ultimately about whether you're optimizing for rate of change and failing fast, or optimizing for slower, methodical, higher quality change (that may never actually ship).\n\nOn the systems and network interviews: this may be the gray beard talking, but IMO if you can't pass them, you probably shouldn't be an SRE at Google. Everybody who does large scale systems needs to understand the fundamentals.",
          "score": 16,
          "created_utc": "2026-01-01 18:42:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx334f8",
          "author": "mxmumtuna",
          "text": "To answer your questions, the interview is the same for all PE roles, there are not multiple types as there are at Google, and it would require an interview to condensed switch to SWE, but it’s not uncommon to do so. During the loop there is an internals/troubleshooting round which is not particularly difficult, imho. \n\nMeta is pretty shitty now (as is Google), but it does still pay well. \n\nSounds like you could be a better fit for a SWE role there, of which there are many many more available.",
          "score": 14,
          "created_utc": "2026-01-01 14:49:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx52g4c",
              "author": "blitzkrieg4",
              "text": "Not having SRE at all, Meta's PEs are closer to an SE-SRE at Google",
              "score": 2,
              "created_utc": "2026-01-01 21:02:22",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nx5jkrg",
                  "author": "mxmumtuna",
                  "text": "That’s not true at all, hence why it requires multiple coding interviews of LC medium/hard as well as system design. \n\nSource: former PE leadership at Meta",
                  "score": 5,
                  "created_utc": "2026-01-01 22:31:24",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nx2rrwi",
          "author": "rb2k",
          "text": "The production engineering role is not split like the SRE one is at google. That being said, different people in the role obviously have different skill sets. You don’t have to be perfect in all of the coding/systems/networking/architecture/… areas, but you should at least be passable in some and good in the others.",
          "score": 7,
          "created_utc": "2026-01-01 13:31:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx52cgm",
          "author": "Pad-Thai-Enjoyer",
          "text": "I’m a Meta PE. In my team, we spend more than half of our time writing diffs (PRs) but some of those are simple config changes. It’s not just about classic SRE stuff like dashboard and alerts, you’ll have to do that, but I also have opportunities to work on larger projects from the ground up which is nice. People here are quite smart too.\n\nMeta culture is kinda rough, my team is probably above average in culture but it still adds a lot of artificial pressure. I would personally stick with Google if I were you.",
          "score": 7,
          "created_utc": "2026-01-01 21:01:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx447ec",
          "author": "PaSsWoRd4EvAh",
          "text": "Production Engineers are hired into a single role and go through a common interview loop: coding, troubleshooting, design, and behavioral. I’ve moved between five or six different teams during my time at Meta, working on everything from large-scale distributed services that the entire company depends on to new products. What the day-to-day looks like depends on the team and the individual. Personally, I spend a large percentage of my time writing design docs and code, and I don't think that is going to change anytime soon. I have been able to avoid teams that view PE as SRE because I want to work on big problems—not just reliability and scalability. This has allowed me to build new services, work on product features, and generally operate as a member of the SWE team. All of this is a long way of saying that many PE teams don’t actually work on low-level systems (or really need to be low-level experts); they only need to be able to function higher in the stack.",
          "score": 6,
          "created_utc": "2026-01-01 18:09:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxc1f86",
          "author": "OneMorePenguin",
          "text": "After 10 years at Google, I went to Facebook.  It was horrible.  Coding standards are low.  I saw C++ code with not a single comment and the arguments to functions had no descriptions.  I was an SRE with Newsfeed team.  We sat near them, but not with them.  We were just their gofers and padding the oncall rotation.  I had a good project where I worked with someone from another team making changes to the Newsfeed service, but I worked mostly with the kernel engineer and not the newsfeed engineers.  No documentation.  After a year, I changed teams to a one in networking.  It was just as bad and I left Facebook after another disappointing year.\n\nThe other SREs I knew weren't really SREs.  They found a niche project/area to own.  It's been a number of years, but I doubt it has changed much.\n\nGoogle has much better tooling, standards, documentation and you can learn SOOOOOO much!  I never saw a single design doc at FB!",
          "score": 5,
          "created_utc": "2026-01-02 22:26:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxe6b8k",
          "author": "Pippa_the_second",
          "text": "Meta PE is a shit show. I trace it back to the point when Pedro Canahuati left years ago. Successors have been a series of weak leaders.\n\nInterview for practice or for leverage against other offers.",
          "score": 3,
          "created_utc": "2026-01-03 06:07:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx6n9k7",
          "author": "aectann001",
          "text": "All PEs take the same kind of interview. These include ones on internals/system debugging skills as well. So, you have prepare to those at the very least.\n\n\nWhile there are teams where you almost never need to ssh to machines or touch whatever low-level stuff, there are lots of teams where you do + those skills are helpful for better understanding why things are going wrong with your service upper in the stack.\n\nIf you consider interviewing/joining this company, this probably needs to change:\n\n> I can't remember a time when I SSH'ed into a production server once in my whole time there.",
          "score": 1,
          "created_utc": "2026-01-02 02:19:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx6r74a",
          "author": "bitcraft",
          "text": "Meta hiring is a complete cluster fuck.  I was in limbo for about a week when both my recruiter and coordinator quit and nobody told me.\n\nThen I go through the interviews and get a single sentence rejection in an email from somebody I’ve never talked to.",
          "score": 1,
          "created_utc": "2026-01-02 02:43:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx6wfbi",
          "author": "Scaawt",
          "text": "I’m also quite curious. About to start interviewing for Meta PE as well. Best of luck to you.",
          "score": 1,
          "created_utc": "2026-01-02 03:15:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx2n941",
          "author": "Cautious_Number8571",
          "text": "I am not in Meta and i am sorry I might not be helpful to answer your question but can you help me understand what it takes to become SRE in google . What type of candidate google interview and what do they ask in interview",
          "score": -11,
          "created_utc": "2026-01-01 12:55:22",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pyrdhc",
      "title": "Should SRE be coding as part of the development cycle",
      "subreddit": "sre",
      "url": "https://www.reddit.com/r/sre/comments/1pyrdhc/should_sre_be_coding_as_part_of_the_development/",
      "author": "Mission-Clue-9016",
      "created_utc": "2025-12-29 16:53:43",
      "score": 25,
      "num_comments": 43,
      "upvote_ratio": 0.8,
      "text": "Question - do you all feel SRE should be coding things lime circuit breakers, retries into applications or “just” guiding developers on the best pattern to do this ?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/sre/comments/1pyrdhc/should_sre_be_coding_as_part_of_the_development/",
      "domain": "self.sre",
      "is_self": true,
      "comments": [
        {
          "id": "nwl2b6c",
          "author": "Heavy-Report9931",
          "text": "Coding for tooling around the application.  \nenvironment setup automation, provisioning of resources  \nall the observability stuff etc.\n\nbut the application itself?  \nit should be treated as a blackbox and best left to the application owners and developers.\n\nwhy?  \nbecause if the SRE is busy fixing the dumpster fire that is the application  \nwho is taking care of  everything else?\n\nSRE's become the bottle neck because SRE's support more than one application.  \n\n\nthis is a hill i am willing to die on and will definitely pitch this to my company's upper management.  \nbecause I am in this hellscape right now.  \n  \nthe above also facilitates developers being sloppy. because \"SRE will take care of it\".\n\n\n\nif something breaks and its not related to environment or network or resources.  \nsend that shit straight to the Application owners and Developers so they will be forced to  fix their BS and hold them accountable for it.",
          "score": 34,
          "created_utc": "2025-12-29 18:11:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwm2snu",
              "author": "1NSAN3CL0WN",
              "text": "As an SRE myself, digging every now and then through application code, you can find some interesting dumpster fires. \n\nMy usual first response is to bring it up to the relevant managers to get it fixed. Because lazy developers would take your tooling to use it in manners not intended. \n\n“SRE will take care of it” is the laziest excuse, and I will call it out. Being called out at 3 a.m., and identifying problems within seconds of coming online, while the application engineers couldn’t see or deduce it from the monitoring, has forced us to have more knowledge-sharing sessions than I would like to admit. But ultimately, we only guide on applications.  \n\nThe only time we really get involved is when we started a whole new vertical, with new languages and frameworks, making decisions, building CICD, setting up environments, and building all the relevant services, before actually hiring a team to take over. That was our fun project for 2025.",
              "score": 10,
              "created_utc": "2025-12-29 21:06:09",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nwkpssd",
          "author": "ReliabilityTalkinGuy",
          "text": "SRE are SWE, just with a slightly different focus than product-driven feature development. They should absolutely be coding.",
          "score": 67,
          "created_utc": "2025-12-29 17:13:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwl277b",
              "author": "rodblagojevic",
              "text": "👍 SRE without SWE isn’t actually SRE",
              "score": 28,
              "created_utc": "2025-12-29 18:11:24",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nwvue4k",
              "author": "mayday_live",
              "text": "Feels like another example of people redefining SRE into “yet another dev team,” instead of reliability engineering.",
              "score": 1,
              "created_utc": "2025-12-31 08:34:27",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nwz213r",
                  "author": "gordonmessmer",
                  "text": "SRE \\*is\\* another dev team... one that's focused on reliability. That's how the term originated.",
                  "score": 2,
                  "created_utc": "2025-12-31 20:33:29",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwpctcm",
          "author": "md____ub",
          "text": "Your question title and description aren't looked under the same lens, and hence the confusion. SREs must definitely be coding - e.g. the circuit breakers, retries etc. Now whether that's considered a part of the development lifecycle varies a lot, because it also includes the application development itself, which SREs aren't supposed to do unless it's an application that solely focuses on toil reduction (not a business application).",
          "score": 4,
          "created_utc": "2025-12-30 09:27:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nws4syv",
          "author": "sigmoia",
          "text": "SREs aren't sysadmins. Their strong suite should be software engineering. \n\n\nAfterall the canonical definition is - SRE is what happens when you put SWEs to run ops. YAML mungers and k8s admins aren't necessarily SREs.\n\n\nBut also, the term SRE means different things at different companies. It's almost as overloaded as Staff Engineer. ",
          "score": 3,
          "created_utc": "2025-12-30 19:14:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwkomzk",
          "author": "blitzkrieg4",
          "text": "Absolutely. The SRE knows how to code so they're best deployed if they know and work on the code they support. Implying they are only coding after development is over is implying old school \"over-the-wall\" deployment to prod",
          "score": 13,
          "created_utc": "2025-12-29 17:08:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwldvhy",
              "author": "opshelp_com",
              "text": "But an SRE may be responsible for the reliability of multiple products/services. I don't think it's feasible for them to be a substitute for developers that work on a specific service.\n\nI get that they need to know how to code, but in my experience they're not responsible for fixing developers code and can often just push it back to them if they push something bad",
              "score": 8,
              "created_utc": "2025-12-29 19:04:51",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nwnqo10",
                  "author": "blitzkrieg4",
                  "text": "Yeah it's a little different in that case. Still, if you're working at a place where you can dry up code and modularize stuff like health checks and rate limits, I could see that being an SRE responsibility.\n\nAlso remember development is actually _in_ the SRE hierarchy of needs in the first book, albeit near the top. Not every company is Google, but here is what they say about it: \n\n> One of the key aspects of Google’s approach to Site Reliability Engineering is that we do significant large-scale system design and software engineering work within the organization.\n\nThey then go on to list a bunch of internal SRE led products and services they have",
                  "score": 2,
                  "created_utc": "2025-12-30 02:23:32",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwlt362",
          "author": "daedalus_structure",
          "text": "If you can pull those things out into the infrastructure, and you should be doing so, SRE should be handling it. \n\nIf you can decouple some specific functionality and expose it as a service that SRE provides that the product team consumes, that also works, although I don't recommend due to the likelihood that those aren't well maintained just due to how much SRE gets asked to do with limited capacity. \n\nBut SRE shouldn't be in the product writing code. That's a recipe for them to cause problems in code bases they don't fully understand. \n\nIf your product engineers can't code up a circuit breaker or your product team refuses to prioritize non-functional requirements like availability, you have major problems in your product org.",
          "score": 5,
          "created_utc": "2025-12-29 20:18:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwmkp8x",
              "author": "SnarkyRoomba",
              "text": "Exactly this. Having SRE do product coding means the separation of duties is leaking. Some companies do resource sharing under budgeting constraints - and that's where such anomalies can happen.\n\nGiving team general direction, best practices - sure. But oh boy, working on bugs? That's completely out of context for an SRE.\n\nBug is found in testing, reviewed by PM, fixed by dev, retested by QA and approved back by PM. If you're not doing it now, some future cautionary tale will make you.",
              "score": 2,
              "created_utc": "2025-12-29 22:34:21",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nwl4e1o",
          "author": "borg286",
          "text": "The coding I do is adding monitoring pipelines. I write dashboard code, platform solutions.",
          "score": 4,
          "created_utc": "2025-12-29 18:21:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwssor3",
          "author": "duebina",
          "text": "Having been on both sides of that equation, anywhere from 2000 to 2025, the trend has been to offload the retries to your infrastructure tooling, such as istio or something on kubernetes.  However, the most resilient and mature applications that I have ever had the pleasure of maintaining have had developers who had the mental capacity to implement proper retry mechanisms within their application. If developers get lazy, then they are creating tech debt for you, and that is not a team player.  Therefore, I stand firm on the SRE educates developers on how to make resilient code if they are not doing it themselves.",
          "score": 2,
          "created_utc": "2025-12-30 21:09:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwknkro",
          "author": "Jazzlike_Syllabub_91",
          "text": "SREs should be guiding developers on best practices/patterns to do this. The SRE may not know the details of the application to effectively build in the circuit breakers and retries - so it's best left to the dev team -while the sre responds to issues that occur in production",
          "score": 4,
          "created_utc": "2025-12-29 17:02:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwkq6hg",
              "author": "ReliabilityTalkinGuy",
              "text": "This feels absolutely incorrect to me. SRE are SWE, and they should know and be maintaining the code base of what they're responsible for. To just \"respond to issues\" would make them no different than a traditional sysadmin.",
              "score": 4,
              "created_utc": "2025-12-29 17:15:20",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nwl3wlf",
                  "author": "Heavy-Report9931",
                  "text": "follow up to this.  \nisn't this unscalable?\n\nthis works if you are supporting one code base/application  \nwhat if you are supporting more  than one? each application's codebase as complex as the other?\n\nas products evolve and new products get introduced. how will maintaining the codebase of 5-10 different applications be feasible for the SRE team?\n\nis it not better to let the team who made it be responsible for it?  \nthey already know all the context to it anyway.\n\nplus if you're doing the developers job who is doing your job?.\n\ni really want to know your take on this.  \nbecause I am wrestling with this at work",
                  "score": 1,
                  "created_utc": "2025-12-29 18:19:08",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nwl08a4",
                  "author": "OneMorePenguin",
                  "text": "Not all SRE are SWE.  Google has SWE SRE roles and you are interviewed as a SWE primarily.  You can change to a SWE role without having to interview.  Systems SRE will be required to code, but more like devops roles.  ",
                  "score": 0,
                  "created_utc": "2025-12-29 18:02:24",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwnu3kz",
          "author": "smuzzu",
          "text": "There is no one definition of SRE. In some companies coding is more around tooling and observability, in others they want you to do IaC, and lastly some want SRE to fix bad app code. I believe its just too broad of a spectrum. But definitely SRE knows coding and its best practices for reliability, and should be involved in design, and at least review so developers know where to focus and why so their app is more reliable. Another big role is to guard error budget so delivery speed moves with customer experience. But again.. I believe it's just a bit too much for one role and I would prefer if it split, even if it's more expensive.",
          "score": 1,
          "created_utc": "2025-12-30 02:41:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwlkv45",
          "author": "skspoppa733",
          "text": "SRE’s should do SRE work, not app development.",
          "score": 2,
          "created_utc": "2025-12-29 19:38:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwopdm5",
              "author": "ReliabilityTalkinGuy",
              "text": "App development is part of SRE work. What if you need a new data sharding mechanism built? What if you need to move the storage layer from solution A to solution B? What if you need to expose deep internal state to external mechanisms? Those would all touch the application codebase and they are all extremely classic SRE work. ",
              "score": 0,
              "created_utc": "2025-12-30 05:59:11",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nwqw3bd",
                  "author": "skspoppa733",
                  "text": "Sounds like an unfocused team who is trying to do everything whose members likely complain of burnout. Platform Engineers and others exist to shoulder some of that burden.",
                  "score": 2,
                  "created_utc": "2025-12-30 15:47:03",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nww1nzw",
                  "author": "Spiritual_Dig_8913",
                  "text": "this sounds like a catch all for work that the devs dont want to do. SRE should focus on reliability... they should be involved in the architecture and design of solutions and can (not must) code these where appropriate, but your description above sounds more like 'everything else but feature development'.",
                  "score": 1,
                  "created_utc": "2025-12-31 09:43:56",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwphbh1",
          "author": "tushkanM",
          "text": "SRE should be coding not just to develop their own observability/monitoring/automation stuff , but to train their 'engineering muscle'. They shouldn't deal with domain-specific application features, but be \"near it\" with observability packages and other \"development support\" stuff, so they can quickly understand bottlenecks and critical flows in a \"D\" day  when things go south.",
          "score": 1,
          "created_utc": "2025-12-30 10:09:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwr1vz5",
          "author": "heramba21",
          "text": "SREs should be coding things that help SWEs focus on what they do best. Coding features and fixing bugs.",
          "score": 1,
          "created_utc": "2025-12-30 16:14:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx04sme",
          "author": "GeraldTruckerG",
          "text": "SRE shouldn’t be just coding or just advising — they should own the execution boundary.\nIf SREs only write libraries (circuit breakers, retries), devs will misuse or bypass them under delivery pressure.\nIf SREs only “guide,” reliability becomes optional and drifts.\nThe highest-leverage model I’ve seen is:\nSRE defines non-negotiable guardrails (timeouts, retries, backoff, stop conditions)\nThose guardrails are enforced by shared primitives or platform controls\nDevs still own business logic, but cannot ship paths that violate reliability constraints\nIn other words:\nSRE shouldn’t be writing product code, but they should be writing the code that decides when code is allowed to run.\nReliability fails most often not because logic is wrong, but because systems continue when they shouldn’t.",
          "score": 1,
          "created_utc": "2026-01-01 00:16:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwnfvw8",
          "author": "the_packrat",
          "text": "Yes but watch for the massive opportunity cost if SRE specialists are just acting as generic software engineers. \n\nIt is absolutely fine if that’s the business emergency but SRE will be way more effective in uplifting multiple engineers at a time rather working on one piece of software. A framework that automatically adds retries to all the application that use it (and getting that adopted) training or practices like postmortem review tha make all engineers wary of building stupid retry logic rather than fixing it for one application. Etc. \n\nYou are absolutely correct to worry about incentives of developers don’t have to care about this stuff because not only will they not do it, they’ll make other choices that make it harder for anyone to do it later. Really the only solution to this is to mostly have SRE doing the leveraged stuff I described where the developers are still in the loop but are better at their job.",
          "score": 1,
          "created_utc": "2025-12-30 01:23:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwlt8rh",
          "author": "TheCTOLife",
          "text": "I wouldn't expect them to be coding day to day.  I would expect them to be helping with the design of whatever feature product engineering is working on, doing code reviews, fixing bugs, and looking at data and metrics to identify systemic issues within the ecosystem, and then fixing them (with either code changes or infra changes)",
          "score": 0,
          "created_utc": "2025-12-29 20:19:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwm4yz2",
          "author": "evergreen-spacecat",
          "text": "How on earth could you guide skilled developers in coding without writing a single line of code yourself? It would be like having a blind teacher teaching you to read and write.\n\nNon the less, SREs are SWEs and unless code is the major part of your work day, you are not a SRE",
          "score": 0,
          "created_utc": "2025-12-29 21:16:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwopmz0",
              "author": "ReliabilityTalkinGuy",
              "text": "Correct. I don’t know why we have to have this conversation over and over every few weeks or so.\n\nThere is nothing wrong with being a sysadmin. I was one for a very long time! But you’re not doing SRE work if you’re not coding. ",
              "score": 0,
              "created_utc": "2025-12-30 06:01:13",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nwvtszr",
                  "author": "YouDoneKno",
                  "text": "The distinction is SREs should not be focused on coding business features. System + Testing + CI/CD requires plenty of coding",
                  "score": 0,
                  "created_utc": "2025-12-31 08:28:46",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwn6npq",
          "author": "hornetmadness79",
          "text": "I've fixed code only when I was told there was no bandwidth to fix a critical problem. It's not something I do often, but sometimes there isn't time for politics or ego.",
          "score": 0,
          "created_utc": "2025-12-30 00:32:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwolfcg",
          "author": "AxiomOfLife",
          "text": "I swear my SRE team makes data dog reports that are almost useless and just start meetings when there’s outages. otherwise they are less then useless",
          "score": 0,
          "created_utc": "2025-12-30 05:29:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwt8yvd",
          "author": "[deleted]",
          "text": "[deleted]",
          "score": 0,
          "created_utc": "2025-12-30 22:26:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwug76a",
          "author": "gordonmessmer",
          "text": "The problem with this question is that the answers are going to mostly tell you about the relative experience of the person answering and the operational maturity of their employer, rather than telling you how to make the best possible use of the resources that you have available.\n\nThat is, if you ask experienced developers this question, they'll tell you that SRE should be involved in the early design and architecture for application development in order to ensure that the service is designed to scale well and mitigate the failure of individual components.\n\nBut if you ask someone less experience, someone whose experience is mostly troubleshooting and responding to pagers, they'll tell you that SRE should focus on incidence response and involvement in development isn't critical.",
          "score": 0,
          "created_utc": "2025-12-31 02:26:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwyd4t4",
          "author": "Effective-Badger-854",
          "text": "This post completely misses the point of what SRE is.",
          "score": 0,
          "created_utc": "2025-12-31 18:23:03",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1q0dyt8",
      "title": "I built a small open source incident response helper",
      "subreddit": "sre",
      "url": "https://www.reddit.com/r/sre/comments/1q0dyt8/i_built_a_small_open_source_incident_response/",
      "author": "RubNo8609",
      "created_utc": "2025-12-31 14:14:45",
      "score": 12,
      "num_comments": 4,
      "upvote_ratio": 0.88,
      "text": "Hey folks,\n\nI built a small open source tool called incident-helper while working as an SRE and dealing with real production incidents.\n\nThe idea is simple. During incidents, we often lose time figuring out what to check first, what commands to run, and how to document things properly. This tool acts like a lightweight CLI assistant that guides you through incident response with structured prompts and checklists.\n\nIt is not an AIOps or magic AI tool. It just helps you stay calm and systematic when things are broken.\n\nWhat it does\n\n\t•\tGuides you through incident triage step by step\n\n\t•\tSuggests common checks and commands for typical production issues\n\n\t•\tHelps capture notes and timelines during incidents\n\n\t•\tWorks locally, no cloud dependency\n\nI built it mainly for myself, then cleaned it up and open sourced it in case others find it useful.\n\nGitHub:\n\nhttps://github.com/malikyawar/incident-helper\n\nFeedback, issues, or ideas are welcome. If it saves you a few minutes during an incident, that is already a win.\n\nThanks for reading.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/sre/comments/1q0dyt8/i_built_a_small_open_source_incident_response/",
      "domain": "self.sre",
      "is_self": true,
      "comments": [
        {
          "id": "nx1hf7w",
          "author": "hatethissubreddit",
          "text": "Have you used HolmesGPT? How is this different and what does your tool offer that HolmesGPT doesn’t?",
          "score": 1,
          "created_utc": "2026-01-01 05:54:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx1vriz",
              "author": "RubNo8609",
              "text": "I haven’t used HolmesGPT. Incident Helper is currently a CLI-based tool focused on helping engineers respond during incidents by providing structured prompts, checks, and guidance rather than AI-driven investigation. It’s intentionally simple right now and more about improving human response and reducing alert fatigue than being a full incident management or AI chat tool.",
              "score": 1,
              "created_utc": "2026-01-01 08:14:03",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nxdr286",
                  "author": "incidentjustice",
                  "text": "if we haven't use how can u even compare ? Try the options as well before recreating things in general",
                  "score": -2,
                  "created_utc": "2026-01-03 04:18:58",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1q2tcu5",
      "title": "On-call question: what actually slows your incident response the most?",
      "subreddit": "sre",
      "url": "https://www.reddit.com/r/sre/comments/1q2tcu5/oncall_question_what_actually_slows_your_incident/",
      "author": "IndiBuilder",
      "created_utc": "2026-01-03 12:23:53",
      "score": 12,
      "num_comments": 20,
      "upvote_ratio": 0.74,
      "text": "I’m curious how others experience this. In most incidents I’ve been part of, alerts fire quickly — that part usually works.But once the alert is acknowledged, things slow down.\n\nPeople jump between:\n\n* dashboards\n* logs across multiple services\n* recent deploys or config changes\n* Slack threads trying to piece things together\n\nA lot of time is spent just figuring out where to look first before any real fix happens.\n\nFor teams that have improved MTTR:\n\n* What actually helped the most?\n* Better alerting?\n* Runbooks?\n* Stronger ownership?\n* Tooling that adds context automatically?\n\nGenuinely interested in how others handle this today.\n\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/sre/comments/1q2tcu5/oncall_question_what_actually_slows_your_incident/",
      "domain": "self.sre",
      "is_self": true,
      "comments": [
        {
          "id": "nxknj0t",
          "author": "Gunny2862",
          "text": "Nothing has screwed up incident response more than panic outside the team. People who should be working the incident are getting yelled at and interrupted by people up and down the company. When you're interrupted while working on an incident your brain pretty much has to start all over.\n\nSo... I guess I would say if you haven't formalized a semi-automated communication structure and division of labor with something (we do it with our IDP Port), you're bound to deal with the above.",
          "score": 10,
          "created_utc": "2026-01-04 04:54:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxgcvnl",
          "author": "HistoricalBaseball12",
          "text": "Tool sprawl. Alerts fired fast, but triage slowed down because you’re jumping between 5-8 tools with different query languages, and “who has access?” delays. What helped most was consolidating observability into a single starting point (or at least a single workflow)",
          "score": 5,
          "created_utc": "2026-01-03 15:43:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxk7dxr",
              "author": "IndiBuilder",
              "text": "I am guite curious to know, how you did that? Did you create a dashboard with different panels pointing to different telemetry data, or any product which brings data from all kinds of data sources.",
              "score": 1,
              "created_utc": "2026-01-04 03:14:38",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nxpa9ao",
                  "author": "hatethissubreddit",
                  "text": "We created one single Grafana dashboard with over 10 different datasources with each graph or box containing one or multiple links in case you want to deep dive. This is our main operational overview dashboard. \n\nThat being said, the game changer for us was our “production changes” board. Almost 99% of the issues on prod are related to human-initiated changes. We found a way to sources all those changes (PRs, Jira tickets) into a single influxdb from where we made a Grafana board. In some tickets and PRs we associate the application name to the change which makes it really easy to identify an ongoing alert related to an app to a recent change. \n\nIf we can’t find recent anything in recent changes, then we fallback to tools like APM (opentelemetry) to understand what’s happening and investigate from there.",
                  "score": 2,
                  "created_utc": "2026-01-04 21:47:26",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nxfhx91",
          "author": "mensii",
          "text": "Some time ago, I looked at the escalation latency across the whole chain, so problem happening -> customer contacting support -> support escalating -> SRE taking some action (or alternatively throw in some dev team escalation as well) and the time for every \"hop\" seemed to be quite consistent around 20min +/- 5min or so.\n\n  \nSo this is a diverse crowd and a diverse tooling and dashboarding landscape, so I don't think reactive tooling matters much. In my personal opinion, the only things you can basically do is either reduce the number of hops or invest into preventative measures. Reducing the number of hops is often not necessarily something under your control or makes economical sense, so the thing that remains is preventative stuff, like:\n\n - Automatic canarying + rollback  \n - Client throttling + Load shedding  \n - Graceful degradation  \n - Autoscaling  \n - etc...\n\nAll this of course also carries a cost but I'd argue it's more future-proof and sustainable and investing time in reactive stuff.",
          "score": 2,
          "created_utc": "2026-01-03 12:46:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxg2sy4",
              "author": "IndiBuilder",
              "text": "u/mensii Agreed — prevention has the highest ROI and reduces how often humans need to get involved at all.Escalation latency is real and fairly constant once people are in the loop.\n\nWhere I still see pain is in the incidents that escape preventative controls the slowdown is usually figuring out what changed / what to rule out, not execution.\n\nReactive tooling doesn’t replace prevention, but it can reduce cognitive load during that unavoidable human phase if it’s conservative and supervised.",
              "score": 1,
              "created_utc": "2026-01-03 14:51:51",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nxg5a3g",
                  "author": "mensii",
                  "text": "But so let's use the \"what changed\" problem as an example. Say you want to build something that hooks into your deployment mechanism to log actions in some place you an then show in oncall response. Now the fractal of problems starts to open up, because it could also be in a dependent service, or it could be a bad config change or similar. So you have to go figure those out and how to present them while still preserving a good signal to noise ratio (Like what's the point of showing deployments and config changes across everything, that's just going to lead to more confusion).\n\nSo instead of doing that work and getting a dashboard as a result, build the canary and auto rollback based on the metrics you would otherwise alert on into those rollouts and config update mechanisms you're investigating for this.\n\nWhat you built now is something that avoids getting paged in the first place and instead you have to deal with an autorollback where it tells you what metric went bad, and you can investigate in peace and quiet.",
                  "score": 1,
                  "created_utc": "2026-01-03 15:05:04",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nxglky8",
          "author": "happyn6s1",
          "text": "are these AI generated questions? just curious.",
          "score": 2,
          "created_utc": "2026-01-03 16:25:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxk0nxi",
              "author": "IndiBuilder",
              "text": "u/happyn6s1 nope nope.",
              "score": 1,
              "created_utc": "2026-01-04 02:36:49",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nxg3jko",
          "author": "sagin_kovaa",
          "text": "We need to set up the alerts in hierarchy. In recent times our support lead was questioning the reliability of the alerts for mttr. You know the alerts are reliable as we test the threshold/ conditioning criteria with rate cutters, circuit breakers, escalation matrix. This is a organic process need to evolve on its own with transparency to build a reliable system.\n\nThen it's will grow into run books, SOP...",
          "score": 1,
          "created_utc": "2026-01-03 14:55:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxhbm27",
          "author": "neuralspasticity",
          "text": "If your observability system alerted you there was a problem it should tell you what dashboard displays the alert condition. It should include in the alert the runbook to follow. It should be alerting the owning team. It can create a slack channel specific for the management of this particular incident. Your dashboards should already have annotated in your time series graphs when deployments occurred. \n\nEverything you describe are omissions in your process that are bugs.",
          "score": 1,
          "created_utc": "2026-01-03 18:25:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxk5zdt",
              "author": "IndiBuilder",
              "text": "u/neuralspasticity given that all the alerts have run books and link to right metrics, and right people are notified, still its not easy to triage an incident in real-world enterprise.\n\nIn have seen couple of times the real issue might be in one of your dependencies (services/infrastructure) , and one may not have complete visibility to the telemetry of that system, and in large enterprises systems are owned by different teams and during such incidents you need the involvement of engineers from each system to have visibility of the entire stack.\n\nUnderstanding blast radius is quite crucial in early stages. So on paper it may seem monitoring and alerting are sufficient to traige but , they are just a tip of ice berg.",
              "score": 1,
              "created_utc": "2026-01-04 03:06:33",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nxknv77",
                  "author": "neuralspasticity",
                  "text": "If I write an alert for a SLO violation, I know why I called  out the engineer, I have action for them to take, I know the severity and know the impact already, it shouldn’t need triaged to determine. My services are only operationally ready when I’ve documented their  dependencies owning teams and how to validate they’re working (health checks, synthetic tests, &c). \n\nThat inability to see where the problem lies is opacity and a lack of observability, which is a bug, a deficiency in my systems. That’s a high priority bugfix as I need to be able to see to know where we’re going. \n\nThis  isn’t academic, or some paper exercise, it’s how many of us have been implementing best practices in our organizations for a long while. It’s what prevents my teams from burning out, keeps my recovery and rollbacks quick and smooth, and allows them to focus on work other than incidents.\n\nThe problems you’re describing need to be identified in your incident reviews, defined as bugs and prioritized as important work, in fact in some cases part of the recovery work. You seem to have identified deficiencies as reasons your teams are struggling and recovery times high, when my teams have these findings we include it as interrupt work if it needs done this sprint, or prioritize it in our backlog.",
                  "score": 1,
                  "created_utc": "2026-01-04 04:56:21",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nxkejga",
          "author": "Escatotdf",
          "text": "Management",
          "score": 1,
          "created_utc": "2026-01-04 03:56:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxlodsp",
          "author": "md____ub",
          "text": "An alert must always have a runbook associated with it. and that's where you start. If the runbook itself says look at 10 different things, then that's a different problem.",
          "score": 1,
          "created_utc": "2026-01-04 10:01:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxlqdi9",
              "author": "IndiBuilder",
              "text": "Ya, it starts with run book and its also true most runbooks in re real world asks to look at multiple stuff 🤣",
              "score": 1,
              "created_utc": "2026-01-04 10:18:48",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nxlqj43",
                  "author": "md____ub",
                  "text": "SRE focuses on documentation for a reason.",
                  "score": 1,
                  "created_utc": "2026-01-04 10:20:13",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nxqfk3n",
          "author": "PerfSynthetic",
          "text": "When app teams call themselves engineers but barely understand how they installed the software...   When it breaks, no one knows how to fix it ..\n\nCall the vendor should never be a solution to impact/outage.",
          "score": 1,
          "created_utc": "2026-01-05 01:10:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxrxq47",
          "author": "Ordinary-Role-4456",
          "text": "Context switching always gets me. I’ll be checking logs, then something kicks me out, and suddenly I’m looking at metrics, then someone sends me a Slack message, then I remember to check a deploy. My brain just gets scrambled.   \n  \nPulling everything into one place helped a lot. We started using CubeAPM since it shows logs, traces, and metrics together and provides intelligent, real-time alerting that cuts down the jumping around. But honestly, multitasking is still tough under pressure.",
          "score": 1,
          "created_utc": "2026-01-05 06:35:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxfoutw",
          "author": "mm-c1",
          "text": "When you debug production incidents you think in two modes: depth and breadth.\n\nBreadth is the trickiest, as you need to jump between many tools to fully understand what's broken.\n\nOr you can aggregate the info in those tools in a single place, placed directly over the tools you use everyday, so that the oncall engineer does not need to think that much when they investigate.\n\nThis is called ToolJump, and is free and open source and I build it specifically for centralizing your org specific knowhow in a single place, easily accessible by all your engineers.",
          "score": 0,
          "created_utc": "2026-01-03 13:31:51",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1py0qxn",
      "title": "How do SRE teams decide when to change a risky production service?",
      "subreddit": "sre",
      "url": "https://www.reddit.com/r/sre/comments/1py0qxn/how_do_sre_teams_decide_when_to_change_a_risky/",
      "author": "llASAPll",
      "created_utc": "2025-12-28 19:55:46",
      "score": 9,
      "num_comments": 15,
      "upvote_ratio": 0.8,
      "text": "I’m curious how this decision is handled on SRE-led teams.\n\nConsider a production service that is inefficient or overprovisioned, but has tight SLOs and a meaningful blast radius if something goes wrong.\n\nWhen this comes up, how do teams usually decide whether to make changes versus accepting the inefficiency?\n\nIs this driven by error budgets or formal reviews, or does it mostly come down to experience and judgment?\n\nInterested in how this works in practice.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/sre/comments/1py0qxn/how_do_sre_teams_decide_when_to_change_a_risky/",
      "domain": "self.sre",
      "is_self": true,
      "comments": [
        {
          "id": "nwf6cxn",
          "author": "clearclaw",
          "text": "First thing, I (try to) get that thing onto a high frequency update/upgrade cycle.  Get it moving!  If there are worries about stability, crank it up high and get the supporting dev team to have skin in every single update and deploy -- they are on-call too, right?  The goal is to hammer that thing until it is normal and low-risk like everything else, and is updated without concern in the middle of busy hours like everything else.\n\nBeing scared of your own product, of deploying your own product, of managing your own product is...silly.  Don't do that.",
          "score": 10,
          "created_utc": "2025-12-28 20:17:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwf8qbc",
          "author": "ziadsaber",
          "text": "Lerroy jenkins is the way.",
          "score": 15,
          "created_utc": "2025-12-28 20:29:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwfrwet",
              "author": "Physical-Layer",
              "text": "The only valid answer",
              "score": 5,
              "created_utc": "2025-12-28 22:03:47",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nxg3fi8",
                  "author": "tobylh",
                  "text": "+1",
                  "score": 1,
                  "created_utc": "2026-01-03 14:55:14",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwf3g5w",
          "author": "GrogRedLub4242",
          "text": "persons decide it. humans. may or may not be teams involved, and irrelevent",
          "score": 13,
          "created_utc": "2025-12-28 20:03:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwfr9du",
          "author": "skspoppa733",
          "text": "Assess business risk, weigh against other priorities, schedules, etc. \n\nSome degree of imperfection is acceptable.",
          "score": 4,
          "created_utc": "2025-12-28 22:00:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwfhm2n",
          "author": "FormerFastCat",
          "text": "Risk vs Reward.",
          "score": 3,
          "created_utc": "2025-12-28 21:13:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwhmr7t",
          "author": "unitegondwanaland",
          "text": "Modern architecture is resilient enough to make simple rightsizing changes without disrupting a service. There are few exceptions like Elasticsearch that require careful planning but for the most part, there's nothing so fragile that you avoid touching it... again, talking about modern architecture.",
          "score": 3,
          "created_utc": "2025-12-29 04:15:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwhtez1",
          "author": "Ordinary-Role-4456",
          "text": "Depends a lot on the team and how much the pain of inefficiency is hurting.   \n  \nSometimes people just absorb the cost forever because the risk is seen as too high. Some places lean on error budgets to make the call, while others do some risk assessment with stakeholders and make a plan. Usually, it needs someone to push for it and make enough noise to prioritise the work.",
          "score": 3,
          "created_utc": "2025-12-29 04:58:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwfeduo",
          "author": "kellven",
          "text": "Data is the key. How much $ is this costing the org. How much can we save by fixing it, how much time is it going to take to fix. \n\nAt some point those 3 data points will no longer make sense to leadership and they will drive the change. While you can force a change through leadership it’s alot easier when it’s “their Idea”",
          "score": 2,
          "created_utc": "2025-12-28 20:57:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwizlfd",
          "author": "yolobastard1337",
          "text": "old skool ops managers wake up and mandate a mountain of paperwork, which is more about arse covering than risk reduction.",
          "score": 2,
          "created_utc": "2025-12-29 11:06:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwgd168",
          "author": "the_packrat",
          "text": "Seeking efficiency is usually a bad starting point. People forget that efficiency leads to fragility and that leads to way more people work which for most services is a bad trade off. \n\nLikewise running close to the line means a lot of reactive work to adjust sizing and resources or risk SLO impact. \n\nSo first work on capturing what those tradeoffs really are and try to understand why this was set up like that. I’ve seen really money important services get broken because someone thought an extra $5000 cost was “inefficient” without once talking to people about business impact.",
          "score": 1,
          "created_utc": "2025-12-28 23:54:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwm2q8s",
              "author": "clearclaw",
              "text": "This, so much this, but it also so much money spent on building for back swans when eating the failure would be reasonable.",
              "score": 1,
              "created_utc": "2025-12-29 21:05:49",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nx0pjk1",
          "author": "yonly65",
          "text": "If the service is fragile (i.e. risky to change), then we typically overprovision it on capacity or instance counts, and then conduct a progressive rollout. The inefficiency of overprovisioning is the cost of the fragility plus the SLO.\n\nIt also makes for good incentives with the business and product leads: want a more efficient product with the same SLO? Spend the engineering effort to reduce the fragility of the service!",
          "score": 1,
          "created_utc": "2026-01-01 02:28:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxge86o",
          "author": "HistoricalBaseball12",
          "text": "I’d say it’s largely driven by error budgets, at least for deciding **how aggressively** you ship (and when to freeze). If we’re within budget, we can take measured risk, but we still require safe rollout mechanic.",
          "score": 1,
          "created_utc": "2026-01-03 15:49:55",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}