{
  "metadata": {
    "last_updated": "2026-01-03 00:59:58",
    "time_filter": "week",
    "subreddit": "sre",
    "total_items": 10,
    "total_comments": 110,
    "file_size_bytes": 114381
  },
  "items": [
    {
      "id": "1q11sgz",
      "title": "Google SRE-SWE to Meta PE?",
      "subreddit": "sre",
      "url": "https://www.reddit.com/r/sre/comments/1q11sgz/google_sreswe_to_meta_pe/",
      "author": "Altruistic-Mammoth",
      "created_utc": "2026-01-01 11:04:25",
      "score": 33,
      "num_comments": 17,
      "upvote_ratio": 0.84,
      "text": "Looking for feedback from Meta Production Engineers, current or former.\n\nTo add context, I was an SRE-SWE at Google for a while, oncall for large-scale mission-critical services. SRE-SWE takes the same interviews as SWE do, and can transfer between SRE and SWE without technical interviews, something that SE-SRE, i.e. Systems Engineer SRE can't do.\n\nI've been invited to interview for a Meta PE role, but I'm not sure if it's a good fit: it looks like there's a lot of low-level Linux / kernel / networking questions asked, whereas I'm more of a software person. I'm interested in the low-level stuff too and I'm happy to learn it, it's just not where I excel at, and at Google, unless you're working on a team that's specifically dealing the network, disk servers, or low-level Borg teams, you're going to be doing things at the application layer. I can't remember a time when I SSH'ed into a production server once in my whole time there.\n\nAre there different kinds of Production Engineers at Meta? Do they all take the same kind of interview?\n\n  \nEDIT: Thanks everyone for the replies. Looks like I won't be applying to Meta :).",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/sre/comments/1q11sgz/google_sreswe_to_meta_pe/",
      "domain": "self.sre",
      "is_self": true,
      "comments": [
        {
          "id": "nx2je6p",
          "author": "hawtdawtz",
          "text": "Google. My team is made of ex Google and meta folks. They couldn’t wait to leave meta",
          "score": 25,
          "created_utc": "2026-01-01 12:20:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx2pb3q",
          "author": "nderflow",
          "text": "I know 3-5 ex-Google SREs who went to Meta.  None remain there now.\n\nReasons probably vary.",
          "score": 21,
          "created_utc": "2026-01-01 13:12:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx6mbc8",
              "author": "aectann001",
              "text": "I know people who did Meta-Google-now Meta again. As usual with these companies, you will find all sorts of experiences (:",
              "score": 2,
              "created_utc": "2026-01-02 02:14:05",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nx334f8",
          "author": "mxmumtuna",
          "text": "To answer your questions, the interview is the same for all PE roles, there are not multiple types as there are at Google, and it would require an interview to condensed switch to SWE, but it’s not uncommon to do so. During the loop there is an internals/troubleshooting round which is not particularly difficult, imho. \n\nMeta is pretty shitty now (as is Google), but it does still pay well. \n\nSounds like you could be a better fit for a SWE role there, of which there are many many more available.",
          "score": 12,
          "created_utc": "2026-01-01 14:49:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx52g4c",
              "author": "blitzkrieg4",
              "text": "Not having SRE at all, Meta's PEs are closer to an SE-SRE at Google",
              "score": 3,
              "created_utc": "2026-01-01 21:02:22",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nx5jkrg",
                  "author": "mxmumtuna",
                  "text": "That’s not true at all, hence why it requires multiple coding interviews of LC medium/hard as well as system design. \n\nSource: former PE leadership at Meta",
                  "score": 3,
                  "created_utc": "2026-01-01 22:31:24",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nx4axmo",
          "author": "raulmazda",
          "text": "I was an SRE-SWE at Google (before they wrote the book), and I was a founding engineer in the PE org at Facebook (before the Meta rename).\n\nI have opinions.\n\nGoogle culture is very different than Facebook culture, and as a result SRE and PE are necessarily different. The role has to fit into the culture and org to be effective. Facebook/Meta was more adhoc and flexible, Google has always been structured and organized (and mired in process).\n\nNeither is better than the other, it's ultimately about whether you're optimizing for rate of change and failing fast, or optimizing for slower, methodical, higher quality change (that may never actually ship).\n\nOn the systems and network interviews: this may be the gray beard talking, but IMO if you can't pass them, you probably shouldn't be an SRE at Google. Everybody who does large scale systems needs to understand the fundamentals.",
          "score": 10,
          "created_utc": "2026-01-01 18:42:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx2rrwi",
          "author": "rb2k",
          "text": "The production engineering role is not split like the SRE one is at google. That being said, different people in the role obviously have different skill sets. You don’t have to be perfect in all of the coding/systems/networking/architecture/… areas, but you should at least be passable in some and good in the others.",
          "score": 6,
          "created_utc": "2026-01-01 13:31:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx447ec",
          "author": "PaSsWoRd4EvAh",
          "text": "Production Engineers are hired into a single role and go through a common interview loop: coding, troubleshooting, design, and behavioral. I’ve moved between five or six different teams during my time at Meta, working on everything from large-scale distributed services that the entire company depends on to new products. What the day-to-day looks like depends on the team and the individual. Personally, I spend a large percentage of my time writing design docs and code, and I don't think that is going to change anytime soon. I have been able to avoid teams that view PE as SRE because I want to work on big problems—not just reliability and scalability. This has allowed me to build new services, work on product features, and generally operate as a member of the SWE team. All of this is a long way of saying that many PE teams don’t actually work on low-level systems (or really need to be low-level experts); they only need to be able to function higher in the stack.",
          "score": 3,
          "created_utc": "2026-01-01 18:09:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx52cgm",
          "author": "Pad-Thai-Enjoyer",
          "text": "I’m a Meta PE. In my team, we spend more than half of our time writing diffs (PRs) but some of those are simple config changes. It’s not just about classic SRE stuff like dashboard and alerts, you’ll have to do that, but I also have opportunities to work on larger projects from the ground up which is nice. People here are quite smart too.\n\nMeta culture is kinda rough, my team is probably above average in culture but it still adds a lot of artificial pressure. I would personally stick with Google if I were you.",
          "score": 3,
          "created_utc": "2026-01-01 21:01:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxc1f86",
          "author": "OneMorePenguin",
          "text": "After 10 years at Google, I went to Facebook.  It was horrible.  Coding standards are low.  I saw C++ code with not a single comment and the arguments to functions had no descriptions.  I was an SRE with Newsfeed team.  We sat near them, but not with them.  We were just their gofers and padding the oncall rotation.  I had a good project where I worked with someone from another team making changes to the Newsfeed service, but I worked mostly with the kernel engineer and not the newsfeed engineers.  No documentation.  After a year, I changed teams to a one in networking.  It was just as bad and I left Facebook after another disappointing year.\n\nThe other SREs I knew weren't really SREs.  They found a niche project/area to own.  It's been a number of years, but I doubt it has changed much.\n\nGoogle has much better tooling, standards, documentation and you can learn SOOOOOO much!  I never saw a single design doc at FB!",
          "score": 2,
          "created_utc": "2026-01-02 22:26:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx6n9k7",
          "author": "aectann001",
          "text": "All PEs take the same kind of interview. These include ones on internals/system debugging skills as well. So, you have prepare to those at the very least.\n\n\nWhile there are teams where you almost never need to ssh to machines or touch whatever low-level stuff, there are lots of teams where you do + those skills are helpful for better understanding why things are going wrong with your service upper in the stack.\n\nIf you consider interviewing/joining this company, this probably needs to change:\n\n> I can't remember a time when I SSH'ed into a production server once in my whole time there.",
          "score": 1,
          "created_utc": "2026-01-02 02:19:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx6r74a",
          "author": "bitcraft",
          "text": "Meta hiring is a complete cluster fuck.  I was in limbo for about a week when both my recruiter and coordinator quit and nobody told me.\n\nThen I go through the interviews and get a single sentence rejection in an email from somebody I’ve never talked to.",
          "score": 1,
          "created_utc": "2026-01-02 02:43:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx6wfbi",
          "author": "Scaawt",
          "text": "I’m also quite curious. About to start interviewing for Meta PE as well. Best of luck to you.",
          "score": 1,
          "created_utc": "2026-01-02 03:15:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx2n941",
          "author": "Cautious_Number8571",
          "text": "I am not in Meta and i am sorry I might not be helpful to answer your question but can you help me understand what it takes to become SRE in google . What type of candidate google interview and what do they ask in interview",
          "score": -9,
          "created_utc": "2026-01-01 12:55:22",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pu1oab",
      "title": "Remote work in SRE field",
      "subreddit": "sre",
      "url": "https://www.reddit.com/r/sre/comments/1pu1oab/remote_work_in_sre_field/",
      "author": "Hayhayalian",
      "created_utc": "2025-12-23 18:44:45",
      "score": 31,
      "num_comments": 43,
      "upvote_ratio": 0.84,
      "text": "How many of you are working 100% remote or hybrid and how many are required to go full time into the office? How rare or common fully remote work is for others in this field. I am currently fully remote but considering looking but it seems a lot of the postings I come across are in office or mostly in office.\n\n  \n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/sre/comments/1pu1oab/remote_work_in_sre_field/",
      "domain": "self.sre",
      "is_self": true,
      "comments": [
        {
          "id": "nvlcfrj",
          "author": "rmullig2",
          "text": "The people who have fully remote jobs are holding onto them for dear life. They don't want to return to office.",
          "score": 85,
          "created_utc": "2025-12-23 19:12:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvnpe6w",
              "author": "slayem26",
              "text": "This is true. As some with 100% remote job, I agree with whatever you said.",
              "score": 13,
              "created_utc": "2025-12-24 03:17:41",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nvnv1pq",
                  "author": "slashedback",
                  "text": "Same, and yes. My entire team is remote and the situation is ideal. The ops/incident situation is not ideal but the entire team and management chain being remote is 1,000% ideal. 🤘",
                  "score": 7,
                  "created_utc": "2025-12-24 03:54:19",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nvlbx6d",
          "author": "hijinks",
          "text": "I've been 100% remote for 13 years now. So I was doing it pre-covid. Its way easier to find a remote job now then it was pre-covid but a lot harder then it was in 2021. \n\npre-covid it helped to have a in-demand skill that not a lot of people had. I dove head first into kubernetes before EKS was even a thing and was one of the few people who raised their hand during the first kubecon on who was running kubernetes in production. So I was able to find a new job a few years before covid pretty easily since I knew Kubernetes when not a lot did.",
          "score": 35,
          "created_utc": "2025-12-23 19:10:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvl7nrx",
          "author": "thecal714",
          "text": "I've been fully remote most of my SRE career, but have recently taken a role that requires me to go into the office Tuesdays and Wednesdays. Hopefully, I'll be able to negotiate fully remote again in the future.",
          "score": 19,
          "created_utc": "2025-12-23 18:49:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvl7xtp",
              "author": "AdorableFriendship65",
              "text": "Good luck!",
              "score": 2,
              "created_utc": "2025-12-23 18:50:32",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nvlwoyl",
          "author": "jjthexer",
          "text": "Been remote in this field since covid. An important detail is your level though. I would assume if you are mid level and below the opportunities of fully remote are less than if you’re operating at a senior capacity. \n\nDon’t foresee this ever being an issue for me, and I don’t believe I will ever work in an actual office again in my lifetime. But I guess I won’t say never :D\n\nEdit: Location is also probably a determining factor.",
          "score": 7,
          "created_utc": "2025-12-23 20:58:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvlm864",
          "author": "mfinnigan",
          "text": "I'm 100% remote with the option of going into our HQ if I want. That's my company's policy for essentially everyone (there are some IT jobs that require onsite of course - helpdesk for walkups and physical interaction with people or equipment.)",
          "score": 3,
          "created_utc": "2025-12-23 20:02:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvl805m",
          "author": "lefos123",
          "text": "Finding a company to allow remote work pre-covid was rare but they existed. During covid everyone went remote. Now we are in a “post lockdown” haze where some companies still allow it, but from what I’ve seen, they are all going hard on RTO. \n\nMy CEO firmly believes that if you are at home you aren’t working. And many in his position share his views. \n\nBest of luck on your hunt!",
          "score": 8,
          "created_utc": "2025-12-23 18:50:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvlxm48",
              "author": "abuani_dev",
              "text": ">  My CEO firmly believes that if you are at home you aren’t working. And many in his position share his views. \n\nI firmly believe that CEO's in office aren't working. And many in my position share my views.",
              "score": 13,
              "created_utc": "2025-12-23 21:03:22",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nvmo0yu",
                  "author": "monoatomic",
                  "text": "Literally the only class of people I know who are regularly using AI are directors and above, which says a lot about their actual value",
                  "score": 5,
                  "created_utc": "2025-12-23 23:26:50",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nvm97r8",
          "author": "engineered_academic",
          "text": "Fully remote. I think the RTO mandates will suddenly go away when companies who paid for huge leases on offices die off or their leases expire. My belief is that people who are extroverted like most C suites tend to be love being in the office because it lends itself very much to performative work; whereas fully remote work is only judged by your output. I have never had a problem delivering value in a fully remote position and having that value be visible. My other belief is the people who love RTO are those who have shitty home lifes or kids that they don't set boundaries with.",
          "score": 6,
          "created_utc": "2025-12-23 22:03:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvsd05y",
              "author": "Imnotyoursupervisor",
              "text": "Exactly. Leases, tax agreements with the city, and upper management avoiding going home to the wife and kids.\n\nPeople who would never be asked where they were just hanging out at the office at 7pm. Go home, man.",
              "score": 2,
              "created_utc": "2025-12-24 22:31:27",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nvmeglq",
          "author": "alopgeek",
          "text": "I’ve been 100% remote since about 2016\n\nBut my company makes hardware and software to enable remote workers.",
          "score": 4,
          "created_utc": "2025-12-23 22:32:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvlsi3i",
          "author": "robscomputer",
          "text": "I've been remote since COVID, but some jobs treat it differently. For most of my career, I've been local to the office, so my being remote was always granted, but technically, my work location is in the office. Once you're listed as \"working in the office\" since hire, the rules can significantly change. At one place of work, they wanted to bring people in and even asked a team member who was hired full-remote to suddenly show up at the office (located 500 miles away). \n\nMy current place is much better, and they respect working from home, but it does come at a great cost. Non-stop meetings and spending the entire day on the screen.",
          "score": 2,
          "created_utc": "2025-12-23 20:36:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvmnq9v",
              "author": "monoatomic",
              "text": "> spending the entire day on the screen.\n\nYou mean camera-on meetings, or something else?",
              "score": 2,
              "created_utc": "2025-12-23 23:25:04",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nvnb3dh",
                  "author": "robscomputer",
                  "text": "It's mostly meetings that are back to back, plus trying to get your work done in time. It feels like that we're all cutting down our lunch breaks to make up time lost. We don't have a camera policy so that allows me to work while in meetings but it's still time sinks.",
                  "score": 1,
                  "created_utc": "2025-12-24 01:48:01",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nvm06l2",
          "author": "kellven",
          "text": "I go in one day a week. Though I’m moving to a larger company next year that is 12 days a month in office.",
          "score": 2,
          "created_utc": "2025-12-23 21:17:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvm7ly6",
          "author": "desispeed",
          "text": "Goto office 1 day a month and I work about 10min away from it …love it.   Feel like it’s getting rare for sure",
          "score": 2,
          "created_utc": "2025-12-23 21:55:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvm9yrf",
          "author": "Joped",
          "text": "I've been 100% remote for \\~8 years and 3 different companies.  The ONLY way I would consider an in office or hybrid position is if the market is really bad and I am having trouble finding work.  Luckily the company I would for currently has no plans for RTO and has a LOT of remote employees.  Like literally my entire team is remote.",
          "score": 2,
          "created_utc": "2025-12-23 22:07:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvmk1zd",
          "author": "gilmorenator",
          "text": "Fully Remote here 👌",
          "score": 2,
          "created_utc": "2025-12-23 23:03:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvp4psi",
              "author": "tobylh",
              "text": "Ain't it the life?",
              "score": 1,
              "created_utc": "2025-12-24 10:33:06",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nvnsoej",
          "author": "Nighttraveler08",
          "text": "From Argentina to USA remote work. Sad part I work 14-22 local time :(",
          "score": 2,
          "created_utc": "2025-12-24 03:38:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvvuegc",
          "author": "drosmi",
          "text": "A couple of years ago two of us were hired as remote.  The company was mostly remote until late 2024 then anyone within 45 minutes of the office has to show up 3 times a week.  The company has stated it would like us to no longer be remote and my coworker has since moved states to be within a few miles of headquarters.  As the only remote employee on the team i am now nervous.",
          "score": 2,
          "created_utc": "2025-12-25 15:58:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvxend9",
          "author": "DoubleBagger123",
          "text": "I am working as an SRE for a top prop trading company, I got lucky though as im working the mid shift, 10-7 and they had trouble filling that position",
          "score": 2,
          "created_utc": "2025-12-25 21:35:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvlid6i",
          "author": "mrloulou",
          "text": "I’ve been fully remote for over 6 years (plus 3 years with some very light on site: kick off meetings and sporadic collab with key individuals). It means the job market for me is very limited. I won’t entertain hybrids or even those “fully remote” roles that need you in once a month. I’m just waiting till the market flips again and employers realise remote roles are beneficial for both parties.",
          "score": 3,
          "created_utc": "2025-12-23 19:43:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvnfpk3",
          "author": "raisputin",
          "text": "If I had to go into an office…I’d find a different job",
          "score": 1,
          "created_utc": "2025-12-24 02:17:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvp60b7",
          "author": "tobylh",
          "text": "I started my current job in 2022 when there was a lot of remote roles about.\n\nAt my place, the entire platforms team is fully remote, but we're the only ones. Everyone else is back to three days a week in the office now. \n\nVery, very glad my contract states I'm remote. I never want to go back to office work and they'd have to pry this job from my cold, dead hands. It suits me down to the ground and I'd say I'm far more productive at home as I'm not surrounded by the constant distraction of other humans.\n\nFunnily enough, I looked at other roles today to see if they were more office or hybrid, and the ones I found were all fully remote, so it seems they are still out there...",
          "score": 1,
          "created_utc": "2025-12-24 10:45:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvpkz6d",
          "author": "bhannik-itiswatitis",
          "text": "I just love it. I love my job. I thank God for it everyday",
          "score": 1,
          "created_utc": "2025-12-24 12:54:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvr2ek5",
          "author": "adamasimo1234",
          "text": "Go in 4 times a week.",
          "score": 1,
          "created_utc": "2025-12-24 18:01:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvrh3ef",
          "author": "DobeyDobey",
          "text": "Ive been remote 10 years. My last remote job got bought and wanted hybrid. So I swapped jobs and took a pay cut to be fully remote. I don’t regret it.",
          "score": 1,
          "created_utc": "2025-12-24 19:20:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvwfgih",
              "author": "Hayhayalian",
              "text": "If you don't mind me asking, what amount of pay cut do you think is reasonable to have a remote job?",
              "score": 1,
              "created_utc": "2025-12-25 18:04:10",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nvxl8zq",
                  "author": "DobeyDobey",
                  "text": "I live in the New England area. But I took a 35k pay cut. To me not having to commute or take a train and being able to have more free time in my life is worth it. I can wake up walk over to my office etc. I do miss occasionally walking over to talk to someone but it’s not worth it to me 😂😂. Good luck!",
                  "score": 1,
                  "created_utc": "2025-12-25 22:15:23",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nvsci6w",
          "author": "Imnotyoursupervisor",
          "text": "100% remote since Covid but they’re bringing people back that are near an office 2026.\n\nI don’t think SRE is part of that list or will be. We’re all over the world.",
          "score": 1,
          "created_utc": "2025-12-24 22:28:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvwfhgx",
          "author": "sigmoia",
          "text": "100% remote in EU. I let go off a FAANG offer due to not wanting to waste time on commute for an extra few thousand bucks.",
          "score": 1,
          "created_utc": "2025-12-25 18:04:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvx5btn",
          "author": "jeff_meyers-1",
          "text": "I was 60% remote pre-covid, went to 100% remote during covid and have stayed that way.  I actually built out a dedicated office space above my garage and it works great.    I’ll never go back to the daily commutes, but I’m only 13-14 months to retirement.",
          "score": 1,
          "created_utc": "2025-12-25 20:37:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw6e4no",
          "author": "Actual_Storage_3698",
          "text": "well , i have a question for the people who work remotely. How do you handle on-call when the whole team is remote and spread across time zones? Any tips that have help you reduce burnout?",
          "score": 1,
          "created_utc": "2025-12-27 11:44:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwd1490",
          "author": "tigidig5x",
          "text": "Full remote here, but I would need better pay as soon as possible. So Id probably jump ship again the next year, still fully remote.",
          "score": 1,
          "created_utc": "2025-12-28 13:42:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvm90kc",
          "author": "thewormbird",
          "text": "I'm split on this. I'm currently hybrid-as-needed. My company prefers people on-site and make extremely rare exceptions for 100% remote hires.\n\nI don't see companies going back to 2020/2021 remote culture.",
          "score": 1,
          "created_utc": "2025-12-23 22:02:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvmwf8v",
          "author": "-ghostinthemachine-",
          "text": "I've only ever done SRE remote, but I think that the push towards data sovereignty and the return of private datacenters could shift that somewhat. Generally when your team, your servers, and your users are global, there isn't a compellingly reason to sit your team in an office waiting for a phone call which usually comes in the dead of night.",
          "score": 1,
          "created_utc": "2025-12-24 00:17:28",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pyrdhc",
      "title": "Should SRE be coding as part of the development cycle",
      "subreddit": "sre",
      "url": "https://www.reddit.com/r/sre/comments/1pyrdhc/should_sre_be_coding_as_part_of_the_development/",
      "author": "Mission-Clue-9016",
      "created_utc": "2025-12-29 16:53:43",
      "score": 24,
      "num_comments": 43,
      "upvote_ratio": 0.8,
      "text": "Question - do you all feel SRE should be coding things lime circuit breakers, retries into applications or “just” guiding developers on the best pattern to do this ?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/sre/comments/1pyrdhc/should_sre_be_coding_as_part_of_the_development/",
      "domain": "self.sre",
      "is_self": true,
      "comments": [
        {
          "id": "nwl2b6c",
          "author": "Heavy-Report9931",
          "text": "Coding for tooling around the application.  \nenvironment setup automation, provisioning of resources  \nall the observability stuff etc.\n\nbut the application itself?  \nit should be treated as a blackbox and best left to the application owners and developers.\n\nwhy?  \nbecause if the SRE is busy fixing the dumpster fire that is the application  \nwho is taking care of  everything else?\n\nSRE's become the bottle neck because SRE's support more than one application.  \n\n\nthis is a hill i am willing to die on and will definitely pitch this to my company's upper management.  \nbecause I am in this hellscape right now.  \n  \nthe above also facilitates developers being sloppy. because \"SRE will take care of it\".\n\n\n\nif something breaks and its not related to environment or network or resources.  \nsend that shit straight to the Application owners and Developers so they will be forced to  fix their BS and hold them accountable for it.",
          "score": 36,
          "created_utc": "2025-12-29 18:11:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwm2snu",
              "author": "1NSAN3CL0WN",
              "text": "As an SRE myself, digging every now and then through application code, you can find some interesting dumpster fires. \n\nMy usual first response is to bring it up to the relevant managers to get it fixed. Because lazy developers would take your tooling to use it in manners not intended. \n\n“SRE will take care of it” is the laziest excuse, and I will call it out. Being called out at 3 a.m., and identifying problems within seconds of coming online, while the application engineers couldn’t see or deduce it from the monitoring, has forced us to have more knowledge-sharing sessions than I would like to admit. But ultimately, we only guide on applications.  \n\nThe only time we really get involved is when we started a whole new vertical, with new languages and frameworks, making decisions, building CICD, setting up environments, and building all the relevant services, before actually hiring a team to take over. That was our fun project for 2025.",
              "score": 11,
              "created_utc": "2025-12-29 21:06:09",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nwkpssd",
          "author": "ReliabilityTalkinGuy",
          "text": "SRE are SWE, just with a slightly different focus than product-driven feature development. They should absolutely be coding.",
          "score": 67,
          "created_utc": "2025-12-29 17:13:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwl277b",
              "author": "rodblagojevic",
              "text": "👍 SRE without SWE isn’t actually SRE",
              "score": 28,
              "created_utc": "2025-12-29 18:11:24",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nwvue4k",
              "author": "mayday_live",
              "text": "Feels like another example of people redefining SRE into “yet another dev team,” instead of reliability engineering.",
              "score": 1,
              "created_utc": "2025-12-31 08:34:27",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nwz213r",
                  "author": "gordonmessmer",
                  "text": "SRE \\*is\\* another dev team... one that's focused on reliability. That's how the term originated.",
                  "score": 1,
                  "created_utc": "2025-12-31 20:33:29",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwpctcm",
          "author": "md____ub",
          "text": "Your question title and description aren't looked under the same lens, and hence the confusion. SREs must definitely be coding - e.g. the circuit breakers, retries etc. Now whether that's considered a part of the development lifecycle varies a lot, because it also includes the application development itself, which SREs aren't supposed to do unless it's an application that solely focuses on toil reduction (not a business application).",
          "score": 5,
          "created_utc": "2025-12-30 09:27:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwkomzk",
          "author": "blitzkrieg4",
          "text": "Absolutely. The SRE knows how to code so they're best deployed if they know and work on the code they support. Implying they are only coding after development is over is implying old school \"over-the-wall\" deployment to prod",
          "score": 14,
          "created_utc": "2025-12-29 17:08:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwldvhy",
              "author": "opshelp_com",
              "text": "But an SRE may be responsible for the reliability of multiple products/services. I don't think it's feasible for them to be a substitute for developers that work on a specific service.\n\nI get that they need to know how to code, but in my experience they're not responsible for fixing developers code and can often just push it back to them if they push something bad",
              "score": 7,
              "created_utc": "2025-12-29 19:04:51",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nwnqo10",
                  "author": "blitzkrieg4",
                  "text": "Yeah it's a little different in that case. Still, if you're working at a place where you can dry up code and modularize stuff like health checks and rate limits, I could see that being an SRE responsibility.\n\nAlso remember development is actually _in_ the SRE hierarchy of needs in the first book, albeit near the top. Not every company is Google, but here is what they say about it: \n\n> One of the key aspects of Google’s approach to Site Reliability Engineering is that we do significant large-scale system design and software engineering work within the organization.\n\nThey then go on to list a bunch of internal SRE led products and services they have",
                  "score": 2,
                  "created_utc": "2025-12-30 02:23:32",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwlt362",
          "author": "daedalus_structure",
          "text": "If you can pull those things out into the infrastructure, and you should be doing so, SRE should be handling it. \n\nIf you can decouple some specific functionality and expose it as a service that SRE provides that the product team consumes, that also works, although I don't recommend due to the likelihood that those aren't well maintained just due to how much SRE gets asked to do with limited capacity. \n\nBut SRE shouldn't be in the product writing code. That's a recipe for them to cause problems in code bases they don't fully understand. \n\nIf your product engineers can't code up a circuit breaker or your product team refuses to prioritize non-functional requirements like availability, you have major problems in your product org.",
          "score": 4,
          "created_utc": "2025-12-29 20:18:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwmkp8x",
              "author": "SnarkyRoomba",
              "text": "Exactly this. Having SRE do product coding means the separation of duties is leaking. Some companies do resource sharing under budgeting constraints - and that's where such anomalies can happen.\n\nGiving team general direction, best practices - sure. But oh boy, working on bugs? That's completely out of context for an SRE.\n\nBug is found in testing, reviewed by PM, fixed by dev, retested by QA and approved back by PM. If you're not doing it now, some future cautionary tale will make you.",
              "score": 2,
              "created_utc": "2025-12-29 22:34:21",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nwl4e1o",
          "author": "borg286",
          "text": "The coding I do is adding monitoring pipelines. I write dashboard code, platform solutions.",
          "score": 4,
          "created_utc": "2025-12-29 18:21:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nws4syv",
          "author": "sigmoia",
          "text": "SREs aren't sysadmins. Their strong suite should be software engineering. \n\n\nAfterall the canonical definition is - SRE is what happens when you put SWEs to run ops. YAML mungers and k8s admins aren't necessarily SREs.\n\n\nBut also, the term SRE means different things at different companies. It's almost as overloaded as Staff Engineer. ",
          "score": 2,
          "created_utc": "2025-12-30 19:14:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwssor3",
          "author": "duebina",
          "text": "Having been on both sides of that equation, anywhere from 2000 to 2025, the trend has been to offload the retries to your infrastructure tooling, such as istio or something on kubernetes.  However, the most resilient and mature applications that I have ever had the pleasure of maintaining have had developers who had the mental capacity to implement proper retry mechanisms within their application. If developers get lazy, then they are creating tech debt for you, and that is not a team player.  Therefore, I stand firm on the SRE educates developers on how to make resilient code if they are not doing it themselves.",
          "score": 2,
          "created_utc": "2025-12-30 21:09:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwknkro",
          "author": "Jazzlike_Syllabub_91",
          "text": "SREs should be guiding developers on best practices/patterns to do this. The SRE may not know the details of the application to effectively build in the circuit breakers and retries - so it's best left to the dev team -while the sre responds to issues that occur in production",
          "score": 3,
          "created_utc": "2025-12-29 17:02:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwkq6hg",
              "author": "ReliabilityTalkinGuy",
              "text": "This feels absolutely incorrect to me. SRE are SWE, and they should know and be maintaining the code base of what they're responsible for. To just \"respond to issues\" would make them no different than a traditional sysadmin.",
              "score": 4,
              "created_utc": "2025-12-29 17:15:20",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nwl3wlf",
                  "author": "Heavy-Report9931",
                  "text": "follow up to this.  \nisn't this unscalable?\n\nthis works if you are supporting one code base/application  \nwhat if you are supporting more  than one? each application's codebase as complex as the other?\n\nas products evolve and new products get introduced. how will maintaining the codebase of 5-10 different applications be feasible for the SRE team?\n\nis it not better to let the team who made it be responsible for it?  \nthey already know all the context to it anyway.\n\nplus if you're doing the developers job who is doing your job?.\n\ni really want to know your take on this.  \nbecause I am wrestling with this at work",
                  "score": 1,
                  "created_utc": "2025-12-29 18:19:08",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nwl08a4",
                  "author": "OneMorePenguin",
                  "text": "Not all SRE are SWE.  Google has SWE SRE roles and you are interviewed as a SWE primarily.  You can change to a SWE role without having to interview.  Systems SRE will be required to code, but more like devops roles.  ",
                  "score": 0,
                  "created_utc": "2025-12-29 18:02:24",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwnu3kz",
          "author": "smuzzu",
          "text": "There is no one definition of SRE. In some companies coding is more around tooling and observability, in others they want you to do IaC, and lastly some want SRE to fix bad app code. I believe its just too broad of a spectrum. But definitely SRE knows coding and its best practices for reliability, and should be involved in design, and at least review so developers know where to focus and why so their app is more reliable. Another big role is to guard error budget so delivery speed moves with customer experience. But again.. I believe it's just a bit too much for one role and I would prefer if it split, even if it's more expensive.",
          "score": 3,
          "created_utc": "2025-12-30 02:41:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwlkv45",
          "author": "skspoppa733",
          "text": "SRE’s should do SRE work, not app development.",
          "score": 1,
          "created_utc": "2025-12-29 19:38:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwopdm5",
              "author": "ReliabilityTalkinGuy",
              "text": "App development is part of SRE work. What if you need a new data sharding mechanism built? What if you need to move the storage layer from solution A to solution B? What if you need to expose deep internal state to external mechanisms? Those would all touch the application codebase and they are all extremely classic SRE work. ",
              "score": 0,
              "created_utc": "2025-12-30 05:59:11",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nwqw3bd",
                  "author": "skspoppa733",
                  "text": "Sounds like an unfocused team who is trying to do everything whose members likely complain of burnout. Platform Engineers and others exist to shoulder some of that burden.",
                  "score": 2,
                  "created_utc": "2025-12-30 15:47:03",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nww1nzw",
                  "author": "Spiritual_Dig_8913",
                  "text": "this sounds like a catch all for work that the devs dont want to do. SRE should focus on reliability... they should be involved in the architecture and design of solutions and can (not must) code these where appropriate, but your description above sounds more like 'everything else but feature development'.",
                  "score": 1,
                  "created_utc": "2025-12-31 09:43:56",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwphbh1",
          "author": "tushkanM",
          "text": "SRE should be coding not just to develop their own observability/monitoring/automation stuff , but to train their 'engineering muscle'. They shouldn't deal with domain-specific application features, but be \"near it\" with observability packages and other \"development support\" stuff, so they can quickly understand bottlenecks and critical flows in a \"D\" day  when things go south.",
          "score": 1,
          "created_utc": "2025-12-30 10:09:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwr1vz5",
          "author": "heramba21",
          "text": "SREs should be coding things that help SWEs focus on what they do best. Coding features and fixing bugs.",
          "score": 1,
          "created_utc": "2025-12-30 16:14:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx04sme",
          "author": "GeraldTruckerG",
          "text": "SRE shouldn’t be just coding or just advising — they should own the execution boundary.\nIf SREs only write libraries (circuit breakers, retries), devs will misuse or bypass them under delivery pressure.\nIf SREs only “guide,” reliability becomes optional and drifts.\nThe highest-leverage model I’ve seen is:\nSRE defines non-negotiable guardrails (timeouts, retries, backoff, stop conditions)\nThose guardrails are enforced by shared primitives or platform controls\nDevs still own business logic, but cannot ship paths that violate reliability constraints\nIn other words:\nSRE shouldn’t be writing product code, but they should be writing the code that decides when code is allowed to run.\nReliability fails most often not because logic is wrong, but because systems continue when they shouldn’t.",
          "score": 1,
          "created_utc": "2026-01-01 00:16:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwnfvw8",
          "author": "the_packrat",
          "text": "Yes but watch for the massive opportunity cost if SRE specialists are just acting as generic software engineers. \n\nIt is absolutely fine if that’s the business emergency but SRE will be way more effective in uplifting multiple engineers at a time rather working on one piece of software. A framework that automatically adds retries to all the application that use it (and getting that adopted) training or practices like postmortem review tha make all engineers wary of building stupid retry logic rather than fixing it for one application. Etc. \n\nYou are absolutely correct to worry about incentives of developers don’t have to care about this stuff because not only will they not do it, they’ll make other choices that make it harder for anyone to do it later. Really the only solution to this is to mostly have SRE doing the leveraged stuff I described where the developers are still in the loop but are better at their job.",
          "score": 1,
          "created_utc": "2025-12-30 01:23:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwlt8rh",
          "author": "TheCTOLife",
          "text": "I wouldn't expect them to be coding day to day.  I would expect them to be helping with the design of whatever feature product engineering is working on, doing code reviews, fixing bugs, and looking at data and metrics to identify systemic issues within the ecosystem, and then fixing them (with either code changes or infra changes)",
          "score": 0,
          "created_utc": "2025-12-29 20:19:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwm4yz2",
          "author": "evergreen-spacecat",
          "text": "How on earth could you guide skilled developers in coding without writing a single line of code yourself? It would be like having a blind teacher teaching you to read and write.\n\nNon the less, SREs are SWEs and unless code is the major part of your work day, you are not a SRE",
          "score": 0,
          "created_utc": "2025-12-29 21:16:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwopmz0",
              "author": "ReliabilityTalkinGuy",
              "text": "Correct. I don’t know why we have to have this conversation over and over every few weeks or so.\n\nThere is nothing wrong with being a sysadmin. I was one for a very long time! But you’re not doing SRE work if you’re not coding. ",
              "score": 0,
              "created_utc": "2025-12-30 06:01:13",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nwvtszr",
                  "author": "YouDoneKno",
                  "text": "The distinction is SREs should not be focused on coding business features. System + Testing + CI/CD requires plenty of coding",
                  "score": 0,
                  "created_utc": "2025-12-31 08:28:46",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwn6npq",
          "author": "hornetmadness79",
          "text": "I've fixed code only when I was told there was no bandwidth to fix a critical problem. It's not something I do often, but sometimes there isn't time for politics or ego.",
          "score": 0,
          "created_utc": "2025-12-30 00:32:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwolfcg",
          "author": "AxiomOfLife",
          "text": "I swear my SRE team makes data dog reports that are almost useless and just start meetings when there’s outages. otherwise they are less then useless",
          "score": 0,
          "created_utc": "2025-12-30 05:29:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwt8yvd",
          "author": "[deleted]",
          "text": "[deleted]",
          "score": 0,
          "created_utc": "2025-12-30 22:26:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwug76a",
          "author": "gordonmessmer",
          "text": "The problem with this question is that the answers are going to mostly tell you about the relative experience of the person answering and the operational maturity of their employer, rather than telling you how to make the best possible use of the resources that you have available.\n\nThat is, if you ask experienced developers this question, they'll tell you that SRE should be involved in the early design and architecture for application development in order to ensure that the service is designed to scale well and mitigate the failure of individual components.\n\nBut if you ask someone less experience, someone whose experience is mostly troubleshooting and responding to pagers, they'll tell you that SRE should focus on incidence response and involvement in development isn't critical.",
          "score": 0,
          "created_utc": "2025-12-31 02:26:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwyd4t4",
          "author": "Effective-Badger-854",
          "text": "This post completely misses the point of what SRE is.",
          "score": 0,
          "created_utc": "2025-12-31 18:23:03",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pw5zpz",
      "title": "Do you use synthetic browser monitoring?",
      "subreddit": "sre",
      "url": "https://www.reddit.com/r/sre/comments/1pw5zpz/do_you_use_synthetic_browser_monitoring/",
      "author": "Training_Mousse9150",
      "created_utc": "2025-12-26 14:49:00",
      "score": 22,
      "num_comments": 26,
      "upvote_ratio": 0.92,
      "text": "Just trying to gauge how common synthetic browser testing is nowadays.\n\n\n\nDo you have automated \"bots\" running through your critical flows (login, checkout, etc.) on a schedule, or do you rely on unit/integration tests and error reporting (Sentry, etc.)?\n\n\n\nWhat's your tool of choice?",
      "is_original_content": false,
      "link_flair_text": "ASK SRE",
      "permalink": "https://reddit.com/r/sre/comments/1pw5zpz/do_you_use_synthetic_browser_monitoring/",
      "domain": "self.sre",
      "is_self": true,
      "comments": [
        {
          "id": "nw1eh7i",
          "author": "Huge_Janus_Returns",
          "text": "A ton for applications that need to be as close to 4 9s as possible that arent necessarily always being used. \nAlso use it to check SaaS vendor availability + vendor \nSLA verification.",
          "score": 10,
          "created_utc": "2025-12-26 15:51:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "nw3mr2m",
              "author": "Wicaeed",
              "text": "I would like to more...",
              "score": 1,
              "created_utc": "2025-12-26 23:03:43",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nw1i7pt",
              "author": "Training_Mousse9150",
              "text": "Are you using some simple service to ping the start page? Or a browser test that also tests the accessibility of CSS, JS, and the loading speed of the entire frontend application?",
              "score": 0,
              "created_utc": "2025-12-26 16:11:19",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nw1qf38",
                  "author": "Huge_Janus_Returns",
                  "text": "Loading speed of specific journeys that are business critical and then a content verification step for correctness. Provides availability. Step by step + whole journey latency + correctness. \n\nBe weary of using vendor API endpoints as these can sometimes not be a direct mirror of the applications availability/have different SLAs.",
                  "score": 3,
                  "created_utc": "2025-12-26 16:54:53",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nw1mlfq",
          "author": "neuralspasticity",
          "text": "Yes, how else would you measure your customer experience and end to end reliability\n\nSUM (Synthetic User Monitoring) is a key part of understanding the actual impacts your consumers are receiving. \n\nA common issue you’d not see otherwise is network issues, DNS problems, and \n\nCatchpoint is great for this.",
          "score": 7,
          "created_utc": "2025-12-26 16:34:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "nw1pf21",
              "author": "babbleon5",
              "text": "Why not just use RUM?  Maybe like the other response, the apps don't get used that often?",
              "score": 3,
              "created_utc": "2025-12-26 16:49:36",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nw2bfmu",
                  "author": "Hi_Im_Ken_Adams",
                  "text": "What if your service goes down in the middle of the night when there are no users using it?",
                  "score": 3,
                  "created_utc": "2025-12-26 18:44:47",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nw1pwpd",
                  "author": "neuralspasticity",
                  "text": "What if you don’t have users in the locations you want to test,  current and active? Each test point is also not identical, as RUM reports vary. \n\nYou’re also testing something completely different. \n\nYet both do work good hand in hand.",
                  "score": 3,
                  "created_utc": "2025-12-26 16:52:11",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nw2acrw",
                  "author": "Patrick_LM",
                  "text": "Synthetic tests (like via Catchpoint) can identify issues in geographic regions, locations, or using specific ISPs before end-users encounter them.",
                  "score": 1,
                  "created_utc": "2025-12-26 18:39:15",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nw1z63y",
          "author": "FormerFastCat",
          "text": "Yes, we use them for standardizing response time measurements for applications (baselines for regions). \n\nAlso heavily used for enduring availability for HA apps that have periods of low utilization during off hours. \n\nHowever we're probably only using 40% of what we were using as compared to 5 years ago... We're invested heavily into RUM observability",
          "score": 1,
          "created_utc": "2025-12-26 17:41:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "nw2ic90",
              "author": "Training_Mousse9150",
              "text": "We currently use only RUM from Sentry, but I understand that it's quite expensive, and we can't track 100% of traffic. We currently use 1%, but unfortunately, that doesn't cover all the pages that are important to us. What percentage of traffic do you collect for RUM?",
              "score": 1,
              "created_utc": "2025-12-26 19:21:03",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nw2jxi9",
                  "author": "FormerFastCat",
                  "text": "100% for all of secure and 25% of non secure (public). I work in an industry that has financial and legal implications so it's a cost of doing business,(RUM).",
                  "score": 1,
                  "created_utc": "2025-12-26 19:29:34",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwczs89",
          "author": "tushkanM",
          "text": "Absolutely - they are primary  P1 alerts.",
          "score": 1,
          "created_utc": "2025-12-28 13:33:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwhyif5",
          "author": "FlexFanatic",
          "text": "Yes,  New Relic has been good for this.",
          "score": 1,
          "created_utc": "2025-12-29 05:35:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwiwonm",
          "author": "AmazingHand9603",
          "text": "We rely on a mix. Unit and integration tests for build time, but always synthetic monitoring for prod. Sentry is great for after the fact, but synthetic is the only way we spot network chaos, broken logins, expired certificates, or the classic CDN blip before anyone screams at support. We used to do just basic ping checks, but now it’s headless browser or bust, so you see what the user sees. Tried a few tools over the years, and honestly, CubeAPM surprised me with how much coverage it gives for the cost. I also like how it ties into the wider OpenTelemetry stack so it’s not a total pain to swap out later if needed.",
          "score": 1,
          "created_utc": "2025-12-29 10:40:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw17tjb",
          "author": "ManyInterests",
          "text": "Synthetic traffic is used in pre-prod. I don't see a ton of value in doing that in prod unless you're a fairly low traffic website.... but operators of low traffic sites don't tend to invest in robust testing even on a shift left basis, let alone in production. Maybe there's an MSP use case there.",
          "score": 0,
          "created_utc": "2025-12-26 15:14:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "nw1s5m4",
              "author": "vortexman100",
              "text": "How do you do this in preprod? All of our site issues are those that cannot be reproduced by themselves, but only arise when multiple concurrent but independent actions happen (think db locking), so I am looking for a way to replay prod traffic on staging environments. Is this something you have experience with?",
              "score": 2,
              "created_utc": "2025-12-26 17:04:07",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nw1x56k",
              "author": "cos",
              "text": "> I don't see a ton of value in doing that in prod unless you're a fairly low traffic website\n\nUser traffic is unpredictable.  I don't just mean the volume, I mean what kinds of queries or pages they're visiting, what kinds of auth, etc.  What if an important feature breaks but it only accounts for 0.2% of normal traffic, and it's \"only\" failing 1/3 of the time?  What if some user client application is spamming retries with some poison query that elicits a 5xx from your site and nobody else is affected?\n\nBlack box probes under your own control, testing the specific pages, paths, and features you told them to, give you extremely valuable signal, both for troubleshooting and for setting SLOs on.\n\nMonitor user traffic too, of course.  But what you get from that is not a replacement for what you get from synthetic traffic.",
              "score": 1,
              "created_utc": "2025-12-26 17:30:34",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nw46iw4",
                  "author": "ManyInterests",
                  "text": "That's a fair point. Thanks for that explanation. The synthetic traffic generation was implemented to solve a specific need for QA/testing that is only relevant in a pre-production environment. Before having any kind of synthetic traffic generation, there wasn't any need to improve upon existing monitoring/alerting in production.\n\nI can see what you mean and how it is a very useful signal in production. Maybe if we had blackbox probes before, we wouldn't have needed some of the other monitoring/alerting that is currently in place.",
                  "score": 1,
                  "created_utc": "2025-12-27 01:02:35",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nw27l4s",
              "author": "placated",
              "text": "I’m baffled by this logic. What is your rationale for not doing synthetics in prod?",
              "score": 1,
              "created_utc": "2025-12-26 18:24:58",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nw46293",
                  "author": "ManyInterests",
                  "text": "Never been a need for it. We implemented synthetic traffic generation to solve a specific testing/QA concern that specifically arises in preprod, not for monitoring/alerting in production.",
                  "score": 1,
                  "created_utc": "2025-12-27 00:59:41",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nwa1gen",
              "author": "nooneinparticular246",
              "text": "It’s useful in Prod if you want to catch something before your customers. Sometimes it’s easier to just have a check for “make sure red button triggers green toast” than to try and passively monitor for an issue. Really boils down to the use case.",
              "score": 1,
              "created_utc": "2025-12-28 00:08:51",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1py8t9r",
      "title": "Transitioning to SRE",
      "subreddit": "sre",
      "url": "https://www.reddit.com/r/sre/comments/1py8t9r/transitioning_to_sre/",
      "author": "ddarkpassenger",
      "created_utc": "2025-12-29 01:33:27",
      "score": 14,
      "num_comments": 7,
      "upvote_ratio": 0.82,
      "text": "I have over 15 years of experience, the first 7 years as a Software Engineer, mostly for highly distributed systems with millions of users. I\n\nAfter that 5 years between Red Hat and AWS as a Solutions Architect working with Kubernetes on-premises and on Cloud providers, supporting customers migrating large systems to containers and/or Cloud.\n\n1 year at Google Cloud as a Software Engineer.\nMy team was dismantled, and I had some time to find another role or take severance and work elsewhere. I took the second route because I prefer remote work. I have a master’s degree in Computer Science, and during these 6 years on tech companies I got over 20 certifications: including CKA, CKAD, CKS and most Professional-level certifications from AWS and GCP.\n\nThe last 3 years I have been working on a SaaS startup as a SRE, and I believe my background helped me a lot, and I could be happier with the role. \n\nBut while looking outsider, especially for roles on bigger companies, it seems that my profile is not good enough, it seems that they only look at 3 years as SRE and immediately reject.\n\nI would like to hear from other people involved in hiring SREs where they think I should be regarding level and the risk of hiring someone like me.\n\n\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/sre/comments/1py8t9r/transitioning_to_sre/",
      "domain": "self.sre",
      "is_self": true,
      "comments": [
        {
          "id": "nwgyr7x",
          "author": "bhannik-itiswatitis",
          "text": "From what I’ve seen, yourodds are high.\nSREs are rare (relatively) many companies want them and there are not many people with that role.\n\nYou have good experience, actually great experience. Your certifications, yes they matter, having CKA, CKS and CKAD is gold. \nI’ve seen a lot of people with way less experience and qualifications getting the job.\n\nThere’s simply nothing to recommend other than making sure you have a good grasp of using AI in this context. SREs are not, at least for now, affected as much as SWEs by the rise of AI. a big part of our role is knowing how to use it to automate, well, everything.\n\nCheers, I hope it’ll be a smooth transition",
          "score": 17,
          "created_utc": "2025-12-29 01:54:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwgx7do",
          "author": "happyn6s1",
          "text": "I would say current market is not as good as a few years ago.\n\nso fix your resume first",
          "score": 11,
          "created_utc": "2025-12-29 01:45:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwgzp66",
          "author": "OneMorePenguin",
          "text": "Your kube and cloud experience should be sufficient to get you and SRE role, perhaps as and SRE that helps run/maintain kube clusters.  Your coding experience for distributed systems with high volume is also a selling point.\n\nI'll be honest; it's tough out there.  Leverage your connections on linked in and seek referrals.\n\nAnd start applying for jobs and getting some interview experience.  It takes a while to understand what kind of questions you are going to be asked and think about scenarios and stories that will illustrate your experience.\n\nI've seen quite a few jobs that are looking for Senior SRE and they want 3 years of SRE experience.",
          "score": 9,
          "created_utc": "2025-12-29 01:59:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwhywep",
          "author": "ManyInterests",
          "text": "I was hired at a FAANG company as an SRE after doing 10 years as a software engineer last 7 working on cloud platform engineering. I think your background, as you've stated it, is more than enough to land the role you want at most companies. \n\nThe trouble is just that big companies are getting hundreds or thousands of applications for every opening. It's hard to even get someone to look at your resume.",
          "score": 7,
          "created_utc": "2025-12-29 05:38:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwgyptn",
          "author": "bitcraft",
          "text": "Hiring is a cluster fuck.  Make sure the resume is good. ",
          "score": 3,
          "created_utc": "2025-12-29 01:54:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwkb8mu",
          "author": "cabindirt",
          "text": "I would have no hesitation hiring someone with your background, so it is probably that you need to work the HR/recruiting system better. Side note, I have the opposite problem- I wanna do more dev work and although I've been writing Java for 10 years I've been pigeonholed in devops/SRE.",
          "score": 2,
          "created_utc": "2025-12-29 16:04:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwoo0r4",
          "author": "Best-Repair762",
          "text": "I would hire you as an SRE but not as a senior. Your SWE experience is very valuable for SRE, and you have already dipped your toes in it with your 3 years (and in a startup too).\n\nWhy not look at dual roles at smaller cos or startups? Larger companies will shy away from hiring you because they want to minimize risk. Startups are more flexible, you can experiment and learn more, and possibly switch between roles (depending on the org) more easily.",
          "score": 2,
          "created_utc": "2025-12-30 05:48:45",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pwsz0y",
      "title": "The State of DevOps/SRE Jobs in H2 2025",
      "subreddit": "sre",
      "url": "https://www.reddit.com/r/sre/comments/1pwsz0y/the_state_of_devopssre_jobs_in_h2_2025/",
      "author": "thomsterm",
      "created_utc": "2025-12-27 08:36:05",
      "score": 13,
      "num_comments": 11,
      "upvote_ratio": 0.77,
      "text": "  \nHi guys, since I did an **2025 H1** report a followup was in order for the **H2** period.\n\nI'm not an expert in data analysis and I'm just getting started to get into the analysis of it all but I hope this will benefit you a bit and you'll get a sense of how the second part of this year was for the DevOps/SRE market.\n\n[https://devopsprojectshq.com/role/devops-market-h2-2025/](https://devopsprojectshq.com/role/devops-market-h2-2025/)",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/sre/comments/1pwsz0y/the_state_of_devopssre_jobs_in_h2_2025/",
      "domain": "self.sre",
      "is_self": true,
      "comments": [
        {
          "id": "nwi8eoa",
          "author": "OneMorePenguin",
          "text": "That graph matches my experience.  I had almost no interviews this summer, but it picked up in October!\n\nA lot of companies doing AI want you to have experience in the field of AI, whether it is SRE or DevOps.  I've done both DevOps and SRE and I didn't make it past the first non-recruiter interview because I had no specific experience with AI specific needs.",
          "score": 6,
          "created_utc": "2025-12-29 06:55:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwii208",
              "author": "thomsterm",
              "text": "thanks for the info, did you maybe land a role in the meantime?",
              "score": 2,
              "created_utc": "2025-12-29 08:22:45",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwijw7t",
                  "author": "OneMorePenguin",
                  "text": "Yes I did!",
                  "score": 2,
                  "created_utc": "2025-12-29 08:40:12",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nx9bthr",
              "author": "r2th",
              "text": "I curious why it have to Octorber",
              "score": 1,
              "created_utc": "2026-01-02 14:36:01",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nwbfta9",
          "author": "TeleMeTreeFiddy",
          "text": "How does this math up? \n“median salary of $177,500 and an average of $265,858 globally”",
          "score": -6,
          "created_utc": "2025-12-28 05:18:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwc6t9c",
              "author": "Skylis",
              "text": "Because median != average?",
              "score": 7,
              "created_utc": "2025-12-28 09:19:34",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nwhey7x",
                  "author": "TeleMeTreeFiddy",
                  "text": "Oh you think I don’t know the difference? Let’s give you 4 in a set of 5, I want you to calculate what the last one would have to be: $170,000, $175,000, $177,500, $215,000, and X. Find X. Then you’ll understand.",
                  "score": -2,
                  "created_utc": "2025-12-29 03:28:35",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1punwmn",
      "title": "Execs pushing for using another team’s platform",
      "subreddit": "sre",
      "url": "https://www.reddit.com/r/sre/comments/1punwmn/execs_pushing_for_using_another_teams_platform/",
      "author": "OutrageousEngineer94",
      "created_utc": "2025-12-24 13:54:27",
      "score": 10,
      "num_comments": 20,
      "upvote_ratio": 0.78,
      "text": "Recently I started working in a new product company as a lead SRE, in the hiring process it was made clear I am going to lead the SRE team that will be building/refactoring their current production platform and ways of deployment to support the new scale the company will start working at in the next few years.\n\nThe product is in the defence industry and each product instance is deployed in full isolation (different AWS account) due to compliance requirements. The team’s way of deploying and provisioning was less efficient (they use IaC, have a CICD and everything, but is a bit of a mess and that’s why they wanted to increase headcount and so they can have resources to fix that part). All good so far.\n\nHowever, a bit after joining and starting to work on the new platform, the execs decided that the internal platform engineering team will actually solve this problem. They have created a platform that can deploy and destroy clusters for internal teams, it is all clickops driven and is not bad… for testing purposes. Nothing is persisted properly, they use X-plane operators and persist all of their config in etcd, everything is super flaky and constantly reconciles all clusters with the source of truth, they often do a bad change and take down all internal clusters.\n\nThe guy leading the team made a big pretentious presentation to the executives and got them to think my team is totally shit at doing this job and his team should deliver everything from now on. The execs have decided to pigeonhole my team in incident management only and take all automation responsibility away. \n\nI tried to talk to the execs and explain that the SLIs for both teams are very different and we essentially solve different problems but they like the idea of building this umbrella platform that does everything and want to fund their team with 2X the engineers so my team is a “client” and just passes on the requirements to them to build anything. \n\nI wonder if anyone else has experienced such a situation and is this a normal approach? Also, should I just look at exiting immediately, market is quite shit and I am not sure if I can find something at the same pay, but on the other hand, if I get pigeonholed into incident management only, then I don’t see how I would really develop my career in the future.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/sre/comments/1punwmn/execs_pushing_for_using_another_teams_platform/",
      "domain": "self.sre",
      "is_self": true,
      "comments": [
        {
          "id": "nvpvqk0",
          "author": "the_packrat",
          "text": "Unless you’d like to make your job entirely politics and continuing this fight, you are not describing a fixable situation.",
          "score": 21,
          "created_utc": "2025-12-24 14:05:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvqbjoy",
              "author": "OutrageousEngineer94",
              "text": "I am honestly super tired of the politics and I feel like this is burning me out more than the rest",
              "score": 9,
              "created_utc": "2025-12-24 15:36:56",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nvwl4hw",
                  "author": "Silver_War9564",
                  "text": "SRE is a thankless hell. Thinking mailman if I get laid off. ",
                  "score": 1,
                  "created_utc": "2025-12-25 18:37:00",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nvxroa8",
              "author": "p1xl",
              "text": "I agree with this. I was in OP's exact situation. It only worked when I had a manager that was doing all of the politics. When he left, I tried to push back on the changes and it was an impossible task.",
              "score": 1,
              "created_utc": "2025-12-25 22:55:54",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nvpzqmu",
          "author": "lefos123",
          "text": "Glad to hear it’s not just my outfit pulling stunts like this. \n\nOur “SRE” team became the dumping ground for engineers seeking a promo. They’d build a big flashy thing then dump it on us broken AF. Rinse and repeat 50 times.",
          "score": 16,
          "created_utc": "2025-12-24 14:30:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvqfdt2",
              "author": "TechnicallyCreative1",
              "text": "I'm a data engineer. In the last year corp has dumped three separate AI tools that are going to 'revolutionize' the way so do our internal business. Someone got a promotion, couldn't figure out how to properly deploy it then they dumped it on my team to 'finalize the details'. They were absolutely garbage, didn't meet spec, didn't have tests, didn't have builds, were deployed in prod yet the guys who made them got a ton of love from the c suite. Now everyone is asking where they are and why they're not on prod as if taking that heap of shit and materializing it in an actual thing was the easy part. \n\nWhy do c suites never ask important details.. ever",
              "score": 6,
              "created_utc": "2025-12-24 15:57:21",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nvqjef4",
                  "author": "Stephonovich",
                  "text": "> Why do c suites never ask important details\n\nBecause they have no incentive to do so as long as the company is profitable. I hate it too, but I’ve concluded that most people — especially management — are looking out for themselves, and only themselves. Why is a Manager going to tell a Director that the thing their team was working on is shit? And even if the Director knows that it’s shit, why would they tell their boss that? Can they put some bullshit numbers about productivity up in a presentation? If so, that’s it. By the time anyone bothers to cross-check results with promises, there will be other things to deal with.",
                  "score": 5,
                  "created_utc": "2025-12-24 16:18:35",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nvzu6fv",
                  "author": "Extra_Taro_6870",
                  "text": "all time a \"c\" needs is 3-4 years, then if everything works good on powerpoint, s/he moves to next company/promotion. I am exhausted seeing very good tech genius lacking communication skills, and no desire to close the gap and so non-tech gets the management positions, making that level politics only work, rather than science/tech/facts especially on software.",
                  "score": 1,
                  "created_utc": "2025-12-26 08:13:32",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nvpyptr",
          "author": "jdizzle4",
          "text": "It sounds strange to me that an SRE team would be responsible for building out the platform, that does sound like a different teams responsibility, at least in the companies i’ve worked at. Sure SRE should write code and do automation etc, but in the name of reliability and uptime, not just providing a platform. Maybe thats just a different philosophy. If you want to help fix the platform team, see if you can join that team instead?",
          "score": 13,
          "created_utc": "2025-12-24 14:23:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvq6cnb",
              "author": "monkeysnipe",
              "text": "If you do not provide the platform then what is the code and automation you work on that is in the name of “reliability”?\n\nI feel like OP is referring to SWE-SRE team that works on both running and building the platform rather than just configuring a few things and monitoring the system.",
              "score": 5,
              "created_utc": "2025-12-24 15:08:17",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nvqg737",
                  "author": "jdizzle4",
                  "text": "> then what is the code and automation you work on that is in the name of “reliability”?\n\nyou really can't think of anything? really depends on the companies needs, but things like optimizing services, improving autoscaling, incident investigation and remediation tools, improving deployment pipelines, service management/inventory tools, writing chaos experiments etc. \n\nLike for sure SRE works on infrastructure and platforms, but in the companies I've worked at, ownership and creation of those platforms fell under an actual platform team, who was a partner to the SRE teams. I think it all comes down to the company.",
                  "score": 5,
                  "created_utc": "2025-12-24 16:01:38",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nvuta4z",
          "author": "tanzWestyy",
          "text": "I'd approach this in a collaborative fashion. You're the Lead SRE so do some leading. Can you collaborate with the team with their new platform and help them see the light? Hard to really comment when we dont know the social dynamics. Just roll with it OP and make the best of it. Sounds like a good opportunity to step in and enforce common SRE practices. Automation with IAC helps sets standards and consistency (negates the flakiness). Can you set up some observability of the new platform yourself and point out some gaps?",
          "score": 6,
          "created_utc": "2025-12-25 11:05:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw6usuw",
          "author": "Humble_Ad_502",
          "text": "ugh the platform team will solve everything pitch is so common. seen it play out twice now and it usually ends with overloaded platform eng team that cant keep up with actual product needs while the client teams get blamed for slow delivery\nthe incident management pigeonhole isnt necessarily a dead end tho. we turned that into an advantage at my last place - incident response became the forcing function for better observability, runbooks, and postmortems that actually drove reliability improvements. ended up owning oncall tooling too (pagerduty initially, migrated to inc⁤ident. io when we needed better slack integration for postmortems)\nif youre stuck there anyway, might be worth making inc⁤ident mgmt the thing that proves reliability value to execs. i found that execs typically get the downtime metrics at the very least which helps. what does their current inc⁤ident process even look like?",
          "score": 2,
          "created_utc": "2025-12-27 13:52:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvq31ws",
          "author": "daedalus_structure",
          "text": "Look for internal job opportunities if you don't want to head back into the job market, your team just got deprecated and your leadership chain isn't worth much if they couldn't head this off.",
          "score": 3,
          "created_utc": "2025-12-24 14:49:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvqbgn6",
              "author": "OutrageousEngineer94",
              "text": "My leadership chain doesn’t really care, they got their titles and everything in the corp world and they welcome the reduced responsibilities as long as their own KPIs are good",
              "score": 2,
              "created_utc": "2025-12-24 15:36:28",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nvqhrk8",
          "author": "happyn6s1",
          "text": "totally get your frustration, unfortunately, in a corp, showing PPT sometime is considered more valuable to leaders than keep the site up and running.\n\nso you could choose \n\n1) change to a different company\n\n2) keep doing fire fighting work and let leader know the platform is subpar\n\n3) work with platform team and improve the shit",
          "score": 2,
          "created_utc": "2025-12-24 16:09:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvukza6",
          "author": "lordlod",
          "text": "If you continue down this path you want to have very clear monitoring that differentiates failures in the other team's platform and failures in the product.\n\nThe politics is going to continue to be messy. You want to have firm footing, especially for postmortems.\n\nI would also look at leaving or moving internally, this isn't what you want to be doing. I don't think being in the role for a few months while you find a new position will impact your career.  Your mental health should be a far bigger concern.",
          "score": 1,
          "created_utc": "2025-12-25 09:34:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvzv50p",
          "author": "Extra_Taro_6870",
          "text": "well if they are not SRE minded and if you are not in the close loop, the result is obvious: another failure. One way you may think to position yourself, to oversee your part without touching development and take the credit. Said otherwise, play project manager role, define requirements, tests, acceptance criteria etc etc, let them do the heavy lifting. if it fails, the responsible team is obvious. if succeeds, you will have a big participation and  a good experience. I see this as an opportunity, not a blocker.",
          "score": 1,
          "created_utc": "2025-12-26 08:23:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvsli7v",
          "author": "AminAstaneh",
          "text": "> The execs have decided to pigeonhole my team in incident management only and take all automation responsibility away. \n\nThis is **not** an SRE program. Time to seek greener pastures.",
          "score": 1,
          "created_utc": "2025-12-24 23:28:43",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1py0qxn",
      "title": "How do SRE teams decide when to change a risky production service?",
      "subreddit": "sre",
      "url": "https://www.reddit.com/r/sre/comments/1py0qxn/how_do_sre_teams_decide_when_to_change_a_risky/",
      "author": "llASAPll",
      "created_utc": "2025-12-28 19:55:46",
      "score": 10,
      "num_comments": 13,
      "upvote_ratio": 0.86,
      "text": "I’m curious how this decision is handled on SRE-led teams.\n\nConsider a production service that is inefficient or overprovisioned, but has tight SLOs and a meaningful blast radius if something goes wrong.\n\nWhen this comes up, how do teams usually decide whether to make changes versus accepting the inefficiency?\n\nIs this driven by error budgets or formal reviews, or does it mostly come down to experience and judgment?\n\nInterested in how this works in practice.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/sre/comments/1py0qxn/how_do_sre_teams_decide_when_to_change_a_risky/",
      "domain": "self.sre",
      "is_self": true,
      "comments": [
        {
          "id": "nwf6cxn",
          "author": "clearclaw",
          "text": "First thing, I (try to) get that thing onto a high frequency update/upgrade cycle.  Get it moving!  If there are worries about stability, crank it up high and get the supporting dev team to have skin in every single update and deploy -- they are on-call too, right?  The goal is to hammer that thing until it is normal and low-risk like everything else, and is updated without concern in the middle of busy hours like everything else.\n\nBeing scared of your own product, of deploying your own product, of managing your own product is...silly.  Don't do that.",
          "score": 10,
          "created_utc": "2025-12-28 20:17:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwf8qbc",
          "author": "ziadsaber",
          "text": "Lerroy jenkins is the way.",
          "score": 14,
          "created_utc": "2025-12-28 20:29:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwfrwet",
              "author": "Physical-Layer",
              "text": "The only valid answer",
              "score": 3,
              "created_utc": "2025-12-28 22:03:47",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nwf3g5w",
          "author": "GrogRedLub4242",
          "text": "persons decide it. humans. may or may not be teams involved, and irrelevent",
          "score": 11,
          "created_utc": "2025-12-28 20:03:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwfr9du",
          "author": "skspoppa733",
          "text": "Assess business risk, weigh against other priorities, schedules, etc. \n\nSome degree of imperfection is acceptable.",
          "score": 5,
          "created_utc": "2025-12-28 22:00:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwfhm2n",
          "author": "FormerFastCat",
          "text": "Risk vs Reward.",
          "score": 3,
          "created_utc": "2025-12-28 21:13:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwhmr7t",
          "author": "unitegondwanaland",
          "text": "Modern architecture is resilient enough to make simple rightsizing changes without disrupting a service. There are few exceptions like Elasticsearch that require careful planning but for the most part, there's nothing so fragile that you avoid touching it... again, talking about modern architecture.",
          "score": 3,
          "created_utc": "2025-12-29 04:15:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwhtez1",
          "author": "Ordinary-Role-4456",
          "text": "Depends a lot on the team and how much the pain of inefficiency is hurting.   \n  \nSometimes people just absorb the cost forever because the risk is seen as too high. Some places lean on error budgets to make the call, while others do some risk assessment with stakeholders and make a plan. Usually, it needs someone to push for it and make enough noise to prioritise the work.",
          "score": 3,
          "created_utc": "2025-12-29 04:58:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwfeduo",
          "author": "kellven",
          "text": "Data is the key. How much $ is this costing the org. How much can we save by fixing it, how much time is it going to take to fix. \n\nAt some point those 3 data points will no longer make sense to leadership and they will drive the change. While you can force a change through leadership it’s alot easier when it’s “their Idea”",
          "score": 2,
          "created_utc": "2025-12-28 20:57:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwizlfd",
          "author": "yolobastard1337",
          "text": "old skool ops managers wake up and mandate a mountain of paperwork, which is more about arse covering than risk reduction.",
          "score": 2,
          "created_utc": "2025-12-29 11:06:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwgd168",
          "author": "the_packrat",
          "text": "Seeking efficiency is usually a bad starting point. People forget that efficiency leads to fragility and that leads to way more people work which for most services is a bad trade off. \n\nLikewise running close to the line means a lot of reactive work to adjust sizing and resources or risk SLO impact. \n\nSo first work on capturing what those tradeoffs really are and try to understand why this was set up like that. I’ve seen really money important services get broken because someone thought an extra $5000 cost was “inefficient” without once talking to people about business impact.",
          "score": 1,
          "created_utc": "2025-12-28 23:54:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwm2q8s",
              "author": "clearclaw",
              "text": "This, so much this, but it also so much money spent on building for back swans when eating the failure would be reasonable.",
              "score": 1,
              "created_utc": "2025-12-29 21:05:49",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nx0pjk1",
          "author": "yonly65",
          "text": "If the service is fragile (i.e. risky to change), then we typically overprovision it on capacity or instance counts, and then conduct a progressive rollout. The inefficiency of overprovisioning is the cost of the fragility plus the SLO.\n\nIt also makes for good incentives with the business and product leads: want a more efficient product with the same SLO? Spend the engineering effort to reduce the fragility of the service!",
          "score": 1,
          "created_utc": "2026-01-01 02:28:23",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1q0dyt8",
      "title": "I built a small open source incident response helper",
      "subreddit": "sre",
      "url": "https://www.reddit.com/r/sre/comments/1q0dyt8/i_built_a_small_open_source_incident_response/",
      "author": "RubNo8609",
      "created_utc": "2025-12-31 14:14:45",
      "score": 9,
      "num_comments": 2,
      "upvote_ratio": 0.84,
      "text": "Hey folks,\n\nI built a small open source tool called incident-helper while working as an SRE and dealing with real production incidents.\n\nThe idea is simple. During incidents, we often lose time figuring out what to check first, what commands to run, and how to document things properly. This tool acts like a lightweight CLI assistant that guides you through incident response with structured prompts and checklists.\n\nIt is not an AIOps or magic AI tool. It just helps you stay calm and systematic when things are broken.\n\nWhat it does\n\n\t•\tGuides you through incident triage step by step\n\n\t•\tSuggests common checks and commands for typical production issues\n\n\t•\tHelps capture notes and timelines during incidents\n\n\t•\tWorks locally, no cloud dependency\n\nI built it mainly for myself, then cleaned it up and open sourced it in case others find it useful.\n\nGitHub:\n\nhttps://github.com/malikyawar/incident-helper\n\nFeedback, issues, or ideas are welcome. If it saves you a few minutes during an incident, that is already a win.\n\nThanks for reading.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/sre/comments/1q0dyt8/i_built_a_small_open_source_incident_response/",
      "domain": "self.sre",
      "is_self": true,
      "comments": [
        {
          "id": "nx1hf7w",
          "author": "hatethissubreddit",
          "text": "Have you used HolmesGPT? How is this different and what does your tool offer that HolmesGPT doesn’t?",
          "score": 1,
          "created_utc": "2026-01-01 05:54:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx1vriz",
              "author": "RubNo8609",
              "text": "I haven’t used HolmesGPT. Incident Helper is currently a CLI-based tool focused on helping engineers respond during incidents by providing structured prompts, checks, and guidance rather than AI-driven investigation. It’s intentionally simple right now and more about improving human response and reducing alert fatigue than being a full incident management or AI chat tool.",
              "score": 1,
              "created_utc": "2026-01-01 08:14:03",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1px988r",
      "title": "Work-from-anywhere as SRE",
      "subreddit": "sre",
      "url": "https://www.reddit.com/r/sre/comments/1px988r/workfromanywhere_as_sre/",
      "author": "Impossible-Top-3760",
      "created_utc": "2025-12-27 21:33:17",
      "score": 5,
      "num_comments": 25,
      "upvote_ratio": 0.59,
      "text": "Hey all, I’m new to SRE after a few years in backend dev and ops.\n\nMy job is fully remote, but obviously geo-locked to my country. I’m wondering if any of you are working remote in a way that actually supports digital nomading (working from anywhere, or at least with pretty relaxed time-zone requirements).\n\nIt feels like SRE might be a bit harder for this because of ownership and on-call. Curious if that’s actually the case, or if some of you have made it work.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/sre/comments/1px988r/workfromanywhere_as_sre/",
      "domain": "self.sre",
      "is_self": true,
      "comments": [
        {
          "id": "nw9cgdw",
          "author": "MaruMint",
          "text": "At risk of being downvoted -  as long as you're within the country and fully available for your on-call as required I don't see any problems.",
          "score": 28,
          "created_utc": "2025-12-27 21:50:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "nw9dsyr",
              "author": "volitive",
              "text": "Agree with this. You're a professional. You will be available when on call, you handle how you do it. \n\nIf your Starlink doesn't work, get on 5G. It neither, we'll get you on a PIP if you miss an incident.\n\nSimple. Show up to work.",
              "score": 6,
              "created_utc": "2025-12-27 21:57:30",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nwbh7qt",
              "author": "OneMorePenguin",
              "text": "I worked for a company in CA and we had two people on our team on the east coast.  It was difficult having meetings.  How do you get code reviews in a timely fashion?  There's more than just oncall and working all alone in SRE.  \n\nOur company started offshoring to PL.  It was even worse when they gave my project a TPM in PL and he expected us to have weekly meetings at 8 am since that was as late as PL were allowed to work in their time zone.  Well, that was not possible for a lot of people in the US who had kids to deal with.  And unless you are also fully remote, when are you going to commute to work?",
              "score": 2,
              "created_utc": "2025-12-28 05:29:15",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nwdmods",
                  "author": "PelicanPop",
                  "text": "I think it depends on the needs of the business. When I worked on the east coast US, meetings with west coast folks were fine because a 3hr time difference overlaps most of the working day. Now I work in EU and any meetings we have, we schedule times best for the global team at large which now includes India. It's always within reason and any good workplace would adjust and be understanding of what a global team looks like.",
                  "score": 1,
                  "created_utc": "2025-12-28 15:48:20",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nwk9lb7",
                  "author": "MaruMint",
                  "text": "In elaboration to my previous response:\nI don't expect anyone else to bend to accommodate you if you want to temporarily or permanently move to a wacky new time zone.\n\nWant to go somewhere 3 hours ahead? That's fine! But your 8:00am meeting is now a 5:00am meeting. That's a trade off you agreed to when you went to a new time zone.\n\nWith that said: I know tons of people that happily accept that trade off to work near a beach or near family for a short while. And if you have a super chill manager that's willing to accommodate you, more power to you.",
                  "score": 1,
                  "created_utc": "2025-12-29 15:56:40",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nw9y9xd",
          "author": "happyn6s1",
          "text": "fwiw, the SRE with oncall, most likely you dont need to be at the office. (during the night, weekend, holidays).\n\nso it should be easier to be at remote.\n\n  \nyou do need a stable internet connections (and whatever HR allows), but of course you do need to be accountable (like you cannot just go diving when you are on call).",
          "score": 4,
          "created_utc": "2025-12-27 23:51:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwdpiw2",
          "author": "Big-Minimum6368",
          "text": "It really doesn't matter to me where my team is,so long as they work within company timezone constraints and maintain a physical address in the state we have on record for them.\n\nGet the job done, attend meetings from a quiet place, and I'm fine with it.",
          "score": 2,
          "created_utc": "2025-12-28 16:02:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwgbt2a",
          "author": "goblinviolin",
          "text": "Where you live and work from has legal and tax implications for your company. Many corporate policies do not explicitly state what's allowed for digital nomads, but this is something you should find out while interviewing.\n\nI worked with a guy whose digital nomadism was fine when he officially maintained a residence in a particular country where we had an office. Then he gave up his residence and effectively moved to another country but not in a normal rental (so basically a homeless nomad). That was not OK for HR, apparently.",
          "score": 2,
          "created_utc": "2025-12-28 23:48:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwi9ov5",
          "author": "tushkanM",
          "text": "Fully remote works for \"solo professionals\". If you're a single SRE (how this even feasible?) it's fine, but most likely you're part of the team. In this case you have meetings, collaborations, shared projects etc.   \nBeing physically and time zone isolated from the rest of the team will create a problem both psychologically and performance-wise.",
          "score": 2,
          "created_utc": "2025-12-29 07:06:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwk6hpx",
          "author": "Not_Ayn_Rand",
          "text": "This is more of a company level tax and work authorization issue than anything else from my understanding, and in some cases sanctions and such. And yes, if you have specific on call hours you would be expected during that time, but I've also never seen dev teams I work with that didn't have defined on call hours for escalation anyway.",
          "score": 2,
          "created_utc": "2025-12-29 15:41:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw9bpax",
          "author": "serverhorror",
          "text": "Definitely not something any of our people ate allowed to do.\n\nFirst reason: Insurance problems, if there's any kind of incident, it will be hell to deal with and we just don't want any of that.",
          "score": 2,
          "created_utc": "2025-12-27 21:46:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwa0hfq",
              "author": "sizer",
              "text": "Been full remote SRE for years (Hired post covid). What kind of vertical are you in?",
              "score": 2,
              "created_utc": "2025-12-28 00:03:25",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nw9orz1",
              "author": "mxmumtuna",
              "text": "and tax.",
              "score": 2,
              "created_utc": "2025-12-27 22:57:20",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nwa69zg",
                  "author": "thecal714",
                  "text": "Shouldn't matter so long as you're not in another state for longer than a month and maintain a permanent residence.",
                  "score": 4,
                  "created_utc": "2025-12-28 00:35:46",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwr6zqb",
          "author": "heramba21",
          "text": "Unless there are legal reasons, you MUST be able to work completely remotely as an SRE. If you can't let your team work totally independently and still keep up reliability, you have process/tech issues to fix.",
          "score": 1,
          "created_utc": "2025-12-30 16:38:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw9owqu",
          "author": "smerz-",
          "text": "Imho SRE requires communication with other teams which works best in the same timezone as these other teams.\n\nIn person is even better compared to remote imho for communicating.\n\nNot sure if it's the best suited role for this.",
          "score": -9,
          "created_utc": "2025-12-27 22:58:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwd1s3g",
              "author": "smerz-",
              "text": "Not the most popular opinion i guess 🤷‍♂️🙈",
              "score": 1,
              "created_utc": "2025-12-28 13:46:39",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nwdofep",
                  "author": "jac4941",
                  "text": "I've worked on multiple fully-globally-distributed SRE teams that have been incredibly high-performance. What you're suggesting isn't just unpopular, it's not true for high-performers. It's only required for ineffective middle management running low-performing teams and the folks pushing this harder don't underatand tech: they have interests in offices being populated because they wrote the check. Peddling it because you don't understand async work makes you a less effective SRE overall. When the problem is in a region on the other side of the world at any given point, why do you think it matters which desk my laptop is sitting on to connect to the network and get shit done? Hint: it doesn't.\n\nThe best advice I ever received that made this easily doable: make yourself a coroutine.\n\nTo add: I really enjoy face-to-face physical time with my coworkers. Part of being a human and yeah I'd like to be around them as often as I can. But in no way is it a requirement for effective completion of difficult, complex work.",
                  "score": 1,
                  "created_utc": "2025-12-28 15:57:17",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}