{
  "metadata": {
    "last_updated": "2026-03-02 09:15:17",
    "time_filter": "week",
    "subreddit": "sre",
    "total_items": 12,
    "total_comments": 107,
    "file_size_bytes": 132856
  },
  "items": [
    {
      "id": "1revgil",
      "title": "I’m burned out.",
      "subreddit": "sre",
      "url": "https://www.reddit.com/r/sre/comments/1revgil/im_burned_out/",
      "author": "BoringTone2932",
      "created_utc": "2026-02-26 00:40:12",
      "score": 41,
      "num_comments": 22,
      "upvote_ratio": 0.87,
      "text": "I’m burned out and I realize it. I used to love my job, loved the technical challenge and loved automation, self healing, loved tackling the hard systemic issues. Finding the bug in the code from 3 years ago that’s impacting our clients. There’s things even today, that I truly love doing, but have come to hate it. The seconds of satisfaction are just blown away. \n\nAbout 8 months ago, I took my first SRE role after YEARS in operations and development. Our product is absolute garbage. At first it was fun, I spent weeks optimizing SQL maintenance, built observably from the ground up, ran with FinOps to save millions, optimized autoscaling policies. It was fun. But about 3 months ago we hit a wall. Specifically around November. We had optimized everything around our constraint, and now had reached critical mass whereas the next step was to resolve the critical constraint. There’s no way around it. Without fixing this, there’s no improvement we can do, and, the issue MUST be fixed by development or we are left manually changing and manipulating our scaling policies to avoid user impact, manually recycling clusters, manually responding. And,  dev has been trying to fix it, they are spinning their wheels. The update has been stuck in QA, and here I am for months working late, writing RCAs, snuffing fires all day. \n\nI’m tired of it. I’ve spent months working late, weekends, holidays, just to continue to spend nights away from my family, mentally exhausted. We get a new JIRA that hits the board, and my first thought is, “this isn’t my job, this needs to go away, it’s cleaning up someone else’s screw up.” \n\nI told my manager the other day to kick rocks, it’s an insane amount of effort not to tell people “well that’s stupid” in Trams chats. \n\nI’m the sole dedicated SRE for this product, and it seems like that means “manually run prod while we prioritize new features”\n\nHow do I get out of the SRE burnout? ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/sre/comments/1revgil/im_burned_out/",
      "domain": "self.sre",
      "is_self": true,
      "comments": [
        {
          "id": "o7fn2rj",
          "author": "DandyPandy",
          "text": "> How do I get out of <snip> burnout\n\nFor starters, set some boundaries around your work hours. If it can’t be done in your normal workday, it doesn’t get done.\n\nThen you take a break. Minimum of a week or two. You don’t check email, Teams/Slack, no alerts, nothing work related at all.\n\nHopefully you have a manager you can be honest with about being burned out and they will support you.\n\nIf they aren’t empathetic or you worry they might hold it against you, start looking for a new job. Put in absolutely minimum effort at work and focus on interview prep and interviews. When you get that new job lined up, you give your notice and set your start date so you have a couple of weeks off.",
          "score": 37,
          "created_utc": "2026-02-26 01:13:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ga77w",
          "author": "Hi_Im_Ken_Adams",
          "text": "Your manager is failing you.   Your devs aren’t feeling the pain of fixing their bad code.  You are.  So they are not incentivized to fix it.  Make the Devs be on call.  Your manager should not be approving any new releases until the app is stabilized.",
          "score": 19,
          "created_utc": "2026-02-26 03:25:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7fvpxb",
          "author": "Grandpabart",
          "text": "“this isn’t my job, this needs to go away, it’s cleaning up someone else’s screw up.” This describes burnout PERFECTLY. It happens because your powerless fixing the same problems over and over.",
          "score": 13,
          "created_utc": "2026-02-26 02:02:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7gf6ee",
          "author": "kennetheops",
          "text": "I hate to tell you, buddy, but you gotta take a vacation or quit your job. I've been burned out before, and you gotta put distance between you and the work.",
          "score": 9,
          "created_utc": "2026-02-26 03:56:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7fv9ay",
          "author": "kellven",
          "text": "Option one, take of time off and get some rest. Honestly do this either way, it’s just a job , if you died they would continue on fine. \n\nOption two, get fucking spicy and burn some political capital. Maybe they fire you but that’s half the fun. Start throwing verbal rocks in meetings, some times you gota be the bad guy to get real shit done. \n\nOption 3 find a new job. \n\nSide note if this bugs cost can be translated into a direct cost to the biz , that can really get the ball moving cause now it’s not you pushing but leadership who wants to claim the cost savings. I pitched everything from OS updates to cluster rebuilds in terms of cost savings , and most of my shit don’t just get approved but got direct support from C levels.",
          "score": 8,
          "created_utc": "2026-02-26 02:00:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7gjzxf",
          "author": "doglar_666",
          "text": "I would:\n\na) Scale back work outside normal operating hours\n\nb) Request Devs also be on call for their product\n\nc) Request additional SRE capacity to cover you\n\nd) Take some leave\n\nWhat you have described is not sustainable. Do not normalise it further. The feeling won't disappear quickly. The part you need to work out long term is if any of the burnout is associated with colleagues or the product vs just the situation. Because, you can get past a crap situation, assuming it is fixed satisfactorily. You can't always re-create positive associations with people who've burned you, and are constant reminders of the burnout.\n\nLastly, if you don't feel you can easily take leave, consult a medical professional. Getting signed off for burnout should be all the clarification that a good manager/employer needs that the situation is unsustainable.",
          "score": 5,
          "created_utc": "2026-02-26 04:27:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7i6dsy",
          "author": "imdevin567",
          "text": "Everyone here telling you to take some time off is right, you should definitely do that to curb the burnout. But I'm also gonna offer a different perspective.\n\nYou say \"the devs are trying to fix it\"--the fact that the devs (and their management) understand it needs to be fixed and are actually working on it, is something to be grateful for. More than once in my career, I have been in a similar situation and the work is simply \"not a priority\" to work on because of whatever else they're doing (usually new features). That hurts, because it's basically saying \"my time is more valuable than your time\".\n\nYou mentioned \"it's stuck in QA\"--If it's not being prioritized *enough*, go to management with data on how many incidents and emergency changes you've had, and how many are specifically related to this issue. If it's possible, offer to help QA it because you're a huge beneficiary of the fix.",
          "score": 5,
          "created_utc": "2026-02-26 12:40:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7jkt4e",
          "author": "Wookiemom",
          "text": "Do you not have a Product or OPS person quantifying ‘SRE toil ‘ ? I was that person in a previous job. We had a large , distributed team , pagers and all , 24/7 support and toil was very much part of the most important metrics ( Not to make you folks’ life easier , but to find optimum team size as the platform matured ). If you don’t have a product person , you might have to do the analyzing and quantifying yourself on top of your regular workload .",
          "score": 2,
          "created_utc": "2026-02-26 16:57:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7oie5h",
          "author": "WorkHardPlayLittle",
          "text": "Find a new job, sounds like a sh#t company.",
          "score": 2,
          "created_utc": "2026-02-27 10:50:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7gkac6",
          "author": "ManyInterests",
          "text": "Sole SRE is wild for a company that has millions in cloud spend.\n\nSay you're leaving for a 400K/yr job and ask them to match the salary.",
          "score": 3,
          "created_utc": "2026-02-26 04:29:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ftd3i",
          "author": "tr14l",
          "text": "You remember that you are there for the shareholders and you just push through because ultimately they are the job creators and you just poke computer keys. How you feel doesn't matter when they need to exceed their fiduciary responsibilities. Do you even consider them? I bet if you had you wouldn't be feeling like this",
          "score": 3,
          "created_utc": "2026-02-26 01:49:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7llywk",
          "author": "Least-Secretary1447",
          "text": "Find another fun SRE job - haha\n\n[Brivo.com](http://brivo.com/) has an SRE role open right now in Austin, TX... FTE/onsite for $115-125K + benefits.  \nPrivate Cloud experience required, not just AWS/Azure only.",
          "score": 1,
          "created_utc": "2026-02-26 22:44:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ms7wr",
          "author": "lucaspeixotot",
          "text": "expected, capitalism",
          "score": 1,
          "created_utc": "2026-02-27 02:40:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7msdis",
          "author": "lucaspeixotot",
          "text": "expected, capitalism, not the first, not the last, I hope you get better",
          "score": 1,
          "created_utc": "2026-02-27 02:41:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o84v8aw",
          "author": "International_Tap656",
          "text": " seniors/managers lack leadership and ownership, which always results in high technical debts, at the end, the \"engineers\" sacrifice the most and are considered normal. Get out of SRE, it's a shitty job unless you work with those who actually care about time and leadership. None of the managers or developers spends more time outside workhours than SRE. ",
          "score": 1,
          "created_utc": "2026-03-01 22:56:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7gti0w",
          "author": "eggbean",
          "text": "Take some time out. What income you'll lose is nothing compared to what could happen otherwise.",
          "score": 1,
          "created_utc": "2026-02-26 05:35:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7frtv9",
          "author": "TheDevauto",
          "text": "One way is to consider what its like to be searching for a job for 2 years. 5000+ applications, interviews with 8 companies, 2 to the final and still nothing. I dont think ill ever complain about burnout again.",
          "score": -1,
          "created_utc": "2026-02-26 01:40:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7fsawl",
          "author": "AccordingAnswer5031",
          "text": "You are burned out because you are not getting paid good enough",
          "score": -1,
          "created_utc": "2026-02-26 01:43:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7g3u84",
              "author": "Relevant_Interests",
              "text": "This.",
              "score": -3,
              "created_utc": "2026-02-26 02:48:38",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1re6wm5",
      "title": "My SRE track for kubecon eu ‘26 (one ft. DOOM agents destroying clusters lol)",
      "subreddit": "sre",
      "url": "https://www.reddit.com/r/sre/comments/1re6wm5/my_sre_track_for_kubecon_eu_26_one_ft_doom_agents/",
      "author": "cloudsommelier",
      "created_utc": "2026-02-25 07:39:10",
      "score": 39,
      "num_comments": 1,
      "upvote_ratio": 0.96,
      "text": "Hi hi,\n\nThere are 350+ talks in the KubeCon schedule, and I went through it looking for interesting/cool stories about reliability. I've been doing this for 4 editions, people seem to like it (and I def do lol)\n\nThese are my 6 favorite talks:\n\n**Airbnb: 1000 Services, 1 Year, 0 Downtime**  \nAfter a series of major outages in summer 2023, a five-person team migrated 1,000+ production services from regional to zonal Kubernetes clusters across a 3,000-engineer org with zero user-visible downtime.\n\n**What Survived Production: Operating Game Backends at Million-Player Scale** Futureplay Games, three engineers, millions of players. Talk is specifically about what failed, what stayed, and what proved essential. I like this format because it's honest about tradeoffs rather than presenting a perfect architecture.\n\n**Banking on Reliability: Cloud Native SRE Practices in Financial Services** Five years of SRE at a major Swiss bank, covering how SLOs drove cascading improvements and ending with a live debug session tracking down six 502s per million requests.\n\n**From Alert Fatigue to Self-Healing**  \nI'm skeptical of most \"AI for SRE\" talks but this one is, allegedly, running in production so I’m curious: one of Portugal's largest banks had bad alert fatigue and long MTTR across a multi-cloud platform. They built Crossplane control planes where LLM-powered composition functions automatically triage and remediate Kubernetes alerts. In a regulated banking environment. \n\n**Observing Chaos: Real-Time Monitoring of AI-Driven Kubernetes Destruction**  \nJosh Halley (Cisco) and Ricardo Aravena (CNCF) integrated ViZDoom and KubeDoom so reinforcement learning agents play **DOOM** (!!) *(*yes, the videogame lol*)* against live Kubernetes workloads. As the agents get better, the chaos gets more sophisticated: pods killed, services disrupted, infrastructure stressed. I have no idea what expect but I NEED to see it.\n\n**Kubernetes Autopsy: Live Debugging a Cluster Meltdown** Three engineers reconstruct a real cascading failure live: memory leak triggers OOMKill, destabilizes etcd, corrupts state, triggers a controller storm, brings down the control plane. Minute by minute, using actual logs, metrics, and traces.\n\nI wrote a bit more about each and added times/rooms/links to each in my full list in case you’re interested: [https://rootly.com/blog/the-unofficial-kubecon-eu-26-sre-track](https://rootly.com/blog/the-unofficial-kubecon-eu-26-sre-track)",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/sre/comments/1re6wm5/my_sre_track_for_kubecon_eu_26_one_ft_doom_agents/",
      "domain": "self.sre",
      "is_self": true,
      "comments": [
        {
          "id": "o7ajzeb",
          "author": "WeekSubstantial6065",
          "text": "Great curation — that Kubernetes autopsy talk is basically my nightmare from last spring. We had a nearly identical cascade: memory leak in a sidecar → OOMKills → etcd getting hammered → API server timeouts → controller reconciliation storm. Took us 90 minutes to piece together what happened because we were SSH-ing into nodes one at a time pulling logs.  \n  \nThe thing that killed us wasn't the initial failure, it was the sequential debugging. By the time we'd checked three nodes manually, the problem had already propagated to twenty more. We ended up building a quick script to pull diagnostics from all nodes in parallel (journalctl, kubectl describe, process inspection) and that's when we finally saw the pattern.  \n  \nThat DOOM talk sounds absolutely unhinged in the best way. If the agents learn to target stateful workloads first I'm gonna lose it.",
          "score": 5,
          "created_utc": "2026-02-25 08:19:23",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rh9frt",
      "title": "Trying to figure out the best infrastructure monitoring platform for a mid-size team, what are y'all using?",
      "subreddit": "sre",
      "url": "https://www.reddit.com/r/sre/comments/1rh9frt/trying_to_figure_out_the_best_infrastructure/",
      "author": "Legitimate-Relief128",
      "created_utc": "2026-02-28 18:05:49",
      "score": 29,
      "num_comments": 17,
      "upvote_ratio": 0.96,
      "text": "Seeing a lot of teams reevaluating monitoring stacks that grew organically over time. Common pattern seems to be Prometheus, partially maintained Grafana dashboards, plus custom scripts handling alerting. There’s often budget approval at some point to consolidate into a more unified infrastructure monitoring platform that can support Kubernetes, legacy EC2 workloads, and managed databases in one place.\n\n\n\nTypical priorities seem to be:\n\n\\- Alerting that is actionable and minimizes noise\n\n\\- Centralized log aggregation to reduce tool switching\n\n\\- A learning curve that isn’t overwhelming for the broader engineering team\n\n\n\nWhen researching vendors, many of the marketing pages start to blur together. For teams that have gone through consolidation, which platforms tend to work well in practice? What tradeoffs usually show up after implementation?",
      "is_original_content": false,
      "link_flair_text": "HELP",
      "permalink": "https://reddit.com/r/sre/comments/1rh9frt/trying_to_figure_out_the_best_infrastructure/",
      "domain": "self.sre",
      "is_self": true,
      "comments": [
        {
          "id": "o7x1615",
          "author": "AccountEngineer",
          "text": "One thing that often gets overlooked is vendor support. You don’t want to be stuck with a platform that’s hard to troubleshoot when issues arise. Always check the quality of the support before committing to a tool and consider user reviews as a part of your decision making process.",
          "score": 9,
          "created_utc": "2026-02-28 18:10:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o81pp3h",
              "author": "AllBusinessRob",
              "text": "I would say pick open source monitoring solutions and let Opus/GPT/etc be your support.",
              "score": 1,
              "created_utc": "2026-03-01 13:14:15",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7x4vp3",
          "author": "kellven",
          "text": "Prometheus stack + pagerduty. Noting else gets close on features and cost. Theres exporters for most things, and if needed you can vibe code exporters really easy. ",
          "score": 9,
          "created_utc": "2026-02-28 18:29:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7x1dvm",
          "author": "Putrid_Ad6994",
          "text": "Good documentation is key when onboarding. Without it you’ll end up spending more time figuring things out than actually using the tool.",
          "score": 5,
          "created_utc": "2026-02-28 18:11:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7x4ljt",
          "author": "glorifiedanus223",
          "text": "Monitoring tools need to fit with your current workflows. If they don’t, you’re just adding overhead.",
          "score": 3,
          "created_utc": "2026-02-28 18:27:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7ythm3",
              "author": "rearendcrag",
              "text": ".. also current workloads, culture and expertise. Consider outsourcing monitoring in there isn’t enough engineers to maintain self-managed or they don’t have the right skills. Training may also be an option. What works for me (kube prom stack + Thanos + Loki) may not for you for a number of reasons.\n\nAnd finally, dashboard ownership doss not automatically sit with devops/SRE/whatever. Dashboards are the interface (API) between a human and a system. The person responsible for the system is arguably better positioned to create and manage this API. I’ve seen a lot of  dashboard rot.",
              "score": 1,
              "created_utc": "2026-02-28 23:56:22",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7x4umh",
          "author": "throwawaybebo",
          "text": "Alerts need to be clear and actionable. Otherwise, they’re just noise.",
          "score": 3,
          "created_utc": "2026-02-28 18:28:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ybvrc",
          "author": "Individual-Welder597",
          "text": "Datadog is an amazing tool, it might feel expensive, but i think its worth the cost when you considering managing infra and maintaining regular updates for opensource projects",
          "score": 2,
          "created_utc": "2026-02-28 22:15:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7x3a02",
          "author": "prettyyugly_",
          "text": "From my experience, the most important factor is how the platform handles both your cloud and on-prem environments. You want something that scales without creating too many manual processes. Centralized logging is crucial too,it saves you from flipping between a bunch of different tools.",
          "score": 1,
          "created_utc": "2026-02-28 18:21:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7x5l5p",
          "author": "GrogRedLub4242",
          "text": "\"teams\" is irrelevant",
          "score": 1,
          "created_utc": "2026-02-28 18:32:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7xfsui",
          "author": "JosephPRO_",
          "text": "From what I’ve seen, when teams consolidate their monitoring stack, the biggest shift isn’t some flashy feature. It’s just having logs, metrics, and traces in the same place so you’re not bouncing between tabs during an incident. That context switch fatigue is real. Tools like Datadog tend to come up in that conversation, along with other all-in-one observability platforms. People also mention that having everything centralized makes onboarding smoother since new engineers only have to get comfortable with one main system instead of piecing together three or four.",
          "score": 1,
          "created_utc": "2026-02-28 19:24:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o82wxi5",
          "author": "Useful-Process9033",
          "text": "We went through this exact consolidation last year. Had the classic Prometheus + Grafana + PagerDuty + random scripts setup. Ended up keeping Prometheus for metrics but adding a correlation layer on top that ties logs, traces, and alerts together so the on-call person isn't jumping between four tabs at 3am. Biggest lesson was that the \"unified platform\" pitch sounds great until you realize half your team ignores the dashboards anyway. What actually moved the needle was making alerts link directly to the relevant logs and runbooks so people could act without context-switching. Whatever you pick, I'd evaluate based on how fast someone who didn't build the service can start debugging it.",
          "score": 1,
          "created_utc": "2026-03-01 17:04:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o86zfht",
          "author": "obsidianm1nd",
          "text": "For paid tooling, Datadog is probably the best all-in-one option, but it gets expensive fast, especially in fintech where accuracy matters a lot.\nIf cost is a concern, the open-source stack works just fine. Prometheus with LGTM (Loki, Grafana, Tempo, Mimir) covers most observability needs without burning budget. It takes more effort to operate, but it absolutely does the job.",
          "score": 1,
          "created_utc": "2026-03-02 07:33:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7xki4z",
          "author": "SudoZenWizz",
          "text": "We are using checkmk for monitoring for our customers, with more than 450 systems directly monitored. \nCheckmk cand integrate with aws easily, with other cloud providers and have kubernetes integration, docker and many others (over 2000 built in plugins)\nWe monitor the full stack: switches, routers, physical servers, cloud systems (aws, azure, etc.). You can also use robotmk for end to end monitoring, synthetic monitoring.\nNotifications for us are sent via opsgenie integration but system supports many notifications(email/sms/teams, webhooks, scripts, etc.)\nWith proper tuning of thresholds and delays(for spikes), we reduced the noise and only actionable alerts get notified (creating tickets based on customer SLA)",
          "score": 1,
          "created_utc": "2026-02-28 19:48:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7x60nh",
          "author": "GrogRedLub4242",
          "text": "Nagios goes a long way\n\nadd Prometheus/Grafana to go further\n\nadd PagerDuty...\n\ndepends on the size and complexity of your arch and deployments, not on \"teams\". depends on your total budget and stage of biz or project life. and any reqs about sensitivity and reducing SPOFs, or on-premises hosting, etc.",
          "score": 0,
          "created_utc": "2026-02-28 18:34:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7xama6",
          "author": "Suitable_Low9688",
          "text": "Checkout this open source tool, not sure if it satisfies all your SRE requirements but you can always build on top of it - https://github.com/supercheck-io/supercheck",
          "score": 0,
          "created_utc": "2026-02-28 18:57:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o84k9x2",
          "author": "destari",
          "text": "I would love to show you what we are building (logs focused) and get your feedback! We are looking for raw feedback from folks right now mainly.\nShort story without sales pitch bs (I’m the CTO not sales person so):\nWe ingest the logs and at the edge do intelligent stuff so we can basically analyze every log and tell you what’s going on without you configuring anything. (More to it but you get the idea).\nMarketing bla bla: controltheory.com\nPing me if you want to chat about it! (Can demo)",
          "score": 0,
          "created_utc": "2026-03-01 21:56:48",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rgqpyz",
      "title": "Rant / advice needed: asked for 2x raise after slashing 20x for the company",
      "subreddit": "sre",
      "url": "https://www.reddit.com/r/sre/comments/1rgqpyz/rant_advice_needed_asked_for_2x_raise_after/",
      "author": "Flaky_Masterpiece874",
      "created_utc": "2026-02-28 02:34:10",
      "score": 14,
      "num_comments": 67,
      "upvote_ratio": 0.7,
      "text": "Looking for honest opinions from people who’ve dealt with comp negotiations after outsized impact.\n\nNot based in North America. I work remotely for a small company with staff based in US/Canada. Small team, but a lot of infrastructure: roughly 300 VMs, a dozen Terraform repos, ongoing ops, upgrades, the works. I have 10y of relevant, rich experience. My work is mostly: Linux / OS mgmt / Terraform / Ansible / Containerization / k8s / FinOps & general infra ownership.\n\nWhen I joined, there was one other infra person. Not long after, she left and I ended up alone, this happened 10 months ago.\n\nDuring that time, I kept normal operations and:\n\n\\\\- handled infra for major upgrades and a couple of serious issues\n\n\\\\- reduced infra bill from $3M to less than $1M/y, saving $2M+/y\n\nLast point was deep technical stuff, rethinking architecture to move workloads to much cheaper setup with acceptable tradeoffs and a lot of shrinking and cleaning to rightsize.\n\nMy current comp is about $100k/year USD, which feels way out of line with the value delivered, especially since I know the company’s upper comp band can go much higher. So I asked my VP a raise to 220k.\n\nMore than 2x my current pay, thinking being:\n\n\\\\- the impact was unusually large\n\n\\\\- the work was high leverage and hard to replace\n\n\\\\- 5% of the savings can pay for the raise, every year\n\nI know changing jobs is usually the fastest path to higher comp, but that’s not my point here.\n\nWhat I want to ask is:\n\n\\\\- Have you ever successfully gotten a major internal raise after delivering something like this?\n\n\\\\- Is asking for more than 2x unreasonable even with a strong business case?\n\n\\\\- In your experience, do companies reward this kind of impact internally, or is comp vmostly disconnected from it no matter what?\n\nWould appreciate real-world experiences.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/sre/comments/1rgqpyz/rant_advice_needed_asked_for_2x_raise_after/",
      "domain": "self.sre",
      "is_self": true,
      "comments": [
        {
          "id": "o7tbtgh",
          "author": "sokjon",
          "text": "\\\\- you’re probably going to get laughed out of the VPs office",
          "score": 72,
          "created_utc": "2026-02-28 02:40:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7uxk5r",
              "author": "Flaky_Masterpiece874",
              "text": "Initial reception was positive on the merit. They are playing chicken now, no idea how it will play out.",
              "score": 3,
              "created_utc": "2026-02-28 10:30:56",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7vsoa1",
                  "author": "Ariquitaun",
                  "text": "You're doing well. You know your value to the company. Are you prepared to walk though? That's the only real leverage",
                  "score": 7,
                  "created_utc": "2026-02-28 14:22:24",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7tmabc",
          "author": "throway2222234",
          "text": "Put it on your resume, tell the story during interviews, and get a new job. They will never agree to that. Your new job will though.",
          "score": 35,
          "created_utc": "2026-02-28 03:47:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7tn6um",
          "author": "itasteawesome",
          "text": "I've saved companies similar amounts in several roles and each time they acted like a 10% raise the next cycle was completely impossible, so i took my skills and interviewed and found companies willing to bump me 30-50%.  of course that was mostly during the bull market on tech salaries.  In 2026 I know plenty of solid engineers who struggle to get a job at all, let alone landing major salary increases.  I bet they play chicken with you and try to find some other kid at 100k who is willing to run the stack you cleaned up now that the hard work has been done.",
          "score": 18,
          "created_utc": "2026-02-28 03:53:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7u2d9z",
              "author": "thearctican",
              "text": "Or less. 100k USD was the median for our senior band in Canada.",
              "score": 4,
              "created_utc": "2026-02-28 05:45:20",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7uze73",
                  "author": "Flaky_Masterpiece874",
                  "text": "Sure it's possible even though they struggled for almost a year to find a match when I joined, job requires staff-level responsibilities/knowledge with very hands-on skills.",
                  "score": 1,
                  "created_utc": "2026-02-28 10:48:16",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7tcr93",
          "author": "deacon91",
          "text": ">\\\\- Is asking for more than 2x unreasonable even with a strong business case?\n\nMaybe in 2021-2022, but salary negotiations aren't about what's reasonable but the prevailing market sentiments and bargaining power/leverage. Most I ever got was \\~60% but that was because I had a competing offer (with the letter to back it up).\n\n>\\\\- reduced infra bill from $3M to less than $1M/y, saving $2M+/y\n\n>Last point was deep technical stuff, rethinking architecture to move workloads to much cheaper setup with acceptable tradeoffs and a lot of shrinking and cleaning to rightsize.\n\nSo you're saying you single handedly made this decision for the company?\n\n>\\\\- In your experience, do companies reward this kind of impact internally, or is comp vmostly disconnected from it no matter what?\n\nDepends on the company size. At a certain size, one simply becomes a cog in a wheel and ability to get astronomical raises/promos depend on you having CEO's ears (e.g. see Anthony Levandowski relationship w/ Larry Page before the lawsuits).",
          "score": 11,
          "created_utc": "2026-02-28 02:46:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7uui56",
              "author": "Flaky_Masterpiece874",
              "text": "Thank you. All major decisions infra-wise are shared and sanctioned by the VP, I'm the one proposing/making the changes.",
              "score": 1,
              "created_utc": "2026-02-28 10:01:05",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o7vph58",
              "author": "DehydratedButTired",
              "text": "Yeah. Most companies put all their salaries into AI HR software and get a market rate output to use. Everyone is pretending they aren’t colluding on salaries. You are obviously in management or HR, I’m sure this kind of software this seems fine to you.",
              "score": 1,
              "created_utc": "2026-02-28 14:03:44",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7xdo9n",
                  "author": "deacon91",
                  "text": "???",
                  "score": 1,
                  "created_utc": "2026-02-28 19:13:15",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7tft14",
          "author": "swergart",
          "text": "be real, find job, do interviews, and get an offer higher than what you have, use it as leverage. \n\nwhy company wants to give you more if you are going to stay anyway?",
          "score": 16,
          "created_utc": "2026-02-28 03:05:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7uyrmq",
              "author": "Flaky_Masterpiece874",
              "text": "That's the fallback plan for sure in case of zero or not hugh enough offer.",
              "score": 1,
              "created_utc": "2026-02-28 10:42:18",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7v0tsb",
                  "author": "worthlesspenny7",
                  "text": "Go do it now. You've got tech hustle, hustle to advocate for yourself. Get an offer elsewhere before this conversation concludes. Bring it to them and say, \"I don't want to leave, but just as I take it as my responsibility to save on your infra costs, I take responsibility for making my working hours as valuable as possible to me and my family.\" That approach could get you up to ~25% over market, maybe more in a small company. \n\nOr if you've got a lot of hustle, use your story to go out on your own and consult/contract with similar business to repeat your success. Keep it to nights and weekends until you hit escape velocity from the day job.",
                  "score": 1,
                  "created_utc": "2026-02-28 11:01:33",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o83nh4v",
                  "author": "hallerx0",
                  "text": "I’d advise looking for a job offer, which you can use  as a leverage. Like right now :)",
                  "score": 1,
                  "created_utc": "2026-03-01 19:09:28",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7tkvps",
          "author": "Far-Broccoli6793",
          "text": "Did you ran infra at 3M when you can at 1M????????\n\n\nIt's bad very bad.\n\nI know you did good job but above is how they gonna react. Find a new job you deserve to be at better place. If management is smart then they should have caught it right away when you made an impact and appreciated it with a nice paycheck. Which is not the case.",
          "score": 4,
          "created_utc": "2026-02-28 03:38:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7uuu1l",
              "author": "Flaky_Masterpiece874",
              "text": "Not me but the previous infra people and same VP. They are a bit shady with comp reviews, no official cycles, so I had to be blunt.",
              "score": 1,
              "created_utc": "2026-02-28 10:04:21",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7u1zlh",
          "author": "evergreen-spacecat",
          "text": "This is the biggest misunderstanding when it comes to operations roles and salary expectations. “I optimized, documented and automated everything to perfection. Now that I have proven my skills, I deserve a higher salary while I spend my days watching my well oiled setup run by itself”. Management will not see it that way. Now that the major cost save is done, all they need is someone to keep the lights on. I have seen skilled teams layed off in large part once the setup was automated enough.",
          "score": 5,
          "created_utc": "2026-02-28 05:42:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7tyxp5",
          "author": "PropagandaBagel",
          "text": "The best way to increase salary, is find another job. You will most likely never get the pay bump you want. A 2x ask is massive, that kind of pay increase comes from a new job. Put that shit on a resume. You are expendable when it comes to the bottom line, and when it comes to saving money, well you were doing your job. You may have better protections then in the US depending on where you live and your contract, But you have to consider, if you ask for 2x salary, they will remember that when its contract time. Leverage your success and find another position elsewhere for your pay raise.",
          "score": 4,
          "created_utc": "2026-02-28 05:18:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7u3sd9",
          "author": "namenotpicked",
          "text": "As others have said, good luck. Many in leadership roles now look at this work and will tell you that it's part of your job to do these things. Maybe you're fortunate enough to get a bonus. Maybe you have enough political capital and ask for a 20-30% raise and they give you a 10% raise. If you want more and the company doesn't give it, then you're only going to find it elsewhere by using this as another point on the resume for another company willing to pay you what you feel you're worth.",
          "score": 3,
          "created_utc": "2026-02-28 05:56:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ufnnk",
          "author": "DeterminedQuokka",
          "text": "The largest raise I’ve ever gotten was 35k and at least part of that was concern they might get sued for discrimination. \n\nGenerally the reward for something like this is the highest performance rating an a slightly larger raise not 2x the wages. You would be more successful probably into turning this into a promotion. \n\nAnd honestly a reality check whether you saving them 2m is super impressive or not really depends on what was wrong and what you did. Most start ups are not thinking about cost at all and it’s actually reasonably easy to find a million dollars in the couch cushions. My current job I saved them 200k a year in a week with 2 changes. And had a plan to save over a million with minimal effort but they didn’t want to prioritize it. If they were burning money it’s not actually that you are the most amazing infra person. If you actually dramatically changed the whole system maybe you are great. But even if you are you already fixed it they need you less now. So they aren’t likely to give you that kind of money.",
          "score": 3,
          "created_utc": "2026-02-28 07:41:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7tk3wl",
          "author": "Hi_Im_Ken_Adams",
          "text": "2x ??  I would imagine that puts you way above the average range for an SRE in your region (Canada?)\n\nCompanies are not gonna double your salary just because you saved them money.  At most they will give you a nice year-end bonus.  \n\n  \nBut they're never gonna pay you more than what the position demands for your area.  In fact, they couldn't pay you that even if they wanted to because your salary is falls within a certain elastic range.  In order to go beyond that top range, they would need to give you a promotion with a different title with a salary range that encompasses that new salary.   \n\nAnd if your new salary puts you above your manager or director, then guess what, they're not gonna promote you to manager or director just so they can pay you 2x your current salary.\n\n",
          "score": 6,
          "created_utc": "2026-02-28 03:33:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7uw4y9",
              "author": "Flaky_Masterpiece874",
              "text": "No bonuses, no official review cycles, things are fluid. The raise won't put me above, they have ICs in the range. I'm not in US/Canada and they suffered for months until finding someone with the skills, the work is very hands-on and the responsibilities are staff-level at minimum. If I leave, a new hire will most certainly cost them more.",
              "score": 2,
              "created_utc": "2026-02-28 10:17:14",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o83coe4",
                  "author": "merightno",
                  "text": "I've even seen it happen a million times that they let the person go even when they have to hire two people to replace them. I don't know why company logic works like that but it does.\n\nAnd be careful if they give you what you want and then they hire you an assistant that you're supposed to train because you know what's happening then, right?",
                  "score": 1,
                  "created_utc": "2026-03-01 18:19:10",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7urb39",
          "author": "Abject-Kitchen3198",
          "text": "That was your job you agreed to do for the salary offered. Might have been the other way around. You might have made mistakes that cost the company just as much. You showed your competence. They hopefully will take that into account for the next salary decisions and/or responsibility assignment.",
          "score": 2,
          "created_utc": "2026-02-28 09:29:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7uu0y2",
              "author": "Flaky_Masterpiece874",
              "text": "Job agreed was to be a second in a team of two and FinOps wasn't a part of it until I was alone. I was not the one responsible for growing the bill to 3M.",
              "score": 2,
              "created_utc": "2026-02-28 09:56:19",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7v8o4p",
          "author": "Longjumping-Pop7512",
          "text": "I guess you missed a point here..Hikes are usually done to keep an eye on potential of future improvements. If you have already done these optimizations I guess room for further optimization will be smaller ? \n\n\nIf you have saved this much cost in 10 months it meant your company had highly unoptimized setup beforehand. You did a good job, but, if had done gradual cuts overtime and deliver continuously it would make your case much stronger for tremendous constant hike — I know it sound like anti pattern, worked for 10 companies so far none of them was really my true friend. \n\n\nBut I hope you get what you deserve..",
          "score": 2,
          "created_utc": "2026-02-28 12:09:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7wspni",
              "author": "Flaky_Masterpiece874",
              "text": "How would that work exactly? Saying \"Please raise 100k in my comp so I can cut 2M in our bill in the next few months\" doesn't sound good.",
              "score": 1,
              "created_utc": "2026-02-28 17:27:57",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7xa3fw",
                  "author": "Longjumping-Pop7512",
                  "text": "It's alright you didn't get what I mean. Good luck to you! ",
                  "score": 1,
                  "created_utc": "2026-02-28 18:55:07",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o82pq6r",
                  "author": "Random_Effecks",
                  "text": "I think he is saying that you should have tried to find another 100k a month to save, every month, for a year and then make the case that you still think there are improvements you can find and ask for the increase. C level would probably agree it makes sense to keep you on if you are worth 10x in value.",
                  "score": 1,
                  "created_utc": "2026-03-01 16:30:07",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7vgi2r",
          "author": "jankenstein",
          "text": "Most HR departments for the companies I am familiar with have a hard cap on raises or internal promotions.  Something in the neighborhood of 10-15%.",
          "score": 2,
          "created_utc": "2026-02-28 13:07:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7w1ea7",
              "author": "Flaky_Masterpiece874",
              "text": "Yeah for larger companies, this one has less than 50 people, so things are fluid and specific to each case. At least this is the feeling.",
              "score": 1,
              "created_utc": "2026-02-28 15:10:55",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7xf702",
          "author": "boogie_woogie_100",
          "text": "Never simplify the process because that is the fastest way you to get laid off. Always make themselves dependent on you. Not sure how many times i have to preach this corporate game.",
          "score": 2,
          "created_utc": "2026-02-28 19:21:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7xn404",
          "author": "poolpog",
          "text": "No one is ever going to give you a 2X raise. Never ever.\n\nBut they might swing a 25 or 30% raise. And/ or a big year end bonus.\n\nBut a 2X raise? Get the fuck outta here, never gonna happen.\n\nThe only way to get that big of a jump is by getting a job at another company.\n\nSpeaking of which, DM me if you like",
          "score": 2,
          "created_utc": "2026-02-28 20:02:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7yuh5s",
              "author": "Flaky_Masterpiece874",
              "text": "You just sounded like one of my inner voices lol\n\nJust DM'd you, thanks!",
              "score": 1,
              "created_utc": "2026-03-01 00:02:16",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7tolop",
          "author": "engineered_academic",
          "text": "One time cost savings is not a capital concern generally. Business cares more about impact to ARR than a one time cash savings. You need to forecast this over a few years. \n\nYou wanting to 2x your salary is almost impossible to meet for several reasons. You are better off going somewhere else and asking to contract for your current org at exorbitant rates ratter than trying to 2X your salary at your current position.",
          "score": 3,
          "created_utc": "2026-02-28 04:03:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7u7j3q",
              "author": "Karyo_Ten",
              "text": ">One time cost savings is not a capital concern generally. Business cares more about impact to ARR than a one time cash savings. You need to forecast this over a few years. \n\nHe saved $2M/year",
              "score": 5,
              "created_utc": "2026-02-28 06:28:55",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7vjs95",
                  "author": "engineered_academic",
                  "text": "He saved 2 million this year. There's no guarantee that 2 million will appear next year, or the year after. I can easily save 2 million by shutting down all my AWS instances or laying off all my American staff and offshoring for peanuts. Instead the business needs to show that his work increased ARR, especially if they are looking to get acquired. ARR is all that matters in the tech world. Cost savings don't matter as much because that savings doesnt lead to growth, and growth is all that matters in a capitalist business.",
                  "score": 1,
                  "created_utc": "2026-02-28 13:29:14",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7vet2p",
          "author": "asdoduidai",
          "text": "Go to a company that recognizes impact upfront with stocks and/or has reviews based on what you did. Away from somewhere you have to ask for a fraction of what you deserve",
          "score": 1,
          "created_utc": "2026-02-28 12:56:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7w0xd5",
              "author": "Flaky_Masterpiece874",
              "text": "I share this view, however there's no way to know beforehand how the company will behave in such cases.",
              "score": 1,
              "created_utc": "2026-02-28 15:08:24",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7xhnqj",
                  "author": "asdoduidai",
                  "text": "Yes and no, you know from before if they have a review system; in any case it’s not your fault, it’s theirs: they lose a top performer (probably the only one they had)\n\nstill a strategy can be to do the some of the 20% improvements that give 80% results, instead of the full optimization you did, and then see if you save 2/300k per year anything of that goes your way; if not you can continue improving for your own experience to add to the cv; but start looking for the next company, don’t wait and hope",
                  "score": 1,
                  "created_utc": "2026-02-28 19:33:58",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7vx9jx",
          "author": "Hzioulquoigmnzhah",
          "text": "It sounds like you did the job you were hired for, based on market rate. \n\n\nI'd say there is a chance to get one time bonus (maybe 10-20k) and put this as one of the a accomplishments for the promo package. \n\n\nYou can also use it for one of the interview questions when applying for new jobs that pay a bit more. There will be many follow up questions though and it's a very small saving for any big and serious company. ",
          "score": 1,
          "created_utc": "2026-02-28 14:48:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7w0dxz",
              "author": "Flaky_Masterpiece874",
              "text": "Not at all, when hired I was the second in a team of two, after the person left I took ownership of all things infra. Current state is like staff/principal IC + architect + lead infra, all-in-one. At that point I was ready to ask for a raise, they having one less person on payroll, but then the FinOps side felt like a way for me to pay my own raise, no matter how naive that may sound.\n\nI'm positive that, financially and time-wise, my ask is cheaper than me leaving, for both parties. They'd have to hire while having no SRE left in the company to interview candidates. And the skills they need for the job are not easy to find, so that could go on for months.",
              "score": 1,
              "created_utc": "2026-02-28 15:05:30",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7w2f8h",
                  "author": "Hzioulquoigmnzhah",
                  "text": "I feel you. You are not wrong to think like that. Hopefully your company is small enough for them to not have too many procedures. \n\n\nJust saying that from someone working in management, it looks like you did the job you were hired for. It also does not look like there is a big risk of you leaving. It's probably extremely unlikely for you to find a job that pays more than 20-30% more than what you have now. \n\n\nSpeaking as a manager from company perspective - the work you described sounds like nothing special and a very normal contribution. Obviously it's cheaper for them to keep you there than look for replacement - and it's very likely (if their internal process allows it) they will match any other offer you will have in hand.",
                  "score": 1,
                  "created_utc": "2026-02-28 15:16:22",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7ygygk",
          "author": "phoenix823",
          "text": "What you are describing is an organization so poorly managed that they were overpaying by 2/3 for their infrastructure then only having a single admin after the other one quit. Unfortunately, you’re not going to be able to repeat the kind of performance you just delivered. In a perfect world you would see a nice bonus or something like that. What you describe as a company that does not value its technology workers. Even if they gave you a 20% raise, what would be your high value contribution for the next 12 months?",
          "score": 1,
          "created_utc": "2026-02-28 22:43:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7zzn02",
              "author": "Flaky_Masterpiece874",
              "text": "I agree, this was a one-time contribution even though it has lasting effects. This is why my ask is also a single request to bring comp, skills, responsibilities and results into some reasonable balance.\n\nI could have staggered the changes as others mentioned, fact is I liked the challenge and the results. Cutting almost 70% from infra costs with real engineering work in a couple of months is a personal achievement for me. The work is never-ending, certainly nothing similar will happen in coming years but I also won't be asking for 2x again lol",
              "score": 1,
              "created_utc": "2026-03-01 04:18:26",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7zgq6j",
          "author": "Brave_Inspection6148",
          "text": "Respectfully, your efforts may have only proved to convince them that it's okay to continue hiring engineers with your experience at a 100k salary.\n\n\nI don't have a good answer. All I can say is that good leaders recognize not just your impact, but your existing skills, and potential as well. They will raise people even if those people havent made impact yet (if th company/department can afford it).",
          "score": 1,
          "created_utc": "2026-03-01 02:16:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7zx3ld",
              "author": "Flaky_Masterpiece874",
              "text": "I can see how this seems like to be the case, but the reality is a tad more nuanced. The other engineer was earning more than 100k and I'm not US-based, which is a shitty but common argument for lowballing offers from the start in work-from-anywhere roles. The real bad take is them not having a process nor being proactive to reward people as good leaders should, like you well described. At least my ask didn't get a hard no from the start, which shows a pint of honesty in recognizing that some increase is due.",
              "score": 1,
              "created_utc": "2026-03-01 04:00:32",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o81s5hh",
          "author": "Ana_Ng",
          "text": "The time to have the negotiation is before you do the work. \n\n\"I believe I can cut your operational budget X% by end-of-year.  If successful I want $Y performance bonus, and $Z additional base ongoing.  This would represent an ROI of $N over the next three years, making it a win-win.\"\n\nAfter you've done the work you have no leverage.",
          "score": 1,
          "created_utc": "2026-03-01 13:30:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o81vmgt",
              "author": "Flaky_Masterpiece874",
              "text": "You are right, I do agree I have no real leverage except for the chance of leaving and the side effects of that. There was another commenter suggesting a similar approach, but wouldn't that sound weirdly transactional? What if they say no, then I just \"refuse\" to do the work?\n\nI ask because I never saw agreements as such in my previous jobs. The work relationship is always transactional, sure, but this feels like too much \"quid-pro-quo\" to me.",
              "score": 1,
              "created_utc": "2026-03-01 13:52:14",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o81xdka",
                  "author": "Ana_Ng",
                  "text": "Work is transactional.  Companies exist by extracting your excess value in return for stability.  You get a steady paycheck, they get the value you produce minus your total comp. The question is what fraction of the value you offer are you willing to give up?  \n\nIn your hypothetical, if they aren't interested then you move on, or if you feel like it stick around and pitch it again at the end of the year.  Or maybe they try to nickel and dime you (as they are doing now), but at that point you have something to bargain with.  Even if you don't get your full ask you would likely be better off.\n\nGood luck",
                  "score": 1,
                  "created_utc": "2026-03-01 14:02:48",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o81x1vk",
              "author": "PsychologicalWork674",
              "text": "I am really looking forward to such situation. So when do you jump that possibility and what happens if they say\n- straight no, are you leaving?\n- something in between could mean a general goal setting financially then when the work is done they \"have to honor\" the agreement right?\n\nI am to build a Kafka cluster with potential to become a department (if not company) data platform. This is platform engineering which I am pushing toward, however buildinng it would make me \"the single point of failure\" which also looks like a leverage. Also I am around the end of my long probation pperiod which will be successful, so I am scooping when to tell them that devops engineering is not platform engineering... thats a different grade.",
              "score": 1,
              "created_utc": "2026-03-01 14:00:50",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o81z0hu",
                  "author": "Ana_Ng",
                  "text": "It is harder to have this conversation if you cannot express the value of the project to the company in dollars.  You're building a business case for your compensation. \n\nTry to show that whatever project you are building will contribute, either to revenue (top line) or to operational cost efficiency (bottom line).\n\nDo the work to show both that you and your project are valuable, and that replacement cost for your position would be higher than what you are asking for. \n\nBe sure of your value, always have your resume updated, and be ready to move on if you are not being compensated.",
                  "score": 1,
                  "created_utc": "2026-03-01 14:12:17",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o83bu3s",
          "author": "merightno",
          "text": "I feel like this has never happened in the history of tech.  You did the job you were hired to do. They aren't going to give you the savings that you made happen. If you didn't do it, they would have hired someone else to do it.  \n\nYou are underpaid but I suppose that is normal for this field or company and they're not going to stop that for you because then they're going to have to pay everyone higher.  You have good results. You need to go to another company to get what you deserve. It's not going to happen here.  That's not how things work.\n\nOne time I did end up making more than 2x by getting a new job though. And I didn't even do anything crazy to deserve it. Just get a new job doing the same thing at a company that pays better.  And I like the new job a lot better.\n\nI've been working in this industry for 20 years and probably at least seven or eight jobs. I don't think I've ever gotten a significant raise. Anything over like 5%. . Probably not even 5%.  . You have to keep switching to go up.",
          "score": 1,
          "created_utc": "2026-03-01 18:15:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o85b1wv",
          "author": "lambdawaves",
          "text": "You present a decent case. But you don’t get raises for past performance. \n\nWhat you need is a plan of execution over your next year. How much will you save them if you continue to work for a year. And your past impact is proof that you can actually deliver. \n\nPresent *that*",
          "score": 1,
          "created_utc": "2026-03-02 00:28:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o85olyx",
              "author": "Flaky_Masterpiece874",
              "text": "That's doable for sure, thanks for the good advice!",
              "score": 1,
              "created_utc": "2026-03-02 01:50:33",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1rd8ks1",
      "title": "How do you handle weekly client reporting and RCA docs?",
      "subreddit": "sre",
      "url": "https://www.reddit.com/r/sre/comments/1rd8ks1/how_do_you_handle_weekly_client_reporting_and_rca/",
      "author": "Pristine-Ocelot8746",
      "created_utc": "2026-02-24 06:17:40",
      "score": 7,
      "num_comments": 5,
      "upvote_ratio": 0.89,
      "text": "*Been a DevOps engineer for a while now and honestly the part I hate most about my job is the reporting side.*\n\n*Every week I'm manually going through Grafana and CloudWatch, taking screenshots, deciding which ones matter, then copy pasting everything into a Confluence template to write up the weekly infra summary and any RCA docs.*\n\n*Takes me 4-5 hours per client. Feels like there should be a better way.*\n\n*How are you guys handling this? Any tools or workflows that actually help? Or is everyone just doing this manually too?*",
      "is_original_content": false,
      "link_flair_text": "DISCUSSION",
      "permalink": "https://reddit.com/r/sre/comments/1rd8ks1/how_do_you_handle_weekly_client_reporting_and_rca/",
      "domain": "self.sre",
      "is_self": true,
      "comments": [
        {
          "id": "o74n7h0",
          "author": "SmallSeaworthiness95",
          "text": "You can build a simple agentic workflow internally: Slack bot that auto‑tags incidents by type, fetches RCA patterns from postmortems using RAG, and then drafts the summary.   \nYou can also feed it with your runbooks or logs for example.",
          "score": 2,
          "created_utc": "2026-02-24 12:59:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o75jio8",
          "author": "maxfields2000",
          "text": "Agree with the other poster, this sounds like a perfect use case to teach yourself some modern agentic AI usage to gather that data. Grafana has a pretty good MCP server and AWS definitely has one for cloudwatch.  There's an agent for Confluence as well, so you can automate a lot of this.\n\nThe weekly infra summary sounds like a great idea. We do something similar on a few product teams here and we're trying to get that to be a common discourse, some teams do it during their weekly on-call rotation hand-off (recap the week).\n\nAs for RCA doc's, that's more interesting. Our failures are diverse enough that I couldn't really template a standard set of graphs, but I could still use an agent to go after what we already know or summarize what was captured during the incident in the incident ticket.  Only a few teams have any kind of \"weekly\" failures, most it's more monthly or quarterly though.\n\nThe other thing we're looking at for mostly stable teams is \"release\" analysis, especially if they've created SLO's, you can do an automated report of burn rates before/after releases pretty easily.",
          "score": 1,
          "created_utc": "2026-02-24 15:47:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o764fvd",
          "author": "glowandgo_",
          "text": "been there. what changed for me was treating reporting as a system problem, not a docs problem.\n\nat scale we stopped doing manual screenshots and defined a fixed kpi layer per client. once that contract was clear, most of it came from apis and templated markdown, then i’d just add context on anomalies + decisions. cut the 4-5h down a lot.\n\nthe trade off people dont mention is clients say they want detail, but usually care about risk, impact, and what’s next. are yours actually reading the graphs or just scanning for narrative + accountability?",
          "score": 1,
          "created_utc": "2026-02-24 17:21:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o76n08d",
          "author": "ninjaluvr",
          "text": "We automate toil away. Grafana has an API, confluence has an API...",
          "score": 1,
          "created_utc": "2026-02-24 18:44:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o773l5b",
          "author": "Useful-Process9033",
          "text": "4-5 hours per client is rough but pretty common from what I've seen. The thing that cut the most time for us was templating the RCA structure with pre-populated fields pulled from our alerting system, so instead of starting from scratch you already have timeline, affected services, and detection method filled in. Then the human part is just the analysis and action items. For the weekly reporting, we set up a cron job that pulls key metrics from our monitoring APIs and dumps them into a markdown template, then review and annotate. Still manual but went from hours to maybe 45 minutes per client.",
          "score": 1,
          "created_utc": "2026-02-24 19:59:39",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rhd6es",
      "title": "When do you switch from SaaS to self-hosted observability?",
      "subreddit": "sre",
      "url": "https://www.reddit.com/r/sre/comments/1rhd6es/when_do_you_switch_from_saas_to_selfhosted/",
      "author": "Juloblairot",
      "created_utc": "2026-02-28 20:31:47",
      "score": 7,
      "num_comments": 33,
      "upvote_ratio": 0.73,
      "text": "Hey everyone, \n\nWhen do you know it's time to look for a switch from SaaS such as Datadog towards open source (more self hosted) observability like grafana otel etc.? \n\nIs it a cost game? A maintenance balance to find? \n\nCurrently working at a startup with around 20devs, growing to 40 this year, where we're only 2 DevOps/SRE at the moment managing everything from cloud to o11y to pipelines to architecture. We don't have much time for now to switch from Datadog to open source, but costs are rising (around 20% of cloud costs are observability costs)\n\nThanks! ",
      "is_original_content": false,
      "link_flair_text": "DISCUSSION",
      "permalink": "https://reddit.com/r/sre/comments/1rhd6es/when_do_you_switch_from_saas_to_selfhosted/",
      "domain": "self.sre",
      "is_self": true,
      "comments": [
        {
          "id": "o7xvjtb",
          "author": "Internal-Tackle-1322",
          "text": "I don t know your specific situation because there are many varibles to evalute before taking a decition like that . I think you should not migrate now, do not take fast decitions. Spend 2–3 days auditing your current usage in Datadog using the Cost Summary dashboard. You’ll likely discover that 40–60% of the cost comes from 2–3 optimizable sources. That can buy you 12–18 months while the team grows and you have more bandwidth for a well-planned migration.A poorly executed migration costs more than Datadog. Maybe you have a problem of organization but not tools. Hope this helps.If you can share more details, I might be able to add something more specific.",
          "score": 5,
          "created_utc": "2026-02-28 20:47:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7yk9s8",
              "author": "Juloblairot",
              "text": "Thanks for the wise advice. Indeed, there's always stuff to optimise. Though, I think we have a good setup. Indexes on all our logs, small retentions (2w) for prod that consumes a lot of logs, we try to keep low cardinality on metrics. Infra hosts unfortunately nothing much to do\nAnd we simply refuse using tracing, as the pricing is indexed on infra host\n\nWe're re evaluating our commitments every other month to try to adapt as much as we can and not have too much on demand\n\nI think our setup is fairly decent and optimised for the moment. Do you have obvious we could be missing?",
              "score": 1,
              "created_utc": "2026-02-28 23:02:04",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7ygoda",
          "author": "Hi_Im_Ken_Adams",
          "text": "Build vs buy is a classic dilemma.  \n\n\nDo you want to spend all your time managing your observability stack?\n\n\nLikewise, can you afford the bills that come with APM solutions like Datadog?\n\n\nIt’s all about what you can afford vs what you want to spend your time doing.",
          "score": 3,
          "created_utc": "2026-02-28 22:41:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7ykg70",
              "author": "Juloblairot",
              "text": "Yep, it's all about finding where we spend our money/time. How did you personally take the décisions, what were the key factors to take one or the other?",
              "score": 1,
              "created_utc": "2026-02-28 23:03:05",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7xv6v7",
          "author": "kabrandon",
          "text": "We're a startup of around the same size. My team is technically 4 DevOps/SRE, but 1 needs a bit of hand holding, and another handles a special project and is sort of tangential to my team though he's technically on it if you look at the books. So I consider us a team of 2 for the majority of our output.\n\nWe started with an open source stack, and we'll probably die with our open source stack. I think the takeaway for me here is that a decision was made and it's going to be painful to remake it, and most will probably choose to never change unless word from above is that they absolutely have to.\n\nThere are burdens associated with the open source stack. Even assuming you're familiar with it and can set it up reasonably quickly. It is significantly easier to set up a splintered stack with all of your sites/environments running their own metrics/logging infrastructure. This means you either find a way to aggregate them, or you end up where we're at with 13 different Grafana instances to flip through depending on which environment we're looking at. Whereas you just have one single pane of glass Datadog dashboard. I'd say this is the biggest concession we made with our setup. There's things that we could do about it, but I don't want to open the ability for all of these sites/environments we have to route to each other unnecessarily, and there's other considerations with regards to separation of concerns, where if one site is down we don't need to worry about our observability in all the others.",
          "score": 3,
          "created_utc": "2026-02-28 20:45:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7xwdkj",
              "author": "Juloblairot",
              "text": "Thanks for the feedback! I'm not too worried about the issue you're facing to be fair. Our Devs are mature and autonomous, and our stack is quite clean and terraformed everywhere. So it would be a migration game, and whenever we're ready we can switch to the new tool\nThe infra guy before me setup stuff so that developers kind of never write infrastructure code outside of application related one, and observability is following this. So, fortunately, not too worried about the spaghetti grafanas haha\n\nOn another hand, how much time does it take you to manage the infra for your observability stack, per month lets say? \n\nThanks!",
              "score": 1,
              "created_utc": "2026-02-28 20:51:53",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7xxkdg",
                  "author": "kabrandon",
                  "text": "Oh it varies. I'll spend whole months ignoring our observability stack (which is Grafana, Prometheus/Thanos, Alertmanager, Loki, and Tempo by the way.) Sometimes I'll spend a whole week in a month sharpening it. Usually the trigger for those is upon discovering a problem in it. One of our devs was complaining about Tempo queries timing out on him and I spent a day or two familiarizing myself with settings, tuning, and testing it. Another was just that we were getting a lot of Alertmanager alert flapping for some of our common alerts and we found it was due to some incorrect assumptions about how Alertmanager handles deduplicating alerts that I spent probably 3-4 days re-writing all of our alerts for.\n\n  \nBut most months, our only maintenance of the observability stack is updating all of the components of it in all of our sites. Renovatebot makes that far easier than it used to be though.",
                  "score": 3,
                  "created_utc": "2026-02-28 20:58:21",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o82x0tn",
          "author": "Useful-Process9033",
          "text": "20% of cloud costs on observability at 20 devs is rough but honestly pretty normal for Datadog. The real question isn't \"when to switch\" but \"what can you afford to maintain.\" With 2 SREs managing everything, self-hosting your full o11y stack is going to eat a significant chunk of your time. We were in a similar spot and ended up doing a hybrid thing where we moved metrics to self-hosted Mimir/Prometheus (saves the most money) but kept SaaS for log ingestion since that's where Datadog's bill really explodes. Alerting was the piece we swapped out first since it was the easiest win. If you're only 2 people I'd honestly wait until you're at least 4 on the infra side before going full self-hosted.",
          "score": 2,
          "created_utc": "2026-03-01 17:05:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o8368bh",
              "author": "Juloblairot",
              "text": "Thanks for feedback! I often prefer having one solution that fits all rather than a few of them that are better/cheaper, specifically because of maintenance. So not sure I want to do something hybrid because we will end up with alerts on both sides",
              "score": 1,
              "created_utc": "2026-03-01 17:49:26",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7xunhe",
          "author": "olsw",
          "text": "For me if you're growing it's the opposite. I would start open source with a startup and then move to saas as the company grows. What you don't want is to be spending more time managing your self hosted solution than improving the quality of your observability, and when your company gets larger and data increases the complexity of self hosting is not worth it (imo)\n\nObviously this is different if costs are becoming an issue but I'd then look at streamlining what you have rather than switching",
          "score": 3,
          "created_utc": "2026-02-28 20:42:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7xv7nt",
              "author": "Juloblairot",
              "text": "Makes full sense! That's my first concern, especially because we're only 2 at the moment\n\nProblem of tools like Datadog is the cost to be fair. For example, tracing there is insanely expensive, and cannot really be used without doubling the whole bill",
              "score": 1,
              "created_utc": "2026-02-28 20:45:32",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7ybmvb",
                  "author": "imdevin567",
                  "text": "Are you on an enterprise plan? Talk to your sales rep and see if you can negotiate a lower rate. Get a low committed rate if your infrastructure is fairly consistent. If you tell them you're looking into other options for APM because of the cost, they'll likely work with you on a lower rate too. Another thing that helped us was using Flex Logs for logs older than 2 weeks. Definitely some ways to lower your bill before switching to another platform or rolling your own.",
                  "score": 2,
                  "created_utc": "2026-02-28 22:14:05",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7ycaqw",
                  "author": "SuperQue",
                  "text": "It makes no sense at all. Tools are simply about TCO.\n\nWe found that $vendor was basically charging us about 50x for observability per compute money spent. So it became worth it to adopt open source tooling once the bill meant that we could easily pay an extra engineer or two to replace the vendor with their salary.\n\nPlus there was a ton of extra work teams were putting in to reduce their observability because it cost-per-data. Our reliability improved by an extra 9 over the years we implemented better observability partly since we stopped having to drop so many details to avoid SaaS bills.\n\nWe had \"tracing\" with the SaaS vendor, but we had to sample by 1% due to cost. And then it turns out later that the vendor was again sampling to 1%. So we had basically useless tracing.\n\nAs you grow, moving things in-house is what makes more sense. Typically the TCO math shows this.",
                  "score": 2,
                  "created_utc": "2026-02-28 22:17:43",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7y24nh",
                  "author": "olsw",
                  "text": "Datadog is considered best in class and is priced accordingly unfortunately. We use it in my company but the yearly is (low) seven figures, which is crazy.\n\nI'm sure there are more middle ground products in both quality and price but I'm not sure myself as to what those are.",
                  "score": 2,
                  "created_utc": "2026-02-28 21:22:56",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7znoc2",
          "author": "curious_maxim",
          "text": "if startup grows fast: switching is not the best idea on your own as it would take precious cycles. \n\nIf it doesn’t, do you think observability infra is going to be core competency of your team? Separately, do you have any sophisticated compliance requirements for your company?",
          "score": 1,
          "created_utc": "2026-03-01 02:58:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o815dph",
              "author": "Juloblairot",
              "text": "Startup grows fast, but engineering team grows moderately. We recruit slowly voluntarily and don't want to onboard dozens of Devs per month\n\nObservability is always something required I guess, but we don't do something crazy I guess. We're b2b in the cyber space, for SMB. No crazy compliance and requirements I believe",
              "score": 1,
              "created_utc": "2026-03-01 10:21:29",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o85vlfc",
                  "author": "curious_maxim",
                  "text": "I had a case when fully managed by us ELK-cluster had to be troubleshooted for a few nights… and nobody cancelled business goals for the morning. Back then there was no option to get it in similar to RDS way. Bottom line, if system’s self-hosted version is not on critical path for your startup… and there is a reliable commoditized vendor - that is a way to stay focused. If the cost is the problem, pick a few golden metrics for app level for metrics to measure in-real time, then have shorter retention for verbose part of logs for forensic (app and security) and rest - use providers system-level metrics for general dashboard. That’s not ideal, but will be the 80/20 solution for observability.",
                  "score": 2,
                  "created_utc": "2026-03-02 02:33:39",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o80e9do",
          "author": "road_laya",
          "text": "Use the datadag invoice to argue for hiring more ops people. Then switch to glitchtip.",
          "score": 1,
          "created_utc": "2026-03-01 06:09:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o83n8ai",
          "author": "thecal714",
          "text": "[https://i.imgur.com/PleWmMF.png](https://i.imgur.com/PleWmMF.png)",
          "score": 1,
          "created_utc": "2026-03-01 19:08:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7xxm8x",
          "author": "mrloulou",
          "text": "Definitely plan for moving to Otel it’ll give you\nflexibility especially when you evaluate different observablity back ends. Make sure you move completely off the datadog agents otherwise you’ll pay twice for each agent and collector running on your estate. \n\n\nI would avoid self hosting unless you love patch management. Even a managed service run by AWS is still going to require some upkeep (if you have experience of EKS or MSK you have a good idea what’s involved). \n\n\nGet your Datadog CSM to run a health check lite. The big costs are usually infra hosts, logs (indexing is usually a killer), if you’ve turned on Prometheus scraping by default it will scrap all metrics.",
          "score": 0,
          "created_utc": "2026-02-28 20:58:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7yjms1",
              "author": "Juloblairot",
              "text": "Not sure to understand what you suggest by moving of Datadog agent. Using otel, we'd still need a scraper/exporter like vector for example. Cost would be similar (Datadog agent is still expensive, but still major part is for infra host)\n\nFor us cost is mainly split between logs indexing, and infra hosts",
              "score": 2,
              "created_utc": "2026-02-28 22:58:24",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o836lrw",
                  "author": "mrloulou",
                  "text": "Each Datadog agent and Otel collector provide similar functionality and are counted against your infra host count.\n\nQuick wins for logs is to make use of exclusion filters, you can still save $$$ so long as low value logs don’t make it to the index.",
                  "score": 1,
                  "created_utc": "2026-03-01 17:51:11",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1rfbrmh",
      "title": "does reliability means no innovation?",
      "subreddit": "sre",
      "url": "https://www.reddit.com/r/sre/comments/1rfbrmh/does_reliability_means_no_innovation/",
      "author": "No_Issue_3022",
      "created_utc": "2026-02-26 14:35:33",
      "score": 6,
      "num_comments": 18,
      "upvote_ratio": 1.0,
      "text": "I work in finance industry and often encounter managers not pushing for risk and automation because the system \"works\" and is \"stable\" with human work, meaning why innovate when it's already reliable. This causes so much resource issue when people can literally rest rather than working overtime. I've tried to push for more automation for toils but they are too afraid of failure that it will break our system. I never understand this mindset because a failure means it can be preventative and improved in the future. I understand it might be because I'm in finance industry (trading), but I lose my motivation and interests because of them.\n\nso, does reliability actually means no innovation when system is already reliable?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/sre/comments/1rfbrmh/does_reliability_means_no_innovation/",
      "domain": "self.sre",
      "is_self": true,
      "comments": [
        {
          "id": "o7j2kqw",
          "author": "ninjaluvr",
          "text": "No. Your product managers and owners should be constantly engaging with customers and stakeholders to develop and manage the roadmap. They should be identifying market problems and ways to innovate and adapt the solution to address those, to reduce tech debt, to improve cost efficiency etc. And they should balance that innovative work against the error budget policy. We do lots of innovative work in the finance industry.",
          "score": 8,
          "created_utc": "2026-02-26 15:33:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7j4p03",
              "author": "No_Issue_3022",
              "text": "What are the most common tech debt or cost for your team?",
              "score": 0,
              "created_utc": "2026-02-26 15:43:51",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7jd5id",
                  "author": "ninjaluvr",
                  "text": "Tech debt are old libraries and packages. Inefficient and risky librariers and packages. Using specific values in code instead of making it configurable. Tightly integrated code  and creating components that are hard to change without breaking others... Using old platforms and languages that are difficult to find developers that are proficient in it. Lack of automated unit, integration, and functional tests, etc.\n\nCosts could be using old, non-cloud native tech stacks, poor architecture, etc. ",
                  "score": 3,
                  "created_utc": "2026-02-26 16:22:24",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7jao8l",
          "author": "IN-DI-SKU-TA-BELT",
          "text": "Our systems are the most stable when the developers are off for Christmas and New Years.",
          "score": 5,
          "created_utc": "2026-02-26 16:11:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7m519w",
              "author": "Hawkzer",
              "text": "Facts. Then the first release of the year is hit or miss or someone did a merge to develop without proper testing right before the break and breaks prod on first release of the year.",
              "score": 1,
              "created_utc": "2026-02-27 00:28:02",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7js6kn",
          "author": "DandyPandy",
          "text": "Humans make mistakes. Processes that are written out can be either be flubbed (shoot, missed that step) or ignored by people going cowboy and doing stuff outside the standard procedure. If it hasn’t caused a major problem, it means it either hasn’t caused a major problem yet, or someone covered their ass to make sure no one noticed.\n\nToil is not a solution. It’s the antithesis of SRE. One of the primary focuses of SRE is eliminating toil *because humans make mistakes*.",
          "score": 2,
          "created_utc": "2026-02-26 17:31:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7jsqbp",
              "author": "No_Issue_3022",
              "text": "exactly. that's why i'm so frustrated with my team/work. they think toil is totally okay and better than a failure from automation.",
              "score": 1,
              "created_utc": "2026-02-26 17:34:21",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7jszi5",
                  "author": "DandyPandy",
                  "text": "You have a cultural problem in your org. You are going to have to approach it from a perspective of convincing people in business impact terms. There are plenty of case studies that make the case. That’s where I would start.",
                  "score": 2,
                  "created_utc": "2026-02-26 17:35:32",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7ju2bd",
                  "author": "DandyPandy",
                  "text": "Also, the way you get buy-in for automation changes is to prove them out with automated tests. SRE is a software engineering approach to operations. So that means you need to have tests, both positive and negative, the same as you would in any application. Sure, you might miss some test cases. That’s where RCAs come in. But that’s true of any kind of issue.",
                  "score": 2,
                  "created_utc": "2026-02-26 17:40:34",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7jvzd0",
                  "author": "DandyPandy",
                  "text": "While the Phoenix Project is full of unrealistic stuff, it can be a model for how to begin the cultural shift. \n\nTry to get approval to make the changes you want to something that is generating toil, but is non-critical. You setup the guardrails to ensure automation fuckups aren’t going to sink the ship. Get a quantifiable baseline of the types of toil and how much time is being spent on it. Then you start automating away the things generating toil. Track how much things improve. You have to have hard metrics. Business people love metrics because one of the core tenants of every business program is you can’t improve what you don’t measure.",
                  "score": 2,
                  "created_utc": "2026-02-26 17:49:25",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7jy5m2",
          "author": "Not_Ayn_Rand",
          "text": "This is common in trading and the logic is understandable (millions if not billions of dollars on the line with 30 seconds downtime). I think it's indicative of a problematic attitude caused by old timers who want to do things the familiar way and management who doesn't care or has no vision for the infra work. This is not the case at every trading firm and it's time to update the resume if you're getting frustrated. However if the innovation is primarily gonna be AI based then I see the hesitation better just because AI is simply not deterministic enough for an industry where one tiny misjudgment can immediately cause disaster with real quantifiable impact.",
          "score": 2,
          "created_utc": "2026-02-26 17:59:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7k3nzh",
              "author": "No_Issue_3022",
              "text": "got it. good to hear from someone in the same field. not AI based work. ",
              "score": 1,
              "created_utc": "2026-02-26 18:24:31",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7j1l8v",
          "author": "asdoduidai",
          "text": "No? 🤣",
          "score": 3,
          "created_utc": "2026-02-26 15:29:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7kfy6k",
          "author": "curious_maxim",
          "text": "Applying a new technology, and replacing all previous  inefficiencies in an organization is task. Main stages are: understanding technology, getting it out to production _with_ full commitment and plan to replace legacy processes and systems, actually executing this plan. Otherwise it will be n+1st technology with own kinks and additional operational costs.",
          "score": 1,
          "created_utc": "2026-02-26 19:21:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7l7mwj",
          "author": "MonadEndofactor",
          "text": "If the system is already reliable, what exactly is your argument for reliability? Less of it, but automated? If so, it's automation for the sake of automation, and at the price of stability. Not something anyone want's in finance industry. ",
          "score": 1,
          "created_utc": "2026-02-26 21:33:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7l9ax4",
          "author": "bittrance",
          "text": "Two answers to this one:\nPartly non-fintech finance is generally driven by investment cycles, so managers will be adverse to taking risk with OPEX money.\n\nHowever, in your case I suspect the main problem is a overly narrow understanding of stability. System stability decreases over time, it just does not do it linearly. This decrease can be seen as wear or rot. Often, seemingly unrelated changes - latency increase in an integration perhaps, or a security update that causes a disk to fill up - will cause a crisis. Thus, you want to sell improvements as preventive maintenance.",
          "score": 1,
          "created_utc": "2026-02-26 21:41:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7mkyt4",
          "author": "thearctican",
          "text": "I came here and was disappointed to only see one hard “no”.\n\nThe answer to OP’s question is “no”.",
          "score": 1,
          "created_utc": "2026-02-27 01:59:00",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rdsbwl",
      "title": "Need help landing SRE roles [1.5 YOE currently at F500 Resume Review]",
      "subreddit": "sre",
      "url": "https://i.redd.it/wu0bfdzl2ilg1.png",
      "author": "d0lfun",
      "created_utc": "2026-02-24 20:52:13",
      "score": 6,
      "num_comments": 23,
      "upvote_ratio": 0.6,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/sre/comments/1rdsbwl/need_help_landing_sre_roles_15_yoe_currently_at/",
      "domain": "i.redd.it",
      "is_self": false,
      "comments": [
        {
          "id": "o77hy1z",
          "author": "MichaelMach",
          "text": ">Is \\~2 years of experience too little for the roles I’m targeting?\n\nWhat roles *are* you targeting? I'm surprised you aren't a junior without at least 2 YoE at your current job.\n\nThe data science master program is sending mixed signals, too. Sure, SREs deal with some graphs for monitoring and alerting, but what you're doing in that program is so far removed from the day-to-day of an SRE that I'd be suspicious as a hiring manager that you don't really care to be an SRE at all.",
          "score": 26,
          "created_utc": "2026-02-24 21:06:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o78raxi",
              "author": "d0lfun",
              "text": "My job has a very niche, company-specific title so I wasn’t sure what to label it as. Maybe application support is better suited?",
              "score": 1,
              "created_utc": "2026-02-25 00:57:08",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7ab6gy",
          "author": "tushkanM",
          "text": "1. You better remove the numbers - audit of 35 alerts + 10 pipes  in 2 years raises questions what did you do during the other 1 year and 6 months  \n2. Bring up more \"SRE-heavy\" language-  what SLOs/SLI is did you set up to observe, how many RCAs you conducted, how exactly MTTR was improved by %. You can fake it - nobody will check ",
          "score": 10,
          "created_utc": "2026-02-25 06:59:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o77mlnd",
          "author": "Sea_Refrigerator5622",
          "text": "I really dislike how your resume is formatted. Especially the centerered roles with right side dates. \n\nI’d look for a more conventional template. \n\nAs a manager I would give it some small weight as it’s relevant to how you can communicate and document.  Its a huge deal for some and no big deal for others.",
          "score": 7,
          "created_utc": "2026-02-24 21:27:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7bgnik",
              "author": "PercussiveScruf",
              "text": "I think they’re left aligned, just with white space used to redact the company names",
              "score": 4,
              "created_utc": "2026-02-25 12:54:21",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7e2iqe",
                  "author": "thecal714",
                  "text": "I think you're right. I see a bit of what might be a serif that didn't get redacted.",
                  "score": 1,
                  "created_utc": "2026-02-25 20:25:18",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o77lv35",
          "author": "paulv7",
          "text": "Here’s my take as a Director of SRE:\n\nWith your resume as is looking for an Observability Engineer role maybe easier than SRE.\n\nFor an SRE 1 role here are some things I’d want to see on your resume: \n\nYou need to find ways to learn and mention how you used AI to achieve business goals or save money. Ai is just another tool to move faster… How are you using/learning it.\n\nI would move your projects up just below your work experience. As I glossed over your resume and hardly read your projects. Which have some good tooling mentions in them. As I wrote this then went back to look at your resume and noticed you had a few of these::: What automation tooling have you used? Anything from Argo CD, Salt, Puppet, Ansible, Jenkins, gitlab ci/cd, github actions, terraform. Which as you see from other comments some people don’t care about home projects. Personally for an SRE 1 role that is a big factor for me in does this person really like playing  with technology or are they just looking to collect a pay check. In an SRE 1 interview I probably ask as many questions about someone’s home lab as work experience. Are they going to push themselves to get better or just be a button smasher.\n\nAnother item you could try to work on is if you have any oncall experience. At a high level what those responsibilities are and for how large of a platform. \n\nYour resume is very literal with the number of alerts you helped fix. Just saying “Worked with multiple dev teams to improve alerting and close observability gaps would cover it for me vs. giving exact numbers of alerts you touched. Then dive into the details in an interview.",
          "score": 7,
          "created_utc": "2026-02-24 21:24:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7atadw",
          "author": "Unlucky_You6904",
          "text": " tighten it to 1–2 pages, rename your current role to something market‑legible (e.g. ‘Application Support / Production Support’) and rewrite your bullets around SRE language: incidents handled, on‑call scope, SLIs/SLOs, MTTR/uptime, automation you built, and the scale of systems you touched. Pull your most relevant tools (Linux, cloud, containers, CI/CD, infra‑as‑code, observability stack) into a clear skills block and then echo them inside your experience bullets so it’s obvious you’re doing more than ticket chasing. An Observability / Platform / SRE I title might be an easier wedge than mid‑level SRE right now, but with sharper SRE‑style bullets and less noise, you should at least start getting interviews; if you revise in that direction and want another opinion, feel free to ping me.",
          "score": 3,
          "created_utc": "2026-02-25 09:47:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7h0j6s",
              "author": "puqpetmaster",
              "text": "This is a great advice",
              "score": 1,
              "created_utc": "2026-02-26 06:32:13",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o77iphn",
          "author": "poolpog",
          "text": "FWIW, I am an SRE manager who hires SREs. Though my experience as a manager is limited (i.e. I haven't been in this role very long).\n\n* *Is \\~2 years of experience too little for the roles I’m targeting?*\n\nProbably\n\n* *Should I remove certain things from my resume?*\n\nProbably not -- there's not a lot on there to begin with\n\n* *Do I need stronger/more relevant projects?*\n\nPersonally I don't give 2 shits about your personal projects being listed on your resume. Some hiring managers might. I do find them interesting to talk about during an interview. But on your resume? I mostly don't care.\n\n* *Should I be elaborating more on impact and metrics?*\n\nMaybe? Maybe not? This is probably fine as is. I personally truly hate resume bullet items in the format of \"Did <thing> by <implementation method> which resulted in <X %> <reduction of|increase in> <Some ohter thing>\" e.g.  \"Reduced Flarbnoz alerts by automating the deployment of Sparzel Nobbins, resulting in a 73% reduction in Alert Fatigue to the SRE Org\"\n\nGreat, good for you. You measured your Flarbnoz alerts. Or did you just make these numbers up? Who the fuck knows?\n\nOTOH, that's how resumes work, so :shrug:\n\n* *Am I aiming too high?*\n\nDefinitely not; Aim as high as you possibly can, imo. You'll probably get there eventually, but you also will probably only will get as high as you aim. (tbf I've seem some real lucky dunces get pretty far just by being pretty to look at and nice to be around)",
          "score": 9,
          "created_utc": "2026-02-24 21:09:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o77rc6o",
              "author": "User342349",
              "text": ">I personally truly hate resume bullet items in the format of \"Did <thing> by <implementation method> which resulted in <X %> <reduction of|increase in> <Some ohter thing>\"\n\nWhat *do* you like to see on a resume?",
              "score": 5,
              "created_utc": "2026-02-24 21:49:33",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o77yv65",
                  "author": "poolpog",
                  "text": "I get it -- how else can one declare one's efforts and successes other than in this format. Also, HR resume scan bots are definitely a thing.\n\nI just hate the format, it is so trite. Someone who can write their achievements out in a novel, interesting, or simply well written, way, will definitely pop to to the top of my list.\n\nEdit: Let me clarify -- I do like seeing achievments and successes. I just like them written more like actual human sentences than as HR-Scan-Bot-friendly templates.",
                  "score": 0,
                  "created_utc": "2026-02-24 22:25:33",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o7a2zcn",
              "author": "enby_them",
              "text": "Which is funny because I think many of us have been explicitly trained to make those numbers up if we don’t have them because hiring managers/recruiters expect them. I’ve also never once been asked about how I got the numbers on my resume.",
              "score": 2,
              "created_utc": "2026-02-25 05:51:44",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o77w3tl",
              "author": "Tryin2Dev",
              "text": "What measurements are you going by? Do ask questions to find out if they made the numbers up?",
              "score": 1,
              "created_utc": "2026-02-24 22:12:01",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o79quo3",
          "author": "poop-in-my-ramen",
          "text": "Fix the indentations. Why is role middle aligned instead of left? also some blue texts in education section. keep it black and white. ",
          "score": 2,
          "created_utc": "2026-02-25 04:24:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7fwzss",
          "author": "smuzzu",
          "text": "Use AI to fix your resume, you'll get much better results. Then come again and recheck here for further suggestions.",
          "score": 2,
          "created_utc": "2026-02-26 02:09:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7gacwk",
          "author": "kleekai_gsd",
          "text": "The resume is hecka hard to visually scan.  \nUnder \"Technology\" you have a seeming random collection of technologies.  I'd break out at least languages like java, sql, python etc.  Organize the rest similarly.\n\n1.5 years is awful junior for an SRE.  you can but your resume looks junior and confused which probably isn't helping.\n\nThen your two jobs, I'd align everything to the left, stop that right side stuff.\n\nI'm split on your personal projects... but take off the left aligned tech stacks, you don't do that anywhere else, so don't do it down there.",
          "score": 2,
          "created_utc": "2026-02-26 03:26:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7h09rq",
          "author": "puqpetmaster",
          "text": "I have the same personal project, I built and self hosted a portfolio but using proxmox lxc containers. I used nginx , cloudflared, umami (to see who viewed my website and from where), Terraform to build the containers and Ansible to configure them, Lastly GitHub actions to run terraform, playbooks and build the react app , the GitHub runner is also self hosted . React for frontend. DM me to see my repo",
          "score": 2,
          "created_utc": "2026-02-26 06:30:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o78mhlo",
          "author": "Prox_The_Dank",
          "text": "You got python listed twice in your technologies section just fyi",
          "score": 2,
          "created_utc": "2026-02-25 00:31:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7lcvd4",
          "author": "Efficient-Branch539",
          "text": "Why the font size is different for education headings, also so many technologies are written, I think they should be limited to relevant ones. And why not hyperlink your certifications?",
          "score": 1,
          "created_utc": "2026-02-26 21:58:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o806nl0",
          "author": "unab0mber",
          "text": "If you’re getting no interviews, I’d bet the resume reads like “IT/support” instead of “SRE outcomes” - rewrite each bullet as impact + scale + reliability metric (uptime/SLOs, MTTR, incident count, % toil reduced, automation hours saved) and make the top third scream that. Even if your current job doesn’t call it SRE, you can still frame what you did as on-call/incident response, monitoring/alerting, infra-as-code, and postmortems with concrete numbers. For resume tools, [Resume.io](https://resume.io) vs [OneTwoResume](https://onetworesume.com) vs [Zety](https://zety.com) are all fine, but the real win is swapping vague bullets for measurable reliability/ops results.",
          "score": 1,
          "created_utc": "2026-03-01 05:09:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o86mvhl",
          "author": "Over_Caterpillar5238",
          "text": "Basic formatting feedback:  \nYou might consider placing your Projects section before Certifications to highlight your practical experience first. Also, adding a brief “About” or professional summary at the top would give interviewers a quick overview of your background, so they don’t have to go through the entire resume to understand your experience.",
          "score": 1,
          "created_utc": "2026-03-02 05:43:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o77ji8b",
          "author": "hijinks",
          "text": "all you did is like 1/3 of a page?\n\nmake it at least 75% of the page.. the resume needs to be one page is so outdated. ",
          "score": -1,
          "created_utc": "2026-02-24 21:13:37",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rfrwa5",
      "title": "Started My SRE Career - What should I do early?",
      "subreddit": "sre",
      "url": "https://www.reddit.com/r/sre/comments/1rfrwa5/started_my_sre_career_what_should_i_do_early/",
      "author": "Own-Fee-4752",
      "created_utc": "2026-02-27 00:40:55",
      "score": 5,
      "num_comments": 21,
      "upvote_ratio": 0.63,
      "text": "hi! after a long recruiting cycle got my dream offer at an HFT firm for a 6 months SRE internship (trading systems reliability team) with full time conversion potential in the end. now i want to set myself up for a good career by learning the appropriate skills and getting good at this. my long term goal is to progress and work in swe/sre based roles on the reliability, security and infra side. what are skills/projects/resources i should look into early? \n\nfor context: i have mostly swe experience through internships, not sre specifically. also i have an msc and ba in cs, during which i mostly focused on security, low level and distributed systems. im currently lacking in the specific knowledge of tools such as prometheus, grafana and ansiable, which i am trying to get the basics of by the time my internship starts. any advice is appreciated! ",
      "is_original_content": false,
      "link_flair_text": "CAREER",
      "permalink": "https://reddit.com/r/sre/comments/1rfrwa5/started_my_sre_career_what_should_i_do_early/",
      "domain": "self.sre",
      "is_self": true,
      "comments": [
        {
          "id": "o7nyzd2",
          "author": "Zippyddqd",
          "text": "Keep coding and don’t let people say SREs can’t code. It will open doors later",
          "score": 16,
          "created_utc": "2026-02-27 07:48:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7pc9yg",
              "author": "Own-Fee-4752",
              "text": "will do! that was always my only concern, as i heard people say that before, glad to hear that its not the case",
              "score": 3,
              "created_utc": "2026-02-27 14:13:25",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7nptdg",
          "author": "teivah",
          "text": "I made a roadmap, if that can help: https://github.com/teivah/sre-roadmap. TL;DR: Focus on the foundations.",
          "score": 7,
          "created_utc": "2026-02-27 06:29:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7q6n6x",
              "author": "KubernetesMadeMeCry",
              "text": "Thank you!",
              "score": 1,
              "created_utc": "2026-02-27 16:42:42",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o7sof9f",
              "author": "SWEETJUICYWALRUS",
              "text": "Is it worth the effort to work at Google?",
              "score": 1,
              "created_utc": "2026-02-28 00:17:18",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7t1c9g",
                  "author": "teivah",
                  "text": "Totally",
                  "score": 2,
                  "created_utc": "2026-02-28 01:35:11",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7mii2i",
          "author": "Jazzlike_Syllabub_91",
          "text": "Sounds like all fun things to learn. You may want to try installing something like rancher desktop/k3s or something that allows you to run kubernetes/docker containers.\n\nFor high frequency trading, you may need to check out things like system response times, and learning how to access things like logs from containers",
          "score": 3,
          "created_utc": "2026-02-27 01:44:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7pcfj4",
              "author": "Own-Fee-4752",
              "text": "makes sense, thanks. would you recommend any test project to implement to incorporate all this?",
              "score": 1,
              "created_utc": "2026-02-27 14:14:16",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7rdx4s",
                  "author": "Jazzlike_Syllabub_91",
                  "text": "You can make a random hello world or something more exciting and put it into a container (docker) then deploy it to kubernetes…",
                  "score": 1,
                  "created_utc": "2026-02-27 20:10:03",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7n25xj",
          "author": "tom_lurks",
          "text": "Focus on resilience, with AI into the mix, I feel a lot of low level stuff will be eliminated from most jobs but discretion will remain, learn failure patterns, what makes systems fail, what makes them resilient. Fault tolerance, DR, cascading failures, circuit breakers, capacity planning etc.\n\nAnd obviously: logs, metrics and traces, that should be the first thing imo.",
          "score": 2,
          "created_utc": "2026-02-27 03:40:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7pbu87",
              "author": "Own-Fee-4752",
              "text": "thanks! that makes sense",
              "score": 1,
              "created_utc": "2026-02-27 14:11:01",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7ujb0r",
          "author": "gnorts_mr_alien7",
          "text": "what was interview like? was it leetcode heavy? ",
          "score": 1,
          "created_utc": "2026-02-28 08:14:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7us3w3",
              "author": "Own-Fee-4752",
              "text": "had a leetcode OA and 1 leetcode heavy round. also 2 behaviourals and 4 technicals",
              "score": 1,
              "created_utc": "2026-02-28 09:37:12",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7p95ee",
          "author": "zerosanity",
          "text": "Learn the teams workflow and what their pain points are, start there",
          "score": 0,
          "created_utc": "2026-02-27 13:56:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7mmypg",
          "author": "nullset_2",
          "text": "Learn about High Availability and use HAProxy.\n\nLearn about linux and start daily driving it. Lose your fear of the CLI. Use tmux.\n\nLearn about kubernetes and deploy a cluster with k3s using ansible.\n\nHomelab, homelab, homelab. Set up a NAS.\n\nLearn about subnet masks and how to configure subnets and start subnetting, even if virtually. I recommend a game called \"Data Center\" where you can do this virtually.\n\nLearn about networking, switches, routers and how they differ. Protocols: TCP, UDP, DHCP, IPMI.\n\nLearn about the OSI model and why DNS matters.\n\nLearn about cloud once you got all the previous and how to use cloud init and Cloudformation in AWS. Definitely focus on AWS.\n\nThe work never ends but the dividends are exponential. Good luck OP.",
          "score": -8,
          "created_utc": "2026-02-27 02:10:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7pbmxu",
              "author": "Own-Fee-4752",
              "text": "hi, thanks for the advice. not sure why this was downvoted.\n\nim writing my thesis in datacenter network and took advanced courses so i had a chance to learn the foundations. the home lab sounds very interesting, i saw people mention it here - what’s the process there?",
              "score": 1,
              "created_utc": "2026-02-27 14:09:53",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7q8mv6",
                  "author": "teivah",
                  "text": "To give context about the downvotes (or at leat for my downvote), I stopped after the first sentence. High Availability is a concept, HAProxy is a load balancer. High Availability can be achieved via the use of various patterns, including the use of load balancers but 1. it’s not sufficient and 2. other load balancers exist. So, I didn’t follow the reasoning here.",
                  "score": 1,
                  "created_utc": "2026-02-27 16:51:57",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7qgv8h",
                  "author": "nullset_2",
                  "text": "Join /r/homelab!",
                  "score": 1,
                  "created_utc": "2026-02-27 17:30:51",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1rd618g",
      "title": "SRE Career Path Guidance",
      "subreddit": "sre",
      "url": "https://www.reddit.com/r/sre/comments/1rd618g/sre_career_path_guidance/",
      "author": "Efficient-Branch539",
      "created_utc": "2026-02-24 04:40:21",
      "score": 4,
      "num_comments": 7,
      "upvote_ratio": 0.7,
      "text": "I have been working as a DevOps engineer for 2.5 years in Germany, and in this time I have worked with tools like Terraform, Jenkins, Ansible, Docker, Kubernetes, Prometheus etc. My responsibilities include creating/improving CI/CD workflows and helping devs build their code faster, adding prometheus targets, keeping Kubernetes cluster up (its Rancher on premise), use Vault, I have not worked on database side of things, like with Postgres cluster, that’s managed by another team.\n\nI have an underlying feeling that I am not doing an actual SRE related work, like scaling a service, setting SLI/SLOs or monitoring the specific metrics or writing code very often.\n\nMy question is how can I level up my skills to feel confident when applying for a SRE role. Should I get any specific certification? Will my experience be considered as a useful experience in big tech companies.\n\nThank you",
      "is_original_content": false,
      "link_flair_text": "CAREER",
      "permalink": "https://reddit.com/r/sre/comments/1rd618g/sre_career_path_guidance/",
      "domain": "self.sre",
      "is_self": true,
      "comments": [
        {
          "id": "o731dms",
          "author": "ohlaph",
          "text": "I would always start where you are at. Ask to do more SRE tasks to get experience under your belt. ",
          "score": 3,
          "created_utc": "2026-02-24 04:52:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7acy94",
          "author": "ProtectionBrief4078",
          "text": "This is actually a very common place to be, especially for DevOps engineers who grew into platform work first. What you are doing now is still highly relevant to SRE, even if it does not feel like the textbook version. Keeping CI/CD reliable, clusters healthy, observability working, and secrets secure are all core building blocks of SRE work.\n\nThe gap you are sensing is usually around service ownership and reliability thinking rather than tools. You can level up by practicing SRE concepts deliberately, like defining SLIs and SLOs for one service, improving alert quality, or doing basic load and failure testing, even if it is on a side project or a non critical service.\n\nCertifications can help with structure, but they are rarely a deciding factor in big tech. Your experience will be considered useful if you frame it in terms of reliability, automation, incident prevention, and tradeoffs instead of just listing tools.\n\nDo you have access to any production services where you could start proposing SLOs or improving alerting, even in a small scoped way?",
          "score": 3,
          "created_utc": "2026-02-25 07:15:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7bav5o",
              "author": "Efficient-Branch539",
              "text": "As far as I can think there are some gaps where I can propose alerts especially on Jenkins, but that’s a good point to start. For SLOs, I am not sure as no one talks about it.\nAlso from your answer I understand that one should be thinking in SRE terms and rephrasing is needed.",
              "score": 1,
              "created_utc": "2026-02-25 12:15:39",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7bcjkk",
                  "author": "ProtectionBrief4078",
                  "text": "That makes sense, and honestly you’re already on the right track. The SLO part being unclear is super common, so you’re not alone there. A lot of this really clicks once you start thinking more in SRE terms and tying it back to user impact. Would you be open to a quick DM to compare setups and talk through this a bit more?",
                  "score": 1,
                  "created_utc": "2026-02-25 12:27:20",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1reyqzh",
      "title": "Passed SRE Foundations Certification",
      "subreddit": "sre",
      "url": "https://www.reddit.com/r/sre/comments/1reyqzh/passed_sre_foundations_certification/",
      "author": "isbhuvan",
      "created_utc": "2026-02-26 03:04:26",
      "score": 4,
      "num_comments": 3,
      "upvote_ratio": 0.63,
      "text": "I just finished the SRE Foundation exam by DevOps Institute and wanted to share some notes. \n\nIt’s an open-book exam, but that doesn't mean it’s easy. It’s 40 questions in 60 minutes. You don't have time to read the whole syllabus during the test.\n\n**Is it worth it?**\n\n* **For Juniors:** It’s a great \"Big Picture\" view of how production works.\n* **For Seniors:** It’s a good brush-up to standardize your terminology.\n\n**Full Disclosure:** I’ve documented my full 5-day journey and breakdown of each session on my blog**:** [Late Night SRE: Efficiency Under Pressure](https://medium.com/@isbhuvan/late-night-sre-efficiency-under-pressure-6024386830b1)\n\nHappy to answer any specific questions about the syllabus or the study methodology in the comments!",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/sre/comments/1reyqzh/passed_sre_foundations_certification/",
      "domain": "self.sre",
      "is_self": true,
      "comments": [
        {
          "id": "o7gblj9",
          "author": "ReliabilityTalkinGuy",
          "text": "Please don’t waste your time on any “certifications” by the “DevOps Institute”. It’s all a joke. It won’t help you find a job or anything of the sort. ",
          "score": 17,
          "created_utc": "2026-02-26 03:34:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7gj6ok",
              "author": "isbhuvan",
              "text": "Fair point. I didn't take this for a job search. For context, I’ve been a Cloud Engineer for 10 years with a heavy focus on development and automation (lots of Terraform and automating toil). My company recently ran a certification drive and I saw it as a good opportunity to validate.",
              "score": -1,
              "created_utc": "2026-02-26 04:22:25",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7ywdqz",
          "author": "GrogRedLub4242",
          "text": "this sounds like an ad for it",
          "score": 2,
          "created_utc": "2026-03-01 00:13:37",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rilv0u",
      "title": "I built an app that ruins my beach days",
      "subreddit": "sre",
      "url": "https://i.redd.it/maxbgjnmxkmg1.jpeg",
      "author": "eureka_boy",
      "created_utc": "2026-03-02 06:54:38",
      "score": 2,
      "num_comments": 0,
      "upvote_ratio": 0.67,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "HUMOR",
      "permalink": "https://reddit.com/r/sre/comments/1rilv0u/i_built_an_app_that_ruins_my_beach_days/",
      "domain": "i.redd.it",
      "is_self": false,
      "comments": []
    }
  ]
}