{
  "metadata": {
    "last_updated": "2026-02-11 17:29:58",
    "time_filter": "week",
    "subreddit": "sre",
    "total_items": 9,
    "total_comments": 24,
    "file_size_bytes": 27578
  },
  "items": [
    {
      "id": "1r0fa8h",
      "title": "The $70M domain that couldn’t survive a Super Bowl ad",
      "subreddit": "sre",
      "url": "https://extended.reading.sh/ai-dot-com-crashes-on-superbowl",
      "author": "jpcaparas",
      "created_utc": "2026-02-09 20:19:17",
      "score": 31,
      "num_comments": 2,
      "upvote_ratio": 0.84,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/sre/comments/1r0fa8h/the_70m_domain_that_couldnt_survive_a_super_bowl/",
      "domain": "extended.reading.sh",
      "is_self": false,
      "comments": [
        {
          "id": "o4hz6yj",
          "author": "tky",
          "text": "Most effective advertising CloudFlare never paid for.",
          "score": 16,
          "created_utc": "2026-02-09 20:57:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4kn46v",
          "author": "Low_Log2832",
          "text": "Probably nobody told the SRE team, that they were up for some extra traffic",
          "score": 0,
          "created_utc": "2026-02-10 06:31:33",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qxa5py",
      "title": "Do you have a dedicated release engineering team in your org?",
      "subreddit": "sre",
      "url": "https://www.reddit.com/r/sre/comments/1qxa5py/do_you_have_a_dedicated_release_engineering_team/",
      "author": "tom_lurks",
      "created_utc": "2026-02-06 06:27:40",
      "score": 14,
      "num_comments": 5,
      "upvote_ratio": 0.89,
      "text": "I've held the title of an \"SRE\" for around 5 years yet have never felt like one. Orgs I worked for did not have any SLO defined and the idea around monitoring a service was that it \"should be up as much as possible\". Things usually were driven by dev and what they wanted to do and SRE was more of the Ops team of old days with fancy tooling and new designations. For the most part I have seen titles like \"devops engineer\" and \"SRE\" used interchangeably for the person who does everything, you are the guy who gets the pager, you are the guy who has to deal with whims and fancies of devs, you are the guy with too much responsibility and almost always low autonomy. \n\nI have been applying for jobs lately and every company I have interviewed with do not have a dedicated release team, SREs are supposed to be doing everything, I don't see the practice of error budgets being applied for release. Most of these \"SRE\" roles do not do any value add but simply do reactive response work and firefighting, babysitting systems instead of changing things, needless to say such places get political in no time.\n\nI'd like to hear from others in the industry, do you have release work and reliability work divided in your org? How much autonomy does your org provide? Does SRE have technical say? Do devs listen? Can SRE negotiate?\n\nIs this the \"industry norm\" or I'm just unlucky?",
      "is_original_content": false,
      "link_flair_text": "DISCUSSION",
      "permalink": "https://reddit.com/r/sre/comments/1qxa5py/do_you_have_a_dedicated_release_engineering_team/",
      "domain": "self.sre",
      "is_self": true,
      "comments": [
        {
          "id": "o3uzqn8",
          "author": "RoboErectus",
          "text": "You should never “have the pager.”\n\nIf the site goes down, product teams need to scale, rollback, or patch.\n\nIf any of those things don’t work the way you’ve got them designed, sure they can page you.\n\nI don’t decide which kpi’s generate alerts. But I can be opinionated and give guidance.\n\nIf teams are throwing tech debt at you, you’ve got an org problem.",
          "score": 16,
          "created_utc": "2026-02-06 06:45:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3xz8wi",
          "author": "FullStackDestroyer",
          "text": "I lead a dedicated release team within the SRE org. I’m hiring too!  \n\nOn OP’s topic:  the titles don’t mean much, it’s the work you do that’s important.  If you don’t want to do the ops grind, opt out of it.  It’s much easier now than ever to leverage the tools we have to “punch above our weight” including doing dev, design and full stack work.  There aren’t any barriers, really, anymore. This is great for those that are brave and creative, and an absolute terror for anyone who defined themselves by a job that is now a commodity.",
          "score": 5,
          "created_utc": "2026-02-06 18:17:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3vfyit",
          "author": "Fun-Adeptness9700",
          "text": "Feeling similar to you in my workplace and Im getting more and more frustrated",
          "score": 3,
          "created_utc": "2026-02-06 09:15:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3xlwqt",
          "author": "StandardFantastic806",
          "text": "Just out of curiosity, are you ex-Google? Because I didn't know that this kind of structure was used anywhere outside of Google.",
          "score": 1,
          "created_utc": "2026-02-06 17:14:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4dirwa",
          "author": "Not_Ayn_Rand",
          "text": "I've only worked at places that had dedicated devops/release teams vs reliability/ops? Is this a company size thing?",
          "score": 1,
          "created_utc": "2026-02-09 03:46:36",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qxv704",
      "title": "The purpose of Continuous Integration is to fail",
      "subreddit": "sre",
      "url": "https://blog.nix-ci.com/post/2026-02-05_the-purpose-of-ci-is-to-fail",
      "author": "NorfairKing2",
      "created_utc": "2026-02-06 21:55:26",
      "score": 9,
      "num_comments": 1,
      "upvote_ratio": 0.74,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "BLOG",
      "permalink": "https://reddit.com/r/sre/comments/1qxv704/the_purpose_of_continuous_integration_is_to_fail/",
      "domain": "blog.nix-ci.com",
      "is_self": false,
      "comments": [
        {
          "id": "o45snag",
          "author": "neuralspasticity",
          "text": "Bots and salesdroids posting again?",
          "score": 3,
          "created_utc": "2026-02-07 23:00:50",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qxhv6r",
      "title": "Best Internal Developer Platform?",
      "subreddit": "sre",
      "url": "https://www.reddit.com/r/sre/comments/1qxhv6r/best_internal_developer_platform/",
      "author": "REALMRBISHT",
      "created_utc": "2026-02-06 13:38:43",
      "score": 8,
      "num_comments": 17,
      "upvote_ratio": 0.68,
      "text": "We’re looking into introducing an internal developer platform to reduce infra sprawl and standardize how teams provision and deploy. Today we use Terraform and CI pipelines per team, but onboarding is slow and guardrails aren’t consistent.\nIdeally want Git-based workflows, reusable infra templates, env isolation, RBAC, and some cost visibility, without building everything ourselves.\nWhat platforms are you folks using in production?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/sre/comments/1qxhv6r/best_internal_developer_platform/",
      "domain": "self.sre",
      "is_self": true,
      "comments": [
        {
          "id": "o3xy3jl",
          "author": "draeron",
          "text": "Dedicated platform team and a lot of work and forethought to prevent toil creation.\n\nWe have a team of 4-5 devs and we support 100+ devs with around 3000k deployment skus.\n\nHonestly most use case can be resumed to:\n\n- container payload\n- RDS database\n- bucket s3\n- sometimes a scratch local storage\n\nStart with simple use case and enrich it over time. Make the happy path easier for them than managing it.",
          "score": 12,
          "created_utc": "2026-02-06 18:12:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4pgp06",
              "author": "ArtSpeaker",
              "text": "This also works great cause then it's someone's job to keep track of what the values are and what they mean. If a dev or manager asks for something insane or impossible there can be a human conversation instead of just crashing thrashing deployment logs. Much less likely to fatfinger cloud configuration if your \"whole\" job is cloud configuration -- especially with how often cloud platforms \"update\" their features or ui or ..whatever it is.\n\nOur decicated team also then becomes the focus of \"how much is this all costing us\" questions mgmt (rightfully) loves to ask, and it doesn't affect the application devs until it absolutely has to.\n\n10/10 experience would do again.",
              "score": 1,
              "created_utc": "2026-02-10 23:29:12",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o43n5kb",
          "author": "Internal-Tackle-1322",
          "text": "From experience, the biggest mistake is trying to build a “full platform” too early.\n\nIn practice, most teams only need a small set of well-defined paths: CI templates, basic infra modules, sane IAM/secrets, and built-in observability.\n\nIf the default workflow is easy and reliable, teams will actually use it.\n\nWe had better results starting simple with Terraform + GitOps and adding controls over time, instead of designing everything upfront.\n\nI’d prioritize fast onboarding and operational visibility first, and let the platform grow organically.",
          "score": 4,
          "created_utc": "2026-02-07 16:18:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4egpnm",
              "author": "Atidyshirt",
              "text": "very interesting take; I am in a similar boat to OP - although probably less-developed (first project through the cloud wall for us really), and low experience within teams in cloud.\n\nWe are going for Argo+kubernetes+terraform infra (only basic for now); devs are requesting a boot everything on your desk setup (Kind or similar)\n\nIt's fairly basic but new to us so taking some time to upskill and get in the groove of the modern day world, so curious if you think this is a big jump or just the bear-bones you need to get started (basic GitOps+cloud native AWS)?",
              "score": 2,
              "created_utc": "2026-02-09 08:18:00",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4jkhn6",
                  "author": "Internal-Tackle-1322",
                  "text": "I don’t think it’s overkill, but it *is* a non-trivial jump for a first cloud project.\n\nArgo + Kubernetes + Terraform is basically the modern baseline now. The main risk isn’t the tools, it’s adopting **too many paradigms at once**.\n\nKeeping Terraform focused on core infra, using Argo/GitOps with a very small surface area, and treating Kind as a *developer convenience* (not a perfect prod replica) is a solid approach.\n\nIf the happy path for devs is simple and observable, you’re on the right track.",
                  "score": 1,
                  "created_utc": "2026-02-10 02:07:38",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3xtvc3",
          "author": "circalight",
          "text": "For most companies, Port as it's ready out of the box. When there's like 1,000+ devs and bandwidth to have a team to build an IDP and maintain it, then you can consider Backstage.",
          "score": 12,
          "created_utc": "2026-02-06 17:52:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3yurt8",
              "author": "Kaelin",
              "text": "Brought to you by Port.\n\nIn fact with the aggressive botting and unabashed ads we have been getting in this sub, the post was probably by Port, so that this reply could happen.",
              "score": 5,
              "created_utc": "2026-02-06 20:51:52",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o424wan",
                  "author": "Bazeque",
                  "text": "Wouldn't surprise me. Personally though, I find port is good for greenfield. For non, then another provider like cortex is better imo.",
                  "score": 0,
                  "created_utc": "2026-02-07 10:22:12",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3wemsm",
          "author": "blitzkrieg4",
          "text": "Backstage",
          "score": 1,
          "created_utc": "2026-02-06 13:40:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3wf2ze",
              "author": "azizabah",
              "text": "For the love of all that is holy only use existing functionality. You do this and it's one guy supporting the tool with minimal effort. You use it to solve every problem and you're gonna need a whole dev team",
              "score": 7,
              "created_utc": "2026-02-06 13:43:24",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o40pe3e",
              "author": "imagebiot",
              "text": "Enjoy your updates",
              "score": 5,
              "created_utc": "2026-02-07 03:08:00",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o40offp",
              "author": "Devops_143",
              "text": "I am about to comment this 👍",
              "score": -2,
              "created_utc": "2026-02-07 03:01:50",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o47q3cm",
          "author": "PudsBuds",
          "text": "I feel like a lot of these self serve dev things like backstage are an anti-pattern. Every dev team has slightly different use cases and to me it makes sense to have basic modules for the golden path dev groups of functionality...\n\n\n\n\nBackstage (and others) end up just taking teams of people to maintain a brittle solution.\n\n\nI use azure so I've been pushing teams towards using the AVM (azure verified modules) and that helps a lot. At least then I don't have to maintain it as much.\n\n\nWhat I try to do for dev teams is democratized subscriptions where they have the ability to deploy most things by themselves, then a set of easy to import modules that have the gold path for the company. Then a sample app that has usages of a lot of the different golden path modules and a basic .net app.\n\n\nWorks well enough for us. Also workload ID is a godsend",
          "score": 1,
          "created_utc": "2026-02-08 06:53:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4fzbub",
              "author": "needawomanbysoul",
              "text": "Hey I would like to know about this setup, can I DM you?",
              "score": 1,
              "created_utc": "2026-02-09 15:11:23",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4jci5l",
                  "author": "PudsBuds",
                  "text": "Sure",
                  "score": 1,
                  "created_utc": "2026-02-10 01:20:54",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o47qayq",
          "author": "Extra_Taro_6870",
          "text": "github/gitlab with documents, pages and automation. backstage requires a team to manage, but a repo can be managed by each and every developer.",
          "score": 1,
          "created_utc": "2026-02-08 06:55:04",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qwppbj",
      "title": "What can be the reasons for highly duplicated OpenTelemetry spans?",
      "subreddit": "sre",
      "url": "https://www.reddit.com/r/sre/comments/1qwppbj/what_can_be_the_reasons_for_highly_duplicated/",
      "author": "GroundbreakingBed597",
      "created_utc": "2026-02-05 16:21:05",
      "score": 7,
      "num_comments": 4,
      "upvote_ratio": 0.82,
      "text": "I am analyzing OpenTelemetry spans from various apps, services, serverless functions, ...\n\nIn my exploration I found that some of those apps send highly duplicated spans to my backend observability platform. With duplicated I mean that I see 50+ spans coming in with the identical timestamp, trace id, span id, endpoint ...\n\nI am trying to figure out where that duplication might come from. I can only imagine that it has to do with a strange OTel Collector setup where the collector is resending the same span - or - where the OTel setup is load balancing data and multiple OTel collectors therefore end up sending the same data. Whats still odd though that I have so many duplicated spans\n\nHere a screenshot of my query that shows the number of duplicated spans.\n\nBesides my two reasons above - is there any other scenario where duplicated spans would be sent? Thanks\n\nhttps://preview.redd.it/8ochiizwbphg1.png?width=1121&format=png&auto=webp&s=3c0a512fe00c11ae11d7fc76da5c5fb4914919c0",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/sre/comments/1qwppbj/what_can_be_the_reasons_for_highly_duplicated/",
      "domain": "self.sre",
      "is_self": true,
      "comments": [
        {
          "id": "o3v4qac",
          "author": "GroundbreakingBed597",
          "text": "Hi. Thanks everyone for the comments. We found the issue.\n\nThere was a bug in the OTel Client Library that was used. It was a custom built library that started sending spans multiple times. So - the data was really sent in duplicates - and - I confirmed that with my DQL query that you saw in the screenshot. That query allowed me to count all the spans that have the same timestamp, trace id, span id, service name and span name\n\nAndi",
          "score": 3,
          "created_utc": "2026-02-06 07:29:03",
          "is_submitter": true,
          "replies": []
        },
        {
          "id": "o3r4g9w",
          "author": "askedrelic",
          "text": "External requests with trace-ids that otel forwards through the system? I'm dealing with this internally; where some of our external APIs are used in other services and they include trace-ids. We need to update our external LB to strip all external trace-ids.",
          "score": 1,
          "created_utc": "2026-02-05 17:44:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3u0wcl",
          "author": "kusanagiblade331",
          "text": "Seems very strange. I am not sure what visualization tool you are using. But, is there a possibility that it is the visualization tool's problem? Perhaps, it does not decouple by traceId properly? \n\nIf OTel was a problem, you could try to perform a dedup. Also, maybe check the Collector logs to see if there is anything wrong?",
          "score": 1,
          "created_utc": "2026-02-06 02:41:11",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qx2nia",
      "title": "Are SRE teams starting to own runtime controls and policy for LLM-backed services?",
      "subreddit": "sre",
      "url": "https://www.reddit.com/r/sre/comments/1qx2nia/are_sre_teams_starting_to_own_runtime_controls/",
      "author": "nordic_lion",
      "created_utc": "2026-02-06 00:26:46",
      "score": 5,
      "num_comments": 0,
      "upvote_ratio": 0.86,
      "text": "I’m seeing a growing set of responsibilities show up in production AI systems that don’t fit cleanly into classic MLOps or platform work.\n\nIn practice, the work looks a lot like SRE ownership: runtime throttling, policy enforcement, observability gaps, cost containment, and incident response for LLM-backed services.\n\nThe roles hiring for this are scattered across titles (SRE, platform, MLOps, infra), but the underlying responsibility seems pretty consistent.\n\nI’ve been tagging these roles under a single bucket just to make the pattern easier to see: [https://www.genops.jobs](https://www.genops.jobs)\n\nCurious if SRE teams here are feeling this pull, or if it’s still landing elsewhere in your orgs.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/sre/comments/1qx2nia/are_sre_teams_starting_to_own_runtime_controls/",
      "domain": "self.sre",
      "is_self": true,
      "comments": []
    },
    {
      "id": "1qvwbgf",
      "title": "At what point does reasonable assurance turn into busywork?",
      "subreddit": "sre",
      "url": "https://www.reddit.com/r/sre/comments/1qvwbgf/at_what_point_does_reasonable_assurance_turn_into/",
      "author": "Salt_Slip_7732",
      "created_utc": "2026-02-04 18:20:11",
      "score": 4,
      "num_comments": 5,
      "upvote_ratio": 0.75,
      "text": "We’re not trying to dodge audits but some requests feel more about formatting than risk.  \n Same control, same outcome just asked three different ways across customers and frameworks.\n\nWe keep answering honestly but the overhead keeps growing.\n\nHow do you decide when evidence is enough?",
      "is_original_content": false,
      "link_flair_text": "DISCUSSION",
      "permalink": "https://reddit.com/r/sre/comments/1qvwbgf/at_what_point_does_reasonable_assurance_turn_into/",
      "domain": "self.sre",
      "is_self": true,
      "comments": [
        {
          "id": "o3kvyhc",
          "author": "FunnyAd6792",
          "text": "Agreed, we centralized the explanations alongside the evidence. Delve helped us capture context once so auditors didn’t need live walkthroughs every cycle.",
          "score": 6,
          "created_utc": "2026-02-04 18:59:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3kobsw",
          "author": "Fantastic-Opening-57",
          "text": "This is a documentation problem not a control problem",
          "score": 5,
          "created_utc": "2026-02-04 18:25:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3kxd1g",
          "author": "fubo",
          "text": "Who is being assured?",
          "score": 1,
          "created_utc": "2026-02-04 19:05:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3l2fcw",
              "author": "Salt_Slip_7732",
              "text": "Mostly customers and their risk teams and auditors.",
              "score": 1,
              "created_utc": "2026-02-04 19:28:57",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3le99c",
          "author": "EventHorizon1997",
          "text": "If it’s a consistent problem with regular formats, then it’s time to automate the documentation. Audits are important, formatting is trivial as long as the information is in tact.\n\nHave you tracked the hours you and your team address spending on it? Find where in the price you can reduced the busy work and m make it an easy project win.",
          "score": 1,
          "created_utc": "2026-02-04 20:25:19",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qwps55",
      "title": "AppSec prioritization in your workflows?",
      "subreddit": "sre",
      "url": "https://www.reddit.com/r/sre/comments/1qwps55/appsec_prioritization_in_your_workflows/",
      "author": "kckrish98",
      "created_utc": "2026-02-05 16:24:01",
      "score": 3,
      "num_comments": 2,
      "upvote_ratio": 1.0,
      "text": "I just wanna know how teams are actually prioritizing AppSec findings day to day With SAST, SCA, secrets, and some runtime data all producing results, what usually drives fix order in practice?\n\nWould be good to hear how its working for different pipelines and environments",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/sre/comments/1qwps55/appsec_prioritization_in_your_workflows/",
      "domain": "self.sre",
      "is_self": true,
      "comments": [
        {
          "id": "o3uy9ad",
          "author": "hatethissubreddit",
          "text": "Due to regulatory requirements, we need to run DAST scans on our critical apps. We installed Acunetix for this and we run it once a day on all our critical apps. \n\nWe integrated the checks directly into our deployment pipeline. If there has been a successful scan in the last 30 days, the deployment is authorized to go up to production, if not it’s blocked after the preproduction deployment. At this step, it shows the developer the results and they can work on fixing it and retriggering a scan.",
          "score": 1,
          "created_utc": "2026-02-06 06:32:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ks8nx",
          "author": "shrimpthatfriedrice",
          "text": "from an sre point of view we stopped ranking purely by cvss and started looking at exposure and reachability\n\nan issue that never makes it past staging is very different from one deployed across multiple services\nOX Security helps us see that connection between code, ci, and runtime so fixes align with operational risk",
          "score": 1,
          "created_utc": "2026-02-10 07:16:56",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r08g9f",
      "title": "How to Reduce Telemetry Volume by 40% Smartly",
      "subreddit": "sre",
      "url": "https://newsletter.signoz.io/p/is-your-opentelemetry-auto-instrumented",
      "author": "elizObserves",
      "created_utc": "2026-02-09 16:16:07",
      "score": 3,
      "num_comments": 1,
      "upvote_ratio": 0.57,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/sre/comments/1r08g9f/how_to_reduce_telemetry_volume_by_40_smartly/",
      "domain": "newsletter.signoz.io",
      "is_self": false,
      "comments": [
        {
          "id": "o4m9lo8",
          "author": "mumblerit",
          "text": "what a joke",
          "score": 1,
          "created_utc": "2026-02-10 14:19:28",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}