{
  "metadata": {
    "last_updated": "2026-02-20 17:10:01",
    "time_filter": "week",
    "subreddit": "sre",
    "total_items": 11,
    "total_comments": 43,
    "file_size_bytes": 49726
  },
  "items": [
    {
      "id": "1r7glii",
      "title": "Laid-Off Tech Workers Are Organizing. Come Join Our Mass Call",
      "subreddit": "sre",
      "url": "https://www.reddit.com/r/sre/comments/1r7glii/laidoff_tech_workers_are_organizing_come_join_our/",
      "author": "Mynameis__--__",
      "created_utc": "2026-02-17 19:47:47",
      "score": 147,
      "num_comments": 6,
      "upvote_ratio": 0.94,
      "text": "There were over 108,000 tech workers laid off in the month of January. If you know someone who was part of a layoff, or is anxious about future layoffs, we’re organizing a call this Sunday and we hope you can join.\n\nThe Tech Workers Coalition is hosting a mass call for laid-off workers, students, and allies on **Sunday, February 22, 11am PST / 2pm EST.**\n\nYou’ll hear from workers at Amazon and the Washington Post Tech Guild talk about their recent experiences, and share information about organizing mutual aid for vulnerable workers (including H-1B visa holders). We’ll also talk with Andrew Stettner from the National Employment Law Project about how to prepare for a layoff, with know-your rights guidance, to help navigate severance and unemployment benefits.\n\nWe’re organizing for urgent policy changes around AI and unemployment protections. The time is now to mobilize. Workers deserve to share in the prosperity that AI creates, not just bear the costs.\n\nWe hope you can join the call:\n\n[https://www.wwwrise.org](https://www.wwwrise.org/) \n\nPlease pass this forward to other people you know who might be interested! Thank you for your solidarity and support.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/sre/comments/1r7glii/laidoff_tech_workers_are_organizing_come_join_our/",
      "domain": "self.sre",
      "is_self": true,
      "comments": [
        {
          "id": "o5yfgv9",
          "author": "SatoriSlu",
          "text": "Highly support this. Tech workers should have organized a long time ago. Work with your local DSA chapter.",
          "score": 28,
          "created_utc": "2026-02-17 23:26:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5zsc8i",
              "author": "boomertsfx",
              "text": "Wait until the robots unionize!",
              "score": 3,
              "created_utc": "2026-02-18 03:56:37",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5x6s2l",
          "author": "timee_bot",
          "text": "View in your timezone:  \n[Sunday, February 22, 11am PST][0]  \n\n[0]: https://timee.io/20260222T1900?tl=Laid-Off%20Tech%20Workers%20Are%20Organizing.%20Come%20Join%20Our%20Mass%20Call",
          "score": 7,
          "created_utc": "2026-02-17 19:48:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5yo5it",
          "author": "wuteverman",
          "text": "Neat!",
          "score": 1,
          "created_utc": "2026-02-18 00:14:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o63yalr",
          "author": "ReliabilityTalkinGuy",
          "text": "There is no way this isn't a honeypot.",
          "score": -4,
          "created_utc": "2026-02-18 19:31:10",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r9uw96",
      "title": "Multi cloud was supposed to save us from vendor lock in but now we're just locked into two vendors",
      "subreddit": "sre",
      "url": "https://www.reddit.com/r/sre/comments/1r9uw96/multi_cloud_was_supposed_to_save_us_from_vendor/",
      "author": "NoBet3129",
      "created_utc": "2026-02-20 13:07:57",
      "score": 35,
      "num_comments": 9,
      "upvote_ratio": 0.95,
      "text": "CTO convinced leadership we needed multi cloud because aws would \"definitely raise prices\" or something. Nobody really thought through what this meant for the team managing it.\nHalf our stuff runs on aws api gateway, half on gcp api gateway and they work completely differently, aws does resource policies, gcp does iam, keeping security consistent across both is genuinely impossible. When something breaks we're checking cloudwatch and cloud monitoring separately trying to figure out which platform is the problem and our devs are pissed because they had to learn two completely different systems that do the exact same thing.\nWe've probably spent more time dealing with this mess than we ever would've spent migrating off aws if we actually needed to. The ironic part is now we're stuck with both platforms instead of one so... mission accomplished I guess?\nDid anyone else do this and actually make it work or did we just completely botch the implementation?",
      "is_original_content": false,
      "link_flair_text": "DISCUSSION",
      "permalink": "https://reddit.com/r/sre/comments/1r9uw96/multi_cloud_was_supposed_to_save_us_from_vendor/",
      "domain": "self.sre",
      "is_self": true,
      "comments": [
        {
          "id": "o6f0cn0",
          "author": "AmazingHand9603",
          "text": "Multi cloud sort of works if you have super strict abstraction layers and your ops team is big enough to handle the extra complexity. Most places, even big ones, end up with duplicated effort and everyone slightly irritated all the time. The theory is nice, but unless you’re at a scale where you can throw a separate team at each provider, it ends up being more pain than it’s worth. We ended up quietly letting one cloud become the main one over time, and honestly nobody cared except leadership, who eventually forgot why we did it in the first place.",
          "score": 30,
          "created_utc": "2026-02-20 13:14:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6f12iq",
          "author": "taleodor",
          "text": "The idea to avoid vendor lock in is to only use things between clouds that are essentially the same (sort of largest common denominator). So yes, your implementation seems botched and you should get back to drawing board.",
          "score": 13,
          "created_utc": "2026-02-20 13:18:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6f2s6c",
          "author": "ufukty",
          "text": "mobility makes more sense than multi cloud to me. having configurations written down as terraform, ansible or bash scripts is enough of documentation to ease future migration",
          "score": 8,
          "created_utc": "2026-02-20 13:28:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6f7v9f",
              "author": "Creative-Dentist-383",
              "text": "Additionaly, use as many “common services” as possibles. Migrating from EC2 to Azure VMs is a lot easier than some very specialized service. ",
              "score": 6,
              "created_utc": "2026-02-20 13:55:45",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6f3f9x",
          "author": "ninjaluvr",
          "text": "Multi-cloud without thought and intention is a disaster as you've witnessed first hand. Multi-cloud with abstraction can be beautiful. But if you don't have the expertise to design, build, and manage it, you should stick with one vendor.",
          "score": 3,
          "created_utc": "2026-02-20 13:31:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6f4gz9",
          "author": "borg286",
          "text": "Would you mind sharing what you mean by the API gateways working differently?",
          "score": 2,
          "created_utc": "2026-02-20 13:37:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6f8v5z",
          "author": "faajzor",
          "text": "Honestly that is an issue of poor planning on the engineering side.\n\nUse common tools (k8s?) or try to abstract some of the services. Centralize logging and monitoring, invest in tooling, etc.",
          "score": 1,
          "created_utc": "2026-02-20 14:01:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6fcq3e",
          "author": "MordecaiOShea",
          "text": "Building to open standards rather than multicloud is the solution you need. It is why we use EKS, not ECS. And managed Kafka, not SQS. And Postgres Aurora, not DynamoDb.",
          "score": 1,
          "created_utc": "2026-02-20 14:21:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6fqe21",
          "author": "amarao_san",
          "text": "Multicloud is hard. I would say, the best way for multicloud is to have baremetal option. If you can rebuild your production with some baremetal servers with some bgp, you are multicloud by definition, because you can run on any infra.\n\nnext, you can cut some clumsy implemented functions into vendor provided, with baremetal fallback. In this case you get best for reasonable price, because unreasonable price just been replaced with baremetal.\n\nBut it's hard, as you need to integrate something as replacement for all fancy services providers gives you, or give up on them entirely.\n",
          "score": 1,
          "created_utc": "2026-02-20 15:29:36",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r73em5",
      "title": "The War Room 5 minutes into a Sev-1",
      "subreddit": "sre",
      "url": "https://www.reddit.com/r/sre/comments/1r73em5/the_war_room_5_minutes_into_a_sev1/",
      "author": "Longjumping_Mess_227",
      "created_utc": "2026-02-17 11:21:30",
      "score": 17,
      "num_comments": 0,
      "upvote_ratio": 0.72,
      "text": "https://preview.redd.it/sc40ibzdh1kg1.png?width=1024&format=png&auto=webp&s=e1c1ae2ead5c31995cfbcead33094455e286c1ca\n\n",
      "is_original_content": false,
      "link_flair_text": "HUMOR",
      "permalink": "https://reddit.com/r/sre/comments/1r73em5/the_war_room_5_minutes_into_a_sev1/",
      "domain": "self.sre",
      "is_self": true,
      "comments": []
    },
    {
      "id": "1r61p6d",
      "title": "Site reliability but for physical systems?",
      "subreddit": "sre",
      "url": "https://www.reddit.com/r/sre/comments/1r61p6d/site_reliability_but_for_physical_systems/",
      "author": "Killdozer1939",
      "created_utc": "2026-02-16 06:02:20",
      "score": 11,
      "num_comments": 8,
      "upvote_ratio": 0.87,
      "text": "I'm looking for books focusing more on physical resources. I know they're principally the same, but there's some specific contexts I'd curious about that are different from sftwre engineering",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/sre/comments/1r61p6d/site_reliability_but_for_physical_systems/",
      "domain": "self.sre",
      "is_self": true,
      "comments": [
        {
          "id": "o5nhiiv",
          "author": "ray_pb",
          "text": "You might want to check out https://a.co/d/05u4hd71 (amazon.com Reliability Engineering by Elsayed).",
          "score": 4,
          "created_utc": "2026-02-16 08:36:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5n8via",
          "author": "corddry",
          "text": "It’s more of a textbook, but this is a reference I’ve used in the past looking for ways to better understand system reliability. There is a fascinating appendix on human repetitive task error rate as well: https://a.co/d/0egItfZ3\n\nMuch of what we do is centered in systems thinking, which applies to physical, biological, and digital. Thinking in Systems provides a great analysis of this: https://a.co/d/03BywzRQ",
          "score": 5,
          "created_utc": "2026-02-16 07:15:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5pby9q",
          "author": "engineered_academic",
          "text": "You need engineering books on risk assessments.",
          "score": 2,
          "created_utc": "2026-02-16 16:08:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5t26b7",
          "author": "kusanagiblade331",
          "text": "It depends what type of physical systems you are talking about. I did my masters in control engineering. Reliability engineering is as old as commercial airplanes became available. I used to do research in a niche field called Fault Tolerant Control Systems. It helps to make sure system can operate in a degraded state even if you have components that are faulty.",
          "score": 2,
          "created_utc": "2026-02-17 03:46:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5nw8j0",
          "author": "agilob",
          "text": "Imagine having an optional role in your construction company for reliability of bridges. \"Normal\" engineers do reliability as part of their jobs. SRE is specific to IT because IT needs to move faster and break things and IT isn't as regulated for safety as other disciplines. If a bug in implementation causes a bridge to collapse, people go to prison. If your system crashes, too bad, you'll fix it in the next sprint.",
          "score": 2,
          "created_utc": "2026-02-16 10:54:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5t31q6",
          "author": "Downtown_Twist_4782",
          "text": "I don't have a good link, but a number of early DevOps influencers like John Allspaw, and maybe Gene Kim have DevOps / SRE related talks reference older (50s / 60s / 70s maybe) reliability engineering studies, and possibly books that I think focused on airplanes, or power plant reliability engineering........can't remember the details specifically, but likely at the O'Reilly SCALE conferences. ",
          "score": 1,
          "created_utc": "2026-02-17 03:52:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o63bfuj",
          "author": "dmbergey",
          "text": "Any of Nancy Leveson's books.  I have not read her latest, [https://mitpress.mit.edu/9780262546881/an-introduction-to-system-safety-engineering/](https://mitpress.mit.edu/9780262546881/an-introduction-to-system-safety-engineering/) Engineering a Safer World: Systems Thinking Applied to Safety was excellent.",
          "score": 1,
          "created_utc": "2026-02-18 17:49:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6dlp5b",
          "author": "Useful-Process9033",
          "text": "Look into FMEA (failure mode and effects analysis) if you haven't already. It's basically the physical systems version of incident post-mortems but done proactively. The aerospace and nuclear industries have been doing this for decades before software SRE was even a concept.",
          "score": 1,
          "created_utc": "2026-02-20 06:06:28",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r8jo96",
      "title": "SRE on a black-box SaaS (Shopify): using synthetic transactions to catch checkout breakages and silent telemetry failures",
      "subreddit": "sre",
      "url": "https://www.reddit.com/r/sre/comments/1r8jo96/sre_on_a_blackbox_saas_shopify_using_synthetic/",
      "author": "Silver-Geologist8926",
      "created_utc": "2026-02-18 23:56:57",
      "score": 9,
      "num_comments": 10,
      "upvote_ratio": 0.77,
      "text": "Hi all,\n\nIn e-commerce platforms like Shopify, we don’t control infra and we don’t get server logs, but reliability problems still show up in the places the business cares about most: add-to-cart / checkout-start and telemetry (ads/analytics events) silently failing after app/theme changes.\n\nWe’ve been treating the storefront as a black-box system and using synthetic transactions (Playwright) as the primary signal:\n\n* execute a real user journey on an interval (home → PDP → ATC → cart → checkout-start)\n* capture evidence: console errors, blocked/failed network calls (401/403), browser security policy blocks that prevent embedding/redirect flows, and perf deltas\n* diff against a baseline so “something changed” is machine-detectable even without server logs\n\nQuestion for folks who’ve had to do SRE on third-party platforms:\n\nDo you treat synthetics as the source of truth for SLOs in no-log environments, or have you found higher-fidelity signals (RUM, edge logs, support APIs, etc.)? Also curious how you define error budgets when the platform owner controls most dependencies.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/sre/comments/1r8jo96/sre_on_a_blackbox_saas_shopify_using_synthetic/",
      "domain": "self.sre",
      "is_self": true,
      "comments": [
        {
          "id": "o65plmr",
          "author": "BlessedSRE",
          "text": "What’s the point of an error budget on a managed service if you can’t do anything to stop burn? Are you just trying to audit their SLA attainment?",
          "score": 15,
          "created_utc": "2026-02-19 00:42:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o662bze",
              "author": "Silver-Geologist8926",
              "text": "Totally fair question. For a managed platform, the error budget isn’t about “fixing Shopify infra” - it’s about controlling what we can burn (theme/app deploys, 3rd-party scripts, headless edge/API deps, telemetry/pixel regressions) and having a trigger for freeze/rollback + vendor escalation when it’s not us. Auditing the provider SLA is a side benefit, but the main value is change management and fast attribution",
              "score": 7,
              "created_utc": "2026-02-19 01:56:29",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o69d76i",
                  "author": "BlessedSRE",
                  "text": "If you're doing app deploys, then orchestrate telemetry in your app so you can distinguish between errors coming from your code vs errors from Shopify APIs",
                  "score": 1,
                  "created_utc": "2026-02-19 15:58:22",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o6dh19p",
              "author": "Useful-Process9033",
              "text": "Error budgets on managed platforms still make sense because most outages on Shopify storefronts are caused by your own theme/app deploys, not Shopify infra. The budget gives you a freeze trigger for your own changes and a paper trail for vendor escalation when it actually is their fault.",
              "score": 1,
              "created_utc": "2026-02-20 05:27:40",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o66lq5n",
          "author": "pharcide",
          "text": "I had the same challenges running SF Commerce Cloud and yes we used synthetics but really should only be used for reachability.   One approach I've seen is have all the component teams own their own health sensors and have the synthetic load that page and execute those tests which should be indicative of the health of services.\n\nCan you clarify, are you running a storefront on Shopify or are YOU Shopify?  that would clarify the approach here",
          "score": 1,
          "created_utc": "2026-02-19 03:51:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o68svax",
              "author": "Silver-Geologist8926",
              "text": "We’re not Shopify - we’re a third-party team operating merchant storefronts on Shopify (sometimes headless, sometimes themes/apps)",
              "score": 1,
              "created_utc": "2026-02-19 14:13:57",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6aire8",
          "author": "lazyant",
          "text": "One of my pet theories is that people use or mention error budgets because that Google SRE book but I have yet to find a good answer for a non-google scale company of  what do you do (really actionable) when you go under / over budget. Variations of “Be more/less careful” don’t make a lot of sense to me.",
          "score": 1,
          "created_utc": "2026-02-19 19:16:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6dh1vt",
              "author": "Useful-Process9033",
              "text": "The actionable part is deploy freezes. When you burn through budget you stop shipping changes until it recovers. At non-Google scale the value is less about the math and more about having an objective trigger that stops the \"just one more deploy\" mentality during fragile periods.",
              "score": 1,
              "created_utc": "2026-02-20 05:27:49",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6byxav",
          "author": "ResponsibleBlock_man",
          "text": "I literally just wrote a post about it just now on sre. Can you please DM. I am doing something similar.",
          "score": 1,
          "created_utc": "2026-02-19 23:41:43",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r6boki",
      "title": "Awesome Performance Engineering - a curated list bridging observability and performance testing",
      "subreddit": "sre",
      "url": "https://www.reddit.com/r/sre/comments/1r6boki/awesome_performance_engineering_a_curated_list/",
      "author": "jramette",
      "created_utc": "2026-02-16 14:53:42",
      "score": 8,
      "num_comments": 2,
      "upvote_ratio": 0.75,
      "text": "I've been maintaining a curated list of tools for performance engineering, and I think it might be useful to this community.\n\nThe angle is specifically about combining observability and performance testing into a coherent practice -- something I've seen too many teams treat as completely separate disciplines.\n\nIt covers \\~100 tools across: metrics & TSDB, distributed tracing, log management, continuous profiling (eBPF-based and others), alerting & incident response, load testing, chaos engineering, CI/CD performance gates, and more.\n\nEvery entry is annotated with opinionated indicators based on production experience -- not feature matrices or vendor claims.\n\nThere's also a section on how AI is changing performance engineering (anomaly detection, automated RCA, intelligent load test design) with a pragmatic take on what actually delivers value today vs. what's still hype.\n\n→ [https://github.com/be-next/awesome-performance-engineering](https://github.com/be-next/awesome-performance-engineering)\n\nFeedback welcome -- especially if you think important tools are missing or if the categorization doesn't match how your team works.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/sre/comments/1r6boki/awesome_performance_engineering_a_curated_list/",
      "domain": "self.sre",
      "is_self": true,
      "comments": [
        {
          "id": "o5tjxdp",
          "author": "slayem26",
          "text": "Could synthetic monitoring be an answer to this?",
          "score": 1,
          "created_utc": "2026-02-17 05:55:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5u4y79",
              "author": "jramette",
              "text": "Good point! And yes, synthetic monitoring is already in the list! But I think the real value isn't in synthetic monitoring by itself. It's in what feeds it.\n\nIn my experience, the workflow that actually works is: performance testing first, synthetics second. Load and stress tests are where you build your understanding of the system: you discover the breaking points, identify which components degrade first, and establish the boundary between \"this works\" and \"this doesn't.\" That knowledge is what makes synthetic monitoring useful: it tells you what to monitor and what thresholds actually matter.\n\nWithout that foundation, synthetic checks tend to be shallow: \"is the homepage responding under 2s?\" is fine, but it misses the real value. When you've done the performance testing work, you know that your checkout flow degrades when the catalog service slows down, and that the first visible symptom is the cart page taking 800ms longer to render. That's what you encode into your synthetics: a Playwright scenario that walks through browse -> add to cart -> checkout every 5 minutes, measuring each step. When that cart step drifts from 1.2s to 2s, you know something is brewing, before any user complains and before your internal metrics even cross an alerting threshold. The synthetic caught the user-facing degradation, not just the infrastructure symptom.\n\nPut differently: setting up synthetics without performance testing is an empirical approach: you pick thresholds based on intuition and hope they're meaningful. Running performance tests first turns it into a proper engineering practice: you observe, measure, understand the system's behavior under stress, and then instrument your production monitoring based on validated knowledge. Synthetics are how you operationalize what you've learned.\n\nSo I'd frame it this way: synthetic monitoring is a great operational tool for sustaining performance awareness in production, but it's not the starting point: it's downstream of a deeper performance engineering practice. The tests build the knowledge, the synthetics keep watch based on that knowledge.\n\nDoes that match how you've been thinking about it, or are you using synthetics differently?",
              "score": 2,
              "created_utc": "2026-02-17 09:05:59",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r3wh8t",
      "title": "pg_stat_ch: a PostgreSQL extension that exports every metric to ClickHouse",
      "subreddit": "sre",
      "url": "https://clickhouse.com/blog/pg_stat_ch-postgres-extension-stats-to-clickhouse",
      "author": "sdairs_ch",
      "created_utc": "2026-02-13 18:09:19",
      "score": 5,
      "num_comments": 0,
      "upvote_ratio": 0.86,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "BLOG",
      "permalink": "https://reddit.com/r/sre/comments/1r3wh8t/pg_stat_ch_a_postgresql_extension_that_exports/",
      "domain": "clickhouse.com",
      "is_self": false,
      "comments": []
    },
    {
      "id": "1r6w5uc",
      "title": "Error handling in bash (some helpful tips & common pitfalls)",
      "subreddit": "sre",
      "url": "https://notifox.com/blog/bash-error-handling",
      "author": "Aerosherm",
      "created_utc": "2026-02-17 04:19:12",
      "score": 5,
      "num_comments": 0,
      "upvote_ratio": 0.69,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/sre/comments/1r6w5uc/error_handling_in_bash_some_helpful_tips_common/",
      "domain": "notifox.com",
      "is_self": false,
      "comments": []
    },
    {
      "id": "1r43jde",
      "title": "Final-year CS student feeling lost, overwhelmed, and unsure about My Future",
      "subreddit": "sre",
      "url": "https://www.reddit.com/r/sre/comments/1r43jde/finalyear_cs_student_feeling_lost_overwhelmed_and/",
      "author": "CursedRooster20",
      "created_utc": "2026-02-13 22:41:35",
      "score": 3,
      "num_comments": 17,
      "upvote_ratio": 0.64,
      "text": "I’m a final-year Computer Science student, and I feel completely lost and mentally exhausted.\n\nI’ve spent a long time studying SRE because I genuinely love the nature of the work, the mindset, and the responsibility that comes with the role. I enjoy the field, and I can actually see myself working in it.\n\nBut lately, every day I see new tools, new technologies, and constant posts saying that junior opportunities in SRE are extremely limited, the field is saturated, and that AI is taking over a lot of tasks, making entry-level roles even harder to get. Some people even suggest switching to a completely different field, even outside of computer science.\n\nI’m honestly burned out from anxiety, overthinking, and constant fear about the future. I feel mentally stuck and paralyzed. I can’t fully commit to anything anymore because I’m always thinking about whether I’m wasting my time or choosing the wrong path.\n\nI’m looking for real, honest advice from people with experience.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/sre/comments/1r43jde/finalyear_cs_student_feeling_lost_overwhelmed_and/",
      "domain": "self.sre",
      "is_self": true,
      "comments": [
        {
          "id": "o58y8nw",
          "author": "hijinks",
          "text": "in this for 25 years.. started as a sys admin and then devops/sre/plat eng\n\ni've heard my job was gonna be gone for 20 years. I run a devops slack and we've gotten a crazy amount of software devs asking how they can pivot into devops/sre\n\naround 2008-2010 my job was gonna be gone because of the cloud. I just got paid more\n\naround 2015ish my job was gonna be gone because of serverless. I continued to be paid even more\n\nNow AI is coming for it\n\nYes all these things took jobs away but focus on being a problem solver and someone that and see projects and add value and you will be fine. It's the seat fillers that will lose their job and not work anymore.",
          "score": 20,
          "created_utc": "2026-02-13 22:53:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o59izr0",
              "author": "Skaar1222",
              "text": "I agree with this, my only advice is it's hard to go straight into SRE or DevOps without experience (even before AI and when the market was better). In my case I started as a software engineer, then transitioned to SRE. If you truly enjoy the work keep grinding!",
              "score": 3,
              "created_utc": "2026-02-14 00:57:05",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o59qo6g",
              "author": "meowrawr",
              "text": "I’ve been doing this a long time too and as a CTO for many years now that has always championed the importance of hiring new grads, AI makes that very difficult especially when CEOs just read the constant flux of news about how AI can do this and that. I’m not even quite sure when we will hire new grads again with the way things are going. \n\nBasically, if I was a CS major in school right now, I’d change majors and do something else. Sad but true.",
              "score": 2,
              "created_utc": "2026-02-14 01:45:50",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o590zqo",
          "author": "UnfashionablyLate-",
          "text": "Go for it. I started as a cloud engineer and worked my way to SRE. You can do it too. Fuck the doomers. Learn how to leverage AI rather than hating it. Study infrastructure, cloud, and so on.",
          "score": 7,
          "created_utc": "2026-02-13 23:09:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o592x4r",
          "author": "nOOberNZ",
          "text": "My 2c is not to get too hung up on getting a perfect role that fits a predetermined career path. Find a role, be awesome at it. There's nothing else in your control. I've been in tech for 18 years and have constant levels of anxiety that I'm still learning to manage. Most of the best things that happened in my career I never predicted and happened by chance and taking opportunities.",
          "score": 3,
          "created_utc": "2026-02-13 23:20:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o59guk3",
          "author": "nullset_2",
          "text": "It's all part of the show. Remain steadfast.",
          "score": 2,
          "created_utc": "2026-02-14 00:43:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o59qlrz",
          "author": "tanzWestyy",
          "text": "Student then straight to SRE seems like skipping a tutorial with a game. Cant you start somewhere lower then work your way up? This ought to lower the burden and get your foot in the door.",
          "score": 2,
          "created_utc": "2026-02-14 01:45:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5a1z4l",
          "author": "sigmoia",
          "text": "SREs are software developers. Focus on that part and then pivot to ops once you have job hopped a few times. ",
          "score": 2,
          "created_utc": "2026-02-14 02:57:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5a7hlc",
          "author": "AdLongjumping7726",
          "text": "I head the SRE competency globally where I work and we are actually worried that new gens are looking to abandon this space in favor of vibe coding and flashy AI dev. Why are we worried? Because the need for SRE’s (not just plain jane sys admins or app support folks) is growing. \n\nPeople who claim that AI is going to take away all CS jobs have no clue what they’re talking about and are most likely not even in the field. If they are, they aren’t even involved with AI and just see it as magic. It really isn’t despite its advancements. Even if it becomes great later with reduced hallucinations, it still does not “understand” things. So like another Redditor advised, focus on solving problems, learning algorithms (there are so many that’s it’s super cool!) and designing them. Let AI or whatever take on the rest, but you should know that anything on a prod system must be reliable. So, there’s always a need to design resilient solutions and also ensure its function.\n\nSRE isn’t really a dead-end job where you get to just be comfortable in your zone. AI related apps have now forced us to create new solutions for problems they bring about… and it’s exciting! I would say think like an Engineer and look for how SRE principles can be applied to AI apps, supporting infrastructure, etc. rather than listening to the doomsayers. Hope to see you soon in the field!\n\nEDIT: learn development too though as it is very difficult to do any kind of true SRE without this. You need to at least know how things work, script solutions (automate), observe and push to prod. Without this, it’s just traditional app support.",
          "score": 2,
          "created_utc": "2026-02-14 03:35:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5awm45",
              "author": "According-Chapter669",
              "text": "I believe that it's better for SREs that new gen people are mostly focusing on AI agentic things.  \nThis will initially create more work and result in higher pay.\n\nwithin 10-12 months we can see this bubble pop when VC investments dry up and these companies do not have much progress to show.",
              "score": 1,
              "created_utc": "2026-02-14 06:54:24",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5cxcyt",
                  "author": "PudsBuds",
                  "text": "Fwiw the investments are already drying up for most companies. Just the massive few are carrying the entire market. \n\n\nOur company is like 30% increasing revenue every year and they can't even find a buyer. We are in an AI focused company as well... I can tell our execs are freaking out ",
                  "score": 1,
                  "created_utc": "2026-02-14 16:12:11",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5cr10n",
          "author": "NefariousnessOk5165",
          "text": "It’s getting hard to explain to ppl what is Sre .. I see lot of these posts .. Sre is not an entry level job trust me! If any org is hiring entry level SRE they themselves don’t know what is SRE ! Sre are foundational builders of an org remember this ! You have to be good in understanding all network and it world how things like services/software are meant to be run in background . SWE can be replicated by AI but SRE cannot be !",
          "score": 2,
          "created_utc": "2026-02-14 15:39:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5cxm97",
              "author": "PudsBuds",
              "text": "Depends what u run though... You can replace a lot of what people do with like AKS or k8s with a more expensive container app offering. Imo the experience is worse, but you _can_ do it with AI that way",
              "score": 1,
              "created_utc": "2026-02-14 16:13:29",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5cz0ua",
                  "author": "NefariousnessOk5165",
                  "text": "Mmmm in my honest opinion yes u can abstract ur k8/aks with managed platform but that doesn’t eliminate SRE it just shifts the responsibility! Someone still has to understand the networking , scaling behaviours , cost impacts , failures modes etc lots of things …. One line I always say when production breaks at 2 am abstraction layers does not debug root cause ! Engineers do ! One day AI would be there too I agree to that , not today though !",
                  "score": 1,
                  "created_utc": "2026-02-14 16:20:33",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o59h5fg",
          "author": "the_packrat",
          "text": "Learn all the tools you can, get siftware crating experience in your own not just with AI tools, be curious about how things work, spend time in the details of systems and how they can fail. These are the interesting corners where the new tools may capture the business-as-usual work in the future.",
          "score": 1,
          "created_utc": "2026-02-14 00:45:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o59x6wc",
          "author": "Dangerous_Today_5654",
          "text": "I've been a sysadmin since 91. I've dabbled in networking, security, Netware, Windows NT, Solaris and more recently Linux (past 15 years). Forget the fancy titles, learn the foundational skills (coding, OS and networking). Contribute to an open source project, build an AI agent, attend meetups/network and volunteer. If you love this stuff like I do, people will notice. The market will come back. Stay strong and stay busy!",
          "score": 1,
          "created_utc": "2026-02-14 02:27:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5cvbil",
          "author": "PudsBuds",
          "text": "I've been doing this for 15 years now and I'm in an AI focused company. I'm scared in general because right now everyone is frothing out the mouth to release new things and dismantling all guard rails and best practices... Idk if it'll course correct or just get worse... \n\n\nFwiw I transitioned to SRE 4 years ago, but now I am also expected to basically vibecode our infrastructure or be laid off. Nobody wants you to do manual PRs, testing, nothing. It's insane right now.\n\n\nI hope the world decides whether or not to go full in on AI so I can have less anxiety about it personally as well. Let it fail or actually start standardizing and creating jobs around it. Right now it's the worst of both worlds. ",
          "score": 1,
          "created_utc": "2026-02-14 16:01:48",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r71v8i",
      "title": "SWIFT monitoring metrics",
      "subreddit": "sre",
      "url": "https://www.reddit.com/r/sre/comments/1r71v8i/swift_monitoring_metrics/",
      "author": "VenjeR84",
      "created_utc": "2026-02-17 09:49:44",
      "score": 3,
      "num_comments": 5,
      "upvote_ratio": 1.0,
      "text": "Hi,we would like to monitor critical events & messages from swift payment portal. Any one has already made a similar dashboard or can give tips on what to actually monitor from a production support standpoint pls?\n\nThx",
      "is_original_content": false,
      "link_flair_text": "HELP",
      "permalink": "https://reddit.com/r/sre/comments/1r71v8i/swift_monitoring_metrics/",
      "domain": "self.sre",
      "is_self": true,
      "comments": [
        {
          "id": "o5ubjfo",
          "author": "AmazingHand9603",
          "text": "A lot depends on your SWIFT setup but generally production support wants to see if there are message rejections, processing delays, and interface errors. We use a mix of built-in SWIFT alerts and external monitoring like CubeAPM to trigger on failures or high latency. Don’t forget backup/restore status too, since you really don’t want backup jobs failing unnoticed. Try to log who is kicking off big jobs or batch payments, sometimes user activity is the thing to watch if things are going sideways.",
          "score": 3,
          "created_utc": "2026-02-17 10:08:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5uiycs",
              "author": "VenjeR84",
              "text": "May I pls know what Swift events you monitor pls? Severe / fatal msgs like which ones ? FIN reject etc\n\nAlso any MT msg types we should monitor?",
              "score": 1,
              "created_utc": "2026-02-17 11:15:07",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o60zuhs",
                  "author": "ut2x39",
                  "text": "Have you guys not shifted to MX msg type ? \nOn the other hand we did look for a bulk failure of messages which indicated whether the client was doing something they were not supposed to or something broke in ghe system",
                  "score": 1,
                  "created_utc": "2026-02-18 09:56:09",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5uby74",
          "author": "glowandgo_",
          "text": "focus on failures + latency, not every single msg...monitor queue depth, processing time, reject rates, retries, auth and gateway connectivity. alert on volume anomalies too...biggest thing is avoiding noise. tie alerts to real business impact or ppl will ignore them.",
          "score": 1,
          "created_utc": "2026-02-17 10:12:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5wpy7i",
          "author": "SudoZenWizz",
          "text": "we are in process of implementing something similar, we will have in the end an aggregation that will show the status of the applications involved.\n\nAll systems (proxy, databases, websphere) will be part of this dashboard.\n\nWe have the plan and working on implementing this in checkmk, as the monitoring solution used by us and our clients.\n\nKeep in mind, that one \"black box\" in terms of internal metrics are the applications used. In our case we cannot obtain specific app metrics directly, and will gather based on apache monitoring, haproxy monitoring , JVM status and requests , TCP connections and database active sessions. All this will be shown in an centralized dashboard for all locations (prod/dr) in checkmk.",
          "score": 1,
          "created_utc": "2026-02-17 18:29:40",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r9jrrk",
      "title": "Does any one deploy AI agents in prod.",
      "subreddit": "sre",
      "url": "https://www.reddit.com/r/sre/comments/1r9jrrk/does_any_one_deploy_ai_agents_in_prod/",
      "author": "masterluke19",
      "created_utc": "2026-02-20 02:56:10",
      "score": 2,
      "num_comments": 8,
      "upvote_ratio": 0.6,
      "text": "With all Agent based discussion I have seen that there is major trust issue with AI Agents in prod. How do you ensure that the agents are secure. TBH I can’t imaging how they adapt in prod unless it’s different tools plugged in together. Multi model makes it more complex. How do you track those.",
      "is_original_content": false,
      "link_flair_text": "DISCUSSION",
      "permalink": "https://reddit.com/r/sre/comments/1r9jrrk/does_any_one_deploy_ai_agents_in_prod/",
      "domain": "self.sre",
      "is_self": true,
      "comments": [
        {
          "id": "o6cw0oi",
          "author": "c0LdFir3",
          "text": "Fuck no, I have self respect.",
          "score": 15,
          "created_utc": "2026-02-20 03:00:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6cw7dm",
              "author": "masterluke19",
              "text": "Legend!",
              "score": 2,
              "created_utc": "2026-02-20 03:02:08",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6d4ggi",
          "author": "slashedback",
          "text": "Are developer’s laptops prod? If so yes tons of dangerous agents are now in prod lmao. IYKYK",
          "score": 8,
          "created_utc": "2026-02-20 03:55:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6dip1n",
              "author": "masterluke19",
              "text": "If it’s serving anything public then yes",
              "score": 1,
              "created_utc": "2026-02-20 05:41:09",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6epbuj",
                  "author": "imdevin567",
                  "text": "I don't think that's what they meant. Developer laptops are usually considered prod-adjacent, because they can reach prod. Developers are almost certainly running agents locally, often with their own personal API keys, and often with little-to-no guardrails. You're probably already \"running agents in prod\" and don't even realize it. It's the wild wild west out there right now.",
                  "score": 1,
                  "created_utc": "2026-02-20 12:01:26",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6dqokd",
          "author": "Federal_Ad7921",
          "text": "The trust concern is valid. Instead of layering more tools, focus on unified zero-trust runtime control. We’ve used AccuKnox’s agentless eBPF approach to monitor what AI agents actually read, write, and call, reducing data leakage risk significantly. It’s not a management fix, but strong runtime visibility is essential.",
          "score": 2,
          "created_utc": "2026-02-20 06:50:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ee9wv",
          "author": "glowandgo_",
          "text": "yeah, in my experience most teams don’t really deploy agents in prod the way marketing hype suggests. usually it’s workflows where the agent is orchestrating fixed tools, not making autonomous decisions.......the hard part is observability and guardrails. you need logging, validation layers, and clear rollback paths. multi-model setups just amplify that complexity, so a lot of prod deployments end up being more like supervised automation than true agents.",
          "score": 1,
          "created_utc": "2026-02-20 10:30:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6f8l73",
              "author": "masterluke19",
              "text": "Finally someone validated what I felt. But do you thing the multi model system will be widely adopted for prod systems. I don’t mean the multi tool or multi workflow integration, actual prod servers.",
              "score": 1,
              "created_utc": "2026-02-20 13:59:34",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    }
  ]
}