{
  "metadata": {
    "last_updated": "2026-02-14 16:49:57",
    "time_filter": "week",
    "subreddit": "sre",
    "total_items": 6,
    "total_comments": 24,
    "file_size_bytes": 24680
  },
  "items": [
    {
      "id": "1r0fa8h",
      "title": "The $70M domain that couldn’t survive a Super Bowl ad",
      "subreddit": "sre",
      "url": "https://extended.reading.sh/ai-dot-com-crashes-on-superbowl",
      "author": "jpcaparas",
      "created_utc": "2026-02-09 20:19:17",
      "score": 31,
      "num_comments": 2,
      "upvote_ratio": 0.84,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/sre/comments/1r0fa8h/the_70m_domain_that_couldnt_survive_a_super_bowl/",
      "domain": "extended.reading.sh",
      "is_self": false,
      "comments": [
        {
          "id": "o4hz6yj",
          "author": "tky",
          "text": "Most effective advertising CloudFlare never paid for.",
          "score": 16,
          "created_utc": "2026-02-09 20:57:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4kn46v",
          "author": "Low_Log2832",
          "text": "Probably nobody told the SRE team, that they were up for some extra traffic",
          "score": 0,
          "created_utc": "2026-02-10 06:31:33",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r3wh8t",
      "title": "pg_stat_ch: a PostgreSQL extension that exports every metric to ClickHouse",
      "subreddit": "sre",
      "url": "https://clickhouse.com/blog/pg_stat_ch-postgres-extension-stats-to-clickhouse",
      "author": "sdairs_ch",
      "created_utc": "2026-02-13 18:09:19",
      "score": 5,
      "num_comments": 0,
      "upvote_ratio": 0.86,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "BLOG",
      "permalink": "https://reddit.com/r/sre/comments/1r3wh8t/pg_stat_ch_a_postgresql_extension_that_exports/",
      "domain": "clickhouse.com",
      "is_self": false,
      "comments": []
    },
    {
      "id": "1r2zm8x",
      "title": "Resolve.ai & Traversal",
      "subreddit": "sre",
      "url": "https://www.reddit.com/r/sre/comments/1r2zm8x/resolveai_traversal/",
      "author": "Far_Dragonfruit_5454",
      "created_utc": "2026-02-12 17:28:44",
      "score": 4,
      "num_comments": 11,
      "upvote_ratio": 0.83,
      "text": "Curious if anyone in has real-world experience with Resolve.ai or Traversal.\n\nBoth seem to be playing in the AI for SRE space, positioning around reducing MTTR, automating investigations, and helping teams move from reactive firefighting to something more autonomous.\n\nA few things I’m trying to understand:\n\nHow differentiated are these platforms actually in practice?\n\nIs this just LLM-wrapped runbooks, or are they meaningfully improving incident response?\n\nHow well do they integrate with existing stacks?\n\nSignal-to-noise ratio, are they actually helpful or do they just create more noise?\n\nFrom the outside, it sounds compelling but with everything, its hard to tell what is marketing/AI hype vs reality",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/sre/comments/1r2zm8x/resolveai_traversal/",
      "domain": "self.sre",
      "is_self": true,
      "comments": [
        {
          "id": "o50kstg",
          "author": "jdizzle4",
          "text": "No first hand experience but a friend works at a company that evaluated resolve and we’ve talked about it a buncu. He said it sucked until they produced a massive amount of company specific domain knowledge and runbooks, and then its still just ok. He wasnt impressed",
          "score": 5,
          "created_utc": "2026-02-12 17:35:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o52o9o7",
          "author": "mumblerit",
          "text": "how much do they pay bro",
          "score": 4,
          "created_utc": "2026-02-12 23:44:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o510xi6",
          "author": "Automatic-Ad2761",
          "text": "We didnt try these two but we are using a different one (Metoro). We are mostly happy with it but it might be because we have a very \"uniform\" stack (everything is on k8s). if your stack is super mixed (AWS managed stuff + VMs + custom infra) its harder for an \"AI SRE\" to be useful as the context is fragmented. after all, all these products are just LLMs accessing some data and reasoning about it.  If you don't have the data, not much it can do. ",
          "score": 2,
          "created_utc": "2026-02-12 18:50:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o557rnq",
              "author": "rakeshr-0777",
              "text": "try holmesgpt, nudgebee etc . both are very effective for k8s",
              "score": 0,
              "created_utc": "2026-02-13 11:03:11",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o512fzz",
          "author": "ray_pb",
          "text": "I saw that Azure introduced so called SRE Agents that apparently can boost root cause analysis, automated incident response, and some other stuff. A colleague of mine told me that they were planning to look into it (about a month ago) so I don’t have any feedback on it, but it sounds in the same space as what you are mentioning.",
          "score": 2,
          "created_utc": "2026-02-12 18:57:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o531zsq",
          "author": "sjoeboo",
          "text": "Tried one in a POC and it sucked. It didn’t have the “glue” context of how say a pod and its metrics relate to its dashboards and alerts and logs etc . Didn’t even get to try to add custom data sources/code bases. \n\nPivoted a build an in house one that hooks int everything and have the business logic built in to know how everything is related, for like 10x less per investigation and in a short amount of time.",
          "score": 2,
          "created_utc": "2026-02-13 01:03:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o554kj0",
          "author": "22PEOPLE",
          "text": "Have heard of a company that has been trialling resolve for close to a year and getting basically no results, while having built their own internal assistant that has custom tools for much better results. And yet the Resolve trial doesn't end. Bit of a weird one.",
          "score": 2,
          "created_utc": "2026-02-13 10:34:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o56c1zc",
          "author": "shared_ptr",
          "text": "I work on a team building a similar product and my honest take is that these tools aren't there yet (ours included, but we're getting good results with specific partners and are close to this generalising for a lot of our accounts!)\n\nI am interested if anyone has found resolve or traversal to be genuinely good though. Haven't heard from a team who have yet, though I assume there must be some.",
          "score": 2,
          "created_utc": "2026-02-13 15:12:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5435wt",
          "author": "TeleMeTreeFiddy",
          "text": "Seems very difficult to “one shot” an issue just using MCP. Solutions like Edge Delta or Datadog BitsAI have much higher potential for obvious reasons.",
          "score": 4,
          "created_utc": "2026-02-13 05:03:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o54y019",
          "author": "Mountain_Skill5738",
          "text": "our services partner (they handle part of our sre work) introduced nudgebee to us. we’re mainly using it for the workflow builder.\n\nwe built a simple workflow we’re testing:\n\nhigh error rate alert in pagerduty --> pulls last 20–30 mins logs --> checks crashloopbackoff / oomkilled --> looks at cpu/mem spikes --> compares current vs previous deploy --.> grabs last merged pr --> posts a structured summary in slack.\n\nno auto-remediation. still testing and staying skeptical tbh. but building our own workflow feels more practical..",
          "score": 0,
          "created_utc": "2026-02-13 09:33:15",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r1pbim",
      "title": "Visual simulation of routing based on continuous health signals instead of hard thresholds",
      "subreddit": "sre",
      "url": "https://www.reddit.com/r/sre/comments/1r1pbim/visual_simulation_of_routing_based_on_continuous/",
      "author": "ScientistExpert6202",
      "created_utc": "2026-02-11 05:56:10",
      "score": 3,
      "num_comments": 1,
      "upvote_ratio": 1.0,
      "text": "I built a small interactive simulation to explore routing decisions based on continuous signals instead of binary thresholds.\n\nThe simulation biases traffic continuously using health, load, and capacity signals.\n\nThe goal was to see how routing behaves during:\n\n\\- gradual performance degradation\n\n\\- latency brownouts with low error rates\n\n\\- recovery after stress\n\nThis is not production software. It’s a simulated system meant to make the dynamics visible.\n\nLive demo (simulated): [https://gradiente-mocha.vercel.app/](https://gradiente-mocha.vercel.app/)\n\nI’m mainly looking for feedback on whether this matches real-world failure patterns or feels misleading in any way.",
      "is_original_content": false,
      "link_flair_text": "DISCUSSION",
      "permalink": "https://reddit.com/r/sre/comments/1r1pbim/visual_simulation_of_routing_based_on_continuous/",
      "domain": "self.sre",
      "is_self": true,
      "comments": [
        {
          "id": "o4z7s3c",
          "author": "penguinzb1",
          "text": "this is exactly the kind of thing we've been running scenarios through veris for. being able to visualize how traffic shifts during brownouts instead of just binary health checks makes a huge difference. the continuous signal approach handles those \"degraded but not dead\" states way better than hard cutoffs",
          "score": 1,
          "created_utc": "2026-02-12 13:33:21",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r43jde",
      "title": "Final-year CS student feeling lost, overwhelmed, and unsure about My Future",
      "subreddit": "sre",
      "url": "https://www.reddit.com/r/sre/comments/1r43jde/finalyear_cs_student_feeling_lost_overwhelmed_and/",
      "author": "CursedRooster20",
      "created_utc": "2026-02-13 22:41:35",
      "score": 3,
      "num_comments": 17,
      "upvote_ratio": 0.64,
      "text": "I’m a final-year Computer Science student, and I feel completely lost and mentally exhausted.\n\nI’ve spent a long time studying SRE because I genuinely love the nature of the work, the mindset, and the responsibility that comes with the role. I enjoy the field, and I can actually see myself working in it.\n\nBut lately, every day I see new tools, new technologies, and constant posts saying that junior opportunities in SRE are extremely limited, the field is saturated, and that AI is taking over a lot of tasks, making entry-level roles even harder to get. Some people even suggest switching to a completely different field, even outside of computer science.\n\nI’m honestly burned out from anxiety, overthinking, and constant fear about the future. I feel mentally stuck and paralyzed. I can’t fully commit to anything anymore because I’m always thinking about whether I’m wasting my time or choosing the wrong path.\n\nI’m looking for real, honest advice from people with experience.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/sre/comments/1r43jde/finalyear_cs_student_feeling_lost_overwhelmed_and/",
      "domain": "self.sre",
      "is_self": true,
      "comments": [
        {
          "id": "o58y8nw",
          "author": "hijinks",
          "text": "in this for 25 years.. started as a sys admin and then devops/sre/plat eng\n\ni've heard my job was gonna be gone for 20 years. I run a devops slack and we've gotten a crazy amount of software devs asking how they can pivot into devops/sre\n\naround 2008-2010 my job was gonna be gone because of the cloud. I just got paid more\n\naround 2015ish my job was gonna be gone because of serverless. I continued to be paid even more\n\nNow AI is coming for it\n\nYes all these things took jobs away but focus on being a problem solver and someone that and see projects and add value and you will be fine. It's the seat fillers that will lose their job and not work anymore.",
          "score": 20,
          "created_utc": "2026-02-13 22:53:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o59izr0",
              "author": "Skaar1222",
              "text": "I agree with this, my only advice is it's hard to go straight into SRE or DevOps without experience (even before AI and when the market was better). In my case I started as a software engineer, then transitioned to SRE. If you truly enjoy the work keep grinding!",
              "score": 3,
              "created_utc": "2026-02-14 00:57:05",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o59qo6g",
              "author": "meowrawr",
              "text": "I’ve been doing this a long time too and as a CTO for many years now that has always championed the importance of hiring new grads, AI makes that very difficult especially when CEOs just read the constant flux of news about how AI can do this and that. I’m not even quite sure when we will hire new grads again with the way things are going. \n\nBasically, if I was a CS major in school right now, I’d change majors and do something else. Sad but true.",
              "score": 2,
              "created_utc": "2026-02-14 01:45:50",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o590zqo",
          "author": "UnfashionablyLate-",
          "text": "Go for it. I started as a cloud engineer and worked my way to SRE. You can do it too. Fuck the doomers. Learn how to leverage AI rather than hating it. Study infrastructure, cloud, and so on.",
          "score": 7,
          "created_utc": "2026-02-13 23:09:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o592x4r",
          "author": "nOOberNZ",
          "text": "My 2c is not to get too hung up on getting a perfect role that fits a predetermined career path. Find a role, be awesome at it. There's nothing else in your control. I've been in tech for 18 years and have constant levels of anxiety that I'm still learning to manage. Most of the best things that happened in my career I never predicted and happened by chance and taking opportunities.",
          "score": 3,
          "created_utc": "2026-02-13 23:20:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o59guk3",
          "author": "nullset_2",
          "text": "It's all part of the show. Remain steadfast.",
          "score": 2,
          "created_utc": "2026-02-14 00:43:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o59qlrz",
          "author": "tanzWestyy",
          "text": "Student then straight to SRE seems like skipping a tutorial with a game. Cant you start somewhere lower then work your way up? This ought to lower the burden and get your foot in the door.",
          "score": 2,
          "created_utc": "2026-02-14 01:45:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5a1z4l",
          "author": "sigmoia",
          "text": "SREs are software developers. Focus on that part and then pivot to ops once you have job hopped a few times. ",
          "score": 2,
          "created_utc": "2026-02-14 02:57:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5a7hlc",
          "author": "AdLongjumping7726",
          "text": "I head the SRE competency globally where I work and we are actually worried that new gens are looking to abandon this space in favor of vibe coding and flashy AI dev. Why are we worried? Because the need for SRE’s (not just plain jane sys admins or app support folks) is growing. \n\nPeople who claim that AI is going to take away all CS jobs have no clue what they’re talking about and are most likely not even in the field. If they are, they aren’t even involved with AI and just see it as magic. It really isn’t despite its advancements. Even if it becomes great later with reduced hallucinations, it still does not “understand” things. So like another Redditor advised, focus on solving problems, learning algorithms (there are so many that’s it’s super cool!) and designing them. Let AI or whatever take on the rest, but you should know that anything on a prod system must be reliable. So, there’s always a need to design resilient solutions and also ensure its function.\n\nSRE isn’t really a dead-end job where you get to just be comfortable in your zone. AI related apps have now forced us to create new solutions for problems they bring about… and it’s exciting! I would say think like an Engineer and look for how SRE principles can be applied to AI apps, supporting infrastructure, etc. rather than listening to the doomsayers. Hope to see you soon in the field!\n\nEDIT: learn development too though as it is very difficult to do any kind of true SRE without this. You need to at least know how things work, script solutions (automate), observe and push to prod. Without this, it’s just traditional app support.",
          "score": 2,
          "created_utc": "2026-02-14 03:35:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5awm45",
              "author": "According-Chapter669",
              "text": "I believe that it's better for SREs that new gen people are mostly focusing on AI agentic things.  \nThis will initially create more work and result in higher pay.\n\nwithin 10-12 months we can see this bubble pop when VC investments dry up and these companies do not have much progress to show.",
              "score": 1,
              "created_utc": "2026-02-14 06:54:24",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5cxcyt",
                  "author": "PudsBuds",
                  "text": "Fwiw the investments are already drying up for most companies. Just the massive few are carrying the entire market. \n\n\nOur company is like 30% increasing revenue every year and they can't even find a buyer. We are in an AI focused company as well... I can tell our execs are freaking out ",
                  "score": 1,
                  "created_utc": "2026-02-14 16:12:11",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5cr10n",
          "author": "NefariousnessOk5165",
          "text": "It’s getting hard to explain to ppl what is Sre .. I see lot of these posts .. Sre is not an entry level job trust me! If any org is hiring entry level SRE they themselves don’t know what is SRE ! Sre are foundational builders of an org remember this ! You have to be good in understanding all network and it world how things like services/software are meant to be run in background . SWE can be replicated by AI but SRE cannot be !",
          "score": 2,
          "created_utc": "2026-02-14 15:39:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5cxm97",
              "author": "PudsBuds",
              "text": "Depends what u run though... You can replace a lot of what people do with like AKS or k8s with a more expensive container app offering. Imo the experience is worse, but you _can_ do it with AI that way",
              "score": 1,
              "created_utc": "2026-02-14 16:13:29",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5cz0ua",
                  "author": "NefariousnessOk5165",
                  "text": "Mmmm in my honest opinion yes u can abstract ur k8/aks with managed platform but that doesn’t eliminate SRE it just shifts the responsibility! Someone still has to understand the networking , scaling behaviours , cost impacts , failures modes etc lots of things …. One line I always say when production breaks at 2 am abstraction layers does not debug root cause ! Engineers do ! One day AI would be there too I agree to that , not today though !",
                  "score": 1,
                  "created_utc": "2026-02-14 16:20:33",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o59h5fg",
          "author": "the_packrat",
          "text": "Learn all the tools you can, get siftware crating experience in your own not just with AI tools, be curious about how things work, spend time in the details of systems and how they can fail. These are the interesting corners where the new tools may capture the business-as-usual work in the future.",
          "score": 1,
          "created_utc": "2026-02-14 00:45:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o59x6wc",
          "author": "Dangerous_Today_5654",
          "text": "I've been a sysadmin since 91. I've dabbled in networking, security, Netware, Windows NT, Solaris and more recently Linux (past 15 years). Forget the fancy titles, learn the foundational skills (coding, OS and networking). Contribute to an open source project, build an AI agent, attend meetups/network and volunteer. If you love this stuff like I do, people will notice. The market will come back. Stay strong and stay busy!",
          "score": 1,
          "created_utc": "2026-02-14 02:27:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5cvbil",
          "author": "PudsBuds",
          "text": "I've been doing this for 15 years now and I'm in an AI focused company. I'm scared in general because right now everyone is frothing out the mouth to release new things and dismantling all guard rails and best practices... Idk if it'll course correct or just get worse... \n\n\nFwiw I transitioned to SRE 4 years ago, but now I am also expected to basically vibecode our infrastructure or be laid off. Nobody wants you to do manual PRs, testing, nothing. It's insane right now.\n\n\nI hope the world decides whether or not to go full in on AI so I can have less anxiety about it personally as well. Let it fail or actually start standardizing and creating jobs around it. Right now it's the worst of both worlds. ",
          "score": 1,
          "created_utc": "2026-02-14 16:01:48",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r08g9f",
      "title": "How to Reduce Telemetry Volume by 40% Smartly",
      "subreddit": "sre",
      "url": "https://newsletter.signoz.io/p/is-your-opentelemetry-auto-instrumented",
      "author": "elizObserves",
      "created_utc": "2026-02-09 16:16:07",
      "score": 2,
      "num_comments": 1,
      "upvote_ratio": 0.55,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/sre/comments/1r08g9f/how_to_reduce_telemetry_volume_by_40_smartly/",
      "domain": "newsletter.signoz.io",
      "is_self": false,
      "comments": [
        {
          "id": "o4m9lo8",
          "author": "mumblerit",
          "text": "what a joke",
          "score": 1,
          "created_utc": "2026-02-10 14:19:28",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}