{
  "metadata": {
    "last_updated": "2026-01-23 08:49:57",
    "time_filter": "week",
    "subreddit": "Startup_Ideas",
    "total_items": 20,
    "total_comments": 176,
    "file_size_bytes": 176766
  },
  "items": [
    {
      "id": "1qh0m24",
      "title": "This hack is now of the most powerful I know to get unlimited leads",
      "subreddit": "Startup_Ideas",
      "url": "https://www.reddit.com/r/Startup_Ideas/comments/1qh0m24/this_hack_is_now_of_the_most_powerful_i_know_to/",
      "author": "Ecstatic-Tough6503",
      "created_utc": "2026-01-19 10:25:00",
      "score": 99,
      "num_comments": 7,
      "upvote_ratio": 0.84,
      "text": "Here’s a simple and effective method to extract followers from any LinkedIn company page and turn them into leads\n\nI tested it yesterday and pulled over 75,000 profiles, results were solid.\n\nHere’s how it works :\n\nStep 1: Create a new LinkedIn account  \nStep 2: Start a free trial of Sales Navigator  \nStep 3: Add a job title on your profile like “Intern” at the company you want to target  \nStep 4: In Sales Navigator, use the filter “People following my company”, this becomes available since LinkedIn thinks you’re part of that company  \nStep 5: Export the list, enrich the data (email, role, etc), and use it in your outreach  \nStep 6: Remove the intern job, pick another company, repeat the process\n\nSuper useful to build targeted lists from pages that already gather your ideal audience\n\nCheers !\n\nBonus : Use [this free trial](https://gojiberry.ai) to get even more high intent leads :) ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Startup_Ideas/comments/1qh0m24/this_hack_is_now_of_the_most_powerful_i_know_to/",
      "domain": "self.Startup_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o10740a",
          "author": "Diligent-Pepper5166",
          "text": "Same post everyone other day",
          "score": 1,
          "created_utc": "2026-01-22 06:49:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0h9dpk",
          "author": "LifeTelevision1146",
          "text": "You work for Goji? If yes DM me.",
          "score": 0,
          "created_utc": "2026-01-19 14:18:25",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qfl8t3",
      "title": "I studied 47 SaaS products that went from 0 to 10k MRR last year. Here's what they all did right.",
      "subreddit": "Startup_Ideas",
      "url": "https://www.reddit.com/r/Startup_Ideas/comments/1qfl8t3/i_studied_47_saas_products_that_went_from_0_to/",
      "author": "whyismail",
      "created_utc": "2026-01-17 18:44:08",
      "score": 47,
      "num_comments": 11,
      "upvote_ratio": 0.86,
      "text": "Hey, I went into SaaS last year with my tool [Brandled ](https://brandled.app/)(helps founders grow on X & LinkedIn) in a pretty competitive space with $0 and 0 audience and ended up wasting six months straight on the wrong things.\n\nSpent half a year stuck at $0 MRR.\n\nThen I became obsessed with one question: what separates SaaS products that make it from those that die at zero.\n\nSo I went down a rabbit hole. Studied 47 founders who went from $0 to $10k+ MRR in the last year. Watched their podcasts, red their tweets, and everything i could get my hands on.\n\nHere's what I learned from all of them, and what I was doing catastrophically wrong.\n\n**1. Frictionless signup isn't optional**\n\nEvery successful product had one-click social login. Google OAuth mostly.\n\nThe ones that died had email verification flows, password requirements, multi-step forms asking questions before showing any value.\n\nThe math is brutal. If you lose 30% of people at signup and you're getting 1000 visitors a month, that's 300 potential customers gone. At a 10% trial-to-paid conversion, that's 30 paying customers per month lost to signup friction alone.\n\nI started with magic link only. Completion rate was 45%. Added Google login. Jumped to 78% the next day.\n\nEvery percentage point of friction at signup costs you real revenue. Most founders don't even measure this.\n\n**2. They launched in weeks, not months**\n\nNone of them spent 6 months building in secret.\n\nAverage time from idea to first paying customer: 3-6 weeks. They launched with ONE core feature. Then spent most of their time marketing it.\n\nI did the opposite. Spent 3 months building features before launching. Content generation, analytics, scheduling, competitor tracking, everything. Got 12 signups. Zero paying customers.\n\nConvinced myself the product wasn't good enough. Spent another month adding features. Still nothing.\n\nThe problem wasn't my product. Nobody knew it existed.\n\nAfter I stopped building and started marketing, posting on Reddit, doing LinkedIn outreach, documenting on X, I hit $126 MRR in 4 days.\n\nSame product. Different approach.\n\nPost-launch is 90% marketing, 10% product.\n\n**3. They were shameless about promotion**\n\nThe successful ones talked about their product everywhere. Not spammy. Just never hiding it.\n\nReddit threads. Twitter replies. Forum comments. Anywhere their audience hung out.\n\nThey'd give genuinely helpful advice first, then naturally mention their tool when relevant.\n\nStarted being shameless. Every relevant conversation where someone complained about the problem I solved, I'd help them first, then mention I built something for this.\n\nA few people definitely get mad but I feel the upside is worth it.\n\nYour product won't discover itself.\n\n**4. They asked churned users what went wrong**\n\nEvery successful product had a system for this. Automated email going out when someone cancels asking what didn't work.\n\nI was doing none of this. Saw cancellations in Stripe, felt rejected, moved on. Never asked why. Never learned anything.\n\nNow every cancelled user gets emails through and automated email sequence and the replies are done by me personally.\n\nResponse rate is 40%. The feedback is literally gold.\n\nEvery single one is fixable. But I only learned because I asked.\n\nChurned users tell you the real truth about your product.\n\n**5. They used their own product religiously**\n\nNot one successful founder was building something they didn't use daily. They were their own heaviest users.\n\nI wasn't doing this. Used my tool occasionally to \"test\" but wasn't relying on it daily.\n\nForced myself to create all my content through my own product for a week. Found 7 bugs in 30 minutes that never showed up in testing.\n\nGenerate button didn't work on mobile. Analytics took 8 seconds to load. Onboarding skipped steps if you refreshed.\n\nMy users were experiencing this and not telling me. They were just leaving.\n\nIf you're not using your product daily as a real user, you're building blind.\n\n**6. They fixed retention before scaling acquisition**\n\nBiggest strategic difference.\n\nFailed products: 30-50% monthly churn, constantly chasing new users to replace ones leaving.\n\nSuccessful products: Fixed retention first, got churn to 10-20%, then scaled acquisition.\n\nThe math: At 40% churn, you acquire 40 customers to net 24. At 15% churn, you acquire 40 and net 34. Same effort, 42% better results.\n\nI was obsessed with new signups. Ignored my 40% churn rate. Got 10 new customers, lost 4. Net: 6.\n\nStopped all acquisition. Fixed onboarding from 8 steps to 3. Added email sequences. Built features retained users asked for. Churn dropped to 15%.\n\nSame acquisition effort, now net 8-9 customers instead of 6.\n\nRetention is the foundation. Acquisition is the multiplier.\n\n**7. They shipped MVPs with one feature**\n\nEvery successful product launched stupidly lean. One core feature done exceptionally well.\n\nI launched with 7 features: content generation, analytics, scheduling, competitor tracking, SWOT, comments, hashtags.\n\nCodebase was a nightmare. Users were confused. I was maintaining features 3% of users touched.\n\nShould've launched with one thing: AI content that sounds human. Made that 10x better. Everything else later based on what paying customers asked for.\n\nYour MVP should make people say \"this solves my exact problem\" even if ugly and missing features.\n\nNot \"wow, so many features\" while solving nothing particularly well.\n\n**8. They priced based on value, not competition**\n\nNone of them raced to the bottom on pricing.\n\nThey looked at the value delivered. Hours saved. Revenue generated. Pain eliminated.\n\nThen priced a fraction of that value.\n\nI priced at $19/month because competitors were at $29-39. Thought I'd win on price. Just looked cheap and inferior.\n\nNeeded 263 customers to hit $5k MRR at $19 versus only 128 at $39.\n\nRaised price to $29-39. Conversions didn't drop. They improved slightly.\n\nHigher price signaled solving a valuable problem.\n\nPeople who care about $10 differences aren't your best customers. They'll churn for anything $3 cheaper.\n\n**9. They automated relationship building**\n\nEvery successful product had email sequences from day one. Not promotional. Actual value and engagement.\n\nWelcome emails. Feature education. Check-ins. Re-engagement for quiet users. Win-back for churned users.\n\nI was sending nothing after signup. Users signed up, got busy, forgot, churned.\n\nEngagement doesn't happen by accident. You engineer it.\n\n**10. They validated with money, not words**\n\nThe problem with feedback: it's free. People say nice things because it costs them nothing.\n\nI built features based on \"that would be helpful\" comments from users who weren't even paying. Wasted weeks on features nobody used.\n\nNow I only build what paying customers explicitly request.\n\nMoney is the only validation that matters. Words are cheap. Credit card numbers are truth.\n\n**The one thing they all had**\n\nThey didn't quit when it felt hopeless.\n\nThey all hit $0 for months. Got depressed. Questioned everything. Wanted to shut it down.\n\nBut didn't.\n\nThe difference between $0 and success wasn't talent or luck. It was not quitting before they figured out what works.\n\n90% of SaaS products die not because they couldn't work. Because the founder quit too early.\n\nIf you're stuck at $0, study the people who've made it. Not the outliers. The normal founders who went from $0 to $10k.\n\nThey're not special. They just did specific things that compound and didn't quit when it got hard.\n\nThe playbook is right there. You just have to execute it.\n\nHappy to answer questions or go deeper on any of this.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Startup_Ideas/comments/1qfl8t3/i_studied_47_saas_products_that_went_from_0_to/",
      "domain": "self.Startup_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o06467k",
          "author": "macromind",
          "text": "The \"shameless about promotion\" part is real, but the key is exactly what you said, be helpful first, then mention what you built only when its a clean fit.\n\nOne thing I would add: having 2-3 repeatable distribution channels you can do every week (ex: partner integrations, SEO topic clusters, or one community where you consistently show up) beats random one-off posts.\n\nFor anyone looking for more SaaS marketing tactics like this, https://www.reddit.com/r/Promarkia/ is worth a browse.",
          "score": 2,
          "created_utc": "2026-01-17 20:42:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o09c4vp",
          "author": "kubrador",
          "text": "47 = claude wrote this",
          "score": 1,
          "created_utc": "2026-01-18 08:18:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0fgnym",
          "author": "hector7333",
          "text": "Can you drop some details on how you did marketing? What platforms you used and approx cost?",
          "score": 1,
          "created_utc": "2026-01-19 05:38:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o05gubn",
          "author": "macromind",
          "text": "Really good writeup. The \"launched in weeks, not months\" point is the one I keep re-learning, shipping fast forces you to market fast.\n\nCurious, when you say you got traction from Reddit + LinkedIn outreach, what was the first offer that actually got replies (free trial, demo, audit, etc.)?\n\nAlso, if youre collecting more notes on SaaS marketing execution and what actually moves MRR, https://www.reddit.com/r/Promarkia/ might be a useful place to cross-post ideas.",
          "score": 0,
          "created_utc": "2026-01-17 18:48:22",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qi438v",
      "title": "I'm investing $100K in idea-stage startups. Pitch your idea & let's self promote.",
      "subreddit": "Startup_Ideas",
      "url": "https://www.reddit.com/r/Startup_Ideas/comments/1qi438v/im_investing_100k_in_ideastage_startups_pitch/",
      "author": "kcfounders",
      "created_utc": "2026-01-20 15:28:26",
      "score": 36,
      "num_comments": 98,
      "upvote_ratio": 0.79,
      "text": "I work at [Forum Ventures](https://www.forumvc.com), a pre seed VC fund and accelerator run by former founders. We write $100K VC cheques to idea stage startups with no revenue. Our focus is portfolio support, where we introduce our founders to Fortune 500 customers.\n\nWhat's your startup idea? What's your founder story and background? We're looking to invest in dozens of founders this year at early traction. What we care about is your story, your background, and your vision, so don't hesitate to share those!\n\nWe’ll make this a thread of partnership and mutual support. Drop a link to whatever you're building and use this thread as a distribution channel for yourself.\n\nAs a founder first accelerator, our team at Forum is happy to chat (DM me) if you’re building something early-stage.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Startup_Ideas/comments/1qi438v/im_investing_100k_in_ideastage_startups_pitch/",
      "domain": "self.Startup_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o0pgoqa",
          "author": "robots-in-disguise",
          "text": "This is obviously just someone farming business ideas. Chances of getting funding opportunities are 0.0%",
          "score": 27,
          "created_utc": "2026-01-20 18:06:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o10xqjn",
              "author": "pursuithappy",
              "text": "There always this kind of comment everywhere",
              "score": 2,
              "created_utc": "2026-01-22 10:52:35",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o0teght",
              "author": "kcfounders",
              "text": "Sorry you feel this way. I can assure you with over 400 portfolio companies we don’t need to farm business ideas from a Reddit thread meant to help founders promote their own startup!",
              "score": 1,
              "created_utc": "2026-01-21 07:15:35",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o0s11tt",
              "author": "fazkan",
              "text": "yes, and forum ventures has a bad rep.",
              "score": 0,
              "created_utc": "2026-01-21 01:42:30",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0pqhe8",
          "author": "Silly_Illustrator_56",
          "text": "A central Plattform on which \"special\" merch of various influencers will be sold, like fart in a glas.",
          "score": 3,
          "created_utc": "2026-01-20 18:50:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0q4krj",
          "author": "overeasyeggplant",
          "text": "Name one company you invested in that you found on reddit?",
          "score": 5,
          "created_utc": "2026-01-20 19:54:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0srxgu",
              "author": "Skiereeper",
              "text": "And also share the details of those founders for feedback ! Then Let’s talk !",
              "score": 0,
              "created_utc": "2026-01-21 04:22:03",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0teseh",
                  "author": "kcfounders",
                  "text": "You can check our track record with our founders on LinkedIn! We expect, welcome, and recommend top founders to chat with our portfolio founders to get a sense of what it’s like to work with us.",
                  "score": 0,
                  "created_utc": "2026-01-21 07:18:32",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            },
            {
              "id": "o0tey2f",
              "author": "kcfounders",
              "text": "Check out LinkedIn and our portfolio. We have over 400+ portfolio companies that come through LinkedIn, Reddit/Search, and referrals or organic inbound from our portfolio.",
              "score": 0,
              "created_utc": "2026-01-21 07:19:58",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0p09hk",
          "author": "TopRete",
          "text": "\nI’m building BuzzMeet — a location-based app that converts online matches into real-life meetups and monetizes offline decision moments for local businesses (bars, cafes, venues).\n\nThe MVP is fully built: user profiles, geo search, matches, group meetups, and consent-based chat.\nMonetization is B2B subscription-based, not ads.\n\nI’m a solo founder with a full-stack background, currently preparing for mobile release and early traction.\n\nHappy to share more if this aligns with what you’re looking for.",
          "score": 3,
          "created_utc": "2026-01-20 16:50:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0p9he6",
          "author": "Horror-Platform1767",
          "text": "I have built the Chat Memory Manager a privacy-first desktop app that enhances ChatGPT with long-term memory, chat timelines, conversation branching (like Git), auto summaries, tags, and full-text search. Runs completely locally. No cloud. No accounts. Built for developers, founders, researchers, writers, and serious AI users.",
          "score": 3,
          "created_utc": "2026-01-20 17:33:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0th2iz",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 3,
          "created_utc": "2026-01-21 07:39:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0wzfcb",
              "author": "Donerci-Beau",
              "text": "First thing I notice, the webpage feels 'slowwww'. Made me not want to stick around or look around.",
              "score": 1,
              "created_utc": "2026-01-21 19:58:25",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o10awi0",
                  "author": "asupertram",
                  "text": "Will look into that - could be a mobile issue though",
                  "score": 1,
                  "created_utc": "2026-01-22 07:22:21",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0q50ip",
          "author": "overeasyeggplant",
          "text": "AI something something - $100K please!",
          "score": 4,
          "created_utc": "2026-01-20 19:56:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0rwe1x",
              "author": "DeepCitation",
              "text": "-$100K for you, coming right up",
              "score": 4,
              "created_utc": "2026-01-21 01:15:48",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0rxocn",
                  "author": "overeasyeggplant",
                  "text": "Doh! I really wanted that money to support my AI something something startup.",
                  "score": 3,
                  "created_utc": "2026-01-21 01:23:07",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0ot3f9",
          "author": "JamesTheResumeGuy",
          "text": "We're building an AI-Enabled Marketing Compliance Platform for the MENA region.\n\nMarketers and legal teams spend way too much time going over whether the next social media post treads over local norms and regulations. The GCC doesn't explicitly outline that you can't show skin on your clothing brand's ad, but where is the line drawn?\n\nUsually, you'd hand this over to legal. But with the amount of posts companies have been pumping out, this can take several days till it gets processed. We're changing that.\n\nMost automated compliance platforms completely neglect the huge marketing industry in the GCC. They also completely disregard SMEs and purely offer entreprise packages.\n\nWe're building the platform that tells you whether or not your post is compliant in seconds. It will highlight offending elements, and suggested replacements that stay true to your ad's message. And while everyone's focused on huge marketing agencies and firms, we want to give the small guys the peace of mind when they post their next Black Friday special.\n\nI'm a Technical Product Manager at a recently funded Series A Startup in the middle east that's making accounting and tax compliance easy for SMEs. I know how complicated compliance can get in the GCC, and it will only get more convoluted in the coming years. Businesses suffer from adhering to regulations and bureaucratic processes when they could be focused on building great products.",
          "score": 2,
          "created_utc": "2026-01-20 16:17:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0q0c30",
          "author": "Fuzzy_Channel4391",
          "text": "Hi! I’m building JarVisa — an AI-powered visa assistant for travelers with high-rejection passports (starting with the Philippines).\n\nProblem: applying for visas is confusing, expensive, and anxiety-inducing. People rely on shady agents or spend weeks guessing what to write.\nSolution: JarVisa helps users generate visa-ready documents (cover letters, itineraries, onward tickets), understand requirements, and practice interviews (e.g. US visa mock interview with AI consular personas).\n\nTraction so far:\n\t•\t1,200+ visa checks\n\t•\t500+ waitlist signups\n\t•\t300+ visa documents generated\n\t•\tUsers from PH, India, Nigeria, LATAM\n\t•\tGrowing mostly via word of mouth and communities\n\nBackground: I’m a Filipino product designer/engineer working at a YC-backed startup, building JarVisa solo because I’ve seen friends and family repeatedly rejected due to lack of guidance. Long-term vision is to become the default infrastructure for global mobility for people with “weak” passports.\n\nProduct: https://jarvisa.com\nHappy to DM and share more detail",
          "score": 2,
          "created_utc": "2026-01-20 19:35:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0u6vv9",
              "author": "smoke4sanity",
              "text": "Nice idea. This is a massive world wide pain point. Good luck, Im following!",
              "score": 2,
              "created_utc": "2026-01-21 11:36:44",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0x2uqq",
          "author": "Wild-Register-8213",
          "text": "I'm a full stack dev w/ over 20 years of pro experience, tons of biz dev, solutions architect & sales engineering experience and after finishing my last long term contract (financial services platform to replace the one i built a decade before in order to modernize and launch new services, etc..) I decided to bet on myself a bit more.\n\nI'm building an intelligent and contextually aware distributed/federated composable enterprise capability runtime server/platform, ecosystem and marketplace for capabilities. Ontop of the runtime i'm building a handful of premium positioned products for industries with complicated regulatory or compliance requirements, auditability requirements and/or that can benefit from self-healing, self optimizing, self evolving systems that relentlessly work towards your objective on their own using their ability to form hypothesis from BI data, create new capabilities, split test, analyze results and ultimately hot swap in the best option.\n\nFeel free to DM if there's any interest in helping fund it/partnering, evaluating possible synergy/strategic partnerships, etc..",
          "score": 2,
          "created_utc": "2026-01-21 20:14:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o11j2um",
              "author": "sync_co",
              "text": "I just read a bunch of jargon and still don't know what you do. You really need to refine your pitch.",
              "score": 1,
              "created_utc": "2026-01-22 13:23:39",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o141hp5",
                  "author": "Wild-Register-8213",
                  "text": "not really jargon and not really meant to be a pitch",
                  "score": 1,
                  "created_utc": "2026-01-22 20:25:53",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o147f0c",
              "author": "Sketaverse",
              "text": "Haha nice trolling",
              "score": 1,
              "created_utc": "2026-01-22 20:53:45",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0pl0qc",
          "author": "sabautil",
          "text": "What's your ask for a $100k investment?",
          "score": 2,
          "created_utc": "2026-01-20 18:25:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0q1nfm",
          "author": "Walfy07",
          "text": "[Wessford ](https://www.wessford-ind.com)\n\nTrying to sell cool stuff that no one else makes.",
          "score": 1,
          "created_utc": "2026-01-20 19:41:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0q7otd",
          "author": "Beautyisoneskindeep",
          "text": "Blimze, a social media platform for artist to connect, create and collaborate. \n\nWebsite: www.blimze.com",
          "score": 1,
          "created_utc": "2026-01-20 20:09:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0z0iw1",
              "author": "ZeraPain",
              "text": "How come all the websites people post here look the same? Do you guys all use the same template ?",
              "score": 1,
              "created_utc": "2026-01-22 02:07:50",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1017ce",
                  "author": "Beautyisoneskindeep",
                  "text": "The ux is done by a freelance guy. We liked it, but we never thought in that direction:)",
                  "score": 1,
                  "created_utc": "2026-01-22 06:01:20",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0q86r9",
          "author": "PhilPhilos001",
          "text": "Can I dm?",
          "score": 1,
          "created_utc": "2026-01-20 20:11:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0q8m3j",
          "author": "gregb_parkingaccess",
          "text": "We are building the market layer that lets autonomous vehicles and smart cars bid, wait, and reposition legally anywhere in a city, turning idle time into a real time spot market instead of tickets and chaos.",
          "score": 1,
          "created_utc": "2026-01-20 20:13:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0qbbyk",
          "author": "Worried_Cap5180",
          "text": "Fun football score prediction game to play with your friends https://fulltimescore.pro",
          "score": 1,
          "created_utc": "2026-01-20 20:26:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0qomav",
          "author": "Independent-Comb-840",
          "text": "can I pitch you my idea?",
          "score": 1,
          "created_utc": "2026-01-20 21:27:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0r0ct6",
          "author": "N-Innov8",
          "text": "Do you invest in bootstrapped startups who have already developed and launched products, have applied patents and PhD (ML) co-founders?",
          "score": 1,
          "created_utc": "2026-01-20 22:22:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0s6ssj",
          "author": "Ill_Lavishness_4455",
          "text": "I’ll pitch in DM",
          "score": 1,
          "created_utc": "2026-01-21 02:15:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0st7qk",
          "author": "Used-Sound4163",
          "text": "Hi, founder here. I’m building at the intersection of behavior, expression, and play. Sharing three early stage products I’m actively working on.\n\nDhuwa.com\nDhuwa is a mindful quitting platform for smoking and other impulsive habits. It focuses on awareness and understanding triggers rather than streak pressure, fear, or guilt.\nThis idea comes directly from my own struggle with impulsive behaviors. Most habit apps felt mechanical and shame driven.\n\nDhuwa is designed to help people slow down, observe urges, and build self trust instead of fighting themselves.\n\nStatus: early prototype and concept validation. Clear path toward subscriptions, wellness partnerships, and behavior change programs.\n\nOneMovePuzzle.com\nOne Move Puzzle is a minimal logic game where each level has a single perfect solution. It is simple to understand, deeply satisfying to solve, and designed for high replayability.\nI built it as a response to attention draining games. This format works extremely well for short form content, daily challenges, and viral distribution, with monetization through ads, premium levels, and sponsorships.\n\nStatus: playable MVP is live with strong early engagement from testers.\n\nPrakakura.com\nPrakakura is an anonymous public canvas where people can leave messages that live permanently on a shared digital space. Think of it as digital graffiti for thoughts, gratitude, grief, and human presence.\n\nThis project is deeply personal. It came from periods of loss, failure, and instability where expression mattered more than visibility or likes. The platform is live, has real users, and an Android app is already published. Payments are not enabled yet, but the engagement and emotional resonance are strong.\n\nFounder background\nI come from a growth and paid advertising background and have worked on multiple products across marketing and tech. I left my job to build independently, tried a physical business that failed, went through financial pressure, and kept building anyway. I’m technical, product focused, and very distribution aware.\n\nI’m not testing ideas for fun. I’m committed to building long term and would love to explore alignment if Forum supports founders with strong narratives, execution bias, and unconventional products.\n\nHappy to share metrics or continue the conversation over DM.\nPrabin",
          "score": 1,
          "created_utc": "2026-01-21 04:30:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0teukd",
          "author": "Dear_Initiative_9575",
          "text": "drop your linkedin and I'll dm you",
          "score": 1,
          "created_utc": "2026-01-21 07:19:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0unepw",
          "author": "monkey6",
          "text": "How many startups has Forum funded in 2026 so far? How many in the pipeline?",
          "score": 1,
          "created_utc": "2026-01-21 13:27:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0yjxzz",
          "author": "RufioGP",
          "text": "Bulk your buy, and Costco split,\nUser to user distribution. Users put orders together on what are purchase groups. Distributors and suppliers bid or fulfill the orders. Users can bulk their orders together to get better deals. The purchase group has a captain that receives the product and breaks it down to the users.\n\nCostco split is a similar concept but mainly for Costco and BJ’s. It’d be an app where users can meet at Costco and split items down. A buddy of mine does this with a group of his disc golf group. They meet up at Costco or one of their houses after a Costco run and split the items they bought in bulk. I think a ton of millennials would want to split on bulk items.",
          "score": 1,
          "created_utc": "2026-01-22 00:34:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o10a79i",
          "author": "kurwablyat01",
          "text": "Nobody wants to invest, people be like: \"This is bullshit, nobody wants to invest in me\". \n\nSomebody wants to invest, people be like: \"This is bullshit, people are fake and wants to scam you\"",
          "score": 1,
          "created_utc": "2026-01-22 07:16:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o13fn5p",
          "author": "areyouamastervader",
          "text": "Bringing cash to online transactions. \n\nSave your cart and pick back up where you left off in a physical location and complete the transaction without having to provide your credit card information to websites.\n\nBuilding because there are a lot of times I have wanted to buy something online but I just don't trust the website enough to give them my card information.",
          "score": 1,
          "created_utc": "2026-01-22 18:46:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o14nq1w",
          "author": "yidakee",
          "text": "Old farming technique. No serious VC would ever do this.",
          "score": 1,
          "created_utc": "2026-01-22 22:12:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0otlie",
          "author": "I_gotta_stop",
          "text": "Just b2b or b2c as well?",
          "score": 0,
          "created_utc": "2026-01-20 16:19:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0ov65v",
              "author": "kcfounders",
              "text": "Forum invests in B2B as of 2026 but open to hearing your pitch as well",
              "score": -7,
              "created_utc": "2026-01-20 16:27:03",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0p2m29",
          "author": "whyyoudidit",
          "text": "I can dm you my ideas",
          "score": 0,
          "created_utc": "2026-01-20 17:01:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0pdpdn",
              "author": "kcfounders",
              "text": "Ofcourse!",
              "score": -4,
              "created_utc": "2026-01-20 17:52:51",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0pl2me",
          "author": "Quiet_Drummer669988",
          "text": "Is my current vision, been working on it as a personal project.\n\n\nhttps://manifest-software.co.nz",
          "score": 0,
          "created_utc": "2026-01-20 18:26:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0put02",
          "author": "Fragrant_Brush_4161",
          "text": "Many B2B sales teams lose track of which prospects revisit their website after outreach. Sale is a multi step process, not just a single promo.\n\nSo, what I currently work on helps to identify known visitors, track campaign sources, and highlight high-intent activity. This way sales know exactly when to follow up or how much effort has to be put in to get a client in this part of the funnel.\n\nI am looking for users who would be willing to test the system and give feedback. Let me know if this problem resonates with you!",
          "score": 0,
          "created_utc": "2026-01-20 19:09:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0puz6y",
          "author": "Live-Lab3271",
          "text": "[InfraSketch's](https://www.infrasketch.net/) AI agent turns your ideas into architecture diagrams. Chat to iterate, ask questions, and refine. Then export a design doc and start building.",
          "score": 0,
          "created_utc": "2026-01-20 19:10:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0omghu",
          "author": "OkBumblebee4151",
          "text": "Heyyy dm me",
          "score": -1,
          "created_utc": "2026-01-20 15:46:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0ouzgq",
              "author": "kcfounders",
              "text": "Shoot me a request with your pitch",
              "score": -2,
              "created_utc": "2026-01-20 16:26:12",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0sk1go",
          "author": "sharique_55",
          "text": "I've already texted you months ago, I thought you're busy that's why you didn't reply back",
          "score": 0,
          "created_utc": "2026-01-21 03:32:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0wtfpu",
              "author": "kcfounders",
              "text": "I might have missed your message if you didn't get a response, DM me today and let's chat",
              "score": 1,
              "created_utc": "2026-01-21 19:31:09",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qjmiea",
      "title": "I'm a VC (can verify). Pitch me.",
      "subreddit": "Startup_Ideas",
      "url": "https://www.reddit.com/r/Startup_Ideas/comments/1qjmiea/im_a_vc_can_verify_pitch_me/",
      "author": "Ok-Lobster7773",
      "created_utc": "2026-01-22 05:54:52",
      "score": 21,
      "num_comments": 146,
      "upvote_ratio": 0.75,
      "text": "Please use this post as a board to share a high level overview for your startup. I'll try to share my high level thoughts, and hope others will do the same.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Startup_Ideas/comments/1qjmiea/im_a_vc_can_verify_pitch_me/",
      "domain": "self.Startup_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o11kloz",
          "author": "bonzowildhands",
          "text": "I’m building an online community & accountability centre for online biz solopreneurs, solo founders & side project owners. \n\nYes, the loneliest of them all. \n\nWill originally be primarily for accountability (nobody else to hold these people accountable) & community. Sharing resources, thoughts, ideas, problems & solves. \n\nWould ideally be monthly recurring revenue subscription model. \n\nPlease tear the idea apart / let me know how it MIGHT be possible. \n\nVery early stage, basic website built here: https://futureclarity.org",
          "score": 3,
          "created_utc": "2026-01-22 13:32:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o14urw4",
              "author": "Ok-Lobster7773",
              "text": "Have a deck you could send me?",
              "score": 1,
              "created_utc": "2026-01-22 22:50:59",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o156h43",
          "author": "not-at-all-unique",
          "text": "An automated system that appraises pitch descriptions and advises venture capitalists  whether to invest or not. \n\nI’ve even got some pseudo code for you!\n\nIf (pitch_source = “not-a-unique name”){  response = “yes” } \nElse { possibilities = [“yes”, “no”, “do you have a deck”, “send the deck”]\nResponse =random.Choice(possibilities)}\nReturn response; \n\n\nWith your investment I plan to further develop the agent such that it calls a service API to undertake the complex analysis, thus making this a far more valuable subscription service. \n\nThis can be branded to your specification, but really feel there is more value keeping this white label so that we may resell to other VCs…",
          "score": 3,
          "created_utc": "2026-01-22 23:51:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o157vap",
              "author": "Ok-Lobster7773",
              "text": "Decent for first layer of review. People often submit decks that are obvious rejects for not fitting our criteria in certain ways. Ways AI can filter. And if the AI knows details about what we like, current portfolio, it would be useful. Do you have a deck for this? (Meta question)",
              "score": 1,
              "created_utc": "2026-01-22 23:59:07",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o10gmd9",
          "author": "MoveOverBieber",
          "text": "You too?? What's this, a VC two-for-one?",
          "score": 2,
          "created_utc": "2026-01-22 08:13:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o10h29o",
              "author": "Ok-Lobster7773",
              "text": "Eh, like 5 for one. Wanted to see which Subreddits would like this kind of post, and which would troll me",
              "score": 1,
              "created_utc": "2026-01-22 08:17:58",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o10i8k1",
                  "author": "MoveOverBieber",
                  "text": "Novel idea, how it is going so far?",
                  "score": 1,
                  "created_utc": "2026-01-22 08:29:00",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o10r07x",
          "author": "Classic-Direction930",
          "text": "Sure can i send my deck in dm's",
          "score": 2,
          "created_utc": "2026-01-22 09:52:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o10rl3k",
              "author": "Ok-Lobster7773",
              "text": "Sounds good, thanks",
              "score": 0,
              "created_utc": "2026-01-22 09:57:28",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o10ux0b",
          "author": "Time_Ordinary261",
          "text": "I have an App that connects trainers with people who wanna use a personalized design routine and plan(food,routines, daily tips) to reach their goals and also accompany you on the whole process so that you have a lower chance of quitting a little  like Duolingo but with secret sauce.",
          "score": 2,
          "created_utc": "2026-01-22 10:27:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o14q60o",
              "author": "Ok-Lobster7773",
              "text": "Have a deck?",
              "score": 1,
              "created_utc": "2026-01-22 22:24:45",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o11iiy3",
          "author": "Obvious_Board4757",
          "text": "Im building in simple terms the zomato for daily recurring meals i do have a phased plan for it, it doesn't have blitzscale size right now but has huge potential to organize a segment worth billions",
          "score": 2,
          "created_utc": "2026-01-22 13:20:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o14uolt",
              "author": "Ok-Lobster7773",
              "text": "Have a deck you could send me?",
              "score": 1,
              "created_utc": "2026-01-22 22:50:30",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o15x860",
                  "author": "Obvious_Board4757",
                  "text": "Btw from india",
                  "score": 2,
                  "created_utc": "2026-01-23 02:18:09",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o11krd7",
          "author": "RajveerMarwah",
          "text": "Removing labs from soil testing and using AI to reach that accuracy using kits, which would decrease the price tenfold. All of this clubbed with advisory for the farmer to attain- land data and to make farming more profitable \n\nCurrently in india and have initial interest in the market through a commercial pilot.",
          "score": 2,
          "created_utc": "2026-01-22 13:33:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o14v1gf",
              "author": "Ok-Lobster7773",
              "text": "I do a lot of work in India, if you'd like to discuss further",
              "score": 1,
              "created_utc": "2026-01-22 22:52:24",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o15yvzt",
                  "author": "RajveerMarwah",
                  "text": "DMed you",
                  "score": 2,
                  "created_utc": "2026-01-23 02:27:17",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o11meg4",
          "author": "Low_Relative7172",
          "text": "AI development that address fundamental challenges in modern artificial intelligence: stability, alignment, efficiency, and robustness.  \n\n\nready to ship",
          "score": 2,
          "created_utc": "2026-01-22 13:41:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o14vf5p",
              "author": "Ok-Lobster7773",
              "text": "Have a deck?",
              "score": 1,
              "created_utc": "2026-01-22 22:54:24",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o120wa4",
          "author": "sarcasmsay",
          "text": "How to start career in VC firm I have good knowledge of startups what all skills are required",
          "score": 2,
          "created_utc": "2026-01-22 14:56:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o150aao",
              "author": "Ok-Lobster7773",
              "text": "Personally I moved from startups into incubators, and incubators into VC",
              "score": 1,
              "created_utc": "2026-01-22 23:19:37",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o121hb1",
          "author": "Vapecaster",
          "text": "Synthetic audiences - [Deepsona](https://www.deepsona.ai) , 4 customers (mainly businesses) in 20 days.",
          "score": 2,
          "created_utc": "2026-01-22 14:59:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o150c8g",
              "author": "Ok-Lobster7773",
              "text": "Do you have a deck?",
              "score": 1,
              "created_utc": "2026-01-22 23:19:54",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o121tr8",
          "author": "classywoodsie123",
          "text": "Hear me out, robot goth baddies...",
          "score": 2,
          "created_utc": "2026-01-22 15:01:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o12i1d6",
          "author": "Eyelover0512",
          "text": "[unitcause.com](https://unitcause.com)",
          "score": 2,
          "created_utc": "2026-01-22 16:16:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o15176a",
              "author": "Ok-Lobster7773",
              "text": "Do you have a deck?",
              "score": 1,
              "created_utc": "2026-01-22 23:24:17",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o15swi7",
                  "author": "Eyelover0512",
                  "text": "Yes I do have, can I share .?",
                  "score": 2,
                  "created_utc": "2026-01-23 01:54:03",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o12kmmq",
          "author": "AboboMutombo",
          "text": "Hi!\n\nI'm creating Discogs/Reverb for comic books: an exhaustive and robust database and marketplace serving key and every day issues. Free memberships. Percentage on collector transactions. Trying to get a Patreon started to help fund development as I am solo founder/developer. Thanks!",
          "score": 2,
          "created_utc": "2026-01-22 16:28:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o151an8",
              "author": "Ok-Lobster7773",
              "text": "Do you have a deck you could send me? Happy to discuss over dm.",
              "score": 1,
              "created_utc": "2026-01-22 23:24:47",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o15q5x0",
                  "author": "AboboMutombo",
                  "text": "Hi! I've got one that needs some touch ups but would be happy to share. Sending to your DMs now. ",
                  "score": 2,
                  "created_utc": "2026-01-23 01:38:37",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o12ua24",
          "author": "Desir-Arman07",
          "text": "**I built \"Lumina\" to stop the Google → LinkedIn → Naukri loop.**\n\n**The Problem:** Indian job seekers spend hours hopping between platforms, only to land on spammy consultancy posts or expired listings. It’s a broken cycle.\n\n**The Solution:** I built a search engine that bypasses the middlemen. It scrapes **direct application links** from official company career pages.\n\n**Current Status:** This is an **early MVP**. I currently have **2,300+ active jobs** indexed. I am pushing updates daily to fix bugs, improve the UI, and optimize the scrapers, but I wanted to show the direction I'm taking.\n\n**How it works:**\n\n* **No Third Parties:** Indexes *only* official company pages.\n* **Direct Access:** You search for a role, and we give you the direct link to the official portal (Workday, Taleo, etc.).\n\n**Link:** [https://luminajobs.vercel.app/](https://luminajobs.vercel.app/) (Feedback is very welcome!)",
          "score": 2,
          "created_utc": "2026-01-22 17:11:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o151lio",
              "author": "Ok-Lobster7773",
              "text": "Deck?",
              "score": 1,
              "created_utc": "2026-01-22 23:26:19",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o12vr17",
          "author": "prsmstz",
          "text": "We're building rec'd to change how people discover places globally. Gen Z don't respond to ads, and don't trust google reviews. With rec'd you can discover places you love through people you trust.\n\nYour taste graph already exists, it just isn't mapped. Going on holiday? rec'd extrapolates your taste recommending places you'll love and taste makers who's recommendations are made just for you.\n\nStop saving posts in apps, taking screenshots, adding to notes or sending them to your friends. Import directly from social media or google maps, by individual posts, or all your saved posts. Or simply discover on rec'd directly.  \n  \n\"Date night options, with cosy vibes, for me and my partner, Under £60, with availability at 6PM tomorrow and somewhere neither of us have been\" is now a query not a browse.\n\nOur MVP launches in the next 3-4 weeks. Join the waitlist at [recd.co](http://recd.co/)",
          "score": 2,
          "created_utc": "2026-01-22 17:18:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o152jrg",
              "author": "Ok-Lobster7773",
              "text": "Do you have a deck you could send me?",
              "score": 1,
              "created_utc": "2026-01-22 23:31:19",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o133m37",
          "author": "throwawayEZ1122",
          "text": "Standardizing construction industry, something that’s not available to the broad market or in general right now.",
          "score": 2,
          "created_utc": "2026-01-22 17:53:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o155ltn",
              "author": "Ok-Lobster7773",
              "text": "What does that entail?",
              "score": 1,
              "created_utc": "2026-01-22 23:47:13",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1366um",
          "author": "Yashvanth_06",
          "text": "Hi, Start-up related to blue collar works and labour's...let me know if I can DM.\nThanks",
          "score": 2,
          "created_utc": "2026-01-22 18:05:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o155n4n",
              "author": "Ok-Lobster7773",
              "text": "Sure, sounds good.",
              "score": 1,
              "created_utc": "2026-01-22 23:47:24",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o136mdu",
          "author": "vijayanands",
          "text": "Creating content is getting cheaper and cheaper and holding attention is the hardest part. There is so much money into GenAI to generate amazing visuals which still struggle to hold together cohesive stories. And the difference between slop and memorable content is just that.\n\nBuilding a content intelligence layer for studios and content creators to help them build content for the future.",
          "score": 2,
          "created_utc": "2026-01-22 18:06:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o155qm4",
              "author": "Ok-Lobster7773",
              "text": "Would love to see a demo for this.",
              "score": 1,
              "created_utc": "2026-01-22 23:47:56",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1586hh",
                  "author": "vijayanands",
                  "text": "lets connect over dm?",
                  "score": 2,
                  "created_utc": "2026-01-23 00:00:46",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1418po",
          "author": "ReceptionAcademic262",
          "text": "Do you invest in healthcare?",
          "score": 2,
          "created_utc": "2026-01-22 20:24:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1569mn",
              "author": "Ok-Lobster7773",
              "text": "Yes, but primarily physical tech",
              "score": 1,
              "created_utc": "2026-01-22 23:50:43",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o14erds",
          "author": "Intelligent_Deer_525",
          "text": "I’m building the professional presence engine at https://usepraxis.co",
          "score": 2,
          "created_utc": "2026-01-22 21:28:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o156evp",
              "author": "Ok-Lobster7773",
              "text": "Do you have a deck?",
              "score": 1,
              "created_utc": "2026-01-22 23:51:29",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o156kx1",
                  "author": "Intelligent_Deer_525",
                  "text": "To be honest, no. I need to work this out since the idea of getting some investment is cool. Thanks for replying!",
                  "score": 2,
                  "created_utc": "2026-01-22 23:52:22",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o14iing",
          "author": "CicadaOk9722",
          "text": "with more than 9000 coffeeshops \nand not enough visility and discoverability\nI decided to built my v1\nhere: cafeshanghai.com",
          "score": 2,
          "created_utc": "2026-01-22 21:46:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o156gs9",
              "author": "Ok-Lobster7773",
              "text": "9000 where? And do you have a deck?",
              "score": 1,
              "created_utc": "2026-01-22 23:51:45",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o158d69",
                  "author": "CicadaOk9722",
                  "text": "in Shanghai. Some say are even more. Sent a dm",
                  "score": 2,
                  "created_utc": "2026-01-23 00:01:46",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o14owmq",
          "author": "pvfakten",
          "text": "https://www.oidapost.com/\nAutomatic social posts from your daily code updates.",
          "score": 2,
          "created_utc": "2026-01-22 22:18:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o156ium",
              "author": "Ok-Lobster7773",
              "text": "Do you have a deck?",
              "score": 1,
              "created_utc": "2026-01-22 23:52:04",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o14wm5d",
          "author": "iShelar",
          "text": "Building xr sketch app(tracing kind of). Final product is done just started doing marketing in European market.",
          "score": 2,
          "created_utc": "2026-01-22 23:00:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o156om9",
              "author": "Ok-Lobster7773",
              "text": "Do you have a demo? I do work in EU, and XR.",
              "score": 1,
              "created_utc": "2026-01-22 23:52:54",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o14xnvi",
          "author": "[deleted]",
          "text": "[deleted]",
          "score": 2,
          "created_utc": "2026-01-22 23:06:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o156q6h",
              "author": "Ok-Lobster7773",
              "text": "Do you have a deck?",
              "score": 1,
              "created_utc": "2026-01-22 23:53:08",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o15af6l",
          "author": "tennpriest",
          "text": "I've built a web-app for Home Service providers such as Roofers, Plumbers, Cleaners, Electricians (businesses that take lots of incoming calls and need to funnel/sort/map/assign to Sales people, issue/manage quotes/photos/notes/materials, assign crews (also mapped), then follow through with Billing, issue invoices and keep track of payments and outstanding balances.\n\nAll on one simple application. (A similar/customized (older) version of this application is currently in use by a large roofing company in Toronto). This is more flexible newer version.\n\nSolo operators are free to use, no time limit, no CC required. \n\nI hope to help your business grow and be more efficient, and you'll upgrade as you add team members.\n\nI'm looking for assistance in marketing. (There is a reseller portal for those interested in cold-calling Home Service businesses, and securing a commission on all future sales)\n\nhttps://HomeJet.ca\n\nI'm the sole developer, and am happy to hear any feedback.\n\nThank you.",
          "score": 2,
          "created_utc": "2026-01-23 00:12:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o16j0ja",
              "author": "Ok-Lobster7773",
              "text": "Want to send me a dm?",
              "score": 1,
              "created_utc": "2026-01-23 04:23:52",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o15beqw",
          "author": "Independent-Comb-840",
          "text": "I’ve been working on an app called MarketMind that helps business owners make better decisions about what they put out online, without having to figure everything out themselves or hire a full marketing team. You drop in your content, and MarketMind gives you clear feedback on what’s working, what isn’t, and what to adjust. It also helps you plan ahead, stay consistent, and not feel like you’re always behind or guessing what to do next. It’s built for people who are just starting out or who can’t justify spending a lot on marketing, but still want real direction and insight. The goal is to make that kind of help affordable and practical for everyday business owners who don’t have the time to do all this themselves. It’s meant to feel less like a tool, and more like having someone in your corner who understands the process and keeps things organized.",
          "score": 2,
          "created_utc": "2026-01-23 00:17:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o16j36p",
              "author": "Ok-Lobster7773",
              "text": "Do you have a deck?",
              "score": 1,
              "created_utc": "2026-01-23 04:24:19",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o15bgne",
          "author": "Strong_Spite7794",
          "text": "Sending a message!",
          "score": 2,
          "created_utc": "2026-01-23 00:18:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o15cptf",
          "author": "UnbreakableSaiyajin",
          "text": "Ex-Google/Microsoft founder building Verso, the Spotify for families & people of faith. Intelligently recommends clean+high quality music for families AND removes explicit content from any song real-time\n\n• Traction: Viral on TikTok/Insta (**25M+** views), **10k+** downloads, **4k+** waitlisted users, **45%** MoM growth\n\n• Opportunity: **180M+** young families bombarded with explicit content in today’s music, **1%** music market is **$1B+** ARR\n\n• Why now: First mover advantage, music industry ripe for innovation, family/faith-based apps consistently hitting **top 10** in US & Worldwide\n\n• Team: ex-Google AI, ex-Microsoft, and startups. **$500M+** ARR in AI consumer products & app exits\n\nIf this sounds interesting, happy to chat some more and share deck.",
          "score": 2,
          "created_utc": "2026-01-23 00:24:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o16jjo2",
              "author": "Ok-Lobster7773",
              "text": "Deck would be great, if you'd like to send that over dm",
              "score": 2,
              "created_utc": "2026-01-23 04:27:16",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o15oyx1",
          "author": "PurpleWho",
          "text": "Mind Control is a prompt management platform that lets non-technical team members—product owners, domain experts, marketers—edit and deploy AI prompts in production apps without engineering involvement, eliminating the bottleneck between business logic and code.\n\n[https://mindcontrol.studio/](https://mindcontrol.studio/)",
          "score": 2,
          "created_utc": "2026-01-23 01:31:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o16m87h",
              "author": "Ok-Lobster7773",
              "text": "Have a deck?",
              "score": 1,
              "created_utc": "2026-01-23 04:44:41",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o16mj58",
                  "author": "PurpleWho",
                  "text": "Nope. Shared a link to the actual product. In your post you only asked for a high level overview. \n\nIf you need a deck, I can put one together. Do you have a go to reference you can share on how you like your decks put together?",
                  "score": 1,
                  "created_utc": "2026-01-23 04:46:38",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o165jsu",
          "author": "arpansac",
          "text": "[Commudle.com](http://Commudle.com) \\- 250,000+ user sign-ups have been a part of Google for Startups accelerator. We are building what CRM does for sales, but for developer communities. Have an ongoing mini-pilot with one of the tech giants.   \nWe are working our way through the B2B journey.",
          "score": 2,
          "created_utc": "2026-01-23 03:03:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o16w0uf",
              "author": "Ok-Lobster7773",
              "text": "Really nice numbers. Could you DM me more info?",
              "score": 1,
              "created_utc": "2026-01-23 05:53:35",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o16b3z1",
          "author": "Feisty-Promise-78",
          "text": "An AI platform which automated the whole software development lifecycle from PRD(project requirement document) generation to stories generations to code generation to testing and deploying. I need fund for LLM models.",
          "score": 2,
          "created_utc": "2026-01-23 03:35:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o17f444",
              "author": "Ok-Lobster7773",
              "text": "Would you like to send some more info over dm?",
              "score": 1,
              "created_utc": "2026-01-23 08:36:05",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1199nk",
          "author": "novalidation_",
          "text": "Can you suggest an idea that you believe in and would have invested in?",
          "score": 4,
          "created_utc": "2026-01-22 12:22:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o14tm6c",
              "author": "Ok-Lobster7773",
              "text": "Personally I usually invest in hardtech/hardtech adjacent.\n\nI like when something can be sold to a few people at high price point, and something that my team can then scale.",
              "score": 1,
              "created_utc": "2026-01-22 22:44:49",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o10t0ht",
          "author": "Smart-Law-1295",
          "text": "I have an idea about the startup, wanna to share get some valuable insights about the idea about tailor made agentic layer of AI",
          "score": 2,
          "created_utc": "2026-01-22 10:10:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o11ln09",
              "author": "Smart-Law-1295",
              "text": "DM for sharing more on it",
              "score": 1,
              "created_utc": "2026-01-22 13:37:52",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o10u1bu",
              "author": "Ok-Lobster7773",
              "text": "Sure. Want to share over DM?",
              "score": 0,
              "created_utc": "2026-01-22 10:19:58",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o10lqba",
          "author": "Meg_3832",
          "text": "We developed QuickV because comparing prices on quick-commerce apps is a lot more painful than it should be.\n\nSo if you are asking for the cheapest delivery place, then you are stuck with a rotation of delivery services like Blinkit, Zepto, Instamart, BigBasket. and searching for the same object over and over again while forgetting prices.\n\nSo we attempted to remedy that.\n\nQuickV allows comparison of products and prices for Blinkit, Zepto, Instamart, and BigBasket in a single application (JioMart coming soon).\n\nWhat it does:\n\n1.Search Once, View Results from All Suppliers\n2.Prices and Availability Compared Immediately\n3.Location set once for all platforms and can be changed later with one tap\n4.Look around: categories and hot deals\n5.See full product details within the chosen platform\n6.Each provider will maintain a separate cart.\n7.Add items to all carts in one tap and checkout at the provider\n\nIn short, no more app hopping. It all happens in one spot, and you decide where to purchase.\n\nPlay Store\nhttps://play.google.com/store/apps/details?id=com.quickV.app\n\nWould love honest feedback – what works, what doesn’t, and the next piece you’d like!",
          "score": 1,
          "created_utc": "2026-01-22 09:01:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o10oo2k",
              "author": "Ok-Lobster7773",
              "text": "Do you have a deck?",
              "score": 1,
              "created_utc": "2026-01-22 09:29:47",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o10w6ds",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-22 10:39:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o11ivns",
              "author": "kiwiinNY",
              "text": "Hit a login wall immediately. Bad experience.",
              "score": 2,
              "created_utc": "2026-01-22 13:22:32",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o11j8gy",
                  "author": "Every_Box5920",
                  "text": "\nFair point — that’s on me.\nI’m experimenting with a no-signup preview so people can explore before committing.\nAppreciate you calling it out.",
                  "score": 2,
                  "created_utc": "2026-01-22 13:24:31",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o14qmzz",
              "author": "Ok-Lobster7773",
              "text": "Have a deck for this?",
              "score": 1,
              "created_utc": "2026-01-22 22:27:06",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o11m82q",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-22 13:41:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o127wv7",
              "author": "kamikaibitsu",
              "text": "hey can i dm you?",
              "score": 1,
              "created_utc": "2026-01-22 15:30:27",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o125y2p",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-22 15:20:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o150io7",
              "author": "Ok-Lobster7773",
              "text": "Do you have a deck?",
              "score": 1,
              "created_utc": "2026-01-22 23:20:48",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o13omgj",
          "author": "pranaysparihar",
          "text": "Projects that im building:\nSmart orchestrator for cloud agnostic saas: in today’s day and age people are giving coding their apps but don’t know how to deploy on the cloud with the right tools and complexity what we help with is automating and promoting their apps to make sure they have the correct monitoring and cloud setup for the best bang for buck our goal is to get your app to the consumer in under 5 minutes\n2. I’m trying to create an ai runtime that will enable user to run big parameter models on more budget friendly hardware all locally and the standout part is you can bring your model from onnx to anything under the radar and it will work use cases are iOT devices and defence sectors, I’d say we are 40% there \nIf you’re interested in either of this let’s talk the vision from me is clear but I’m working on it solo which is causing the delay so if you could help me out that’d be great I’m in Hyderabad in case you’re based out of here too we can meet",
          "score": 2,
          "created_utc": "2026-01-22 19:26:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1561dx",
              "author": "Ok-Lobster7773",
              "text": "Do you have a deck you could send me?",
              "score": 1,
              "created_utc": "2026-01-22 23:49:31",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o16j191",
          "author": "jdawgindahouse1974",
          "text": "Ai ocr",
          "score": 1,
          "created_utc": "2026-01-23 04:23:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o17f4vw",
              "author": "Ok-Lobster7773",
              "text": "More info?",
              "score": 1,
              "created_utc": "2026-01-23 08:36:17",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o16nwjt",
          "author": "TakTable",
          "text": "I've already got a product and a brand.  [Taktable.com](http://Taktable.com)  How do I move the product?",
          "score": 1,
          "created_utc": "2026-01-23 04:55:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o16v58r",
          "author": "jasfi",
          "text": "I'm building an Open Core AI coding tool that aims to overcome the long-term quality issues seen in today's solutions.",
          "score": 1,
          "created_utc": "2026-01-23 05:46:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o16vunl",
          "author": "Glum_Ad_6823",
          "text": "I’m building Own Outbound.\n\nSales teams today are drowning in signals — CRM data, emails, calls, AI-generated insights — yet judgment is getting worse, not better. Most tools optimize for activity or automation, not decision quality.\n\nOwn Outbound is a judgment-first outbound intelligence layer.\nInstead of telling reps what to do, it helps them understand what happened, why it matters, and where to focus next — preserving human decision-making while reducing cognitive load.\n\nI’ve spent 20+ years in outbound sales, including being a founding account executive at Freshworks through IPO, watching this problem compound as stacks got bigger and AI got noisier. I’ve been thinking about this for over a year and am now building the MVP.\n\nEarly stage. No hype. Deeply opinionated.\nLooking to talk with investors who believe the next GTM advantage isn’t more automation — it’s better judgment.",
          "score": 1,
          "created_utc": "2026-01-23 05:52:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o16wzmd",
          "author": "codename-bhulgaya",
          "text": "If your only response to the ideas is to ask for a deck, you could have simply said share a deck and ill get back to you.",
          "score": 1,
          "created_utc": "2026-01-23 06:01:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o16xlmw",
          "author": "SaZ2024",
          "text": "What about, I’ll give the complete idea and how the model will work (paid and free with adds) , how to start and where to sell everything I can provide, you need to provide me with resources and can guide them (can’t provide 100%, 20% daily 2-3 hrs) \nMVP can be done in 2 weeks to onboard other investors if you want.",
          "score": 1,
          "created_utc": "2026-01-23 06:05:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1169ir",
          "author": "ali3ngravity",
          "text": "Hi. I am the Network Manager for the largest maritime content aggregator, a broadcast engineer with over 25 years in the industry.\n\nI am also an independent researcher who recently made significant progress in Gravity Manipulation, specifically Bio-Gravitic Manipulation. Its a small milestone in the grand scheme of things. We have successfully reduced the weight of a motor vehicle without removing anything physical. I can do a live demo for you. Company name is Gravity Null Industries. I need an investor so I can focus on this breakthrough full time.\n\nDM me. Thanks",
          "score": 1,
          "created_utc": "2026-01-22 12:00:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o11xnu3",
              "author": "woundedkarma",
              "text": "Lmao",
              "score": 2,
              "created_utc": "2026-01-22 14:40:40",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o13gg3q",
                  "author": "Any-Dig-3384",
                  "text": "Removed the fuel. 🤣",
                  "score": 1,
                  "created_utc": "2026-01-22 18:50:09",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o11x5xx",
          "author": "Walfy07",
          "text": "[Wessford](https://www.wessford-ind.com)\n\nMake cool stuff for micro niches that others won't.",
          "score": 1,
          "created_utc": "2026-01-22 14:38:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1506zd",
              "author": "Ok-Lobster7773",
              "text": "Micro is good. Do you have a deck?",
              "score": 1,
              "created_utc": "2026-01-22 23:19:09",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o16ayjr",
                  "author": "Walfy07",
                  "text": "not yet.",
                  "score": 2,
                  "created_utc": "2026-01-23 03:35:06",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qg1735",
      "title": "We spent 6 months building features nobody asked for. Here's what actually got us our first paying customers",
      "subreddit": "Startup_Ideas",
      "url": "https://www.reddit.com/r/Startup_Ideas/comments/1qg1735/we_spent_6_months_building_features_nobody_asked/",
      "author": "Abdulwahab93",
      "created_utc": "2026-01-18 06:30:58",
      "score": 20,
      "num_comments": 17,
      "upvote_ratio": 0.89,
      "text": "I'm a developer who thought I knew what developers needed. I was wrong.\n\nMy co-founder and I built an AI tool for software teams. We spent 6 months adding every feature we thought was \"essential\":\n\n* Fancy dashboard \n* 15+ integrations \n* Custom workflows \n* Beautiful onboarding \n\nTotal paying customers after 6 months: 0\n\nWe had 200+ signups. People would try it, say \"this is cool,\" and never come back.\n\nThe turning point came when I was manually doing customer development calls (should've done this from day 1). One engineering lead said something that hit hard:\n\n\"I don't need another dashboard. I need something that actually closes my Jira tickets while I sleep.\"\n\nThat one sentence changed everything.\n\nWe stripped out 70% of what we built. Focused on ONE thing: take a ticket, understand the codebase, submit a PR. That's it.\n\nWhat happened next:\n\n* First paying customer within 2 weeks\n* 5 more in the next month\n* Now at $2k MRR (small but real)\n\nWhat I learned:\n\n1. \"Cool\" ≠ valuable. People don't pay for cool. They pay for time saved.\n2. Talk to users before you build. I know everyone says this. I thought I was different. I wasn't.\n3. Narrow > Wide. Doing one thing exceptionally beats doing ten things okay.\n4. Your first 10 customers are hiding in conversations, not ads. Every early customer came from Reddit, Discord, or direct outreach.\n\nStill early and still figuring things out. But the difference between 0 customers and 5 customers feels massive mentally.\n\nFor those who've been through this: What was the moment you realized you were building the wrong thing? And how did you pivot without losing momentum?\n\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Startup_Ideas/comments/1qg1735/we_spent_6_months_building_features_nobody_asked/",
      "domain": "self.Startup_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o095vax",
          "author": "Wide_Brief3025",
          "text": "Getting out of your own head and talking directly to users is honestly what makes everything click. I had a similar experience and found most early leads actually surfaced in conversations way before they hit our site. Using something like ParseStream helped me track those relevant discussions and spot high intent users so I could join in naturally and actually provide value instead of just lurking and hoping.",
          "score": 3,
          "created_utc": "2026-01-18 07:21:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0a1qgp",
              "author": "Abdulwahab93",
              "text": "That's exactly it - the conversations happen way before they ever hit your landing page. I started hanging out in Discord servers and Slack communities where my target users already were. The signal-to-noise ratio was way better than any paid channel. How did you handle the balance between providing value vs feeling like you're always \"on\" in those communities?",
              "score": 1,
              "created_utc": "2026-01-18 12:10:39",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o09bxhn",
          "author": "kubrador",
          "text": "\"i don't need another dashboard\" is developer speak for \"please god just make my life easier instead of prettier.\" congrats on finally listening to your users after six months of shipping features for your own dopamine hits.",
          "score": 2,
          "created_utc": "2026-01-18 08:16:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0a1szu",
              "author": "Abdulwahab93",
              "text": "Ha, guilty as charged. 6 months of \"but what if we add THIS feature\" when the answer was literally in the first user interview I ignored. The dopamine from shipping is real and dangerous. At least now I ship things that actually matter to someone other than my ego.",
              "score": 1,
              "created_utc": "2026-01-18 12:11:14",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0cuuih",
          "author": "arcady_vibes",
          "text": "The real shift here wasn’t talking to users, it was switching from evaluation language (“cool”, “nice”) to replacement language (“this does my job while I sleep”).\nThat’s usually the moment a product stops being tried and starts being paid for.",
          "score": 1,
          "created_utc": "2026-01-18 20:56:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0lqnkg",
          "author": "Lost_Restaurant4011",
          "text": "This is a really good reminder that builder intuition gets warped fast once you are deep in the code. The longer you build without feedback, the more every feature feels justified because of sunk time. What helped me avoid this later was forcing myself to demo half baked versions early, even if it felt embarrassing. The discomfort of showing something incomplete was way cheaper than months of building in the dark.",
          "score": 1,
          "created_utc": "2026-01-20 03:32:06",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qj1u95",
      "title": "Best Online Legal Templates for Startups?",
      "subreddit": "Startup_Ideas",
      "url": "https://www.reddit.com/r/Startup_Ideas/comments/1qj1u95/best_online_legal_templates_for_startups/",
      "author": "AfredoMattison-98",
      "created_utc": "2026-01-21 16:02:45",
      "score": 20,
      "num_comments": 2,
      "upvote_ratio": 1.0,
      "text": "Starting a side hustle and realizing the legal stuff is actually real. I don’t have a lawyer yet, so I’m looking for good online legal templates that won’t screw me later.\n\nBest online legal templates for startups?  \nNDAs, contracts, TOS, privacy policies anything good and affordable.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Startup_Ideas/comments/1qj1u95/best_online_legal_templates_for_startups/",
      "domain": "self.Startup_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o13iona",
          "author": "DistributionCool6615",
          "text": "If you’re pre-lawyer, the safest move is to use templates that are actually built for startups (not random downloads) and make sure they match your jurisdiction + your business model. I’ve grabbed NDAs/contract templates from AI Lawyer before when I needed something clean fast, then I tweak for the specifics.",
          "score": 1,
          "created_utc": "2026-01-22 18:59:58",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qkk8lr",
      "title": "Startup idea validation: why I spent $0 on ads and got 500 organic visitors in 60 days",
      "subreddit": "Startup_Ideas",
      "url": "https://www.reddit.com/r/Startup_Ideas/comments/1qkk8lr/startup_idea_validation_why_i_spent_0_on_ads_and/",
      "author": "Chemical_Survey2577",
      "created_utc": "2026-01-23 07:15:22",
      "score": 20,
      "num_comments": 6,
      "upvote_ratio": 0.86,
      "text": "The new indie hacker playbook:\n\n\n\n* Open source the sexy experiments,\n* Monetize the boring problems,\n* Free builds credibility,\n* Paid solves real pain,\n\n\n\nMost people do it backwards.\n\n\n\nHad a startup idea and needed to validate if people actually cared about the problem I was solving.\n\n\n\nMost advice says run paid ads to test demand but I didn't want to spend money validating something that might not work.\n\n\n\nThe approach I took was building organic distribution before building the full product. Created a simple landing page explaining the problem and the proposed solution.\n\n\n\nAdded an email signup for early access. Then focused on getting organic traffic to see if anyone would actually sign up.\n\n\n\nStarted with SEO foundation because paid social traffic disappears the moment you stop spending.\n\n\n\nNeeded a channel that would compound over time instead of requiring constant cash.\n\n\n\nUsed [directory submission tool](http://getmorebacklinks.org/) to submit the landing page to 200+ startup and product directories so the domain would have some authority.\n\n\n\nWeek one and two looked like nothing was happening. A few directory listings went live but no traffic. This is the scary part of organic validation because you're not getting the immediate feedback that paid ads provide.\n\n\n\nWeek three is when Search Console started showing the domain getting crawled more frequently. Published 3 blog posts targeting problem-based searches related to the startup idea. Not promotional content, just helpful posts about the problem space.\n\n\n\nWeek four through eight the traffic started building. Domain authority went from zero to 18. Started ranking for longtail keywords around the problem I was solving. Traffic hit 500 organic visitors and I had 40 email signups from people who found the landing page through search.\n\n\n\nThe validation part worked better than expected. These 40 people didn't stumble onto the page through an ad, they actively searched for solutions to this problem. That's way stronger signal than paid traffic where people click out of curiosity but don't actually care.\n\n\n\nHad conversations with 15 of those signups. Learned what features they actually needed, what pricing made sense, what alternatives they'd tried. All of this validation happened without spending anything on ads.\n\n\n\nThe startup idea lesson: organic distribution takes longer to build but gives you better validation data. People finding you through search have real intent. They're actively looking for solutions right now, not just casually browsing their feed.\n\n\n\nIf you're validating a startup idea and have more time than money, build organic channels first. It's slower but the signal quality is higher and the distribution keeps working even when you're not actively promoting.\n\n\n\nSmall advice, from founder to founder -\n\n\n\nStop chasing AI trends.\n\n\n\nBuild for problems that existed before AI:\n\n\n\n* people want to look good,\n* people want to make money,\n* people want to be productive,\n* people want to remember things,\n* people want to eat better,\n* people want better relationships,\n\n\n\nAI is just the tool.\n\n\n\nThe problem is timeless.\n\n\n\nNobody pays for \"AI features\"\n\n\n\nThey pay to fix their actual life.\n\n\n\nPick a real problem.\n\n\n\nAdd AI to solve it faster.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Startup_Ideas/comments/1qkk8lr/startup_idea_validation_why_i_spent_0_on_ads_and/",
      "domain": "self.Startup_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o1779y6",
          "author": "wprimly",
          "text": "same here. paid ads gave us noise, organic gave us conversations.",
          "score": 1,
          "created_utc": "2026-01-23 07:25:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o17bjsy",
          "author": "Ok-Hedgehog4402",
          "text": "Users don't care about the tech stack, they care about the outcome (saving time/money). Solving boring problems with new AI tools is where the real value lies.",
          "score": 1,
          "created_utc": "2026-01-23 08:03:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o177lzl",
          "author": "EscapeNormal_2024",
          "text": "\nwere those 3 blog posts targeting very narrow problems, or more general queries?",
          "score": 0,
          "created_utc": "2026-01-23 07:28:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o178oyl",
              "author": "Chemical_Survey2577",
              "text": "very narrow. super specific problems people were already searching for. the goal wasn’t traffic volume, it was intent and seeing if the pain was real.",
              "score": 0,
              "created_utc": "2026-01-23 07:38:03",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1782nd",
          "author": "pranavboiii",
          "text": "\n\nweek 1–2 being dead is the scary part most people can’t sit through.",
          "score": 0,
          "created_utc": "2026-01-23 07:32:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o17cb7k",
          "author": "ergonet",
          "text": "Ok, just __Another Vibe Ad__ for getmorebacklinks, got it.\n\nYou supposedly had success, yet not a single detail or link about what you built. \n\nOnly generic slop about “the product”, “the idea”, “the problem”, “the solution”, yet you included a link to a supposedly unrelated service.",
          "score": -1,
          "created_utc": "2026-01-23 08:10:20",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qh5q3w",
      "title": "Monday check-in: what are you building?",
      "subreddit": "Startup_Ideas",
      "url": "https://www.reddit.com/r/Startup_Ideas/comments/1qh5q3w/monday_checkin_what_are_you_building/",
      "author": "Fareway13",
      "created_utc": "2026-01-19 14:33:36",
      "score": 17,
      "num_comments": 39,
      "upvote_ratio": 0.96,
      "text": "Curious to know what others are building.\n\nI’m building [itraky](https://www.itraky.io/), a smart deep linking tool that helps creators and affiliates **skyrocket their conversion rates**.\n\nIt automatically opens links directly in apps like Amazon, YouTube, TikTok or Instagram instead of the browser, so users land where they’re already logged in and ready to act.\n\nThat means a smoother experience and fewer drop-offs.\n\nSo… what are you building? 👇",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Startup_Ideas/comments/1qh5q3w/monday_checkin_what_are_you_building/",
      "domain": "self.Startup_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o0i14qd",
          "author": "Beneficial_Ad1805",
          "text": "I’m working on Unibox ([https://unibox.today](https://unibox.today/)) and I just opened up the public waitlist for the beta.\n\nThe core reason I built this is \"search fatigue.\" I’d remember a conversation about a specific budget or a bug, but I couldn't remember if it happened in a Slack DM, a Telegram group, or an email thread. I’d spend 10 minutes jumping between apps just to find one sentence.\n\nI wanted a way to treat all my communications as one searchable database.\n\nYou can join the waitlist here: [https://unibox.today](https://unibox.today/)\n\nWould love to hear your thoughts or any specific integrations that would make your life easier.",
          "score": 3,
          "created_utc": "2026-01-19 16:30:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0hj73q",
          "author": "OkResort8287",
          "text": "1. www.kipasastore.com - an all in 1 global store stocking up recently rolled put with updates pending \n2. https://maasimcreatives.com/ - a kids creative corner kids books for your kids",
          "score": 1,
          "created_utc": "2026-01-19 15:08:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0hvh10",
          "author": "adictonator",
          "text": "I'm building [Mudo: Anxiety & Mood Tracker](https://mudoapp.com?utm_source=reddit&utm_medium=comment) that helps you understand your mood patterns with powerful insights. It's free, anonymous and private, as it should be. :)",
          "score": 1,
          "created_utc": "2026-01-19 16:05:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0i5eb3",
          "author": "Walfy07",
          "text": "[Wessford](https://www.wessford-ind.com/flux-wallet.html)\n\nA cool modern wallet to carry stuff.",
          "score": 1,
          "created_utc": "2026-01-19 16:49:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0imhn7",
          "author": "Lost-Inflation-6239",
          "text": "Live demo: https://goalstatsil.com/en\nI’m building GoalStats, a lightweight SaaS for amateur football and futsal groups ⚽\nWe built it for our own weekly games, rotating teams every session, no fixed league, no spreadsheets, no WhatsApp chaos.\nIt tracks matchdays, goals, assists, MVPs and player stats automatically, and over time you actually see stories and rivalries form through the data.\nIt’s simple by design, mobile friendly, and focused only on what casual groups really need.\nWould love feedback from others building or using tools for sports, stats, or small communities 🚀\nExample team: https://goalstatsil.com/en/thechampions",
          "score": 1,
          "created_utc": "2026-01-19 18:07:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0injux",
          "author": "chanderbing0212",
          "text": "I’ve been working closely with a few early-stage founders on financial decision-making, and there’s a pattern I keep seeing.\nBasic bookkeeping is usually handled.\nBut when real decisions come up ,for example:\n-hiring or delaying a hire\n-expanding a team or pausing growth\n-increasing or cutting spend\n-pricing or packaging changes\n-committing to longer-term contracts or tools\n-deciding whether to extend runway or push growth\n-understanding what actually breaks if a plan doesn’t work\n…the numbers needed to answer those questions aren’t always immediately available or fully trusted.\nWhat often happens instead:\n-pulling data into Excel for the specific decision\n-rebuilding assumptions from scratch\nspending a lot of time validating that the numbers are actually correct\n-manually running scenarios\nstill feeling uncertain before making the call\nWhat should be a fairly straightforward decision can end up taking hours or days of spreadsheet work.\nI’m trying to better understand this in-between phase, after bookkeeping is in place, but before hiring dedicated finance help.\nI’m looking to work through a few real upcoming decisions with founders to understand how this is currently handled, where time gets spent, and what would actually make this easier in practice.\nIf this sounds familiar and you’re dealing with decisions around growth, spend, or runway, I’d be glad to connect and compare notes.",
          "score": 1,
          "created_utc": "2026-01-19 18:11:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0iw5uv",
          "author": "Big_Barracuda_6753",
          "text": "\n\nBuilding [wikiplease.com](http://wikiplease.com/)\n\nGet your custom chatbot in minutes powered by documents and websites , is a BYOK platform . Chatbot can be embedded to your own website as well :)",
          "score": 1,
          "created_utc": "2026-01-19 18:49:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0j5bgv",
          "author": "rohitdevd",
          "text": "[flashback cam](https://play.google.com/store/apps/details?id=com.rochapps.flashbackcam ) - A video recorder app which records past moments, basically it keeps upto 30 sec in the buffer and when something happens, you press record and save, it will include past 30 seconds and whatever happens next. No need to record everything and fill up storage just for 1 perfect moment.",
          "score": 1,
          "created_utc": "2026-01-19 19:30:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0j5j02",
          "author": "Kejbs",
          "text": "[Huddlekit](https://huddlekit.com) — Collect feedback on websites, images, PDFs, and videos all in one place",
          "score": 1,
          "created_utc": "2026-01-19 19:31:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0jbigz",
          "author": "missEves",
          "text": "[playmix](https://playmix.ai/animate) \\- create animated game sprites w/ ai 🏃‍♀️",
          "score": 1,
          "created_utc": "2026-01-19 19:59:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0jn9tv",
          "author": "Worried_Cap5180",
          "text": "Fun football score prediction game to play with your friends https://fulltimescore.pro",
          "score": 1,
          "created_utc": "2026-01-19 20:54:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0jvuvr",
          "author": "Responsible-Brick881",
          "text": "Irish start-up here -  [visty.io](https://www.visty.io/) - we are a new growth company for brands that sits somehwhere betwren adtech and martech. \nIts what I call \"Attention as a Service\" infrastructure. \n\nPut simply, we help growing brands deploy their video assets in the places that are shown to capture the highest levels of attention - premium publishers such as The New York Times, GQ, Vogue, Washington Post, etc.\n\nI've taken my decades+ experience of working in adtech, and used it to cram a customers brand into the type of places they want to be seen - where user attention is high, on the sites they trust and love, and using the formats that work.\n\nStrangely enough, while my initial ICP was very much focused on DTC brands, I've seen quite a lot of interest from growing SaaS businesses. The set up actually works across any vertical realistically but as I'm flying solo for now I needed to keep a tight focus.\n\nI'm also breaking the traditional model by offering this in a simple, monthly subscription model, each tier with a guaranteed number of completed views.\n\nExciting but equally daunting at the same time! \n\nCurrently building in public on LinkedIn so feel free to follow along!\n\nOpen to any and all feedback!\nCheers \nRonan",
          "score": 1,
          "created_utc": "2026-01-19 21:36:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0jxj8i",
          "author": "jundymek",
          "text": "Continuing work on **FakerFill** this week — polishing the template system and making form testing faster for devs and QA.\n\n[https://www.fakerfill.com](https://www.fakerfill.com)",
          "score": 1,
          "created_utc": "2026-01-19 21:44:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0k74i3",
          "author": "MORPHOICES",
          "text": "I am building a high-end AI tech system for solopreneurs & creators who want to create a structured digital product business with their knowledge without aimless guessing and runtime duct-taping of tools & burning-out.\n\nIt is a comprehensive framework for prompt and workflow design, automation, launch, and all plug-and-play.\n\nAs it’s still in beta, we’re validating with early builders who want leverage, not hustle. \\~",
          "score": 1,
          "created_utc": "2026-01-19 22:31:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0k8mp0",
          "author": "palex-david",
          "text": "I just launched [Palex](https://getpalex.com), a social app for physical book lovers. Think “Goodreads meets your actual bookshelf,” with friends, swaps, and discovery built in.\n\nLive now: [PeerPush](https://peerpush.net/p/palex)\n\nGoing live Tuesday on [Product Hunt](https://www.producthunt.com/products/palex?launch=palex-2)\n\n[App Store](https://apps.apple.com/us/app/palex-library/id6743680989)\n\nIf you’re curious about the tech, App Store review process, or product decisions, ask away. Any support is greatly appreciated.",
          "score": 1,
          "created_utc": "2026-01-19 22:38:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0l1mnf",
          "author": "zak_fuzzelogic",
          "text": "https://treeto.app ..imagine if a business card, calendly and linktree all got together .... this it what you'd get..\n\nA business card that allows you to share your links, drive traffic and take bookings.",
          "score": 1,
          "created_utc": "2026-01-20 01:14:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0lg3ce",
          "author": "kamscruz",
          "text": "A simple AI writing tool [SHRP](https://shrp.app)",
          "score": 1,
          "created_utc": "2026-01-20 02:33:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0mhh9s",
          "author": "ErmJustSaying",
          "text": "[Rooki](https://rooki.ai) — finds relevant X conversations in your niche and drafts replies in your voice.                    \n\nBuilt it because I wanted X growth without spending hours doom-scrolling for threads to engage with.",
          "score": 1,
          "created_utc": "2026-01-20 06:32:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0nq6cs",
          "author": "Master_Armadillo7872",
          "text": "I've been working on Taskosaur - an open-source project management tool that lets you manage tasks through natural language commands instead of clicking through menus. So like \"create sprint with all open bugs\" and it just does it.\n\nTrying to make PM less tedious for small teams. Self-hosted, so no per-user costs.\n\nYour deep linking tool sounds interesting - the app vs browser friction is real for conversions.",
          "score": 1,
          "created_utc": "2026-01-20 12:55:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ia5t4",
          "author": "greyzor7",
          "text": "Building an all-in-one pack for founders who want more than \"just another launch\"\n\nLaunch, reach 30k+ makers, get users & customers - [microlaunch.net/premium](http://microlaunch.net/premium)\n\nLifetime, auto-distribution, marketplace spots, 700+ customers so far.",
          "score": 1,
          "created_utc": "2026-01-19 17:11:28",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qgbi2m",
      "title": "Validating an idea: all in one event software vs stitching multiple tools together",
      "subreddit": "Startup_Ideas",
      "url": "https://www.reddit.com/r/Startup_Ideas/comments/1qgbi2m/validating_an_idea_all_in_one_event_software_vs/",
      "author": "Walsh_Tracy",
      "created_utc": "2026-01-18 15:30:40",
      "score": 17,
      "num_comments": 10,
      "upvote_ratio": 0.96,
      "text": "I’m exploring an idea in the event tech space and wanted some honest feedback before going any further.\n\nThe core question is whether event organizers actually want an all-in-one platform, or if they’re generally happy stitching together separate tools for registration, event apps, check-in, badges, and reporting.\n\nFrom what I’ve seen, a lot of teams start with multiple tools because they look flexible, but over time they run into issues around data mismatch, on-site friction, and post-event reporting.\n\nThere are already products in this space (Eventify being one example), but I’m curious from a founder / operator perspective:\n\nIs consolidation really a strong pain point?\n\nOr do organizers prefer best-of-breed tools even if ops gets messy?\n\nIf you’ve worked on events, event tech, or SaaS for operations-heavy industries, I’d love to hear how you think about this.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Startup_Ideas/comments/1qgbi2m/validating_an_idea_all_in_one_event_software_vs/",
      "domain": "self.Startup_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o0azunp",
          "author": "kubrador",
          "text": "the \"we'll just integrate everything\" phase lasts about 2 events before someone's checking in attendees on a spreadsheet at 8am while the app shows different numbers. consolidation isn't a nice-to-have, it's what happens when reality hits.\n\nthat said, eventify exists, so you'd need to actually talk to event planners about why they're NOT using it before building the same thing again.",
          "score": 1,
          "created_utc": "2026-01-18 15:38:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0b0ar2",
          "author": "Hudson_109",
          "text": "From a startup angle, I think the pain usually shows up later. Early on, teams tolerate multiple tools. Once events scale or become repeatable, operational friction becomes impossible to ignore. That’s usually when consolidation starts to make sense.",
          "score": 1,
          "created_utc": "2026-01-18 15:40:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0b0rm9",
          "author": "better6523",
          "text": "I’d argue it depends on the customer. Enterprise teams with dedicated ops and IT often prefer separate tools. Smaller or mid-sized teams usually want fewer moving parts, even if it means giving up some advanced features.",
          "score": 1,
          "created_utc": "2026-01-18 15:42:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0b1a55",
          "author": "Landyn_4682",
          "text": "What’s interesting is that some platforms in this space seem to succeed not because they’re more powerful, but because they reduce coordination cost. Tools like Eventify feel positioned around execution simplicity rather than feature depth, which probably resonates with teams that don’t want to build custom stacks.",
          "score": 1,
          "created_utc": "2026-01-18 15:44:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0bgpe7",
          "author": "No-Swimmer-2777",
          "text": "I built [Ideaproof.io](http://Ideaproof.io) exactly for this reason: in just a few clicks, you can get a complete, launch-ready startup package.",
          "score": 1,
          "created_utc": "2026-01-18 16:58:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0cgaop",
          "author": "TechExactly-",
          "text": "Small organizers love \"best-of-breed\" because they want the slickest registration page and they do not mind a little manual work.\n\nBut once you hit a certain scale, the \"CSV export/import dance\" would end up becoming a liability. The moment a VIP can't check in because the badge printer didn't sync with the registration tool instantly, that organizer will beg for an All-in-One solution.",
          "score": 1,
          "created_utc": "2026-01-18 19:45:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0f4j1w",
          "author": "Severe_Promise717",
          "text": "i ran events for a bit and learned this the hard way  \nteams say they want flexible tools  \nbut what they actually want is one source of truth\n\nstitching works early  \nthen someone changes a field name and everything breaks on site  \nthat pain only shows up when it matters most\n\nthe insight that stuck with me was ops pain compounds quietly and explodes publicly  \ni later saw it framed clean while fixing my own workflow [here](https://NoFluffWisdom.com/Subscribe) and it matched exactly\n\nsell fewer handoffs  \nnot more features",
          "score": 1,
          "created_utc": "2026-01-19 04:13:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0gkizz",
          "author": "coffeeebrain",
          "text": "talk to event organizers before building anything. seriously. i've seen so many founders build \"all in one\" tools that nobody wanted because they assumed consolidation was the pain point.\n\nthe real answer is probably: it depends on event size and type. small events might want simplicity. big corporate events might need specialized tools that integrate. you won't know until you actually ask.\n\nfor validation i'd interview like 15-20 event organizers. ask them to walk through their last event setup - what tools they used, where things broke, what was annoying. don't pitch your idea, just listen.\n\nrecruiting event organizers for interviews can be tricky since they're busy. i've used [cleverx](https://cleverx.com/) when i need to talk to specific b2b folks quickly - they manually verify people so you actually get real event planners, not randos claiming to be. helpful for fast validation when you're trying to figure out if an idea has legs.\n\nbut yeah, don't assume consolidation is the answer. might be integration, might be better reporting, might be something else entirely. let the research tell you.",
          "score": 1,
          "created_utc": "2026-01-19 11:32:23",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qggfv9",
      "title": "Startup ideas, late-night brainstorming & building something real",
      "subreddit": "Startup_Ideas",
      "url": "https://www.reddit.com/r/Startup_Ideas/comments/1qggfv9/startup_ideas_latenight_brainstorming_building/",
      "author": "OkCar8684",
      "created_utc": "2026-01-18 18:35:58",
      "score": 16,
      "num_comments": 12,
      "upvote_ratio": 1.0,
      "text": "I’m thinking of starting a startup and I’m pretty open when it comes to ideas. It could be anything exciting and worth building. I’m looking to connect with someone who’s curious, and enjoys brainstorming. If you’re interested in exploring ideas together and possibly building something as co-founders, let’s have a chat and see where it goes.\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Startup_Ideas/comments/1qggfv9/startup_ideas_latenight_brainstorming_building/",
      "domain": "self.Startup_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o0cmk6r",
          "author": "Tom_Tha",
          "text": "Hi. Who are you? Where do you live? What you can do? Tell about yourself.",
          "score": 5,
          "created_utc": "2026-01-18 20:15:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0g567j",
          "author": "Kejbs",
          "text": "[Huddlekit](https://huddlekit.com) — Collect visual feedback on websites, images, PDFs, and videos all in one place",
          "score": 1,
          "created_utc": "2026-01-19 09:11:01",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qitswm",
      "title": "My learning app got its first paid users.",
      "subreddit": "Startup_Ideas",
      "url": "https://www.reddit.com/r/Startup_Ideas/comments/1qitswm/my_learning_app_got_its_first_paid_users/",
      "author": "mindsnackapp",
      "created_utc": "2026-01-21 09:52:09",
      "score": 15,
      "num_comments": 8,
      "upvote_ratio": 0.9,
      "text": "Not gonna lie, when I saw the first person pay for my app - Mindsnack. I almost cried lol.\n\nBackstory: I built this cause I was tired of buying productivity books and retaining nothing. Spent money on courses I never finished. My brain just cant handle long content anymore.\n\nSo I made a 2-min micro-learning app that teaches meta life skills. Communication, confidence, decision making, career growth - stuff you need everyday but nobody teaches.\n\nThe difference is it explains the psychology FIRST (why you procrastinate, why you avoid conflict) then gives you solutions. \n\nSo you actually understand whats happening instead of just following tips.\n\nLaunched last month. Got a few paid users. Now I need to know if this is actually valuable or if I just got lucky.\n\nBig ask: Would love if you guys could download it and leave honest App Store reviews. Need real feedback from people who aren't my friends lol.\n\nGood reviews, bad reviews, whatever - I just need data to know if I should keep building this or pivot.\n\nLink in comments. Appreciate anyone who takes the time.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Startup_Ideas/comments/1qitswm/my_learning_app_got_its_first_paid_users/",
      "domain": "self.Startup_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o0tv37e",
          "author": "mindsnackapp",
          "text": "Here is the link to try it out - https://apps.apple.com/us/app/mindsnack-daily-microlearning/id6752513248",
          "score": 3,
          "created_utc": "2026-01-21 09:52:58",
          "is_submitter": true,
          "replies": []
        }
      ]
    },
    {
      "id": "1qf6oni",
      "title": "I kept failing at problem validation, so I built a framework",
      "subreddit": "Startup_Ideas",
      "url": "https://www.reddit.com/r/Startup_Ideas/comments/1qf6oni/i_kept_failing_at_problem_validation_so_i_built_a/",
      "author": "GEEKGEEEK",
      "created_utc": "2026-01-17 07:14:21",
      "score": 14,
      "num_comments": 8,
      "upvote_ratio": 1.0,
      "text": "I realized something after killing (or worse, building) too many ideas.\n\nMost of my failures didn’t come from bad execution.  \nThey came from **picking problems that sounded good but didn’t actually change behavior**.\n\nSo I stopped asking *“Is this a good idea?”*  \nand built a simple framework to ask better questions *before* building.\n\nJUST COPY IT AND ASK AI\n\n\\-----------------\n\n# ❌ A Problem Validation Framework to Avoid Failing Again\n\n|Step|Framework|Key Question|Pass (YES)|Fail (NO)|\n|:-|:-|:-|:-|:-|\n|1|**Behavior Shift**|Does this actually change what the user does **today**?|Users take actions they didn’t before (logs, check-ins, public status)|It just feels good / creates agreement|\n|2|**Failure Cost**|If they don’t use this, **what do they actually lose**?|Time, money, exams, opportunities, reputation|“It’s a bit disappointing”|\n|3|**Replacement**|Are people already solving this **in a clumsy way**?|Spreadsheets, Reddit, calendars, manual notes|Nobody is doing anything|\n|4|**Escape Resistance**|If users drop off, does **anything happen**?|Failure is recorded / progress stalls publicly|They can just leave|\n|5|**Repeat Pressure**|Does this problem **repeat regularly**?|Daily or weekly|One-time problem|\n|6|**Life Impact**|Without this, would they **fail again next week for the same reason**?|YES|NO|\n\n# 🔴 Instant Disqualifiers (Auto-Fail)\n\n* “Nice-to-have” ideas\n* Dating / swipe-style matching\n* Pure connection without structure\n* Zero cost to quit (ghosting is inevitable)\n* Easy to explain, no observable behavior change\n\n# 🟢 Signals a Problem Might Be Real\n\n* People already use annoying workarounds\n* The same failure keeps repeating\n* Not using it visibly stops progress\n* Users say: *“This is uncomfortable, but necessary”*\n\n# Final filter (the only one that really matters)\n\n>\n\nIf the answer is **NO**,  \nit’s probably a feature — not a product.\n\n\\---------------------\n\n# If you want to use this:\n\n**You can literally copy this framework and ask an AI (CHATGPT) (or yourself):**\n\n>“Evaluate my idea based on this framework, step by step, and be brutally honest.”\n\nThat’s what I do now — and it’s saved me from building a lot of useless things.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Startup_Ideas/comments/1qf6oni/i_kept_failing_at_problem_validation_so_i_built_a/",
      "domain": "self.Startup_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o02k4vh",
          "author": "shohan4556",
          "text": "Thank you for the framework",
          "score": 0,
          "created_utc": "2026-01-17 07:45:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o04griv",
          "author": "Necessary_Pay717",
          "text": "This is really good!\n\nAre you actively running discovery calls? How many calls do you think are enough to validate idea / problem?",
          "score": 0,
          "created_utc": "2026-01-17 16:00:22",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qjn9a4",
      "title": "Exploring a startup idea: Can speed + free design make print relevant again for local businesses?",
      "subreddit": "Startup_Ideas",
      "url": "/r/u_Less-Benefit908/comments/1qjn91c/exploring_a_startup_idea_can_speed_free_design/",
      "author": "Less-Benefit908",
      "created_utc": "2026-01-22 06:35:03",
      "score": 14,
      "num_comments": 9,
      "upvote_ratio": 1.0,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Startup_Ideas/comments/1qjn9a4/exploring_a_startup_idea_can_speed_free_design/",
      "domain": "",
      "is_self": false,
      "comments": [
        {
          "id": "o10zlmz",
          "author": "sjamesparsonsjr",
          "text": "I don’t think so.  The real **value** is in human touch.  The more white glove treatment a potential customer gets the better.  Speed + free design sounds like more noise and spam.",
          "score": 1,
          "created_utc": "2026-01-22 11:08:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o11ulrg",
              "author": "ChristianKl",
              "text": "Anything were there's currently a lot of value in human touch has the potential of AI solving the issue in a way that produces acceptable replacements for human touch.",
              "score": 1,
              "created_utc": "2026-01-22 14:24:51",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o11vh14",
                  "author": "sjamesparsonsjr",
                  "text": "You are very correct, but then it looses its value.",
                  "score": 1,
                  "created_utc": "2026-01-22 14:29:21",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qepcx3",
      "title": "I'll build your idea into a fully functional web app in 4 weeks",
      "subreddit": "Startup_Ideas",
      "url": "https://www.reddit.com/r/Startup_Ideas/comments/1qepcx3/ill_build_your_idea_into_a_fully_functional_web/",
      "author": "Naive-Wallaby9534",
      "created_utc": "2026-01-16 19:17:26",
      "score": 13,
      "num_comments": 21,
      "upvote_ratio": 0.89,
      "text": "I have been developing web/mobile apps for 3+ years now, and have built multiple products for myself and for clients, some of which have customers and users and are running in production.\n\nI have an agency where we have now completed around 3 projects for clients, with great reviews and full client satisfaction.\n\nThis month I am looking for more products to build, so if you have an idea which you want to get built, hit me up for a quick chat, I'll discuss all the details with you and would be happy to hop on a call.\n\nLooking forward ;)",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Startup_Ideas/comments/1qepcx3/ill_build_your_idea_into_a_fully_functional_web/",
      "domain": "self.Startup_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o04z7i8",
          "author": "famsy45",
          "text": "Do you have a website or reference you can share for the web apps you've developed.",
          "score": 2,
          "created_utc": "2026-01-17 17:26:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o04zcpd",
              "author": "Naive-Wallaby9534",
              "text": "Sure check DMs",
              "score": 1,
              "created_utc": "2026-01-17 17:27:24",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o06fnyk",
          "author": "No_Chipmunk_3894",
          "text": "I'd be interested too, can you send me some details via DM?",
          "score": 1,
          "created_utc": "2026-01-17 21:41:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o06pgoq",
              "author": "Naive-Wallaby9534",
              "text": "Hey sure! Check DMs",
              "score": 1,
              "created_utc": "2026-01-17 22:30:01",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0gbig7",
          "author": "Rizz_Pineapple",
          "text": "Show your work",
          "score": 1,
          "created_utc": "2026-01-19 10:11:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0gh43k",
              "author": "Naive-Wallaby9534",
              "text": "Hey! sent you a DM",
              "score": 1,
              "created_utc": "2026-01-19 11:02:24",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0oqtul",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-20 16:07:04",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qhwuw4",
      "title": "Skipped validation, built for 3 months, spent $2K on ads. $0 revenue. Thinking about what I should've done instead.",
      "subreddit": "Startup_Ideas",
      "url": "https://www.reddit.com/r/Startup_Ideas/comments/1qhwuw4/skipped_validation_built_for_3_months_spent_2k_on/",
      "author": "Dry_Marzipan_818",
      "created_utc": "2026-01-20 09:44:56",
      "score": 13,
      "num_comments": 22,
      "upvote_ratio": 0.93,
      "text": "No interviews. No validation. Just built it and shipped.\n\n3 months building + $2K in ads + 3 months marketing it = 0 customers.\n\n**Now I'm sitting here thinking:**\n\nWhat if I'd spent that $2K differently? Like... paying someone to actually validate the idea properly BEFORE I wasted 3 months building?\n\nI hate doing validation myself. I don't know how to find the right people to talk to.\n\nBut what if someone else did it? Like spent 1-2 weeks, talked to real potential customers, tested pricing, checked competition, and came back with \"build this\" or \"don't waste your time\"?\n\n**Random thought:** Would spending like $1K on that have been smarter than spending $2K on ads for something nobody wants? Should i do that next time, like would you do it?\n\nOr is that just me trying to outsource the hard part I should learn myself?\n\nGenuinely curious if anyone's done something like this or if it's a stupid idea.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Startup_Ideas/comments/1qhwuw4/skipped_validation_built_for_3_months_spent_2k_on/",
      "domain": "self.Startup_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o0n82wi",
          "author": "audiodesigndan",
          "text": "\"What if I'd spent that $2K differently? Like... paying someone to actually validate the idea properly BEFORE I wasted 3 months building?\n\nI hate doing validation myself.\"\n\n  \nif you don't want to do that you probably shouldn't found a company.",
          "score": 7,
          "created_utc": "2026-01-20 10:34:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0n30d1",
          "author": "Dry_Marzipan_818",
          "text": "And should i pay for the first 100 potential customers? Would it be a good investment?",
          "score": 2,
          "created_utc": "2026-01-20 09:48:11",
          "is_submitter": true,
          "replies": [
            {
              "id": "o0nqi44",
              "author": "ArtemLocal",
              "text": "Paying for access to people is fine. Paying for people who pretend to care is not. If pay for the first 100 means incentives to talk, test, or try, that can work. If it means buying traffic or forcing usage, you’ll get noise again. Early users should hurt a bit to find. That friction filters for real demand.\n\nThe better investment is paying to reach the right 10 people who already have the problem and budget, not 100 random ones. What would those first users replace if they adopted your product tomorrow?",
              "score": 2,
              "created_utc": "2026-01-20 12:57:07",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o0n92ml",
              "author": "danainto",
              "text": "Now you may have a solution but people don’t have a problem so I would not spend extra money until theres proof from organic traffic. It’s hard but you have to be comfortable doing that distribution work yourself or find a partner that can do it for you.",
              "score": 1,
              "created_utc": "2026-01-20 10:43:47",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0n5exs",
          "author": "Nuocho",
          "text": "Will you actually understand your customers needs if you send someone else to do it and just report back?",
          "score": 2,
          "created_utc": "2026-01-20 10:10:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0n5sjt",
          "author": "Fantom3D",
          "text": "Probably you had to validate it first. Or you need a guy who knows how to do ads.\nI’ve been there, coding for coding is great, but that’s not how you make money.",
          "score": 2,
          "created_utc": "2026-01-20 10:14:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0n5t9t",
          "author": "Celestial_Lee",
          "text": "\\*Not\\* skip validation?\n\nA lot of people jump into coding something out and think that's it. On the technical side, outside of coding, you have testing (so that you can verify everything works, and the project is maintainable) and devops (deploying your code where people can use it). Coding your app is about 1/5th of the technical side. The technical side is half the game. That's why you have a CEO and a CTO. The other half is business. The business side includes validation and marketing.\n\nI just want to help you put it in perspective.\n\nMy playbook is to first validate the idea to some degree - do similar things exist and how much competition is there. If they exist, then you can research those companies and get an objective idea money and effort wise.\n\nIf you think there's a gap \\*and it's something you're interested in pursuing\\* (who's motivated to do something they aren't interested in?), then you build a website that is just a single page - it should describe your \"thing\" and what it does. It should have a \"register interest\" form which is a great proxy for whether or not there is interest. This should cost you about $10-20 at this point.\n\nThen, you find your community and you get involved - talk to people, see what they think, revisit your assumptions and refine your idea.\n\nThen once you have a solid idea of \\*what\\* to build, you setup your code environment with git, linting rules and a CI/CD pipeline. You write tests for what you thing should be doing, then you build that functionality and document it. Then you lint, then you add to git, and viola - it's online.",
          "score": 1,
          "created_utc": "2026-01-20 10:14:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0nfyyj",
          "author": "kubrador",
          "text": "you're asking if you should've paid someone to tell you \"nobody wants this\" instead of learning it for free by building it. that's the whole lesson you just paid $2k tuition for.\n\nnext time just ask 20 random people if they'd use it before you write a single line of code.",
          "score": 1,
          "created_utc": "2026-01-20 11:42:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ng3um",
          "author": "Kazumz",
          "text": "Skipped validation. \n\nFailed. \n\nAsks why it failed. \n\n😨",
          "score": 1,
          "created_utc": "2026-01-20 11:43:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0nhvw1",
          "author": "nishant032",
          "text": "Early beta testers that provide early feedback are the game changer. We're building r/betatests for that",
          "score": 1,
          "created_utc": "2026-01-20 11:56:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0r1cnz",
              "author": "Chicken_Brai",
              "text": "This is cool. Thanks. Yeah we are looking for beta testers for our new features released this week. \n\nwonprompt.ai",
              "score": 2,
              "created_utc": "2026-01-20 22:27:38",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0nn7b8",
          "author": "kawaiian",
          "text": "You need to solve a problem. You need to do your own validation.",
          "score": 1,
          "created_utc": "2026-01-20 12:35:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0npplo",
          "author": "ArtemLocal",
          "text": "You didn’t fail because you skipped validation. You failed because you skipped contact with buyers. Paying someone to interview people can work, but only if they talk to the exact buyer and ask uncomfortable questions about money and switching costs. Most validation stops at opinions.\n\nThe hard part is not the calls. It’s hearing I wouldn’t pay for that and not rationalizing it away. I’d still do a lightweight version myself first. Ten short conversations beats any report.\n\nWhat were people actually doing instead of your product when you ran the ads?",
          "score": 1,
          "created_utc": "2026-01-20 12:52:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ouuyr",
          "author": "MORPHOICES",
          "text": "I have experienced both skipping validation and over-correcting, and the uncomfortable truth I landed on is: outsourcing validation only works if you already know what “good signals” look like. \\~ \n\nPaying someone $1K to talk to users saves time but does not eliminate the core risk of misinterpreting polite interest as demand. Many validation reports return “people liked it” or “they’d maybe pay,” which sets you up for a build trap without fail.\n\nWhat I would do now as a default (and wish I would’ve done instead).\n\nI cannot escape a more strict validation loop. \n\n1. You should make users signup for a behavior not an opinion. For example, create an email signup with a promise, a pre-order, or a “join waitlist for $X”. Even a fake Stripe link tells you more than interviews.\n\n2. Use one channel for one person, not broadly find people. Choose a platform where they regularly express their complaints, such as Reddit, Slack groups, or niche Twitter.\n\n3. Say the price before the pitch. Anyone who stays engaged after that is signal.\n\n4. Cap the experiment. Seven to ten days, fixed effort. You cease if nothing moves.\n\nCan you outsource part of this?  Certainly! I take thorough notes when I recruit people. However, I would still allow you to frame, question and make decisions.\n\nIt hurts when your ads fail, but at least they gave you a clear answer. Validation is more affordable, but only when it is formulated to conduct a “yes or no” test rather than a vibe check.",
          "score": 1,
          "created_utc": "2026-01-20 16:25:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0q3xot",
          "author": "ScrbblerG",
          "text": "Sorry to hear this. Many founders going through the same thing. It's never too late to do strategy. Free advice: Do a competitive analysis of all direct competitors, substitutes and alternatives. I use a mindmap to do so. I put the three major messages on their website in blocks under each one. Strategy is usually communicated via messaging. How is your strategy differentiated? How does that play out in product. Also, do a 'brand ladder' or other simiilar analysis. Deeply interrogate your ideal customer and what their pain is and isn't. Who are they? What are their affinities and psychology? Etc. This exercise usually yields immense insight and often has founders pivot significantly pre-product.",
          "score": 1,
          "created_utc": "2026-01-20 19:51:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0qnimu",
          "author": "shaikhuu",
          "text": "What did you build?",
          "score": 1,
          "created_utc": "2026-01-20 21:22:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0r0klt",
          "author": "_Werka_",
          "text": "You believed in your product so you know pain points. Search questions your product can solve on socials and engage with your potential users. Find out where your users are. \n\nMake your website/ product page shine, create videos, product spotlight. \n\nMake marketing plan. Make organic posts, analyze your field post standards and copy what works. If you are camera shy search small content creators that could make short films for $10 each, that you could have some volume and repost them to build community.  \n \nUsually the first 3 months are for warmup, the most successful market for a year before they hit. The overnight success stories are not the rule. So keep going and good luck",
          "score": 1,
          "created_utc": "2026-01-20 22:23:44",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qjj5v7",
      "title": "Let’s Validate Each Other’s Ideas!",
      "subreddit": "Startup_Ideas",
      "url": "https://www.reddit.com/r/Startup_Ideas/comments/1qjj5v7/lets_validate_each_others_ideas/",
      "author": "Mammoth-Shower-5137",
      "created_utc": "2026-01-22 03:12:08",
      "score": 13,
      "num_comments": 80,
      "upvote_ratio": 1.0,
      "text": "**Drop what you’re building right now - startup, product, or side project - and how you’re getting users.**\n\nLet’s discover, support, and learn from each other.\n\nI’ll go first   \nI’m building [Rixly ](https://www.userixly.com/)\\-  a Reddit intelligence tool that helps founders find warm leads & their next 100 sales by analysing Reddit conversations.\n\nBuilding in public, shipping fast, sharing learnings openly, and improving the product based on community feedback.\n\nYour turn - what are you building and how are you putting it in front of people?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Startup_Ideas/comments/1qjj5v7/lets_validate_each_others_ideas/",
      "domain": "self.Startup_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o10ovvh",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 3,
          "created_utc": "2026-01-22 09:31:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1207hr",
              "author": "Mammoth-Shower-5137",
              "text": "how are you marketing it bro??",
              "score": 1,
              "created_utc": "2026-01-22 14:53:15",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o12go1k",
                  "author": "Able-Exercise6034",
                  "text": "I did not do any ads. I only shared in here and a few fb groups.",
                  "score": 2,
                  "created_utc": "2026-01-22 16:10:33",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o10xq0g",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 3,
          "created_utc": "2026-01-22 10:52:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o136kxy",
              "author": "Mammoth-Shower-5137",
              "text": "great concept, how is it going now?",
              "score": 1,
              "created_utc": "2026-01-22 18:06:48",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o13dub9",
                  "author": "Every_Box5920",
                  "text": "Very ok ish tbh",
                  "score": 1,
                  "created_utc": "2026-01-22 18:38:38",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o10audh",
          "author": "im_here_now_king",
          "text": "I'm building a platform to verify influencer credentials",
          "score": 2,
          "created_utc": "2026-01-22 07:21:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o120e85",
              "author": "Mammoth-Shower-5137",
              "text": "drop the link mate",
              "score": 1,
              "created_utc": "2026-01-22 14:54:10",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o10xim5",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 2,
          "created_utc": "2026-01-22 10:50:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o13dx7i",
              "author": "Mammoth-Shower-5137",
              "text": "great idea",
              "score": 1,
              "created_utc": "2026-01-22 18:38:59",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o14w9oh",
                  "author": "nauman_arshad",
                  "text": "Thanks. Do check the landing page if you have some time. Would love to get more thoughts on it.",
                  "score": 1,
                  "created_utc": "2026-01-22 22:58:48",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o12roln",
          "author": "AboboMutombo",
          "text": "I'm building [ComixCatalog](http://www.comixcatalog.com) which will do for comic book collectors what Reverb did for musicians and Discogs did for vinyl collectors. Trying to turn this into my first full time software role following completion of my Masters Degree in Software Engineering!\n\nComixCatalog will be an exhaustive database and truly useful marketplace that includes comic grading, marketplace metrics, and more to be the one true tool for those who want to buy, sell, and discover comics new and old.",
          "score": 2,
          "created_utc": "2026-01-22 16:59:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o139bzb",
              "author": "Mammoth-Shower-5137",
              "text": "how big is its market?",
              "score": 1,
              "created_utc": "2026-01-22 18:18:56",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o12vfvz",
          "author": "Desir-Arman07",
          "text": "I’m building [**Lumina**](https://luminajobs.vercel.app/) \\- A \"no-nonsense\" job search engine for India that kills the \"Google → LinkedIn → Naukri\" spam loop.\n\n Indian job seekers waste hours hopping between aggregators, only to find expired listings, \"Easy Apply\" black holes, or spammy consultancy posts.\n\n**The Fix:** I built a backend that scans official company career pages to index **only direct application links** (Workday, Taleo, etc.).\n\n* **No Middlemen:** You search, click 'Apply,' and land on the company's official form instantly.\n* **No Fake Jobs:** If it's not on the company site, it's not on Lumina.\n\n**Status:** Early MVP with **\\~2,300 active jobs**. I’m a solo dev shipping updates daily to fix bugs and improve the UI.",
          "score": 2,
          "created_utc": "2026-01-22 17:16:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o138u76",
              "author": "Mammoth-Shower-5137",
              "text": "for an mvp the number is pretty great.",
              "score": 2,
              "created_utc": "2026-01-22 18:16:48",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o139gro",
                  "author": "Desir-Arman07",
                  "text": "Thanks😁...Btw could you please give some insight on the site. What things I should add, remove and improve.",
                  "score": 1,
                  "created_utc": "2026-01-22 18:19:30",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o100n12",
          "author": "BonyCatButt",
          "text": "I'm in the process of building a tool to make music karaoke-style videos for youtube simple [https://www.showlark.com/](https://www.showlark.com/) It uses WebGPU and WebGL to render visualizations with overlaid lyrics and render playlists into video. Still early stages but curious if anyone would find this interesting/useful?",
          "score": 1,
          "created_utc": "2026-01-22 05:56:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o106jtk",
          "author": "OkBumblebee4151",
          "text": "I’m building a travel app. Still in the initial stage.",
          "score": 1,
          "created_utc": "2026-01-22 06:44:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o120ahs",
              "author": "Mammoth-Shower-5137",
              "text": "okay bro, all the best",
              "score": 1,
              "created_utc": "2026-01-22 14:53:39",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1074f0",
          "author": "jundymek",
          "text": "Working on **FakerFill** — a simple but powerful tool to speed up form testing for devs and QA teams.\n\n[https://www.fakerfill.com](https://www.fakerfill.com)",
          "score": 1,
          "created_utc": "2026-01-22 06:49:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o10er5a",
              "author": "[deleted]",
              "text": "[removed]",
              "score": 1,
              "created_utc": "2026-01-22 07:56:52",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o13e3zx",
              "author": "Mammoth-Shower-5137",
              "text": "congratulations",
              "score": 1,
              "created_utc": "2026-01-22 18:39:49",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o10vo0x",
          "author": "OmariBangs",
          "text": "I created [Brrow](https://brrowapp.com), a local marketplace where people can buy, sell, and borrow items from people nearby. The idea is to combine the convenience of Facebook Marketplace with better trust, cleaner UX, and features that actually help people find what they need instead of endlessly scrolling.\n\nCore features today:\n• Post items to sell, rent, or lend\n• A “Seek” system where users post what they’re looking for and local supply comes to them\n• Local discovery instead of algorithm spam\n• Built-in chat and safety-focused controls\n\nThe product is built and evolving quickly. If you’re open to it, I’m happy to share the pitch deck and give a short walkthrough.\n\n[Download](https://brrowapp.com/download) on the app store.",
          "score": 1,
          "created_utc": "2026-01-22 10:34:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o10w88b",
              "author": "onerookie",
              "text": "why does it feel so ai template? i feel like this was just another lovable web",
              "score": 2,
              "created_utc": "2026-01-22 10:39:28",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o10y3v7",
                  "author": "OmariBangs",
                  "text": "Try the app for yourself, I think it might change your mind :)\n\nEdit: I’ve also never used Lovable and had to search it up",
                  "score": 0,
                  "created_utc": "2026-01-22 10:55:49",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o13edgv",
          "author": "ali_bas",
          "text": "We all know the feeling of writing a text and never pressing send because it is too mean or hurtful but you wanna say it anyways because your ex deserves it. \nNow you can say out loud the text you will never send and finally let it go.\nI have built a platform [ex](https://meanthingstosaytoyourex.com/) where you can write the meanest things to your bad ex without being judged. \nYour ex cheated on you and you wanna let the frustration out you are welcomed or you want mean, insulting lines to send to your ex you can copy from the site.\nIt has features like venom meter which rates the venom in the post \nAlso a public pole where you can vote if the post is justified or too much\nAlso emotional marker telling how this post made you feel. \nI have also added a few sections like boss and hr if you want to vent about them.",
          "score": 1,
          "created_utc": "2026-01-22 18:40:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o13kttf",
          "author": "areyouamastervader",
          "text": "Bringing cash to online transactions.\n\nSave your cart and pick back up where you left off in a physical location and complete the transaction without having to provide your credit card information to websites.\n\nBuilding because there are a lot of times I have wanted to buy something online but I just don't trust the website enough to give them my card information.",
          "score": 1,
          "created_utc": "2026-01-22 19:09:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o13qamg",
          "author": "Nutorio",
          "text": "Building Glamore.ai — a fashion-only AI image tool.\n\nBig insight: fashion breaks generic AI.\nGarments need constraint, not creativity. Color accuracy, silhouettes, repeatability, SKU discipline — hallucinations kill trust.\n\nSo we ditched prompt-engineering and built fashion guardrails instead. Users choose fit, fabric, model type, and use-case. AI fills the gaps without inventing things.\n\nHow we’re getting users:\n\t•\tFree credits → force real usage, not demos\n\t•\tDirect outreach to D2C + marketplace sellers\n\t•\tFashion institute pilots (students break tools fast)\n\t•\tBuilding in public, iterating loudly\n\nEarly signal: replacing catalog shoots, not hero shoots.\nLong-term: vertical AIs for apparel, bags, footwear — one model won’t rule them all.\n\nCurious to hear thoughts from anyone building vertical AI or SaaS with hard constraints",
          "score": 1,
          "created_utc": "2026-01-22 19:34:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o167dl7",
          "author": "Full_Steak_9965",
          "text": "Building an AI-powered digital advertising and marketing saas.  Custom-implemented LLM's on the backend that strategize, implement, and optimize entire media campaigns from just a few prompts.  This isn't just a GPT-wrapper, it's fully built within AWS with a proprietary MCP setup so the strategy algorithm builds media plans completely around the user's data.  All outputs are wholly contextualized to the data a client brings in to our system.  I've built this after 12+ years in the industry and finding a lot of friction points in the brand / agency / publisher working relationship.\n\n[https://adres.ai](https://adres.ai)\n\nIf you want a demo send me a DM!",
          "score": 1,
          "created_utc": "2026-01-23 03:14:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o10woa7",
          "author": "0x99H",
          "text": "I wanna build ai jr software developer",
          "score": 1,
          "created_utc": "2026-01-22 10:43:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o13914v",
              "author": "Mammoth-Shower-5137",
              "text": "great bro, ship fast.",
              "score": 1,
              "created_utc": "2026-01-22 18:17:38",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o10zj71",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-22 11:08:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o136rcg",
              "author": "Mammoth-Shower-5137",
              "text": "great stuff for education.",
              "score": 1,
              "created_utc": "2026-01-22 18:07:35",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o10znrt",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-22 11:09:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o136ytg",
              "author": "Mammoth-Shower-5137",
              "text": "go for it man",
              "score": 2,
              "created_utc": "2026-01-22 18:08:30",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o11iwz8",
          "author": "Obvious_Board4757",
          "text": "Im building in simple terms these Zomato for daily recurring meals I do have phased execution plan",
          "score": 1,
          "created_utc": "2026-01-22 13:22:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o137l4b",
              "author": "Mammoth-Shower-5137",
              "text": "Great, in which location are you guys operating?",
              "score": 1,
              "created_utc": "2026-01-22 18:11:14",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o137q9v",
                  "author": "Obvious_Board4757",
                  "text": "Chennai",
                  "score": 1,
                  "created_utc": "2026-01-22 18:11:52",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o11max9",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-22 13:41:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o137pda",
              "author": "Mammoth-Shower-5137",
              "text": "Its a great tool",
              "score": 1,
              "created_utc": "2026-01-22 18:11:45",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o13im83",
                  "author": "International-Hat529",
                  "text": "Thank you! Any feedback?",
                  "score": 1,
                  "created_utc": "2026-01-22 18:59:40",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o11qz6p",
          "author": "RudiMatt",
          "text": "I built an online interactive website for home schoolers to verify they have read books to meet their state requirements.",
          "score": 1,
          "created_utc": "2026-01-22 14:06:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o137t8q",
              "author": "Mammoth-Shower-5137",
              "text": "what is your website bro?",
              "score": 1,
              "created_utc": "2026-01-22 18:12:13",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o12li79",
          "author": "greyzor7",
          "text": "Building an all-in-one pack for founders who want more than \"just another launch\"\n\nLaunch, reach 30k+ makers, get users & customers - [microlaunch.net/premium](http://microlaunch.net/premium)\n\nLifetime, auto-distribution, marketplace spots, 700+ customers so far.",
          "score": 1,
          "created_utc": "2026-01-22 16:32:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o138ga5",
              "author": "Mammoth-Shower-5137",
              "text": "community-driven growth approach is amazing.",
              "score": 1,
              "created_utc": "2026-01-22 18:15:05",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o10zpnl",
          "author": "onerookie",
          "text": "this is such a quick ai website... why dont you guys use Aura prompts or tailwind prompts to beautify it?",
          "score": 0,
          "created_utc": "2026-01-22 11:09:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1377l5",
              "author": "Mammoth-Shower-5137",
              "text": "yes we are changing the website in few days.",
              "score": 1,
              "created_utc": "2026-01-22 18:09:34",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o111814",
          "author": "milanoa",
          "text": "Rokumino.com - note taking for sales people, with automations around.",
          "score": 0,
          "created_utc": "2026-01-22 11:22:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o137dli",
              "author": "Mammoth-Shower-5137",
              "text": "very helpful tool.",
              "score": 2,
              "created_utc": "2026-01-22 18:10:18",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o122wpc",
          "author": "arjanshoj",
          "text": "I’m currently building a platform/marketplace in Netherlands for connecting Performers(DJ) and Organisers (private or big) with each other. Its called [VybUp](https://vybup.nl/en/)",
          "score": 0,
          "created_utc": "2026-01-22 15:06:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1384av",
              "author": "Mammoth-Shower-5137",
              "text": "Great concept. How is it going now bro??",
              "score": 1,
              "created_utc": "2026-01-22 18:13:36",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qfdgks",
      "title": "I revived my dead app and grew it past 700 users!",
      "subreddit": "Startup_Ideas",
      "url": "https://www.reddit.com/r/Startup_Ideas/comments/1qfdgks/i_revived_my_dead_app_and_grew_it_past_700_users/",
      "author": "luis_411",
      "created_utc": "2026-01-17 13:39:39",
      "score": 11,
      "num_comments": 5,
      "upvote_ratio": 0.99,
      "text": "So I've built a platform where you can get your first users and their feedback for your app and it worked out pretty well from the start. I grew it to over 700 users simply by posting updates about it here on Reddit. There was only one thing casting a bit of a shadow on it: Lots of people would sign up but never actually upload an app or test another app. On top of that, I didn't have much time during the Christmas Holidays and so I didn't post for like two to three weeks and the platform basically went dead to the point where there were only like 10-20 visitors per day.\n\nHowever, to understand how I brought back life to the platform, you need to first understand how the platform works:\n\n* You can **earn credits** by testing indie apps (fun + you help other makers)\n* You can **use credits to get your own app tested by real people**\n* No fake accounts -> all testers are **real users**\n* Test more apps -> earn more credits -> your app will rank higher -> you get more visibility and more testers/users\n\nIt's called IndieAppCircle and you can check it out here: [https://www.indieappcircle.com/](https://www.indieappcircle.com/)\n\nAs a first step, I disabled the shop so now people can't buy credits anymore but they have to earn them which actually led to more testing engagement. Also, I implemented lots of small new features that were suggested under my posts and people instantly noticed and thanked me for it. Like for example being able to sort the apps by newness.\n\nI'm really curious where this will go. Of course, I currently don't earn any money but that's fine because I want to treat this more like a learning journey and I think the platform is more valuable for users and that will pay off in the long run!\n\nI would appreciate your feedback in the comments! Thank you for everyone who joined so far!",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Startup_Ideas/comments/1qfdgks/i_revived_my_dead_app_and_grew_it_past_700_users/",
      "domain": "self.Startup_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o03s6x4",
          "author": "practical_desiguy",
          "text": "Fantastic idea, and good execution. You can monetize it later.",
          "score": 3,
          "created_utc": "2026-01-17 13:53:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o03vewf",
              "author": "luis_411",
              "text": "Thanks man!",
              "score": 1,
              "created_utc": "2026-01-17 14:11:35",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o04ga7a",
          "author": "Necessary_Pay717",
          "text": "What are your core assumptions you are validating right now about the app?",
          "score": 2,
          "created_utc": "2026-01-17 15:58:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o04kdyd",
              "author": "luis_411",
              "text": "I mean the basic idea is validated at this point. I'm simply working on improving user engagement.",
              "score": 1,
              "created_utc": "2026-01-17 16:17:36",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qizutc",
      "title": "How I made $0 in one month with $0 ads",
      "subreddit": "Startup_Ideas",
      "url": "https://www.reddit.com/r/Startup_Ideas/comments/1qizutc/how_i_made_0_in_one_month_with_0_ads/",
      "author": "Mammoth-Shower-5137",
      "created_utc": "2026-01-21 14:49:36",
      "score": 10,
      "num_comments": 6,
      "upvote_ratio": 1.0,
      "text": "**Step 1:** Woke up motivated.  \n**Step 2:** Opened Reddit “just for 5 minutes.”  \n**Step 3:** Checked my bank account. Still $0. Respect.  \n**Step 4:** Thought about my life choices.  \n**Step 5:** Did absolutely nothing. Again.\n\nBut here’s the secret no guru tells you: I didn’t quit. I consistently showed up and did nothing every single day. That’s called discipline.\n\nSo if you’re broke, tired, and pretending to hustle while scrolling memes - you’re on the right path. Trust the process. One random day, that $0 might become $1. Or $1.23 if you’re lucky.\n\nDream big. Stay delusional. Success is just failing repeatedly until something accidentally works.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Startup_Ideas/comments/1qizutc/how_i_made_0_in_one_month_with_0_ads/",
      "domain": "self.Startup_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o0vf1q8",
          "author": "Routine_Cake_998",
          "text": "I did the same thing. And it worked. Don’t worry if your balance goes negative. You have to spend money to make money. It’s true, i read it somewhere.",
          "score": 2,
          "created_utc": "2026-01-21 15:47:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0z9w1l",
              "author": "Mammoth-Shower-5137",
              "text": "totally, i do the same.",
              "score": 2,
              "created_utc": "2026-01-22 03:00:26",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0wzqss",
          "author": "Ok-Information1819",
          "text": "Did you get taxed for huge earnings? 😂",
          "score": 1,
          "created_utc": "2026-01-21 19:59:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0z9syq",
              "author": "Mammoth-Shower-5137",
              "text": "yess bro...ohh no bro ...i am very poor",
              "score": 1,
              "created_utc": "2026-01-22 02:59:58",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qhsn1q",
      "title": "Harsh Truth About Startups in India: Most “Ideas” Are Just Fixed-Salary Mindsets in Disguise",
      "subreddit": "Startup_Ideas",
      "url": "https://www.reddit.com/r/Startup_Ideas/comments/1qhsn1q/harsh_truth_about_startups_in_india_most_ideas/",
      "author": "Quiet_Inspector8158",
      "created_utc": "2026-01-20 05:37:03",
      "score": 9,
      "num_comments": 0,
      "upvote_ratio": 0.91,
      "text": "I’ve spent a long time reading and observing startup discussions in Indian communities, and this post is not meant to discourage anyone. It’s simply an attempt to share patterns I’ve repeatedly seen, including mistakes I’ve personally made and learned from.\n\nMany startup ideas here are genuinely well intentioned, but they often come from a fixed-salary mindset rather than a business mindset. You can see this in how people approach risk, capital, and timelines. There is a strong desire to minimize uncertainty, start with almost no investment, and reach predictable income quickly. That’s understandable, especially given economic pressure, but it often clashes with how real businesses actually work.\n\nMost ideas are shaped by exposure rather than deep problem ownership. Engineers build tools similar to what they used at work. Professionals try to “simplify” platforms they interacted with. This isn’t wrong, but without strong domain depth or direct customer pain, these ideas struggle to move beyond prototypes.\n\nAnother common pattern is confusing online content consumption with market research. Reading Reddit posts, LinkedIn threads, or startup Twitter can be informative, but it doesn’t replace talking to customers, hearing objections, discussing pricing, or understanding buying behavior. Real research often feels uncomfortable and slow, which is why many people unconsciously avoid it.\n\nWhen ideas don’t work out, people often conclude that startups are not for everyone or that business is mostly luck. While those statements are partially true, they sometimes prevent deeper reflection on execution, sales effort, and cash flow planning.\n\nInterestingly, some of the most reliable businesses in India are not considered “startup ideas” at all. Sales operations, customer support services, call centers, compliance and back-office services continue to exist because they solve ongoing problems and generate consistent cash flow. They may not feel exciting, but they are grounded in demand.\n\nNone of this means app or SaaS ideas are bad. Many succeed. But they succeed when they are backed by patience, capital, sales capability, and willingness to adapt to reality rather than protect comfort.\n\nThis post isn’t about right or wrong choices. Employment is a valid path. Business is a different one. Confusion happens when we mix expectations from one world into the other.\n\nIf this helps even one person think more clearly before investing time or money, it has done its job.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Startup_Ideas/comments/1qhsn1q/harsh_truth_about_startups_in_india_most_ideas/",
      "domain": "self.Startup_Ideas",
      "is_self": true,
      "comments": []
    },
    {
      "id": "1qjxlq9",
      "title": "Made my first money online from the smallest side project I’ve built so far.",
      "subreddit": "Startup_Ideas",
      "url": "https://www.reddit.com/r/Startup_Ideas/comments/1qjxlq9/made_my_first_money_online_from_the_smallest_side/",
      "author": "Hefty-Airport2454",
      "created_utc": "2026-01-22 15:32:14",
      "score": 9,
      "num_comments": 2,
      "upvote_ratio": 1.0,
      "text": "On Sunday I hacked together a super simple, super cheap feedback widget for my own projects.  \nEverything I found was either buggy or 20–50$/month for basic stuff, so I shipped my own in a day and installed it on all my sites.\n\nPeople started using it too and my first sales came in.  \nNow it’s the side project that makes the most money for me, even though it began as a “for myself” tool and the code is nothing fancy.\n\nIt’s fun seeing people use the exact same widget I use on all my projects.\n\nThe tool is just one dollar, it's about feedback, guess the name : onedollarfeedback. Because that’s literally the deal: 1$/month per site.  \nIt’s so cheap that most people are too lazy to rebuild it / vibe coding it, and that’s the whole point.\n\nYou drop in the snippet, we host and maintain everything, and feedback is emails so I never have to check the webapp.  \nUsers already helped tweak the product with their own feedback, so you get a battle‑tested widget from day one.\n\nHappy to answer anything about pricing, stack, or how those first users showed up.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Startup_Ideas/comments/1qjxlq9/made_my_first_money_online_from_the_smallest_side/",
      "domain": "self.Startup_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o14iln6",
          "author": "Wenria",
          "text": "Yeah, can you tell more about how users found you?",
          "score": 1,
          "created_utc": "2026-01-22 21:47:09",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}