{
  "metadata": {
    "last_updated": "2026-01-25 08:55:26",
    "time_filter": "week",
    "subreddit": "startup",
    "total_items": 18,
    "total_comments": 156,
    "file_size_bytes": 167246
  },
  "items": [
    {
      "id": "1qhvwcs",
      "title": "How do you actually find the first user who's willing to try your product and talk to you?( I will not promote)",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qhvwcs/how_do_you_actually_find_the_first_user_whos/",
      "author": "Finaler0795",
      "created_utc": "2026-01-20 08:46:33",
      "score": 19,
      "num_comments": 71,
      "upvote_ratio": 0.92,
      "text": "I’m not frustrated because people hate my product, I’m frustrated because no one is willing to actually spend a few minutes using it and give honest feedback.\n\nOver the past few days, I’ve been actively trying to validate what I built:\n\n* Posting on X\n* Launching on Product Hunt\n* DMing people who *might* have a need (indie hackers, founders, even some investors)\n* Offering free pro access and clearly saying I’d iterate quickly based on their feedback\n\nStill, almost no one was willing to truly try it.\n\nSince I’m building a form tool, I created a survey asking potential beta users about their use cases and needs, and posted it to communities like SurveyExchange and SurveySwap.\n\nWhat I got instead:\n\n* Generic compliments with no substance\n* Very few real clicks\n* Clearly fake emails\n* Zero people who actually cared about the problem\n\nOn X, direct outreach hasn’t been much better either, mostly polite replies, or complete silence.\n\nSo now I’m genuinely asking:\n\nWhen you have no brand, no audience, and no social leverage,\n\n**where do you actually find your first user who’s willing to communicate with you**?\n\nIf you’ve been through this stage,\n\n**what channels or approaches actually worked for you**?\n\nLooking for real, experience-based answers 🙏Thanks for your time!",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1qhvwcs/how_do_you_actually_find_the_first_user_whos/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o0n0yp1",
          "author": "jonathanbrnd",
          "text": "Building a solid audience on X is a great way for that since there's a lot of early adopters there. The bigger your audience the more people will trust you and look at what you're building. If your site is good then it should naturally drive them to try your product. \n\nSo I'd recommend focusing on building a big following on X first and then the rest will follow.",
          "score": 16,
          "created_utc": "2026-01-20 09:28:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0n28le",
              "author": "Finaler0795",
              "text": "Thanks for the suggestion! My co-founder already has 10k followers on X, but we still struggle to find true seed users, most people just take a quick look and move on. It still feels hard to find people who have a real need and are willing to truly try.",
              "score": 3,
              "created_utc": "2026-01-20 09:40:49",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0nmfnf",
                  "author": "GateInevitable841",
                  "text": "Firstly you need to check where is your actual audience is active, then give your Beta users some extra add-ons or perks for using your platform as an early adopters. Also create quick guide videos to educate your users. Unless you add value or provide them a solution for their pain points they are not gonna use it. All the best.",
                  "score": 3,
                  "created_utc": "2026-01-20 12:30:00",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o0toodr",
                  "author": "jonathanbrnd",
                  "text": "Maybe the audience on X isn't good enough for a form tool. This is the type of product I guess would find its ICP on LinkedIn. You have kind of the same problem as me with my email marketing tool. X is fun but there is no real buying intent on it except for social media scheduling tools, X growth tools, or tools that really help get clients. \n\nYour tool is for later-stage companies so I'd suggest going on LinkedIn. I'm going to start posting regularly there too.",
                  "score": 2,
                  "created_utc": "2026-01-21 08:51:04",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0nua0q",
          "author": "PersonOfInterest007",
          "text": "Depends on the product. If it’s B2B, try to look up email addresses for a decision maker at a potential customer and send a personalized email. We have a product for use by very small businesses, and my partner just pounded the pavement walking into stores and talking to the manager or owner.\n\nIf it’s B2C, try joining a local Facebook group or meetup.\n\nAnd, again depending on your product, you really ideally want to get them to try the product live while you watch them use it to figure out what does and doesn’t work, whether they just get confused or can’t figure out what to do next.\n\nBasically, if broadcasting the existence of your product doesn’t bring people to you, go hunt them down. In a good way. :)",
          "score": 4,
          "created_utc": "2026-01-20 13:20:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0o0guo",
              "author": "Finaler0795",
              "text": "Thanks so much, this is super practical advice.",
              "score": 2,
              "created_utc": "2026-01-20 13:55:13",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0o15qu",
                  "author": "PersonOfInterest007",
                  "text": "You’re welcome.\n\nThere’s a lot of good free information on startups at Y combinator’s “Startup school.” And here’s one of their videos on getting the first customers: https://youtu.be/0kARDVL2nZg?si=bQUN76qoDTc6GhaN\n\nhttps://www.startupschool.org/",
                  "score": 3,
                  "created_utc": "2026-01-20 13:58:56",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0mxy4y",
          "author": "afernanrefa",
          "text": "I think you shouldn't be pitching your product for people to try. \n\nWhat you ought to do is guesstimate who the buyer is and then talk to those people about their problems as it relates to the problem you're solving. Don't even talk about your product at this time.\n\nJust listen to them and then update your product to address their problems (if it needs updating). \n\nThen reach out to them with your product and explain to them how it solves their problem.\n\nPeople are much more responsive to a \"hey, remember that issue you had? Here's the solution.\"\n\nvs. \"I built something random that might help you. Check it out.\"\n\nPeople will make 0 effort to do anything unless they're *sure* it will:\n\n- Save them a lot of time\n- Help them make more money than what they spend on your product\n- Provide them with worthwhile entertainment / connections \n- Teach them something they want to learn \n\nThat's it. Those are the main reasons people open their wallets. But they have to be sure it does. \n\n\"check this out\" does not equal \"certainly\".",
          "score": 3,
          "created_utc": "2026-01-20 08:59:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0n080d",
              "author": "Finaler0795",
              "text": "This is gold, thank you! It’s basically shifting from 'look at my cool thing' to 'tell me about your headache.' So build a connection first, deeply understand the real pain, and only pitch later. \n\nOne open question I’m still thinking about: in early outreach, does focusing on people with obvious pain tend to work better than talking more broadly with potential users?",
              "score": 1,
              "created_utc": "2026-01-20 09:21:37",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0on215",
                  "author": "afernanrefa",
                  "text": "If you can find those people, yes. For new products I often find people don't even know what their pain is. That's the hard part.. it's not obvious.\n\nIf they know what their pain is, they usually find a way to solve it with another product.",
                  "score": 2,
                  "created_utc": "2026-01-20 15:49:34",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0nh18g",
          "author": "Pristine_State_8542",
          "text": "\"no one is willing to actually spend a few minutes using it\"  \nCould it be that they do not consider the problem you solve, to actually be a problem? It might not be a valid pain point for that audience. Try to find a narrower segment, or more tailored approach to your outreach.",
          "score": 3,
          "created_utc": "2026-01-20 11:50:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0nh89g",
              "author": "Finaler0795",
              "text": "Thanks!",
              "score": 1,
              "created_utc": "2026-01-20 11:51:57",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0n30dq",
          "author": "mandevillelove",
          "text": "Target small communities with your problem, ask for quick feedback not just signups.",
          "score": 2,
          "created_utc": "2026-01-20 09:48:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0n43g3",
          "author": "Unlikely_Handle_4891",
          "text": "If you are not getting people's attention, isn't this an indication that you are solving the wrong problem?",
          "score": 2,
          "created_utc": "2026-01-20 09:58:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0n55i4",
              "author": "Finaler0795",
              "text": "That‘s fair. It's fairly general form tool right now, I’m trying to use early user feedback to narrow down the real problem to focus on.",
              "score": 1,
              "created_utc": "2026-01-20 10:08:13",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o112f8j",
                  "author": "Unlikely_Handle_4891",
                  "text": "Fair enough, OK if I send a DM to connect?",
                  "score": 1,
                  "created_utc": "2026-01-22 11:31:51",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0n8p33",
          "author": "armandinho_builder",
          "text": "I find them on LinkedIn",
          "score": 2,
          "created_utc": "2026-01-20 10:40:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0n984s",
              "author": "Finaler0795",
              "text": "Thanks for sharing",
              "score": 1,
              "created_utc": "2026-01-20 10:45:07",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0nd5j8",
          "author": "Free_Ad3272",
          "text": "the problem is with building something of which you dont know who needs it.\n\nnormally you would start with a testable (!!) thesis about a need.\n\nfor example:\n\"engineering offices spend 20+% of their time compiling reports from different documents manuall.\"\n\nthat can be transformed to something an engineer can answer with yes or now:\n\"do you spend a significant amount of time compiling...\"\n\nembed that in a friendly email and send that to 100+ engineering offices. this yields 10 phonecalls. these people have a problem worth solving. \n\ndevelop the solution in close contact with these people and offer them 12 months free or something like that. \n\ncheers",
          "score": 2,
          "created_utc": "2026-01-20 11:19:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0o0xp8",
              "author": "Finaler0795",
              "text": "Thank you so much for sharing this, I really appreciate it! I'll definitely try this approach.",
              "score": 2,
              "created_utc": "2026-01-20 13:57:43",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0o58be",
                  "author": "Free_Ad3272",
                  "text": "welcome! happy to help! :)",
                  "score": 2,
                  "created_utc": "2026-01-20 14:20:55",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0ndemz",
          "author": "Adorable-Show92",
          "text": "I’ve been there, and it’s exhausting when you’re stuck in that loop of polite nods and \"looks great\" comments that don't lead to actual usage. In my experience, people rarely try a new tool for a general offer of free access; they usually only lean in if you find them in the exact moment they are complaining about a specific friction point in their current workflow. You might have better luck hanging out in niche forums or Discord channels where people are actively venting about their current form builder’s limitations.",
          "score": 2,
          "created_utc": "2026-01-20 11:21:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ndkx0",
          "author": "Exciting-Sir-1515",
          "text": "The people closest to you are your first users. \n\nNot necessarily the first paying customers but definite first users.",
          "score": 2,
          "created_utc": "2026-01-20 11:22:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0nh0yf",
          "author": "Ranketta",
          "text": "Find your buyer on linkedin, find their phone, call them and impress them with your deep industry knowledge so they will be willing to meet.  \nImpress them with your solution built on your industry knowledge.",
          "score": 2,
          "created_utc": "2026-01-20 11:50:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0nh9s1",
              "author": "Finaler0795",
              "text": "Got it, thx",
              "score": 1,
              "created_utc": "2026-01-20 11:52:16",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0ns4dg",
          "author": "OkDependent6809",
          "text": "Nobody wants to try your product because they don't know you and their inbox is full of other founders asking the same thing.\n\nWhat worked for me was going where users already hang out and just being helpful first. Not promoting, just participating in communities. Then when people recognize your name, they're more willing to try your thing.\n\nAlso \"try my product and give feedback\" is too vague. Better to ask \"can I watch you do X task for 15 minutes.\" People are way more likely to do a quick call than download something alone.\n\nFor B2B at my job, we sometimes use [CleverX](https://cleverx.com/) to find specific people when validating features. Costs money but faster than cold outreach.\n\nHard truth is your first 10 users probably come from warm connections or communities you're already active in. Cold outreach to strangers almost never works when you're nobody.",
          "score": 2,
          "created_utc": "2026-01-20 13:07:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0o2dh8",
          "author": "commander-x-",
          "text": "What are u building?. I can check it out and give  u a feedback. Have some free time, lol. Let me know",
          "score": 2,
          "created_utc": "2026-01-20 14:05:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0oea7c",
              "author": "Finaler0795",
              "text": "Dashform, and if you Google it, it should come up. Happy to hear any feedback if you get a chance to check it out. Thanks!",
              "score": 1,
              "created_utc": "2026-01-20 15:07:19",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0p96pu",
                  "author": "commander-x-",
                  "text": "Mate, I can't find it, there are multiple results for that search, and many very similar, is it a .com or .net",
                  "score": 1,
                  "created_utc": "2026-01-20 17:32:05",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o0pa9p6",
                  "author": "commander-x-",
                  "text": "Is it the ai form creation tool?, if it is, just wow, u really need to get better at explaining your product.",
                  "score": 1,
                  "created_utc": "2026-01-20 17:37:07",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0o5wnn",
          "author": "Tomahawk19-",
          "text": "You have actually received significant feedback by your own admission.",
          "score": 2,
          "created_utc": "2026-01-20 14:24:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0oeivo",
              "author": "Finaler0795",
              "text": "Got it, so even the lack of response can be a signal in itself. That’s a helpful way to look at it, thanks for pointing that out.",
              "score": 1,
              "created_utc": "2026-01-20 15:08:31",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0of7vy",
                  "author": "Tomahawk19-",
                  "text": "Precisely. You haven’t built enough value in a very crowded space if you ask me what the feedback says.",
                  "score": 2,
                  "created_utc": "2026-01-20 15:11:57",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0op66w",
          "author": "BetaOfficeUK",
          "text": "I’ve been through this exact phase, and honestly the hardest part wasn’t feedback -\n\nit was getting anyone to care enough to even try.\n\n\n\nWhat eventually worked for me wasn’t more channels, it was narrowing \\*who\\* I was talking to.\n\nBroad outreach (Product Hunt, X, generic communities) gave me noise, not signal.\n\nThe first people who actually talked were:\n\n– people already hacking together a workaround\n\n– or people who had complained publicly about the problem before\n\nInstead of asking “can you try my product?”, I started asking “how are you doing X right now?” and listened.Only after that did I mention what I was building.\n\nAlso, surveys were almost useless at that stage.The first real users came from 1:1 conversations, not forms.It’s slow, uncomfortable, and feels inefficient - but it was the only thing that led to real feedback for me.",
          "score": 2,
          "created_utc": "2026-01-20 15:59:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0pqpz7",
          "author": "AdTypical2226",
          "text": "I found your product with Google with the name you provided in the comments. \n\nTwo thoughts: \n\n1. Because the product is novel, it’s not immediately clear from the first viewport a) what it is b) who it’s for \n\n\nIf I were you I would:\n\nA) Try a different explanation on top  followed by the demo. And only after it’s clear what the product does and how it helps, I’d show the quickstart (“type a prompt…”). Also. When I was still trying to understand what the product does and I tried the prompt example and was then greeted with the signup, I was hugely annoyed. If I wasn’t trying to be helpful here, I would have quit then and there. \n\nB) create different landing pages for different use cases & audiences where the copy, demo, examples and the quickstart is tailored to each. Eg for Product builders who want feedback for their app. That way it’s easier for the target audience to “get it” without having to shift through long texts and different use cases to understand if it’s for them. \n\n\n2. When I finally found and tried the demo, it was/felt broken. \n\nA) There are delays of a ~second when the screen is blank or it’s just the static cursor. I later understood that it’s just AI “thinking” delay, but it doesn’t come off that way. I were you, I’d give it a loading state of three pulsating dots or something similar, to make it clear that we’re just waiting for a response here. \n\nB) I also couldn’t get past the second question. Just couldn’t click the “next” button even though I had entered text. I tried the Feedback and Survey option. \n\n…\n\nI didn’t sign up and I didn’t spend more time with the landing page. But I like the overall idea and I’m your potential target user (a product manager/solo-builder). Static feedback forms indeed lack depth while proper interviews take a lot of time, so this solution could be suitable in-the-middle alternative. \n\nGood luck!",
          "score": 2,
          "created_utc": "2026-01-20 18:51:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0tf0e2",
              "author": "Finaler0795",
              "text": "Thanks! I feel very lucky to receive such detailed and thoughtful feedback, thank you so much for taking the time 🙏\n\nOur team really values this, and we discussed your points internally right away.\n\nYour first point is spot on. We’re still in an exploration phase and trying to narrow down the right use cases through early adopter feedback, so a larger page restructure is definitely coming. Based on your feedback, in the short term we’re also improving the basic guidance and prompts to make things much clearer.\n\nYour second point is also extremely helpful. The occasional 1s lag is an algorithm issue on our side, but we really liked your suggestion around a clearer “thinking/loading” state. We’ve already built it and are testing it now, and it should go live very soon.\n\nAs for not being able to move to the next question: it currently submits via the Enter key, which is clearly not obvious. That’s on us. We’ve already improved the button behavior and layout, and that update is also coming shortly.\n\nThanks again for the thoughtful and constructive feedback. It genuinely helps us a lot. Feel free to share any other thoughts anytime. Happy to help however we can, and always open to feedback.\n\nWish you all the best! 😊",
              "score": 1,
              "created_utc": "2026-01-21 07:20:35",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0u4296",
                  "author": "AdTypical2226",
                  "text": "You’re welcome! When you’ve done some iterations, feel free to DM me, I’ll take another look :)",
                  "score": 2,
                  "created_utc": "2026-01-21 11:13:36",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0sje5b",
          "author": "Apurv_Bansal_Zenskar",
          "text": "I get where you're coming from, it’s tough to get that first user willing to give real feedback. Here’s what worked for me:\n\n1. **Target Specific Communities**: Instead of posting everywhere, find niche communities (Reddit’s r/Entrepreneur, Slack groups, etc.) where people actually deal with the problem you're solving. Engage in conversations that are more personal.\n2. **Leverage Your Network**: Start with people you know. Offer free access and ask for honest feedback. They’ll usually be more open and invested in helping.\n3. **Value-First Outreach**: Instead of cold DMs, offer value upfront. Solve a problem they have, then tie it back to your tool and ask for feedback.\n4. **Live Demos/Webinars**: Hosting a live demo or small webinar can help you get more engaged users who are willing to give direct feedback.\n5. **Content Marketing**: Share content that solves their problems (like blog posts or videos). This can attract people already looking for solutions, making them more likely to try your product(on X or LinkedIn)\n\nI would say building your own personal brand vallue can leverage your customer base for your company I hope you get it!",
          "score": 2,
          "created_utc": "2026-01-21 03:28:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0tawso",
          "author": "Jegan__Selvaraj",
          "text": "I have been through this stage before. What helped was reaching out to people who were actually experiencing the problem you are solving even if they were not the “ideal” users yet. Honest, small conversations and iterating on their feedback quickly can open doors to your first real users.",
          "score": 2,
          "created_utc": "2026-01-21 06:44:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0tfd4i",
              "author": "Finaler0795",
              "text": "Yes, totally agree. At the very early stage, every single user really matters. Those early adopters often end up shaping the direction of the product more than anything else.\n\nThanks for sharing your experience, really appreciate it!",
              "score": 1,
              "created_utc": "2026-01-21 07:23:52",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o101j6r",
          "author": "nrgore1",
          "text": "One technique we used at large firm was engaging potential customers as **co-design partners**. This approach reduced costs for the client while providing us with critical insights into practical implementation issues. We structured the IP agreements to grant the client necessary usage rights, while we **retained** full ownership to sell the product to other customers and control future upgrades",
          "score": 2,
          "created_utc": "2026-01-22 06:03:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o101wje",
              "author": "Finaler0795",
              "text": "Thanks for sharing! I’m thinking along the same lines The tricky part for me is how you actually find those co-design partners early on, before you have any brand or traction.",
              "score": 1,
              "created_utc": "2026-01-22 06:06:50",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o10ll5w",
          "author": "barefamting",
          "text": "You need to understand your ICP first, otherwise your search is just a wild one of trying to find anyone to use your product",
          "score": 2,
          "created_utc": "2026-01-22 09:00:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o10nitp",
              "author": "Finaler0795",
              "text": "Totally agree, I'm trying to use the first few real users to discover my ICP, since I'm not sure my assumed ICP upfront is right.",
              "score": 2,
              "created_utc": "2026-01-22 09:18:46",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o10nxqm",
                  "author": "barefamting",
                  "text": "What have you got so far? lets run through it a bit",
                  "score": 2,
                  "created_utc": "2026-01-22 09:22:44",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o16t0tq",
          "author": "Cutie_potato7770",
          "text": "Build a solid audience. :)",
          "score": 2,
          "created_utc": "2026-01-23 05:31:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o18t9j1",
          "author": "Legitimate-Fold2271",
          "text": "Im glad I found this post. I am currently going through the exact same situations. I'd be happy to help you test your product. It would be great if you could help me do the same with mine too. Just getting started here seems so difficult.",
          "score": 2,
          "created_utc": "2026-01-23 14:36:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o191gxq",
              "author": "Finaler0795",
              "text": "Thanks! Happy to exchange feedback, what product are you working on?",
              "score": 1,
              "created_utc": "2026-01-23 15:17:07",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o19kee9",
                  "author": "Legitimate-Fold2271",
                  "text": "Hey thanks man. The app is [https://www.kitchen-sync-app.com/](https://www.kitchen-sync-app.com/)  \nIt basically takes recipes from any website and stores them for you with all the fluff removed (blogs, ads etc). Target is home cooks, small family's to help with meal planning etc.   \nI will collate some feedback for your product and DM you.",
                  "score": 1,
                  "created_utc": "2026-01-23 16:42:43",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o18xmgd",
          "author": "offbyalot",
          "text": "I'm a CTO of a B2B startup. In the beginning we were mainly selling to other founders.\n\nWhat worked for us was asking for advice / feedback on our early product:  \n\\- people are usually more open to talk if you're asking for help vs selling to them  \n\\- if you think what you're building is actually useful to them you can ask them to try it out at the end of your conversation\n\nWe took this and then  \n\\- went to IRL events, met founders, and asked them to get coffee to get their advice  \n\\- posted with our real identities in Facebook groups asking for advice  \n\\- cold emailed, again asking for advice\n\nThese conversations were also actually helpful because people gave their honest feedback on what they would and would not use and eventually we stumbled upon folks who said they would pay for what we were describing if we built it for them.",
          "score": 2,
          "created_utc": "2026-01-23 14:58:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o19110x",
              "author": "Finaler0795",
              "text": "Another really practical suggestion, thanks for sharing this!",
              "score": 1,
              "created_utc": "2026-01-23 15:15:00",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0mz1b1",
          "author": "Spiritual_Muscle_955",
          "text": "Please provide your website or product link so I can check it out.",
          "score": 1,
          "created_utc": "2026-01-20 09:10:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0n0kt1",
              "author": "Finaler0795",
              "text": "Thanks, but I’m not here to promote or buy growth services. I’m genuinely trying to learn how to find real users.",
              "score": 1,
              "created_utc": "2026-01-20 09:25:01",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0n1zje",
          "author": "Deep_Lifeguard_5039",
          "text": "Warm intros, then cold outreach via LinkedIn, email, cold phone calls\n\nB2B GTM is the most painful thing in the world tbh\n\nDM me if you want to compare notes, happy to share what we've found to work after a few months of 16 hours a day cold calling, etc.",
          "score": 1,
          "created_utc": "2026-01-20 09:38:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0nc84a",
          "author": "Free_Ad3272",
          "text": "im gonna try it",
          "score": 1,
          "created_utc": "2026-01-20 11:11:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0nqwtk",
          "author": "Small_Drawer_5372",
          "text": "At PingPrompt, we launched on Product Hunt with a 14-day free trial. We had a 70% conversion rate from the trial. A single offer of annual access on the landing page.\n\nIt was the best decision I made to get paying users who give real feedback. No audience.\n\nI had done a free closed beta before the launch and had 0 conversions to paying users.",
          "score": 1,
          "created_utc": "2026-01-20 12:59:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o10ka09",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-22 08:48:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o10kyq1",
              "author": "Finaler0795",
              "text": "Got it, makes sense. I’m actively looking for those communities now, appreciate the advice, thanks!",
              "score": 1,
              "created_utc": "2026-01-22 08:54:34",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o10wr0z",
          "author": "meddyjay",
          "text": "i guess without funds its so hard.even x its [hard.network](http://hard.network) and money bro.",
          "score": 1,
          "created_utc": "2026-01-22 10:44:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1l0miy",
          "author": "AdministrativeArt621",
          "text": "You built something that should solve a problem and make people/companies willing to pay for it. \n\nDo inbound marketing, rather than outbound. \n\nSend direct emails followed by cold calls to targeted audiences. Go for quality leads over quantity to seek for real insights. \n\nAnother way could be to look for competitive solutions and their existing customers, better understand who they are, where, and what they do. Find them, email them, call them.",
          "score": 1,
          "created_utc": "2026-01-25 08:01:42",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qgzz7e",
      "title": "Your fundraising announcement probably did nothing for your business",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qgzz7e/your_fundraising_announcement_probably_did/",
      "author": "illeatmyletter",
      "created_utc": "2026-01-19 09:46:40",
      "score": 17,
      "num_comments": 6,
      "upvote_ratio": 0.91,
      "text": "I've watched dozens of founders announce their fundraise over the past year. Most of them follow the same playbook: write a LinkedIn post, maybe a Twitter thread, attach some founder headshots, thank their investors, and call it a day.\n\nThey get 50 likes. Their investors comment. A few friends reshare. And then it's gone.\n\nMeanwhile, a handful of founders treat their fundraise like a marketing moment and the difference in outcomes is wild.\n\nWhy does this even matter?\n\nHere's what most founders don't realize: a fundraising announcement isn't just \"news.\" It's one of the only moments where you have a legitimate reason to be loud. You have something to say. People expect you to share it. And if you do it right, you're not just announcing money. You're doing three things at once:\n\n1. Building credibility. When your announcement gets traction, future investors see momentum. It makes the next round easier. The halo effect is real.\n2. Driving signups. A viral fundraising moment doesn't just impress VCs. It brings in users who were on the fence. People want to be part of something that's clearly working.\n3. Creating leverage. When everyone's talking about you, recruiting gets easier. Partnerships open up. Press reaches out. You're suddenly on people's radar.\n\nBest example I've seen: Arlan Rakhmetzhanov dropped a cinematic video recreating that famous scene from The Social Network. It hit 2-3 million views across LinkedIn and X. Investors reached out. Other YC founders started talking about him.\n\nThe money matters. But the attention you get for free might matter more.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1qgzz7e/your_fundraising_announcement_probably_did/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o0gslg9",
          "author": "Desperate-Self-4800",
          "text": "We used our first investment to launch or \"founding team hiring\" rather than push that we \"just got money\". We barely mentioned the raise, though it was obvious we had closed it. And other investors read between the lines and pinged us which generated some momentum - customers also commented because they resonated with the growth of the team. Getting funding was necessary but not sufficient to be a good business so we treat it as such - an enabler for the actual work we want to do as a company.",
          "score": 2,
          "created_utc": "2026-01-19 12:36:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0mz0cc",
          "author": "GeneralNetwork1318",
          "text": "Great take. Represent Studio really understood the assignment with Arlan’s video. It didn’t feel like a fundraising announcement at all. No surprise it blew up so much.",
          "score": 2,
          "created_utc": "2026-01-20 09:10:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0jl8p0",
          "author": "dennisthetennis404",
          "text": "Yeah most people just announce the money, the smart ones treat it like they're launching something people actually care about.",
          "score": 1,
          "created_utc": "2026-01-19 20:44:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0udfg0",
          "author": "IdeasInProcess",
          "text": "You are optimising for visibility rather than user intent. A viral video brings in a lot of noise but rarely brings in the right technical leads who actually need the software. We track our signups based on retention and the users who come from hype usually churn the fastest. I would rather have fifty people who need to automate a specific workflow than a million people who just like the video.",
          "score": 1,
          "created_utc": "2026-01-21 12:25:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o10xpsv",
          "author": "meddyjay",
          "text": "correct",
          "score": 1,
          "created_utc": "2026-01-22 10:52:24",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qgbeyp",
      "title": "What are you building? Promote it here",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qgbeyp/what_are_you_building_promote_it_here/",
      "author": "allen18walker",
      "created_utc": "2026-01-18 15:27:14",
      "score": 16,
      "num_comments": 50,
      "upvote_ratio": 1.0,
      "text": "We're offering one free viral Video for startups that want to test demand and get visibility.\n\nEvery startup can get 1 free viral Video made by our editor team. It features your product or business and is posted to our socials. There's no cost, and it usually takes about 7 days to receive and approve the video. Limit is one free video per startup, and nothing goes live without your approval.\n\nYou can use it to promote waitlists, MVP apps, pre orders, mature products, discounts, coupons, or even follow for follow.\n\nAll you need to do is tell us about your startup. You'll get an email letting you know if you're approved. We approve 95% of applications that are completed from start to finish.\n\nHere's the link with full details and access: https://zoomgtm.fillout.com/catalog-free-tiktok?sid=IsiahVA\n\nInside the link, there are also short Playbook videos that break down how we think about traction and distribution, so even if you just want to learn, it's useful.",
      "is_original_content": false,
      "link_flair_text": "services",
      "permalink": "https://reddit.com/r/startup/comments/1qgbeyp/what_are_you_building_promote_it_here/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o0bwix0",
          "author": "ThenBell4509",
          "text": "I’m building Doggmo, a lightweight web app where you upload or take a photo of a dog and get a simple interpretation of visible body language cues like ears, tail, posture, and eye contact.\n\nIt’s free, works with or without an account, and is intentionally framed as reflective guidance rather than training or medical advice. Still early and mainly validating whether it’s genuinely useful for dog owner\n\nhttps://doggmo.com/",
          "score": 5,
          "created_utc": "2026-01-18 18:12:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0bjzxb",
          "author": "seasonh5",
          "text": "Building a platform where users can view their product through the app dashboard, all texts highlighted with their translation id (eg homepage.heading). Click to edit. Live AI translation and it analyzes your product texts to match certain settings you provide (tone, glossary, product voice etc)",
          "score": 2,
          "created_utc": "2026-01-18 17:13:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0cnl3z",
          "author": "OkResort8287",
          "text": "1. [www.kipasastore.com](http://www.kipasastore.com/) \\- an all in 1 global store stocking up recently rolled put with updates pending\n2. [https://maasimcreatives.com/](https://maasimcreatives.com/) \\- a kids creative corner kids books for your kids",
          "score": 1,
          "created_utc": "2026-01-18 20:20:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0cx6jc",
          "author": "Reasonable-Walrus-74",
          "text": "\"Ciao a tutti. Ho creato un nuovo sito che si chiama [Resonance](https://id-preview--98e05a99-5535-423d-9d25-e1fdbcc2dda7.lovable.app/?__lovable_token=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJ1c2VyX2lkIjoiTWszV2Y3dW5acE1MdmdYNm1WQmZSZ1JpSXExMiIsInByb2plY3RfaWQiOiI5OGUwNWE5OS01NTM1LTQyM2QtOWQyNS1lMWZkYmNjMmRkYTciLCJub25jZSI6IjBiZDIxZWMwZjYwNmNiMjM5YzhiYTQyNWJjMWY4ZGI0IiwiaXNzIjoibG92YWJsZS1hcGkiLCJzdWIiOiI5OGUwNWE5OS01NTM1LTQyM2QtOWQyNS1lMWZkYmNjMmRkYTciLCJhdWQiOlsibG92YWJsZS1hcHAiXSwiZXhwIjoxNzY5Mzc1MzA3LCJuYmYiOjE3Njg3NzA1MDcsImlhdCI6MTc2ODc3MDUwN30.9zvM__SPODgZ2BzCqjbF0Aggt_1vd_6PoC5lCs9fCFw) . L'idea è molto semplice: è un punto di incontro per chi fa musica. Sapete quanto è difficile trovare qualcuno con cui ci sia il giusto feeling per scrivere canzoni o suonare insieme? Ecco, Resonance risolve questo problema. Ti iscrivi, dici cosa suoni e cosa ti piace, e il sito ti mette in contatto con le persone più adatte a te per collaborare. È uno strumento pratico per passare dal \"cercare\" al \"suonare\". Dateci un'occhiata.\"",
          "score": 1,
          "created_utc": "2026-01-18 21:09:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0czull",
          "author": "Optimal_Joke5930",
          "text": "very sus",
          "score": 1,
          "created_utc": "2026-01-18 21:25:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0d7r0j",
          "author": "Zoopexz",
          "text": "www.reindar.com - una “boutique” de ingeniería para industrias que trabajan con materiales difíciles y automatismos industriales con concepto de industria 4.0",
          "score": 1,
          "created_utc": "2026-01-18 22:05:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0das45",
          "author": "IndividualAir3353",
          "text": "I’m building a few\nProjects that are ready for users\n\nhttps://bittorrented.com a torrent-first\nStreaming platform\n\nhttp://marksyncr.com a free bookmarks synchronizer web extension for chrome safari and Firefox based browsers\n\nhttp://defpromo.com a zero-cloud self promotion web extension for all browsers  helps automate commenting on social media posts to promote your product  api keys required  \n\nhttps://giv1.com Publish Newsletters & Podcasts. The complete platform for content creators. Publish beautiful newsletters and podcasts\n\nhttp://summaryforge.com  Turn long readings into ready-to-study notes and quizzes. Perfect for students cramming before exams.\n\nhttp://coinpayportal.com a non custodial crypto payment gateway   Easy to integrate similar to stripe with web hooks and manage multiple businesses  \n\nhttp://qrypt.chat a free quantum resistant chat application \n\nhttp://disrupthire.com ai assisted engineer consulting services \n\nhttp://saasrow.com link directory for saas and ai\n\nhttp://ugig.net Connect with skilled engineers and workers who leverage AI tools to deliver exceptional results. Free to browse, free to apply.\n\nhttp://cryptoshot.space an ethereum jackpot game just connect your wallet and take a shot at the jackpot contract is open source \n\nhttps://postammo.com a viral content idea generator for social media posters. Includes native mobile, PWA and web extension apps.\n\n\n☎️ Hire me: +1 (408) 656-2473 Anthony",
          "score": 1,
          "created_utc": "2026-01-18 22:19:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o13qijj",
              "author": "annieY_c",
              "text": "Why so many? Did all of them have at least 1k users?",
              "score": 1,
              "created_utc": "2026-01-22 19:35:21",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0dbc1r",
          "author": "Prestigious_Tea6110",
          "text": "This is awesome!",
          "score": 1,
          "created_utc": "2026-01-18 22:21:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0dg7mo",
          "author": "Few-Invite-9735",
          "text": "AI matching for business cofounders and business partners  \n[https://cofounding.me](https://cofounding.me/)",
          "score": 1,
          "created_utc": "2026-01-18 22:44:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ef3gc",
          "author": "InformationFit4143",
          "text": "AI to verify if visual creative gets the right attention. Predicts viewer visual and emotional attention http://app.myralabs.ai",
          "score": 1,
          "created_utc": "2026-01-19 01:49:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0emt2v",
          "author": "Beneficial_Ad1805",
          "text": "I’m working on Unibox ([https://unibox.today](https://unibox.today/)) and I just opened up the public waitlist for the beta.\n\nThe core reason I built this is \"search fatigue.\" I’d remember a conversation about a specific budget or a bug, but I couldn't remember if it happened in a Slack DM, a Telegram group, or an email thread. I’d spend 10 minutes jumping between apps just to find one sentence.\n\nI wanted a way to treat all my communications as one searchable database.\n\nYou can join the waitlist here: [https://unibox.today](https://unibox.today/)\n\nWould love to hear your thoughts or any specific integrations that would make your life easier.",
          "score": 1,
          "created_utc": "2026-01-19 02:31:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0f3xec",
          "author": "amacg",
          "text": "Built a community where makers can share what they’re building and get fair visibility. Here's the link: [https://trylaunch.ai](https://trylaunch.ai/)",
          "score": 1,
          "created_utc": "2026-01-19 04:09:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0f6vyf",
          "author": "Flimsy_Bike7598",
          "text": "nice",
          "score": 1,
          "created_utc": "2026-01-19 04:29:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0fss8l",
          "author": "sparroow4",
          "text": "Building free online Web tools for pdf, image, finance, seo, developer, etc. \n\nBrand Name : Zlet Ai\n\nLink: [Zlet Ai](https://zletai.com)",
          "score": 1,
          "created_utc": "2026-01-19 07:17:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0g4mba",
          "author": "jonathanbrnd",
          "text": "DigiStorms is an AI-powered tool that helps SaaS companies create full onboarding and rentention email sequences in minutes.\n\nIt replaces slow, manual work with fast, optimized emails tailored to every stage of the user journey.\n\n[https://digistorms.ai/](https://digistorms.ai/)",
          "score": 1,
          "created_utc": "2026-01-19 09:05:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0g56kz",
          "author": "Kejbs",
          "text": "[Huddlekit](https://huddlekit.com) — Collect visual feedback on websites, images, PDFs, and videos all in one place",
          "score": 1,
          "created_utc": "2026-01-19 09:11:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0g66ft",
          "author": "Several_Explorer1375",
          "text": "https://getfree.app a place where users can get apps for free and developers can get early users",
          "score": 1,
          "created_utc": "2026-01-19 09:20:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0hauz9",
          "author": "armandinho_builder",
          "text": "An app for personalized daily briefings",
          "score": 1,
          "created_utc": "2026-01-19 14:26:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0hs39r",
          "author": "Maleficent_Carrot_43",
          "text": "BetterMind is a mental health app designed to help people manage anxiety, stress, and emotional overload in a practical, judgment-free way. It combines guided tools, mood tracking, grounding exercises, and intelligent insights to help users understand their mental patterns and build healthier habits over time. Built to be accessible anywhere, BetterMind works seamlessly across devices with no clutter. It is not therapy replacement fluff or toxic positivity. It is a calm, structured space to slow your mind down, regain control, and make measurable progress toward better mental wellbeing.\n\n[BetterMind](https://betteru.app)",
          "score": 1,
          "created_utc": "2026-01-19 15:50:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0jbpqk",
          "author": "missEves",
          "text": "[playmix](https://playmix.ai/animate) \\- create animated game sprites w/ ai 🏃‍♀️",
          "score": 1,
          "created_utc": "2026-01-19 20:00:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0klwk7",
          "author": "Florencion",
          "text": "[Datvil](https://www.datvil.com) - a dating app, 24 hours automatching, 5 questions rounds - all to help you find partners faster than just endless swiping",
          "score": 1,
          "created_utc": "2026-01-19 23:49:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0lwmas",
          "author": "Accurate_Maximum_974",
          "text": "Just build a shopify app store:\n\n\"Guardy: Fraud Shield\"  \n[https://apps.shopify.com/guardy-fraud-shield?search\\_id=3207a1db-5824-4ab3-955f-0db52c781baa&surface\\_detail=guardy&surface\\_inter\\_position=1&surface\\_intra\\_position=1&surface\\_type=search](https://apps.shopify.com/guardy-fraud-shield?search_id=3207a1db-5824-4ab3-955f-0db52c781baa&surface_detail=guardy&surface_inter_position=1&surface_intra_position=1&surface_type=search)\n\nProblem: \n\nCash-on-delivery Fraud, Fake orders for chargebacks\n\n  \nSolution:\n\nPhone, mail address, address etc. validation for each order and more.",
          "score": 1,
          "created_utc": "2026-01-20 04:06:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0mc96l",
          "author": "Ogretribe",
          "text": "https://unfairgaps.com\n\nThe Market Intelligence Database of Financial Bleeds.\n\nCompanies lose billions in regulatory fines and operational waste daily. We track exactly where the money is lost, so you can build the business that saves it.",
          "score": 1,
          "created_utc": "2026-01-20 05:51:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0n9xoh",
          "author": "Genstellar_ai",
          "text": "This is pretty cool, honestly.\n\nWe’re building **Genstellar**, and one thing I’ve realized over time is that even when the product is solid, it’s really hard to explain *why it’s different* in text alone. Most people won’t read long explanations, but they’ll watch a short video if it clicks quickly.\n\nI’m curious how hands-on founders usually are in shaping the video itself. Is it more about clearly showing the product in action, or telling the story behind why it exists? I’m also wondering whether you’ve seen this work better for very early MVPs versus products that are already a bit more polished.\n\nEven if we don’t end up applying, the playbook videos sound genuinely useful. Distribution and demand testing are still the hardest parts after shipping.\n\nNice initiative overall - lowering the cost of experimenting like this is really helpful for early-stage founders.",
          "score": 1,
          "created_utc": "2026-01-20 10:51:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0qe032",
          "author": "kapenzi",
          "text": "Tired of juggling a million tools that don't actually help? 😅\nThe Stewards Bundle is 36 resources ($1,600 value) to help you work smarter, not harder. Free this week.\nLive AI expert sessions included. No fluff, just what works.\nGrab it here 👇\nhttps://www.skool.com/stewards/about?ref=c0f5bea0c8484de1943c398817ad3153",
          "score": 1,
          "created_utc": "2026-01-20 20:38:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0tm9b4",
          "author": "YlmzCmlttn",
          "text": "I am building [tryitnow.ai](http://tryitnow.ai)\n\n[TryItNow.ai](http://TryItNow.ai) is a solution-first AI marketplace: instead of just listing models, it lets people pick a **real use case** and try it instantly (Virtual Try-On, Hair/Room/Car design, Applicant Scoring, Resume Parser, Comment Categorizer, etc.). Each use case has a simple playground UI + the same workflow available via API, so founders can validate demand fast and developers can integrate without building the pipeline from scratch.",
          "score": 1,
          "created_utc": "2026-01-21 08:27:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0vbur1",
          "author": "No_Leave1711",
          "text": "Build BudgetGO a budgeting app that uses personalized AI insights (not chatbots) to tell you what actually matters about your money, only when it matters https://testflight.apple.com/join/V6pXPwcp BudgetGO: AI Financial Wingman",
          "score": 1,
          "created_utc": "2026-01-21 15:32:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0w2cuh",
          "author": "Beneficial_Lime1912",
          "text": "I’m building an early-stage iOS app called [Alcotheque](https://apps.apple.com/app/id6755549562) to track a home wine and spirits collection. I just implemented an onboarding flow for the app. Hope you’ll like it!",
          "score": 1,
          "created_utc": "2026-01-21 17:31:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1cxdgs",
          "author": "teadragon25",
          "text": "MyLoops is a privacy-first mobile application for helping families and loved ones stay connected and be there for your loved ones when they don't feel safe and need you the most, with or without location sharing. We never sell data and there is no creepy tracking - you always have to grant permission for people to either be in your circle and receive notifications about you or for people to share location with you. Let's usher in a new era of safety together!\n\nDownload link for IOS: https://apps.apple.com/us/app/myloops-connected-and-safe/id6748546808 \n\nDownload link for Android: https://play.google.com/store/apps/details?id=com.innovation43veryone.mycircles\n\nI'd love to know what you think!",
          "score": 1,
          "created_utc": "2026-01-24 02:44:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ebsih",
          "author": "officialnerezostudio",
          "text": "Nerezo Studio, focused on making/remedying accessible websites in order for businesses to avoid lawsuits",
          "score": 1,
          "created_utc": "2026-01-24 09:04:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0bqprj",
          "author": "Efficient_Let216",
          "text": "We spend so much of our lives on autopilot- chasing what we think we want, without ever truly understanding ourselves.\n\nWe’re born with unique gifts, deep emotional needs, and hidden patterns. We also carry shadows and wounds that quietly shape our choices. When we don’t see them, they run our lives.\n\nWe choose careers that drain us.\nWe fall for people who can’t meet us.\nWe repeat the same cycles- wondering why.\n\nBut what if the answers were already within you?\n\nWhen you understand your strengths, your needs, and your shadows, you stop forcing what isn’t meant for you. You choose with clarity, intention, and self-respect.\n\nCome home to yourself first.\nThen find those who truly align because not everyone is meant for you, and that’s okay.\n\nThis is where self-awareness begins.\nThis is where everything changes.\n\nhttps://zelo.chat",
          "score": 0,
          "created_utc": "2026-01-18 17:45:55",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qhv2qu",
      "title": "How to find investor for my app startup",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qhv2qu/how_to_find_investor_for_my_app_startup/",
      "author": "Storyteller880",
      "created_utc": "2026-01-20 07:55:35",
      "score": 9,
      "num_comments": 27,
      "upvote_ratio": 1.0,
      "text": "I have a domain, which I registered a decade back. Now we want to build a news app startup around that. But we need funds to start, as we will need to subscribe to premium news wire services. But I am unsure how to find an investor. We can give equity in lieu. The startup will be sure shot profitable from 1st year itself and valuation will be 100x in some time. But I don't have an IIT/IIM degree which is why I am hesitant and unsure how to proceed. Suggestions are welcome ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1qhv2qu/how_to_find_investor_for_my_app_startup/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o0mwlwx",
          "author": "Vaibhav_codes",
          "text": "Focus on traction and a clear demo, not degrees. Angel networks, local incubators, and small friends/family checks are the easiest first steps to get investors interested.",
          "score": 3,
          "created_utc": "2026-01-20 08:47:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0vyrlr",
          "author": "RoleHot6498",
          "text": "Did you say \"sure shot profitable\".... As an investor, take my advice and drop that line of thinking right now. Nothing is a sure shot and as long as you approach investors with that kind of thinking you'll get nowhere.  Start thinking about thr real risks involved and how you intend to mitigate them and you'll get much further with investors",
          "score": 3,
          "created_utc": "2026-01-21 17:15:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0y2ujk",
              "author": "cannibal_catfish69",
              "text": "lol. idk how many times I thought I caught a glimpse of the golden goose, just to find out it was it was turkey covered in dried piss.",
              "score": 2,
              "created_utc": "2026-01-21 23:02:47",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0zcl2d",
                  "author": "RoleHot6498",
                  "text": "I love that analogy...I'm using it",
                  "score": 1,
                  "created_utc": "2026-01-22 03:16:02",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0n8ye2",
          "author": "IdeasInProcess",
          "text": "I saw this exact scenario with a fintech client. They thought they needed Bloomberg terminals and expensive APIs on day one. We helped them build a simple ingestion engine that scraped and summarised public financial news instead. It was 90% as good and cost $50 a month to run. By the time they actually needed the premium wires, they had enough revenue to pay for it themselves. Don't sell equity to pay a vendor bill.",
          "score": 2,
          "created_utc": "2026-01-20 10:42:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o16eret",
          "author": "Delicious-Kale3960",
          "text": "PM if possible here. We are looking to fund. Do you have  MVP ?",
          "score": 2,
          "created_utc": "2026-01-23 03:57:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0msewi",
          "author": "Bad_ass_da",
          "text": "What kind of news? Is it your own feed ?",
          "score": 1,
          "created_utc": "2026-01-20 08:08:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0mssa5",
              "author": "Storyteller880",
              "text": "Every type of news. Kind of Inshorts having Reddit discussions. When you will scroll vertical, next news piece will come and when you will scroll horizontal, a discussion thread for that specific news will open up.",
              "score": 1,
              "created_utc": "2026-01-20 08:11:32",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0msup1",
                  "author": "Bad_ass_da",
                  "text": "Copyright?",
                  "score": 1,
                  "created_utc": "2026-01-20 08:12:09",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0n4mlg",
          "author": "AirlineUnlikely7018",
          "text": "DM me",
          "score": 1,
          "created_utc": "2026-01-20 10:03:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0nght4",
          "author": "regisdesmeules",
          "text": "For an early stage startup like you, look with startup incubators, accelerators an angel investor groups in your region for pre-seed funding. Prepare your pitch desk for funding purpose.",
          "score": 1,
          "created_utc": "2026-01-20 11:46:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0nx161",
          "author": "Radiant-Design-1002",
          "text": "I wouldn’t focus on finding investors that focus on building an MVP with AI you can vibe code as long as the one big feature works and you get to show your a-ha moment launch with that see how the market reacts to it once you have traction then you hunt for investors",
          "score": 1,
          "created_utc": "2026-01-20 13:36:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0t2zc7",
          "author": "Other-Image-2074",
          "text": "There are hundreds of news websites. How are you going to compete with them?\n\nA domain is just a start. Anybody can register a domain for a few thousand $. It takes years to build a brand and authority in competitive spaces like news.",
          "score": 1,
          "created_utc": "2026-01-21 05:39:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0twnhf",
          "author": "ElectronicReview9525",
          "text": "Keep it real and de-risk it first. No investor funds “ideas + confidence” anymore. Build a scrappy MVP without premium wires, prove demand with users, engagement, or paid pilots, then raise. Investors care way more about traction than IIT/IIM tags.\n\nStart with angels who know media or SaaS, not VCs. Warm intros via LinkedIn, founder communities, or even revenue-sharing deals with wire services can work early. If it’s truly profitable from year one, bootstrap or pre-sell before giving away equity.",
          "score": 1,
          "created_utc": "2026-01-21 10:07:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0u8scb",
          "author": "KyungMinPark_",
          "text": "Drop the degree insecurity. Investors fund traction, not titles. Start lean, validate demand, show early users/revenue, then approach angels—not VCs—with proof, not promises.",
          "score": 1,
          "created_utc": "2026-01-21 11:51:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0uioix",
          "author": "DukeByTheSea",
          "text": "Substack has so many news newsletters. You can also start there",
          "score": 1,
          "created_utc": "2026-01-21 12:59:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ulnnu",
          "author": "Willing-Training1020",
          "text": "hmm so the thing is... investors care way more about traction than pedigree these days. the IIT/IIM thing matters less than you think, especially if you can show *some* proof of concept first. before chasing funding, i'd actually suggest bootstrapping a super lean MVP — maybe hire a part-time dev and someone to handle content ops from the philippines (way cheaper than local hires, like 70% less, and honestly the talent pool there is solid for this kind of work). get some users, show engagement metrics, THEN approach investors. angel networks like indian angel network or letsventure are good starting points, also look into startup india programs. cold outreach on linkedin to angels who've invested in media/news startups actually works better than you'd expect if your pitch is tight. the \"100x valuation\" language might scare off serious investors tho — they hear that a lot lol. focus on your unique angle with that aged domain and realistic growth projections instead. also having even a small operational team shows you can execute, which matters more than credentials imo :)",
          "score": 1,
          "created_utc": "2026-01-21 13:17:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0xr6vh",
          "author": "Money_Mind_3365",
          "text": "Hello, I was wondering if we could partner with your app, as my app does something similar to yours. This app is https://automa-ia-4c288a27.base44.app/",
          "score": 1,
          "created_utc": "2026-01-21 22:05:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o16flw0",
              "author": "Delicious-Kale3960",
              "text": "Good luck",
              "score": 1,
              "created_utc": "2026-01-23 04:02:49",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0yj3gz",
          "author": "entrepreneurblr",
          "text": "You dont have money to pay for premium news articles subscriptions? Am I reading right or missing something?",
          "score": 1,
          "created_utc": "2026-01-22 00:30:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o10we6j",
          "author": "meddyjay",
          "text": "first built mocked demo via vibe tools.  \nsee the product.",
          "score": 1,
          "created_utc": "2026-01-22 10:40:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1epm9v",
          "author": "Defiant-Relative1019",
          "text": "Saying \"this will be profitable year one and 100x valuation\" is something every founder believes, but investors hear it a hundred times a week. What they actually want to see is proof: users, engagement, revenue (even small), or at least a working prototype and a plan that holds up under scrutiny.",
          "score": 1,
          "created_utc": "2026-01-24 11:11:24",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qjcsvd",
      "title": "Non-Technical Co-Founder trying to figure out how to find Technical Leads (Equity)",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qjcsvd/nontechnical_cofounder_trying_to_figure_out_how/",
      "author": "Huge-Signature-7143",
      "created_utc": "2026-01-21 22:41:38",
      "score": 9,
      "num_comments": 45,
      "upvote_ratio": 0.91,
      "text": "Hi all, \n\nMe and my cofounder have spent the last two years designing a product that I have honestly been waiting my whole life to build. I have people waiting for me to get this product running, but we are having a really hard time finding developers. \n\nOur main issue is we don't have money. We have been doing this as a passion project and have been really avoiding VC and investing because we don't want the product to be owned by people who aren't invested in the concept and/or just want to use it for money. \n\nI understand equity can be sketchy or even end up being a dead end, but I was just hoping to get some advice maybe from other non-technical founders on where to look for people. \n\nUltimately we may very well just have to go the funding route, and I get that. We have a pitch deck made for that purpose and are getting to the point where we will probably have to do that, but just wanted to check here to see if anyone had any other ideas. \n\nThanks! ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1qjcsvd/nontechnical_cofounder_trying_to_figure_out_how/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o0z63k3",
          "author": "chymakyr",
          "text": "As someone who has been on the Y Combinator founder matching service for over a year, I can say with absolute certainty that it's been a joke.  It got to the point of having so many meetings and pitches from others to get me to jump in on hair-brained ideas for no money that I had to direct people to an F-U page before they bothered to reach out to me.  Most anyone messaging me after that obviously didn't read it because it was the same tired story. the few that did read it and messaged anyway \"got it\", and usually had some kind of traction and an MVP already (poorly) built - but still no money.  That matching service showed me unequivocally that 99% of these \"founders\" have no idea what they're getting into.  I'm between jobs now and broke, but even if I had substantial savings I wouldn't waste my time on any of those pitches.\n\nIt basically amounts to someone is the \"ideas\" person who has domain knowledge and sees an opportunity. they write a few documents, come up with an outline, pretend to be the \"business\" side, then expect a developer to spend months of their lives for no money working on nothing more than someone else's dream.  I feel bad for young techies who will get burned far too many times before they realize the path they've gotten themselves into.\n\nMy advice for you - cough up some money, sell your car, mortgage your house, borrow from your parents to have some skin in the game.  then, hire a very-trusted and experienced developer that you can immediately fire if things don't go right. stay away from \"offshore\" devs who have zero accountability, or junior devs who haven't gained the wisdom to avoid pitfalls. if necessary, go through a technical recruiting agency who already has a roster of proven professionals.",
          "score": 5,
          "created_utc": "2026-01-22 02:39:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1199qq",
              "author": "Desperate_Quit_5433",
              "text": "Coming from the non tech side founder, u r 💯 right! I spent so much energy and time with YC CO founder platform . What they promote is the survivor success stories  meanwhile most people dont find success on the platform.",
              "score": 1,
              "created_utc": "2026-01-22 12:22:22",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o13z5bf",
                  "author": "RoleHot6498",
                  "text": "There's truth in that. Did your startup workout in the end?",
                  "score": 1,
                  "created_utc": "2026-01-22 20:15:02",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o0za4mi",
              "author": "Huge-Signature-7143",
              "text": "My co-founder is a vet. Creative director. We have a fully prototyped high fidelity application with a full business plan. I do understand your points, but we have put two years of free time into this. I am very broke as well, but it’s really in no way just an idea. We probably will end up going the money route. That is a very real possibility. I understand what im asking, and i get why you feel how you do. We are prepping for that route. In the meantime, i am looking for ways around it until we get there. Appreciate the advice. It will probably come to that, but i am not losing all hope yet.",
              "score": 1,
              "created_utc": "2026-01-22 03:01:48",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o11ef03",
                  "author": "StoneCypher",
                  "text": "> We have a fully prototyped high fidelity application\n\nsounds like you don’t need a developer ",
                  "score": 1,
                  "created_utc": "2026-01-22 12:56:08",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0zbs5s",
          "author": "Shichroron",
          "text": "Line up customers",
          "score": 2,
          "created_utc": "2026-01-22 03:11:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o14tkje",
              "author": "Huge-Signature-7143",
              "text": "I have people waiting for it. At least the people i have shown it to.",
              "score": 1,
              "created_utc": "2026-01-22 22:44:34",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o152hxt",
                  "author": "Shichroron",
                  "text": "So have the pre-buy it or provide \"monkey in a box\" kind of service for a few for a small fee\n\nThis is the real proof that you have a business",
                  "score": 1,
                  "created_utc": "2026-01-22 23:31:04",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0zyb4o",
          "author": "Worldy_Dance42",
          "text": "What are you intending to build?   Have you validated the idea?",
          "score": 2,
          "created_utc": "2026-01-22 05:38:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o14uhs4",
              "author": "Huge-Signature-7143",
              "text": "Its a personal training app. Ive been a personal trainer for around 8 years, and a lot of it is based on what ive seen as needed. As far as validation, i have a lot of people waiting for me to actually get it developed. And scientific article proof of the concept. Obviously i dont have real people on it. But thats what i have.",
              "score": 1,
              "created_utc": "2026-01-22 22:49:30",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0y2qxf",
          "author": "LookHairy8228",
          "text": "I went through a pretty rough job search last year and watched a few friends try to recruit on equity-only, and the pattern I kept seeing was that senior engineers won’t touch equity until they see either real capital or real traction. What sometimes works better is scoping the absolute smallest possible version of your product and paying for that as a discrete contract instead of trying to bring on a “technical cofounder” outright. It gives people something concrete to build, reduces the trust barrier, and if you like working together, then the equity conversation becomes way easier. My husband’s in recruiting and he always says the same thing: equity is a story, not compensation, so your job is to make the story compelling enough that someone wants to opt in",
          "score": 2,
          "created_utc": "2026-01-21 23:02:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0y8z6p",
              "author": "Huge-Signature-7143",
              "text": "Yeah thats why weve been working on a pitch deck to better represent the business aspects and traction. I do take some real fault for losing people based on how i was proposing it before (showing the designs). Appreciate that tho. Totally right.",
              "score": 1,
              "created_utc": "2026-01-21 23:35:28",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o10e8cx",
              "author": "Super_Maxi1804",
              "text": "finding a good tech cofounder is the easiest thig in the world, all a good tech cofounder wants is for you to have done your job,   \ndon't come out with \"need the product first\" and \"if we build it they will come\" excuses.  \nstart with - \"this is the website\", \"this is how much traffic it have\", \"this are the wireframes\", \"this are the results of the user interviews\", \"this are the results of the AD campaigns\", \"this is the GTM\", \"This is the pricing model\", \"this is the expected number of users based on this tested marketing plan\" or for B2B \"this are the companies ready to be early adopters, this ones will pay when the product is ready\".\n\nyou will not be able to respond to all the tech people interested in working with you. (assuming you do not start with something stupid as less than 50/50)",
              "score": 0,
              "created_utc": "2026-01-22 07:52:10",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o10g49f",
          "author": "meddyjay",
          "text": "this is what exacly im suffering bro :)",
          "score": 1,
          "created_utc": "2026-01-22 08:09:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o14tuwo",
              "author": "Huge-Signature-7143",
              "text": "Its a tough one. Good luck soldier.",
              "score": 1,
              "created_utc": "2026-01-22 22:46:06",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o10klnv",
          "author": "Vaibhav_codes",
          "text": "Try Indie Hackers, GitHub, Reddit, and local startup meetups to find technical co founders willing to work for equity. Clear vision and ownership are key",
          "score": 1,
          "created_utc": "2026-01-22 08:51:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o14v1yl",
              "author": "Huge-Signature-7143",
              "text": "Thank you! We are trying to refine the vision so the business side makes sense.",
              "score": 1,
              "created_utc": "2026-01-22 22:52:28",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o10ncfv",
          "author": "IdeasInProcess",
          "text": "You likely do not need a custom codebase to start. We faced this same gap and instead of giving away equity we used automation platforms to string together the backend logic. It allowed us to launch the product and process data without a dedicated engineering team.",
          "score": 1,
          "created_utc": "2026-01-22 09:17:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o14umfk",
              "author": "Huge-Signature-7143",
              "text": "We have been looking at this! What tool did you use?",
              "score": 1,
              "created_utc": "2026-01-22 22:50:11",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o17pqc9",
                  "author": "IdeasInProcess",
                  "text": "We have our own called Dart chain",
                  "score": 1,
                  "created_utc": "2026-01-23 10:14:55",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o10rtk2",
          "author": "mandevillelove",
          "text": "consider networking in dev communities, hackathons, or offering early equity to passionate technical co-founders.",
          "score": 1,
          "created_utc": "2026-01-22 09:59:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o14v5ns",
              "author": "Huge-Signature-7143",
              "text": "Oh totally we were offering equity for each piece made and had that in writing.",
              "score": 1,
              "created_utc": "2026-01-22 22:53:01",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o10wtnq",
          "author": "MapSensitive9894",
          "text": "Engineer here, curious as to why two years were spent on business planning/prototypes? To be honest, in two years you could’ve taught yourself to code, and built your product. Before Ai, i would estimate 1-2 years to learn how to code+building a fullstack app. With Ai, this should take a dedicated person 3-6 months. What’s stopping you from running a quick intro course on code academy, then using your favorite Ai tool to guide you during development?",
          "score": 1,
          "created_utc": "2026-01-22 10:44:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o115vtq",
              "author": "Powerful-Software850",
              "text": "That part!!! It took me 6 months to learn how to code but the thing is I’m not doing high level interface coding. But honestly I feel like that’s something I can learn this year too.",
              "score": 1,
              "created_utc": "2026-01-22 11:58:09",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o14vrxt",
                  "author": "Huge-Signature-7143",
                  "text": "Yeah i need to go into it. Im just not sure i can get good enough fast enough to get to the level i need to make it.",
                  "score": 1,
                  "created_utc": "2026-01-22 22:56:15",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            },
            {
              "id": "o14vlhy",
              "author": "Huge-Signature-7143",
              "text": "I have to pay to live that was what most of the time was spent doing. It took two years because it was a side hobby. We are looking into using ai tools. Mostly i have just been hesistant in that area because I was worried about messing up the back end and having to face the repercussions later. The product is also fairly dense in concept. It is something we are considering for sure tho.",
              "score": 1,
              "created_utc": "2026-01-22 22:55:19",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o11k0do",
          "author": "Big_Being_1466",
          "text": "Im an engineer can you tell me more about the product?",
          "score": 1,
          "created_utc": "2026-01-22 13:28:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o13vs5s",
          "author": "Far_from_world",
          "text": "Well I was at that stage few months ago \n\nBut then I took the risk \nPaying the developer from my pocket but it turned out really great. I am able to see my idea getting built into a product.\n\nInitially I was also thinking about money and all but then realised that if you really want somebody who’s serious then you will need to pay them \n\nI would also suggest you to pick up a good open source guy who’s in second last/last year of his college. And if the guy is good then offer him the equity. But first hire him. Don’t get in the bed with any guy blindly.",
          "score": 1,
          "created_utc": "2026-01-22 19:59:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o14wdbo",
              "author": "Huge-Signature-7143",
              "text": "Yeah i know. I am 26 and i dont rlly just have the money available to pay someone. Ive been part time working trying to design this, so ive been kind of living on the edge. We are looking at getting investment, so probably we will just end up paying someone. Appreciate the advice!",
              "score": 1,
              "created_utc": "2026-01-22 22:59:19",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o13ypyx",
          "author": "RoleHot6498",
          "text": "First, congrats to you and your partner for pursuing the dream your way. Second, your hesitation about outside capital is understandable but short sighted. It's not outside investment that creates problem, it's the WRONG outside investment. Have you guys considered really honing exactly who you want for investors beyond just the money?",
          "score": 1,
          "created_utc": "2026-01-22 20:13:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o14w3tu",
              "author": "Huge-Signature-7143",
              "text": "We spoke to a few people at the end of last year, but until rlly the end of last year, we were trying to reach out to people we knew who were devs. Definitely something we are looking into now, but if you have any idea i will happily take them!",
              "score": 1,
              "created_utc": "2026-01-22 22:57:57",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o16fg8b",
                  "author": "RoleHot6498",
                  "text": "Certainly. It takes some strategy but much of it is deciding what you need for you business to succeed like connections, insight, past experience, industry prowess and of course capital and then determining how that mix comes together in the ideal investor mindset. Then the work really begins by creating a campaign specifically aligned with your targeted investor. \n\n\nHappy to look at what you're doing in more detail via PM",
                  "score": 1,
                  "created_utc": "2026-01-23 04:01:51",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o176eu5",
          "author": "Dyagz",
          "text": "Have you tried to vibe code it yet? There is absolutely no reason you couldn't vibe code a training app on your own between 2 people.",
          "score": 1,
          "created_utc": "2026-01-23 07:18:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o17yurg",
              "author": "Huge-Signature-7143",
              "text": "I havent yet but that was a step i was considering. Partly i dont love the idea? Im a little worried if we vibe code rather than getting someone experienced to build that the back end will be messy and result in a later need to fix. It is something we are looking at tho!",
              "score": 1,
              "created_utc": "2026-01-23 11:32:50",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o19mnys",
                  "author": "Dyagz",
                  "text": "Tech debt is normal, building and launching and patching bugs is far superior to waiting and finding a partner who also could make mistakes. The models are so good now, you can get them to critique each others suggestions and then synthesize and a robust architecture.",
                  "score": 1,
                  "created_utc": "2026-01-23 16:52:50",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o10eavr",
          "author": "Super_Maxi1804",
          "text": "finding a good tech cofounder is the easiest thig in the world, all a good tech cofounder wants is for you to have done your job,  \ndon't come out with \"need the product first\" and \"if we build it they will come\" excuses.  \nstart with - \"this is the website\", \"this is how much traffic it have\", \"this are the wireframes\", \"this are the results of the user interviews\", \"this are the results of the AD campaigns\", \"this is the GTM\", \"This is the pricing model\", \"this is the expected number of users based on this tested marketing plan\" or for B2B \"this are the companies ready to be early adopters, this ones will pay when the product is ready\".\n\nyou will not be able to respond to all the tech people interested in working with you. (assuming you do not start with something stupid as less than 50/50)",
          "score": 0,
          "created_utc": "2026-01-22 07:52:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o14u1in",
              "author": "Huge-Signature-7143",
              "text": "Yeah we have been working on more of a business proposition. Appreciate the advice.",
              "score": 1,
              "created_utc": "2026-01-22 22:47:05",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qi4gfg",
      "title": "If digital and technology is still resorting to advertising as a revenue generation model in 2020s, that's not innovation that is going backwards.",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qi4gfg/if_digital_and_technology_is_still_resorting_to/",
      "author": "usmannaeem",
      "created_utc": "2026-01-20 15:42:01",
      "score": 7,
      "num_comments": 13,
      "upvote_ratio": 1.0,
      "text": "Yes, I said it, advertising as an industry is so old, and if you as a business, performance marketer, innovation strategist, growth hacker, business strategist is suggesting the that you use ads in your solution offering, outside outside of legacy broadcast media on digital, cloud based services ( apps, transmedia storytelling campaigns, retail digital activations, ARGs, streaming services etc), I am sorry but that is what I call reverse progress. Broadcast format adverting and broadcast framework Advertising is so 1990s. Infuencers, short form video promotions etc are all regressive innovation.",
      "is_original_content": false,
      "link_flair_text": "business acumen",
      "permalink": "https://reddit.com/r/startup/comments/1qi4gfg/if_digital_and_technology_is_still_resorting_to/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o0pg19b",
          "author": "2reform",
          "text": "Advertisement existed for thousands of years. Who are you to question its power!",
          "score": 1,
          "created_utc": "2026-01-20 18:03:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0pvqmt",
              "author": "usmannaeem",
              "text": "Just because it existed for the last 150 years doesn't mean it still is relevant or needs to exist. This is an industry that has run it's course and therefore in no longer advertising but now it's weaponizing digital as identity theft.",
              "score": 1,
              "created_utc": "2026-01-20 19:13:44",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0pwsxv",
                  "author": "2reform",
                  "text": "have anything in mind as an alternative?",
                  "score": 1,
                  "created_utc": "2026-01-20 19:18:37",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0sk45x",
          "author": "Apurv_Bansal_Zenskar",
          "text": "I see your point.... relying on traditional advertising in the digital age feels like a step backward. The real innovation should be in creating new, integrated models that prioritize value and engagement over interruptive ads. Consumers are getting smarter, and they’re looking for more personalized, authentic experiences rather than just being sold to.\n\nI feel like not all but a small group of creators do cater a large audience where they fell like relating to each other and this a pure human nature the promotion if its digital we will call it as ads and if its done onsite or off air it will be the same thing soo advertising is very reliable of source for getting sales or marketing",
          "score": 1,
          "created_utc": "2026-01-21 03:32:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0txd8p",
          "author": "Hot-Shine9270",
          "text": "I get the frustration. A lot of what’s called “innovation” in marketing is just the same old broadcast playbook with shinier wrappers. Influencers, short-form, paid social… most of it still boils down to interrupting people and hoping it sticks.\n\nThat said, I don’t think the issue is paid distribution itself, it’s when ads are used to prop up something people don’t actually want. That’s when it feels backwards. No amount of spend fixes weak demand.\n\nThe more interesting stuff I’ve seen isn’t ad-free, it’s where paid is almost invisible. Tools that spread because they’re useful, content that answers real intent, spend used to amplify something that already works instead of forcing it.\n\nTotally agree that broadcast thinking is outdated though. New channels, same mindset. That’s the real problem.\n\nGenuinely curious what you think replaces paid reach at scale, because even the best products I’ve seen usually need some kind of push early on.",
          "score": 1,
          "created_utc": "2026-01-21 10:14:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0u1adb",
              "author": "usmannaeem",
              "text": "What you have today isn't broadcast thinking, it's almost criminal individual person personalized  intrusive targeted messaging with the clear intent to sell a single person's livelihood - that is the advertisement as gen-Z knows it. Decencitized to the act of identity theft. Ads need to go.",
              "score": 1,
              "created_utc": "2026-01-21 10:49:47",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0u5d0k",
          "author": "Vaibhav_codes",
          "text": "Totally get your point relying on traditional ads or even influencer/short form campaigns often feels like repackaging old models rather than innovating True digital innovation now is creating value driven experiences, immersive engagement, and monetization that doesn’t just interrupt users",
          "score": 1,
          "created_utc": "2026-01-21 11:24:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ubmxx",
          "author": "IdeasInProcess",
          "text": "Ads are not regressive. They are the only reason the internet is free. Most users will not pull out a credit card for every article or tool they use. Advertising removes the payment barrier so you can scale to millions of users instantly. It is not about lack of innovation. It is about removing friction for the user.",
          "score": 1,
          "created_utc": "2026-01-21 12:12:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0uj9t0",
              "author": "usmannaeem",
              "text": "Ads are regressive, and the only reason the internet is free is not this. The internet is free because ads are a way to legalize identity theft and soy in users. Ads on digital are a mechanism to sell user data purely for theft identity. A format to shift the focus of a business from community to a single users private life by weaponizing demographics, psychographics and hold a single targeted person's information hostage. Ads need to go, influencers need to go.",
              "score": 1,
              "created_utc": "2026-01-21 13:03:13",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0yigjg",
          "author": "LongIslandIceTeas",
          "text": "Unfortunately it won’t happen op",
          "score": 1,
          "created_utc": "2026-01-22 00:26:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o177adm",
          "author": "MORPHOICES",
          "text": "I mostly think advertising in this case is necessary waste, but the more fundamental issue is not \"ads vs no ads\" - the more central issue is where value is actually created.\\~ \\~  \n  \nRegardless, advertising used to serve a purpose, but in scenarios where attention was scarce, and the difficulty lay in actually getting things distributed. That was a pretty long time ago, to equation advertising to value.  \n  \nThe attention problem is over. \n\nAds, at this point, serve to recycle demand - and not create it. The NOT INNOVATION GAME per se the \"ads no ads\" construct creates has more just a left over value fighting over ads. \n\nFrom the outside looking in, we should be a little concerned here, as we lose more. \n\n\"Value\" is aptly put, here.",
          "score": 1,
          "created_utc": "2026-01-23 07:25:38",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qhsh99",
      "title": "A lesson I learned watching early-stage startups struggle: profit isn’t safety",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qhsh99/a_lesson_i_learned_watching_earlystage_startups/",
      "author": "sunmc_",
      "created_utc": "2026-01-20 05:28:40",
      "score": 6,
      "num_comments": 4,
      "upvote_ratio": 1.0,
      "text": "One pattern I’ve seen repeatedly with early-stage startups is this:  \neverything looks fine on paper, but founders still feel constant pressure.\n\nThe reason usually isn’t lack of sales — it’s **cash flow timing**.\n\nRevenue might be booked, but:\n\n* invoices take weeks to get paid\n* taxes and payroll are immediate\n* growth costs show up before returns\n\nThat disconnect creates stress even in “profitable” startups.\n\nThe mindset shift that helped many founders was moving from  \n“Are we profitable?” to  \n**“Can we comfortably operate for the next 60–90 days?”**\n\nA few habits that made a real difference:\n\n* weekly cash-in vs cash-out check\n* planning buffer before hiring or scaling\n* not treating receivables as available cash\n\nI work with a CPA firm (JTC CPAs), and this topic comes up constantly with growing businesses — especially those scaling faster than expected.\n\nWould love to hear from founders here:\n\n* What surprised you most about cash flow once you started growing?\n* Any systems that helped you avoid close calls?",
      "is_original_content": false,
      "link_flair_text": "business acumen",
      "permalink": "https://reddit.com/r/startup/comments/1qhsh99/a_lesson_i_learned_watching_earlystage_startups/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o0mog1r",
          "author": "Capital_Key_4276",
          "text": "good advice",
          "score": 1,
          "created_utc": "2026-01-20 07:32:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0nnwmq",
          "author": "IdeasInProcess",
          "text": "The manual follow-up on those invoices is what kills the efficiency. We saw this with our own books, we were wasting hours every week just emailing people to pay us. We eventually built an internal automation engine just to handle the emails. Once we removed the awkward human element from asking for money, our days sales outstanding dropped significantly. You have to automate the nagging or it doesn't happen.",
          "score": 1,
          "created_utc": "2026-01-20 12:40:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0rryof",
          "author": "IndustryADV",
          "text": "This hits a real nerve for a lot of growing teams.\n\nThe big surprise for many founders:\n\nProfit does not equal safety.\n\nMoney can be on paper but not in the bank.\n\nBills and payroll still come due on fixed dates.\n\nGrowth costs show up before growth revenue.\n\nThat timing gap is what creates stress, even when the business looks healthy.\n\nCommon cash flow mistakes people make early:\n\nTreating unpaid invoices like real cash\n\nHiring or scaling based on projected revenue\n\nForgetting about tax timing until it is urgent\n\nNot tracking weekly inflow and outflow\n\nSimple habits that help a lot:\n\nA weekly cash in vs cash out check\n\nKeeping a small cash buffer before hiring\n\nPlanning expenses based only on money already received\n\nSeparating operating cash from tax money\n\nThe mindset shift that matters:\n\nInstead of asking\n\n\"Are we profitable?\"\n\nAsk\n\n\"Can we comfortably run for the next 60 to 90 days with what is in the bank right now?\"\n\nMost close calls come from timing, not bad business models.\n\nThe founders who stay calm through growth are usually the ones who plan for cash gaps before they happen.",
          "score": 1,
          "created_utc": "2026-01-21 00:50:33",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qh5un1",
      "title": "Our startup Gemini/Google API credits expired - how did you manage the transition/costs?",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qh5un1/our_startup_geminigoogle_api_credits_expired_how/",
      "author": "reben002",
      "created_utc": "2026-01-19 14:38:32",
      "score": 5,
      "num_comments": 5,
      "upvote_ratio": 1.0,
      "text": "We're a fintech that received $100K in Google Cloud startup credits - we spend \\~$20-30k on Gemini API every month.\n\nCredits just expired and we're not yet break-even. The sudden cost increase is tough.\n\nHow did other startups handle this transition?\n\nLet me know if you have unused/extra Google credits :)",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1qh5un1/our_startup_geminigoogle_api_credits_expired_how/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o0hf1ry",
          "author": "monkey6",
          "text": "_classic_",
          "score": 3,
          "created_utc": "2026-01-19 14:47:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0hf55d",
              "author": "reben002",
              "text": "Classic and tricky my friend!",
              "score": 1,
              "created_utc": "2026-01-19 14:48:27",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0ieqno",
          "author": "sparrow932703",
          "text": "Not sure about cloud, but if ai/llms are troubling you, this might help  \nOrbit - (withorbit.io) \n\nDo check out and let me know if this helps. will jump over to get this integrated in your production account",
          "score": 1,
          "created_utc": "2026-01-19 17:32:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o11rz30",
          "author": "IdeasInProcess",
          "text": "Credits are a trap that hide inefficient engineering. $30k/month is massive for a pre-revenue startup, which suggests you are using the most expensive model for every single call. We cut our bill in half by enforcing a Flash First policy. We route 90% of our traffic (data extraction, formatting, simple logic) to Gemini Flash, which is a fraction of the cost of Pro. We only call Pro when the prompt fails a specific complexity check. You need to audit your logs and downgrade every task that doesn't require deep reasoning.",
          "score": 1,
          "created_utc": "2026-01-22 14:11:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o11sldz",
              "author": "reben002",
              "text": "Interesting, like it!",
              "score": 1,
              "created_utc": "2026-01-22 14:14:32",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qj05ys",
      "title": "From Side Hustle to Startup, Built the Platform I Always Wanted",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qj05ys/from_side_hustle_to_startup_built_the_platform_i/",
      "author": "Hairy_Memory6232",
      "created_utc": "2026-01-21 15:01:23",
      "score": 4,
      "num_comments": 7,
      "upvote_ratio": 0.84,
      "text": "For the last 4–5 years, I’ve been freelancing and tutoring alongside my day job. What started as extra income slowly grew into something bigger and at one point, it even crossed my monthly salary.\n\nWhile tutoring international students and helping with assignments, I kept thinking:\n\nWhy isn’t there one simple platform for both 1-on-1 tutoring and homework help?\n\nSo I built it in last 1 year.\n\nIntroducing TeacherAndTask a place where students can connect with real teachers for tutoring, homework help, and project support.\n\nThe site just launched and I’m already seeing early sign-ups across globe, which feels amazing.\n\nNeed your feeedback on [**teacherandtask.com**](http://teacherandtask.com)",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1qj05ys/from_side_hustle_to_startup_built_the_platform_i/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o0v9msp",
          "author": "FrostingAccurate",
          "text": "Looks really good.",
          "score": 2,
          "created_utc": "2026-01-21 15:22:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0x3kz4",
          "author": "Fulcilives1988",
          "text": "Love the hustle. checking this out for my brother who is struggling with calc.",
          "score": 2,
          "created_utc": "2026-01-21 20:17:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o10k4xk",
          "author": "Delicious-Ground1570",
          "text": "Looks good, is it 1-1 video call or chat only?",
          "score": 2,
          "created_utc": "2026-01-22 08:46:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o10spwe",
              "author": "Hairy_Memory6232",
              "text": "1-1 video sessions ,and chat  , white board",
              "score": 2,
              "created_utc": "2026-01-22 10:07:59",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1603rs",
                  "author": "Delicious-Ground1570",
                  "text": "is the video call built-in or use external free app like zoom or google?",
                  "score": 1,
                  "created_utc": "2026-01-23 02:34:01",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o119f8n",
          "author": "Vaibhav_codes",
          "text": "Congrats on the launch! The concept is clear and solves a real problem. Early sign ups globally is a great sign maybe highlight teacher reviews/testimonials more upfront to build trust",
          "score": 2,
          "created_utc": "2026-01-22 12:23:25",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qk9224",
      "title": "$0 to $149 ARR on day 1. Feels good man.",
      "subreddit": "startup",
      "url": "/r/SaaS/comments/1qk8lvs/the_first_person_i_reached_out_to_about_my_app/",
      "author": "NiceLasers",
      "created_utc": "2026-01-22 22:34:53",
      "score": 4,
      "num_comments": 2,
      "upvote_ratio": 1.0,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1qk9224/0_to_149_arr_on_day_1_feels_good_man/",
      "domain": "",
      "is_self": false,
      "comments": []
    },
    {
      "id": "1qi36ay",
      "title": "16yo founder, built and shipped an AI wearable in 30 days. Now what?",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qi36ay/16yo_founder_built_and_shipped_an_ai_wearable_in/",
      "author": "VirusB1ack0ut",
      "created_utc": "2026-01-20 14:54:20",
      "score": 4,
      "num_comments": 37,
      "upvote_ratio": 0.6,
      "text": "I'm 16 and I just built \"Hollow\" - an AI wearable that answers questions in \\~2s (solving the friction of pulling out a phone). I went from idea to shipping unit #1 in under a month using off-the-shelf parts to validate quickly. Launched on Product Hunt 2 days ago (#21) and got my first paying customer. I’m now on day 63 of building and I’m stuck.\n\nNow that the launch hype is gone, I'm kinda stuck in the \"trough of sorrow\" and need some advice from hardware founders:\n\nFor a $49 product, should I be grinding manual DMs/replies to get sales, or focusing on content (TikTok/Twitter)? I don't have a massive budget for ads.\n\nI have a few VCs asking deep questions about manufacturing/unit economics. As a solo founder in high school, should I be spending hours building pitch decks for them, or ignore them to focus 100% on getting from 1 to 50 users? Which one matters more right now?\n\nHow do I prove \"traction\" for hardware without inventory? I'm doing a \"hardware as a service\" model ($49 + sub) to cover costs, but it's hard to scale without capital.\n\nAny advice on how to get out of this trough and actually start growing would be huge.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1qi36ay/16yo_founder_built_and_shipped_an_ai_wearable_in/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o0oq372",
          "author": "Pristine_Battle_2636",
          "text": "You need to get a few people to test and give feedback. Then you can get some organic content out there. Would reach out to professionals who are established marketers, too. They will maybe give feedback in exhange for the product.",
          "score": 2,
          "created_utc": "2026-01-20 16:03:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0orlfl",
              "author": "VirusB1ack0ut",
              "text": "Yeah I have one sale but honestly he isn’t responding to my messages although he’d bevery useful since hes big in the ai industry and has a decently large following. About the influencers I did want to do thay but I have a very low budget and I dont know if that 50 dollar risk is gonna be worth it but I might try",
              "score": 1,
              "created_utc": "2026-01-20 16:10:34",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0otnsb",
                  "author": "TimeKillsThem",
                  "text": "Forget large influencers - focus on microinfluencers (less than 5k followers/subs) with an active community. \n\nThe goal is to build trust, before you build brand awareness. You want to show traction (not just interest, but conversion).\n\nBuild versions for your friends - and tell them to post about it on their Instagram.",
                  "score": 2,
                  "created_utc": "2026-01-20 16:20:04",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o0ouhye",
                  "author": "Pristine_Battle_2636",
                  "text": "I'm not even meaning influencers, I am meaning people who will use your product and give you feedback. They might be on Linkedin or social media, they are for you to get trust and understanding. \n\n  \nDo you have your ICP built out? If not, look into that: [https://www.qualtrics.com/articles/strategy-research/ideal-customer-profile/](https://www.qualtrics.com/articles/strategy-research/ideal-customer-profile/)\n\nThen see if you can find 3 people who are your ICP to give you feedback on the product, their usage, and the messaging. THEN you can go to microinfluencers. It sounds like you arent sure what the microinfluencers would say/ do yet. And this can help you work out the script and make a more targetted list.",
                  "score": 1,
                  "created_utc": "2026-01-20 16:23:56",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0t3ghq",
          "author": "Willing-Training1020",
          "text": "first off, shipping real hardware + a paying customer at 16 is already a signal most founders never hit. at this stage, 1→50 users matters more than vc conversations — especially for hardware — because real usage answers half the questions they’re asking anyway. grind the unscalable stuff: manual dms, tight founder-led sales, and short-form content where you can show the product *in use* (tiktok tends to work absurdly well for hardware). treat vcs as optional background noise unless one is explicitly helping with manufacturing or supply chain intros. traction for hardware isn’t inventory, it’s proof of pull: waitlists, retention on the sub, repeat usage, and people willing to wait for the product. the trough is normal — the job now is execution discipline, not a new strategy. build, talk to users, ship small improvements weekly, repeat.",
          "score": 2,
          "created_utc": "2026-01-21 05:43:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0uourw",
              "author": "VirusB1ack0ut",
              "text": "Understood. Also the vc and investors are mainly because the hardwares battery sucks which is a terrible user experience so I’m trying to raise for a battery efficient model. Where do you recommend manual dms?",
              "score": 1,
              "created_utc": "2026-01-21 13:36:06",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0tnvgl",
          "author": "JonnyBeGood-GoGo",
          "text": "Proving traction for hardware is extremely difficult (especially without product in hand). Much harder than software. Because most consumers want to look and feel and pilot the product before buying (or read reviews).\n\nTheres a few ways you can prove traction. In my opinion all of these should be used to show scale + quality.\n\n1. Build a waitlist (landing page) - for Scale. - Draw users to the landing page via social media content. Ship free models to people who can sell it for you via social media (influencers) and send users to the landing page to sign up/ get discount at launch.\n\n2. Conduct in-person interviews, then demo, then sell the product at the end of the demo with a letter of intent, deposit or pre-order - This is harder to scale but proves sale quality and gives you real-time feedback for improvements (also easier if B2B). Build an email list when inventory is ready. If you get bad feedback, make changes or pivot.\n\n3. Back the above evidence up with market research and data.\n\nI would steer clear of VC's this early - most are interested when you have reached a certain amount of scale - or they're more interested in low risk investments like software. I would definitely try and grow it organically at this early stage and keep slogging away at it. It's hard work!",
          "score": 2,
          "created_utc": "2026-01-21 08:43:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0uo58v",
              "author": "VirusB1ack0ut",
              "text": "Yeah I did the waitlist before launching, wasn’t too successful but I sent the discounts too. \nFor interviewing shouldi interview like average people kinda like street sales in specific areas thag could have my ICP?\nEverything else is understood. Thank you",
              "score": 1,
              "created_utc": "2026-01-21 13:32:04",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0wwmrm",
          "author": "mballardco",
          "text": "I’d figure out SEO. I searched “Hollow AI wearable” and didn’t come across your site.",
          "score": 2,
          "created_utc": "2026-01-21 19:45:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0wyyhf",
              "author": "VirusB1ack0ut",
              "text": "Yea definitely, I havent done SEO before though do you have any tips?",
              "score": 1,
              "created_utc": "2026-01-21 19:56:19",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0x4ndo",
                  "author": "gottapointreally",
                  "text": "For real. Use shopify.  Takes care of all the hard stuff",
                  "score": 2,
                  "created_utc": "2026-01-21 20:22:22",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0pjgxd",
          "author": "IdeasInProcess",
          "text": "Ghost the VCs. You are 16 with one customer. You have no leverage and pitch decks are a time cost. VCs want to see a machine that prints money, you are still building the machine. Spend 100% of your time on manual DMs. You need high-fidelity feedback from humans, not passive views from TikTok. If you cannot convince 50 people to buy this one-on-one, a viral video will not save you.",
          "score": 1,
          "created_utc": "2026-01-20 18:18:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0q5aiu",
              "author": "VirusB1ack0ut",
              "text": "Alright understood. Ill steer clear of VC’s, but what about angel/normal investors? Funding is a big part of my product, since itll help make the product something actually desirable since funding opens up more features. Should I just build and sell and wait for investors to contact me?",
              "score": 0,
              "created_utc": "2026-01-20 19:58:04",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0q4wdm",
          "author": "DbG925",
          "text": "Can I ask something stupid? Why not just do an apple watch app? Given the amount of people who already have the device, why complicate your business-model with manufacturing when you already have built-in distribution?",
          "score": 1,
          "created_utc": "2026-01-20 19:56:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0q603e",
              "author": "VirusB1ack0ut",
              "text": "Yeah no problem. First off the apple ecosystem in general is very limiting, so as an apple watch app I wouldnt be able to add as many features. Also, users would still have to open up their watch, search for the app, and then start talking, compared to my current model where the user taps and talks. The product is targeted towards busy people, so that slight time save is important to those people",
              "score": 1,
              "created_utc": "2026-01-20 20:01:23",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0qakdt",
                  "author": "DbG925",
                  "text": "Interesting hypothesis, what did you do to validate it?  I would think there's higher friction to wearing a separate device when almost everyone has something on their wrist already, but obviously i'm not as deeply into this as you.  Is there a reason \"hey siri, insert question here\" is frowned upon?  that would seem to negate your point about the friction re: opening the app on the watch.",
                  "score": 1,
                  "created_utc": "2026-01-20 20:22:47",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0qphhk",
          "author": "Pale-Requirement9041",
          "text": "Pictures?",
          "score": 1,
          "created_utc": "2026-01-20 21:31:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0quwzj",
              "author": "VirusB1ack0ut",
              "text": "Just check out my [tiktok](https://www.tiktok.com/@gethollow?_r=1&_t=ZP-93EvkX0JfLT) its got more info and vids of the product",
              "score": 1,
              "created_utc": "2026-01-20 21:56:16",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0qzh6d",
                  "author": "Pale-Requirement9041",
                  "text": "I don’t use Tiktok sorry. Anyway sounds good",
                  "score": 1,
                  "created_utc": "2026-01-20 22:18:16",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0tmsaq",
          "author": "Annonnymist",
          "text": "Like Meta glasses? lol",
          "score": 1,
          "created_utc": "2026-01-21 08:33:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0u9b99",
              "author": "VirusB1ack0ut",
              "text": "Eh not really I have a much larger vision for the final product",
              "score": 1,
              "created_utc": "2026-01-21 11:55:09",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0oncf2",
          "author": "TimeKillsThem",
          "text": "Hold on - I assume the item is just a relay for ChatGPT/Gemini on your phone right? Otherwise you just won the lottery if you nailed instant ondevice-AI :)",
          "score": 0,
          "created_utc": "2026-01-20 15:50:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0oox83",
              "author": "VirusB1ack0ut",
              "text": "Its a relay for the llama 8b on groq thru ur phone, I try not to make the watch standalone since the wifi usage is gonna drop battery life a bunch, but independence is definitely in my plans for the future.",
              "score": 5,
              "created_utc": "2026-01-20 15:58:13",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0pfon8",
                  "author": "Dev_Frank121",
                  "text": "Amazing",
                  "score": 0,
                  "created_utc": "2026-01-20 18:01:49",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o0s2i0j",
              "author": "Elegant_Mail",
              "text": "wouldn't be a lottery",
              "score": 1,
              "created_utc": "2026-01-21 01:50:49",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qjyaaq",
      "title": "Is it just me, or does Product-Market Fit basically reset the second you cross a border?",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qjyaaq/is_it_just_me_or_does_productmarket_fit_basically/",
      "author": "Gourab_Ghosh-",
      "created_utc": "2026-01-22 15:57:59",
      "score": 3,
      "num_comments": 7,
      "upvote_ratio": 0.72,
      "text": "I've had a \"Category King\" product in the US kitchen niche for two years. Gr⁤eat reviews, solid 15% conversion rate, and consistent rankings. Naturally, I thought expanding to the UK and Germany would be a copy-paste job. I translated the listing, shipped the inventory, and... crickets.\n\nThe conversion rate in the UK is half of what it is in the States, and my German PPC is just burning cash with zero sales to show for it. I used the same polished lifestyle images that worked here, but I'm starting to wonder if the aesthetic just doesn't land there.\n\nHow do you guys actually test for international product-market fit? Do you just launch and hope for the b⁤est, or is there a way to see how local consumers in different countries actually perceive your branding before you commit to localized inventory and VAT registration? I'm tired of guessing why my \"proven\" product is failing.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1qjyaaq/is_it_just_me_or_does_productmarket_fit_basically/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o13iqe4",
          "author": "PitifulAd502",
          "text": "You've hit on the biggest hurdle in global expansion: Visual Translation. What we consider \"bold and energetic\" in the US often comes across as \"cheap and loud\" in European markets like Germany or the UK. I stopped doing the \"launch and pray\" method after a similar disaster in Japan.\n\nNow, before I even localize a listing, I run a series of polls on Pic⁤kFu specifically targeting respondents in the country I'm entering. You can actually filter for UK or German panels and ask them to rank your US images against the local top sellers. The written feedback is a goldmine - they'll tell you if your colors feel \"off\" or if your messaging feels too \"salesy\" for their culture.\n\nIt's way cheaper to spend $50 on a localized poll than to realize your entire packaging design is a cultural mismatch after you've already sent 2,000 units to a warehouse in Berlin.",
          "score": 2,
          "created_utc": "2026-01-22 19:00:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o16svxx",
          "author": "Cutie_potato7770",
          "text": "The Category kings in Europe look nothing like the ones in the US. If you go on Amazon Japan, the listings are incredibly dense with information compared to the clean, minimalist look that is trending in the States right now. If you try to force a US-style listing into a market that expects a different visual language, you're going to lose every time. \n\nI've started using PickFu to run head-to-head blind tests where I put my US hero image up against the local leader in the UK or Australia. Seeing a British consumer explain why they trust the \"local\" brand over mine gives me the exact roadmap I need to fix my listing optimization. You can't just translate words; you have to translate the vibe and the level of trust the packaging communicates.",
          "score": 2,
          "created_utc": "2026-01-23 05:30:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o15i6ty",
          "author": "BiteyHorse",
          "text": "Just guessing and hoping for the best is indeed a strategy, but it's a shitty one.\n\nTest, test, test.  Work out variants with a creative partner, track performance, iterate.  Explore big differences then hone in on more subtle ones.  There's no shortcut around this.",
          "score": 1,
          "created_utc": "2026-01-23 00:53:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o17hixv",
          "author": "Vaibhav_codes",
          "text": "Not just you PMF resets by market US success doesn’t guarantee UK/DE conversions. Test with local copy, images, and small campaigns first to see how buyers actually respond before committing inventory.",
          "score": 1,
          "created_utc": "2026-01-23 08:58:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o17osap",
          "author": "Rough-Dragonfly-1898",
          "text": "Not just you PMF doesn’t “reset,” but your assumptions do. UK/Germany often behave like totally different markets in terms of trust, expectations, and even what signals quality. What worked for me was testing demand without going all-in: run localized landing pages, price tests, and small paid traffic experiments before touching inventory/VAT. Also, US lifestyle imagery can read as “try-hard” or inauthentic in Germany, so even if the product is strong, the brand wrapper can tank conversion.",
          "score": 1,
          "created_utc": "2026-01-23 10:06:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o17osvd",
          "author": "Overall_Broccoli_844",
          "text": "100% real. Crossing borders is like restarting PMF on hard mode because your winning combo (positioning + creative + offer + trust) was tuned to US buyer psychology. Germany especially is brutal if your value prop is vague or your price doesn’t match perceived durability/engineering. The fastest way I’ve found is to validate with micro-batches and local feedback loops (native copy, local creators, and customer calls) before scaling spend—otherwise PPC just becomes an expensive way to learn your messaging is wrong.",
          "score": 1,
          "created_utc": "2026-01-23 10:06:30",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qhd1l3",
      "title": "Do loyalty programs actually make people come back, or is everyone just in it for the freebies and discounts?",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qhd1l3/do_loyalty_programs_actually_make_people_come/",
      "author": "Ashwinnie13",
      "created_utc": "2026-01-19 18:53:52",
      "score": 3,
      "num_comments": 16,
      "upvote_ratio": 1.0,
      "text": "I run a little coffee shop/bakery - been at it for four years now. We get plenty of new faces, and people are hyped about the food (reviews are great!), but then… radio silence. Getting folks to come back? That’s the struggle.\n\nWe’ve tried the usual - discounts, happy hour, the works. Sure, people show up for the deals, but as soon as the promos end, so do the visits. Basically, everyone’s just waiting for the next bargain.\n\nNow I’m hunting for a loyalty program that doesn’t feel super pushy or complicated. Been eyeing these QR-based apps (everyone’s glued to their phone anyway) and stumbled on [bonus qr](https://bonusqr.com) while comparing options. Got me wondering - do points and rewards actually get people hooked, or is it just a fancier way to hand out coupons?\n\nBefore I jump in, I’d love to hear from folks who’ve tried this. Do loyalty programs actually build regulars, or do people just show up when there’s free stuff on the line?",
      "is_original_content": false,
      "link_flair_text": "business acumen",
      "permalink": "https://reddit.com/r/startup/comments/1qhd1l3/do_loyalty_programs_actually_make_people_come/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o0kel7t",
          "author": "Mysterious-Ad7547",
          "text": "Disclaimer I run a loyalty rewards app\n\nWe have found SMBs that use our software gather good data for marketing while the customer gets a little reward for their loyalty. It’s still early days for us but so far customers are enjoying their rewards and the merchants seem to be happy.",
          "score": 1,
          "created_utc": "2026-01-19 23:09:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0odpaf",
              "author": "Pristine_Battle_2636",
              "text": "What type of program do you run? the points tracking or the communication?",
              "score": 1,
              "created_utc": "2026-01-20 15:04:23",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0rat49",
                  "author": "Mysterious-Ad7547",
                  "text": "Our app does the rewards side and at the moment no marketing but that’s due by Q2 this year. Like I said it’s still early days bit there are so many features in the road map for us as we gain more customer.",
                  "score": 1,
                  "created_utc": "2026-01-20 23:17:00",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0odkh9",
          "author": "Pristine_Battle_2636",
          "text": "If it is easy and the offer is enticing people do like it. Apps are not it, but text messages.",
          "score": 1,
          "created_utc": "2026-01-20 15:03:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0px6nn",
              "author": "Ashwinnie13",
              "text": "Thanks for the answer!",
              "score": 1,
              "created_utc": "2026-01-20 19:20:24",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0oew78",
          "author": "Lizzi3McGuire",
          "text": "I was at Loyalty360 last year and saw a REALLY cool talk about loyalty programs from a company. Basically it has to be engaging and enticing. People don’t want to download an app unless they are getting something. Let me see if I can find a case study or the company or something. ",
          "score": 1,
          "created_utc": "2026-01-20 15:10:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0pxq9j",
              "author": "Ashwinnie13",
              "text": "Yeah, you're right. thank you",
              "score": 2,
              "created_utc": "2026-01-20 19:22:57",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0omifk",
          "author": "Pristine_Battle_2636",
          "text": "This got me thinking so I looked for some blogs and found this one: [https://www.blings.io/blog/personalization/can-loyalty-still-exist-rethinking-rewards-for-the-tiktok-generation/](https://www.blings.io/blog/personalization/can-loyalty-still-exist-rethinking-rewards-for-the-tiktok-generation/)",
          "score": 1,
          "created_utc": "2026-01-20 15:47:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0pxu79",
              "author": "Ashwinnie13",
              "text": "I'll read it, thanks!",
              "score": 1,
              "created_utc": "2026-01-20 19:23:28",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0r22lu",
          "author": "Big-Swan-8039",
          "text": "Hi ashwinne, I love rewards!  Why don't you find an influencer in your area or outside your area or someone who does reviews - diners, drive-ins and dives - and get them to your coffee shop. \n\n  \nWhat is your WOW factor? Why should people come to you? Be louder!!! \n\nCross market with other business in town.",
          "score": 1,
          "created_utc": "2026-01-20 22:31:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0tyl0q",
              "author": "Ashwinnie13",
              "text": "Honestly, I never thought about an influencer, thank you!",
              "score": 2,
              "created_utc": "2026-01-21 10:25:27",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o117yug",
          "author": "Impossible_Regular58",
          "text": "I think loyalty programs can definitely work, but it depends on how you structure them. If they’re too focused on discounts or freebies, customers might just be in it for the deals and not really build loyalty. However, if you create a system that rewards customers for consistent visits, like earning points for each purchase that lead to meaningful rewards (like exclusive items, early access to specials, etc.), you can help shift the focus from just “getting a freebie” to becoming a part of your regular customer base.\n\nI’ve seen some coffee shops use QR-based loyalty apps successfully where users don’t just collect points, but also get personalized recommendations or rewards that feel more exclusive. The key is to make the program feel valuable beyond just saving money!",
          "score": 1,
          "created_utc": "2026-01-22 12:13:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o19mlpt",
          "author": "Brutus0172",
          "text": "Don't ask us, ask your customers, ask your regulars why they choose you, ask the ones that only come during promotions where they usually go (and why)",
          "score": 1,
          "created_utc": "2026-01-23 16:52:33",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qj7jwb",
      "title": "Early users wanted: help shape a new DeFi platform on Solana",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qj7jwb/early_users_wanted_help_shape_a_new_defi_platform/",
      "author": "MadamGao",
      "created_utc": "2026-01-21 19:26:21",
      "score": 3,
      "num_comments": 2,
      "upvote_ratio": 1.0,
      "text": "Hey everyone,\n\nWe’re two developers who’ve spent the past year building a DeFi platform on Solana. We’re opening a closed beta and are looking for people who want to help shape it early through real usage and honest feedback.\n\n# Why we built this\n\nUsing crypto still feels harder than it should.\n\nEven experienced users end up juggling multiple tools, explorers, dashboards, and half-broken UIs just to answer basic questions like:\n\n* What actually happened on-chain?\n* Did my transaction go through?\n* Why did something fail?\n\nWe’ve both been actively using blockchains for over two years, and if we were running into these issues regularly, it was clear that the UX barrier for newer users is even higher.\n\nOur goal became straightforward:  \nBuild a transparent, community-first DeFi platform that reduces friction, explains what’s happening, and keeps users informed — without requiring 10 tabs or constant explorer checks.\n\n# What’s already live\n\n**Core functionality includes:**\n\n* **Activity Feed** – Discover and trade newly created tokens (on our platform and across Solana)\n* **Token Trading** – Full trading dashboard with charts and key metrics for any Solana token\n* **Swap** – Token swaps across the ecosystem\n* **Token Creation (V1 & V2)**\n* **Token Management** – Metadata updates, authority management, burns, supply locks, fee collection\n* **Liquidity Pool Creation & Management**\n\n# What we’re working on next\n\n* Public release\n* Different types of incubators\n* Deeper protocol integrations (and deploying our own programs)\n* Personalized news feeds\n* A gaming-focused section\n\n# Features we think matter\n\n* **Free API** with full documentation, integration guides, and demo apps\n* **Chain-style activity history** – see everything you’ve done with full context (no explorer needed)\n* **Learning modules** – structured education from beginner to advanced\n* **Step-by-step guides** throughout the platform\n* **4 supported languages**: EN, FR, DE, ES\n* Revenue-generation programs\n\nWe didn’t want to build “another DeFi site with three input fields.”  \nThe goal is something usable, explainable, and extensible — shaped by real users, not assumptions.\n\n# Why we’re opening a closed beta\n\nWe believe DeFi products work best when they’re shaped with the community, not after launch.\n\nWe’re inviting beta users to:\n\n* Test the platform\n* Share honest feedback (good or bad)\n* Suggest features or improvements\n* Help align the product with actual user needs\n\nIt doesn’t matter if you’re:\n\n* A casual user\n* New to crypto\n* A designer\n* A developer\n* Or someone with strong opinions about UX\n\nIf you care about improving DeFi usability, your input is valuable.\n\n# Beta details\n\n* The platform is public but it work based on wallet whitelisting for those who perform transactions\n* **Drop a comment and we will contact you.**\n\n**Notes:**\n\n* No downloads required\n* No wallet connection required to explore\n* Test wallets with SOL can be provided\n* No personal information required\n\nThanks for reading.  \nWe’re looking forward to learning from the community and improving this with your help.",
      "is_original_content": false,
      "link_flair_text": "services",
      "permalink": "https://reddit.com/r/startup/comments/1qj7jwb/early_users_wanted_help_shape_a_new_defi_platform/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o0ytnvq",
          "author": "Project_Extraction",
          "text": "Hey, feel free to send me a DM.",
          "score": 1,
          "created_utc": "2026-01-22 01:28:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o10g10z",
          "author": "meddyjay",
          "text": "good luck",
          "score": 1,
          "created_utc": "2026-01-22 08:08:25",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qkq7cy",
      "title": "Partner or team member",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qkq7cy/partner_or_team_member/",
      "author": "matarrwolfenstein",
      "created_utc": "2026-01-23 13:01:50",
      "score": 3,
      "num_comments": 7,
      "upvote_ratio": 1.0,
      "text": "Hi all,\n\nI’m a UK-based early-stage founder with a live SaaS product in the construction space. We’ve built estimating software specifically for SME construction companies – focused on pricing jobs properly, protecting margins, and reducing the time builders spend stuck behind a laptop at night.\n\nThe product launched last year and is now doing \\~£2k MRR with paying users. It’s already becoming a core operational tool for many of them (not a “nice to have”), and the feedback has been strong. The fundamentals are solid, churn is low, and paid acquisition via Google and Meta is running consistently.\n\nThis year, the goal is to scale meaningfully – targeting £10k+ MRR – and I’m at the point where I don’t want to do that alone.\n\nI’m looking to speak with either:\n\n**1. A partner / collaborator**  \nSomeone entrepreneurial who wants to help grow a real, working product in a defined niche. This could be commercial, content-led, or strategic, depending on fit.\n\n**2. A content-first operator / creator**  \nIdeally someone comfortable being the *face and voice* of the product on social platforms (TikTok, Instagram, LinkedIn, etc.). The content itself is intentionally simple: short, practical videos talking to builders about pricing jobs, common estimating mistakes, margins, overheads, and running a more profitable construction business. No over-produced influencer stuff – just clarity, consistency, and credibility.\n\nI’ve spent years in marketing and know the construction industry extremely well, so you wouldn’t be guessing what to say or who you’re speaking to. I can provide structure, topics, direction, and support. There’s also scope to build tutorial and walkthrough content as the product continues to expand.\n\nThis is very much an open conversation at this stage – I’m interested in finding the *right working relationship*, not forcing a predefined role. Equity, commercial arrangements, or paid + upside models are all on the table depending on experience and involvement.\n\nIf this sounds interesting, feel free to reply or DM me. Happy to answer questions and share more detail about the product, traction, and roadmap.\n\nCheers.",
      "is_original_content": false,
      "link_flair_text": "digital marketing",
      "permalink": "https://reddit.com/r/startup/comments/1qkq7cy/partner_or_team_member/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o19gd53",
          "author": "Practical_Tank8083",
          "text": "Dm",
          "score": 1,
          "created_utc": "2026-01-23 16:24:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o19pvhc",
          "author": "-night_knight_",
          "text": "hey! sure please dm me!",
          "score": 1,
          "created_utc": "2026-01-23 17:07:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o19s0fo",
          "author": "RoyalsValleyFounder",
          "text": "This is a solid place to be — £2k MRR with low churn in a niche where the product is already operationally critical is a good foundation.\n\nOne thought from experience: be clear whether you’re looking for a **growth partner** or a **distribution operator**, because those attract very different people. A true partner will care about pricing, positioning, funnels, and retention. A content-first operator will care about cadence, clarity, and audience trust — and may not want broader ownership decisions.\n\nThe construction angle is actually a big advantage here. Builders respond well to **plain, practical content**, not polished marketing, so the “face of the product” approach makes sense — but credibility matters more than polish.\n\nIf I were evaluating this, I’d want clarity on:\n\n* What growth lever you believe content unlocks that paid ads won’t\n* How success is measured in the first 90 days\n* Whether the role evolves into ownership of a channel or a function\n\nSounds like a real opportunity if expectations are aligned early.",
          "score": 1,
          "created_utc": "2026-01-23 17:17:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1aebth",
          "author": "ssc456",
          "text": "Have sent you a DM. I'm sure you are being flooded but I'm 100% serious and interested in learning more. \nI'm UK based and currently head of technical operations in my current role. \nWould love to arrange a Teams call!",
          "score": 1,
          "created_utc": "2026-01-23 18:58:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1amu8p",
          "author": "alex-clovegrid",
          "text": "Happy to help with design, copy, and positioning.\n\nFeel free to DM.",
          "score": 1,
          "created_utc": "2026-01-23 19:38:06",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qjo6ny",
      "title": "I have few discounted LinkedIn premium coupons",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qjo6ny/i_have_few_discounted_linkedin_premium_coupons/",
      "author": "Then_Ad_8224",
      "created_utc": "2026-01-22 07:29:16",
      "score": 3,
      "num_comments": 1,
      "upvote_ratio": 1.0,
      "text": "for career plan valid  for 3 months \nDM if you are interested",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1qjo6ny/i_have_few_discounted_linkedin_premium_coupons/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o1ctqhe",
          "author": "Then_Ad_8224",
          "text": "DM if you are interested",
          "score": 1,
          "created_utc": "2026-01-24 02:23:43",
          "is_submitter": true,
          "replies": []
        }
      ]
    },
    {
      "id": "1qkls10",
      "title": "im in my last year of highschool and need some business advice (no hate pls)",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qkls10/im_in_my_last_year_of_highschool_and_need_some/",
      "author": "Necessary_Wonder1322",
      "created_utc": "2026-01-23 08:51:36",
      "score": 3,
      "num_comments": 6,
      "upvote_ratio": 1.0,
      "text": "so im in my last year of high school so im going to be really busy this year but I really want to set a good foundation so when I'm in college next year I've got businesses I can work on instead of scratching my head trying to find something new. and what better way to set a foundation than get into content creation. so basically i have 2 \"projects\" i will be working on throughout the year.\n\nbtw these accounts are faceless\n\nthe first - an IB tips/resources account (on Instagram/Tiktok)\n\n* since I do the IB doing something like this makes sense/is easier for me since i kinda know what im talking abt\n* basically i want to grow a following on instagram/tiktok so I can monetise it next year - maybe through starting a tutoring business or promoting tutoring businesses whatever it is\n* currently I just passed 50 followers. basically the content I post on there is like a mix of study tips and memes - I use a couple carousel posts a week, a couple memes and also a couple IB tips reels\n* the thing is for my first couple videos I used an AI avatar but some of my friends said to stop because it just looked bad so ive stopped and now switched to just ai voice so it might be a video of someone studying and then an ai voice in the background giving tips - let me know what you think about this\n* **I've set a goal of 30k followers by December this year and yeah just wanted some advice/tips on how I can achieve that**\n\nthe second 'project\" - a money/business tips account (this one I still haven't really solidifed the purpose yet I'm learning as I go) - on Insta, TikTok & Ytshorts\n\n* I only started this, this week but its always been a passion of mine to do this\n* So right now I'm not really sure what I'm doing - I've been posting reels like \"How did this celebrity get rich\" and they've been doing well but in the future I want to do reels like \"the best times to post content\", \"the best sidehustles for teens to start\"\n* I do use an ai avatar for this but since I edit my content pretty well and include B roll footage as well its not too bad\n* the thing is this type of content takes a while to edit which is why I only plan on having 3 videos a week of this kind and the rest maybe business quotes, movie scenes (such as wolf of wall street) stuff like that\n* **Monetisation** \\- I plan to monetise next year by helping people scale/build their businesses and brands - what else can I do for monetisation?, obviously thats in the future but I want to have something I can work towards. Also, I've seen faceless channels that post memes and stuff and once they've built a following they monetise through things like helping brand owners scale but I don't really want to post bs content - I want to post content thats actually helpful throughout (for example stuff like business strategy/tips)\n* **I want to hit 100k followers by December - do y'all think its possible, any advice?**\n\nWould really like some advice for these 2 projects I'm doing - thanks guys.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1qkls10/im_in_my_last_year_of_highschool_and_need_some/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o17icad",
          "author": "ImperialPartner",
          "text": "If you want to start monitizing instead of building your own IG or TikTok page I would suggest you find 2 to 3 people in your area with business and try and build there personal pages this will be helpful in a year time when you approach people and ask to do the same thing for them … the conversation wont be hi I built my social media page I can also do it for you but rather it will be hi I helped this 3 business owner grow from this to that I can also do the same for you… this shifts the buys mind into thinking that you already proofed what you can do now it just becomes a matter of how much rather the. Have you done this before…",
          "score": 1,
          "created_utc": "2026-01-23 09:05:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o17ndlq",
          "author": "mandevillelove",
          "text": "focus on consistent and valuable content, test what sticks, and grow one audience at a time before monetising.",
          "score": 1,
          "created_utc": "2026-01-23 09:53:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o17s27k",
          "author": "IdeasInProcess",
          "text": "Your friends are right about the AI avatar. It signals spam to the algorithm and to humans. We saw this with our own marketing, raw screenshots of messy workflows performed 40% better than polished AI videos because they looked real. For the IB account, stop trying to be a creator and just document your actual work. Film your notes. Screen record your essay structure. That is the content people actually save. Do not worry about monetising That is a fake guru business model. Monetise by selling the study notes you are already writing.",
          "score": 1,
          "created_utc": "2026-01-23 10:35:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o17z7ik",
          "author": "devhisaria",
          "text": "Hitting 30k and 100k followers by December from scratch is super unlikely especially with school focus on consistent quality content over follower numbers.",
          "score": 1,
          "created_utc": "2026-01-23 11:35:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o19tju9",
          "author": "RoyalsValleyFounder",
          "text": "You’re thinking about this the right way — **foundation > quick wins**, especially with a busy year ahead.\n\n**IB account:**  \nFaceless + AI voice over study footage is fine. AI avatars feel “off” in education because they hurt trust. Study clips + clear voice + on-screen text is much more credible.\n\nI’d tighten:\n\n* One clear promise (e.g. *IB tips that save time*)\n* Memes as **IB inside jokes**, not generic study memes\n* Reels for growth, carousels for trust — keep both\n\n30k by December is ambitious but realistic if you post consistently and lean into formats that get saves/shares (exam seasons matter).\n\n**Money/business account:**  \nBroad business + celebrities grows fast but monetizes poorly. I’d narrow it to:\n\n* Business for teens/students\n* Content & brand building at a young age\n* Documenting what you’re learning in real time\n\nThat builds legitimacy early.\n\n**Monetisation:**  \nYou don’t need this fully defined yet. Strong paths later:\n\n* Digital products (guides, templates)\n* Tutoring/coaching adjacent to the niche\n* Genuine affiliates\n* Services after public proof\n\n100k is possible, but it’ll come from **clear positioning, repeatable formats, and growing** ***with*** **the audience**, not over-editing.",
          "score": 0,
          "created_utc": "2026-01-23 17:24:55",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qksgu9",
      "title": "Build in-house or pay for niche-specific content?",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qksgu9/build_inhouse_or_pay_for_nichespecific_content/",
      "author": "Ok_Access3189",
      "created_utc": "2026-01-23 14:36:57",
      "score": 2,
      "num_comments": 7,
      "upvote_ratio": 0.6,
      "text": "Curious how other founders think about this.\n\nWhen it comes to content (posts, short-form, newsletters):\n\nDo you build it in-house\n\nAutomate with tools\n\nOr outsource completely?\n\nIf a service existed that only served one niche and handled content end-to-end, would that be attractive — or does content need to stay close to the founder/team?\n\nTrying to understand:\n\nWhere outsourcing breaks down\n\nWhat would make you trust an external content provider\n\nWhether this is a real “buy” problem or something founders prefer to own\n\nAppreciate any insights.",
      "is_original_content": false,
      "link_flair_text": "marketing",
      "permalink": "https://reddit.com/r/startup/comments/1qksgu9/build_inhouse_or_pay_for_nichespecific_content/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o18wlmq",
          "author": "Mundane-Stranger-588",
          "text": "Short answer: it depends on your niche.  \nAs obvious as it may sound, If you’re working in a narrow niche, hiring in-house usually makes more sense. You can pass on your expertise directly, while with outsourcing, gaps often appear between how things actually work in your business and how an external specialist presents them.\n\nI’d base the decision on how niche your business is and how you want these processes to work. If you need close collaboration and real synergy, go in-house. If you’re comfortable delegating the task to professionals, outsourcing is a good option.",
          "score": 1,
          "created_utc": "2026-01-23 14:53:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o19pbuw",
          "author": "-night_knight_",
          "text": "what worked for us was to partner up with an influencer who was responsible for all our content on a rev share basis, this is a way easier and faster way than producing content in house",
          "score": 1,
          "created_utc": "2026-01-23 17:04:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o19r63d",
          "author": "RoyalsValleyFounder",
          "text": "I’ve seen this work both ways, but one thing feels consistent: **strategy needs to stay close to the founder, execution doesn’t**.\n\nIn-house makes sense early when you’re still finding voice and positioning. Outsourcing usually breaks when the team doesn’t truly understand the niche and just ships volume.\n\nA niche-specific, end-to-end content service *could* work if it’s opinionated and grounded in real customer insight — not generic playbooks.\n\nMost founders don’t want to own content creation; they want to own clarity. If a service protects that, it’s a real buy.",
          "score": 1,
          "created_utc": "2026-01-23 17:13:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o19wmb8",
          "author": "Hour_Arachnid_2071",
          "text": "Pay for niche. Always.",
          "score": 1,
          "created_utc": "2026-01-23 17:39:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1bkmqd",
          "author": "Embarrassed_Snow_492",
          "text": "I’ve found strategy has to stay close to the founder, but execution doesn’t. Outsourcing usually (in my experience) breaks when the people creating content don’t really understand the niche or the feedback loop.",
          "score": 1,
          "created_utc": "2026-01-23 22:17:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1cvlnr",
          "author": "teadragon25",
          "text": "So far, I've gotten more traffic and views from creating the content myself than from hiring influencers, but I'm new to this so I know I still have a lot to learn",
          "score": 1,
          "created_utc": "2026-01-24 02:34:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1dv4c8",
          "author": "Terrible-Repair-9421",
          "text": "It’s not build *vs* buy — it’s **who owns the POV**.\n\nWhat works:  \n• In-house → positioning, opinions, final say  \n• External/tools → research, drafts, repurposing, consistency\n\nWhere outsourcing fails:  \n• Generic voice  \n• No customer context  \n• Content without outcomes\n\nNiche, end-to-end works **only** if founders keep POV + veto.  \nPeople will outsource execution — **not trust**.",
          "score": 1,
          "created_utc": "2026-01-24 06:35:46",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}