{
  "metadata": {
    "last_updated": "2026-02-23 03:09:58",
    "time_filter": "week",
    "subreddit": "startup",
    "total_items": 12,
    "total_comments": 86,
    "file_size_bytes": 84151
  },
  "items": [
    {
      "id": "1r67nmx",
      "title": "why doesn't education teach you how to fail?",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1r67nmx/why_doesnt_education_teach_you_how_to_fail/",
      "author": "Lol_Panda2004",
      "created_utc": "2026-02-16 11:54:07",
      "score": 18,
      "num_comments": 19,
      "upvote_ratio": 0.96,
      "text": "thinking about this because of a friend in a \"build businesses\" program (he is in tetr college). he failed twice in his first year. first product flopped. second pivot didn't work. third one is finally getting traction. in traditional school this would be: F, F, C maybe. in his program: \"good, you now know what doesn't work\". meanwhile i spent 4 years getting A's by avoiding anything i might fail at. optimized for grades not learning.\n\nnow i'm scared to start anything because i've never failed safely. shouldn't education be the safe place to fail? while stakes are low? before you have mortgage and kids? why do we design education to punish failure when real life rewards learning from it?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1r67nmx/why_doesnt_education_teach_you_how_to_fail/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o5oike1",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 5,
          "created_utc": "2026-02-16 13:38:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5okdss",
              "author": "DoubleReturn5726",
              "text": "Yes, you are right.",
              "score": 1,
              "created_utc": "2026-02-16 13:48:56",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5o4qcw",
          "author": "imbuilding",
          "text": "I guess most people don't see value in failing, and it can be harsh. \nGoing for the safest alternative is not necessarily the worst strategy, it works for most of people.\n\nFailure is not for everyone. It is deeply uncomfortable, and the risks of it going badly are of course higher. However, at the same time, after talking to some people, they never regretted taking the risk.\n\nI think it would be good to prepare people for failure in an educative setting, but it may be irresponsible to prompt them towards the riskier option as a life building goal.\n\nIf you want to start something, go for it. As you haven't failed yet, the first couple of times it might feel horrible, but you will also most likely not regret it. \nIt sounds line you don't have big responsibilities right now, so today is the day to risk it and fail, tomorrow you may not have the privilege",
          "score": 2,
          "created_utc": "2026-02-16 12:06:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5q2rvp",
              "author": "Tim-Sylvester",
              "text": "> I guess most people don't see value in failing\n\nFailure is the only way you learn. Success teaches nothing.",
              "score": 3,
              "created_utc": "2026-02-16 18:12:54",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5q6c88",
                  "author": "imbuilding",
                  "text": "I'd argue otherwise\nlearning doesn't come from failure alone, it comes from reflection, you cannot fail forever. You have to learn from your wins and losses. In an ideal world you would only win and still learn from it, as long as you understand why you won.\n\nHaving a structured approach to that result, whether it's failure or success, will provide you with valuable information.\n\nLearning from success, yours and other's, is important too. Failure should be the fallback option.",
                  "score": 1,
                  "created_utc": "2026-02-16 18:29:01",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o5ucgjc",
                  "author": "IndependentEast-3640",
                  "text": "I gave up far too many times",
                  "score": 1,
                  "created_utc": "2026-02-17 10:17:11",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5op7vt",
          "author": "rjkdavin",
          "text": "OP clearly wasn’t a bad student.",
          "score": 2,
          "created_utc": "2026-02-16 14:15:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6awsy6",
              "author": "OvaMadhya-30",
              "text": "Or paid attention in math, where a lot of the work is learning why and which were the steps that might've failed.",
              "score": 2,
              "created_utc": "2026-02-19 20:24:00",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5p6txz",
          "author": "AdUnlucky2432",
          "text": "Failure is innate it doesn’t need to be taught. What needs to be taught is recovery from failure.",
          "score": 1,
          "created_utc": "2026-02-16 15:44:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5qutsb",
          "author": "Ok-Initiative-4009",
          "text": "this is hitting close to home. spent 4 years at a big tech company doing good safe work. got good reviews, good raises, never really failed at anything because the environment was designed so you wouldn't. then i quit to start something on my own and realized i had no idea how to handle not knowing if what i'm doing is right. the first few months were genuinely scary, not because the work was hard but because there was no rubric. no manager telling me i'm on track. just me making decisions and hoping they're not stupid. my first 5 customer interviews were terrible. asked the wrong questions, talked too much, got useless answers. in school that would've been a fail. in startup world it was just tuesday. i redid them and got better. your friend's program sounds great honestly. i wish i'd had something like that instead of learning to fail for the first time at 29 with my savings on the line. the mortgage and kids point is real. the best time to get comfortable with failure is when the worst case scenario is moving back in with your parents, not missing a mortgage payment. most education has it completely backwards.",
          "score": 1,
          "created_utc": "2026-02-16 20:25:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5r5uzj",
          "author": "augusto-chirico",
          "text": "the problem isn't that education doesn't teach failure - it's that it actively punishes it. your brain gets 20 years of conditioning to avoid the red marks, and then you're supposed to suddenly be fine with launching something nobody wants. the deprogramming takes way longer than anyone admits",
          "score": 1,
          "created_utc": "2026-02-16 21:19:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5s9lq7",
          "author": "shazej",
          "text": "I think education optimizes for standardization, not experimentation.\n\nGrades require clear right/wrong answers. Failure in school usually means “you didn’t meet the rubric.” But in startups, failure often means “you tested something and gathered information.”\n\nThe system rewards predictability because it has to scale to millions of students. Entrepreneurship rewards uncertainty because that’s where opportunity lives.\n\nThat said, you can create your own “safe to fail” environment now. Small bets. Tiny experiments. $50 projects. Landing pages with no product. Things where the downside is embarrassment not bankruptcy.\n\nYou don’t have to jump from straight A student to risking everything. You can build your tolerance for failure gradually.",
          "score": 1,
          "created_utc": "2026-02-17 00:52:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5t0ae8",
          "author": "Connect-Subject188",
          "text": "School is designed to minimize variance, not maximize growth. \n\nConsistency, not experimentation. In real life and especially in startups, you get paid for testing things that might not work. The problem is not that education ignores failure, it is that it penalizes visible failure, if you want to get comfortable with it, you have to build your own small safe experiments outside the system. ",
          "score": 1,
          "created_utc": "2026-02-17 03:34:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5tczq8",
          "author": "ninadpathak",
          "text": "It doesn’t because every parent want their kid to win. Its impossible for everyone to win but who’s going to explain it to the parents",
          "score": 1,
          "created_utc": "2026-02-17 05:01:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5tz1gv",
          "author": "Adorable-Show92",
          "text": "The grading system is essentially designed for compliance and standardized output, which is the exact opposite of the iterative \"guess and check\" nature of building something new. In a typical classroom, a mistake is a permanent deduction from your GPA, whereas in a startup, that same mistake is just a data point that narrows down your path to a viable product.",
          "score": 1,
          "created_utc": "2026-02-17 08:09:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5u8mb7",
          "author": "IdeasInProcess",
          "text": "Totally agree with this because I had to unlearn the fear of failure while scaling my first company from zero. In the logistics of building a startup, a failed pivot is just data that tells you where the market logic is broken. I found that the most successful founders are the ones who treat every error as a necessary debugging step. You should start a small project today with the literal goal of finding where it fails so you can learn to manage the risk.",
          "score": 1,
          "created_utc": "2026-02-17 09:41:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5vxw6q",
          "author": "RoleHot6498",
          "text": "The modern American school system was designed to create factory workers at the beginning of the industrial revolution in the early 20th century. What you do not want in a good factory worker is created intent critical thinking... For the ability to fail and iterate",
          "score": 1,
          "created_utc": "2026-02-17 16:13:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5zs0rb",
          "author": "ElegantAlbatross1165",
          "text": "The mistake is believe you learn books you learn how to learn to keep learning.",
          "score": 1,
          "created_utc": "2026-02-18 03:54:36",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r8ry28",
      "title": "Is anyone else drowning in trying to manage 4+ social platforms while building…",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1r8ry28/is_anyone_else_drowning_in_trying_to_manage_4/",
      "author": "Equivalent-Spend-415",
      "created_utc": "2026-02-19 06:34:15",
      "score": 13,
      "num_comments": 26,
      "upvote_ratio": 0.93,
      "text": "I’ve realized the hard way that my biggest hurdle isn’t the code… it’s the distribution. I spent 3 months building in total silence, and when I finally launched, it was absolute silence. I know the fix is building in public but the sheer overhead is killing my productivity.   \n  \nI am trying to find a way to consistently produce and repurpose content to stay active on LinkedIn for investors, X (Twitter) for the tech community, and now Instagram/YouTube for brand personality. By the time I’ve tailored the founder journey content for each platform's vibe, I’ve lost half a day of deep work. As a solo founder, I can’t afford to be a full-time Social Media Manager, but I also can't afford to be invisible. What’s your workflow for staying visible across multiple channels without losing your focus on the product?",
      "is_original_content": false,
      "link_flair_text": "knowledge",
      "permalink": "https://reddit.com/r/startup/comments/1r8ry28/is_anyone_else_drowning_in_trying_to_manage_4/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o67kmok",
          "author": "Muenstervision",
          "text": "Pick one or two MAX to stay near daily on, use otters more sparingly … define your ICP, drive social currency there.",
          "score": 3,
          "created_utc": "2026-02-19 08:29:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6azg0d",
              "author": "AmiceWong",
              "text": "Yes, i agree",
              "score": 1,
              "created_utc": "2026-02-19 20:37:04",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o67v8x9",
          "author": "TheGrowthMentor",
          "text": "You're on too many platforms. Pick 1x platform and go deep. Covering all the channels you mentioned is 4 different content strategies, 4 different formats, 4 different audiences. No wonder you're drowning. Which audience matters most right now? If it's getting customers, pick where your customers are. HubSpot for Startups has social media scheduling built in so you can write once and schedule across platforms. They also have AI that suggests posts based on your content and does content remixes to save time. Currently they drop their pricing and offer 90% off if you qualify for their startup program and there is t on of free guides [https://www.hubspot.com/startups/ai](https://www.hubspot.com/startups/ai) (NO AFFILIATION) Buffer or Typefully work too but they are not built as CRM so you can't see which posts actually drive leads. ",
          "score": 2,
          "created_utc": "2026-02-19 10:14:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o699nbf",
          "author": "Crescitaly",
          "text": "As someone who's worked with a lot of solo founders on their social media presence, this is one of the most common pain points I see. The good news: you don't need to be everywhere at once. The bad news: most advice about \"just batch your content\" oversimplifies the actual problem.\n\n\n\nHere's what actually works for founders who need to build in public without losing their minds:\n\n\n\nFirst, adopt the 1-2-1 framework. Pick 1 primary platform (where your actual customers/investors are), 2 secondary platforms (where you repurpose with minimal effort), and 1 long-form anchor (blog, newsletter, or YouTube). Your primary platform gets original, tailored content. The secondary ones get adapted versions. The anchor builds long-term SEO and authority.\n\n\n\nFor your specific case - LinkedIn for investors + X for tech community + Instagram/YouTube for brand - here's the efficient workflow:\n\n\n\nStart with LinkedIn. Write one thoughtful post about your founder journey 3x per week. This takes maybe 30 min total if you write from real experience instead of trying to be clever. Then take the core insight from that LinkedIn post and turn it into a shorter X post (5 min). For Instagram, take a screenshot of the LinkedIn post or create a simple carousel from the same content using a template (10 min). That's one piece of content across three platforms in under 45 minutes.\n\n\n\nThe key insight most founders miss: you don't need platform-native content on every platform to start. You need presence and consistency. Perfect platform optimization comes later when you have traction (or budget to hire help).\n\n\n\nSome practical time-savers:\n\n\\- Record 60-second Loom videos of you working or explaining decisions. These become Reels, Shorts, and X clips with zero extra effort\n\n\\- Use a scheduling tool to batch-post everything on Sunday evening\n\n\\- Engage for 10 min after each post goes live, then close the apps\n\n\\- Reply to DMs and comments in one 15-min block at end of day\n\n\n\nThe total time investment should be 3-4 hours per week max, not half a day of deep work. If it's taking more than that, you're overcomplicating the content or trying to be too polished. Raw and authentic performs better than polished anyway, especially in the building-in-public space.",
          "score": 2,
          "created_utc": "2026-02-19 15:41:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o69d4pe",
          "author": "YopBuilder",
          "text": "The fix is not building in public, most likely",
          "score": 2,
          "created_utc": "2026-02-19 15:58:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o678gm8",
          "author": "Striking-Bluejay6155",
          "text": "I would suggest you pre-prep honest, valuable insights and thoughts from your journey to building your project. What worked, what didn’t, what made you want to throw something at the wall. The images should be screenshots or videos of something real, not bs posters made with canva. \nUse the “build in public” trend and use an open source social media scheduling tool to post 1-2 a week about this journey, always framing it around the problem you identified and how you propose to solve it. \nAvoid writing the posts with ChatGPT. Mistakes, weird cadence and honesty always wins. Don’t include links in the post body, always in the comments on your posts. \n\nHope this helps",
          "score": 3,
          "created_utc": "2026-02-19 06:39:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o67azrx",
          "author": "No-Entertainer-9810",
          "text": "Are you looking at part time hiring for this?",
          "score": 1,
          "created_utc": "2026-02-19 07:00:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o67nun3",
          "author": "Selfgrowthseeker",
          "text": "Yep!! Just build a a content system using Reflit because I was struggling so much. I spent a whole year building an app on Flutterflow and realised I should’ve been posting more for distribution 🤦‍♀️ also not sure of the budget but I have VA I pay $29 aud a day to help!\n\nI basically built out something that lets me use one idea and then turns it into little posts so can keep track of repurposing my ideas too! So organizing by idea is helpful as well.",
          "score": 1,
          "created_utc": "2026-02-19 09:01:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o67pr5g",
          "author": "Round_Bullfrog_4563",
          "text": "I advice you to focus more on marketing, less on building. Don't build features no one wants. Yeah its fun to code, change css and get the dopamine hit. Unfortunately the thing that you built it in 3 months, someone with Clawbot built it in 1 day. \nHaving failed previously, now my approach is completely stop building features before I find a client. I've scrapped 190k real estate, 450k ecom, 127k accountant and plenty other leads of many niches. Now I'll cold email them and build B2B softwares for them",
          "score": 1,
          "created_utc": "2026-02-19 09:20:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o67uli2",
          "author": "koorb",
          "text": "I have an automation that posts to my product's LinkedIn page every day. I don't like it, but it fits my product.",
          "score": 1,
          "created_utc": "2026-02-19 10:08:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o68juzs",
          "author": "life_Bittersweet",
          "text": "What product are you building?",
          "score": 1,
          "created_utc": "2026-02-19 13:22:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6aorgw",
          "author": "chrisf_nz",
          "text": "Hootsuite and other similar tools enable you to schedule posting the same content to multiple platforms.",
          "score": 1,
          "created_utc": "2026-02-19 19:44:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6bl9m2",
          "author": "live-unbound-life",
          "text": "I went through this exact phase and realised I was trying to “custom create” content for every platform.\n\nWhat helped was picking one primary platform and treating the others as distribution, not creation.\n\nInstead of tailoring the message each time, I built one core idea per week and repurposed it with minor formatting changes.\n\nAlso — I stopped trying to be present everywhere daily. Depth on one platform > surface-level on four.\n\nThe mental load drops significantly when you reduce decision points.",
          "score": 1,
          "created_utc": "2026-02-19 22:24:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6bux24",
          "author": "shazej",
          "text": "You don’t need 4 platforms.you need 1 primary and 1 secondary. Create once, distribute everywhere with light edits. Batch content weekly schedule it and protect deep work hours like they’re investor meetings. Distribution shouldn’t replace building it should support it",
          "score": 1,
          "created_utc": "2026-02-19 23:18:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6dbpzp",
          "author": "HeadPresent4399",
          "text": "Distribution is brutal, turning your build process into content instead of a separate task is the only way I’ve stayed consistent.",
          "score": 1,
          "created_utc": "2026-02-20 04:47:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6eia2t",
          "author": "ArrogantJeet",
          "text": "yes, had the same overwhelm juggling multiple socials and building, so i built an extension called quick tweet which lets you post or save your ideas anytime without leaving your browser, no X api, no login, just quick and light weight\n\nlink: [https://chromewebstore.google.com/detail/quick-tweet/kapnaggekmffackmkhkjngbaefebaenj](https://chromewebstore.google.com/detail/quick-tweet/kapnaggekmffackmkhkjngbaefebaenj)",
          "score": 1,
          "created_utc": "2026-02-20 11:05:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6kiorg",
          "author": "levichambers_1",
          "text": "tailoring content per platform and doing it manually kills time..\n\nthe solution is- automation + batching.. create content once, repurpose across platforms with customization, schedule everything in advance.\n\ncontent studio does this (where i work).. unified composer lets you write base content then customize tone/format/length for linkedin/twitter/instagram/youtube all in one screen.. takes 10 mins instead of half day..\n\nyou batch create on weekends, schedule for the week, spend weekdays building product.. the visibility happens automatially without killing your focus",
          "score": 1,
          "created_utc": "2026-02-21 08:05:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6mtko8",
          "author": "BizClearAI_Founder",
          "text": "Use one of the social media orchestration platforms and schedule out your socials.",
          "score": 1,
          "created_utc": "2026-02-21 17:41:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o67po1s",
          "author": "7thparadise",
          "text": "Staying invisible on socials is a big miss for sure. Have you tried using a dedicated platform to automate these tasks? \n\nI work with SocialBu. You can use it to:\n\nBatch your week using the bulk scheduler. If your content is queued up for the week, you can stay in deep work mode without worrying about your feed going silent. \n\nCentralise your engagement. Use a unified inbox to handle all DMs and comments. You won't miss a message from an investor on LinkedIn just because you were busy on X. \n\nAutomate the routine. Set up automation rules to post from your blog or RSS feed. This keeps your side projects visible while you focus on your main work.\n\nSince you are a founder, you should check out our SocialBu for Startups program. We offer a specific perk where eligible startups get full access to our advanced tools for 2 to 5 months to help them scale. \n\nHope it helps. :)",
          "score": 0,
          "created_utc": "2026-02-19 09:19:51",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r9tbx7",
      "title": "If your job disappeared tomorrow, what would actually change?",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1r9tbx7/if_your_job_disappeared_tomorrow_what_would/",
      "author": "wealthymanwithmoney",
      "created_utc": "2026-02-20 11:51:32",
      "score": 8,
      "num_comments": 3,
      "upvote_ratio": 1.0,
      "text": "A while back I had a strange realization.\n\nI was working hard, staying late some days, hitting targets, doing everything “right.” & one evening it hit me that if I stopped showing up tomorrow, the company would continue just fine. They’d replace me. Projects would move on but deadlines would still exist & that’s not a complaint. That’s just how organizations work.\n\nWhat bothered me wasn’t that I was replaceable. It was that I wasn’t building anything that would continue without permission. All my effort was increasing my value inside someone else’s system. My skills were improving, yes. My salary was stable. But my independence wasn’t increasing at the same rate. It made me rethink what progress actually meant.\n\nA job can teach you discipline, structure, even confidence but if all your growth lives inside a salary cycle, your ceiling is decided by something you don’t control.\n\nThere’s nothing wrong with working a 9-5. I still respect it. But that realization changed how I think about ownership. I will start making side streams of income now!!",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1r9tbx7/if_your_job_disappeared_tomorrow_what_would/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o6kaasp",
          "author": "GrouchyGovernment784",
          "text": "Probably less than people think.\n\nThe tools would change. The interface would change. The company name might change. But the demand for instant answers, brainstorming help, coding assistance, and late-night “explain this to me like I’m five” wouldn’t.\n\nIf this job disappeared tomorrow, something else would fill the gap because the need is the real thing, not the title.\n\nTech changes fast. Human curiosity doesn’t.",
          "score": 1,
          "created_utc": "2026-02-21 06:46:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6v1hzo",
          "author": "2xOHSman",
          "text": "Act on the move you were always supposed to make but never did",
          "score": 1,
          "created_utc": "2026-02-22 23:35:14",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1ra4utl",
      "title": "Looking for startups to intern for",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1ra4utl/looking_for_startups_to_intern_for/",
      "author": "Lord__Sam",
      "created_utc": "2026-02-20 19:24:52",
      "score": 7,
      "num_comments": 34,
      "upvote_ratio": 0.82,
      "text": "Hey there!  \nI'm a 3rd year design student, and as the title suggests, I'm looking for intern for some startup!\n\nThis is mostly to get experience and work towards something meaningful  \nI'm hoping to intern for a tech startup (I'm a tech nerd),  \nWill work for free if the product is interesting\n\nAbout me:-  \nI'm a human computer interaction designer.\n\nPreviously designed and built 2 products  \nhave competed in and won designathons (I'm insanely fast)  \nCan design UI's, webpages, conduct tests on existing products  \nhave previously conducted usability testing on Saas products and delivered results.  \nCan add value with 100% certainty, I'm self motivated and take accountability of my work.\n\nIf you have any questions or want me to share my portfolio let me know  \nAny recommendations or advice will be helpful.  \nThanks",
      "is_original_content": false,
      "link_flair_text": "knowledge",
      "permalink": "https://reddit.com/r/startup/comments/1ra4utl/looking_for_startups_to_intern_for/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o6h6i8y",
          "author": "chrisf_nz",
          "text": "Which tools do you use?  Figma?",
          "score": 2,
          "created_utc": "2026-02-20 19:28:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6h6m87",
              "author": "Lord__Sam",
              "text": "for Ui design, yes",
              "score": 1,
              "created_utc": "2026-02-20 19:29:30",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6h6yt6",
          "author": "Playful-Analyst6425",
          "text": "Do you wanna audit our SaaS software? We can offer an internship",
          "score": 2,
          "created_utc": "2026-02-20 19:31:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6h740o",
              "author": "Lord__Sam",
              "text": "sure, check dm",
              "score": 1,
              "created_utc": "2026-02-20 19:31:52",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6hcwom",
          "author": "ebizreview",
          "text": "Are you interested in AI Automations? ",
          "score": 2,
          "created_utc": "2026-02-20 19:59:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6hehxh",
              "author": "Lord__Sam",
              "text": "Hell yeah!  \nCan u share a bit more?",
              "score": 2,
              "created_utc": "2026-02-20 20:07:39",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6hfb0k",
                  "author": "ebizreview",
                  "text": "Sent a DM",
                  "score": 2,
                  "created_utc": "2026-02-20 20:11:35",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o6o4f4e",
              "author": "Reasonable_Cod_8762",
              "text": "Hey can I dm you my resume",
              "score": 1,
              "created_utc": "2026-02-21 21:41:26",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6o4pcb",
                  "author": "ebizreview",
                  "text": "Yes\n\n",
                  "score": 1,
                  "created_utc": "2026-02-21 21:42:55",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6ixhd6",
          "author": "DistinctWindow1862",
          "text": "Interested in edtech?\n\nBuilding a private tutor for everyone at chickytutor.com\n\nFor now it's an AI language tutor and users love it. Scaling quite well \n\nThe vision is to build an AI school with multiple private tutors that work as voice agents but can also create generative UX. \n\nA bit like the demos at synthesis.com but the UX is not predetermined. The ai tutor is simply guided and autonomous to generate UX on the fly. \n\nLet me know if interested!",
          "score": 2,
          "created_utc": "2026-02-21 01:00:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6j1j91",
              "author": "DistinctWindow1862",
              "text": "I wanted to add that on top of generative UX I also consider Voice UX to be a beautiful challenge. \n\nWhat should the tutor say first. How should he behave and should he have subtitles. Should there be an avatar and what does it look like.",
              "score": 2,
              "created_utc": "2026-02-21 01:26:07",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6j22yj",
                  "author": "Lord__Sam",
                  "text": "I did a course on conversational ai this sem, would love to apply my learnings to a real product.",
                  "score": 2,
                  "created_utc": "2026-02-21 01:29:36",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            },
            {
              "id": "o6j1kow",
              "author": "Lord__Sam",
              "text": "Woah!! it is insanely cool",
              "score": 1,
              "created_utc": "2026-02-21 01:26:22",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o6l5jv8",
              "author": "Lord__Sam",
              "text": "Check dm",
              "score": 1,
              "created_utc": "2026-02-21 11:48:02",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6j29gr",
          "author": "ohthatguy12",
          "text": "hey I’m building an ecommerce platform for small businesses, you can check it out, it’s called E2C Store. i’ve been thinking about bringing someone on the team for a while, if it interests you, do let me know.",
          "score": 2,
          "created_utc": "2026-02-21 01:30:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6lvie3",
              "author": "Lord__Sam",
              "text": "check dm\n\n",
              "score": 1,
              "created_utc": "2026-02-21 14:47:19",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6ml6eg",
          "author": "infogion",
          "text": "If half the things you wrote about yourself are true, you should not be working for free...now if you are desperate, well...that's another matter.",
          "score": 2,
          "created_utc": "2026-02-21 16:58:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6n6001",
              "author": "Lord__Sam",
              "text": "I'm still in college, now's time to learn and grow. I can always earn after having a solid body of real projects shipped.  \n: )",
              "score": 1,
              "created_utc": "2026-02-21 18:42:46",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6oo1t4",
          "author": "a_venture_capitalist",
          "text": "Seems like you have a lot potential opportunities already hahah congrats!! I have quite a few suggestions but feel free to dm me to connect 🙏🏼🙏🏼",
          "score": 2,
          "created_utc": "2026-02-21 23:32:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6oq5ao",
              "author": "Lord__Sam",
              "text": "hehe, sure  \ncheck dm",
              "score": 1,
              "created_utc": "2026-02-21 23:45:03",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6k51b2",
          "author": "elmozilla",
          "text": "Ooh, would a language learning app be potentially interesting to you? Pm me your portfolio?",
          "score": 1,
          "created_utc": "2026-02-21 05:59:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6kc9w7",
          "author": "Perfect-Complaint136",
          "text": "If you're interested in cracking into Emotional Wellness space where Human Behaviour and Design Interaction is critical, we can discuss the opportunity.",
          "score": 1,
          "created_utc": "2026-02-21 07:04:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ky255",
          "author": "marqr-io",
          "text": "Let us know if you’d like to contribute to [Marqr](https://marqr.io)",
          "score": 1,
          "created_utc": "2026-02-21 10:37:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6lc03e",
          "author": "bunnydathug22",
          "text": "Let us know if you wanna intern for us [citadel nexus inc](http://Www.citadel-nexus.com)",
          "score": 1,
          "created_utc": "2026-02-21 12:41:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ma68h",
          "author": "Otherwise_Wait5165",
          "text": "Dm me",
          "score": 1,
          "created_utc": "2026-02-21 16:04:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6mkor4",
          "author": "Due_Philosophy1174",
          "text": "Can you let us know if actually going an position within these companies that are commenting on your post? You don't have to say the name of course",
          "score": 1,
          "created_utc": "2026-02-21 16:56:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6n5nbk",
              "author": "Lord__Sam",
              "text": "I haven't committed to any project yet! Though some projects are good challenges\n\n",
              "score": 1,
              "created_utc": "2026-02-21 18:41:03",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6mtk2w",
          "author": "kshitij_rai1904",
          "text": "Dm if you’re based in delhi",
          "score": 1,
          "created_utc": "2026-02-21 17:41:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6pgi60",
          "author": "Stanislav_R",
          "text": "I'm building first independent automatic video memories app for 2 years. There is a decent userbase already, but I'm preparing it for a global release, and your review of new/old visual design and UI/UX would be extremely helpful.\nPlease check it out for free here: momentino.app\n\nDM me - I'll be happy to have a quick chat and tell you more",
          "score": 1,
          "created_utc": "2026-02-22 02:31:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6qf9wz",
          "author": "jasmeet0817",
          "text": "I'm working on Dialogue (http://bookdialogues.con) DM if interested",
          "score": 1,
          "created_utc": "2026-02-22 06:53:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6v1dcn",
          "author": "2xOHSman",
          "text": "What an amazing response you got. Got for not ! Good luck",
          "score": 1,
          "created_utc": "2026-02-22 23:34:29",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r71ttj",
      "title": "Becoming a founder to help people with poor mental health.",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1r71ttj/becoming_a_founder_to_help_people_with_poor/",
      "author": "justchoo",
      "created_utc": "2026-02-17 09:47:13",
      "score": 6,
      "num_comments": 10,
      "upvote_ratio": 1.0,
      "text": "Building Fog of Mind: practical mental health support for high-pressure UK workplaces (NHS, education, construction)\n\nI’m John, UK-based, ex-British Army and now a risk manager. I built **Fog of Mind** after my own run-in with depression and years of watching capable people go quiet, burn out, or break, usually long before anyone calls it “a mental health issue”.\n\n# The problem I can’t unsee (and the numbers back it up)\n\nThese are three sectors where stress is not a footnote, it’s baked into the job:\n\n* **NHS:** In the NHS Staff Survey 2024, **41.63%** of staff said they felt unwell due to work-related stress, and **55.77%**reported going to work despite not feeling well enough to do their duties. ([nhsstaffsurveys.com](https://www.nhsstaffsurveys.com/static/c1a573e95b1a49428676ef4b24f5efe7/National-Results-Briefing-2024.pdf?utm_source=chatgpt.com))\n* **UK education:** Education Support’s Teacher Wellbeing Index reports **77%** of education staff experience symptoms of poor mental health due to work, and **49%** say workplace culture negatively affects their mental health. ([educationsupport.org.uk](https://www.educationsupport.org.uk/resources/for-organisations/research/teacher-wellbeing-index/))\n* **UK construction:** Construction workers have been reported as being at **3.7x higher** risk of suicide than the national average (citing ONS), with evidence also pointing to **507 suicides in construction in 2021**. ([Mates in Mind](https://www.matesinmind.org/news/mental-health-in-uk-construction-the-statistics?utm_source=chatgpt.com))\n\nZoom out and it’s not just a “wellbeing” issue, it’s a productivity and stability issue: in Great Britain, **40.1 million working days** are lost due to work-related illness and injury, with an estimated **£22.9bn** cost (2023/24). ([HSE](https://www.hse.gov.uk/statistics/overview.htm))\n\n# Why this feels urgent (and why I’m building a startup around it)\n\nBecause the current pattern is predictable:\n\n1. people struggle silently\n2. performance drops, relationships fray, absence increases\n3. the “support” arrives late, or not at all\n\nA lot of workplace mental health support is either too generic, too reactive, or too divorced from real working life. Fog of Mind is built around **early, practical intervention**: simple tools, conversation prompts, and routines that help people create headspace before things hit crisis level. It’s **not therapy**, and it doesn’t pretend to be.\n\n# What I’m looking for from the startup community\n\nIf you’ve built or scaled something in a regulated, people-heavy space (health, education, construction, HR), I’d value input on:\n\n* the fastest route to **first pilots** without getting trapped in procurement cycles\n* whether to start with **SMEs** (especially construction) vs going straight at enterprise/public sector\n* what you’ve found works for **pricing** practical workshops + ongoing support (without selling “wellbeing theatre”)\n\n.",
      "is_original_content": false,
      "link_flair_text": "knowledge",
      "permalink": "https://reddit.com/r/startup/comments/1r71ttj/becoming_a_founder_to_help_people_with_poor/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o5uhfl5",
          "author": "AM04_z7",
          "text": "Hi John, I think Fog of Mind is a great idea. The following is my take on the entire thing\n\n1. If you are pushing this towards business, the primary idea needs to shift from well-being, to impacts on their business due to a quantifiable change in well-being( risk reduction). Then possibly push wellbeing as a second part.\n\n2. I would recommend SMEs to go with, your background and experiences would work in your favour in pushing the change. Additionally,  you could also take a look at sectors that would easily adopt what you have; it is likely that there is going to be some \"cultural\" resistance to the entire concept of well-being.\n\n3. Pilots needn't be perfect for you, but I think they would need to be fast. Say 2-3 paid pilots, some testimonials and most definitely before and after data. You also use this to farm urgency.\n\n4. As for the pricing, it is imperative in my opinion that you don't price yourself on the lower end of the spectrum. It might be easier to sell initially but once you ramp up operations it will come to bite back at you.\n\nAgain these are just my thoughts on it, hopefully this helps you out in some capacity.\n\nAnd Best of Luck!",
          "score": 3,
          "created_utc": "2026-02-17 11:01:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5uru65",
              "author": "justchoo",
              "text": "Thank you so much 😊",
              "score": 1,
              "created_utc": "2026-02-17 12:24:24",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5v0d1i",
          "author": "esterling",
          "text": "We’ve built a number of projects and applications for the medical sector (for example, [Mysti AI](https://lexogrine.com/success-stories/mystiai)). Many of them were startups, and their access to the market was fairly limited. The main challenges founders ran into were significant legal complexity and strict requirements around processing medical data (by definition, the most sensitive category of data), long, and sometimes very long, procurement cycles on the enterprise side, and often a certain reluctance to adopt new solutions.\n\nBased on that experience, I’d suggest starting with mid-sized organizations (10+, or even 50+ employees). Their budgets are typically large enough to make room for buying new solutions, their teams are big enough that chronic stress and burnout already meaningfully impact overall organizational performance, and their willingness to adopt innovation is often still high because they usually don’t have “ossified” processes. In large enterprises, even a small change can have major downstream consequences, so they are often less eager to introduce change.\n\nAn SMB customer base also helps you build experience and a track record that should make it easier to win enterprise clients later.\n\nHope this helps!\n\nFast iteration will be critical, because the market is highly competitive right now and you need to test multiple approaches to land on the best offer. At the same time, AI creates room for more flexibility, meaning you can deliver functionality that is more tailored to each client. Still, a human supervisor for the code will remain essential given the sensitivity of the data. I wouldn’t trust approaches like “vibe coding” in this context.",
          "score": 2,
          "created_utc": "2026-02-17 13:19:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5v4b1m",
              "author": "justchoo",
              "text": "Great insights. Thank you for taking g time to replay. Much appreciated",
              "score": 2,
              "created_utc": "2026-02-17 13:41:47",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o60yj4k",
          "author": "NatAllie_D",
          "text": "This is a brilliant idea and I wish you well I have a similar kind of idea helping undiagnosed women with the ADHD and anxiety struggles as the numbers this year as so many women hit 35+ are increasingly high. Trying to get any support or preventative support is just not an option with the NHS waiting list become in so long.. my brainstorming is still in the beginning stages at the moment but I'm hoping to build a community with a little extra, that can help people get back into work stay in work or start their own small business that can fit in better for someone with a neurodivergent brain. \nAll the best with your start up I'll look forward to following your success also",
          "score": 2,
          "created_utc": "2026-02-18 09:44:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o615z82",
              "author": "justchoo",
              "text": "Thank you for your kind words. Your vision is definitely needed. I’ll drop you a DM.",
              "score": 2,
              "created_utc": "2026-02-18 10:50:33",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o619jid",
                  "author": "NatAllie_D",
                  "text": "Brill look forward to brainstorming together",
                  "score": 1,
                  "created_utc": "2026-02-18 11:20:31",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o681ki3",
          "author": "prodigy_ai",
          "text": "Thanks for building this, John. Much needed work — especially in those sectors.",
          "score": 2,
          "created_utc": "2026-02-19 11:11:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5zjle6",
          "author": "Electronic_Shoe8405",
          "text": "Appreciate how grounded this is.\n\nOne thing I’ve seen in regulated spaces — pilots move faster when framed as risk reduction, not wellbeing. Especially in construction and healthcare.\n\nSMEs might be easier to close, but enterprise/public sector gives you stronger validation once you crack it.\n\nHave you thought about starting with one hyper-specific use case (e.g. burnout prevention for shift managers) instead of a broader mental health angle?\n\nCurious how you’re planning to measure impact without it turning into another “wellbeing initiative” box-tick exercise.",
          "score": 1,
          "created_utc": "2026-02-18 03:03:33",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r7xnmw",
      "title": "Same product. same price. dubai customers bought the dream. singapore customers bought the logic.",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1r7xnmw/same_product_same_price_dubai_customers_bought/",
      "author": "Acer53",
      "created_utc": "2026-02-18 08:36:54",
      "score": 5,
      "num_comments": 1,
      "upvote_ratio": 0.86,
      "text": "As i was in dubai and Singapore for tetr programme,we ran the exact same product in both dubai and singapore. didn’t change the product. didn’t change the price. everything else had to change.\n\nwhat worked in dubai: people responded to how it looked. clean visuals. lifestyle shots. aspirational tone. the product wasn’t just a tool, it was part of an identity. influencer posts converted better than detailed explanations. the word “premium” did a lot of heavy lifting.\n\nwhat worked in singapore: completely different energy. people wanted to understand what it actually does. practical benefits. comparisons. reviews. proof. specs. they cared less about the story and more about whether it made sense to buy.\n\nsame landing page failed in singapore that worked in dubai. and vice versa. made me realize localization isn’t about language. it’s about psychology.\n\nhave your run ads in different countries? how did market treat you?",
      "is_original_content": false,
      "link_flair_text": "knowledge",
      "permalink": "https://reddit.com/r/startup/comments/1r7xnmw/same_product_same_price_dubai_customers_bought/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o61ygis",
          "author": "hibikiafterdark",
          "text": "Working in creative comms in both cities.   \nLove to learn more on your journey.   \nSeems like awesome learnings.",
          "score": 1,
          "created_utc": "2026-02-18 14:00:15",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1ra3i1y",
      "title": "post your app/startup on these subreddits:",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1ra3i1y/post_your_appstartup_on_these_subreddits/",
      "author": "Ok-Engine-172",
      "created_utc": "2026-02-20 18:35:13",
      "score": 4,
      "num_comments": 1,
      "upvote_ratio": 0.84,
      "text": "post your app/startup on these subreddits:\n\nr/InternetIsBeautiful (17M)\nr/Entrepreneur (4.8M)\nr/productivity (4M)\nr/business (2.5M)\nr/smallbusiness (2.2M)\nr/startups (2.0M)\nr/passive_income (1.0M)\nr/EntrepreneurRideAlong (593K)\nr/SideProject (430K)\nr/Business_Ideas (359K)\nr/SaaS (341K)\nr/startup (267K)\nr/Startup_Ideas (241K)\nr/thesidehustle (184K)\nr/juststart (170K)\nr/MicroSaas (155K)\nr/ycombinator (132K)\nr/Entrepreneurs (110K)\nr/indiehackers (91K)\nr/GrowthHacking (77K)\nr/AppIdeas (74K)\nr/growmybusiness (63K)\nr/buildinpublic (55K)\nr/micro_saas (52K)\nr/Solopreneur (43K)\nr/vibecoding (35K)\nr/startup_resources (33K)\nr/indiebiz (29K)\nr/AlphaandBetaUsers (21K)\nr/scaleinpublic (11K)\n\nBy the way, I collected over 450+ places where you list your startup or products, 100+ Reddit self-promotion posts without a ban (Database) and CompleteSocial Media Marketing Templates to Organize and Manage the Marketing.\n\nIf this is useful you can check it out!! \nwww.marketingpack.store\n\nthank me after you get an additional 10k+ sign ups.\n\nBye!! \n\n\n\n\n\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1ra3i1y/post_your_appstartup_on_these_subreddits/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o6msh75",
          "author": "Perfect-Complaint136",
          "text": "Will give it a shot",
          "score": 1,
          "created_utc": "2026-02-21 17:36:00",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r79ldb",
      "title": "Where does one find the right co-founder?",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1r79ldb/where_does_one_find_the_right_cofounder/",
      "author": "Bubbly-Air7302",
      "created_utc": "2026-02-17 15:49:28",
      "score": 3,
      "num_comments": 19,
      "upvote_ratio": 1.0,
      "text": "I’m more of a visionary, strategic thinker — whilst I can do the nitty gritty I’d prefer to have someone else who is good at operations / finance as I don’t believe that is my strong suit.\n\n**Q is — if your network is limited:**\n\na) are you f\\*cked?\n\nb) if not, where does one find a compatible & trustworthy co-founder?\n\nis it best to start a venture with someone you know or can one feasibly find someone trustworthy who is technically a complete stranger?\n\napologies if this is a dumb question & thank you for your advice.",
      "is_original_content": false,
      "link_flair_text": "knowledge",
      "permalink": "https://reddit.com/r/startup/comments/1r79ldb/where_does_one_find_the_right_cofounder/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o5zad22",
          "author": "chrisf_nz",
          "text": "Just out of interest, what have you achieved to consider yourself a visionary?",
          "score": 3,
          "created_utc": "2026-02-18 02:12:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o63538l",
              "author": "Bubbly-Air7302",
              "text": "Being a visionary or displaying visionary thinking is about the thought process not necessarily achievements. Not that interested in going through all of my achievements though I know I’m capable of thinking about problems/solutions at a grand scale. ",
              "score": 1,
              "created_utc": "2026-02-18 17:21:18",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o63uulk",
                  "author": "joshdotmn",
                  "text": "Thoughts are cheap. Execution is not.",
                  "score": 1,
                  "created_utc": "2026-02-18 19:15:13",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o642ip5",
                  "author": "Successful-Brick-783",
                  "text": "Hard disagree, outcomes are what differentiate \"visionary thinking\" from delusion",
                  "score": 1,
                  "created_utc": "2026-02-18 19:50:36",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5z99f2",
          "author": "shazej",
          "text": "You’re not screwed if your network is small you just have to build it intentionally. Hackathons, startup events, operator communities, even Twitter/LinkedIn DMs. But don’t ‘find’ a co-founder first build something small together. Trust comes from shared execution, not resumes. Starting with someone you know helps, but working on a real problem together matters more.",
          "score": 1,
          "created_utc": "2026-02-18 02:06:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5zjq24",
          "author": "Electronic_Shoe8405",
          "text": "You’re not screwed if your network is small.\n\nBut you probably shouldn’t rush into a co-founder just to fill a gap either.\n\nI’ve seen better outcomes when people work together on a small project first. Something low-stakes. You learn way more from 4 weeks of working together than from 20 coffee chats.\n\nStrangers can work. But trust usually comes from shared stress, not shared vision.\n\nAlso worth asking — do you actually need a co-founder right now, or just someone strong in ops/finance you can contract early on?\n\nWhat stage are you at? Idea or already building?",
          "score": 1,
          "created_utc": "2026-02-18 03:04:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o605s2c",
          "author": "Willing-Training1020",
          "text": "Not a dumb question and no you're not f\\*cked. Limited network just means you have to be more intentional. YC cofounder matching, Indie Hackers, On Deck, and LinkedIn all have people actively looking. The key is to work on something small together before committing, a side project, a few weeks of building, anything that shows how you collaborate under pressure. Starting with a stranger can work but treat it like dating, don't get married after the first date, build the trust first.",
          "score": 1,
          "created_utc": "2026-02-18 05:29:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o60xfjo",
          "author": "NatAllie_D",
          "text": "Oooh thank you for this... This validates a idea I have running around living rent free in my head at the moment. Yes it's another networking idea but I like to do things out of the box too and not follow the norm, so stay turned and I'll hop back on this sub Reddit when I've done some more research myself. Thanks guys & girls",
          "score": 1,
          "created_utc": "2026-02-18 09:33:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o633vkk",
          "author": "KiraKgoesRdt",
          "text": "where are you located? You know there are not only match making events out there but also incubators that help you with this explicitly?",
          "score": 1,
          "created_utc": "2026-02-18 17:15:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o634l38",
              "author": "Bubbly-Air7302",
              "text": "I’m based in DC currently, soon to be back to London.\n\nAnd yes I am aware and would also like to hear about people’s experiences using this type of match service. ",
              "score": 1,
              "created_utc": "2026-02-18 17:19:02",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o66thdk",
          "author": "Unlikely_Handle_4891",
          "text": "That's a million dollar question mate, and you are not alone. \n\nI am a non tech founder running a tech product. Have flipped through 3 tech co founders, always to find missing synergies & compatabilities. It's a journey that you have to keep travelling. \n\nI got the first from my college network (a senior of mine), the second came from a local founder's community and the third one came from an online community.\n\nWhat I have learnt now is that you always start with a trial, dont commit things upfront in excitement. It's exactly like dating, go slow.",
          "score": 1,
          "created_utc": "2026-02-19 04:43:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6acavz",
          "author": "andynadal_",
          "text": "I would go out looking for a Founder for an existing idea, but build a network from people in the space, even startup employees, they might want to start a startup at some point. The founders dynamic is like marriage, you need to know how they work and operate, the most important trait? Stability",
          "score": 1,
          "created_utc": "2026-02-19 18:45:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ccew7",
          "author": "derpingthederps",
          "text": "A stranger is fine... But find the right stranger. \n\nFind someone passionate, interested, and who can communicate with you easily.\nLike, finding a friend.\n\nSet the rules early too. Stake in the business, profit share, etc? \n\nPeople will expect an equal share though, your idea sure, but you want their expertise and until you have revenue... you don't have much leverage. \n\nOr if it's small time... Hire someone on an hourly rate to support your needs. A few hours a week or something.\nIt's also really about what your idea is too and its scale. \nOtherwise, try a business support event for advice.\n\nDon't get hung up on small stuff though",
          "score": 1,
          "created_utc": "2026-02-20 01:00:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6glds6",
          "author": "UnReasonableApple",
          "text": "Never has a visionary person succeeded without a hidden amount of work so great it was indistinguishable from magic.",
          "score": 1,
          "created_utc": "2026-02-20 17:52:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6guwkz",
          "author": "Big-Implement5853",
          "text": "To be honest I just got invited as a Co-Founder + CMO for a startup, and it started from a random request of someone to post something in a community I manage on reddit. \n\nSo just put yourself out there, sometimes in the most random of times you get to meet the right co-founder. \n\nAlso if you want a more direct approach, I would suggest joining online groups, on discord and other websites, going into co-working offices and events. ",
          "score": 1,
          "created_utc": "2026-02-20 18:35:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6nq1ze",
          "author": "siaosiw",
          "text": "Definitely look for someone you know and trust but must have a deep understanding of the financial climate and crypto / blockchain key direction and functionality you want your brand to be or cater to.\nSomeone that imho still has the core ethics of bitcoin at heart if you want something meaningful and lasting. We have seen multiple hype cycles but if it money and money only go for it but the same principles apply.\nPatience will lead you to someone fitting as opposed to trying to vet the noise.",
          "score": 1,
          "created_utc": "2026-02-21 20:25:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6rfee5",
          "author": "Professional_Act9145",
          "text": "I can’t give a specific answer to that cause every situation is unique.. I guess the right co-founder is right for every person for different reasons.. many partner just because the thought the same idea is cool, some for fun, some because the illusion of creating a famous startup and a lot of money, some because they experienced the same problem.. \n\nI would suggest to start sharing your vision or building whatever you can without a co founder and maybe the right person will come along when they see your project, progress etc.. at the end of the day all skills could be taught, if you believe in your vision you should do whatever needs to be done to start building it.. \n\nPs in my opinion visionary and strategic thinker is a good LinkedIn quote but give no value to business and to you as a potential co-founder to others. You should be able and willing to do operations, sales, finance and many more.",
          "score": 1,
          "created_utc": "2026-02-22 12:30:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6vbp6l",
          "author": "2xOHSman",
          "text": "Y combinator cofounder match is truly valuable you must check it out",
          "score": 1,
          "created_utc": "2026-02-23 00:33:11",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r98u0i",
      "title": "How to do you discover and define problems with enough clarity to actually carry to revenue?",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1r98u0i/how_to_do_you_discover_and_define_problems_with/",
      "author": "championofobscurity",
      "created_utc": "2026-02-19 19:30:12",
      "score": 3,
      "num_comments": 10,
      "upvote_ratio": 1.0,
      "text": "I find that my main issue presently is not developing solutions or execution. It's that I can't find problems that have a realistic path forward. I spend most of my time spinning my wheels to find a problem where eliminating the friction is worth paying for. Any thoughts on this?\n\nI find that as knowledge work becomes a core bottleneck, there's a certain degree of sophistication involved where to understand the problem space acutely you also need X years of experience bitching about that same problem. \n\nAny thoughts on how to rectify this aspect of my mindset?",
      "is_original_content": false,
      "link_flair_text": "knowledge",
      "permalink": "https://reddit.com/r/startup/comments/1r98u0i/how_to_do_you_discover_and_define_problems_with/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o6b6kh2",
          "author": "SaltatoryImpulse",
          "text": "Get a deep domain knowledge. \nThat's about it.",
          "score": 1,
          "created_utc": "2026-02-19 21:11:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6bqahv",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-19 22:51:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6dhkii",
              "author": "Unlikely_Handle_4891",
              "text": "very valid suggestions. I have a question, how do you vet out between a frustration vs valid commercialization?\n\nI came across a problem where people see a frustration with a tool and they end up not using it, but when you ask them about a better alternative, they think everything is fine with the existing tool and the problem solved (or the frustration generated) by this tool is small in the larger world of things, so they are ok doing things manually. How do you build convinction in such case?\n\nFor me, it;s truning into a \"car\" vs. \"faster horses\" analogy. People dont know there can be a better alternative so they dont complain about the existing one, and that makes your confidence go awry. How should you think in such a scenario.",
              "score": 1,
              "created_utc": "2026-02-20 05:31:57",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o6fxze2",
              "author": "championofobscurity",
              "text": "Hey thank you for taking the time to respond. This was super insightful.",
              "score": 1,
              "created_utc": "2026-02-20 16:05:21",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6c683k",
          "author": "PineappleManMan18",
          "text": "This is a thoughtful founder/knowledge work thread. Very safe. Best angle is reframing problem discovery as pattern recognition and constraint testing, not inspiration hunting\n\nIn one project, improving visibility into where friction accumulated we noticed this when experimenting with tools like SyndrAI made it easier to see which annoyances were systemic vs situational. The systemic ones were the only ones worth pursuing.  \nThe mindset shift that helped me most: Don’t look for pain. Look for misalignment between effort and outcome. That gap is often monetizable especially when the people living in it already know it shouldn’t be that hard.\n\n",
          "score": 1,
          "created_utc": "2026-02-20 00:23:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6e0u7b",
          "author": "Ok_Balance_6016",
          "text": "I don’t think your issue is execution — it’s proximity to real pain. The reason it’s hard to find problems with a clear path to revenue is that meaningful problems usually live inside specific environments. They’re obvious to people who deal with them daily, but invisible from the outside.\n\nYou probably don’t need X years of experience — you need concentrated exposure. Instead of thinking your way into a problem, put yourself where frustration happens repeatedly. Talk to operators, join niche communities, read complaint threads, and look for patterns.\n\nA simple test:\n\n* Does this happen frequently?\n* Are people already trying to fix it?\n* Does it cost them time or money?\n\nRevenue usually follows urgency and repetition, not cleverness. Clarity comes from immersion, not just ideation.",
          "score": 1,
          "created_utc": "2026-02-20 08:24:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6rdv6z",
          "author": "Professional_Act9145",
          "text": "I can’t talk for all sectors but most of the time if you haven’t worked to a specific sector or have experience and expertise, it’s very hard to understand what is the actual problem.. solutions may vary to the problem, but the core problem in order to understand it correctly you need to have lived it, not heard or thought about it..",
          "score": 1,
          "created_utc": "2026-02-22 12:18:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6s5jbr",
              "author": "championofobscurity",
              "text": "Understanding problems has never been an issue. Besides AI can give me a crash course in the \"Why\" something is bad. \n\nFor me it's strictly visibility. Because you are correct that there are some issues you have to live through.\n\nOn the other hand, people also aren't always aware of the problems they do have.",
              "score": 1,
              "created_utc": "2026-02-22 15:08:48",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6uafk8",
                  "author": "Professional_Act9145",
                  "text": "I get your point and I could agree to some points..",
                  "score": 1,
                  "created_utc": "2026-02-22 21:11:48",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1r7e82e",
      "title": "Would you guys let us create your website for free?👀",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1r7e82e/would_you_guys_let_us_create_your_website_for_free/",
      "author": "IndependentLaw1457",
      "created_utc": "2026-02-17 18:25:20",
      "score": 3,
      "num_comments": 2,
      "upvote_ratio": 0.67,
      "text": "That’s a genuine question. We’re a Web Design Studio that basically operates on a “free services” basis, besides our usual paid plans. Basically, you get to try our services for free.\n\nWe’re fully transparent on how we do things, because we know how strange this may sound😂\n\nWe’re basically collaborating with almost every reputable Hosting Service that you could possibly think of, and in a nutshell, for any of their plans that you choose to host your website, we get paid by them. \n\nNot a percentage of what you pay for, it is a fixed commission. We’re not interested in making you pay for a higher priced plan, it makes no difference to us. \n\nWe’re not the best, and we’re not planning on being known as the best, but certainly care most. That being said, if it sounds like something that might benefit you or someone you know, feel free to reach out to us, here’s a link to our website: https://thatfreewebsite.net \n\nThank you for taking the time to read our message, and I hope everyone is having a really great day!!🫶🏻",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1r7e82e/would_you_guys_let_us_create_your_website_for_free/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o5xf4ev",
          "author": "Low_Piglet_2257",
          "text": "I’m interested!!",
          "score": 1,
          "created_utc": "2026-02-17 20:27:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o61e3ej",
          "author": "Street_Assistant3117",
          "text": "I'm interested, is it a customized website or wordpress template based?",
          "score": 1,
          "created_utc": "2026-02-18 11:55:48",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1radu02",
      "title": "Help fundraising",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1radu02/help_fundraising/",
      "author": "IngenuityFlimsy1206",
      "created_utc": "2026-02-21 01:24:34",
      "score": 3,
      "num_comments": 15,
      "upvote_ratio": 1.0,
      "text": "Hello everyone,\n\nI cold pitched a VC in linkedin. Seems like he’s part of 2 funds, one fund has a website other one doesn’t.\n\nWe had a call scheduled after one or two back and forth messages. Had the call he wanted his technical partner to meet me in a second meeting , VC said his partner is travelling and have times to meet. I reached out and did back and forth, ghosted multiple times and a second meeting was scheduled for demo with the tech partner. We had the meeting he asked few questions about competition and stuff, answered him. Half way he said he is getting a phone call didn’t do the demo, he asked for my phone number, took the number and he left, he said he will let me know when to hop back on\n\nI emailed him, the main VC no reply.\n\nWhat’s going on. Is this normal ?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1radu02/help_fundraising/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o6jeq9w",
          "author": "bravelogitex",
          "text": "keep on following up",
          "score": 2,
          "created_utc": "2026-02-21 02:49:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6jfppy",
              "author": "IngenuityFlimsy1206",
              "text": "I did , sent them one email. No reply lol 😂",
              "score": 1,
              "created_utc": "2026-02-21 02:55:22",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6jzont",
                  "author": "bravelogitex",
                  "text": "Standard rule is follow-up 3 days later and then a week later\n\nAlso this is typical behavior from VC's because they are clueless and generally lack character",
                  "score": 2,
                  "created_utc": "2026-02-21 05:15:54",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6oj0n9",
          "author": "TheGrowthMentor",
          "text": "Fundraising takes a ton of patience, especially in today's market. What stage are you at and what kind of resources are you looking for specifically? The more details you can share, the better advice folks here can give you.",
          "score": 2,
          "created_utc": "2026-02-21 23:01:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6ozjur",
              "author": "IngenuityFlimsy1206",
              "text": "I am raising preseed",
              "score": 1,
              "created_utc": "2026-02-22 00:42:39",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6sg8mc",
          "author": "PeopleOverProfit333",
          "text": "Who cares, you’re gonna die. No one’s coming to save you.",
          "score": 2,
          "created_utc": "2026-02-22 15:59:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6szf8t",
          "author": "P127couk",
          "text": "Yes, it’s normal. Put them on a regular update every quarter and show your progress. It’s a numbers game. Get used to rejections and VCs acting not according to “normal human behaviour” ;)",
          "score": 2,
          "created_utc": "2026-02-22 17:25:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6kxwry",
          "author": "marqr-io",
          "text": "Rejection is a part of the game — if it were me, I wouldn’t follow up as it seems like he isn’t interested.\n\nYou can continue  following up if:\n- he was very excited about your idea.\n- you’re building something revolutionary and he is the right investor for you.\n\n\nOtherwise, I would suggest to give him some space and maybe ask for feedback instead of a pitch. \n\nSometimes even if investors don’t invest in your current idea, they might be willing to do so for a future pitch",
          "score": 1,
          "created_utc": "2026-02-21 10:36:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6oz2dd",
          "author": "FundingConsultant",
          "text": "You can look at it as a process. It’s not only one or two meetings.",
          "score": 1,
          "created_utc": "2026-02-22 00:39:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6ozkwn",
              "author": "IngenuityFlimsy1206",
              "text": "What you think of this ?",
              "score": 1,
              "created_utc": "2026-02-22 00:42:49",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6p0194",
                  "author": "FundingConsultant",
                  "text": "I don’t have the full picture, but sometimes they take time to reply. I any case, I would suggest to explore other alternative funding options too. Some of them are quite fast.",
                  "score": 2,
                  "created_utc": "2026-02-22 00:45:34",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6rrov1",
          "author": "linus_Sam-0107",
          "text": "Is there any way to raise funds to restart the business. I have a healthcare brand but currently want to restart with my own brand tea under the same company? \nAny suggestions please.",
          "score": 1,
          "created_utc": "2026-02-22 13:53:20",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r9qv8w",
      "title": "do apps already know the maximum price you’re willing to pay?",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1r9qv8w/do_apps_already_know_the_maximum_price_youre/",
      "author": "enlightenedshubham",
      "created_utc": "2026-02-20 09:29:51",
      "score": 2,
      "num_comments": 2,
      "upvote_ratio": 0.67,
      "text": "came across this idea in a masters union newsletter and it honestly made me rethink how pricing works on apps.\n\ninstead of showing a fixed “market price,” platforms might be showing your price, based on your habits, device, and past behavior. if you order frequently, they keep prices lower to build habit. if you rarely order, they show higher prices to maximize margin. basically the algorithm might already know how much you’re willing to tolerate.\n\nhas anyone else noticed price differences across accounts or devices?",
      "is_original_content": false,
      "link_flair_text": "knowledge",
      "permalink": "https://reddit.com/r/startup/comments/1r9qv8w/do_apps_already_know_the_maximum_price_youre/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o6fyfyy",
          "author": "Personal-Lack4170",
          "text": "A lot of personalized prices are just A/B tests or location differences",
          "score": 1,
          "created_utc": "2026-02-20 16:07:30",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}