{
  "metadata": {
    "last_updated": "2026-01-01 03:59:57",
    "time_filter": "week",
    "subreddit": "startup",
    "total_items": 10,
    "total_comments": 104,
    "file_size_bytes": 83980
  },
  "items": [
    {
      "id": "1pyg6z8",
      "title": "How to start a blog",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1pyg6z8/how_to_start_a_blog/",
      "author": "hb3th",
      "created_utc": "2025-12-29 07:42:09",
      "score": 35,
      "num_comments": 36,
      "upvote_ratio": 1.0,
      "text": "I am planning to launch a startup in 2026 and want to start a blog alongside it to build organic traffic and brand trust from day one. I am completely new to blogging and content marketing.\n\nWhat should I focus on first in 2026? Platform choice, content strategy, SEO, or promotion? Also curious if blogging is still worth it for startups with AI content everywhere.\n\nWould appreciate advice from founders or marketers who have done this recently.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1pyg6z8/how_to_start_a_blog/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "nwievct",
          "author": "wildour",
          "text": "Start by being clear about why you want the blog. For a startup, blogging works best when it solves real problems for your target users, not when it is just company updates. Pick a niche related to your product or service and write content your ideal customer is already searching for.\n\nNext step is choosing the platform. WordPress is still the safest choice because you own your content and can scale SEO long term. Do not overthink themes or plugins at the beginning. A fast site with clean design matters more than fancy layouts.\n\nContent wise, focus on quality over volume. One helpful post per week that answers real questions will beat ten AI generated posts. Use basic SEO like proper titles, internal links, and clear structure, but write for humans first.\n\nPromotion comes last. Share posts where your audience already hangs out like Reddit, Twitter, or niche communities. Blogging still works in 2026, but only if you treat it as a long term asset, not a quick traffic hack.",
          "score": 6,
          "created_utc": "2025-12-29 07:53:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwj4kvv",
          "author": "TheGrowthMentor",
          "text": "You can start your blog on different platforms like WordPress, Beehiiv, HubSpot Content Hub, Wix etc. Depends how you envision it down the line and what you want to track. I would focus on being original, quality, research topics thoroughly. You should use SEO and AEO both to improve. There are free SEO and AEO graders if you can use. Promotion wise you could maybe start solving and learning about issues on specific subreddits from what your startup is about and grow from there - that way you get very honest feedback immediately. It's defientely worth it! I can add some great resources about this if that would be helpful? Let me know",
          "score": 2,
          "created_utc": "2025-12-29 11:49:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwkev0a",
          "author": "psanilp",
          "text": "If its opinion or content based blog, easy option could be to use Substack. It is trending",
          "score": 2,
          "created_utc": "2025-12-29 16:21:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwlivmx",
          "author": "FounderBrettAI",
          "text": "Start with content strategy first. I'd write 5-10 posts solving problems your target customers search for, then worry about platform and SEO optimization once you know you can consistently produce valuable content. Blogging still works but only if you're offering genuine expertise or unique POV, not just regurgitating the same AI-generated \"Top 10 Tips\" posts everyone else is publishing.",
          "score": 2,
          "created_utc": "2025-12-29 19:28:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwljbvg",
          "author": "Visible_Trade6113",
          "text": "Work on content strategy and organic SEO keywords while writing the blog posts; that would create organic traffic. Make sure you utilise all the key combinations of keywords.",
          "score": 2,
          "created_utc": "2025-12-29 19:30:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwiegos",
          "author": "piyushgoel23",
          "text": "you can create a new blogging website using wordpress, if you have proper knowledge of domains and hosting. else there are websites like Squarespace, Wix and more that is pretty easy to setup a blogging website.",
          "score": 1,
          "created_utc": "2025-12-29 07:49:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwjavii",
          "author": "SergeiSolod",
          "text": "Based on my experience, you should prioritize social media platforms over a traditional self-hosted blog. In 2026, the reality is that social media algorithms actively push your content to relevant audiences, whereas a standalone website often struggles to gain any traction. To be honest, SEO is largely dead for new players because the landscape is oversaturated with AI-generated content, making it nearly impossible to rank. My advice is to build your brand where the attention already is, social networks provide immediate reach and engagement, while a private blog, unfortunately, will likely be ignored by everyone but you.",
          "score": 1,
          "created_utc": "2025-12-29 12:38:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwjoa7d",
          "author": "swertato",
          "text": "Find a SEO agency or a freelancer who can help you.",
          "score": 1,
          "created_utc": "2025-12-29 14:05:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwjrzoo",
          "author": "FudgeLucky8529",
          "text": "Start by choosing one clear topic and audience, then focus on writing useful content instead of worrying about design or traffic. The hardest part is research knowing what to write and what actually matters.\n\nYou can use an AI like  Promti (promti . in) to  handle that part. It helps you research a subject deeply, analyze multiple sources, spot gaps in existing content, and structure blog posts properly. That way you’re not guessing topics you’re writing based on real questions and solid analysis, which is how blogs actually grow, and also its pretty useful for market research and helps in many ways as a start up Good search tool in my opinion",
          "score": 1,
          "created_utc": "2025-12-29 14:26:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwkpwlt",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2025-12-29 17:14:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwmisnd",
          "author": "Golden-heart-rides",
          "text": "Blogs are still super relevant these days and remain a great way for business to connect with people. There are plenty of easy to use platforms out there, with WordPress being a popular choice as needed. When thinking of content ideas and making changes as needed. When thinking of content ideas consider what your customers are asking about observe trending topics on platforms like Reddit, and always keep your actual customers in mind. It's also a good idea to review some SEO basics like using the right keywords and linking internally with your contact. Don't forget to share your blog where your audience is already hanging out and go beyond. Just the biggest social media sites. Find some niche spots to place your blog. Staying consistent with your posting schedule is really important because it helps keep your loyal readers interested. Encourages them to share your content and boost your SEO. All of these things together will help you attract new readers and grow your presence",
          "score": 1,
          "created_utc": "2025-12-29 22:24:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwmiz6x",
          "author": "mouhcine_ziane",
          "text": "Content strategy first Write about real problems in your space authentic founder insights cut through AI noise WordPress is fine, just stay consistent",
          "score": 1,
          "created_utc": "2025-12-29 22:25:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwnb25l",
          "author": "TerryusNo1965",
          "text": "a blog is great building tool for entrepreneurs. SEO would be a great start.",
          "score": 1,
          "created_utc": "2025-12-30 00:56:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwnw2un",
          "author": "FullMacaroon995",
          "text": "Blogging is still worth it in 2026, but only if you do it right.\n\nPriority order:\n\t1.\tContent strategy first\n\t•\tWrite for a very specific audience\n\t•\tShare real experience, mistakes, decisions\n\t•\tGeneric AI-style posts are useless\n\t2.\tSEO comes after\n\t•\tTarget low-volume, high-intent queries\n\t•\tFocus on updates and internal links, not hacks\n\t3.\tPlatform doesn’t matter much\n\t•\tOwn your domain (Webflow, Ghost, Next.js)\n\t•\tMedium/Substack don’t build long-term assets\n\t4.\tPromotion should be light\n\t•\tUse posts to answer questions on Reddit/X\n\t•\tParticipate, don’t spam links\n\nBottom line:\nAI content is everywhere, which makes authentic, experience-based blogs more valuable. It’s slow, but it compounds and builds real trust.",
          "score": 1,
          "created_utc": "2025-12-30 02:52:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwoswy7",
          "author": "NorthRope3703",
          "text": "When was the last time you actually read a blog?  Is this 2010?",
          "score": 1,
          "created_utc": "2025-12-30 06:27:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwpijt8",
          "author": "Vaibhav_codes",
          "text": "Start with clear positioning and content strategy. Blogging still works if it’s experience-driven and specific generic AI content won’t win trust or traffic.",
          "score": 1,
          "created_utc": "2025-12-30 10:20:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwrvoq0",
          "author": "brad-tot",
          "text": "The biggest problem with AI and blogging isn’t slop content- it’s the AI summary people get from search engines. When the answer they want is provided in succinct detail by AI, there’s little reason to scroll down the results to start reading blog posts. It was already a fool’s errand to blog before AI, because content ranking needs so much consistency that the front load cost of blogging without seeing returns is unsustainable. Factor in AI, though, and it’s a hopeless waste of time.",
          "score": 1,
          "created_utc": "2025-12-30 18:32:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwsbane",
          "author": "ASQ_Logic",
          "text": "Blogging can still work in 2026, but relying only on a blog is much harder now, especially with AI content flooding search.\n\nIf you’re starting from zero, I’d keep the blog simple on your startup site and focus more on sharing real problems and learnings rather than trying to “do SEO” perfectly from day one. Basic SEO matters, but distribution matters more. Most blogs fail because no one ever sees the content.\n\nHonestly, I’d strongly suggest starting a YouTube channel alongside it, or even before the blog. Video builds trust much faster, people connect with a face, and YouTube is still a massive search engine. You can always repurpose videos into blog posts, social content, and emails later.\n\nIn 2026, blogs are better for authority and long-term search, while video is better for visibility and trust. Using both together is a much stronger play than blogging alone.",
          "score": 1,
          "created_utc": "2025-12-30 19:46:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwt4kup",
          "author": "merthopia",
          "text": "Stay away from new and trending options. WordPress is the best. The first 10 articles don’t necessarily need to be the best blog posts; after that, focus only on high-quality content.",
          "score": 1,
          "created_utc": "2025-12-30 22:05:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwur1ww",
          "author": "Standard_Effective10",
          "text": "I am building on an idea to make blogging easy. Ping me to check out our MVP. I am sure you will love it",
          "score": 1,
          "created_utc": "2025-12-31 03:31:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwuti71",
          "author": "Mr_Hariharan",
          "text": "Follow your curiosity, but focus on one thing at a time. Learn from mistakes and feedback. Prioritize progress over perfection. adapt, and improve in your own way. Best of luck on your journey 🙌💯",
          "score": 1,
          "created_utc": "2025-12-31 03:46:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwvi5xa",
          "author": "TraditionalDuck5551",
          "text": "Your post helped me deal with the situation, thank you very much.",
          "score": 1,
          "created_utc": "2025-12-31 06:42:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwvuj5x",
          "author": "Extra-Attitude-9196",
          "text": "This helped me more than you know.",
          "score": 1,
          "created_utc": "2025-12-31 08:35:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwwzrqg",
          "author": "Difficult-Ask9412",
          "text": "One thing of starting is just start the rest of it, youll find on the way",
          "score": 1,
          "created_utc": "2025-12-31 14:11:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwjx21l",
          "author": "Pitiful-Gur-4045",
          "text": "Personally, I use Skool for my community; there are lots of advantages, plus I have a link for a 14-day free trial.\n\n\nhttps://www.skool.com/signup?ref=85b7e4d12e0f4970b7128cdb96ed21c5",
          "score": 1,
          "created_utc": "2025-12-29 14:54:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwng66i",
              "author": "mj__1988",
              "text": "I'm not OP but I checked Skool too awhile ago and still can't figure out why/how/what to do about it. I mean it's mostly for course or teaching I honestly don't know what else",
              "score": 1,
              "created_utc": "2025-12-30 01:25:32",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1pxot1i",
      "title": "Setting up a small business website should not feel this complicated",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1pxot1i/setting_up_a_small_business_website_should_not/",
      "author": "redblddrp",
      "created_utc": "2025-12-28 11:03:49",
      "score": 17,
      "num_comments": 24,
      "upvote_ratio": 0.73,
      "text": "I recently helped a family member launch a website for their small business and it was eye opening how many hurdles there still are for beginners.  \nThings like connecting a domain, setting up email, installing WordPress, and enabling SSL sound simple on paper but can turn into hours of trial and error. Especially if the hosting dashboard is cluttered or unclear.  \nWhat made the biggest difference was using a setup that handled most of this in one place and offered clear guidance when something broke. It saved a lot of time and frustration.  \nFor those who build or manage small business sites, what tools or features have made your life easier?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1pxot1i/setting_up_a_small_business_website_should_not/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "nwck44d",
          "author": "pavanasur",
          "text": "One thing I have noticed while working for many of the small startups, is you buy all the things from a same website or platform like domain, hosting ssl etc.\nThe more you buy from different sources the more complex it gets.\nSo the best way to move ahead is with purchasing all the things from one provider only and if anything happens you can directly connect to customer support instead of going to different websites",
          "score": 4,
          "created_utc": "2025-12-28 11:27:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwk7qbk",
              "author": "SpaceForceAwakens",
              "text": "It’s easier but you compromise quite a bit on features. \n\nNamechap’s hosting, for example, is simple, but doesn’t allow for lots of modern feature some sites will need, like running node.js for example.",
              "score": 3,
              "created_utc": "2025-12-29 15:47:45",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nww04w8",
              "author": "TightNectarine6499",
              "text": "Complex for you or your client? Not sure what the complexity is. It’s more expensive and it creates a barrier to switch when service is poor. Plus when they move to different platform they need everything to get transferred or/and archived.",
              "score": 1,
              "created_utc": "2025-12-31 09:29:10",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nwcn2ks",
          "author": "Accomplished-Moose50",
          "text": "Hosting a website is not complicated if you buy SaS. \n\n\nOtherwise, well SSL is complicated, even a basic http server can be complicated + DB + cache, maybe memcache, then a cdn. Shit is complicated and forever will be",
          "score": 4,
          "created_utc": "2025-12-28 11:54:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwhl1fu",
          "author": "autocursor",
          "text": "I’ve built a couple of my own sites and had the same realization - I didn’t need WordPress at all.\n\nThought I “had to” use it because everyone says it’s the standard. Spent hours dealing with hosting, plugins, updates, security patches.\n\nSwitched to Lovable/Netlify, GoDaddy, and the whole thing took 2 hours instead of 2 days. Domain, SSL, hosting all handled. No maintenance headaches.\n\nFor small business sites that just need basic pages and a contact form, WordPress is like buying a semi-truck when you need a bicycle.\n\nBiggest lesson: Don’t use the “professional” tool if the simple tool solves your actual problem.",
          "score": 3,
          "created_utc": "2025-12-29 04:05:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwhn5i9",
              "author": "anonperson2021",
              "text": "Exactly this. I set up static websites using github pages, I get a clutter-free website with exactly the code I want on it and nothing more. Hook up a domain, and done. Granted I know HTML, CSS and JavaScript so this works for me. WordPress is overkill, and I hate all the bloat for a simple static site.\n\nI will also add though, go in this direction only if you are sure it's a static site. The moment you need even a simple contact form, it's not a static site anymore. Thats the other side to this.",
              "score": 3,
              "created_utc": "2025-12-29 04:18:19",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nwd58ng",
          "author": "ssc456",
          "text": "I actually made https://entrynets.com for this reason. There's still some improvement to be made such as custom domain names but it's about as \"1 click\" as you can get",
          "score": 2,
          "created_utc": "2025-12-28 14:08:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwebc7a",
          "author": "Fantst1k",
          "text": "Hello everyone, I wrote a post, but it wasn't published. Does anyone know what the reason might be? I haven't been on Reddit for very long, and that post was my first post in the group. Do I need permission from the moderators or something else?",
          "score": 2,
          "created_utc": "2025-12-28 17:51:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "nww0rsd",
              "author": "TightNectarine6499",
              "text": "Ehm don’t know. Check chatgpt",
              "score": 1,
              "created_utc": "2025-12-31 09:35:20",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nwewey5",
          "author": "No_Selection6049",
          "text": "I assume something like Wix or Square space would be a good fit for this user case. \n\nPersonally I’d be inclined to hand it off to a web designer who specialises in small business though.",
          "score": 2,
          "created_utc": "2025-12-28 19:29:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwgjykv",
          "author": "Wonderful_Ad_9951",
          "text": "Will for me too I don't have a website and I don't have the cash for subscription,  I research for free ways but no results hahaha",
          "score": 1,
          "created_utc": "2025-12-29 00:31:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwgs90n",
          "author": "Buckwheat469",
          "text": "I did Google Cloud Run with Porkbun DNS which automatically registers SSL and has email forwarding.\n\nGCR does Docker containers, so your development is simply a docker build.\n\nEverything except Porkbun is billed through Google as well, and you can scale the instances to 0 so that you're not billed when there's no traffic. \n\nYour database can be run through Google Cloud SQL, running a Postgres database, and you can log metrics to Google metrics. You can then use BigQuery for advanced querying.\n\nUnrelated to Wordpress, I found a unique issue with executing Vertex requests with Google Cloud Run, so I had to move my service to Amazon AWS in order to improve response speed with Vertex. AWS also handles Docker, so moving my services between Google and AWS was extremely easy.",
          "score": 1,
          "created_utc": "2025-12-29 01:17:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwhool8",
          "author": "Wufi",
          "text": "Wordpress? Wait til you build real web apps...",
          "score": 1,
          "created_utc": "2025-12-29 04:28:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwi5yhx",
          "author": "Other-Image-2074",
          "text": "You make a website only once. In my experience, it is better to get a professional to do it for you on a platform like wordpress so that after the launch, you can handle the website yourself.\n\nGet professional help for design, themes, seo setup etc. Then you can handle the site yourself like adding blogs etc.",
          "score": 1,
          "created_utc": "2025-12-29 06:34:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwjar6t",
          "author": "TheGCmind",
          "text": "Zoho sites is all in one package",
          "score": 1,
          "created_utc": "2025-12-29 12:37:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwmzfzo",
          "author": "Morphius007",
          "text": "Not trying to be a jerk, but maybe hire a professional will solve this problem? \nWhat you described is basic level setups. \nA true developer doesn’t even blink at this.",
          "score": 1,
          "created_utc": "2025-12-29 23:53:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwos77n",
          "author": "FudgeLucky8529",
          "text": "It really shouldn’t be, but it feels complicated because you’re forced to make too many decisions at once domain, hosting, content, SEO, tools  without clear priorities. The reality is you only need a simple, clear site at the start that explains what you do, who it’s for, and how to contact or buy. Everything else can come later.\n\nWhat helps is reducing search overload. I use Promti (promti . in) to quickly research website setups, compare tools and approaches, see what similar businesses are doing, and cut through conflicting advice. That way you spend less time researching and more time actually launching.",
          "score": 1,
          "created_utc": "2025-12-30 06:21:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nweqnov",
          "author": "PensionFinancial4866",
          "text": "USE 👉 https://www.encubatorr.com — An AI-powered, all in one startup incubator that helps anyone turn an idea into a real business from scratch, step by step.",
          "score": 1,
          "created_utc": "2025-12-28 19:02:56",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pydbxv",
      "title": "anyone here still working full time but also trying to build a startup?",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1pydbxv/anyone_here_still_working_full_time_but_also/",
      "author": "FormalAd7367",
      "created_utc": "2025-12-29 05:06:07",
      "score": 13,
      "num_comments": 21,
      "upvote_ratio": 0.94,
      "text": "\ni’m a bit stuck with linkedin.  i already have a job, but i also want to start something on the side.\n\nproblem is…  \nmy potential customers are also my vendors. and some are even my colleagues.\n\nnot sure what people usually do.  \n\ndo you make a second linkedin account?  \nor just post quietly on your own profile and hope no one makes it awkward.\n\ni don’t want conflict or weird conversations at work.  \nbut also don’t want to hide forever.\n\nhow did you handle this when you were in between?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1pydbxv/anyone_here_still_working_full_time_but_also/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "nwhwmhq",
          "author": "JCardiff",
          "text": "It will inevitably and eventually get weird. I went through the same experience. You're going to need to decide what you want more. I chose the hard path and it's been over 10 years since. It was the right choice.",
          "score": 5,
          "created_utc": "2025-12-29 05:21:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwhz5bq",
              "author": "FormalAd7367",
              "text": "it’s fairly hard to find a job nowadays and I’m not young anymore.  You obviously had lots of confidence in your gig and i’m not sure about my project",
              "score": 1,
              "created_utc": "2025-12-29 05:39:57",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwi17lh",
                  "author": "JCardiff",
                  "text": "That's fair. I started in my 30s, now in my 50s. I don't know if I would call it confidence.\n\nLet me know how I can help.",
                  "score": 3,
                  "created_utc": "2025-12-29 05:56:05",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwinvml",
          "author": "jonathanbrnd",
          "text": "Build your startup in public on X. Great for B2B SaaS.",
          "score": 8,
          "created_utc": "2025-12-29 09:17:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwmyhrr",
              "author": "foldedlikeaasiansir",
              "text": "What does build in public actually mean?",
              "score": 1,
              "created_utc": "2025-12-29 23:48:31",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nwotb8g",
                  "author": "Hoe_plz",
                  "text": "Like those glass kitchens in restaurants, cooking in public",
                  "score": 1,
                  "created_utc": "2025-12-30 06:31:01",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwhvjst",
          "author": "fkih",
          "text": "After it involved from a side project to a business, I informed my employer I have a potential Conflict of Interest, filled out the necessary forms and disclosures, then started working on my project. Nothing to hide. ",
          "score": 3,
          "created_utc": "2025-12-29 05:13:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwhy260",
              "author": "FormalAd7367",
              "text": "My reporting manager is against any other jobs not related to my job.  I have been approached by a publisher to write a book on my subject but my boss “questioned” it.  Being very passive aggressive.",
              "score": 2,
              "created_utc": "2025-12-29 05:31:44",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "nwvl86a",
              "author": "nope_nop_nop_nop",
              "text": "How did that go busy with that process at the moment a bit of fear there to be honest. The tool im building is not conflict of interest. Been using chatGPT to draft the document fed it to gemini then the AI's went nuts and one told me Im going to get legal involved. Im so scared submitting this document. Omg worst thing ever as I need the full time job so I can build this tool. Is there a template or something somewhere I can use what is best practice here. I am building on my own time using my own personal hardware and tools for this. Still a raher large and daunting step.",
              "score": 1,
              "created_utc": "2025-12-31 07:09:21",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nwvre5a",
                  "author": "fkih",
                  "text": "1. Tell your manager you're working on a project on the side, and ask them if there's any action items needed from your end to make sure you're in compliance with company policy.\n2. Get further action items from manager.",
                  "score": 2,
                  "created_utc": "2025-12-31 08:05:59",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwhvsll",
          "author": "Human_Kitchen947",
          "text": "You do you have a wonderful challenge at hand. I don't think staying in the shadows through a 2nd linkedin account helps your own entrepreneurial ambitions. \n\nI would first vet out the product offering, before you start contemplating sales conversations. Talk to 15-20 people in industry casually and gauge their response. Better still talk to someone who is doing something similar and gauge their progress and numbers. \n\nNext step find 2 customers who are neither vendors not colleagues and start small. Finally set yourself a goal - at what number of customers would you move from the job to full time entrepreneurship. Let it be real yet audacious.",
          "score": 3,
          "created_utc": "2025-12-29 05:15:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwo96pb",
          "author": "Jay_Builds_AI",
          "text": "I’ve seen this a lot. The founders who avoid awkwardness don’t create second identities-they delay positioning.\n\nPost as a learner, not a builder-for-hire. Share insights and observations, not launches or asks. Most conflict comes from claiming a role too early, not from quietly building.",
          "score": 2,
          "created_utc": "2025-12-30 04:08:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwi59nn",
          "author": "Acceptable_Cell8776",
          "text": "A small incident taught me a big lesson: many people in this situation handle it by quietly testing ideas on their existing profile while keeping posts neutral and value-focused. Sharing insights without naming products or directly promoting can attract interest without causing awkwardness. Over time, you can engage selectively and build your network carefully while maintaining professional boundaries at work.",
          "score": 1,
          "created_utc": "2025-12-29 06:29:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwisg6d",
          "author": "Ok_Humor_596",
          "text": "Just create 2nd account",
          "score": 1,
          "created_utc": "2025-12-29 10:00:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwiw64j",
              "author": "FormalAd7367",
              "text": "that was actually my first thought too.  but then i get stuck on the details.\n\nif i make a new account, do i just start adding my existing vendors and customers there like nothing happened?  \n\nwon’t that look a bit strange if they see a “new” profile?\n\nalso not sure about the work history part.  \n\ndo i copy over my past jobs so it looks legit, or do i just list my new venture as the only role and keep it clean?\n\ncurious how others handled this without it feeling awkward or spammy.",
              "score": 1,
              "created_utc": "2025-12-29 10:35:24",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwjudnt",
          "author": "Enwy94",
          "text": "Thats me here. Haha.",
          "score": 1,
          "created_utc": "2025-12-29 14:39:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwmoe15",
          "author": "Accomplished-Cry3390",
          "text": "H",
          "score": 1,
          "created_utc": "2025-12-29 22:53:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwq2e3b",
          "author": "Organic-Author9297",
          "text": "I'm full time undergraduate and currently doing freelancing projects.",
          "score": 1,
          "created_utc": "2025-12-30 13:02:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwsamt6",
          "author": "hammerzzzzzz",
          "text": "Im 55 and in a full time job but also looking at unrelated startup/sidehustle",
          "score": 1,
          "created_utc": "2025-12-30 19:42:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwsk4ht",
          "author": "KwongJrnz",
          "text": "I've worked for my employer for 8 years so far.\n\nThey've watched me:\n- Launch a startup\n- Acquire a SaaS\n- Launch an Agency\n- Grow my agency to 15 clients\n- Launch another startup\n\nI was very upfront with them, and let them know this was not a conflict of interest - they get the 8 hours from me they paid for.\n\nI also let them know that with this exposure and experience, I'm growing faster as a technical professional than ever before- without them needing to spend on that growth.\n\nIts been a really fruitful relationship, despite the fact I work from 8am - 4am, 7 days a week (this is the reality after running a booming startup), to the degree where they've even asked if I'd be interested in solo tackling an ERP they have problems with, funding 50% of it, and using it before selling it to our competitors as well.\n\nI think so long as you're in a different target market than them, you're okay.  You want your LinkedIn to avoid looking like a gig profile though, so keep that in mind.",
          "score": 1,
          "created_utc": "2025-12-30 20:28:32",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pzclr8",
      "title": "Has AI really reduced startup costs, or just shifted them elsewhere?",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1pzclr8/has_ai_really_reduced_startup_costs_or_just/",
      "author": "Worldly-Bluejay2468",
      "created_utc": "2025-12-30 08:15:49",
      "score": 11,
      "num_comments": 18,
      "upvote_ratio": 0.87,
      "text": "I’ve been thinking a lot about how AI is changing the cost structure of starting a business. In areas like e-commerce, getting something off the ground feels significantly cheaper than it used to be. A basic product or store can now be launched much faster, with far less upfront effort and fewer people involved.\n\nWhat I’m unsure about is whether the cost actually disappeared or simply moved. If development and initial setup are no longer the main barriers, it feels like the real challenges now show up elsewhere. Traffic acquisition, distribution, branding, and supply chain decisions seem to matter more than ever, and they often end up costing far more than the product itself.\n\nOnly later did I start looking into AI-driven platforms that bundle a lot of this early work together, like Genstore and similar tools. They clearly lower the technical barrier, but they also make me wonder if the playing field is now flatter than before.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1pzclr8/has_ai_really_reduced_startup_costs_or_just/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "nwp7b8q",
          "author": "AnLe90",
          "text": "Easy to startup hard to rise above the noise and user acquisition",
          "score": 7,
          "created_utc": "2025-12-30 08:36:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwz49mq",
              "author": "Gloomy_Resist_19",
              "text": "How are startups attempting to navigate this ?",
              "score": 1,
              "created_utc": "2025-12-31 20:45:51",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nwqn9mw",
          "author": "who_am_i_to_say_so",
          "text": "Hell yeah it changed things: it raised the costs of being seen. Everyone and their grandmother has a SAAS.",
          "score": 5,
          "created_utc": "2025-12-30 15:03:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwt7x7o",
          "author": "One_Curious_Cats",
          "text": "The playing field is flatter. Most companies are still figuring this out.  \n  \nThis window won't last. Bigger companies will catch up on the AI tooling, customers will raise their expectations, and the technical moat comes back. The head start is real though. It's just not permanent. If you're going to move, move now. :)",
          "score": 3,
          "created_utc": "2025-12-30 22:21:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwrpsde",
          "author": "SirIzaanVBritainia",
          "text": "One thing is team size. For better or worse, now a company can move with less developers.  \ndid the cost disappeat? not exactly, it moved to tools like claude code, cursor etc.. but compated to paying 100 grand to a dev and 40 dollars a month to cursor is cheap. \n\nContent Creation is also one niche I see shining after development, research costs also gone down.",
          "score": 1,
          "created_utc": "2025-12-30 18:05:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwuf8un",
          "author": "rsimmonds",
          "text": "As a founder… yeah, it’s saving a time of cost that is compounding weekly into ROI. Sometimes it’s financial gains and sometimes it’s time efficiencies..",
          "score": 1,
          "created_utc": "2025-12-31 02:20:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwv0l19",
          "author": "Jay_Builds_AI",
          "text": "It’s mostly a shift, not a reduction.\n\nAI compressed build costs and time-to-first-version, but that just exposed the real bottlenecks earlier. Distribution, trust, and differentiation were always expensive-they were just hidden behind months of engineering before. Now everyone reaches “good enough” fast, so competition moves to attention, credibility, and consistency.\n\nAI made starting cheaper. It didn’t make winning cheaper.",
          "score": 1,
          "created_utc": "2025-12-31 04:32:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwvdjaw",
          "author": "gauri_insights",
          "text": "Yes, AI has reduced the start up costs, but it has become much harder for customer acquisition. Every start up has its own AI tool and customers have a lot of choices and many different solutions to choose from.   \nSo yes, the cost has shifted to customer acquisition and marketing it rightly.",
          "score": 1,
          "created_utc": "2025-12-31 06:05:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwve7rq",
          "author": "Alternative_Yard_170",
          "text": "I spend $20/month for ChatGPT Plus and $7/month for Canva, these 2 tools help me with: \n\n1. Create most graphics on my own, without a graphic designer\n2. Create content (blogs, social media posts, articles) without needing a content writer\n3. Brainstorm/research on topics related to my work, without needing an analyst or expensive reports\n4. Do way more work, on my own, without needing a specialist\n\nSo yes, it did reduce costs for my startup by a big margin.",
          "score": 1,
          "created_utc": "2025-12-31 06:10:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwvy2pv",
          "author": "Fancy_Ad8568",
          "text": "You spend less to establish things, but you spend more to run it. These are the times. The worlds tends to balance: easier in one place, harder in other place",
          "score": 1,
          "created_utc": "2025-12-31 09:09:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwxh4p6",
          "author": "Willing-Training1020",
          "text": "i think ai has absolutely reduced *some* startup costs, but it didn’t make starting a business cheaper in a total sense—it changed where the money and effort go. building the first version, setting up ops, even doing basic design or copy is dramatically cheaper and faster now, often by an order of magnitude. but because those barriers dropped, the real constraint shifted to things that ai can’t fully solve yet: distribution, trust, brand, and sustained attention. when everyone can ship fast, shipping fast stops being the advantage. the cost is now paid in experimentation, customer acquisition, and time spent finding signal in a very noisy market. in that sense the playing field is flatter technically, but steeper competitively. ai compresses the “build” phase and inflates the importance (and cost) of getting people to care.",
          "score": 1,
          "created_utc": "2025-12-31 15:44:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx01om9",
          "author": "Shichroron",
          "text": "It killed a lot of thin wrappers and 1-2 feature startups. The solve a problem (but barely) kind of model is dead. Because you can either do it with LLM subscription, it’s so cheap that it’s given for free or it’s now a feature on all larger products",
          "score": 1,
          "created_utc": "2025-12-31 23:56:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwpgaiw",
          "author": "prodigy_ai",
          "text": "For our startup, we’ve massively cut costs on development and content creation. We’re also figuring out how to lower our user‑acquisition expenses, and we’re planning to set up AI‑powered customer support",
          "score": 1,
          "created_utc": "2025-12-30 10:00:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwq1wdd",
          "author": "SergeiSolod",
          "text": "Competition has increased 100 fold. Now, any teenager can create an amazon or booking clone (minimal functionality) in a few months. I can't imagine how these projects will compete with each other, rather, they already are. But I have one guess: whoever has the money to invest (as before and as always) will win. Advertising is crucial. For example, suppose 10 people created the same product, which is easy to do with AI, say, a booking clone. Who will be successful? Not the one who posts a lot on social media or does other things. Someone who bought a lot of advertising, drove 1,000,000 people to the site, and 1,000 remain, and this happens every day. I look at successful AI-powered projects, they generate 50 creative ads a month and spend a lot of money on advertising. And I see projects of the same quality or even better nearby, but which have no users because they advertise on social networks through posts (for free) or through dead SEO =)",
          "score": 0,
          "created_utc": "2025-12-30 12:59:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwq7dcv",
          "author": "AdministrativeArt621",
          "text": "Tech is no longer a barrier or a moat, it’s a commodity. With AI, the real edges are now in execution, design, and selling.",
          "score": 0,
          "created_utc": "2025-12-30 13:33:58",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pvx18o",
      "title": "your first customer is mostly luck, not skill.",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1pvx18o/your_first_customer_is_mostly_luck_not_skill/",
      "author": "Tough_Reward3739",
      "created_utc": "2025-12-26 05:56:05",
      "score": 8,
      "num_comments": 27,
      "upvote_ratio": 0.75,
      "text": "\nNot saying skill doesn’t matter long-term. It does.\nBut early on? Timing, proximity, and being in the right conversation at the right moment matter way more than people admit.\n\nTwo people can do the exact same thing. One gets a paying customer in week one. The other grinds for months. Same effort. Different timing.\n\nI see a lot of early founders beat themselves up thinking they’re bad at sales or marketing, when in reality they just haven’t crossed paths with the right buyer yet.\n\nOnce you get that first win, then skill compounds. Before that, it’s chaos.\n\nDo you believe your first customer was earned, lucky, or a mix of both?\nAnd if you’re still trying to get one, what do you think you’re missing right now?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1pvx18o/your_first_customer_is_mostly_luck_not_skill/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "nvzkruc",
          "author": "Your-Startup-Advisor",
          "text": "Yes, luck is always a variable, but not for the first paying customer. \n\nBefore you build anything, you must do customer discovery. If successful, you build an MVP to solve the problem you discovered during customer discovery and you give the MVP to those you talked to during that stage. \n\nThey are your initial customers, and because you validated the problem and that it’s a very painful one, they will pay for your solution.",
          "score": 5,
          "created_utc": "2025-12-26 06:41:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw0ekls",
          "author": "IdeasInProcess",
          "text": "Make your own luck imo, if your conversion rate is 1%, and you pitch 10 people, landing a customer is luck. if you pitch 500 people, landing 5 customers is math. the skill in the early days isn't being a master salesman (although it helps), it's volume. the founders who seem lucky usually just talked to more people until the law of large numbers kicked in. I guess you can't control the luck, but you can control the number of attempts.",
          "score": 3,
          "created_utc": "2025-12-26 11:43:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwtdquz",
              "author": "gruffbear212",
              "text": "I’d disagree here. It’s not volume when it’s zero to 1. It’s about depth with a few leads who then turn into customer number 1. \n\nScale comes later imo",
              "score": 1,
              "created_utc": "2025-12-30 22:51:35",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nw0mz8m",
          "author": "NoMinute5137",
          "text": "I think it's essential to acknowledge that early success is often a result of being in the right conversation at the right moment. Don't be too hard on yourself if you're struggling to get that first win – it's not a reflection of your skills.",
          "score": 3,
          "created_utc": "2025-12-26 12:56:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw10lhm",
          "author": "PolicyFit6490",
          "text": "Yiz, first customer is usually part luck, skills show up after that😊",
          "score": 2,
          "created_utc": "2025-12-26 14:30:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw176lo",
          "author": "General_Feeling8839",
          "text": "Literally do so much effort to get a client that it would be unreasonable not to get lucky.",
          "score": 2,
          "created_utc": "2025-12-26 15:10:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw1o5iz",
          "author": "Loud_Woodpecker_6620",
          "text": "I think this is super true. I look back to my first customer in sales and there was very little skill involved since I had virtually none. A lot of luck is involved but I think it comes down to two additional pieces. \n\nNumber one, confidence. Where skill is lacking, confidence never can be. Confidence is king, sells more than any individual skill I've ever seen. On my first deal, I had virtually zero skill, but worked hard and was confident. And the deal closed. \n\nSecond, energy. Sales is a transfer of energy, nothing more nothing less. If your energy is off, the customer feels that and backs off and you will sell a fraction of what you could with solid energy. Always check your vibes and energy. \n\nEnergy, confidence, and yes a great amount of luck led me to my first deal nearly 10 years ago.",
          "score": 2,
          "created_utc": "2025-12-26 16:42:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw26ouz",
          "author": "External_Location768",
          "text": "Looking back on my first client, I was very fortunate to be introduced through a friend. That connection allowed me to meet the client. Although the process went through two rounds of back-and-forth, I eventually closed the deal in less than a week. At the time, I attributed the success largely to luck.\n\nHowever, my partners later pointed out that this was only how it appeared on the surface. In reality, I had put in a great deal of effort at every stage and paid attention to many small details. It was precisely the accumulation of these efforts that led to the final, decisive result.\n\nWhen it came to closing my second deal, however, the client was lost. Although the root cause was that the client’s budget was insufficient, I also became aware that I was much more afraid of losing the deal than I had been the first time. I believe this mindset, to some extent, affected my negotiations with the client.\n\nTherefore, I’ve come to realize that whether it is luck or hard work, maintaining a healthy and steady mindset is extremely important. In addition, true growth comes from continuously learning and accumulating experience through repeated practice in every situation.",
          "score": 2,
          "created_utc": "2025-12-26 18:20:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw2orrz",
          "author": "ThisSwimmerisanerd",
          "text": "Your skill CREATES \"luck\"",
          "score": 2,
          "created_utc": "2025-12-26 19:55:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvzh8vz",
          "author": "CMLXV",
          "text": "Most \"success\" is based on luck.",
          "score": 1,
          "created_utc": "2025-12-26 06:09:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvzp8sg",
          "author": "reddit_user_100",
          "text": "You could argue it’s luck but part of being a good founder is maximizing the chances of something lucky happening. That means picking markets where they have an unfair in and hustling as hard as possible to get in front of potential customers.",
          "score": 1,
          "created_utc": "2025-12-26 07:23:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvzsxcg",
          "author": "JCardiff",
          "text": "I’ll take the counter position. Luck is overstated. Hard work and persistence are the determining factors.",
          "score": 1,
          "created_utc": "2025-12-26 08:00:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw0yesu",
          "author": "Immediate_Use_2658",
          "text": "Hard work. Not luck.",
          "score": 1,
          "created_utc": "2025-12-26 14:16:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw136l7",
          "author": "Sudden-Context-4719",
          "text": "First customers are mostly luck for sure. If you’re stuck, try finding where your buyers hang out and join those convos early. Tools like SocListener helped me spot sales posts on Reddit fast and jump in with tailored replies instead of guessing where to look.",
          "score": 1,
          "created_utc": "2025-12-26 14:46:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw2wewv",
          "author": "MehulFanawala",
          "text": "I just onboarded my first customer for the SaaS I launched 5 days ago. I'm waiting for the email I sent to the customer asking the reason what made him purchase my product.",
          "score": 1,
          "created_utc": "2025-12-26 20:38:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw2x9zh",
          "author": "razarauff",
          "text": "I think it's a mix of both cuz like you wouldn't even get lucky if you don't position yourself in the right way. What do you think?",
          "score": 1,
          "created_utc": "2025-12-26 20:42:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw629gu",
          "author": "OkLeg1325",
          "text": "God merci not your plan ",
          "score": 1,
          "created_utc": "2025-12-27 09:49:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw6g8oq",
          "author": "Leonard-21rag",
          "text": "Timing and luck matter early on, but they’re not everything. Some startups need aggressive distribution, while others especially premium products require experience in positioning, targeting, and knowing when and how to market.",
          "score": 1,
          "created_utc": "2025-12-27 12:03:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw7rnl4",
          "author": "mysterious_guy100",
          "text": "Agree",
          "score": 1,
          "created_utc": "2025-12-27 16:53:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwc1yek",
          "author": "michisquishy",
          "text": "Yes",
          "score": 1,
          "created_utc": "2025-12-28 08:32:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwcnp6q",
          "author": "SatisfactionThis993",
          "text": "100% desagree with that",
          "score": 1,
          "created_utc": "2025-12-28 11:59:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwcx9x1",
          "author": "ScradleyToronto",
          "text": "I’ve been teaching Entrepreneurship for 17 years at a Canadian university after starting, running, selling and closing several companies, and this is one of my mantras:\n“Every company starts out with an order they didn’t deserve.”\nThat said, while luck is a factor, you make your luck!",
          "score": 1,
          "created_utc": "2025-12-28 13:16:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwf3e56",
          "author": "Intrepid_Ant_1264",
          "text": "Well, that is only true if you rely on luck and have no systems in place. Demand can be engineered with the right process in place. That's why i always say sell it first, then build it. NOT the other way around.\n\nWasting time building stuff that won't sell helps no one.",
          "score": 1,
          "created_utc": "2025-12-28 20:03:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwiti97",
          "author": "Ok-Quarter-9973",
          "text": "I fear it’s not the greatest variable as strategy id say is positioned above",
          "score": 1,
          "created_utc": "2025-12-29 10:10:48",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1q04kv7",
      "title": "How To Hire?",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1q04kv7/how_to_hire/",
      "author": "demirb",
      "created_utc": "2025-12-31 05:08:33",
      "score": 6,
      "num_comments": 5,
      "upvote_ratio": 0.87,
      "text": "Hey founders,\n\nI realized I’m missing so much fundamental when I recently talked with another founder where she mentioned she has a clear vision and repeats it constantly throughout the JD, hiring funnel and onboarding. Not just with words but actual stories of how their product is changing lives. Making sure everyone always knows why the company exists. And explained to me how this process has been helping her recruitment. \n\nOfc she is operating all of this at an expert level and it’ll take someone like me easily a year of work to reach her level after learning her process in detail. \n\nWhat are other fundamentals that you have “mastered”?\n\nI have a team of 20 people and haven’t mastered any fundamentals yet. Looking to learn from your expertise. ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1q04kv7/how_to_hire/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "nwx5eo7",
          "author": "Cute-Stick-7215",
          "text": "One thing I’ve noticed is that “fundamentals” usually get framed as skills (vision, hiring, communication), but the real gap tends to be decision clarity.\n\nFounders who look advanced aren’t doing everything better, they’re clearer on:\n\t•\twhich decisions actually matter\n\t•\twhich ones can be delegated or ignored\n\t•\tand what “good enough” looks like week to week\n\nWithout that, even strong vision gets lost in day-to-day noise, especially with a 20-person team.\n\nOut of curiosity - where do you feel the most uncertainty right now: hiring decisions, prioritization, or alignment across the team?",
          "score": 1,
          "created_utc": "2025-12-31 14:43:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx0o0dw",
              "author": "demirb",
              "text": "I would say finding talent. Or maybe our expectation is too much?",
              "score": 1,
              "created_utc": "2026-01-01 02:18:06",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwxur5x",
          "author": "WrongMix882",
          "text": "I’ll point out a big iceberg you’re seemingly not acknowledging here: stop with the romanticizing other firms. All businesses are hard and it’s human nature to not want to be vulnerable with others we want to respect us. You’re not getting the entire truth from this person. \n\nIronically, your being here and asking the question is itself a positive sign that you’re leading a learning culture. You could do a lot worse than Traction as a breadcrumb for how to install a management framework that aligns with your business plan, but more important is the attitude of being open and a lifelong learner.",
          "score": 1,
          "created_utc": "2025-12-31 16:52:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwy8i2u",
          "author": "Willing-Training1020",
          "text": "one thing i’ve learned is that fundamentals don’t have to be expert-level to work, they just have to be consistent. beyond vision, role clarity is huge—being explicit about what success looks like in the first 30–60 days prevents so many downstream issues. hiring for slope over pedigree also matters more than people think, and regular feedback loops keep small misalignments from becoming big ones. i work with founders on these exact hiring and team-building gaps at pearl talent, and it’s always the basics done well that move the needle.",
          "score": 1,
          "created_utc": "2025-12-31 18:00:07",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pwbb9j",
      "title": "I’ll enrich your file for free (and if I don’t, I’ll pay you $2)",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1pwbb9j/ill_enrich_your_file_for_free_and_if_i_dont_ill/",
      "author": "rexis_nobilis_",
      "created_utc": "2025-12-26 18:32:08",
      "score": 5,
      "num_comments": 11,
      "upvote_ratio": 0.67,
      "text": "I previously did a version of this and it worked super well! Only had to paid out $12 among the hundreds of requests I got and it was a great feedback loop to what worked and what didn’t. \n\nSo for this one, I’m offering a new bet: I will pay you $2 if I can’t enrich your file. Now I’m assuming that most of these will be lead files. \n\ntl;dr: Basically we’re building a general AI agent that goes deep in any vertical of knowledge work + can iterate and carry-out very long running tasks that consists of thousands of steps, all from a single prompt. \n\nEnriching documents is another popular among our current user base. After our update, we want to stress test this :D \nHere are the rules:\n* Just tell me what type of file you have and what you want to enrich with.\n\n* I will reply stating if I can or can’t take on the bet. If I can, I’ll ask you to DM me the file you want enriched. If I say I can but then can’t produce what you asked for, I will send you $2.\n\n* Those $2 will be sent to you via Venmo, PayPal or Zelle (only).\n\n* If you are requesting special variables things such as emails, I will provide just a few to my own discretion (it’s expensive after all and I’m giving it for free).\n\n* I will enrich just a small portion of your file (if it’s big) to save on time as im sure I’ll get a lot of requests. \n\nWe’ll define a successful enrichment as a file that includes the variables we agreed upon before taking on the bet. \n\nLet the experiment begin! ",
      "is_original_content": false,
      "link_flair_text": "services",
      "permalink": "https://reddit.com/r/startup/comments/1pwbb9j/ill_enrich_your_file_for_free_and_if_i_dont_ill/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "nw2jnei",
          "author": "YopBuilder",
          "text": "What the hell are you talking about.",
          "score": 6,
          "created_utc": "2025-12-26 19:28:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "nw2n6gf",
              "author": "rexis_nobilis_",
              "text": "Don’t know where I wasn’t clear but I’m offering to enrich files people have with whatever info they request. Check my previous posts if you want to see a previous use-case",
              "score": 0,
              "created_utc": "2025-12-26 19:47:13",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nw2xk27",
                  "author": "YopBuilder",
                  "text": "You don’t have any other recent posts about “enriching files”. \n\nHow about you give some example because I’ve been using computers for literal decades and I can’t figure out what you’re doing. Adding emojis to my word document? Lens flares to my photos? Colors to my spreadsheets?",
                  "score": 5,
                  "created_utc": "2025-12-26 20:44:21",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nw7fglz",
          "author": "GP_103",
          "text": "Sounds like your getting others to enrich your files",
          "score": 3,
          "created_utc": "2025-12-27 15:52:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "nw7geqq",
              "author": "rexis_nobilis_",
              "text": "That’s not I’m building though 😅 sellagen.com",
              "score": 1,
              "created_utc": "2025-12-27 15:57:10",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwfar4l",
          "author": "AccidentKitchen8962",
          "text": "Fuck you",
          "score": 2,
          "created_utc": "2025-12-28 20:39:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwffjxm",
              "author": "rexis_nobilis_",
              "text": "Why? 😭",
              "score": 0,
              "created_utc": "2025-12-28 21:02:58",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1pzstyw",
      "title": "I built a baby tracking app with mental health breaks for dads. Looking for honest feedback.",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1pzstyw/i_built_a_baby_tracking_app_with_mental_health/",
      "author": "Emotional-Roof-7728",
      "created_utc": "2025-12-30 20:28:06",
      "score": 5,
      "num_comments": 6,
      "upvote_ratio": 0.86,
      "text": "4 months ago my daughter Emma was born. Like most of you, my wife and I couldn't remember anything through the sleep deprivation. Who fed her last? When was the last diaper? No idea.\n\nI tried Huckleberry, Baby Buddy, a few others. They're good apps. But I'm a developer, and I wanted something specific that I couldn't find:\n\n**An app that tells me \"you're doing fine\" instead of just showing me charts.**\n\n73% of millennial dads report parenting anxiety. I'm one of them. Every app showed me data but none of them helped with the \"am I screwing this up?\" feeling.\n\nSo I built Dad Co-Pilot. The main things that make it different:\n\n* \"Is this normal?\" insights based on CDC/AAP guidelines. Not just \"5 feeds today\" but \"5 feeds today—that's right on track for this age.\"\n* Mental health breaks built in. Breathing exercises, stretches for baby-carrying tension, and a daily dad joke because sometimes you just need to laugh.\n* Partner sync without leaderboards or competition. Just \"last feed was 2 hours ago.\"\n\nIt's free to download. There's a premium tier, but the core tracking is free.\n\nIf you try it, I'd genuinely love feedback. What's missing? What's annoying? What would make it actually useful for you?\n\nLet me know in comments, i'll send the link from app store, thank you.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1pzstyw/i_built_a_baby_tracking_app_with_mental_health/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "nwvgmah",
          "author": "LuisVillamil",
          "text": "I am interested, I have a baby 3 months old and a toddler, I have never tried any parenting apps so it would be interesting",
          "score": 2,
          "created_utc": "2025-12-31 06:30:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwwmeqd",
              "author": "Emotional-Roof-7728",
              "text": "feel free to download app [https://apps.apple.com/us/app/baby-tracker-for-dads/id6755366965?ppid=2da572e2-ea2a-4620-8e9a-289bbd674208](https://apps.apple.com/us/app/baby-tracker-for-dads/id6755366965?ppid=2da572e2-ea2a-4620-8e9a-289bbd674208) happy hear back from you, and Happy new year !",
              "score": 1,
              "created_utc": "2025-12-31 12:45:41",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwznk67",
                  "author": "LuisVillamil",
                  "text": "It looks nice, In my case the baby is breast feed so we don’t really track eating times but the dipper track is useful, In our monthly check up with my baby’s doctor they have a questionnaire for the baby like can she hold her head and so on, and at the end he gives us some exercises that we can do with her like tummy time and just talking to the baby, I know its not what the app its about right now but could be nice future features (sorry for my english) happy new year to you too!",
                  "score": 2,
                  "created_utc": "2025-12-31 22:32:37",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nww5mfl",
          "author": "rollingeyespigeon",
          "text": "Hi! I’m interested as a father of a 7 months old baby",
          "score": 2,
          "created_utc": "2025-12-31 10:21:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwwmc2y",
              "author": "Emotional-Roof-7728",
              "text": "feel free to download app [https://apps.apple.com/us/app/baby-tracker-for-dads/id6755366965?ppid=2da572e2-ea2a-4620-8e9a-289bbd674208](https://apps.apple.com/us/app/baby-tracker-for-dads/id6755366965?ppid=2da572e2-ea2a-4620-8e9a-289bbd674208) happy hear back from you, and Happy new year !",
              "score": 1,
              "created_utc": "2025-12-31 12:45:08",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwwlmqe",
          "author": "No-Swimmer-2777",
          "text": "Love this. The insight about anxiety-driven dads is spot on - most apps miss the emotional side. One founder thing I'd push on: you've got real users interested which is great, but before sinking more time into features, run a 20-minute validation call with 5 of them asking \"what's the single moment each day when you'd actually use this?\" You might find they're not checking an app but want Slack/SMS alerts instead. I use [IdeaProof.io](http://IdeaProof.io) for this validation step before building. Right now you're in the perfect window to pivot fast if needed.",
          "score": 2,
          "created_utc": "2025-12-31 12:39:55",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pvcf2c",
      "title": "I accidentally built a \"non-profit startup\" (yeah, I know) migraine.club",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1pvcf2c/i_accidentally_built_a_nonprofit_startup_yeah_i/",
      "author": "denysov_kos",
      "created_utc": "2025-12-25 12:29:33",
      "score": 3,
      "num_comments": 3,
      "upvote_ratio": 0.71,
      "text": "Hey folks!  \nI shipped a side project called [migraine.club](http://migraine.club) a migraine/headache tracker + simple analytics + community space. It’s mobile-first, fast logging, and tries to be actually useful when you need to talk to a doctor (reports, trends, patterns). The whole idea is: less \"health app fluff\", more \"I can capture what happened in 20 seconds, then understand it later\".\n\nNow the funny part: it’s… non-profit. Like *actually* non-profit. Not \"non-profit\" as in \"we lose money for 18 months and call it a strategy\". More like: I’m paying for it, I’m building it, there are no ads, no paywalls, and I’m not trying to turn migraine sufferers into an LTV spreadsheet. So yes, this might be the first truly non-profit startup in history and I’m sure YC will reject me for insufficient greed 😄\n\nWhy I’m posting: I’m looking for brutally honest feedback from builders. What would you expect from a product like this? What would make you trust it (especially around privacy)? And if you’ve ever built something “health-adjacent”, what mistakes should I avoid before it grows?\n\nIf you want to peek: [migraine.club](http://migraine.club)  \nHappy to answer questions, and if you have feature requests, I’ll probably implement them because I clearly enjoy suffering twice.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1pvcf2c/i_accidentally_built_a_nonprofit_startup_yeah_i/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "nw2cxrj",
          "author": "Standard_Maximum7584",
          "text": "This is awesome!",
          "score": 2,
          "created_utc": "2025-12-26 18:52:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvwxo1j",
          "author": "JCardiff",
          "text": "I think consumer trust is hard to pin down, especially given how much expectations vary. Some countries have very specific rules around what you can and can’t collect from customers. I’d look at comparable platforms, not identical ones, but close enough to be relevant, to see how they handle privacy.\n\nQuestion: when you say non-profit, are you set up as a non-profit entity from a tax perspective?\n\nHappy Holidays",
          "score": 1,
          "created_utc": "2025-12-25 19:50:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvx1e2s",
              "author": "denysov_kos",
              "text": "Hey! When I said \\`non-profit\\` - thats a general concept. I strongly believe, that such kind of features should be free, and have full service. I am struggling with migraines, and I tried so many tools so far, nothing really what I liked. Hence, that why I even started. And no, I did not registered any LLC/Entity for this one, and I believe I don't need so far. Interesting part, I am already have an open chats for an integration for some doctors, and none required any legal entity, mainly HIPAA certification is needed, and thats what also we have on ours roadmap.",
              "score": 1,
              "created_utc": "2025-12-25 20:13:10",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1pzoi0c",
      "title": "Why do people waste money on tech?",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1pzoi0c/why_do_people_waste_money_on_tech/",
      "author": "hatebacon",
      "created_utc": "2025-12-30 17:43:52",
      "score": 1,
      "num_comments": 10,
      "upvote_ratio": 0.57,
      "text": "Because they don't know what technology is for.\n\nTech exists for one purpose: to optimize a process. That is the case for both archaic tools like hammers, shovels and Excel to also all the modern AI software and smart devices we're seeing launching everyday.\n\nSo process is key. If you don't have clarity on your process, or if it is not good, than a specific tool will not solve any problem.\n\nOverlooking the process and focusing on the tools is the biggest mistake for both IT professionals and those who hire them.\n\nEvery tool has it's downsides and every software is flawed. But more often than not, when you fail at a project, the problem is not on the tool or the platform you're using, but on lack of planning and proper management.\n\n* Automating your sales process is useless without having a great offer\n* Launching a paid traffic campaign is a waste of money if you don't know where your potential clients are and how to talk to them\n* A fancy landingpage will not bring you any results without a clear communication and a great CTA\n* Implementing a CRM won't do anything for you if you don't know how to analyse data and get feedback on your clients in order to continuously improve your process at each new one\n\nAI is changing the game, lowering the barriers for people to start their businesses and giving eveyone who dominate and keep up with the changes an unfair advantage over those who don't. But just like any technology, you won't get anything out of it without a great offer, a solid plan and a well managed process.",
      "is_original_content": false,
      "link_flair_text": "knowledge",
      "permalink": "https://reddit.com/r/startup/comments/1pzoi0c/why_do_people_waste_money_on_tech/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "nwtb95j",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 2,
          "created_utc": "2025-12-30 22:38:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwtbmeo",
              "author": "hatebacon",
              "text": "And redditors are miserable people",
              "score": 1,
              "created_utc": "2025-12-30 22:40:34",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwv4ks8",
          "author": "demirb",
          "text": "This is a legit post why does it have downvotes? \nHere take my upvote.",
          "score": 2,
          "created_utc": "2025-12-31 04:59:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwwi2ug",
              "author": "hatebacon",
              "text": "Because redditors are miserable people. That's why I hangout more on Skool.",
              "score": 1,
              "created_utc": "2025-12-31 12:12:15",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwwlyso",
          "author": "No-Swimmer-2777",
          "text": "Exactly. Most founders buy tools to feel like they're progressing when they should be validating their core assumption first. Process clarity beats tooling every time.",
          "score": 2,
          "created_utc": "2025-12-31 12:42:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwwpdxs",
              "author": "hatebacon",
              "text": "exactly. That's a mistake I see both solopreneurs and big corporations doing. implementing a tool is easier than optimizing a processs and it creates a false ilusion of progress that in practice only results in extra expenses and unecesssary complexity.",
              "score": 1,
              "created_utc": "2025-12-31 13:06:48",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwx7uha",
          "author": "Illustrious_Feed8289",
          "text": "that's the Great Post",
          "score": 2,
          "created_utc": "2025-12-31 14:56:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwykyq3",
          "author": "thinking_byte",
          "text": "I mostly agree, but I think the trap is tools feel like progress when the process work is uncomfortable. Buying software is concrete and fast, figuring out who your customer is and what actually converts is slow. I have seen teams add layers of tech just to avoid making hard decisions about scope or priorities. The best tools we adopted came after the process was already working in a scrappy way. Then the tech amplified it instead of masking the gaps.",
          "score": 1,
          "created_utc": "2025-12-31 19:02:47",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}