{
  "metadata": {
    "last_updated": "2026-03-01 16:49:58",
    "time_filter": "week",
    "subreddit": "startup",
    "total_items": 14,
    "total_comments": 139,
    "file_size_bytes": 126264
  },
  "items": [
    {
      "id": "1rh6at2",
      "title": "My cofounder makes $27k a month and hasn't worked in 11 months",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1rh6at2/my_cofounder_makes_27k_a_month_and_hasnt_worked/",
      "author": "Few-Needleworker4391",
      "created_utc": "2026-02-28 16:02:45",
      "score": 255,
      "num_comments": 121,
      "upvote_ratio": 0.94,
      "text": "We started this thing almost 2 years ago. 50/50 split. Quit our jobs the same week.\n\nFirst 6 months were insane. He built everything. I did sales. Hit like $35k MRR by January.\n\nHis kid was born last spring. Took a couple weeks off. Came back but not really.\n\nHe's still in Slack. Still on calls. But the actual work stopped.\n\nI've been maintaining code myself and I barely know what I'm doing. Hiring people off Upwork. Paying out of pocket. Spent like $4k last month. He has no idea.\n\nWe're still splitting 50/50. He took home around $26k last month for showing up to meetings.\n\nTried bringing it up few weeks ago. He said just adjusting to the baby, should calm down soon. It hasn't.\n\nWe've been friends since college. I was in his wedding. I'm the godfather to his kid.\n\nBut I'm completely drowning. Doing sales, support, marketing, and now dev. Just using whatever works. Notion, Airtable, Zapier for automations, Descript and APOB for video stuff when I need it.\n\nWe're gonna hit maybe $55k MRR this month. He'll clear $27k for Zoom calls.\n\nIf I bought him out at 3x revenue that's over $1M. Don't have it. If I suggest changing equity he'll think I'm a dick. If I do nothing I'll burn out or the friendship dies.\n\nWe have our monthly meeting next week. I keep thinking I'll bring it up. But I know I won't.\n\nAnyone actually navigate this without destroying the friendship?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1rh6at2/my_cofounder_makes_27k_a_month_and_hasnt_worked/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o7wd88y",
          "author": "iamjeffdimarco",
          "text": "You’re not going to destroy the friendship by having this conversation. You’re going to destroy it by not having it and letting resentment build until you explode.\nReframe it away from accusation.. don’t go in with “you’re not pulling your weight,” go in with “I’m drowning and I need us to figure this out together.” Come with a concrete proposal already written down: a temporary adjusted split with a clear path back to 50/50 when he’s fully back. Having numbers on paper makes it a business conversation, not a personal attack.\n\nAlso just ask him directly: “When do you realistically see yourself back at full capacity?” If he can’t answer that, that is your answer.\n\nThe friendship is already at risk.. just silently. At least this way you give it a real shot.​​​​​​​​​​​​​​​​",
          "score": 339,
          "created_utc": "2026-02-28 16:10:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7whvoi",
              "author": "vibefarm",
              "text": "bingo.  Plus remember, common goals here.  Your both on the same side, and obviously its in the best interest of everyone to have conversations about whats best for the venture.  Just make sure they understand that.  It's not some forbidden and rare discussion, its an obvious one that should be happening constantly.",
              "score": 29,
              "created_utc": "2026-02-28 16:33:58",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o7wtqvx",
              "author": "mishchiefdev",
              "text": "Yes! OP this is a business but this is also one of your closest relationships. People say dont mix business and friendships but I think it’s bullshit. It sucks now because I bet you’re feeling the brunt of it but the most important thing is to talk to them with realistic expectations and a plan to return. If he values your relationship he will snap out of it and put some action on it! \n\nJust remember don’t attack, collaborate. “What’s going on”, “how can we get you back 100%”, “Let’s have clear expectations”, “this team is not 10/10 without you”, etc!\n\nYou got this OP! I sucks to be the one having to deal with it but things will get better! At least financially you guys are doing great!",
              "score": 19,
              "created_utc": "2026-02-28 17:33:20",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7yd4rr",
                  "author": "Embarrassed-Army-420",
                  "text": "OP Listen to this advice, your cofounder  will be the one who will stand by you in the long run",
                  "score": 3,
                  "created_utc": "2026-02-28 22:22:15",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o7zlwy3",
              "author": "kobionekanobi",
              "text": "Hire what you need, bring profit down on both sides till he gets back. The pocket hit will force a change if needed.",
              "score": 3,
              "created_utc": "2026-03-01 02:47:46",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o7xqxb4",
              "author": "thisbuthat",
              "text": "Super good comment.",
              "score": 2,
              "created_utc": "2026-02-28 20:22:22",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o7y15bl",
              "author": "AncientOneX",
              "text": "Solid advice. I was in a similar boat and let the situation worsen till I burned out. Don't wait till it's too late. Let him know your concerns and struggles. Don't blame.",
              "score": 2,
              "created_utc": "2026-02-28 21:17:40",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o7zx5a9",
              "author": "Moto_traveller",
              "text": "This is the best advice you are going to get OP.",
              "score": 1,
              "created_utc": "2026-03-01 04:00:52",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o81lpok",
              "author": "Sad_Magician_316",
              "text": "Wow can I have you as a business partner!! Well said.",
              "score": 1,
              "created_utc": "2026-03-01 12:46:09",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o82i9d5",
              "author": "Feeling-District-160",
              "text": "This right here is THE answer I was going to say the same. \n\nRemember its your business that needs timescales and that work ethic not your friendship keep it as a separate conversation. \n\nAs your friend - i understand and empathise with having a new baby and you wanting to stay wrapped up in it.\n\nAs your business partner HEAVY ONE THE PARTNER,  we need xyz to happen or business will burn out with the one who is burnt out.",
              "score": 1,
              "created_utc": "2026-03-01 15:53:59",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7wq9ux",
          "author": "NeedleworkerChoice89",
          "text": "Why in the world are you paying out that much instead of building cash reserves? How are you going to hire if you have even one person taking a $324k annual distribution?\n\n*You* are a cofounder, *you* need to communicate and draw a line. $27k a month can pay for a f***ing nanny and a comfortable life.",
          "score": 80,
          "created_utc": "2026-02-28 17:15:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7wp6m3",
          "author": "mdivan",
          "text": "Just hire dev for 10k take that money from total and split the rest, he can act like a CTO aka be in meetings.",
          "score": 22,
          "created_utc": "2026-02-28 17:10:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o812xpf",
              "author": "skydiver19",
              "text": "^ this",
              "score": 2,
              "created_utc": "2026-03-01 09:58:02",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7wtou6",
          "author": "mcAlt009",
          "text": "Wait. \n\nSo he built the thing and when it breaks its him who will have to fix it. Your able to hack out patches, but I'm sure if it completely falls apart he'll be there. \n\nSounds like a solid deal. I'd reduce both of your salaries though, and use it to actually hire people. \n\nThen you can both do nothing, have employees ( go go turbo outsourcing) actually do the work.",
          "score": 21,
          "created_utc": "2026-02-28 17:33:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7wgmh3",
          "author": "nocodecfo",
          "text": "As an owner you should get paid twice - as an employee of your company (to the degree you or your other founders work in the business) and then as an owner via distributions (to the degree you decide to issue distributions versus saving cash for operating expenses or growth). \n\nSounds like you are taking everything every month and distributing it. Are you leaving anything in the corporate account every month? Building reserves so you could hire a team? A good goal is 3 months of OPEX as a bootstrapped company.\n\nYou should discuss taking a salary for work done (which sounds like is only you), then building reserves, then doing distributions.\n\nIf your $55k in margin gets broken out by having a $15-20k salary for you, $3k for an overseas support person to help take some pressure off you, then $10k-15k per month to build reserves - that’s $28-38k in additional expenses before you do distributions. You would be left with 17-27k for distributions.\n\nYou are working 40+ hour weeks and he’s doing what - 5, at best? You aren’t getting paid for your time.",
          "score": 38,
          "created_utc": "2026-02-28 16:27:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7x7oir",
              "author": "Familiar_Tip_7336",
              "text": "not if the other person is a equal partner (co-owner) depends how this business was structured. ",
              "score": 1,
              "created_utc": "2026-02-28 18:43:01",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o7ydgq8",
              "author": "Embarrassed-Army-420",
              "text": "Except he is a cofounder, not an employee",
              "score": 1,
              "created_utc": "2026-02-28 22:24:05",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o8057tm",
          "author": "AllLiquid2",
          "text": "3mo you were 58 and \"For the last three months we have been staying on BLM land and in national forests completely free.\"\n\nhttps://www.reddit.com/r/VanLife/comments/1pc3ol7/i_finally_found_the_power_that_lets_us_travel/\n\nand 2mo you were running a bakery since 2024:\n\nhttps://www.reddit.com/r/generativeAI/comments/1q8bb5z/used_ai_to_fix_my_small_business_branding_mess/\n\nand you didn't post any replies to comments on those posts either...\n\nYou a bot designed to waste others' time? \nto drive engagement on reddit? \nwhy waste time and electricity otherwise?\n",
          "score": 16,
          "created_utc": "2026-03-01 04:58:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o81ptbh",
              "author": "Direct-Arachnid7254",
              "text": "Holy shit no way",
              "score": 1,
              "created_utc": "2026-03-01 13:15:03",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o81pwi4",
              "author": "Direct-Arachnid7254",
              "text": "Wait , I just checked and his account is private - and just curious - how’d you know about here posts ?",
              "score": 1,
              "created_utc": "2026-03-01 13:15:38",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o826gjh",
                  "author": "jbc22",
                  "text": "Google probably. \n\nsite:reddit.com few-needleworker4391",
                  "score": 3,
                  "created_utc": "2026-03-01 14:54:14",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o82mqux",
              "author": "Broken-angelx1",
              "text": "He's just looking for some karma to be loaded",
              "score": 1,
              "created_utc": "2026-03-01 16:15:36",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7wwwkj",
          "author": "Manuel_Ble",
          "text": "Btw being an owner (having the 50/50 equity) is one thing. Doing the actual work is a completely different thing. You should commit a certain number of hours per week as employee (and pay yourself a salary). If he works less hours, he gets less. After the expenses you split the net as owners",
          "score": 14,
          "created_utc": "2026-02-28 17:49:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7xrui7",
          "author": "Matikata",
          "text": "He spent six months building the thing that’s making you money. He deserves his half and always will. \n\nHire a new member of staff to do whatever it is he isn’t doing, pay for that staff member out of the company bank account (before profits), then dish out dividends according to profits that are left.",
          "score": 9,
          "created_utc": "2026-02-28 20:27:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7zvzy3",
              "author": "Hot_Set_8040",
              "text": "And hire a sales person as well. Sounds like you need a little bit of time for yourself.",
              "score": 6,
              "created_utc": "2026-03-01 03:52:58",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7xb6in",
          "author": "Troglodyte_Techie",
          "text": "Tbh as a dev. Things are generally front loaded with immense dev work that is incredibly disproportionate to non technical founders to get things up. Then sales works their magic while we sit around doing maintenance and adding new features. \n\nThat said, he may be under the impression that things are running smoothly and he’s already done his piece. Did you guys make an operating agreement? Regardless if he’s your boy and as a dev. I’d just be straight up, the operation is scaling while simultaneously being jeopardized due to a lack of maintenance and action on his end. You need X hours a week to deal with critical issues and pick up slack otherwise this cash cow will cease to produce milk and he can adjust to having a baby while onboarding to a new 9-5 that pays less. Bringing in random devs to work on the code base is going to result in a shit show in the future and be much harder to work on. So at the very least he should be managing the freelancers, checking prs and ensuring that code quality is kept up. There’s plenty of dudes who just had a kid that work full time for a lot less. I don’t know his background but he needs to remember where he started and not get complacent because he’s made a little bag. \n\nObviously be a bit less direct and harsh but that’s pretty much how I’d dress it up.",
          "score": 8,
          "created_utc": "2026-02-28 19:00:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7wyc58",
          "author": "Gianlukas",
          "text": "Your so blessed to me making 280k a year with your best friend and chilling ask him to help with the code and relax take it easy",
          "score": 6,
          "created_utc": "2026-02-28 17:56:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7xronz",
          "author": "Gijenna",
          "text": "Sounds like he felt YOU were skating by the first 6 months while he did everything so this feels fair to him. \n\nThat’s the conversation to have.",
          "score": 4,
          "created_utc": "2026-02-28 20:26:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7whv8f",
          "author": "devguyxd",
          "text": "Just have a honest conversation, there should be a difference between a professional relationship and friendship.\nIf you are true friends then this won't affect anything.",
          "score": 3,
          "created_utc": "2026-02-28 16:33:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7wiqxd",
          "author": "hammerzzzzzz",
          "text": "Maybe mention about bringing in a 3rd partner and cite the reasons. Hopefully he will say he will pick up the slack",
          "score": 3,
          "created_utc": "2026-02-28 16:38:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7wyl05",
          "author": "ProfessionalGold722",
          "text": "Too early to be taking 50% of all revenue and not covering the additional expenses you're incurring because he's not working.",
          "score": 3,
          "created_utc": "2026-02-28 17:57:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7xce3d",
          "author": "hidden-monk",
          "text": "Is this a rage bait ? OP hasn’t replied to any comments.",
          "score": 3,
          "created_utc": "2026-02-28 19:06:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7yn7ez",
              "author": "oscarnyc",
              "text": "I'm guessing yes. It doesn't even make sense. Why would the $4k or any expenses come out of OPs share? All expenses for running the business come out before any distributions.\nAnd a monthly meeting for a 50/50 business? And I have 3 kids. Even as newborns at least one of us was working full time. There is daycare or nannies. Even at $5k a month it makes sense to pay it to protect $27k of income.",
              "score": 5,
              "created_utc": "2026-02-28 23:18:58",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7xebww",
          "author": "clearasatear",
          "text": "You are quite profitable, you seem to have a system that works. Now learn to be someone that delegates",
          "score": 3,
          "created_utc": "2026-02-28 19:16:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7yb62x",
          "author": "palmzq",
          "text": "So at “55k MRR”, why exactly will his pay be $27k?\n\nYou said 50:50:\nHim: $27k\nYou: $27k\nExpenses: $1,000?\n\nYou have a net profit of 98%???\n\n“But you spent $4k last month….”\nSo it isn’t $1,000.\n\nYou don’t have a partnership problem yet…\nYou have a “complete lack of operational structure & understanding of business finances problem” that once addressed might lead to a partnership problem.",
          "score": 3,
          "created_utc": "2026-02-28 22:11:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o8106z8",
              "author": "Respectandunity",
              "text": "Exactly this. Why and how the fuck are you taking out so much money out of the business for yourselves each month? I think you may need to speak to an a accountant or qualified financial consultant",
              "score": 1,
              "created_utc": "2026-03-01 09:31:41",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7z1ju6",
          "author": "Potential_Cat4255",
          "text": "So tech guy did the job and it works. And now your complaining that it works?",
          "score": 5,
          "created_utc": "2026-03-01 00:43:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7z2lne",
              "author": "xxxhr2d2",
              "text": "And without him he would be selling SF for 120K year. \n\nYou got the free ride dude, he done everything and you sold something. Now you want to cut him out?",
              "score": 0,
              "created_utc": "2026-03-01 00:49:47",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7wtm65",
          "author": "jaytonbye",
          "text": "Take this post and rewrite it as an email. Tell him you would like to have a meeting to discuss, to see if you can make things right.\n\nYou should be hiring instead of paying out so much (to either of you).",
          "score": 2,
          "created_utc": "2026-02-28 17:32:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7zm21m",
          "author": "Accomplished-End-600",
          "text": "Why not just hire others and then profit will be split after expenses doesn’t seem too hard to do",
          "score": 2,
          "created_utc": "2026-03-01 02:48:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o80cy0k",
          "author": "godmk",
          "text": "Why the hell are you paying out so much instead of re-investing into growth???",
          "score": 2,
          "created_utc": "2026-03-01 05:58:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o80y1sv",
          "author": "Klutzy-Sea-4857",
          "text": "Document the contributions from both parties over the past six months in an objective manner. Present this information during a meeting framed as a partnership health check, avoiding any accusatory tone. Discuss transition options including: reduced equity with contribution-based vesting, a structured buyout payment plan, or establishing clear deliverables with specific deadlines. Remember that avoiding these discussions can damage friendships more than having honest conversations. Address the situation promptly as growing resentment can negatively impact the entire relationship.",
          "score": 2,
          "created_utc": "2026-03-01 09:10:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7wzvll",
          "author": "RufioGP",
          "text": "You keep saying he’s getting 27k for just zoom meetings. Is that just your perspective. A zoom meeting can be a sales call… it’d be like him saying, he made 27k/month just for building the original app/product. Is his role sales?",
          "score": 1,
          "created_utc": "2026-02-28 18:04:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7z1uhi",
              "author": "Potential_Cat4255",
              "text": "The sales guy would have built it himself the IT but he could not right?",
              "score": 1,
              "created_utc": "2026-03-01 00:45:28",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7x2zhq",
          "author": "FerralAppBuilder",
          "text": "Offer him $100k plus the remainder in stock shares that equal 40% of the company. You can come up with that. Bank funding or business loan company. Now he isnt getting paid half every month. Why are you splitting 50 50 anyways? Is that profit based? Anyways, after he is out of the control part. Or, get an investor to buy you out. Just make sure he understands that you can leverage the heck out of it and leave him holding the bag.",
          "score": 1,
          "created_utc": "2026-02-28 18:19:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7x37qq",
          "author": "iamzamek",
          "text": "What are you building?",
          "score": 1,
          "created_utc": "2026-02-28 18:20:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7x3o53",
          "author": "antigirl",
          "text": "Buy him out. But payment will happen with monthly dividends. I will take his place 🚀",
          "score": 1,
          "created_utc": "2026-02-28 18:23:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7z1y7h",
              "author": "Potential_Cat4255",
              "text": "Joke.\n\nIT guy builds it. Now the sales guy suppose to buy it out?\n\nWhat a joke",
              "score": 0,
              "created_utc": "2026-03-01 00:46:03",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7zheb8",
                  "author": "antigirl",
                  "text": "Building is done. Sales guy is maintaing it.",
                  "score": 1,
                  "created_utc": "2026-03-01 02:20:03",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7x4pvt",
          "author": "leo-dip",
          "text": "Tell him how you feel, in a diplomatic way. ",
          "score": 1,
          "created_utc": "2026-02-28 18:28:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7x7i52",
          "author": "CRE8TR-IO",
          "text": "I would recommend the same thing as the majority of posters here. \n\nThe thing is though. You both need to sacrifice the revenue coming in to expand and grow. 2 years in you should build a support team that allows you and him to roll back and focus your energy elsewhere for growth. \n\nEven if you cut the take away by half for each of you for 6 months that’s enough time to build reserves. Hire your people. And grow.",
          "score": 1,
          "created_utc": "2026-02-28 18:42:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7x86nv",
          "author": "Fun_Dog_3346",
          "text": "I think you both should have a salary and equity structure as there is something off about management side...Your structure isn't correct; like why you even paid from your packet while he has no idea? Perhaps get some consulting about management side of the business. \n\nAnother thing is as you guys owned the responsibilities from beginning, shouldn't be there any resentment. If he didn't build, there wasn't any product to sell but you decided to go with him as a partner instead hiring someone else to pay. Let's keep that in mind, not resentment.  \n",
          "score": 1,
          "created_utc": "2026-02-28 18:45:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7xbn5p",
          "author": "Dry_Ninja7748",
          "text": "Honestly you are doing this to yourself and you are the problem . In a normal company \n, if cto isn’t supporting the company and it needs support then hire out the work he isn’t doing, expense it, you both earn less or even better take it from his take.",
          "score": 1,
          "created_utc": "2026-02-28 19:02:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7xbpuc",
          "author": "Amazing-Coder95",
          "text": "If things go south & you need someone to step in for your CTO ; happy to do that.\n\nEx founding engineer at real time image optimisation & B2B Fintech startup ; lead team of 5 devs recently before quitting my job in early Feb.",
          "score": 1,
          "created_utc": "2026-02-28 19:03:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7xengy",
          "author": "Sea-Definition-5715",
          "text": "What business",
          "score": 1,
          "created_utc": "2026-02-28 19:18:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7xk073",
          "author": "Guilty-Persimmon-144",
          "text": "Offer to help him at home or check if he needs help with anything so he can focus on work a little more. Maybe hes holding something in that you haven't cared to notice about him. Get back to being friends and understanding what your friend has on his plate and it might fix itself. A kid can be overwhelming depending on the mother.",
          "score": 1,
          "created_utc": "2026-02-28 19:46:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7y64jc",
          "author": "JohnCasey3306",
          "text": "> \"but I'm completely drowning\"\n\nHave you said it exactly like this to him?? ... Or have you just gently asked him when he'll be back, hoping he'll read between the lines?\n\nWhat does your shareholders agreement state -- do you even have one?\n\nThis is **business**. You need to be absolutely direct.",
          "score": 1,
          "created_utc": "2026-02-28 21:44:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7y7wno",
          "author": "illcrx",
          "text": "You can't. He is taking advantage of you, he is NOT a friend. \n\nThe best thing you can do is to tell him you are hiring a new developer. Shit you have $55k a month? Why aren't you managing people? Get a developer tell your \"partner\" that you are doing this until he comes back full time. He may change his tune real quick. \n\nIf he whines and bitches tell him, \"Well you are not being productive, we need some work done, so until you come back I am hiring someone. But when we have a new team mate I will not fire him when you come back, so you do the work or we'll both deal with less pay. OH by the say I'm taking the next month off\". \n\nYou have a business, not a friendship. ",
          "score": 1,
          "created_utc": "2026-02-28 21:53:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ybj5x",
          "author": "drteq",
          "text": "Go hire some people for 20k a month and see what happens",
          "score": 1,
          "created_utc": "2026-02-28 22:13:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ycpsy",
          "author": "Calm-Passenger7334",
          "text": "The fiction in this sub is wild",
          "score": 1,
          "created_utc": "2026-02-28 22:20:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ycuy2",
          "author": "Embarrassed-Army-420",
          "text": "Naah, give him time bro. New baby needs time. Play the long game, all the above advices are like VC advices. But yes, you need reduce the amount you pay him. 7-8k is reasonable invest in hiring 2 developers with the budget saved",
          "score": 1,
          "created_utc": "2026-02-28 22:20:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ydtvg",
          "author": "phatsystem",
          "text": "Some super hot takes in this thread.\n\nThe best advice here is you gotta talk to him. Hard conversations are much less hard early. They are super hard when it's too late. If you guys are close friends, this should be something you can talk through fairly rationally. You know him well, unlike some other cofounder relationships.\n\nYou should also just get all your ducks in a row. What is the agreement you guys signed (if any) becoming cofounders? A lot of what you can and can't do can come from this.\n\nIt doesn't hurt to get some legal advice, scenario planning. Hopefully it won't, but it could end poorly and you should just be prepared for various routes it can take. You might ask what kind of structures can work for a buyout if it comes to it. I'm not sure where 3x revenue comes from exactly (it's a perfectly reasonable multiple in certain cases), but you could very well come up with a buyout plan that has an earn out or deferred payment so don't think it's $1m out of your personal checking account tomorrow to get it done.",
          "score": 1,
          "created_utc": "2026-02-28 22:26:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7yixzm",
          "author": "OrganizationWinter99",
          "text": "\\> But I'm completely drowning. Doing sales, support, marketing, and now dev. Just using whatever works. Notion, Airtable, Zapier for automations, Descript and APOB for video stuff when I need it.\n\nhim or both of you need to take a salary cut. 10k dollars for a few months isn't a bad deal, because it would afford you guys a dev, a good marketer, a few support guys and sales guys. 17 GRAND is a lot. you can build a whole offshore team from this money.",
          "score": 1,
          "created_utc": "2026-02-28 22:54:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7z26zr",
              "author": "Potential_Cat4255",
              "text": "Sounds like the sales guy cant get his shit together and make it automated, but the IT guy did that exactly.",
              "score": 1,
              "created_utc": "2026-03-01 00:47:26",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7z2d9q",
                  "author": "OrganizationWinter99",
                  "text": "you may automate away other jobs but you can't do that to the founder job.   \n  \nwhen you're a founder, there is always another problem on the table to solve. this is just forgetting what you should do.",
                  "score": 1,
                  "created_utc": "2026-03-01 00:48:25",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7ymnnl",
          "author": "ygthb",
          "text": "I wouldnt bring it up as a negative for him, but that the business is growing, and you need to hire.  Now that hire can take small equity and multiply both your efforts",
          "score": 1,
          "created_utc": "2026-02-28 23:15:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7yrivw",
          "author": "lukbul",
          "text": "So I have a software company. We recently transitioned into AI engineering studio. Part of my team is still working in heavily regulated space (fintech projects), they work in a standard mode. But me and another dev delivered a project that would normally take 6-9 months of 4 people team in 2 months. What I’m trying to say that your friend value went down drastically. Nuclear option is to cut your friend by literally doing as much as he does. Building the same project with very small team on a side and transitioning your clients to the new entity that owns the IP. \n\nFeel free to reach out if you want to chat about it.",
          "score": 1,
          "created_utc": "2026-02-28 23:44:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7z2c9v",
              "author": "Potential_Cat4255",
              "text": "No one really appreciates heavy lifting of IT ppl",
              "score": 1,
              "created_utc": "2026-03-01 00:48:17",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7yumf0",
          "author": "tastychaii",
          "text": "What’s the start up?",
          "score": 1,
          "created_utc": "2026-03-01 00:03:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7yxg7h",
          "author": "SwayBuilds",
          "text": "had similar issue. was resolved by doing comp as salary based on work contributed with a reasonable baseline for equity holders. Over time your increased salary can buy out his portion if you want (ie. Take the extra you get and stockpile it)\n\nbut the advice on having candid feedback sharing YOUR struggles and not blaming is how you start this",
          "score": 1,
          "created_utc": "2026-03-01 00:19:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7yyzwi",
          "author": "Pull-Mai-Fingr",
          "text": "I had a similar experience with a cofounder. Ask that you each keep a daily accountability log of what you are actually working on. Calls and meetings might be productive, but it may just be time-suck nothingness. This can help you each be accountable to yourselves and to one another. It is very easy to take this success for granted and then let the business die a slow death because you are so comfortable.",
          "score": 1,
          "created_utc": "2026-03-01 00:28:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7yztti",
          "author": "BenjayWest96",
          "text": "How much cash is currently in the business? Who is the CEO? How is the business structured? And what the hell are you doing, if he’s your friend he’ll be open to a conversation about restructuring how the business runs.\n\nThere’s nothing wrong with him stepping back into an equity only position or fractional CTO. He gets paid a salary and still owns 50% but the fact you are each taking all of the profit out each month is terrifying.\n\nYou need a serious cash reserve at the MRR you are hitting and clearly just need to hire an engineer. I don’t know about the complexity of your product but with 55K per month coming in you absolutely cannot afford not to have a full time engineer (or two) there full time.",
          "score": 1,
          "created_utc": "2026-03-01 00:33:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7z2jfg",
          "author": "Potential_Cat4255",
          "text": "Sorry man\n This is bullshit.\n\nThe IT guy should buy you out and automate sales flow or hire fee guys from freelancets to replace you.\n\nYou undervalue the importance of having a stable IT build.\n\nFfs its always the sales guy the marketing guy that think is the most important guy",
          "score": 1,
          "created_utc": "2026-03-01 00:49:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7z3xa7",
          "author": "SpencerAssiff",
          "text": "\"He built everything\".\n\nSo what did you do that a competent freelance sales person couldn't?\n\nYour friend took you along for his rocket ride, built an entire product (by your own words), and you have the balls to complain.\n\nBesides you not really understanding your position, the fact that you aren't smart enough to learn that you should be hiring, and how to actually run your business is crazy.\n\nHe probably understands this too and is spinning off his own company realizing he spent 6 months building a product where you couldn't contribute at all.  Enjoy your ride while it lasts.",
          "score": 1,
          "created_utc": "2026-03-01 00:57:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o813ew0",
              "author": "MrTreeOfficial",
              "text": "Exactly what I thought.",
              "score": 1,
              "created_utc": "2026-03-01 10:02:36",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7z64zm",
          "author": "Fun_Ask_8430",
          "text": "I'd say this is fairly standard partnership situation, 50/50 on the pay but almost impossible to be 50/50 on the work input. Maybe it will change but it's the risk of being 50/50 partnerships, it's very rare to have perceived value from both parties being 50% each.\n\n  \nMy dad used to be a bank manager, he said most partnerships failed because of this reason, not saying thats the case for you but it sounds common.",
          "score": 1,
          "created_utc": "2026-03-01 01:11:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7zafdl",
          "author": "heatY_12",
          "text": "If things aren’t going smoothly tell him that, also just ask if he wants to transition to a CTO roll and then take some money out of your split to pay a dev full time.",
          "score": 1,
          "created_utc": "2026-03-01 01:37:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7zr5hh",
          "author": "bombaytrader",
          "text": "Ask him to write .md files and give your project stricter and context and unleash clause code on it. Start small.  ",
          "score": 1,
          "created_utc": "2026-03-01 03:20:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7zxyov",
          "author": "asak_adrenaline",
          "text": "Maybe I'm asking a question which might help me figure my next stint, sorry for not answering your concern. What is it that you do for a living.?\n\n\nAnyway, just to answer yours, had I been at your place I would discuss the same thing with him upfront, regardless stranger/friend equation. Not getting into that professional/personal saying since yours is a blend of both, simply tell him how you feel about the whole equation so that he can get back in the game, completely this time.",
          "score": 1,
          "created_utc": "2026-03-01 04:06:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7zyk59",
          "author": "NedKelkyLives",
          "text": "You are confusing salary and equity (profit).\n\nThere's nothing wrong with sitting back and taking profit for hard work completed. But profit only comes after all costs, including salaries, are paid. \nIn your situation, you should have a salary, plus the same profit draw (if any exists after costs).\n\nWhat would the market pay for someone to do your job? This is essentially what you should get first, then what is left over can be split amongst owners in their respective ownership proportions (50/50 for you two). \n\nAlso note that keeping some capital/profit aside for unexpected costs and opportunities is a very real consideration. \n\nSpeak to your co-founder. Explain how the business needs to operate. Let him know that you can't continue as an unpaid worker (not the profit, the salary) and that you need a fair payment to reflect your additional efforts and to advance the  business upon which you both rely.\n\nYou should also both go and see an experienced commercial lawyer and draw up a shareholder agreement.",
          "score": 1,
          "created_utc": "2026-03-01 04:10:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o805vwf",
          "author": "KingriseMoondom",
          "text": "your shared profit should first go to operating expenses which includes anyone you have to hire. he should only get paid out after those expenses are paid.",
          "score": 1,
          "created_utc": "2026-03-01 05:03:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o809wxs",
          "author": "SpecFroce",
          "text": "This is a great reason to dissolve the partnership and find competent permanent employees to help you out. You are juggling too much and it’s better to buy someone out rather than holding a grudge towards someone.",
          "score": 1,
          "created_utc": "2026-03-01 05:34:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o80lyro",
          "author": "nixons_conscience",
          "text": "Pay salaries (and perhaps options - total compensation). Pay yourself relative to your input and him relative to his. He owns what's his and you own what's yours, but you also benefit (appropriately) from the lopsided salaries. His portion and your portion of the profit from MRR comes after expenses, including salaries.",
          "score": 1,
          "created_utc": "2026-03-01 07:16:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o80p78u",
          "author": "Alternative-Pay2946",
          "text": "I had a lifelong friend, we’ve known eachother since we remember. He could always count on me, and honestly, I knew how much silent approval, or an honest good word can mean to someone, as I never had it. Not even from this friend, who would call me his best friend loudly in front of everyone. I was his best man for his wedding, and he asked me to be godfather to his child. I refused, because I was going through some hardships and didn’t want to be a bad godfather. He never acknowledged my hardships, and when it got bad and I called him for help, he was busy. We didn’t talk for a while and he blocked me. His best friend.",
          "score": 1,
          "created_utc": "2026-03-01 07:47:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o80vawz",
          "author": "Expert-Birthday7928",
          "text": "IMO the only solution you have – sell your equity and start a new business, or buy your partners equity. Everything else are just temporary solutions. \n\nLessons learned:\n- on the moment you starter business with a friend, you become a partners. Forget work “friend”.\n- equity 50/50 means you don’t have clear agreement about responsibilities \n- sign shareholder agreement \n- pay fixed salary and annual/quarterly, not monthly dividends. If your parents not doing his part, you need to hire a replacement.\n- it’s totally OK that one partner doing more that other. Question is only duration.",
          "score": 1,
          "created_utc": "2026-03-01 08:44:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o80x5ib",
          "author": "Independent_Pen5980",
          "text": "Without reading more than your first post, I'll tell you that he is the least of your troubles and the biggest obstacle that you have regardless of how you decide to proceed is that devils number of 50/50.... 50/50 in all business and word processing softwares from this time forward should just be programmed to auto-correct itself to MAKING LAWYERS RICH!... Don't get me wrong, they will GLADLY spend 4 months on your dime billing to email back and forth to try and remedy the 50/50, but without something else establishing one side with stronger voting rights etc... any disagreement or deadlock is the type of stuff \"wisdom\" is built from... P.s. do you guys just write every dollar you bring in into your personal bank accounts??  I ask because you say you spent $4,000 and he doesn't even know... that's a red flag any way you split it... Sounds like you guys are more attracted to the idea of \"being founders\" than making a thriving company",
          "score": 1,
          "created_utc": "2026-03-01 09:02:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o80yauo",
          "author": "Consistent-Run-5863",
          "text": "Hire me 4k/month i’ll save you",
          "score": 1,
          "created_utc": "2026-03-01 09:13:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o810yh2",
          "author": "Mental_Asparagus1578",
          "text": "nice",
          "score": 1,
          "created_utc": "2026-03-01 09:39:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o812gb9",
          "author": "Ok_Run_101",
          "text": "let me get the math straight: you make $55k per month, but you pay $27k x2 = $54k.  \nYou have almost no money left to pay for any expenses. This is terrible financial management.  \nYou have to straighten out your finances first. \n\nMake the agreement 50/50 of PROFIT, not REVENUE. Then, if he's not working, just hire more people or SaaS or whatever to do his work. That'll increase expense, and profits should decrease. Both of you will have less money coming in. At that point, I'm sure your co-founder would be happy to talk about how to increase profits.",
          "score": 1,
          "created_utc": "2026-03-01 09:53:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o81541t",
          "author": "puru991",
          "text": "Just share this post, you cannot explain bettwr than this?",
          "score": 1,
          "created_utc": "2026-03-01 10:18:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o817qgb",
          "author": "Acceptable-Ad-5725",
          "text": "Let me help you as you figure out what to do with him. I'm good with sales.\n\n",
          "score": 1,
          "created_utc": "2026-03-01 10:44:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o81b77x",
          "author": "DoNotEverListenToMe",
          "text": "god dang,  i am jelly of both of you. With the amount of money  \nIt sounds like you guys are pretty much taking every dollar in out to pay yourselves, which is scary.   \nBUT\n\nWhat I would do since you need help is ask him to go to 22K and maybe you take a small cut as well and hire staff. \n\nThen you wont be as burdened and you can live the good life too. \n\n",
          "score": 1,
          "created_utc": "2026-03-01 11:16:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o81edya",
          "author": "Creative_Tell_2426",
          "text": "damn this seems so complicated. well i am also looking for a partner but i would say always keep friendship as friendship and professionally be professional only",
          "score": 1,
          "created_utc": "2026-03-01 11:45:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o81kl26",
          "author": "qingywingy",
          "text": "If he built everything and you guys are succeeding, clearly he is talented and is an asset to the business. Postpartum can be hard for both the mom and dad - 10% of dads go through postpartum depression (it’s not just a mom thing). It would be worthwhile to ask him what’s going on at home before going straight to “you are not contributing”. Also understand that talking about this stuff might be really hard for him - “adjusting to the baby” sounds to me like he is struggling adjusting to the baby. (I run a mental health company specialized in postpartum mood disorders) \n\nThe cofounder relationship is not strictly business. One day something might happen with you and you’d want to trust that your cofounder has your back.",
          "score": 1,
          "created_utc": "2026-03-01 12:37:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o81m7v3",
          "author": "kierandes",
          "text": "One question, do you guys have a shareholder agreement, with a designated tie breaker person ( neutral)?\n\n If so, you can keep it to that. Be honest. That you are drowning in work and  the workload is no longer 50 /50 - as per our agreement. On the business side, you need more support from somewhere, that ye can work something out if he can't support the same work levels.\n\nIn my opinion, make the problems you have the issue and try to build to address the problem the business has together. Then ye can look at options, like taking on another developer or co-founder using some of his equity ( as an example ).\n\nPeople change, situations change, in an ideal world, he could do the same workload as before though it's unlikely without being up front and making changes. \n\nAnother thought might be how ye can use AI and automations to help him to be more productive, work on async work channels that might give him the flexibility to be productive. Happy to help here as I'm a Dad with a toddler myself, so I get it.",
          "score": 1,
          "created_utc": "2026-03-01 12:49:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o81px6n",
          "author": "Bl10s",
          "text": "Don't change the equity change the salary. You can split the profit but if you are doing more get paid more on the upfront salary.",
          "score": 1,
          "created_utc": "2026-03-01 13:15:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o81snj4",
          "author": "Sweet_Yogurtcloset57",
          "text": "As mentioned during initial days it was him doing all the tasks and maybe this is hurting you now cause the money you are getting for doing nothing is way higher than it would be when you have started so think of this and just talk for it",
          "score": 1,
          "created_utc": "2026-03-01 13:33:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o81sy8n",
          "author": "ExcitingImage9211",
          "text": "jokes aside. you can hire people to even eliminate the day to day ops for yourself too. its your choice. maybe he's done with it, or maybe he complies. if you hate him, bring an investor to replace him. hoping your story is fabricated, else its psychologically messy. ",
          "score": 1,
          "created_utc": "2026-03-01 13:35:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o81vf4t",
          "author": "Pitiful_Pen5934",
          "text": "You are making 55k MRR and rather burn out before you hire employees? And why would a company pay a salary to someone who isn’t working? This is nonsense. \nFirst of all define an appropriate fixed base salary for a management role (like 10k monthly salary for a full time management role). Then define your roles (most likely CEO, CTO?) and work time (full time, part time) including role descriptions in a contract. You can afford legal help so you have proper contracts within days. Now both of you can decide how much you are willing/able to work. If your friend decides to work part time or not to work at all you just hire a dev. No upwork devs or freelancers. By the end of the year you both decide what to do with surplus (pay out 50/50, invest in company, …).",
          "score": 1,
          "created_utc": "2026-03-01 13:50:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o820nzj",
          "author": "BlablaWhatUSaid",
          "text": "You'll destroy the friendship if you don't bring it up. You need to lay out the issues and what you have been doing and that it's drowning you. If he cares about you he'll take it seriously and start doing his part. If you don't say anything, he'll assume all is fine and he can continue as now. He should also know that you're paying for help out of pocket, these costs need to be divided, if he's not willing to give up a part of his salary, he needs to step up. 9 months is a he'll of a paternity leave. \n\nJust talk constructively and if he's still in it and he's a true friend he'll pick up the slack or help search for solutions to reduce workload. Don't carry this alone.",
          "score": 1,
          "created_utc": "2026-03-01 14:21:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o8223ke",
          "author": "j35u5fr34k",
          "text": "At 26k a month, you can afford to hire people.  LOL",
          "score": 1,
          "created_utc": "2026-03-01 14:30:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o824gp8",
          "author": "Conclusion-Mountain",
          "text": "Can't read this long.\n\nAre you guys hiring for sde.\n Lmk\nCheers",
          "score": 1,
          "created_utc": "2026-03-01 14:43:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o829yk7",
          "author": "Ok_Break_2702",
          "text": "Not sure why you're paying outside coders out of pocket when its clearly a business expense, which might actually incentivize him to start pulling his weight more and understand your point",
          "score": 1,
          "created_utc": "2026-03-01 15:12:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o82a3uw",
          "author": "Best-Doc-Ever",
          "text": "Why paying out of pocket for anything.",
          "score": 1,
          "created_utc": "2026-03-01 15:13:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o82ixvo",
          "author": "Many-Environment7157",
          "text": "I'm that relaxed partner, and I'll say that in his mind, you're doing all the routine work, which is why you were hired for the project, while he's fulfilling the strategic goals. If you could do something yourself, you would, right?\nI'm sure that one call from him, in the long run, brings as much benefit as a month of your routine work.",
          "score": 1,
          "created_utc": "2026-03-01 15:57:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o82k39a",
          "author": "Infamous_Knee3576",
          "text": "Why are you doing out of pocket expenses ?? U must be having a business account use that. Also you are being income taxes on what you pay. \nU are taking it wrong.\nU need to setup a structure and do all expenses via business account. \nIt's more of your communication issue . ",
          "score": 1,
          "created_utc": "2026-03-01 16:02:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7wk6u5",
          "author": "jasmeet0817",
          "text": "wow that;s horrible of him.",
          "score": 1,
          "created_utc": "2026-02-28 16:45:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7xb37p",
          "author": "spiderjohnx",
          "text": "Be a man",
          "score": 1,
          "created_utc": "2026-02-28 19:00:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7wr2xy",
          "author": "MOTIVATE_ME_23",
          "text": "Be a dick.  He started it.  \n\nDon't prioritize the friendship.  You can always find more friends. \n\nHe prioritized his family over the job. He's taking advantage of you right now. By playing stay at home dad.\n\nUnless his kid is deathly ill, he should have arrived at a healthy balance already or stepped away.\n\nIf he has taken time or money away from the business to start a side project, you can sue for halvsies because that is breach of contract.\n\nJust tell him you have to bring on another co-founder out if necessity and it will dilute his share, only his share.",
          "score": -1,
          "created_utc": "2026-02-28 17:19:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7x1if8",
          "author": "gitstatus",
          "text": "It’s crazy, not a single comment here is about how difficult it is to be a parent. \n\nLeaving that aside, your main problem is splitting earnings every month 50-50. That’s a mistake. \n\nWe are 4 people and the two high stakes founders don’t even take any salary. Just dividends from profits yearly. And the other two low stakes founding partners who do day to day work take salary and dividends.",
          "score": -1,
          "created_utc": "2026-02-28 18:12:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7y16nm",
              "author": "RadMax468",
              "text": "Because being a parent is something you choose to do. Therefore, it's on you, as the parent, to meet your responsibilities. You aren't entitled to have everyone else jump through hoops and suffer just because you chose to breed.",
              "score": 0,
              "created_utc": "2026-02-28 21:17:52",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7zpowl",
                  "author": "gitstatus",
                  "text": "There’s a reason why companies have parental leaves, especially after having a baby. I’m glad people like you and others in comments aren’t in our team. All 4 of us have had babies since we started the company and one of us even went on to take a full year’s break (ofcourse he joined calls) for parenting.",
                  "score": 0,
                  "created_utc": "2026-03-01 03:11:05",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7xtt7e",
          "author": "village-asshole",
          "text": "I can relate to this. You absolutely need to have the talk",
          "score": 0,
          "created_utc": "2026-02-28 20:37:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7wh9m5",
          "author": "Jswizz13___",
          "text": "3x revenue is not how valuations work😭",
          "score": -2,
          "created_utc": "2026-02-28 16:30:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7wru0t",
              "author": "MixFine6584",
              "text": "Dont know why you got downvoted. Depends on the industry but 2 x revenue is generally a good starting point. But there are too many factors to think 3x revenue is a good or bad price.",
              "score": 0,
              "created_utc": "2026-02-28 17:23:28",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7x1h5c",
                  "author": "Jswizz13___",
                  "text": "valuations are typically based on EBITDA/SDE and a multiplier depending on other factors, mainly industry, but also quality of revenue, whether clients are recurring, historic growth rates…etc",
                  "score": 2,
                  "created_utc": "2026-02-28 18:12:10",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1rcheiu",
      "title": "We grew a 6k Discord community before getting real product traction - now stuck on the next step",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1rcheiu/we_grew_a_6k_discord_community_before_getting/",
      "author": "Santiago_Lawliet",
      "created_utc": "2026-02-23 13:27:48",
      "score": 14,
      "num_comments": 10,
      "upvote_ratio": 1.0,
      "text": "We’re a small gaming startup and learned the hard way that pushing product first didn’t work.\n\nSo we focused on building a Discord community instead - running small daily events, rewarding engagement (not just invites), and partnering with niche servers. That got us to \\~6k members.\n\nNow the real challenge: how do you turn an active community into actual product users without making it feel like marketing?\n\nWould love to hear how others have handled this.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1rcheiu/we_grew_a_6k_discord_community_before_getting/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o6yb085",
          "author": "KaisonKeller",
          "text": "You have already done the hardest part, you built an audience that actually listens. That's huge.\n\nNow you should treat your discord as your first test group not your first sales channel.\n\nStart by inviting a small portion of your most active members to try the product early and ask for genuine feedback .Position it as \"help us shape this\" rather than \"please buy this\". People are much more willing to participate when they feel involved in building something.\n\nIf the feedback is good and the product resonates then you can share it more broadly in the server. Even if only 10%convert at first, that is a strong starting point and more importantly, those early user will naturally talk about it inside the community. That organic word of mouth is way more surface bugs, suggest upgrades, and tell you where people are getting stuck. That feedback loop is the real value of having a community.\n\nThe key is making them feel like insiders and contributors not customers being marketed to.",
          "score": 3,
          "created_utc": "2026-02-23 14:03:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6yp3fk",
          "author": "Inevitable-Ad6767",
          "text": "I love your strategy; it should work very well. Maybe give the 6k members some sort of free trial or extra in-game stuff… that should help.",
          "score": 2,
          "created_utc": "2026-02-23 15:18:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6y9t2r",
          "author": "chauvetzer",
          "text": "Hey, my job is to help companies like yours turn profitable, if you want you can reach out through dm and we can talk about it",
          "score": 1,
          "created_utc": "2026-02-23 13:56:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6yciwe",
          "author": "Santiago_Lawliet",
          "text": "btw, you guys can check out our project from here - [https://www.plutus.gg/](https://www.plutus.gg/)",
          "score": 1,
          "created_utc": "2026-02-23 14:12:22",
          "is_submitter": true,
          "replies": []
        },
        {
          "id": "o6z4cue",
          "author": "GarbageOk5505",
          "text": "What worked for a project I was involved with: pick your 20 most active members, give them early access with a \"help us shape this\" framing  not a launch. They become invested in the product because they influenced it. Then when you do open it wider, those 20 are already talking about it organically in the server.\n\nThe key is it never feels like marketing because it isn't  it's co-building. People promote what they helped create.\n\nWhat's the product btw?\n\n  \nupdate: just saw it",
          "score": 1,
          "created_utc": "2026-02-23 16:30:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o712ii7",
          "author": "TheGrowthMentor",
          "text": "That's actually a pretty solid foundation to have 6k engaged community members before product-market fit! What's the main challenge you're facing with the next step - is it converting community interest into actual users, or figuring out how to manage all those relationships as you scale? I've seen some startups in similar spots benefit from having a proper system to track which community members are most engaged and likely to convert.",
          "score": 1,
          "created_utc": "2026-02-23 22:00:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7d5yep",
          "author": "CycleIcy4908",
          "text": "Do a build up to your product launch, where you have live events that talk about your product, the goals, a little about the product with a showcase.\n\nOffer best pricing up front to those who purchase first then as the launch date gets closer the price gets closer to the full price. To those who buy in first (limited spots) you let them go ham and you make sure you and your team are available to give feedback and fix bugs. Implement the changes (if needed) and scale up the pool until launch. \n\nThen you can just have a VIP discord channel for people who bought the product, but keep the free community open to encourage growth of the discord and product overall. \n\nat least that how I'd do it. ",
          "score": 1,
          "created_utc": "2026-02-25 17:56:32",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rfop3x",
      "title": "Looking for companies to intern for.",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1rfop3x/looking_for_companies_to_intern_for/",
      "author": "Puzzleheaded-Pilot97",
      "created_utc": "2026-02-26 22:31:30",
      "score": 7,
      "num_comments": 11,
      "upvote_ratio": 1.0,
      "text": "Hey there!\n\nMy name is Omar and I have been studying Marketing and Social Media Management for around 2 years now, I have completed +10 certificates and courses.\n\nI can offer you business consultations, manage online ads, manage your social media platform and I am also slightly good at designing social media posts.\n\nDoes anyone have a internship role for me?",
      "is_original_content": false,
      "link_flair_text": "digital marketing",
      "permalink": "https://reddit.com/r/startup/comments/1rfop3x/looking_for_companies_to_intern_for/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o7lk0z0",
          "author": "aRandomGuy_Nevermind",
          "text": "What courses have you completed?",
          "score": 1,
          "created_utc": "2026-02-26 22:34:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7lkpfo",
              "author": "Puzzleheaded-Pilot97",
              "text": "I have completed the following:\n\n\\- Google Digital Marketing & E-Commerce professional certificate\n\n\\- Meta Social Media Management certificate\n\n\\- Google Ads full course (at skillshop)\n\n\\- Some Google Analytics 4 courses (i dont like to work in GA4 tho)\n\n\\- Introduction to Marketing by University of Pennsylvania\n\n\\- A few other LinkedIn courses",
              "score": 1,
              "created_utc": "2026-02-26 22:37:38",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7ll812",
                  "author": "aRandomGuy_Nevermind",
                  "text": "Thats actually pretty good. I'll introduce u to my manager then get back to u later.",
                  "score": 1,
                  "created_utc": "2026-02-26 22:40:16",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7lp5xt",
          "author": "20SecApp",
          "text": "Are you open to free lance as well?",
          "score": 1,
          "created_utc": "2026-02-26 23:00:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7lq5pa",
              "author": "Puzzleheaded-Pilot97",
              "text": "Sure",
              "score": 1,
              "created_utc": "2026-02-26 23:06:05",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7mqics",
          "author": "Real_Bit2928",
          "text": "You’ll likely get better results applying directly to startups or agencies with a strong portfolio, since most people on Reddit don’t hire from posts alone.",
          "score": 1,
          "created_utc": "2026-02-27 02:30:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7p4kgz",
          "author": "jasmeet0817",
          "text": "DM",
          "score": 1,
          "created_utc": "2026-02-27 13:30:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7t0jx3",
          "author": "Senior_Tip5125",
          "text": "Are you looking for a paid internship?",
          "score": 1,
          "created_utc": "2026-02-28 01:30:11",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rbs3l8",
      "title": "Laid off from startup (3 YOE) – Looking for guidance on next steps",
      "subreddit": "startup",
      "url": "/r/developersIndia/comments/1rbs379/laid_off_from_startup_3_yoe_looking_for_guidance/",
      "author": "Beginning-Bother4644",
      "created_utc": "2026-02-22 17:40:09",
      "score": 4,
      "num_comments": 5,
      "upvote_ratio": 0.75,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1rbs3l8/laid_off_from_startup_3_yoe_looking_for_guidance/",
      "domain": "",
      "is_self": false,
      "comments": [
        {
          "id": "o6un2me",
          "author": "imsimchi",
          "text": "You got this, bro. This is just a slow period for you. \n\n",
          "score": 2,
          "created_utc": "2026-02-22 22:15:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6w9le9",
          "author": "Buckwheat469",
          "text": "1. Fullstack is more widely searched than specifically frontend. You can refine your focus once you get into a job again to be more FE or FS.\n\n2. Any company that'll take you for the pay you want. Get on LinkedIn and start messaging people. Talk to lots of recruiters.\n\n3. In the next 30 days, improve your sales game. You need to sell yourself as knowledgeable, confident, and worthy of being hired. Also, play around with AI tools if you haven't so that you can say that you have some experience with them.",
          "score": 1,
          "created_utc": "2026-02-23 04:01:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6znjy6",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-23 18:00:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6znpg0",
              "author": "Beginning-Bother4644",
              "text": "Thanks a lot bhai",
              "score": 1,
              "created_utc": "2026-02-23 18:00:47",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6v15a9",
          "author": "2xOHSman",
          "text": "Start blogging, sharing your perspectives. Lean into building a personal brand while thinking thru next steps",
          "score": 0,
          "created_utc": "2026-02-22 23:33:11",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1reh41q",
      "title": "London founder building a new home services platform with CTO onboard. Seeking co founder and early stage operator. Equity based.",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1reh41q/london_founder_building_a_new_home_services/",
      "author": "EandH_ENT",
      "created_utc": "2026-02-25 15:58:49",
      "score": 4,
      "num_comments": 3,
      "upvote_ratio": 1.0,
      "text": "Hi everyone,\n\nI’m building a London based home services platform designed to make getting work done at home simple and predictable.\n\nInstead of forcing customers through endless categories and quote comparisons, they just describe what they need in plain English. We handle the structuring, match the right vetted professional, and stay accountable for the outcome.\n\nIt covers multi trade services including handyman work, cleaning, plumbing, electrical jobs and general residential maintenance.\n\nI’ve spent 15 plus years hands on in London property maintenance and have seen how messy the industry can be from both sides.\n\nCustomers compare profiles, chase updates, argue over vague pricing and often feel unsure who to trust.\n\nProviders deal with pay to play platforms, subscription fees, paying to bid, and racing to the bottom.\n\nWe’re building a cleaner structure. The operating model is defined, we have a CTO onboard, and we’re close to completing our initial pilot phase in London.\n\nI’m looking for a serious co founder who wants real ownership over growth and early execution. Equity based. Hands on. Not advisory.\n\nI’m also open to someone ambitious who wants exposure to how a real business gets built from the inside. This would be voluntary at the start, working closely with me on real tasks and real decisions. If you prove yourself and become genuinely valuable to the build, there’s a path to long term responsibility and potentially equity. No guarantees, just real opportunity for the right person.\n\nIf this resonates, DM me your LinkedIn and a short note about yourself and which route you’re interested in.\n\nEddie",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1reh41q/london_founder_building_a_new_home_services/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o7dmy90",
          "author": "Chance-Fan4849",
          "text": "I am interested, let's connect.",
          "score": 1,
          "created_utc": "2026-02-25 19:12:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7dw7bm",
          "author": "esterling",
          "text": "If at any point you need an extra pair of hands to code, develop, or test, shoot me a DM. We've built advanced marketplace-like platforms for our clients in the past.\n\nKeeping my fingers crossed for your platform!",
          "score": 1,
          "created_utc": "2026-02-25 19:55:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7hmtyh",
          "author": "Bulky_Tennis_2653",
          "text": "This sounds interesting. I work in digital marketing with a focus on customer acquisition and growth. Home services can scale quickly with the right local targeting and funnel strategy. Would be great to hear more about your vision and where you see marketing fitting in.\n\n",
          "score": 1,
          "created_utc": "2026-02-26 09:59:49",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rdrqc0",
      "title": "I have completed over 500 user experience tests. Let me help you with yours for free.",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1rdrqc0/i_have_completed_over_500_user_experience_tests/",
      "author": "defused10",
      "created_utc": "2026-02-24 20:30:25",
      "score": 4,
      "num_comments": 9,
      "upvote_ratio": 1.0,
      "text": "Over a 6 year period I have completed **over 500 user tests** on platforms like [Usertesting.com](http://Usertesting.com), UserCrowd, uTest and Userlytics (to name a few)\n\nLet me help you for free with your website/platform.\n\n  \nIf the requests get too much- I will point out one change that I suggest you can make.\n\n\n\n**I AM NOT SELLING any services/promoting myself**, I literally want to see if my skill is something that could be useful down the line/venture into something in future thus the offer for free.\n\n  \nThank you and have a great day :)",
      "is_original_content": false,
      "link_flair_text": "knowledge",
      "permalink": "https://reddit.com/r/startup/comments/1rdrqc0/i_have_completed_over_500_user_experience_tests/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o79yjrh",
          "author": "TumbleweedTiny6567",
          "text": "so you've done 500 tests from the tester side, not the product side right? that's actually a really interesting angle because most people offering UX feedback are designers or PMs who've never sat through the actual testing process themselves. i've been running my own usability sessions for a side project and honestly the hardest part is knowing which feedback to actually act on vs what's just one person's preference. do you feel like after 500 tests you can tell the difference between \"this is genuinely confusing\" and \"i personally don't like this\"? because that distinction alone would be worth a lot. also curious what platform types you've tested most. like are we talking SaaS dashboards, ecommerce, mobile apps? wondering if there's a pattern in what breaks most often.",
          "score": 1,
          "created_utc": "2026-02-25 05:17:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7a8znr",
              "author": "defused10",
              "text": "Hi there. Thanks for your message. So by profession I am actually a client facing web/app support manager and branching off into business analysis. The tests started off as a 'free time COVID thing to make money' and I haven't stopped doing them. These test platforms ask for your profession then link you to tests that they think you will have the most impact on. I have done test for multiple companies (very large conglomerates and smaller companies) as well as multiple types i.e. moderated tests which usually entail a designer going through the flow and ask you questions to get your input as well as unmoderated tests where you will do a recording of yourself interacting with their product. The tests do greatly vary i.e. from dashboards, to mobile apps, to ecommerce, websites etc. A lot of them are prototypes of a product, feature etc. Some are as simple as just asking your opinion on a name for a new feature while some are much more technical and require you to complete tasks on figma with the prototype. To be honest, I feel the major issue is just trying to put yourself in YOUR customers shoes- A lot of companies get this wrong for various reasons/some of the reasons your mentioned above. If you get this wrong from the get-go there's no turning back. For example, a recent moderated test I did involved a revolving credit facility feature but there was too much unrelated/high level jargon for example, wording like 'credit allocation' instead of 'expected credit' The webpage also was too long for what they were trying to accomplish. The feedback I gave them was to condense and remove all the jargon all together to make the product experience a bit more simpler and intuitive for the customer they were trying to connect with. Thanks.",
              "score": 1,
              "created_utc": "2026-02-25 06:40:48",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7aek1f",
          "author": "wild_wong",
          "text": "Hello, congrats on the 500 completed tests you achieved. I'm currently working on [EcoVerify](https://ecoverify.vercel.app) amd would love your thoughts on it.\n\nIt helps people track eco-friendly actions so they can reduce their environmental impact.\n\nIt shows you how eco-friendly everyday things are.\n\nYou snap a photo of something like packaging or food, and the app analyzes how environmentally friendly it is and gives you feedback. \n\nThe goal is to help people make better choices and be more aware.",
          "score": 1,
          "created_utc": "2026-02-25 07:29:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7aszlu",
              "author": "defused10",
              "text": "Thanks for reaching out. Great concept, especially in today's enviro conscious world. I like how you explained it above, \"You snap a photo of something like packaging or food, and the app analyzes how environmentally friendly it is and gives you feedback.\" Try putting this wording on your home page and let the user get greeted with this instead of  \"The world's first AI-Verified ledger for personal impact...prove your impact.\" Also the word 'audit' can be very broad and lost in translation, perhaps look for simpler wording i.e. like 'Start your first label scan' etc. Also your light mode text gets lost in between the colour scheme i.e. the grey with white text gets really difficult to read i.e. 'capture, analyze and ascend' maybe change the grey text background for something slight darker/change the wording or put an outline on the wording so its easier to read. You also mention some benefits i.e. CO2 credits etc, perhaps try making this more apparent on the landing page as well so the user can see the true benefit they get from using the platform. Perhaps also add images of actual/common product labels so people see how the platform works. Other than that I think its a great site and has a lot of potential. Thanks",
              "score": 1,
              "created_utc": "2026-02-25 09:44:29",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7hnvbr",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-26 10:09:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7nudo2",
              "author": "defused10",
              "text": "Hi there. Thank you for reaching out. The site looks great, love your colour scheme. I logged in using a google account and everything worked as expected. Interacted with your AI and it was great. The only thing is once I created a task using the AI feature I didn't know where it was housed as the menu at the top was collapsed. Perhaps for first time users maybe open up the menu at the top/provide an email link when a task has been assigned to someone? Since big companies are using Jira etc. I would try to find a niche i.e. small to medium businesses and create a package/show them the benefit of using your platform, sort of like a case study/story that you can use to show practical benefit maybe even put it in a video that you can put on your homepage. Overall great platform.",
              "score": 2,
              "created_utc": "2026-02-27 07:07:59",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7nv70j",
                  "author": "Vegetable-Junket262",
                  "text": "thank you for detailed overview , i have just added a video in landing page , and i didn't know that navbar was collapsing thank you for letting me know , also i will add they email feature you descibe",
                  "score": 1,
                  "created_utc": "2026-02-27 07:15:07",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1rdr7cd",
      "title": "Trying to build 3 projects at the same time. Not sure if it's smart or stupid.",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1rdr7cd/trying_to_build_3_projects_at_the_same_time_not/",
      "author": "Last-Salary-6012",
      "created_utc": "2026-02-24 20:11:27",
      "score": 4,
      "num_comments": 18,
      "upvote_ratio": 1.0,
      "text": "Right now I’m working on 3 different projects at the same time:\n\n• A SaaS product  \n• A service-based website  \n• A niche content project where I’m trying to hit 10k traffic in 3 months\n\nI handle everything myself  frontend, backend, SEO, deployment, UI tweaks, server issues, content strategy… all of it.\n\nOn paper, it feels productive.\n\nBut in reality? I feel like I’m moving in 10 directions and not making real progress in one.\n\nRevenue isn’t where I want it to be yet. Traffic is slow. Every day feels busy, but not necessarily effective.\n\nPart of me thinks I should double down on just one thing.  \nAnother part of me is scared to kill the other ideas in case one of them could have worked.\n\nHas anyone else gone through this phase?\n\nHow did you decide what to focus on  and what to let go?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1rdr7cd/trying_to_build_3_projects_at_the_same_time_not/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o78kq1k",
          "author": "TumbleweedTiny6567",
          "text": "been there with the 3 projects thing. one thing that actually helped me was picking a \"lead project\" each week, like 70% of my energy goes there and the other two just get maintenance mode. trying to push all three forward equally is what kills progress. since you're chasing 10k traffic on the content project, i'd honestly make that the lead for a few weeks because SEO compounds and the earlier you stack content the faster it pays off. the saas and service site can coast on small tweaks while you bank that momentum.",
          "score": 2,
          "created_utc": "2026-02-25 00:22:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7i5fzz",
          "author": "misk_anxiousfounder",
          "text": "This is really something YOU need to decide based on where you are and want to go, not some generic thing on what other people have done.\n\nPersonally for me, I am building two things and they’re both helping me with the life I want to have down the line.\n\nI divide my days between both the projects and I go back to basics of Eisenhower and Pareto’s principle  a lot;\n\n\n1. Eisenhower matrix: Are all 3 of these projects equally important or urgent? If not what can be delayed vs doing right now.\n2. Pareto’s Principle: What’s your goal and what is the 20% that you must do to get to 80% of achieving it.",
          "score": 2,
          "created_utc": "2026-02-26 12:33:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7iscv3",
              "author": "Last-Salary-6012",
              "text": "You’re right. I probably need to reassess what’s actually important vs just urgent. Thanks for the reality check.",
              "score": 2,
              "created_utc": "2026-02-26 14:44:28",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7c2cgg",
          "author": "TumbleweedTiny6567",
          "text": "honestly the fact that you're self-aware enough to question it probably means you already know teh answer. i've done the \"3 projects at once\" thing and what i realized is i wasn't actually being productive, i was just staying busy. there's a difference. the hardest part isn't building, it's choosing which one to go all in on because that means admitting the other two might die. but if none of them are generating revenue yet, spreading yourself thinner isn't going to fix that. pick the one closest to money and give it 80% of your time for 30 days. the other two will still be there.",
          "score": 1,
          "created_utc": "2026-02-25 14:53:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7e5cfl",
          "author": "ai_understands_me",
          "text": "I'm working 80ish hours a week just building ONE thing and thinking that isn't enough time.",
          "score": 1,
          "created_utc": "2026-02-25 20:38:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7eciey",
          "author": "Eugeniusz87",
          "text": "Been there. Juggling multiple projects feels productive, but context-switching quietly kills momentum.\n\nWhat helped me was simple: I tracked traction for each project for a few weeks, then doubled down on the one showing actual signal, not the one I was most emotionally attached to. The others I parked, not killed.\n\nYou don't need to abandon ideas, just sequence them. One thing working beats three things in progress",
          "score": 1,
          "created_utc": "2026-02-25 21:12:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7fq7sh",
          "author": "Several-Dentist6745",
          "text": "I think it's a bad idea to work on multiple project at one time may be max two you will lose the focus and end up with no results in all of them",
          "score": 1,
          "created_utc": "2026-02-26 01:31:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7hdviv",
          "author": "Evil-monkey-2026",
          "text": "Stupid, follow Steve jobs theory of signal vs noise",
          "score": 1,
          "created_utc": "2026-02-26 08:32:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7hftzb",
          "author": "IdeasInProcess",
          "text": "Not crazy but you're almost certainly making less progress on each than you think. I've never seen anyone pull off three separate codebases at once without at least one of them basically stalling. Pick whichever one matters most right now. The other two aren't going anywhere.",
          "score": 1,
          "created_utc": "2026-02-26 08:51:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7mv5jc",
          "author": "Abstractconjecture",
          "text": "I'm building a business system with AI agent. And just launched my android app ScrollTroll (helps people off social media). \n\nSo hard to do two things, I wouldn't be able to do 3. \n\nCurrently struggling to get any traction with my app as the focus is on the business system.",
          "score": 1,
          "created_utc": "2026-02-27 02:57:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7w015c",
          "author": "NellieApp",
          "text": "Definitely hard to manage multiple projects at once especially with a small team or solo. If you already have significant development on them, or they are in production, I'd say try to focus on getting them all stable, then you can focus on whichever one has the best value, simply providing critical maintenance for the others until you have more resources to manage them all.",
          "score": 1,
          "created_utc": "2026-02-28 15:03:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o81tqch",
          "author": "portal2d",
          "text": "From my stand point, I treated the mindset more like I’m an agency, managing the build of projects, one project needs more attention than others almost always while things that are more simple for the other two don’t require nearly as much mental or capital.",
          "score": 1,
          "created_utc": "2026-03-01 13:40:32",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1re0ewe",
      "title": "How a Ukrainian immigrant built a $250k/mo luxury car rental fleet starting with one 2011 Porsche.",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1re0ewe/how_a_ukrainian_immigrant_built_a_250kmo_luxury/",
      "author": "vinodpandey7",
      "created_utc": "2026-02-25 02:12:44",
      "score": 4,
      "num_comments": 0,
      "upvote_ratio": 0.84,
      "text": "I recently deep-dived into the story of Natalia Zorina, who built a massive luxury rental business in Miami. Most \"hustle\" stories skip the messy parts, but this one was actually practical.\n\n**The 3 biggest takeaways for anyone building a service business:**\n\n1. **The \"Third Trip\" Rule:** Her first car got wrecked on just the 3rd trip. Instead of quitting, she realized the insurance/platform system actually worked. It turned a fear into a scalable process.\n2. **Scaling through Co-hosting:** She doubled her fleet overnight from 10 to 20 cars by managing other people’s assets (70/30 split). This is how you scale without burning your own capital.\n3. **The Platform Trap:** She was doing huge numbers on a major platform until she got banned in May 2025 with one email. Since she already had \"Plan B\" (Private rentals via Google Ads/Brokers), her business survived.\n\n**The Math of a Red Corvette (Real numbers she shared):**\n\n* Lease: $1,200/mo\n* Turo Revenue: \\~$2,600/mo\n* Private Rental Revenue: \\~$4,000/mo\n\nIt’s a reminder that \"rented land\" (platforms) is great for starting, but private ownership of the customer is the only way to stay safe.\n\nI wrote a full breakdown of her operations, financing with no credit, and how she handles the \"Roblox-spending\" 9-year-old son who helps with reviews lol.\n\n**Link to full breakdown:** [https://www.thestartupstorys.com/2026/02/how-one-immigrant-built-100-car-luxury-rental-startup-in-miami.html](https://www.thestartupstorys.com/2026/02/how-one-immigrant-built-100-car-luxury-rental-startup-in-miami.html)\n\nHappy to discuss the co-hosting model or her financing strategy in the comments!",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1re0ewe/how_a_ukrainian_immigrant_built_a_250kmo_luxury/",
      "domain": "self.startup",
      "is_self": true,
      "comments": []
    },
    {
      "id": "1rfe89h",
      "title": "I hit $12k/mo as a bootstrapped founder. Here's what worked for me",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1rfe89h/i_hit_12kmo_as_a_bootstrapped_founder_heres_what/",
      "author": "felixheikka",
      "created_utc": "2026-02-26 16:08:52",
      "score": 4,
      "num_comments": 1,
      "upvote_ratio": 0.84,
      "text": "I hit $12k/mo in January and my SaaS is completely bootstrapped!\n\nI haven’t had a viral blow-up or anything, I’ve just been working hard and grown steadily since I started almost 1.5 years ago.\n\nFor context, my SaaS is focused on product development.\n\nI wanted to make this post because I remember starting out and falsely believing that growth would come from going viral and then sort of just exploding from there. That hasn’t been the case at all.\n\nI guess the “boring news” is that it just takes a ton of consistent work. But all work isn’t equal and there’s definitely been things that had a bigger impact on my growth.\n\nSo these are the 4 big things that really made a difference for me:\n\n**1. Validating my idea before building**\n\nI validated my idea through a survey on Reddit which showed me there was demand and I was onto something. This was something I had failed with before which led to months of building and marketing something no one wanted. Those months really sucked. The demand was clearly confirmed when I later launched and got 100 users in the first 2 weeks (a big moment for me).\n\n**2. Clearly defining my ICP**\n\nThis is a constant work in progress but it’s really made a difference for me. I keep a document where I add notes and insights based on every piece of feedback I get about my ICP. This feedback comes from emails, social media comments, talking to my customers, etc. Basically all info that helps me paint a clear picture in my mind of exactly who I'm building for. My ICP affects all my decisions from how I should improve my product to how I shape my marketing message. My experience has been that you can always go deeper in your understanding of your ICP and this is how you build a product they love and how you do marketing they can’t ignore.\n\n**3. High-volume marketing**\n\nThe key to my content marketing (X, LinkedIn, Reddit) has been high volume since the beginning. When I started out I underestimated how much volume it takes to get results. Marketing is competitive. You’re competing for the same attention as everyone else. High volume gets you seen but it’s also what lets you learn faster and improve so you become more competitive. An example of this is when I was marketing my MVP on X. I did 3 posts and 30 replies every day for 1.5 months. Someone starting out might aim for “a few” posts per week thinking it’s enough to grow and see results.\n\n**4. Getting on calls with my users**\n\nActually talking to my users helped me figure out what to build and what people really needed. This is what let me shape the app to truly fit the market need and it’s a big reason why my word of mouth spread has been so good. Calls aren’t the only form of feedback of course, I also recommend making it as simple as possible for your users to leave feedback within your product. All forms of feedback has helped me a ton. To get calls I have a simple email in my funnel asking them if they’d be willing to jump on a quick call to give feedback (you'd be surprised by how many are willing to do it).\n\nAll this might not sound like magical advice but it’s the stuff that genuinely worked based on my own experience.\n\nIf you want more fun advice you’ll have to ask someone who went viral on tiktok I guess.\n\nAnyways, I’m still early in my journey and I’m super happy with what I’ve achieved so far bootstrapped!",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1rfe89h/i_hit_12kmo_as_a_bootstrapped_founder_heres_what/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o7jnlck",
          "author": "Eugeniusz87",
          "text": "Solid post, appreciate the honesty. The \"boring\" path is usually the real one.\n\nYour point about ICP depth resonates a lot. The more precisely you understand who you're building for, the clearer product, messaging, and roadmap decisions become. Also +1 on user calls, nothing replaces hearing where the product actually creates value.  \nLooking back, was your early growth more by problem urgency or by distribution consistency?",
          "score": 1,
          "created_utc": "2026-02-26 17:10:28",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rdw0g7",
      "title": "Any exciting startup I should look ?",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1rdw0g7/any_exciting_startup_i_should_look/",
      "author": "XIFAQ",
      "created_utc": "2026-02-24 23:08:15",
      "score": 4,
      "num_comments": 45,
      "upvote_ratio": 0.83,
      "text": "",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1rdw0g7/any_exciting_startup_i_should_look/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o7a0jip",
          "author": "Rutulcc09",
          "text": "\nDon’t start with a product. Start with a problem. Find people complaining about something, then build a simple solution around that",
          "score": 2,
          "created_utc": "2026-02-25 05:32:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7bdank",
              "author": "XIFAQ",
              "text": "True.",
              "score": 1,
              "created_utc": "2026-02-25 12:32:22",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7c07yl",
          "author": "IllustriousGazelle87",
          "text": "honestly, lowkey Trendtrack is pretty cool for keeping tabs on trending startups, plus tools like Product Hunt and Indie Hackers can give you some solid leads too.",
          "score": 2,
          "created_utc": "2026-02-25 14:42:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7du4wy",
              "author": "XIFAQ",
              "text": "Ok.",
              "score": 1,
              "created_utc": "2026-02-25 19:46:17",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7d88td",
          "author": "fanstakemusic",
          "text": "Check out fanstake.app - we built the stock market for music artists!",
          "score": 2,
          "created_utc": "2026-02-25 18:06:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7du0dk",
              "author": "XIFAQ",
              "text": "DM me this so that it will stay there. I will check.",
              "score": 1,
              "created_utc": "2026-02-25 19:45:43",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o796kgp",
          "author": "MDInformatics",
          "text": "Physician founder building healthcare data security infrastructure. Not an AI wrapper or SaaS dashboard. We designed a novel data architecture (patent filed) that enforces compliance at the structural level rather than through policy layers. The core insight came from studying biological immune systems and translating those principles into cryptographic design patterns.\n\nArchitecture has been reviewed by security teams at a top-10 research institution. First customer lined up. MVP targeting spring, first integration by summer. We have contacts inside major payers and health systems who’ve confirmed the problem is urgent and unsolved.\n\nSmall team, big problem. Happy to share more in DMs.",
          "score": 3,
          "created_utc": "2026-02-25 02:24:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o79y9r2",
              "author": "Muenstervision",
              "text": "💐💐💐",
              "score": 1,
              "created_utc": "2026-02-25 05:15:54",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o7bd8z9",
              "author": "XIFAQ",
              "text": "Patient's data ?",
              "score": 1,
              "created_utc": "2026-02-25 12:32:03",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7bhfpa",
                  "author": "MDInformatics",
                  "text": "Yep. Any sensitive PHI related information",
                  "score": 1,
                  "created_utc": "2026-02-25 12:59:14",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o79j2hm",
          "author": "rdssf",
          "text": "https://www.letit.com",
          "score": 1,
          "created_utc": "2026-02-25 03:35:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7bd9py",
              "author": "XIFAQ",
              "text": "I will check.",
              "score": 1,
              "created_utc": "2026-02-25 12:32:12",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7a70dr",
          "author": "[deleted]",
          "text": "[deleted]",
          "score": 1,
          "created_utc": "2026-02-25 06:24:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7bdcw5",
              "author": "XIFAQ",
              "text": "What is the progress ?",
              "score": 1,
              "created_utc": "2026-02-25 12:32:47",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7a9wzx",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-25 06:48:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7bde5q",
              "author": "XIFAQ",
              "text": "Not for profit ?",
              "score": 1,
              "created_utc": "2026-02-25 12:33:01",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7bov4q",
                  "author": "Busy_Claim_1556",
                  "text": "There are paid features, for example if you want a pitch deck or generate market analysis or even develop and deploy prototypes.",
                  "score": 1,
                  "created_utc": "2026-02-25 13:42:34",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7aecmt",
          "author": "wild_wong",
          "text": "Try [EcoVerify](https://ecoverify.vercel.app) you'll love it.",
          "score": 1,
          "created_utc": "2026-02-25 07:27:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7bdevv",
              "author": "XIFAQ",
              "text": "I will check.",
              "score": 1,
              "created_utc": "2026-02-25 12:33:09",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7beaag",
                  "author": "wild_wong",
                  "text": "Let me know your thoughts about it",
                  "score": 1,
                  "created_utc": "2026-02-25 12:39:02",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7afk93",
          "author": "CombinationRare1232",
          "text": "We have created a NIST Compliant blockchain ecosystem which includes decentralized productivity stack like dmail, dchat, dform, dcontacts and more",
          "score": 1,
          "created_utc": "2026-02-25 07:38:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7bdgs7",
              "author": "XIFAQ",
              "text": "Proxy ?",
              "score": 1,
              "created_utc": "2026-02-25 12:33:31",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7bvfn4",
                  "author": "CombinationRare1232",
                  "text": "No",
                  "score": 1,
                  "created_utc": "2026-02-25 14:18:06",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7ay3fg",
          "author": "FounderArcs",
          "text": "Look for lead generation is really profitable nich",
          "score": 1,
          "created_utc": "2026-02-25 10:31:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7bd0sn",
              "author": "XIFAQ",
              "text": "Nah.",
              "score": 1,
              "created_utc": "2026-02-25 12:30:32",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7co88e",
          "author": "ohthatguy12",
          "text": "e2c.store",
          "score": 1,
          "created_utc": "2026-02-25 16:35:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7du1wz",
              "author": "XIFAQ",
              "text": "DM me this so that it will stay there. I will check.",
              "score": 1,
              "created_utc": "2026-02-25 19:45:54",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7jeqg5",
          "author": "PowerfulMedium6370",
          "text": "trying to build an open source community around this  \n[https://shivankar-madaan.github.io/notbuiltyet/](https://shivankar-madaan.github.io/notbuiltyet/)",
          "score": 1,
          "created_utc": "2026-02-26 16:29:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7leltd",
          "author": "Frequent_Meal6223",
          "text": "[https://www.aedify.ai](https://www.aedify.ai) we're streamlining full-stack deployment on a vertically-owned infrastructure. Would love if you could check us out and give feedback, thank you! ",
          "score": 1,
          "created_utc": "2026-02-26 22:07:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7v2ql5",
          "author": "AggrevatingApe",
          "text": "Www.Cruzenc.com ; driver first rideshare platform. Launching soon",
          "score": 1,
          "created_utc": "2026-02-28 11:18:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7vkunf",
              "author": "XIFAQ",
              "text": "Driverfirst means ? Zero commission to use the app ?",
              "score": 1,
              "created_utc": "2026-02-28 13:35:56",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7xtac7",
                  "author": "AggrevatingApe",
                  "text": "No, but the model is built to pay 75% of rideshare revenue to the driver less fees. This organization is designed to pay drivers a living wage while the business is scraping by",
                  "score": 1,
                  "created_utc": "2026-02-28 20:35:05",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7z26hy",
          "author": "ChardTop4826",
          "text": "You inspire me.",
          "score": 1,
          "created_utc": "2026-03-01 00:47:22",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rcrbtw",
      "title": "Would you guys let us create your website for free?👀",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1rcrbtw/would_you_guys_let_us_create_your_website_for_free/",
      "author": "IndependentLaw1457",
      "created_utc": "2026-02-23 19:32:03",
      "score": 3,
      "num_comments": 8,
      "upvote_ratio": 0.67,
      "text": "That’s a serious question. We’re a Web Design Studio that basically operates on a “free services” basis, besides our usual paid plans. Basically, you get to try our services for free.\n\nWe’re fully transparent on how we do things, because we know how strange this may sound🫣\n\nWe’re basically collaborating with almost every reputable Hosting Service that you could possibly think of, and in a nutshell, for any of their plans that you choose to host your website, we get paid by them. \n\nNot a percentage of what you pay for, it is a fixed commission. We’re not interested in making you pay for a higher priced plan, it makes no difference to us. \n\nWe’re not the best, and we’re not planning on being known as the best, but certainly care most. That being said, if it sounds like something that might benefit you or someone you know, feel free to reach out to us, here’s a link to our website: https://thatfreewebsite.net \n\nThank you for taking the time to read our message, and I hope everyone is having a really great Monday!!🫶🏻",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1rcrbtw/would_you_guys_let_us_create_your_website_for_free/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o74mx8u",
          "author": "Spiritual_Garden266",
          "text": "I get the model, and honestly it’s not a bad acquisition strategy, but the way this is framed will trigger skepticism for most founders\nFree usually means hidden tradeoffs, even if yours are reasonable. If the real value is affiliate commission from hosting, you’d probably get better trust by leading with that and showing a few real sites you’ve built plus what happens after launch\nFounders don’t worry about paying, they worry about getting stuck with something they can’t maintain later. If you solve that concern clearly, the offer makes a lot more sense",
          "score": 2,
          "created_utc": "2026-02-24 12:58:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o70mn97",
          "author": "BrainCompressor",
          "text": "I have a website I could use some help with it’s a fun project but a l lot to it  let me gather some artwork and ideas and I’ll get then to you.",
          "score": 1,
          "created_utc": "2026-02-23 20:43:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7nxyi3",
          "author": "theG-27",
          "text": "Dm looking to build a neuro soc website",
          "score": 1,
          "created_utc": "2026-02-27 07:39:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ucwzj",
          "author": "josephsinu84",
          "text": "Why did u guys use tallyso for form? If you're building website for others, i think you start with yours first",
          "score": 1,
          "created_utc": "2026-02-28 07:16:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o721rc1",
          "author": "YopBuilder",
          "text": "It’s not free if your forced to sign up with your affiliate link",
          "score": 1,
          "created_utc": "2026-02-24 01:12:51",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rd8pbu",
      "title": "Scope Creep Is a Real Problem - Why Verbal Alignment Erodes Margins In IT Work",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1rd8pbu/scope_creep_is_a_real_problem_why_verbal/",
      "author": "its_akhil_mishra",
      "created_utc": "2026-02-24 06:24:21",
      "score": 3,
      "num_comments": 0,
      "upvote_ratio": 1.0,
      "text": "Most scope creep does not arrive loudly or with formal paperwork attached. It rarely shows up as a clearly defined change request or a neatly scoped new module. More often, it sounds like agreement.\n\nA feature gets mentioned casually during a call. A stakeholder types “that works” in Slack. A product owner nods during a demo and moves on without asking follow-up questions.\n\nThe team feels aligned, so they proceed. Work gets done. Hours are logged. Dependencies shift slightly to accommodate what feels like a minor tweak rather than a real change.\n\nThen something predictable happens.\n\nAn invoice is questioned. A timeline is challenged. A deliverable is reviewed with fresh eyes. Suddenly, no one remembers approving that change. What once felt like a green light now sounds like “we were just discussing options.”\n\nThis is the quiet danger of verbal scope. In delivery environments, memory is unreliable, especially when pressure increases. Conversations blur, context disappears, and what felt obvious at the time becomes debatable when budgets tighten or deadlines slip.\n\n**### If It Isn’t Written, It Doesn’t Exist**\n\nThis is the uncomfortable legal reality most teams only learn after being burned. If scope is not written down, it effectively does not exist.\n\nThat is not because anyone is acting dishonestly. It is because written confirmation is the only stable record when things become tense. When disagreements arise, intentions stop mattering. What matters is what can be pointed to clearly and unambiguously.\n\nI have seen this pattern across IT service providers, SaaS implementation teams, and development agencies. It rarely begins with conflict. It begins with good intentions.\n\nTeams want to be helpful. They want to maintain momentum. They do not want to slow things down with documentation for what feels like a small adjustment.\n\nBut small adjustments accumulate.\n\nA minor integration tweak turns into additional testing cycles. A quick dashboard change requires backend restructuring. A simple vendor coordination call becomes weeks of cross-team troubleshooting.\n\nBecause none of it was formally recorded, all of it gets absorbed quietly into margins.\n\nThat is how profitable projects slowly turn into break-even projects without anyone being able to pinpoint when the shift happened.\n\n**### Clarity Is an Operational Discipline, Not Distrust**\n\nThe lesson here is not about mistrust. It is about operational clarity.\n\nIf work matters, it deserves a written yes. That principle protects both sides. It creates a shared record of what was agreed, when it was agreed, and what that agreement affects.\n\nFor IT teams, this does not require heavy bureaucracy. It requires discipline.\n\nStart by clearly defining what constitutes a scope change in your contract. Do not limit this to major features alone. Additional integrations, vendor coordination, workflow redesigns, extended support, and new reporting requirements should all be explicitly called out.\n\nNext, implement lightweight written confirmations. This does not mean drafting a lengthy amendment for every adjustment. A structured change order template or a clearly documented email summary that requires written approval is often enough. The goal is traceability, not formality.\n\nThen, build dependency rules into your agreements. If new inputs are required, timelines shift automatically. If third-party vendors delay access or responses, deadlines move by design. When this is agreed upfront, it stops becoming a negotiation later.\n\nFinally, train your team to pause before saying “that works.” Alignment in conversation is not the same as contractual approval. Empower project managers to say, “We’ll confirm this in writing and share an updated scope.” That single sentence can protect months of margin.\n\n**### Final Thoughts**\n\nMost scope creep does not look like a big request. It sounds like verbal agreement. When changes are not written down, they are easy to deny later, and delivery teams quietly absorb extra work.\n\nClear written scope and simple confirmation processes protect margins, timelines, and relationships.\n\nOne of the hardest lessons in running an IT practice long-term is realizing that sustainability is rarely destroyed by large mistakes. It is eroded by small, undocumented agreements repeated over time.\n\nGood clients do not resist clarity. In fact, the best ones appreciate it.\n\nClear scope prevents surprise invoices, misaligned expectations, and unnecessary tension. It keeps delivery predictable, professional, and scalable.\n\nBecause in the end, scope creep is not a dramatic event. It is drift. And drift only stops when someone writes things down.[](https://www.reddit.com/submit/?source_id=t3_1rd8os1)",
      "is_original_content": false,
      "link_flair_text": "knowledge",
      "permalink": "https://reddit.com/r/startup/comments/1rd8pbu/scope_creep_is_a_real_problem_why_verbal/",
      "domain": "self.startup",
      "is_self": true,
      "comments": []
    },
    {
      "id": "1re7nhs",
      "title": "The Unglamorous Middle of Building",
      "subreddit": "startup",
      "url": "/r/Entrepreneur/comments/1re7n5z/the_unglamorous_middle_of_building/",
      "author": "Thick_Sorbet_6225",
      "created_utc": "2026-02-25 08:25:06",
      "score": 3,
      "num_comments": 0,
      "upvote_ratio": 1.0,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "investor outreach",
      "permalink": "https://reddit.com/r/startup/comments/1re7nhs/the_unglamorous_middle_of_building/",
      "domain": "",
      "is_self": false,
      "comments": []
    },
    {
      "id": "1rdqd67",
      "title": "I Think Small Teams Feel Hiring Pressure More Than We Admit",
      "subreddit": "startup",
      "url": "/r/ModernHiring/comments/1rdqcpd/i_think_small_teams_feel_hiring_pressure_more/",
      "author": "thecedricpeters",
      "created_utc": "2026-02-24 19:41:27",
      "score": 3,
      "num_comments": 0,
      "upvote_ratio": 1.0,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1rdqd67/i_think_small_teams_feel_hiring_pressure_more/",
      "domain": "",
      "is_self": false,
      "comments": []
    }
  ]
}