{
  "metadata": {
    "last_updated": "2026-01-31 02:49:57",
    "time_filter": "week",
    "subreddit": "Startup_Ideas",
    "total_items": 20,
    "total_comments": 150,
    "file_size_bytes": 131534
  },
  "items": [
    {
      "id": "1qmnduu",
      "title": "How do you get your first customers when you don’t have an audience or a network?",
      "subreddit": "Startup_Ideas",
      "url": "https://www.reddit.com/r/Startup_Ideas/comments/1qmnduu/how_do_you_get_your_first_customers_when_you_dont/",
      "author": "owenreed_",
      "created_utc": "2026-01-25 16:16:41",
      "score": 59,
      "num_comments": 52,
      "upvote_ratio": 1.0,
      "text": "I’m working on a small startup idea and I’m trying to be realistic about the first customers.\n\nI don’t have a big social following. I don’t have a strong “founder network.” And I’m not comfortable spamming DMs or posting everywhere like a billboard. I’m fine doing outreach just not the kind that feels desperate or burns bridges.\n\nFor people who started from basically zero:  \nWhat actually worked to get your first 5–10 customers without an audience?  \nI’m looking for approaches that are practical and repeatable, not “go viral” advice.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Startup_Ideas/comments/1qmnduu/how_do_you_get_your_first_customers_when_you_dont/",
      "domain": "self.Startup_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o1n3k1z",
          "author": "Hudson_109",
          "text": "I remember Starting a Startup by James Sinclair framing early growth as “earning attention” rather than trying to grab it. That stuck with me. The practical takeaway for me was: show proof you understand the customer’s world first, then invite a conversation. It made outreach feel less awkward.",
          "score": 8,
          "created_utc": "2026-01-25 16:23:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1n58or",
              "author": "owenreed_",
              "text": "“earning attention” is a good way to put it. I’ve been avoiding outreach because I don’t want to feel pushy. Framing it as proof-first makes it feel more respectful.",
              "score": 2,
              "created_utc": "2026-01-25 16:31:11",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1nm9z9",
          "author": "MysteriousLab2534",
          "text": "Just a couple that I use;\n\nReddit is a great place for targeting new customers simply because everyone has already self-ordered themselves in to subs with common interests ready-made for you. As long as your sell is tailored towards the users and isn't pushy to the point that people get annoyed with you, there is a lot of opportunity. I've previously also used Reddit ads for my products (which allows you to target specific subs) and i've found this to be useful, though it depends on the product and the amount that you are charging for it eg If you are selling something for $10 the ads might cost more than the revenue.\n\nInstagram is great too and i've personally had loads of success in DMing specific people who my products might be relevent too. As an example my main project is manufacturing wooden jigsaw puzzles. I have my own commercial range, but started manufacturing third party puzzles for small artists who wanted their artwork converting in to puzzle form. I built up a database of over 1000 artists and then dm'd them gradually asking if they'd be interested. As my targeting was very specific the process was amazing and even rejections were still complimentaty and not like bashing your head against a wall.\n\nWithout giving the game away what is your rough idea classification? service, product, website etc",
          "score": 6,
          "created_utc": "2026-01-25 17:44:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1o4nxi",
          "author": "Aggravating-Some",
          "text": "If you’re starting from zero, precision beats reach.\n\nWhat actually works for the first 5–10 customers:\n\n1.Go where people already talk about the problem\nReddit threads, Discords, Indie Hackers, X replies.\nHelp first → talk later → mention your product only if relevant.\n\t\n2.Have 1-on-1 conversations, not “marketing”\nAsk for feedback, not a sale.\nMany first customers say yes before the product is finished.\n\n3.Do it manually first\nDeliver the outcome by hand before building tools.\nIf they won’t pay for scrappy, they won’t pay for polished.\n\n4.Borrow trust\nOne good post in the right niche community > posting everywhere.\n\n5.Offer early-user benefits\nLifetime discount, direct access, feature input.\n\nWhat to avoid early:\nMass DMs, “go viral” content, ads, waiting for perfection.\n\nGoal isn’t hype it’s 10 real conversations. That’s usually enough to get your first customers.",
          "score": 4,
          "created_utc": "2026-01-25 19:00:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1n2f5w",
          "author": "same6534",
          "text": "I started by picking one narrow customer type and one narrow place they hang out. Not “small businesses,” but “accountants with 1–3 staff,” or “wedding photographers who edit at night.” The tighter I got, the easier it was to write messages that didn’t feel like spam.",
          "score": 4,
          "created_utc": "2026-01-25 16:19:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1nc04h",
              "author": "nauman_arshad",
              "text": "How do you actually find those places where they hangout?",
              "score": 3,
              "created_utc": "2026-01-25 17:00:27",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o1n4rit",
              "author": "owenreed_",
              "text": "that specificity is helpful. I’ve been thinking too broad, which probably makes everything sound generic. I’ll pick one exact customer type and commit to it for a month.",
              "score": 1,
              "created_utc": "2026-01-25 16:29:07",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1n3txg",
          "author": "Oliver19234",
          "text": "I’d also test channels with a simple rule: if you can’t do it consistently for 30 days, it’s not a real strategy. A small daily habit (5 targeted messages, 1 helpful comment, 1 mini-case study) beats occasional bursts.",
          "score": 3,
          "created_utc": "2026-01-25 16:25:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1olsm4",
          "author": "Plastic-Edge-1654",
          "text": "Find an audience.  Build a network.",
          "score": 3,
          "created_utc": "2026-01-25 20:15:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ov193",
          "author": "kbk3173",
          "text": "I personally never liked cold outreach, nor did it ever work for me. I just do hundreds for SEO blogs that end up attracting qualified customers.",
          "score": 3,
          "created_utc": "2026-01-25 20:56:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1q5zbe",
              "author": "Lucky_Homework_8740",
              "text": "How long does it need to see first results? Which tool do you use to write content ? chat GPtonly? How do you know which keywords to target if you and not sure of the right keywords yet",
              "score": 1,
              "created_utc": "2026-01-26 00:29:08",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1q6ma2",
                  "author": "kbk3173",
                  "text": "If you only focus on high intent queries from your customers you should see results within 2-3 weeks nowadays. \n\nI use ChatGPT but I prompt it for the brand voice, tone etc and I also ask it to insert valid internal links and sometimes relevant external link. Another thing I do is include E-E-A-T, a FAQ and a FAQ schema for indexing on Google. \n\nI advise having at least 1000 pages where you cover every possible queries your clients might have. Worse case scenario you’ll have a working blog and paid advertising requests from companies wanting to be featured.",
                  "score": 1,
                  "created_utc": "2026-01-26 00:32:14",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1o6p6f",
          "author": "manlikeroot",
          "text": "One way to get your first customers or clients is through friends and family. You might need to handhold them, but your first 3-5 customers are people who know you. Strangers are not happy to spend money with those they don't know. So if you are new or have a SaaS product, look for friends and family your product might help and try to convert them.",
          "score": 2,
          "created_utc": "2026-01-25 19:08:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1p5eq4",
          "author": "poetatoe_",
          "text": "What most people miss are the basics or the foundation of the company. In modern day you need to be visible online that means social media accounts, searchable on google etc. \n\nYou also research if your customers congregate at a location or topic. We are planning to gather our customers and eventually produce future customers 😀 \n\nIf I were you do these:\n\n-social media (post weekly)\n-website\n-google business account\n-seo",
          "score": 2,
          "created_utc": "2026-01-25 21:40:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1n64j7",
          "author": "Wide_Brief3025",
          "text": "Targeting niche conversations where your solution is directly relevant can really help when you have no audience. I found hanging out in forums or comment threads where people already talk about the exact problem I solve got me my first users. If you want to scale that, a tool like ParseStream can alert you to those threads as they happen so you can join in early and naturally.",
          "score": 1,
          "created_utc": "2026-01-25 16:35:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1pcu00",
          "author": "Seef123",
          "text": "Is your idea B2C?",
          "score": 1,
          "created_utc": "2026-01-25 22:13:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1qfgyk",
          "author": "MethuselahsCoffee",
          "text": "Use build in public principles. Use IG’s algo’s to your advantage: ie high quality reels that will show up in the discovery feeds of people interested in what you’re building. \n\nX FWIW is still good place to build an audience. Follow similar builders, share what you’re building, comment and rely on similar posts.",
          "score": 1,
          "created_utc": "2026-01-26 01:16:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1qfx1s",
          "author": "Electronic-Cat185",
          "text": "starting from zero usually works when you stop trying to broadcast and start helping in smalll specific places. answeriing questions in niche forums or communities where the problem already exists can lead to quiet conversations that turn into first users. another path is doing things manuallly for a few people before you productize it so the value is obviious. the first customers often come from trust built one interaction at a time not from reach or audience size",
          "score": 1,
          "created_utc": "2026-01-26 01:18:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1rsfff",
          "author": "the_king_of_goats",
          "text": "you do some kind of marketing",
          "score": 1,
          "created_utc": "2026-01-26 06:00:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ru169",
          "author": "dan_charles99",
          "text": "In the days before social media and the internet. Founders would do this thing called \"selling\" They would literally walk the streets, and sit in rooms using a telephone. They would speak to decision makes. Solving their problems, and offering solutions. The economy would boom, businesses would grow, and people would make money. \n\nAn audience is the last thing a business needs. What a business needs is customers, and without customers. It is not a business, it is just more noise.",
          "score": 1,
          "created_utc": "2026-01-26 06:13:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1snyb7",
          "author": "Ash_Skiller",
          "text": "cold email actually works pretty well for getting those first customers if you do it right. The key is making it personal and targeted, not blasting thousands of generic messages. If you want someone else to handle it though, I've heard good things about sales dot co (https ://sales .co) for managed B2B outreach.\n\nThey supposedly do the personalized cold email stuff so it doesn't come across as spammy or desparate.",
          "score": 1,
          "created_utc": "2026-01-26 10:32:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1u2d5x",
          "author": "StillLoadingit",
          "text": "When you don’t have an audience yet, the fastest way to get your first customers is to go where they already hang out and start real conversations about their pain points. Helping them solve a small part of the problem first and asking for feedback or early signups makes it way easier to convert into your first users.",
          "score": 1,
          "created_utc": "2026-01-26 15:39:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o28q3nb",
          "author": "OkMetal220",
          "text": "Clients don’t come from a single magic source, they come from clarity plus exposure.\n\nFirst, get very clear on what you actually sell. Not “web development”, but who you help and what problem you fix. Your site or portfolio should explain that in seconds, with a few real examples.\n\nThen you need distribution. Tell people you already know, show up in communities, answer questions, share your perspective. You don’t need to sell hard, just be visible and useful. Over time, people start associating you with a specific solution.\n\nThat’s usually how agencies get their first steady flow of clients: clear positioning, a simple portfolio, and consistent presence... good luck!",
          "score": 1,
          "created_utc": "2026-01-28 16:41:59",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qp57cw",
      "title": "What Startup idea are you building? 🚀",
      "subreddit": "Startup_Ideas",
      "url": "https://www.reddit.com/r/Startup_Ideas/comments/1qp57cw/what_startup_idea_are_you_building/",
      "author": "Quirky-Offer9598",
      "created_utc": "2026-01-28 07:53:22",
      "score": 58,
      "num_comments": 157,
      "upvote_ratio": 0.95,
      "text": "Let's help support each other and increase visibility this this week.\n\nI'm building - [www.techtrendin.com](http://www.techtrendin.com/) \\- to help founders launch and grow their tech startup (with 27+ on the launchpad this week).\n\nWhat are you building and marketing?\n\n**Drop the link and a one liner** so people can learn more about your startup.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Startup_Ideas/comments/1qp57cw/what_startup_idea_are_you_building/",
      "domain": "self.Startup_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o26ma7r",
          "author": "Strict_Shoe_6427",
          "text": "I’m building a recipe app that works for what I needed and couldn’t find. I wanted a place where my gf and I could share recipes, add to it, import, and it’s grown from there. Still working on it, but adding in fun features like cost of a meal and a wine pairing feature. \n\nhttps://rock.recipes",
          "score": 11,
          "created_utc": "2026-01-28 08:59:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o26wrek",
          "author": "o_Oleh",
          "text": "I'm building [shaflex.com](http://shaflex.com/) \\- a simple, flow-first app for cross-platform social media publishing.   \nNo cluttered dashboards, just publish.",
          "score": 3,
          "created_utc": "2026-01-28 10:35:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2bqb4k",
              "author": "itsme-anon",
              "text": "Get feedback instantly on www.ghosttestingai.com :)\n\nGot a few free testing spots available left still so feel free :)",
              "score": 1,
              "created_utc": "2026-01-29 00:57:10",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2burh2",
                  "author": "kiwiinNY",
                  "text": "Oh lord. Quit it.",
                  "score": 1,
                  "created_utc": "2026-01-29 01:21:41",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o26i41j",
          "author": "achilltrainer",
          "text": "I'm starting to grow [https://trainermatch.app](https://trainermatch.app), a platform to connect people with their ideal personal trainer.",
          "score": 2,
          "created_utc": "2026-01-28 08:21:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o26izon",
              "author": "Quirky-Offer9598",
              "text": "Cool idea. Do the trainers need to go through a verification process to ensure they're legitimate?",
              "score": 2,
              "created_utc": "2026-01-28 08:29:39",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o26nixz",
                  "author": "achilltrainer",
                  "text": "Thank you! That's a good question, and not something I've totally \"solved\" yet. The reason for that is, at least in the US, personal training isn't quite so regulated as a profession. There's not an equivalent to the bar exam you'd have to pass to practice law, for example. So what makes a trainer \"legitimate?\" Having any certification? Having an accredited certification? A degree in sports science? And any trainer with years of experience would tell you that the certification you have has little bearing on how good of a coach you'll actually be.\n\nI want the platform to be as truthful as I can make it, and I haven't yet come up with a way, with the tech stack I have, that would actually verify \"legitimacy\" in a way that's meaningful to a user. I've seen some similar websites that have a \"verified\" or \"background checked\" badge on profiles, but with what I know about the training industry, those don't really mean much to me, and may just be paid features to stand out more. For now, I just have trainers enter what certifications they have during onboarding.\n\nIf you have any ideas on how to approach that, feel free to DM me! I'm building this solo, so it's nice to have a fresh set of yes on it.",
                  "score": 4,
                  "created_utc": "2026-01-28 09:11:35",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o2pm7ks",
                  "author": "John-FitnessRefined",
                  "text": "Curious to see how this develops.",
                  "score": 1,
                  "created_utc": "2026-01-31 01:07:44",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o2794wf",
              "author": "Womanhustler",
              "text": "Might wanna look into fittr- and borrow from how they grew.  Very outcome driven model, and technically a marketplace of validated trainers who run against a specific regimen / type of training",
              "score": 2,
              "created_utc": "2026-01-28 12:13:42",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o26joal",
          "author": "amacg",
          "text": "Built a community where makers can share what they’re building and get fair visibility. Here's the link: [https://trylaunch.ai](https://trylaunch.ai/)",
          "score": 2,
          "created_utc": "2026-01-28 08:36:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o26o4sg",
          "author": "greyzor7",
          "text": "Building an all-in-one pack for founders who want more than \"just another launch\"\n\nLaunch, reach 30k+ makers, get users & customers - [microlaunch.net/premium](http://microlaunch.net/premium)\n\nLifetime, auto-distribution, marketplace spots, 700+ customers so far.",
          "score": 2,
          "created_utc": "2026-01-28 09:17:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o27xoie",
          "author": "ishibam97",
          "text": "Currently building [RazorBooking.com](http://razorbooking.com/) . It helps service businesses manage appointments, teams, customers, availability, and automated reminders from a single dashboard. The product is live and open to explore.",
          "score": 2,
          "created_utc": "2026-01-28 14:33:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2lhcx4",
              "author": "GlitteringPoetry5696",
              "text": "Could i ask how you built your page? Did you code it or did you use a no-code site to do it?",
              "score": 1,
              "created_utc": "2026-01-30 13:08:39",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o26rnc8",
          "author": "thijsgh",
          "text": "Create content, post everywhere: [socialrails.com](http://socialrails.com)",
          "score": 2,
          "created_utc": "2026-01-28 09:50:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2mityt",
              "author": "trycoconutoil",
              "text": "This looks pretty damn cool. Gaining customers though?\nEdit:\nCould likely scale good for some customers needing to post on more than one account too. Like a website that has 10 accounts for 10 languages. Translate with a.i. 1 = 80 posts.",
              "score": 1,
              "created_utc": "2026-01-30 16:12:59",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o26xd8x",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 2,
          "created_utc": "2026-01-28 10:41:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o279mqv",
              "author": "Womanhustler",
              "text": "This is interesting. Have you picked any funding yet?",
              "score": 1,
              "created_utc": "2026-01-28 12:17:10",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o27h9ph",
                  "author": "medusa-K",
                  "text": "Haven't worked for any funding yet",
                  "score": 1,
                  "created_utc": "2026-01-28 13:06:27",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o28cjs4",
              "author": "Quirky-Offer9598",
              "text": "I came across a similar product a few months ago. You should definitely launch MeetRep in the product demo category on [https://www.techtrendin.com/](https://www.techtrendin.com/) to increase exposure and drive engagement for it.",
              "score": 1,
              "created_utc": "2026-01-28 15:43:28",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2dpatu",
                  "author": "medusa-K",
                  "text": "Thanks, I'll check",
                  "score": 1,
                  "created_utc": "2026-01-29 09:02:47",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o28og35",
              "author": "SwervoGotThatFye",
              "text": "Solid idea",
              "score": 1,
              "created_utc": "2026-01-28 16:34:52",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o26ltrv",
          "author": "Asanare",
          "text": "I'm building a platform for effortless, beautiful presentations. We're trying to compete with some of the big names because we believe our product can deliver superior results already and there's a lot more to come. I would love to get some real feedback from people and work with you: visualise.ink",
          "score": 1,
          "created_utc": "2026-01-28 08:55:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o26mrra",
              "author": "Quirky-Offer9598",
              "text": "Looks great! Big names like Prezi and Gamma?\n\nIs the pricing page currency dynamic to where you're viewing it from?",
              "score": 1,
              "created_utc": "2026-01-28 09:04:29",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o26mz93",
                  "author": "Asanare",
                  "text": "Yea exactly, gamma, beautiful.ai are the main 2. There's a bunch of others but Prezi almost falls outside. \n\nNo, the pricing page is not localised. Did you notice something weird?",
                  "score": 1,
                  "created_utc": "2026-01-28 09:06:26",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o26six6",
          "author": "MORPHOICES",
          "text": "I am building a high-end AI tech system for solopreneurs & creators who want to create a structured digital product business with their knowledge without aimless guessing and runtime duct-taping of tools & burning-out.\n\nIt is a comprehensive framework for prompt and workflow design, automation, launch, and all plug-and-play.\n\nAs it’s still in beta, we’re validating with early builders who want leverage, not hustle. \\~",
          "score": 1,
          "created_utc": "2026-01-28 09:57:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o26tvz4",
          "author": "Glass_Tap_4494",
          "text": "Im this week trying to finish my SaaS: [https://chargeslot.app/](https://chargeslot.app/)\n\nChargeSlot organizes workplace EV charging: reserve time slots, see availability, get notifications – simple, fair and mobile-friendly.",
          "score": 1,
          "created_utc": "2026-01-28 10:10:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2bbgmp",
              "author": "theManOfManyTalents",
              "text": "This looks good. It would really make things easier for people who charge their EVs at the workplace",
              "score": 3,
              "created_utc": "2026-01-28 23:39:47",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o278y09",
              "author": "Quirky-Offer9598",
              "text": "Great product! I can see this being a real problem. You should definitely launch ChargeSlot on https://www.techtrendin.com/ to increase exposure and drive engagement for it.",
              "score": 1,
              "created_utc": "2026-01-28 12:12:23",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o2bbbp9",
              "author": "theManOfManyTalents",
              "text": "This looks good. It would really make things easier for people who charge their EVs at workplaces",
              "score": 1,
              "created_utc": "2026-01-28 23:39:04",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o26y8v0",
          "author": "Fresh-Manager7329",
          "text": "[Huddlekit](http://huddlekit.com/) – Collect feedback, review, and annotate websites and creative assets",
          "score": 1,
          "created_utc": "2026-01-28 10:48:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o271418",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-28 11:12:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2791h9",
              "author": "Quirky-Offer9598",
              "text": "Looks so much better with the screenshot now. Nice job!",
              "score": 1,
              "created_utc": "2026-01-28 12:13:03",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o27cuf6",
          "author": "Master_Armadillo7872",
          "text": "Been working on Taskosaur - an open source project management tool that lets you manage tasks through natural language commands instead of clicking through a million menus.\n\nSelf-hosted so no subscription costs, which is nice when you're bootstrapping.\n\nWhat's been your biggest challenge getting visibility for techtrendin so far?",
          "score": 1,
          "created_utc": "2026-01-28 12:38:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o27he62",
          "author": "svlease0h1",
          "text": "building something forces clarity fast. if you can’t explain it in one plain line, marketing stays hard. pick one channel and show progress every week. visibility compounds more than polish.",
          "score": 1,
          "created_utc": "2026-01-28 13:07:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o27rb36",
          "author": "DarthStan",
          "text": "Meet my biomarketshop.com",
          "score": 1,
          "created_utc": "2026-01-28 14:01:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o28nwwm",
          "author": "Ok-Series-4597",
          "text": "learning marketing sucks, we're fixing it - [arkirehq.com](http://arkirehq.com)",
          "score": 1,
          "created_utc": "2026-01-28 16:32:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o28szoy",
          "author": "PecanSandies44",
          "text": "https://morestore.ai - platform to create no code buyer and seller agents that will communicate and prequalify potential deals.",
          "score": 1,
          "created_utc": "2026-01-28 16:54:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2e0gli",
              "author": "Quirky-Offer9598",
              "text": "Solid tool! You should definitely launch MoreStore in one of the sales categories or AI Agents category (or similar) on [www.techtrendin.com](https://www.techtrendin.com/) to increase exposure and drive engagement for it.",
              "score": 2,
              "created_utc": "2026-01-29 10:45:02",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o29jitk",
          "author": "saintcitrus_",
          "text": "I’m building Finnito, a e-commerce operations intelligence system designed to distinguish the daily fires that sellers are experiencing. \n\nCheck it out here: [FINNITO](https://finnito.tech)",
          "score": 1,
          "created_utc": "2026-01-28 18:48:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2a376h",
          "author": "Extra_Window3537",
          "text": "Retain more clients by catching issues earlier: [www.getgravia.com](http://www.getgravia.com)",
          "score": 1,
          "created_utc": "2026-01-28 20:16:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2e0yii",
              "author": "Quirky-Offer9598",
              "text": "Nice product! You should launch GetGravia in one of the marketing categories on [www.techtrendin.com](https://www.techtrendin.com/) to increase visibility and drive engagement for it.",
              "score": 1,
              "created_utc": "2026-01-29 10:49:21",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2b41o4",
          "author": "Teatimeallthetime1",
          "text": "Ai powered kids birthday party planning app to take the mental load off for moms. Partygenie.fun",
          "score": 1,
          "created_utc": "2026-01-28 23:01:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2bagyq",
          "author": "theManOfManyTalents",
          "text": "I’m building Snapcart, an AI powered tool that will give you shopping links for all the products in a picture. \n\nhttps://usesnapcart.lovable.app/",
          "score": 1,
          "created_utc": "2026-01-28 23:34:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2bkomo",
          "author": "DaBay41510",
          "text": "Check out SplitSheet.net\n\nEasy and free way to create royalty splits for music industry",
          "score": 1,
          "created_utc": "2026-01-29 00:27:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2gt2rd",
              "author": "Quirky-Offer9598",
              "text": "This is really cool. You should definitely launch SplitSheet in the music category on [https://www.techtrendin.com/](https://www.techtrendin.com/) to increase exposure and drive engagement for it.",
              "score": 1,
              "created_utc": "2026-01-29 19:28:41",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2bpre0",
          "author": "HBTechnologies",
          "text": "aiME Ondevice AI - complete privacy - your data stays on your device and no one will ever know what you ask AI - https://apps.apple.com/us/app/aime-ondevice-ai/id6754805828",
          "score": 1,
          "created_utc": "2026-01-29 00:54:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2bv5ui",
          "author": "saravanasai1412",
          "text": "Am building a web-hook replay engine. It’s complete tech b2b product.",
          "score": 1,
          "created_utc": "2026-01-29 01:23:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2bwoy1",
          "author": "W0und3d777",
          "text": "I'm building a niche electronic research Admin insights tool. Just upload your data and the app will ID the data (Grants, IRB/Compliance, etc) build graphs and identify trends, bottlenecks, and provides narratives.\n\nAbout to ask for industry reviews and feedback!",
          "score": 1,
          "created_utc": "2026-01-29 01:32:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2c7sew",
          "author": "wyndhamf",
          "text": "DataNerds.com - AI search analytics",
          "score": 1,
          "created_utc": "2026-01-29 02:33:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2e2550",
              "author": "Quirky-Offer9598",
              "text": "Great name (and domain)!. You should definitely launch DataNerds in the AI Search category on [www.techtrendin.com](https://www.techtrendin.com/) to increase visibility and drive engagement for it. Plus, you'll sit at the top of your category.",
              "score": 1,
              "created_utc": "2026-01-29 10:59:25",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2ez2as",
          "author": "AbaloneUnlikely6565",
          "text": "Playlist builder that creates a playlist and adds it to Spotify for upcoming concerts. [TracklistIQ](https://tracklistiq.com)",
          "score": 1,
          "created_utc": "2026-01-29 14:28:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2f52gl",
          "author": "throwaway_skye11",
          "text": "Building an app to help people learn to code \nwww.Dontvibecode.com",
          "score": 1,
          "created_utc": "2026-01-29 14:57:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2gtkis",
              "author": "Quirky-Offer9598",
              "text": "Upon loading it went to Render...",
              "score": 1,
              "created_utc": "2026-01-29 19:31:02",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2gan63",
          "author": "Live-Lab3271",
          "text": "[InfraSketch's](https://www.infrasketch.net/) AI agent turns your ideas into architecture diagrams. Chat to iterate, ask questions, and refine. Then export a design doc and start building.",
          "score": 1,
          "created_utc": "2026-01-29 18:04:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2gioo2",
          "author": "missEves",
          "text": "[playmix](https://playmix.ai/animate) \\- create animated game sprites w/ ai 🏃‍♀️",
          "score": 1,
          "created_utc": "2026-01-29 18:40:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2jslx7",
          "author": "strzibny",
          "text": "[MyCountryList.com](http://MyCountryList.com) \\- build a list of visited countries",
          "score": 1,
          "created_utc": "2026-01-30 05:00:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2k59tb",
          "author": "Apart_Kangaroo_3949",
          "text": "Building Mindora and solving a $9.6T global issue around performance and productivity.\n\n[www.mindora.work](https://www.mindora.work)",
          "score": 1,
          "created_utc": "2026-01-30 06:35:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2kjpye",
          "author": "leksofmi",
          "text": "most saas pricing page suck. pricescore.io make it suck less and you can also get a read on your competitors pricing as well",
          "score": 1,
          "created_utc": "2026-01-30 08:40:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2lej3v",
          "author": "t1llmann",
          "text": "I‘m building Lumenfall - similar to OpenRouter but with a focus on ai media generation and free (no markup). Started recently with Image models; video and more coming soon.\n\nhttps://lumenfall.ai if you want to give it a try. Currently giving 1$ credit to every new account",
          "score": 1,
          "created_utc": "2026-01-30 12:51:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2nnbuf",
              "author": "Quirky-Offer9598",
              "text": "Clean site. You should definitely launch Lumenfall in the AI Content or Developer tools category on [https://www.techtrendin.com/](https://www.techtrendin.com/) to increase exposure and drive engagement for it.",
              "score": 1,
              "created_utc": "2026-01-30 19:11:55",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2oe3hu",
                  "author": "t1llmann",
                  "text": "thank you! sounds like a great idea, will do",
                  "score": 1,
                  "created_utc": "2026-01-30 21:17:12",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2m0d0b",
          "author": "GeorgeHadjisavvas",
          "text": "Building a tool that mines real user frustrations from Reddit and turns them into clean, builder-ready problem statements. Basically: fewer “idea brainstorming” sessions, more actual pain points.  \n\nLink :[ Problem Miner](https://problem-miner-landing.vercel.app/feed)",
          "score": 1,
          "created_utc": "2026-01-30 14:48:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2mh9ye",
          "author": "jxywilliams",
          "text": "[Nebly](https://nebly.app) - Turn 1 video into personlized, ready-to-go social posts, in 60 seconds.",
          "score": 1,
          "created_utc": "2026-01-30 16:05:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2ni36i",
              "author": "Quirky-Offer9598",
              "text": "Really nice. You should definitely launch Nebly in the social media category or similar on [www.techtrendin.com](https://www.techtrendin.com/) to boost visibility and drive engagement for it.",
              "score": 1,
              "created_utc": "2026-01-30 18:48:46",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2numx7",
          "author": "Sea-Culture-8351",
          "text": "At [tekkzy.com](https://tekkzy.com), we build fast, custom websites, POS systems, and mobile apps for small businesses who need software but don’t know where to get it, mainly in Tier 2 and Tier 3 cities.",
          "score": 1,
          "created_utc": "2026-01-30 19:45:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2olxnp",
          "author": "mandatario01",
          "text": "[File sharing service with no registration required. - Anonymous ](https://shareallfiles.net/)\\- [https://shareallfiles.net/](https://shareallfiles.net/)\n\n[Anonfiles and nippyfile alternative](https://shareallfiles.net/)\n\n[Zip files online](https://shareallfiles.net/zip) \\- [https://shareallfiles.net/zip](https://shareallfiles.net/zip)\n\n[Unzip files online](https://shareallfiles.net/unzip) \\- [https://shareallfiles.net/unzip](https://shareallfiles.net/unzip)\n\n[Share files between devices on the same network](https://shareallfiles.net/drop) \\- [https://shareallfiles.net/drop](https://shareallfiles.net/drop)",
          "score": 1,
          "created_utc": "2026-01-30 21:54:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2pkj41",
          "author": "John-FitnessRefined",
          "text": "AI Fitness app that provides personalized workouts which you can do anywhere. [Fitnessrefined.com](https://fitnessrefined.com)",
          "score": 1,
          "created_utc": "2026-01-31 00:58:02",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qo0yol",
      "title": "Looking to sponsor/invest in an MVP-ready startup (0→1 stage)",
      "subreddit": "Startup_Ideas",
      "url": "https://www.reddit.com/r/Startup_Ideas/comments/1qo0yol/looking_to_sponsorinvest_in_an_mvpready_startup/",
      "author": "ronnooi",
      "created_utc": "2026-01-27 02:21:40",
      "score": 38,
      "num_comments": 34,
      "upvote_ratio": 0.95,
      "text": "Hey founders 👋\n\nI’m looking to sponsor / invest (call it what you like) in an MVP-ready product that’s stuck in the 0→1 phase.\n\nI know how hard it is to get momentum early on — building, validating, shipping, and then hitting a wall due to lack of cash or support. I want to help founders with good ideas get unstuck and moving forward.\n\nTo be upfront:  \n💰 The amount is **USD $3,000**.  \nI know it’s not a lot — and if that feels too small for you, totally okay. This post is specifically for founders who could genuinely use a small boost to get things going (cover infra, polish MVP, launch, test, etc.).\n\nI’m not just looking to provide money — I’m also happy to contribute ideas, feedback, and support where relevant.\n\n# What I’m looking for\n\n* MVP already built (or very close)\n* Clear problem being solved\n* Thoughtful founder(s)\n* Any industry is fine\n\n# How to pitch me (keep it simple)\n\nPlease reply or DM with:\n\n1. **Your name**\n2. **Country**\n3. **What your product does (MVP link if available)**\n4. **The problem you’re trying to solve**\n5. **What you’d use the $3,000 for**\n\nI’ll review all submissions and select one project that resonates with me to sponsor/invest in.\n\nHopefully this small step can turn into something great 🚀\n\nLooking forward to seeing what you’re building.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Startup_Ideas/comments/1qo0yol/looking_to_sponsorinvest_in_an_mvpready_startup/",
      "domain": "self.Startup_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o1zwhnj",
          "author": "inceptionkiller",
          "text": "I can let you invest 3k in my product but what value would you bring to the table beside the money? Any past expertise or skills that might be actually valuable?",
          "score": 3,
          "created_utc": "2026-01-27 11:16:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o20teta",
              "author": "smoke4sanity",
              "text": "At $3K, the value is the money lol...Tbf, These are the kind of amounts you take from friends and family though.",
              "score": 1,
              "created_utc": "2026-01-27 14:37:49",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1y59sv",
          "author": "MySuccessAcademia",
          "text": "For $3k you can have 1 share sir :)",
          "score": 4,
          "created_utc": "2026-01-27 03:04:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1y6xis",
              "author": "ronnooi",
              "text": "It doesn't matter, I can have zero share :)",
              "score": -3,
              "created_utc": "2026-01-27 03:13:34",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1y77cb",
                  "author": "MySuccessAcademia",
                  "text": "Is this another one of those scams where you promise $3000 but its actually a service you provide worth $3000 and just looking for leads? 🤣",
                  "score": 6,
                  "created_utc": "2026-01-27 03:15:06",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o26v3n2",
          "author": "MORPHOICES",
          "text": "I’ve been on the other side of this—stuck right at 0→1 with something that worked, but not enough runway to really push it into the world. \\~\n\nWhat surprised me back then was how much leverage a *small* amount of money plus a bit of attention can have at that stage. It wasn’t about scaling at all. It was about clearing one specific blocker so momentum could restart—hosting, some design polish, or just buying time to talk to users without stressing over every expense.\n\nThe early mistake I made was assuming bigger checks were the answer. They weren’t. What actually mattered was clarity: knowing exactly what the next 30–60 days were supposed to prove. Without that, even $3k can disappear quietly.\n\nOne thing I’d encourage founders replying to you to do—mostly for their own sake—is to be very concrete about the decision this money unlocks. Not “we’ll launch faster,” but “by X date, we’ll know whether this is worth continuing.”\n\nAlso, respect for being upfront about the amount. That alone filters for people who are actually at the right stage.\n\nOut of curiosity—when you’ve seen early projects stall, is it usually a lack of capital, or a lack of focus on what to test next?",
          "score": 2,
          "created_utc": "2026-01-28 10:21:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o29nigq",
              "author": "CucumberBig5537",
              "text": "This was a great comment. I’m currently stuck in the 0 -> 1 right now and honestly it’s cause of funding. You can only mock features so much until you need to pay for API’s and all that. At least this is my experience. I’m able to build and iterate with free versions of most the tools I’m using but to launch would require some additional funding to protect the brand and legitimize things as well as invest in some tooling and additional funds for backend costs etc.",
              "score": 1,
              "created_utc": "2026-01-28 19:05:55",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1ycdti",
          "author": "[deleted]",
          "text": "[deleted]",
          "score": 1,
          "created_utc": "2026-01-27 03:45:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1ywv3b",
              "author": "ronnooi",
              "text": "I think you didnt read the post correctly.",
              "score": 2,
              "created_utc": "2026-01-27 06:02:59",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o205uzw",
                  "author": "brunobertapeli",
                  "text": "I did.",
                  "score": 1,
                  "created_utc": "2026-01-27 12:26:43",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1z3yag",
          "author": "New_Rutabaga4828",
          "text": "check dm",
          "score": 1,
          "created_utc": "2026-01-27 07:00:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o20pvgq",
          "author": "manvayndra",
          "text": "Pls kindly check your dm🤧",
          "score": 1,
          "created_utc": "2026-01-27 14:20:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o22x3xy",
          "author": "EmotionalDeal1056",
          "text": "Kindly check DM",
          "score": 1,
          "created_utc": "2026-01-27 20:10:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o29mx0b",
          "author": "CucumberBig5537",
          "text": "DM’d ya. I’m building [Fleats](https://www.fleatsdelivery.com). A tool for delivery drivers and gig workers alike :)",
          "score": 1,
          "created_utc": "2026-01-28 19:03:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2fqoda",
              "author": "TrueSatisfaction4891",
              "text": "Ok this looks interesting, can u dm me too please?",
              "score": 2,
              "created_utc": "2026-01-29 16:35:14",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2g3ni7",
                  "author": "CucumberBig5537",
                  "text": "Just dm'd you :D",
                  "score": 1,
                  "created_utc": "2026-01-29 17:33:29",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2bbmt3",
          "author": "theManOfManyTalents",
          "text": "I’m building Snapcart, an AI powered tool that will give you shopping links for all the products in a picture. \n\nhttps://usesnapcart.lovable.app/",
          "score": 1,
          "created_utc": "2026-01-28 23:40:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2fss28",
          "author": "Successful_Smell_589",
          "text": "Hey i want $300 for my fitness app from india",
          "score": 1,
          "created_utc": "2026-01-29 16:44:37",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qlbxn9",
      "title": "My startup finally paid me… $200. Mom still not impressed.",
      "subreddit": "Startup_Ideas",
      "url": "https://www.reddit.com/r/Startup_Ideas/comments/1qlbxn9/my_startup_finally_paid_me_200_mom_still_not/",
      "author": "Mammoth-Shower-5137",
      "created_utc": "2026-01-24 03:24:42",
      "score": 30,
      "num_comments": 17,
      "upvote_ratio": 0.89,
      "text": "After months of building, breaking, fixing, breaking again - [Rixly ](https://www.userixly.com/)got its first $200 sale.  \nIt helps founders find warm leads on Reddit instead of begging strangers on LinkedIn.  \nI told my family. They said “ok but what about job??”  \nBut this $200 feels like proof I’m not fully crazy.  \nSmall win. Big smile.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Startup_Ideas/comments/1qlbxn9/my_startup_finally_paid_me_200_mom_still_not/",
      "domain": "self.Startup_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o1d4qmi",
          "author": "CucumberBig5537",
          "text": "its a signal, not proof. just keep working. people around you will always need to see more evidence than you. do your best to not force progress.",
          "score": 5,
          "created_utc": "2026-01-24 03:29:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1d8a3q",
              "author": "Mammoth-Shower-5137",
              "text": "Totally, mate, I'll keep working on it to reach new heights.",
              "score": 3,
              "created_utc": "2026-01-24 03:50:50",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1e53lw",
          "author": "calmdowngol",
          "text": "Hero page is broken mobile",
          "score": 2,
          "created_utc": "2026-01-24 08:03:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1kxrro",
          "author": "catwithbillstopay",
          "text": "Features page not working",
          "score": 2,
          "created_utc": "2026-01-25 07:37:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1lvtns",
              "author": "Mammoth-Shower-5137",
              "text": "bro can you share the screenshot ???",
              "score": 1,
              "created_utc": "2026-01-25 12:30:49",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1lkuct",
          "author": "kubrador",
          "text": "your mom's still waiting for you to monetize your mom jokes on linkedin apparently",
          "score": 1,
          "created_utc": "2026-01-25 11:00:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1thbcq",
          "author": "2reform",
          "text": "AI advertisement or just regular?",
          "score": 1,
          "created_utc": "2026-01-26 13:57:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o27do6a",
          "author": "Yellow-Minion-0",
          "text": "Congrats",
          "score": 1,
          "created_utc": "2026-01-28 12:44:17",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qpf3l1",
      "title": "Fintech startup idea: I'm looking for a time tracking tool that doesn't exist (I currently pay $1200 per month as 1 client)",
      "subreddit": "Startup_Ideas",
      "url": "https://www.reddit.com/r/Startup_Ideas/comments/1qpf3l1/fintech_startup_idea_im_looking_for_a_time/",
      "author": "Successful-Camel165",
      "created_utc": "2026-01-28 15:53:49",
      "score": 27,
      "num_comments": 31,
      "upvote_ratio": 0.86,
      "text": "I work for a Fortune 500. I have a series of contractors in different countries. I pay them hourly by credit card. Some send me weekly PayPal invoices, some bill through Upwork. \n\nI've looked at more than a dozen tools to bring them together, and tested some like HubStaff and Time Doctor but they all focus on a different set of problems.\n\nMy goal is simple and unified automatic time tracking with payments. Contractor hits \"play\" on a desktop application and it starts recording time. They hit pause when they are done. At the end of the week, it automatically sends them money from my credit card.\n\nI don't want to approve time sheets or anything. Hubstaff/TimeDoctor are mainly for that, time tracking and approvals. My contractors have been working for me for years, I dont need to approve anything. I don't micromanage unless there's issues and there's never issues.\n\nUpwork offers this, but it's not their core product and it charges me 5% and my contractors 10%.\n\nRun the math on $8k a month and it's like $400 for me, but more importantly $800 for my contractors, so I pay them an extra $1200 per month just to compensate for fees. HubStaff fees are like $12 a seat, so I'm kind of interested in a solution that is in between. Any dollar under $1200 is a dollar saved and worth switching.\n\nUpwork is primarily for finding talent. I actually already have the talent. So I end up bringing my own contractors there and paying the high fees, as if they found them for me. \n\nI don't want two tools to track and pay. I don't want to lift a finger. That's the benefit of Upwork. I set it up and it's done, I never have to do anything and I can focus on real work.\n\nThrowing this out there for anyone looking for a startup idea. ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Startup_Ideas/comments/1qpf3l1/fintech_startup_idea_im_looking_for_a_time/",
      "domain": "self.Startup_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o2a7n7n",
          "author": "Chupacabra1987",
          "text": "I read a post like this yesterday, clear as hell self promotion",
          "score": 4,
          "created_utc": "2026-01-28 20:35:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2m0tep",
              "author": "Straight-Gazelle-597",
              "text": "so obvious...",
              "score": 1,
              "created_utc": "2026-01-30 14:50:13",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o29ppbt",
          "author": "Turbulent_Echo_7333",
          "text": "I think you are looking for something like this - https://tracktimepay.com/\niOS app: https://apps.apple.com/app/id6752847740\n\nI built it for this exact usecase with simple start/stop to track the hours/time spent. I haven’t integrated payments yet, but I can integrate with stripe payments. I’ll DM you",
          "score": 3,
          "created_utc": "2026-01-28 19:15:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o29i8gj",
          "author": "Keep_Askin",
          "text": "Check out EOR services.  \nThere's a billion dollar industry that does this. go for their contractor mgmt options.\n\nIt should all be there, and contractor mgmt services should stay well clear of $1200.",
          "score": 1,
          "created_utc": "2026-01-28 18:43:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2a6f45",
          "author": "BeneficialResult7469",
          "text": "Deel.com ?",
          "score": 1,
          "created_utc": "2026-01-28 20:30:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2aecrj",
          "author": "MemeLibraryApp",
          "text": "toggl seems like it would work?",
          "score": 1,
          "created_utc": "2026-01-28 21:05:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ahoi2",
          "author": "Spared-No-Expense",
          "text": "as a contractor sometimes, I would hate this and resent a client for forcing it upon me.  \n  \njudge me on my quality, timeliness, and cost. do you like the result? did you get it on time? do you think its a fair cost for the value delivered? if yes, then what's the problem?\n\nloss of privacy — one of the main benefits of being a solo operator",
          "score": 1,
          "created_utc": "2026-01-28 21:19:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2bem5b",
          "author": "the_c0der",
          "text": "So if I curate the idea there are two parts.\n\n1. Time Tracking and Logging \n2. Payments\n\nSo for Time Tracking it'll be based on Minutes but a nice feature to have an executive summary of what's the activity being done like browser history/window activity/idle etc just in case performance needs to be audited.\n\nThen for Payments which is a trickier part as there can be multiple contractors with different payrolls etc. So it means there must be a centralized system also where you can add contractors with their hourly rate and so on.\n\nWould love to sit down and brainstorm more about this in detail.",
          "score": 1,
          "created_utc": "2026-01-28 23:56:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ceyao",
          "author": "TemporaryKangaroo387",
          "text": "paying 1200/mo for time tracking seems crazy but if thats what it takes to solve your specific problem then clearly theres a market. the question is how many other people have that exact same pain point and are willing to pay that much. if its just a handful of enterprise clients it might not be viable as a startup",
          "score": 1,
          "created_utc": "2026-01-29 03:12:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2cyp7q",
          "author": "kubrador",
          "text": "you've basically described stripe connect with a ui, which already exists in like 5 different forms but sure go off king",
          "score": 1,
          "created_utc": "2026-01-29 05:18:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2d61a8",
          "author": "The_un_lucky",
          "text": "https://toggl.com/",
          "score": 1,
          "created_utc": "2026-01-29 06:13:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2disr5",
          "author": "Ok-Variety123",
          "text": "I can build this for you. DM me",
          "score": 1,
          "created_utc": "2026-01-29 08:02:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2du31j",
          "author": "threejin",
          "text": "what issue are you facing with hubstaff?",
          "score": 1,
          "created_utc": "2026-01-29 09:48:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2afxst",
          "author": "Smart-Quality6536",
          "text": "Love the idea ! This is a real pain point . I have noticed this too. \n\nI’m a developer , do you wanna start a sass I’ll code , manage infra , help out with sales . Who know maybe this company ends up on the Fortune 500 and you be the owner .",
          "score": 0,
          "created_utc": "2026-01-28 21:12:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o28i08x",
          "author": "CucumberBig5537",
          "text": "I’m offering to build MVP’s for $500. This project honestly seems like some thing I would take on. Feel free to reach out!",
          "score": -7,
          "created_utc": "2026-01-28 16:07:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o28w56g",
              "author": "Successful-Camel165",
              "text": "It needs more than a vibe code. It needs someone with banking and financial logistics in place. I think it if it could be made with vibe coding only, there would be a lot of competitors.",
              "score": 3,
              "created_utc": "2026-01-28 17:08:25",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o28z82x",
                  "author": "GuyNamedBrian",
                  "text": "Stripe APIs could handle all the banking/logistics. You'd just need the logic and UI. I've built very customized subscription options in Stripe, pretty sure that part  is not as complex as you think it is. The harder part is always finding paying customers. Maybe there are more people out there like you that need this, maybe not. If you can prove that there is (user interviews/traction), many (myself included) would build for equity. Happy to chat if you want to dm.",
                  "score": 2,
                  "created_utc": "2026-01-28 17:21:54",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o2bz6q5",
                  "author": "Okoear",
                  "text": "You'd be surprised nowadays with Claude code/,oous and opus you can make this in 2h. It'll connect stripe for you and create a auth protected website + Supabase database for tracking.",
                  "score": 2,
                  "created_utc": "2026-01-29 01:46:19",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o28z0y0",
                  "author": "CucumberBig5537",
                  "text": "Have you looked into it? Vibe Coding just means ai assisted imo. Are there public API's and services you can integrate with? You may be right I'm just tryna challenge ya to look into it!\n\nEither way standardizing the way you hand out contract work seems like a smart idea.",
                  "score": 1,
                  "created_utc": "2026-01-28 17:21:01",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o297ik7",
          "author": "ondwa",
          "text": "I work at a company https://quantumspring.ai that specializes in bringing product ideas to market quick. DM me if you want introduction. No vibe coding",
          "score": -7,
          "created_utc": "2026-01-28 17:57:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o29hd8p",
              "author": "Successful-Camel165",
              "text": "Do you run the company too? Are you $1199 per month or less?",
              "score": 1,
              "created_utc": "2026-01-28 18:39:41",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o29l3mo",
          "author": "Ok_Procedure_7198",
          "text": "Dm how about i build the tool for only $500",
          "score": -6,
          "created_utc": "2026-01-28 18:55:24",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qqxa69",
      "title": "Validated my startup idea with SEO before building the product",
      "subreddit": "Startup_Ideas",
      "url": "https://www.reddit.com/r/Startup_Ideas/comments/1qqxa69/validated_my_startup_idea_with_seo_before/",
      "author": "pndcy222",
      "created_utc": "2026-01-30 05:57:51",
      "score": 27,
      "num_comments": 5,
      "upvote_ratio": 0.92,
      "text": "Had a startup idea and was ready to spend 3 months building an MVP. Everyone says build fast and iterate, so I was planning to code first and validate later. Decided to flip that approach. Validated demand through organic search before writing a single line of code. Created a simple landing page explaining the problem and proposed solution. Added an email signup for early access waitlist.\n\nThe validation strategy was purely organic. No paid ads to test demand because ad traffic disappears the moment you stop spending. Needed to see if people were actually searching for solutions to this problem naturally. Started with SEO foundation to get the landing page discoverable. Used [this tool to submit to startup and product directories](http://getmorebacklinks.org/) so the domain would have enough authority for content to rank. This took about 90 minutes of setup.\n\nThen published 5 blog posts targeting problem-based searches related to the startup idea. Not promotional content about my solution but helpful posts about the problem space and current alternatives people were using. Week one through three showed minimal traffic. Directory listings went live slowly and blog posts didn't rank yet. Had 8 email signups, all from people I'd directly messaged. No organic validation yet.\n\nWeek four through six is when organic validation started appearing. Domain authority hit 15 and two blog posts moved to page two. Traffic reached 180 visitors with 22 email signups from people who found the content through search. Week seven through ten brought clear validation signals. Traffic hit 450 visitors and 67 email signups from organic search. These people actively searched for solutions to the problem, found my content, and wanted early access.\n\nHad conversations with 20 of those signups. Learned what features they actually needed, what pricing made sense, what alternatives they'd tried and why those failed. All this validation happened before building anything. Now starting development with clear product direction validated by real search demand. Those 67 signups aren't just random interest, they're people who have the problem severe enough to search for solutions.\n\nThe startup idea lesson is that organic validation gives better signal quality than paid ads. People finding you through search have real intent and active problems. Ad traffic can be curiosity clicks from people who don't actually need your solution. If you're about to spend months building, validate demand through organic search first. The channel keeps working after validation too, unlike paid validation that stops when budget runs out.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Startup_Ideas/comments/1qqxa69/validated_my_startup_idea_with_seo_before/",
      "domain": "self.Startup_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o2k3d6v",
          "author": "Any_Butterscotch_610",
          "text": "Smart move flipping the usual MVP flow. Organic search is a much stronger demand signal than ads, and validating before building saved you months of guesswork. Clear proof that intent > clicks—this is how founders should de-risk ideas early.",
          "score": 0,
          "created_utc": "2026-01-30 06:20:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2k48k0",
          "author": "MuslimKhan3040",
          "text": "going slow and steady is the way to success.",
          "score": 0,
          "created_utc": "2026-01-30 06:27:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2k63z1",
          "author": "Bading_na_green_Flag",
          "text": "Woah, i never heard that kind of tool before but based on your explanation i might considered trying that one.",
          "score": 0,
          "created_utc": "2026-01-30 06:42:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2k6t7k",
          "author": "One_Perspective971",
          "text": "This is a great approach! The strategy of validating demand through organic search before building a product offers strong signals of real intent and active problems, which is a valuable lesson for many entrepreneurs.",
          "score": 0,
          "created_utc": "2026-01-30 06:47:53",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qnc0kh",
      "title": "I made $2970 last month clipping streamers with AI, here’s exactly what I did",
      "subreddit": "Startup_Ideas",
      "url": "https://www.reddit.com/r/Startup_Ideas/comments/1qnc0kh/i_made_2970_last_month_clipping_streamers_with_ai/",
      "author": "Humored-Me",
      "created_utc": "2026-01-26 10:01:07",
      "score": 25,
      "num_comments": 27,
      "upvote_ratio": 0.64,
      "text": "I see people overcomplicating this, so I figured I’d share what actually worked for me. If you want a super easy side hustle then you should give clipping a try. For those who don't know what clipping is, it's when you turn interesting moments from live streams into reels, TikTok's and shorts.\n\nIf you go on Twitch or Kick, you can save videos from popular streamers.\n\nMy basic setup:\n\n1. Create one themed account across YouTube, TikTok, and Instagram (don’t niche-hop, make separate accounts for different niches).\n2. Grab videos from popular streamers on Kick relevant to your niche.\n3. Drop the video link into [Quso](https://quso.ai?via=7xdq2x) - it auto-generates 10+ short clips and even predicts which one has the best viral potential.\n4. Use [Repurpose](https://repurpose.io?fpr=578363) to post a few clips per day across all platforms.\n5. Repost the best performing clips on Facebook + relevant subreddits for extra reach.\n\nOnce a clip crosses ~1M views, the payouts from YouTube + TikTok can be surprisingly solid. Last month this setup brought in just under $3k. It's scalable too because as you see results you can start making more accounts in different niches to post more clips.\n\nIf you get big enough you might start getting sponsorship offers on some accounts. I've had a few from gambling websites where they just wanted me to watermark the posts with their website. They normally pay on a month to month basis, I didn't include that revenue in the $2970 though.\n\nNot saying it’s guaranteed, but it’s way easier than people make it out to be.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Startup_Ideas/comments/1qnc0kh/i_made_2970_last_month_clipping_streamers_with_ai/",
      "domain": "self.Startup_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o1smmlg",
          "author": "Rude-Decision-2143",
          "text": "both of the links contains referral code.",
          "score": 41,
          "created_utc": "2026-01-26 10:20:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1spxk1",
              "author": "FreshBiskit",
              "text": "Good eyes.\nMaybe that’s the super other way to make money. Maybe a post is pending. \nWhat about copyright? No mention of it for some reason.",
              "score": 13,
              "created_utc": "2026-01-26 10:50:05",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o1srbaw",
          "author": "frzme",
          "text": "This is also basically copyright infringement. If you can/do make deals with the streamers it can be done legally but also becomes a lot more complicated",
          "score": 18,
          "created_utc": "2026-01-26 11:01:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1su0m3",
              "author": "FreshBiskit",
              "text": "So you can’t use the “fair use” excuse? Even for clips that aren’t tagged as copyright?",
              "score": -3,
              "created_utc": "2026-01-26 11:24:44",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1suahk",
                  "author": "frzme",
                  "text": "I'm not sufficiently familiar with the US fair use provisions. I believe you are supposed to (required to?) add enough of your own content for the result to be considered fair use.\n\nIn the EU I'm rather certain this is illegal.",
                  "score": 10,
                  "created_utc": "2026-01-26 11:26:59",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1swfpq",
                  "author": "PenguinAnalytics1984",
                  "text": "Fair use means you need to do something else with it - add commentary, stitch clips together, create something else. It’s to protect journalists, teachers, parodies, etc. Your changes must be “transformative.”\n\nChopping into parts and reusing it for your own profit is 1000% not fair use, just stealing.",
                  "score": 6,
                  "created_utc": "2026-01-26 11:44:14",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1tkxbt",
                  "author": "yourstartuplawyer",
                  "text": "You don't have to \"tag something as copyright.\" Copyright exists from the moment of creation. also, this is 100% not fair use",
                  "score": 3,
                  "created_utc": "2026-01-26 14:16:13",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o1txeyd",
                  "author": "sandwichstealer",
                  "text": "It wouldn’t be fair if someone stole my stream and sold it.",
                  "score": 2,
                  "created_utc": "2026-01-26 15:17:19",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1tkn9b",
          "author": "yourstartuplawyer",
          "text": "You use AI to steal other people's content. 👎",
          "score": 10,
          "created_utc": "2026-01-26 14:14:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1tx151",
          "author": "sabautil",
          "text": "Affiliate marketing. Poster may get banned for by passing reddit ads.\n\nAlso clipping streamer content violates copyright because op definitely does not own the content. So your account will be short lived.",
          "score": 7,
          "created_utc": "2026-01-26 15:15:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1u9bf1",
          "author": "DFX1212",
          "text": "> How I make money stealing others work.\n\nHard pass from me.",
          "score": 5,
          "created_utc": "2026-01-26 16:09:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1w3car",
          "author": "ryanknol",
          "text": "Illegal copyright infringement, and spam affiliate links.",
          "score": 2,
          "created_utc": "2026-01-26 20:53:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1w3egg",
          "author": "Goonzillaa",
          "text": "“Oh no it’s stealing from people who have millions of dollars” bro who gaf in this economy",
          "score": 2,
          "created_utc": "2026-01-26 20:53:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1wckzx",
          "author": "JoeCabron",
          "text": "OP’s profile shows nothing. No comments, posts, or about. Each platform will catch you. It’s bs. Look at poster’s profile on all posts here. Nobody shows you how to make money. These people prey on desperation.",
          "score": 1,
          "created_utc": "2026-01-26 21:34:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o225zpa",
          "author": "Additional_Room",
          "text": "Can we see payslip? How can we know?",
          "score": 1,
          "created_utc": "2026-01-27 18:13:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1t4mtm",
          "author": "honey1_",
          "text": "Cool",
          "score": 0,
          "created_utc": "2026-01-26 12:43:39",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qphkw0",
      "title": "Building a tool to automate \"AI Visibility\" checks. (Found huge IP bias).",
      "subreddit": "Startup_Ideas",
      "url": "https://www.reddit.com/r/Startup_Ideas/comments/1qphkw0/building_a_tool_to_automate_ai_visibility_checks/",
      "author": "startup-ideas-t234",
      "created_utc": "2026-01-28 17:20:06",
      "score": 23,
      "num_comments": 0,
      "upvote_ratio": 0.93,
      "text": "I’m working on a startup idea that automates prompt testing in LLMs.\n\nI asked ChatGPT *\"What is the best running shoe?\"* and swapped my IP for each attempt:\n\n* 🇺🇸 **US IP:** Recommendation = Nike\n* 🇩🇪 **Germany IP:** Recommendation = Adidas\n* 🇯🇵 **Japan IP:** Recommendation = Asics\n\n**The Problem:** Brands are currently \"blind\" to this. They sit in their HQ and have no idea that their global customers are seeing competitors recommended simply due to IP bias.\n\n**The Solution:** I built a backend that:\n\n1. Spins up 4G proxies in 40+ countries.\n2. Sends specific prompts (\"Best CRM,\" \"Best Shoes\").\n3. Uses NLP to analyze who is \"winning\" the recommendation.\n\nI'm calling it Radarkit. We just got into an Alpha program, but I'm trying to figure out the best go-to-market.\n\nWho is the buyer here? The SEO guy? The PR guy? Or the CMO?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Startup_Ideas/comments/1qphkw0/building_a_tool_to_automate_ai_visibility_checks/",
      "domain": "self.Startup_Ideas",
      "is_self": true,
      "comments": []
    },
    {
      "id": "1qlww48",
      "title": "Share your startup - I'll find 5 hot leads for your startup (free experiment)",
      "subreddit": "Startup_Ideas",
      "url": "https://www.reddit.com/r/Startup_Ideas/comments/1qlww48/share_your_startup_ill_find_5_hot_leads_for_your/",
      "author": "Wolfgang-Lars-69",
      "created_utc": "2026-01-24 19:49:41",
      "score": 20,
      "num_comments": 37,
      "upvote_ratio": 1.0,
      "text": "I know how tough it is for founders to connect and acquire new business - I'm testing something and want to help a few founders here.\n\nIf you share your startup + target customer, I'll find 5 people with buying intent for your exact product.\n\nI'm using [Predictent.ai](http://predictent.ai/) (our tool) to track real-time signals, but mainly doing this to see if it's genuinely helpful for early-stage founders struggling with cold outreach.\n\nJust provide:\n\n* Your website or product description\n* Brief line about who you're targeting\n\nCapping this at 15 startups since it takes some manual review on my end.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Startup_Ideas/comments/1qlww48/share_your_startup_ill_find_5_hot_leads_for_your/",
      "domain": "self.Startup_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o1poetx",
          "author": "Wolfgang-Lars-69",
          "text": "Thanks to everyone who commented - we had so much demand and i worked through as much as possible, for anyone who would like to follow our same method we were following this [outreach playbook](https://www.notion.so/48-Hour-Outreach-System-How-We-Turn-LinkedIn-Posts-Into-Demos-Before-Prospects-Go-Cold-2f0f37e6fd5080ba86d0fcd86e63a2eb)",
          "score": 8,
          "created_utc": "2026-01-25 23:05:02",
          "is_submitter": true,
          "replies": []
        },
        {
          "id": "o1hjjwp",
          "author": "Desir-Arman07",
          "text": "I am building Lumina to stop the Google → LinkedIn → Naukri loop. Job hunting in India wastes a lot of time because most posts are either spammy or expired.\n\nLumina is a search engine that shows only real jobs from official company career pages. No consultants, no third-party listings. You search a role and get the direct apply link (Workday, Taleo, etc.).\n\nIt’s an early MVP with 2,400+ active jobs right now. I’m updating it daily and improving the scrapers and UI.\n\nCheck it out: https://luminajobs.vercel.app/",
          "score": 2,
          "created_utc": "2026-01-24 20:04:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1hqt1u",
              "author": "Wolfgang-Lars-69",
              "text": "please DM me, as i can't send any more DMs :)",
              "score": 1,
              "created_utc": "2026-01-24 20:38:59",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1i8bjk",
          "author": "PillsMcCoy",
          "text": "https://litterboxd.org - app for journaling cat encounters",
          "score": 1,
          "created_utc": "2026-01-24 22:01:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1iosam",
          "author": "Worried_Cap5180",
          "text": "Fun football score prediction game to play with your friends https://fulltimescore.pro",
          "score": 1,
          "created_utc": "2026-01-24 23:24:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1izb32",
          "author": "gregb_parkingaccess",
          "text": "How and where do you find the signals and connect to that right person ?",
          "score": 1,
          "created_utc": "2026-01-25 00:18:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1j06m9",
              "author": "Wolfgang-Lars-69",
              "text": "We have our own internal playbook we follow - you can see it [here](https://www.notion.so/48-Hour-Outreach-System-How-We-Turn-LinkedIn-Posts-Into-Demos-Before-Prospects-Go-Cold-2f0f37e6fd5080ba86d0fcd86e63a2eb?source=copy_link)",
              "score": 1,
              "created_utc": "2026-01-25 00:23:25",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1ki5fo",
          "author": "amacg",
          "text": "Built a community where makers can share what they’re building and get fair visibility. Here's the link: [https://trylaunch.ai](https://trylaunch.ai/)",
          "score": 1,
          "created_utc": "2026-01-25 05:35:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1kz9bo",
          "author": "Potential_Product_61",
          "text": "I'll bite.\n\nspinix.so – customer retention tool for restaurants and cafes. Gamified QR experience (spin-to-win), captures emails, drives repeat visits. Integrates with Apple/Google Wallet for push notifications.\n\nTarget: restaurant owners, cafe owners, hospitality businesses. Mostly SMBs, 1-10 locations. UK and Australia primary markets right now.\n\nCurious what you find.",
          "score": 1,
          "created_utc": "2026-01-25 07:49:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ld3li",
          "author": "greyzor7",
          "text": "Building an all-in-one pack for founders who want more than \"just another launch\"\n\nLaunch, reach 30k+ makers, get users & customers - [microlaunch.net/premium](http://microlaunch.net/premium)\n\nLifetime, auto-distribution, marketplace spots, 700+ customers so far.",
          "score": 1,
          "created_utc": "2026-01-25 09:51:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1mfn79",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-25 14:32:18",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qp9xn2",
      "title": "How do businesses actually source products from China successfully?",
      "subreddit": "Startup_Ideas",
      "url": "https://www.reddit.com/r/Startup_Ideas/comments/1qp9xn2/how_do_businesses_actually_source_products_from/",
      "author": "CSJason",
      "created_utc": "2026-01-28 12:23:55",
      "score": 18,
      "num_comments": 0,
      "upvote_ratio": 0.7,
      "text": "I've been talking with a few business owners recently and noticed everyone has a different strategy. Sourcing products from overseas can be surprisingly tricky. Some businesses manage to find steady, trustworthy suppliers, while others run into delays, inconsistent quality, or confusing communication. It seems like the platforms themselves are just tools, the real challenge is figuring out who you can actually rely on.\n\nWebsites like [Made-in-China.com](http://Made-in-China.com)  list thousands of suppliers across industries, but the experiences people have vary widely. Some businesses try small trial orders, some work with agents, and others take a more hands on approach to verify suppliers. It’s interesting to see how strategies differ depending on the type of business and products.\n\nI’d love to hear from anyone who has experience with international sourcing. \n\nWhat surprised you most? \n\nWhat would you do differently next time? \n\nHow do you decide if a supplier is actually trustworthy?\n\nSharing stories could help others understand what works and what doesn’t.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Startup_Ideas/comments/1qp9xn2/how_do_businesses_actually_source_products_from/",
      "domain": "self.Startup_Ideas",
      "is_self": true,
      "comments": []
    },
    {
      "id": "1qnir05",
      "title": "Which Is the Best LLP Registration Service for Startups?",
      "subreddit": "Startup_Ideas",
      "url": "https://www.reddit.com/r/Startup_Ideas/comments/1qnir05/which_is_the_best_llp_registration_service_for/",
      "author": "Waz_Tengo",
      "created_utc": "2026-01-26 15:15:47",
      "score": 13,
      "num_comments": 4,
      "upvote_ratio": 1.0,
      "text": "I’m setting up a startup and planning to register it as an LLP. There are a ton of registration services out there and it’s hard to tell which ones are actually good vs just good at marketing.\n\nFor anyone who’s done this before which LLP registration service did you use, and would you recommend it? Any advice or things to avoid would be super helpful.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Startup_Ideas/comments/1qnir05/which_is_the_best_llp_registration_service_for/",
      "domain": "self.Startup_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o1u1ygo",
          "author": "audiodesigndan",
          "text": "Most startups go Delaware c-corp",
          "score": 2,
          "created_utc": "2026-01-26 15:37:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1vb67u",
          "author": "gptbuilder_marc",
          "text": "This usually isn’t about which service is “best,” it’s about what kind of failure you’re trying to avoid. Speed problems, surprise fees, compliance mistakes, or support falling off after registration. Which one are you most worried about right now?",
          "score": 1,
          "created_utc": "2026-01-26 18:51:10",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qorgwr",
      "title": "After 2 years of building things nobody used, I finally saw real users on my app today",
      "subreddit": "Startup_Ideas",
      "url": "https://www.reddit.com/r/Startup_Ideas/comments/1qorgwr/after_2_years_of_building_things_nobody_used_i/",
      "author": "Important_Guava4335",
      "created_utc": "2026-01-27 21:37:02",
      "score": 13,
      "num_comments": 11,
      "upvote_ratio": 0.93,
      "text": "I don't even know how to process this so I'm just going to write it out.\n\nI've been trying to build something that works since 2024. Not exaggerating when I say I've started and abandoned maybe 15 different projects. Some I spent months on. Most never got a single user outside of people I personally asked to try it.\n\nLast month I launched [this new app](https://join.meetaugust.ai/?c=ZtVvAK). Nothing fancy, just solving a small problem I personally had. Didn't tell anyone about it really. Put it out there and kind of forgot about it because I was busy with other stuff.\n\nOpened my analytics dashboard today for the first time in a week. There were bars on the chart. Small ones, but they were there. Like 5 - 6 people over the past few days who found my app somehow and actually completed the whole onboarding flow.\n\nI know this sounds stupid to get excited about. But if you've ever stared at a flat zero line for months, you know what this feels like. These aren't friends I begged. These aren't my mom testing it. These are strangers who found it on their own and decided it was worth their time.\n\n Is this what the beginning looks like?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Startup_Ideas/comments/1qorgwr/after_2_years_of_building_things_nobody_used_i/",
      "domain": "self.Startup_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o25kg3d",
          "author": "1funtravelcouple",
          "text": "100k plus downloads?",
          "score": 1,
          "created_utc": "2026-01-28 04:08:33",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qqn8cb",
      "title": "Looking for a co-founder: Marketing/Sales for First-5",
      "subreddit": "Startup_Ideas",
      "url": "https://www.reddit.com/r/Startup_Ideas/comments/1qqn8cb/looking_for_a_cofounder_marketingsales_for_first5/",
      "author": "Woodzi3",
      "created_utc": "2026-01-29 22:28:19",
      "score": 13,
      "num_comments": 6,
      "upvote_ratio": 0.94,
      "text": "I built First-5 — a morning briefing app that calls you with a 90-second personalised voice summary of your day. Plus a full web dashboard to view and manage everything. Putting emphasis on the first 5 minutes of your day being the most important.\n\nNo scrolling through apps. Your phone rings, you answer, you’re ready.\n\nThe product (live at first-5.com):\n\nVoice call every morning:\n\n\t∙\tRings at your chosen time\n\n\t∙\t90-second personalised briefing\n\n\t∙\tCovers weather, calendar, commute, portfolio, fitness, tasks, news\n\nFull web dashboard:\n\n\t∙\tMarkets — live portfolio tracking\n\n\t∙\tNews Brief — headlines that matter to you\n\n\t∙\tToday’s Tasks — priorities for the day\n\n\t∙\tCalendar Radar — upcoming events at a glance\n\n\t∙\tToday’s Workout — routine and streak tracking\n\n\t∙\tWeather and commute in the header\n\n\t∙\tDark mode, clean UI, fully functional\n\nExample call:\n\n“Good morning. 8 degrees, rain after 3pm — grab a jacket. 3 meetings today, first at 9am. 35 minutes to the office, take the A35. Portfolio up £340. It’s push day — bench, shoulders, triceps. 2 priorities: finish the client proposal, review Q4 numbers. Have a great day.”\n\nThe numbers:\n\n\t∙\t£8/month (£60/year)\n\n\t∙\t\\~£1.20 cost per user/month\n\n\t∙\t85% gross margin\n\nStatus:\n\n\t∙\tProduct: built and working\n\n\t∙\tDashboard: fully functional\n\n\t∙\tVoice calls: working\n\n\t∙\tPayments: Stripe integrated\n\n\t∙\tUsers: early stage, need distribution\n\nWhat I need:\n\nA co-founder who owns growth. Marketing, content, sales, partnerships — whatever gets users in the door. I’ll keep building and shipping.\n\nWhat I bring:\n\n\t∙\tFull-stack: Next.js, Supabase, Twilio, OpenAI, Stripe, Vercel\n\n\t∙\tI built this in 5 days\n\n\t∙\tRunway to go all-in\n\n\t∙\tUK-based, open to remote\n\n“Every productivity app needs you to open it. First-5 calls you.”\n\nIf you’re a marketer looking for a technical co-founder with a live product — DM me",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Startup_Ideas/comments/1qqn8cb/looking_for_a_cofounder_marketingsales_for_first5/",
      "domain": "self.Startup_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o2iez1r",
          "author": "Electronic-Tart8948",
          "text": "I’m not a marketer, but I just want to say that I love the app idea! Wow!",
          "score": 1,
          "created_utc": "2026-01-30 00:16:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2iiyha",
          "author": "makutamillion",
          "text": "Good idea, but to be honest, I don’t know if this gets distraction. Kind of missing the experiential factors. But keep iterating you might be up to something great.",
          "score": 1,
          "created_utc": "2026-01-30 00:37:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ix3dz",
          "author": "passytroca",
          "text": "I like the idea . Have you checked the competition? Like Gemini combined with Google calendar and todo list ? IMHO you need a stronger value proposition and perhaps target a niche.  DM me we can have a call",
          "score": 1,
          "created_utc": "2026-01-30 01:55:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2j301h",
          "author": "RecognitionHot9149",
          "text": "Do you expect a remote cofounder to also be in the UK?",
          "score": 1,
          "created_utc": "2026-01-30 02:28:18",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qq6jg9",
      "title": "I need serious advice",
      "subreddit": "Startup_Ideas",
      "url": "https://www.reddit.com/r/Startup_Ideas/comments/1qq6jg9/i_need_serious_advice/",
      "author": "LowIll5234",
      "created_utc": "2026-01-29 11:53:09",
      "score": 12,
      "num_comments": 22,
      "upvote_ratio": 0.77,
      "text": "I am 22 years old. \n\nI have wifi, a Laptop and a phone. \n\nI live in Asia. \n\nAnd I'm good at Sales cuz i was former travel agent and a real estate agent. \n\nI need to formulate a business idea that I can initially implement from home and then scale bigger as I go. It has to be a service based B2B product since I have zero software dev or programming skills. \n\nI have an idea that I'm trying out at the moment but I really do need some more insight and advice from people who's done it. I need genuine help to make money cuz if I don't make at least 3k (usd - personal income) within then next month, I'm gonna have to go back to living with my parents.\n\nFYI - The reason I gave up my previous jobs was due to them being extremely boring and not having the freedom to be creative. I know I'm good at sales cuz i made a shit load of money from commissions which I paid off my student loans with. But now I'm down to my last grand.\n\nThank you for reading this and lmk all your thoughts and ideas. ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Startup_Ideas/comments/1qq6jg9/i_need_serious_advice/",
      "domain": "self.Startup_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o2eoiqq",
          "author": "sjamesparsonsjr",
          "text": "You could sell other people’s services and add a markup.",
          "score": 4,
          "created_utc": "2026-01-29 13:32:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2etr4o",
          "author": "brennhill",
          "text": "Fellow person in SEA here.  \n\nWhat you are describing is called an Agency. There are tons and tons of digital nomads like yourself running agencies out of asia.  \n\nYou can either start your own or join one doing sales if you are good. There are very few agencies that will say no to someone who can PROVE that they can do sales (especially if you are just on commission).\n\nThe issue with Agencies is they tend to struggle without connections. Most agencies I know that were successful were started by people with deep industry connections and these connections gave them the \"in\" necessary to do sales.  Initial sales for an agency are one of the hardest parts - you have no rep.\n\nThe other way in, which I used for my agency, was to jump on the latest wave and offer services.  But this was easier for me because I\"m very technical. However, you can find a co-founder to handle the tech while you handle sales.\n\nSo you have two tasks:  \n1. Find the market that you can address  \n2. Possibly, find a co-founder who has the skills to address it while you do the sales.",
          "score": 3,
          "created_utc": "2026-01-29 14:00:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2eom6a",
          "author": "MarkMarkinly",
          "text": "If you are good at sales.provide effective sales services to western countries. May you can add ai. Your spoken English needs to be great.",
          "score": 2,
          "created_utc": "2026-01-29 13:33:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2i2cow",
          "author": "Unable-Shame-2532",
          "text": "if you’re interested i run an agency and hire marketers to sell my services, with a 50/50 revenue split on all sales they make. i’m the opposite of you where i don’t know the first thing about marketing so i just outsource it. but when it comes to tech and development, that’s where im most comfortable. if you’re interested, i cant guarantee 3k in a month, but there is no ceiling on how much you make, its all about how dedicated you are.",
          "score": 1,
          "created_utc": "2026-01-29 23:08:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ntd87",
          "author": "Sea-Culture-8351",
          "text": "Hey I am building a tech start up, where I need someone who is good at sale… would definitely need your help or a partnership! Any profits we will divide between us, I ll build tech, you take care of the customers… up?",
          "score": 1,
          "created_utc": "2026-01-30 19:39:24",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qp74d0",
      "title": "Startup founders, what are your marketing woes?",
      "subreddit": "Startup_Ideas",
      "url": "https://www.reddit.com/r/Startup_Ideas/comments/1qp74d0/startup_founders_what_are_your_marketing_woes/",
      "author": "rocketfuelinabubble",
      "created_utc": "2026-01-28 09:50:10",
      "score": 11,
      "num_comments": 6,
      "upvote_ratio": 1.0,
      "text": "I’m a B2B marketer worked with scale ups and enterprises — I’d love to understand the challenges that (serial or first-time) startup founders face with respect to setting up your marketing engine. \n\nBoth tech and non-tech founders are welcome to also ask me any questions you have, and happy to help in any way I can. \n\nAlso marketing rants welcome — let’s hear it! ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Startup_Ideas/comments/1qp74d0/startup_founders_what_are_your_marketing_woes/",
      "domain": "self.Startup_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o26vixa",
          "author": "MORPHOICES",
          "text": "For me, the hardest part wasn’t tactics—it was figuring out what actually mattered at the stage I was in.\n\nEarly on, I treated marketing like a checklist. Website, socials, messaging, funnels. I spent weeks polishing things that felt productive but didn’t really move anything forward.\n\nThe shift came after a few quiet launches. I realized early marketing pain is mostly about signal, not reach. I didn’t need more channels. I needed tighter feedback loops. Who’s reacting, why, and where they’re getting confused.\n\nThe mistake I see a lot (and definitely made myself) is trying to “build a marketing engine” before there’s a repeatable story. Without that, everything feels random and draining.\n\nOne small change that helped a lot: instead of asking “how do we get more eyeballs?”, I started asking “what question do people ask right before they decide this isn’t for them?” Fixing that did more for momentum than any campaign ever did.\n\nCurious if others here struggle more with distribution—or with knowing what to say once you actually have attention. \\~",
          "score": 2,
          "created_utc": "2026-01-28 10:24:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o277v2e",
          "author": "Peter-Park11",
          "text": "https://startupsubmit.app we help founders to get listed their startup in 300+ high authority directories.",
          "score": 1,
          "created_utc": "2026-01-28 12:04:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o27fgft",
              "author": "rocketfuelinabubble",
              "text": "No product plugs please 🙏. \n\nThis post is aimed at connecting with founders or early stage marketers to understand their challenges",
              "score": 1,
              "created_utc": "2026-01-28 12:55:27",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o26w948",
          "author": "Wide_Brief3025",
          "text": "Finding quality leads and filtering out noise is always a pain for startups trying to build early traction. Staying on top of relevant conversations is key but time consuming. Tools like ParseStream can help by notifying you instantly when your ideal customers are talking on Reddit or Quora so you can join in at the right moment and focus only on high potential leads.",
          "score": 0,
          "created_utc": "2026-01-28 10:31:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o27fcux",
              "author": "rocketfuelinabubble",
              "text": "No sly or obvious product plugs please 🙏. \n\nThis post is aimed at connecting with founders or early stage marketers to understand their challenges",
              "score": 2,
              "created_utc": "2026-01-28 12:54:51",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qnfo86",
      "title": "Monday check-in: what are you building?",
      "subreddit": "Startup_Ideas",
      "url": "https://www.reddit.com/r/Startup_Ideas/comments/1qnfo86/monday_checkin_what_are_you_building/",
      "author": "Fareway13",
      "created_utc": "2026-01-26 13:13:29",
      "score": 11,
      "num_comments": 33,
      "upvote_ratio": 0.93,
      "text": "Curious to know what others are building.\n\nI’m building [itraky](https://www.itraky.io/), a smart deep linking tool that helps creators and affiliates skyrocket their conversion rates.\n\nIt automatically opens links directly in apps like Amazon, YouTube, TikTok or Instagram instead of the browser, so users land where they’re already logged in and ready to act.\n\nThat means a smoother experience and fewer drop-offs.\n\nSo… what are you building? 👇",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Startup_Ideas/comments/1qnfo86/monday_checkin_what_are_you_building/",
      "domain": "self.Startup_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o1tdmru",
          "author": "PillsMcCoy",
          "text": "In day 4 post launch of Litterboxd! Having weirdly good organic growth in Russia but trying to get more elsewhere. Happy with downloads thus far but lots to do.  Hoping to start the two week Android test today which is crazy long. \n\nhttps://litterboxd.org",
          "score": 2,
          "created_utc": "2026-01-26 13:38:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1tamij",
          "author": "Immediate_Power_5546",
          "text": "A B2B SaaS communication platform that combines chat, workflows, and file sharing in one system.\nIt integrates the key benefits of email, messaging apps, and collaboration tools without their drawbacks.\nCompanies can customise it to their specific client workflows and use cases.\nIt supports internal team channels and external client channels with easy guest access.\nThe goal is to keep client communication simple, structured, and easy to track.",
          "score": 1,
          "created_utc": "2026-01-26 13:21:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1u9fqu",
          "author": "greyzor7",
          "text": "Building an all-in-one pack for founders who want more than \"just another launch\"\n\nLaunch, reach 30k+ makers, get users & customers - [microlaunch.net/premium](http://microlaunch.net/premium)\n\nLifetime, auto-distribution, marketplace spots, 700+ customers so far.",
          "score": 1,
          "created_utc": "2026-01-26 16:10:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1uc9n0",
          "author": "International-Hat529",
          "text": "Building [**Marina AI**](https://usemarina.app), a realtime [**voice-based AI relationship assistant**](https://usemarina.app) trained on **Cognitive Behavioral Therapy (CBT)**.  \nIt keeps session memory, understands long-term context, and offers guided exercises to support communication, emotional awareness, and healthier relationships.",
          "score": 1,
          "created_utc": "2026-01-26 16:22:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1vd4yh",
          "author": "damir_maham",
          "text": "Your progress - in public, in one place.\n\nGoAchievo is built for Reach in Public: share your journey openly, get real support from others, and never lose your updates in a noisy feed. Everything you do is saved in one timeline for your goal - one place to get your progress, easy to review and easy for others to follow.\n\n👉 [https://goachievo.com/](https://goachievo.com/)",
          "score": 1,
          "created_utc": "2026-01-26 18:59:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1vlra6",
          "author": "AffectOk",
          "text": "[LovedByAI](https://www.lovedby.ai) - making sure WordPress sites show up in AI search results - AI SEO / GEO / AEO",
          "score": 1,
          "created_utc": "2026-01-26 19:36:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1vz6nx",
          "author": "missEves",
          "text": "[playmix](https://playmix.ai/animate) \\- create animated game sprites w/ ai 🏃‍♀️",
          "score": 1,
          "created_utc": "2026-01-26 20:35:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1w5h24",
          "author": "pr0v4",
          "text": "Building PCI DSS compliance dashboard - check it out https://pcidss-dashboard.com",
          "score": 1,
          "created_utc": "2026-01-26 21:03:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1w9asq",
          "author": "Walfy07",
          "text": "[Flux Wallet](https://www.kickstarter.com/projects/wessford/flux-wallet)",
          "score": 1,
          "created_utc": "2026-01-26 21:20:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1wgg7x",
          "author": "jundymek",
          "text": "Building **FakerFill** \\- a tool that saves time by filling any form instantly with fake test data.\n\n[https://www.fakerfill.com](https://www.fakerfill.com)",
          "score": 1,
          "created_utc": "2026-01-26 21:51:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1zpokx",
          "author": "OkResort8287",
          "text": "1. www.kipasastore.com - an all in 1 global store stocking up recently rolled put with updates pending \n2. https://maasimcreatives.com/ - a kids creative corner kids books for your kids",
          "score": 1,
          "created_utc": "2026-01-27 10:17:15",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qn3lzl",
      "title": "Foxhog VC is a scam (Whistle-Blowing)",
      "subreddit": "Startup_Ideas",
      "url": "https://www.reddit.com/r/Startup_Ideas/comments/1qn3lzl/foxhog_vc_is_a_scam_whistleblowing/",
      "author": "PrestigiousGood415",
      "created_utc": "2026-01-26 02:37:15",
      "score": 8,
      "num_comments": 5,
      "upvote_ratio": 1.0,
      "text": "Beware of Foxhog VC scam.\n\n1️⃣ Tarun Poddar (CEO, Foxhog) falsely claims as Stanford MBA.\n\n2️⃣ PR Reported Profit (FY'24): 1,24,69,00,000 INR.\n    MCA Actual Profit (FY'24): 31,706 INR.\n\n3️⃣ Fake 25 Cr & 17 Cr CSR commitments to IIT Kanpur & IIT Roorkee. (Jun'25)\n\n4️⃣ Arrested by Delhi Police on 2018. Running on bail from Rajasthan Police.\n\n5️⃣ Startup investments claims like Madden Company (Kerala), Hegan (Noida), RR Logistics (Guwahati), Tech Atriocare (Delhi) etc have never been made.\n\n6️⃣ 3-4 FIRs currently ongoing against him from Hyderabad, Bhubaneswar, Delhi etc cities.\n\nTarun Poddar is a serial scammer & has been openly looting lacs from Rich girls & Rural Startup founders since 2018. \n\nBeware of serial scammer Tarun Poddar & Foxhog VC!!",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Startup_Ideas/comments/1qn3lzl/foxhog_vc_is_a_scam_whistleblowing/",
      "domain": "self.Startup_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o1qxt2j",
          "author": "calodero",
          "text": "LMAO bro fucking “fox hog”? Was “bear cock”\nTaken?",
          "score": 3,
          "created_utc": "2026-01-26 02:49:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1qyh1n",
          "author": "PrestigiousGood415",
          "text": "Buddy, Tarun Poddar is a serial scammer since 2018, made 25+ Startups shut down. He does it openly. If any Startup founder opposes, he threats with legal suits.",
          "score": 0,
          "created_utc": "2026-01-26 02:52:54",
          "is_submitter": true,
          "replies": []
        }
      ]
    },
    {
      "id": "1qrc2oj",
      "title": "LF Co founder",
      "subreddit": "Startup_Ideas",
      "url": "https://www.reddit.com/r/Startup_Ideas/comments/1qrc2oj/lf_co_founder/",
      "author": "Darijan__",
      "created_utc": "2026-01-30 17:33:53",
      "score": 7,
      "num_comments": 6,
      "upvote_ratio": 0.82,
      "text": "Born in Serbia, raised in Italy, now in Berlin. On March 7th I’m moving to San Francisco. I’m 20.\n\nI built my first startup in Italy, Hiwork, a marketplace between workers and companies in hospitality. 1k users in two weeks, 90 companies onboarded and investment offers from two Italian VCs. I left due to issues with my co founder.\n\nI then moved to Berlin and worked as EIR in a food delivery company, where I opened a new business unit that after a few months was generating 65k per month. I closed deals with companies like WeWork, Zalando, TomTom and King.\n\nWorking for others is not my thing. Today was my last day, I quit.\n\nI’m currently building a ERP that will be ready for the market next week, with two customers ready to buy. Still, I’m looking for something bigger, to work on a real dream.\n\nIf you’re building something cool in SF, reach out. I’m non technical, looking for people around my age with real hunger who have already built things.\n\nContact me on LinkedIn Darijan Ducic. If I don’t reply, it means I’m not interested.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Startup_Ideas/comments/1qrc2oj/lf_co_founder/",
      "domain": "self.Startup_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o2oejg5",
          "author": "MrHumanist",
          "text": "Many red flags!",
          "score": 5,
          "created_utc": "2026-01-30 21:19:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2ogqe1",
              "author": "Darijan__",
              "text": "there is also some green light or not? ahahaha",
              "score": -3,
              "created_utc": "2026-01-30 21:29:30",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2nd3w7",
          "author": "Musician4229",
          "text": "Is your immigration legal? Why would someone want to collaborate if you’re here only for short terms",
          "score": 1,
          "created_utc": "2026-01-30 18:27:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2ogwjh",
              "author": "Darijan__",
              "text": "i will not explain a obbius thing ;)",
              "score": -1,
              "created_utc": "2026-01-30 21:30:19",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2oh2lm",
                  "author": "Musician4229",
                  "text": "You have no cards to play mate",
                  "score": 3,
                  "created_utc": "2026-01-30 21:31:06",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qq35bn",
      "title": "Hey everyone, I’ve worked as a research analyst at a VC firm in India for 3 years, and currently looking to help early stage startups with their research needs.",
      "subreddit": "Startup_Ideas",
      "url": "https://www.reddit.com/r/Startup_Ideas/comments/1qq35bn/hey_everyone_ive_worked_as_a_research_analyst_at/",
      "author": "Motor_Membership_361",
      "created_utc": "2026-01-29 08:33:33",
      "score": 6,
      "num_comments": 11,
      "upvote_ratio": 1.0,
      "text": "I recently moved into freelance consulting, where I work with early and ideation-stage startups to support their research across markets, customers, and competition.  \n  \nI’ll just give you a brief overview of the services I will be providing.  \n  \nCompetitor Insights Report:  \n\\- Up to 12 closest competitors  \n\\- Positioning, offerings, GTM, pricing, value proposition, etc.  \n  \nMarket Research:  \n\\- Sector overview  \n\\- Market size  \n\\- Trends & growth drivers  \n\\- White spaces / opportunities  \n  \nCustomer Segmentation:  \n\\- Ideal customer personas  \n\\- Pain-point segmentation  \n\\- Buyer personas (B2B/B2C)  \n  \nComplete business plan (excluding financial projections):  \n\\- Executive summary, market research insights, service/product line, marketing and sales strategy, etc.   \n  \n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Startup_Ideas/comments/1qq35bn/hey_everyone_ive_worked_as_a_research_analyst_at/",
      "domain": "self.Startup_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o2dolpm",
          "author": "Obvious_Board4757",
          "text": "how much do you charge ? looking for few research for my startup",
          "score": 1,
          "created_utc": "2026-01-29 08:56:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2ech9e",
              "author": "Motor_Membership_361",
              "text": "Dm’ed",
              "score": 1,
              "created_utc": "2026-01-29 12:18:17",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2dolrk",
          "author": "LifeTelevision1146",
          "text": "DM me",
          "score": 1,
          "created_utc": "2026-01-29 08:56:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2ecgvl",
              "author": "Motor_Membership_361",
              "text": "Dmed",
              "score": 1,
              "created_utc": "2026-01-29 12:18:12",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2e6c4z",
          "author": "PrestigiousGood415",
          "text": "Would love to connect on DM.",
          "score": 1,
          "created_utc": "2026-01-29 11:33:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2eceno",
              "author": "Motor_Membership_361",
              "text": "Dmed you!",
              "score": 1,
              "created_utc": "2026-01-29 12:17:46",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qmf33q",
      "title": "Is this useful or a waste of time?",
      "subreddit": "Startup_Ideas",
      "url": "https://www.reddit.com/r/Startup_Ideas/comments/1qmf33q/is_this_useful_or_a_waste_of_time/",
      "author": "Alternative-Hall1719",
      "created_utc": "2026-01-25 09:53:10",
      "score": 6,
      "num_comments": 13,
      "upvote_ratio": 1.0,
      "text": "I’m currently living in Sweden and it’s my 6th country. Whenever I plan a move, I do a bit of research (google, reddit, videos etc), and then decide. But the information I collect is scattered.\n\nI thought why not a single place for truth:\n\n\t•\twhere you can actually afford to live\n\n\t•\twhat the culture is like\n\n\t•\twhat to expect day-to-day\n\n\t•\tvisa and relocation basics\n\nThe goal is to reduce the guesswork before you seriously consider a move.\n\nNot sure if this solves a real problem or just mine.\n\nWould you use something like this? Looking for honest feedback.\n\nhttps://affordwhere.com",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Startup_Ideas/comments/1qmf33q/is_this_useful_or_a_waste_of_time/",
      "domain": "self.Startup_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o1lkjht",
          "author": "DayOk4526",
          "text": "I think this is a valid idea and works for people who move around alot but idk how can you monetize or make money from it since people often move every few years so there is no incentive of keep using it",
          "score": 1,
          "created_utc": "2026-01-25 10:57:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1pysv2",
              "author": "Alternative-Hall1719",
              "text": "I agree, and that is excatly the dilemma I’m trying to fight. Since, I decided to keep this website signup free, and I know its a niche area, you got any ideas to scale this?",
              "score": 1,
              "created_utc": "2026-01-25 23:54:26",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1qtfw8",
                  "author": "DayOk4526",
                  "text": "One way is that you can turn this into a service business, where you can help to open a bank account, open a sim card, etc and settle down in that country",
                  "score": 1,
                  "created_utc": "2026-01-26 02:27:41",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1ma3yd",
          "author": "chrisemmvnuel",
          "text": "Good idea.\nI tried it out, it will be better once u make the gross salary be calculated in either a universal currency like USD or from originating country currency",
          "score": 1,
          "created_utc": "2026-01-25 14:02:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1pycxj",
              "author": "Alternative-Hall1719",
              "text": "Thank you for the response. I have implemented this feature. Check it out. Please share if you find this website useful.",
              "score": 1,
              "created_utc": "2026-01-25 23:52:23",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1q3acl",
          "author": "Junior-Ad7155",
          "text": "I am very unlikely to make a life decision based on this. Also, why does the salary field not allow inputs above $100k?",
          "score": 1,
          "created_utc": "2026-01-26 00:16:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1s951c",
              "author": "Alternative-Hall1719",
              "text": "Updated to have more flexibility...thank you for the suggestion",
              "score": 2,
              "created_utc": "2026-01-26 08:17:53",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1s669d",
          "author": "JumarUp",
          "text": "The UX flows well. The problem I see with the overall idea is that there are simply too many variables to generalize/make a valid statements whether X amount of salary would be considered enough, more than enough, not enough to live comfortably in a foreign country. A minor fix to address this would be if you allow your users to input the percentage of pay he/she typically sends on food, entertainment, etc. If you make most fields customizable by the user, it would be more useful. Example: allow them to input whether they want a shitty apt to save money and a large budget (relative to their pay) on entertainment. Or, be frugal on everything because they have a baby on the way or want to save for a house. Just my two cents.",
          "score": 1,
          "created_utc": "2026-01-26 07:52:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1twi28",
              "author": "Alternative-Hall1719",
              "text": "Hey, just added the feature you mentioned. Try and let me know.",
              "score": 1,
              "created_utc": "2026-01-26 15:13:01",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1vph5v",
                  "author": "JumarUp",
                  "text": "Cool. Just tried it. I like it. Other suggestions that came to mind that might help retain user's interest to stick around your website longer...photos of what a top end vs mid grade vs cheapo living look like in the selected city. Probably not too hard to find stock representative images. For your cost estimates to remain accurate over time, maybe have some sort of functionality that links user to the popular apt search website. In the US, many people use craigslist. So if your user chooses say, Seattle, Washington and your site not only generates the figures but also provide a link to a few of those websites, your numbers/estimates would be more accurate. Maybe you could partner w/ those sites or get a cut of the traffic that you drive.. In big cities, rental churn rate is high as tech companies go through cycles of thriving and busting. So the cost of living on just rental goes up and down. . As your project gets bigger, you might also make it a one-stop shop type thing where people who come to visit could also reserve/sign lease, book hotel, etc from your site itself. That would diversify your revenue channels by getting a cut Just my 2 cents of the day. Keep rocking!",
                  "score": 1,
                  "created_utc": "2026-01-26 19:52:20",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}