{
  "metadata": {
    "last_updated": "2026-02-25 03:09:27",
    "time_filter": "week",
    "subreddit": "startup",
    "total_items": 13,
    "total_comments": 75,
    "file_size_bytes": 72485
  },
  "items": [
    {
      "id": "1r8ry28",
      "title": "Is anyone else drowning in trying to manage 4+ social platforms while building…",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1r8ry28/is_anyone_else_drowning_in_trying_to_manage_4/",
      "author": "Equivalent-Spend-415",
      "created_utc": "2026-02-19 06:34:15",
      "score": 17,
      "num_comments": 33,
      "upvote_ratio": 0.95,
      "text": "I’ve realized the hard way that my biggest hurdle isn’t the code… it’s the distribution. I spent 3 months building in total silence, and when I finally launched, it was absolute silence. I know the fix is building in public but the sheer overhead is killing my productivity.   \n  \nI am trying to find a way to consistently produce and repurpose content to stay active on LinkedIn for investors, X (Twitter) for the tech community, and now Instagram/YouTube for brand personality. By the time I’ve tailored the founder journey content for each platform's vibe, I’ve lost half a day of deep work. As a solo founder, I can’t afford to be a full-time Social Media Manager, but I also can't afford to be invisible. What’s your workflow for staying visible across multiple channels without losing your focus on the product?",
      "is_original_content": false,
      "link_flair_text": "knowledge",
      "permalink": "https://reddit.com/r/startup/comments/1r8ry28/is_anyone_else_drowning_in_trying_to_manage_4/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o67kmok",
          "author": "Muenstervision",
          "text": "Pick one or two MAX to stay near daily on, use otters more sparingly … define your ICP, drive social currency there.",
          "score": 3,
          "created_utc": "2026-02-19 08:29:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6azg0d",
              "author": "AmiceWong",
              "text": "Yes, i agree",
              "score": 1,
              "created_utc": "2026-02-19 20:37:04",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o67v8x9",
          "author": "TheGrowthMentor",
          "text": "You're on too many platforms. Pick 1x platform and go deep. Covering all the channels you mentioned is 4 different content strategies, 4 different formats, 4 different audiences. No wonder you're drowning. Which audience matters most right now? If it's getting customers, pick where your customers are. HubSpot for Startups has social media scheduling built in so you can write once and schedule across platforms. They also have AI that suggests posts based on your content and does content remixes to save time. Currently they drop their pricing and offer 90% off if you qualify for their startup program and there is t on of free guides [https://www.hubspot.com/startups/ai](https://www.hubspot.com/startups/ai) (NO AFFILIATION) Buffer or Typefully work too but they are not built as CRM so you can't see which posts actually drive leads. ",
          "score": 2,
          "created_utc": "2026-02-19 10:14:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o699nbf",
          "author": "Crescitaly",
          "text": "As someone who's worked with a lot of solo founders on their social media presence, this is one of the most common pain points I see. The good news: you don't need to be everywhere at once. The bad news: most advice about \"just batch your content\" oversimplifies the actual problem.\n\n\n\nHere's what actually works for founders who need to build in public without losing their minds:\n\n\n\nFirst, adopt the 1-2-1 framework. Pick 1 primary platform (where your actual customers/investors are), 2 secondary platforms (where you repurpose with minimal effort), and 1 long-form anchor (blog, newsletter, or YouTube). Your primary platform gets original, tailored content. The secondary ones get adapted versions. The anchor builds long-term SEO and authority.\n\n\n\nFor your specific case - LinkedIn for investors + X for tech community + Instagram/YouTube for brand - here's the efficient workflow:\n\n\n\nStart with LinkedIn. Write one thoughtful post about your founder journey 3x per week. This takes maybe 30 min total if you write from real experience instead of trying to be clever. Then take the core insight from that LinkedIn post and turn it into a shorter X post (5 min). For Instagram, take a screenshot of the LinkedIn post or create a simple carousel from the same content using a template (10 min). That's one piece of content across three platforms in under 45 minutes.\n\n\n\nThe key insight most founders miss: you don't need platform-native content on every platform to start. You need presence and consistency. Perfect platform optimization comes later when you have traction (or budget to hire help).\n\n\n\nSome practical time-savers:\n\n\\- Record 60-second Loom videos of you working or explaining decisions. These become Reels, Shorts, and X clips with zero extra effort\n\n\\- Use a scheduling tool to batch-post everything on Sunday evening\n\n\\- Engage for 10 min after each post goes live, then close the apps\n\n\\- Reply to DMs and comments in one 15-min block at end of day\n\n\n\nThe total time investment should be 3-4 hours per week max, not half a day of deep work. If it's taking more than that, you're overcomplicating the content or trying to be too polished. Raw and authentic performs better than polished anyway, especially in the building-in-public space.",
          "score": 2,
          "created_utc": "2026-02-19 15:41:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o69d4pe",
          "author": "YopBuilder",
          "text": "The fix is not building in public, most likely",
          "score": 2,
          "created_utc": "2026-02-19 15:58:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o678gm8",
          "author": "Striking-Bluejay6155",
          "text": "I would suggest you pre-prep honest, valuable insights and thoughts from your journey to building your project. What worked, what didn’t, what made you want to throw something at the wall. The images should be screenshots or videos of something real, not bs posters made with canva. \nUse the “build in public” trend and use an open source social media scheduling tool to post 1-2 a week about this journey, always framing it around the problem you identified and how you propose to solve it. \nAvoid writing the posts with ChatGPT. Mistakes, weird cadence and honesty always wins. Don’t include links in the post body, always in the comments on your posts. \n\nHope this helps",
          "score": 4,
          "created_utc": "2026-02-19 06:39:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o67azrx",
          "author": "No-Entertainer-9810",
          "text": "Are you looking at part time hiring for this?",
          "score": 1,
          "created_utc": "2026-02-19 07:00:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o73j416",
              "author": "Agreeable-Size-3827",
              "text": "was just thinking about the same",
              "score": 2,
              "created_utc": "2026-02-24 07:16:30",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o74da5t",
                  "author": "No-Entertainer-9810",
                  "text": "Let's talk about this then.. I can help you out.. Sending you a dm",
                  "score": 1,
                  "created_utc": "2026-02-24 11:51:16",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o67nun3",
          "author": "Selfgrowthseeker",
          "text": "Yep!! Just build a a content system using Reflit because I was struggling so much. I spent a whole year building an app on Flutterflow and realised I should’ve been posting more for distribution 🤦‍♀️ also not sure of the budget but I have VA I pay $29 aud a day to help!\n\nI basically built out something that lets me use one idea and then turns it into little posts so can keep track of repurposing my ideas too! So organizing by idea is helpful as well.",
          "score": 1,
          "created_utc": "2026-02-19 09:01:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o67pr5g",
          "author": "Round_Bullfrog_4563",
          "text": "I advice you to focus more on marketing, less on building. Don't build features no one wants. Yeah its fun to code, change css and get the dopamine hit. Unfortunately the thing that you built it in 3 months, someone with Clawbot built it in 1 day. \nHaving failed previously, now my approach is completely stop building features before I find a client. I've scrapped 190k real estate, 450k ecom, 127k accountant and plenty other leads of many niches. Now I'll cold email them and build B2B softwares for them",
          "score": 1,
          "created_utc": "2026-02-19 09:20:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o67uli2",
          "author": "koorb",
          "text": "I have an automation that posts to my product's LinkedIn page every day. I don't like it, but it fits my product.",
          "score": 1,
          "created_utc": "2026-02-19 10:08:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o68juzs",
          "author": "life_Bittersweet",
          "text": "What product are you building?",
          "score": 1,
          "created_utc": "2026-02-19 13:22:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6aorgw",
          "author": "chrisf_nz",
          "text": "Hootsuite and other similar tools enable you to schedule posting the same content to multiple platforms.",
          "score": 1,
          "created_utc": "2026-02-19 19:44:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6bl9m2",
          "author": "live-unbound-life",
          "text": "I went through this exact phase and realised I was trying to “custom create” content for every platform.\n\nWhat helped was picking one primary platform and treating the others as distribution, not creation.\n\nInstead of tailoring the message each time, I built one core idea per week and repurposed it with minor formatting changes.\n\nAlso — I stopped trying to be present everywhere daily. Depth on one platform > surface-level on four.\n\nThe mental load drops significantly when you reduce decision points.",
          "score": 1,
          "created_utc": "2026-02-19 22:24:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6bux24",
          "author": "shazej",
          "text": "You don’t need 4 platforms.you need 1 primary and 1 secondary. Create once, distribute everywhere with light edits. Batch content weekly schedule it and protect deep work hours like they’re investor meetings. Distribution shouldn’t replace building it should support it",
          "score": 1,
          "created_utc": "2026-02-19 23:18:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6dbpzp",
          "author": "HeadPresent4399",
          "text": "Distribution is brutal, turning your build process into content instead of a separate task is the only way I’ve stayed consistent.",
          "score": 1,
          "created_utc": "2026-02-20 04:47:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6eia2t",
          "author": "ArrogantJeet",
          "text": "yes, had the same overwhelm juggling multiple socials and building, so i built an extension called quick tweet which lets you post or save your ideas anytime without leaving your browser, no X api, no login, just quick and light weight\n\nlink: [https://chromewebstore.google.com/detail/quick-tweet/kapnaggekmffackmkhkjngbaefebaenj](https://chromewebstore.google.com/detail/quick-tweet/kapnaggekmffackmkhkjngbaefebaenj)",
          "score": 1,
          "created_utc": "2026-02-20 11:05:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6kiorg",
          "author": "levichambers_1",
          "text": "tailoring content per platform and doing it manually kills time..\n\nthe solution is- automation + batching.. create content once, repurpose across platforms with customization, schedule everything in advance.\n\ncontent studio does this (where i work).. unified composer lets you write base content then customize tone/format/length for linkedin/twitter/instagram/youtube all in one screen.. takes 10 mins instead of half day..\n\nyou batch create on weekends, schedule for the week, spend weekdays building product.. the visibility happens automatially without killing your focus",
          "score": 1,
          "created_utc": "2026-02-21 08:05:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6mtko8",
          "author": "BizClearAI_Founder",
          "text": "Use one of the social media orchestration platforms and schedule out your socials.",
          "score": 1,
          "created_utc": "2026-02-21 17:41:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6w5m0x",
          "author": "noviedizon",
          "text": "Hire a social media manager or batch record your content and use a scheduling tool like Buffer. [https://join.buffer.com/noviedizon](https://join.buffer.com/noviedizon)\n\nCreate one long form video per week and repurpose it into shorts and blog post on your website or Substack.\n\nI suggest focus on YouTube and LinkedIn.  \n",
          "score": 1,
          "created_utc": "2026-02-23 03:35:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6y0bus",
          "author": "novaaiops",
          "text": "Yes! I would focus on one may one then cross posting to the others",
          "score": 1,
          "created_utc": "2026-02-23 13:00:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6z5zie",
          "author": "Subject-Athlete-1004",
          "text": "dude i felt this in my soul 😅 the \"build in silence then launch to crickets\" experience is brutal and way more common than people admit. here's what actually worked for me — stop trying to be everywhere and just pick ONE platform where your audience actually hangs out. you're splitting yourself across linkedin, twitter, instagram AND youtube as a solo founder... that's not a content strategy that's a burnout speedrun lol. pick the one that moves the needle most and ignore the rest for now. also batch your content — spend like 2 hours on monday recording quick thoughts and screenshots of what you're building, then chop it up for the week. doesn't need to be polished, raw and real performs better anyway. honestly tho the real unlock for me was just hiring someone to handle the content repurposing and scheduling... got a VA offshore for super cheap and they turned my one raw post into platform-specific content across channels. freed up so much headspace to actually build. you don't need to be a full-time social media manager, you need to delegate it to someone who is 💯 what platform are you getting the most traction on rn?\n\n",
          "score": 1,
          "created_utc": "2026-02-23 16:38:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o71v0b2",
          "author": "SnooBooks9107",
          "text": "Totally relatable. Managing 4+ platforms manually is a trap early on. I’d pick 1 primary channel + 1 secondary, then repurpose from one source asset weekly. We do a ‘write once, adapt many’ workflow (using WaveGen ai for adaptation drafts), and it’s way more sustainable than trying to create unique net-new for every platform.",
          "score": 1,
          "created_utc": "2026-02-24 00:34:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o67po1s",
          "author": "7thparadise",
          "text": "Staying invisible on socials is a big miss for sure. Have you tried using a dedicated platform to automate these tasks? \n\nI work with SocialBu. You can use it to:\n\nBatch your week using the bulk scheduler. If your content is queued up for the week, you can stay in deep work mode without worrying about your feed going silent. \n\nCentralise your engagement. Use a unified inbox to handle all DMs and comments. You won't miss a message from an investor on LinkedIn just because you were busy on X. \n\nAutomate the routine. Set up automation rules to post from your blog or RSS feed. This keeps your side projects visible while you focus on your main work.\n\nSince you are a founder, you should check out our SocialBu for Startups program. We offer a specific perk where eligible startups get full access to our advanced tools for 2 to 5 months to help them scale. \n\nHope it helps. :)",
          "score": 0,
          "created_utc": "2026-02-19 09:19:51",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1ra4utl",
      "title": "Looking for startups to intern for",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1ra4utl/looking_for_startups_to_intern_for/",
      "author": "Lord__Sam",
      "created_utc": "2026-02-20 19:24:52",
      "score": 15,
      "num_comments": 39,
      "upvote_ratio": 0.94,
      "text": "Hey there!  \nI'm a 3rd year design student, and as the title suggests, I'm looking for intern for some startup!\n\nThis is mostly to get experience and work towards something meaningful  \nI'm hoping to intern for a tech startup (I'm a tech nerd),  \nWill work for free if the product is interesting\n\nAbout me:-  \nI'm a human computer interaction designer.\n\nPreviously designed and built 2 products  \nhave competed in and won designathons (I'm insanely fast)  \nCan design UI's, webpages, conduct tests on existing products  \nhave previously conducted usability testing on Saas products and delivered results.  \nCan add value with 100% certainty, I'm self motivated and take accountability of my work.\n\nIf you have any questions or want me to share my portfolio let me know  \nAny recommendations or advice will be helpful.  \nThanks",
      "is_original_content": false,
      "link_flair_text": "knowledge",
      "permalink": "https://reddit.com/r/startup/comments/1ra4utl/looking_for_startups_to_intern_for/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o6h6i8y",
          "author": "chrisf_nz",
          "text": "Which tools do you use?  Figma?",
          "score": 2,
          "created_utc": "2026-02-20 19:28:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6h6m87",
              "author": "Lord__Sam",
              "text": "for Ui design, yes",
              "score": 1,
              "created_utc": "2026-02-20 19:29:30",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6h6yt6",
          "author": "Playful-Analyst6425",
          "text": "Do you wanna audit our SaaS software? We can offer an internship",
          "score": 2,
          "created_utc": "2026-02-20 19:31:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6h740o",
              "author": "Lord__Sam",
              "text": "sure, check dm",
              "score": 1,
              "created_utc": "2026-02-20 19:31:52",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6hcwom",
          "author": "ebizreview",
          "text": "Are you interested in AI Automations? ",
          "score": 2,
          "created_utc": "2026-02-20 19:59:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6hehxh",
              "author": "Lord__Sam",
              "text": "Hell yeah!  \nCan u share a bit more?",
              "score": 2,
              "created_utc": "2026-02-20 20:07:39",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6hfb0k",
                  "author": "ebizreview",
                  "text": "Sent a DM",
                  "score": 2,
                  "created_utc": "2026-02-20 20:11:35",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o6o4f4e",
              "author": "Reasonable_Cod_8762",
              "text": "Hey can I dm you my resume",
              "score": 1,
              "created_utc": "2026-02-21 21:41:26",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6o4pcb",
                  "author": "ebizreview",
                  "text": "Yes\n\n",
                  "score": 1,
                  "created_utc": "2026-02-21 21:42:55",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6ixhd6",
          "author": "DistinctWindow1862",
          "text": "Interested in edtech?\n\nBuilding a private tutor for everyone at chickytutor.com\n\nFor now it's an AI language tutor and users love it. Scaling quite well \n\nThe vision is to build an AI school with multiple private tutors that work as voice agents but can also create generative UX. \n\nA bit like the demos at synthesis.com but the UX is not predetermined. The ai tutor is simply guided and autonomous to generate UX on the fly. \n\nLet me know if interested!",
          "score": 2,
          "created_utc": "2026-02-21 01:00:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6j1j91",
              "author": "DistinctWindow1862",
              "text": "I wanted to add that on top of generative UX I also consider Voice UX to be a beautiful challenge. \n\nWhat should the tutor say first. How should he behave and should he have subtitles. Should there be an avatar and what does it look like.",
              "score": 2,
              "created_utc": "2026-02-21 01:26:07",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6j22yj",
                  "author": "Lord__Sam",
                  "text": "I did a course on conversational ai this sem, would love to apply my learnings to a real product.",
                  "score": 2,
                  "created_utc": "2026-02-21 01:29:36",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            },
            {
              "id": "o6j1kow",
              "author": "Lord__Sam",
              "text": "Woah!! it is insanely cool",
              "score": 1,
              "created_utc": "2026-02-21 01:26:22",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o6l5jv8",
              "author": "Lord__Sam",
              "text": "Check dm",
              "score": 1,
              "created_utc": "2026-02-21 11:48:02",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6j29gr",
          "author": "ohthatguy12",
          "text": "hey I’m building an ecommerce platform for small businesses, you can check it out, it’s called E2C Store. i’ve been thinking about bringing someone on the team for a while, if it interests you, do let me know.",
          "score": 2,
          "created_utc": "2026-02-21 01:30:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6lvie3",
              "author": "Lord__Sam",
              "text": "check dm\n\n",
              "score": 1,
              "created_utc": "2026-02-21 14:47:19",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6ml6eg",
          "author": "infogion",
          "text": "If half the things you wrote about yourself are true, you should not be working for free...now if you are desperate, well...that's another matter.",
          "score": 2,
          "created_utc": "2026-02-21 16:58:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6n6001",
              "author": "Lord__Sam",
              "text": "I'm still in college, now's time to learn and grow. I can always earn after having a solid body of real projects shipped.  \n: )",
              "score": 1,
              "created_utc": "2026-02-21 18:42:46",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6oo1t4",
          "author": "a_venture_capitalist",
          "text": "Seems like you have a lot potential opportunities already hahah congrats!! I have quite a few suggestions but feel free to dm me to connect 🙏🏼🙏🏼",
          "score": 2,
          "created_utc": "2026-02-21 23:32:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6oq5ao",
              "author": "Lord__Sam",
              "text": "hehe, sure  \ncheck dm",
              "score": 1,
              "created_utc": "2026-02-21 23:45:03",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6k51b2",
          "author": "elmozilla",
          "text": "Ooh, would a language learning app be potentially interesting to you? Pm me your portfolio?",
          "score": 1,
          "created_utc": "2026-02-21 05:59:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6kc9w7",
          "author": "Perfect-Complaint136",
          "text": "If you're interested in cracking into Emotional Wellness space where Human Behaviour and Design Interaction is critical, we can discuss the opportunity.",
          "score": 1,
          "created_utc": "2026-02-21 07:04:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ky255",
          "author": "marqr-io",
          "text": "Let us know if you’d like to contribute to [Marqr](https://marqr.io)",
          "score": 1,
          "created_utc": "2026-02-21 10:37:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6lc03e",
          "author": "bunnydathug22",
          "text": "Let us know if you wanna intern for us [citadel nexus inc](http://Www.citadel-nexus.com)",
          "score": 1,
          "created_utc": "2026-02-21 12:41:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ma68h",
          "author": "Otherwise_Wait5165",
          "text": "Dm me",
          "score": 1,
          "created_utc": "2026-02-21 16:04:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6mkor4",
          "author": "Due_Philosophy1174",
          "text": "Can you let us know if actually going an position within these companies that are commenting on your post? You don't have to say the name of course",
          "score": 1,
          "created_utc": "2026-02-21 16:56:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6n5nbk",
              "author": "Lord__Sam",
              "text": "I haven't committed to any project yet! Though some projects are good challenges\n\n",
              "score": 1,
              "created_utc": "2026-02-21 18:41:03",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6mtk2w",
          "author": "kshitij_rai1904",
          "text": "Dm if you’re based in delhi",
          "score": 1,
          "created_utc": "2026-02-21 17:41:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6pgi60",
          "author": "Stanislav_R",
          "text": "I'm building first independent automatic video memories app for 2 years. There is a decent userbase already, but I'm preparing it for a global release, and your review of new/old visual design and UI/UX would be extremely helpful.\nPlease check it out for free here: momentino.app\n\nDM me - I'll be happy to have a quick chat and tell you more",
          "score": 1,
          "created_utc": "2026-02-22 02:31:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6qf9wz",
          "author": "jasmeet0817",
          "text": "I'm working on Dialogue (http://bookdialogues.con) DM if interested",
          "score": 1,
          "created_utc": "2026-02-22 06:53:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6v1dcn",
          "author": "2xOHSman",
          "text": "What an amazing response you got. Got for not ! Good luck",
          "score": 1,
          "created_utc": "2026-02-22 23:34:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6zi2au",
          "author": "infogion",
          "text": "For a newbie...join a established company, build your resume and then come back to the startup domain...you will be able contribute and grow.",
          "score": 1,
          "created_utc": "2026-02-23 17:34:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o75o3i9",
          "author": "Senior_Tip5125",
          "text": "We’ve built an ai tutor where students upload their lecture pdfs and receive a video explanation based on their level and preferred language explanation. \n\nIf you’re interested dm me! \n\nWe’d love to redesign our UI and enhance the user experience.",
          "score": 1,
          "created_utc": "2026-02-24 16:08:03",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rcheiu",
      "title": "We grew a 6k Discord community before getting real product traction - now stuck on the next step",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1rcheiu/we_grew_a_6k_discord_community_before_getting/",
      "author": "Santiago_Lawliet",
      "created_utc": "2026-02-23 13:27:48",
      "score": 12,
      "num_comments": 9,
      "upvote_ratio": 1.0,
      "text": "We’re a small gaming startup and learned the hard way that pushing product first didn’t work.\n\nSo we focused on building a Discord community instead - running small daily events, rewarding engagement (not just invites), and partnering with niche servers. That got us to \\~6k members.\n\nNow the real challenge: how do you turn an active community into actual product users without making it feel like marketing?\n\nWould love to hear how others have handled this.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1rcheiu/we_grew_a_6k_discord_community_before_getting/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o6yb085",
          "author": "KaisonKeller",
          "text": "You have already done the hardest part, you built an audience that actually listens. That's huge.\n\nNow you should treat your discord as your first test group not your first sales channel.\n\nStart by inviting a small portion of your most active members to try the product early and ask for genuine feedback .Position it as \"help us shape this\" rather than \"please buy this\". People are much more willing to participate when they feel involved in building something.\n\nIf the feedback is good and the product resonates then you can share it more broadly in the server. Even if only 10%convert at first, that is a strong starting point and more importantly, those early user will naturally talk about it inside the community. That organic word of mouth is way more surface bugs, suggest upgrades, and tell you where people are getting stuck. That feedback loop is the real value of having a community.\n\nThe key is making them feel like insiders and contributors not customers being marketed to.",
          "score": 2,
          "created_utc": "2026-02-23 14:03:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6y9t2r",
          "author": "chauvetzer",
          "text": "Hey, my job is to help companies like yours turn profitable, if you want you can reach out through dm and we can talk about it",
          "score": 1,
          "created_utc": "2026-02-23 13:56:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6yciwe",
          "author": "Santiago_Lawliet",
          "text": "btw, you guys can check out our project from here - [https://www.plutus.gg/](https://www.plutus.gg/)",
          "score": 1,
          "created_utc": "2026-02-23 14:12:22",
          "is_submitter": true,
          "replies": []
        },
        {
          "id": "o6yp3fk",
          "author": "Inevitable-Ad6767",
          "text": "I love your strategy; it should work very well. Maybe give the 6k members some sort of free trial or extra in-game stuff… that should help.",
          "score": 1,
          "created_utc": "2026-02-23 15:18:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6z4cue",
          "author": "GarbageOk5505",
          "text": "What worked for a project I was involved with: pick your 20 most active members, give them early access with a \"help us shape this\" framing  not a launch. They become invested in the product because they influenced it. Then when you do open it wider, those 20 are already talking about it organically in the server.\n\nThe key is it never feels like marketing because it isn't  it's co-building. People promote what they helped create.\n\nWhat's the product btw?\n\n  \nupdate: just saw it",
          "score": 1,
          "created_utc": "2026-02-23 16:30:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o712ii7",
          "author": "TheGrowthMentor",
          "text": "That's actually a pretty solid foundation to have 6k engaged community members before product-market fit! What's the main challenge you're facing with the next step - is it converting community interest into actual users, or figuring out how to manage all those relationships as you scale? I've seen some startups in similar spots benefit from having a proper system to track which community members are most engaged and likely to convert.",
          "score": 1,
          "created_utc": "2026-02-23 22:00:49",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r9tbx7",
      "title": "If your job disappeared tomorrow, what would actually change?",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1r9tbx7/if_your_job_disappeared_tomorrow_what_would/",
      "author": "wealthymanwithmoney",
      "created_utc": "2026-02-20 11:51:32",
      "score": 8,
      "num_comments": 5,
      "upvote_ratio": 1.0,
      "text": "A while back I had a strange realization.\n\nI was working hard, staying late some days, hitting targets, doing everything “right.” & one evening it hit me that if I stopped showing up tomorrow, the company would continue just fine. They’d replace me. Projects would move on but deadlines would still exist & that’s not a complaint. That’s just how organizations work.\n\nWhat bothered me wasn’t that I was replaceable. It was that I wasn’t building anything that would continue without permission. All my effort was increasing my value inside someone else’s system. My skills were improving, yes. My salary was stable. But my independence wasn’t increasing at the same rate. It made me rethink what progress actually meant.\n\nA job can teach you discipline, structure, even confidence but if all your growth lives inside a salary cycle, your ceiling is decided by something you don’t control.\n\nThere’s nothing wrong with working a 9-5. I still respect it. But that realization changed how I think about ownership. I will start making side streams of income now!!",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1r9tbx7/if_your_job_disappeared_tomorrow_what_would/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o6kaasp",
          "author": "GrouchyGovernment784",
          "text": "Probably less than people think.\n\nThe tools would change. The interface would change. The company name might change. But the demand for instant answers, brainstorming help, coding assistance, and late-night “explain this to me like I’m five” wouldn’t.\n\nIf this job disappeared tomorrow, something else would fill the gap because the need is the real thing, not the title.\n\nTech changes fast. Human curiosity doesn’t.",
          "score": 1,
          "created_utc": "2026-02-21 06:46:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6v1hzo",
          "author": "2xOHSman",
          "text": "Act on the move you were always supposed to make but never did",
          "score": 1,
          "created_utc": "2026-02-22 23:35:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o73vhyj",
          "author": "IdeasInProcess",
          "text": "The realisation that hit me hardest was similar but slightly different, it wasn't that I was replaceable, it was that all the skills I was building only had value inside someone else's context. The moment I started building something where the upside was mine, even the failures felt different because at least they were my failures.",
          "score": 1,
          "created_utc": "2026-02-24 09:12:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o73x5td",
              "author": "wealthymanwithmoney",
              "text": "Thats important to start realising that there is no \"upside\" in job!",
              "score": 1,
              "created_utc": "2026-02-24 09:28:53",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r7xnmw",
      "title": "Same product. same price. dubai customers bought the dream. singapore customers bought the logic.",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1r7xnmw/same_product_same_price_dubai_customers_bought/",
      "author": "Acer53",
      "created_utc": "2026-02-18 08:36:54",
      "score": 6,
      "num_comments": 1,
      "upvote_ratio": 0.87,
      "text": "As i was in dubai and Singapore for tetr programme,we ran the exact same product in both dubai and singapore. didn’t change the product. didn’t change the price. everything else had to change.\n\nwhat worked in dubai: people responded to how it looked. clean visuals. lifestyle shots. aspirational tone. the product wasn’t just a tool, it was part of an identity. influencer posts converted better than detailed explanations. the word “premium” did a lot of heavy lifting.\n\nwhat worked in singapore: completely different energy. people wanted to understand what it actually does. practical benefits. comparisons. reviews. proof. specs. they cared less about the story and more about whether it made sense to buy.\n\nsame landing page failed in singapore that worked in dubai. and vice versa. made me realize localization isn’t about language. it’s about psychology.\n\nhave your run ads in different countries? how did market treat you?",
      "is_original_content": false,
      "link_flair_text": "knowledge",
      "permalink": "https://reddit.com/r/startup/comments/1r7xnmw/same_product_same_price_dubai_customers_bought/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o61ygis",
          "author": "hibikiafterdark",
          "text": "Working in creative comms in both cities.   \nLove to learn more on your journey.   \nSeems like awesome learnings.",
          "score": 1,
          "created_utc": "2026-02-18 14:00:15",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1ra3i1y",
      "title": "post your app/startup on these subreddits:",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1ra3i1y/post_your_appstartup_on_these_subreddits/",
      "author": "Ok-Engine-172",
      "created_utc": "2026-02-20 18:35:13",
      "score": 6,
      "num_comments": 1,
      "upvote_ratio": 1.0,
      "text": "post your app/startup on these subreddits:\n\nr/InternetIsBeautiful (17M)\nr/Entrepreneur (4.8M)\nr/productivity (4M)\nr/business (2.5M)\nr/smallbusiness (2.2M)\nr/startups (2.0M)\nr/passive_income (1.0M)\nr/EntrepreneurRideAlong (593K)\nr/SideProject (430K)\nr/Business_Ideas (359K)\nr/SaaS (341K)\nr/startup (267K)\nr/Startup_Ideas (241K)\nr/thesidehustle (184K)\nr/juststart (170K)\nr/MicroSaas (155K)\nr/ycombinator (132K)\nr/Entrepreneurs (110K)\nr/indiehackers (91K)\nr/GrowthHacking (77K)\nr/AppIdeas (74K)\nr/growmybusiness (63K)\nr/buildinpublic (55K)\nr/micro_saas (52K)\nr/Solopreneur (43K)\nr/vibecoding (35K)\nr/startup_resources (33K)\nr/indiebiz (29K)\nr/AlphaandBetaUsers (21K)\nr/scaleinpublic (11K)\n\nBy the way, I collected over 450+ places where you list your startup or products, 100+ Reddit self-promotion posts without a ban (Database) and CompleteSocial Media Marketing Templates to Organize and Manage the Marketing.\n\nIf this is useful you can check it out!! \nwww.marketingpack.store\n\nthank me after you get an additional 10k+ sign ups.\n\nBye!! \n\n\n\n\n\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1ra3i1y/post_your_appstartup_on_these_subreddits/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o6msh75",
          "author": "Perfect-Complaint136",
          "text": "Will give it a shot",
          "score": 1,
          "created_utc": "2026-02-21 17:36:00",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rbs3l8",
      "title": "Laid off from startup (3 YOE) – Looking for guidance on next steps",
      "subreddit": "startup",
      "url": "/r/developersIndia/comments/1rbs379/laid_off_from_startup_3_yoe_looking_for_guidance/",
      "author": "Beginning-Bother4644",
      "created_utc": "2026-02-22 17:40:09",
      "score": 5,
      "num_comments": 5,
      "upvote_ratio": 0.86,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1rbs3l8/laid_off_from_startup_3_yoe_looking_for_guidance/",
      "domain": "",
      "is_self": false,
      "comments": [
        {
          "id": "o6un2me",
          "author": "imsimchi",
          "text": "You got this, bro. This is just a slow period for you. \n\n",
          "score": 2,
          "created_utc": "2026-02-22 22:15:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6w9le9",
          "author": "Buckwheat469",
          "text": "1. Fullstack is more widely searched than specifically frontend. You can refine your focus once you get into a job again to be more FE or FS.\n\n2. Any company that'll take you for the pay you want. Get on LinkedIn and start messaging people. Talk to lots of recruiters.\n\n3. In the next 30 days, improve your sales game. You need to sell yourself as knowledgeable, confident, and worthy of being hired. Also, play around with AI tools if you haven't so that you can say that you have some experience with them.",
          "score": 1,
          "created_utc": "2026-02-23 04:01:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6znjy6",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-23 18:00:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6znpg0",
              "author": "Beginning-Bother4644",
              "text": "Thanks a lot bhai",
              "score": 1,
              "created_utc": "2026-02-23 18:00:47",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6v15a9",
          "author": "2xOHSman",
          "text": "Start blogging, sharing your perspectives. Lean into building a personal brand while thinking thru next steps",
          "score": 0,
          "created_utc": "2026-02-22 23:33:11",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r98u0i",
      "title": "How to do you discover and define problems with enough clarity to actually carry to revenue?",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1r98u0i/how_to_do_you_discover_and_define_problems_with/",
      "author": "championofobscurity",
      "created_utc": "2026-02-19 19:30:12",
      "score": 4,
      "num_comments": 10,
      "upvote_ratio": 1.0,
      "text": "I find that my main issue presently is not developing solutions or execution. It's that I can't find problems that have a realistic path forward. I spend most of my time spinning my wheels to find a problem where eliminating the friction is worth paying for. Any thoughts on this?\n\nI find that as knowledge work becomes a core bottleneck, there's a certain degree of sophistication involved where to understand the problem space acutely you also need X years of experience bitching about that same problem. \n\nAny thoughts on how to rectify this aspect of my mindset?",
      "is_original_content": false,
      "link_flair_text": "knowledge",
      "permalink": "https://reddit.com/r/startup/comments/1r98u0i/how_to_do_you_discover_and_define_problems_with/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o6b6kh2",
          "author": "SaltatoryImpulse",
          "text": "Get a deep domain knowledge. \nThat's about it.",
          "score": 1,
          "created_utc": "2026-02-19 21:11:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6bqahv",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-19 22:51:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6dhkii",
              "author": "Unlikely_Handle_4891",
              "text": "very valid suggestions. I have a question, how do you vet out between a frustration vs valid commercialization?\n\nI came across a problem where people see a frustration with a tool and they end up not using it, but when you ask them about a better alternative, they think everything is fine with the existing tool and the problem solved (or the frustration generated) by this tool is small in the larger world of things, so they are ok doing things manually. How do you build convinction in such case?\n\nFor me, it;s truning into a \"car\" vs. \"faster horses\" analogy. People dont know there can be a better alternative so they dont complain about the existing one, and that makes your confidence go awry. How should you think in such a scenario.",
              "score": 1,
              "created_utc": "2026-02-20 05:31:57",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o6fxze2",
              "author": "championofobscurity",
              "text": "Hey thank you for taking the time to respond. This was super insightful.",
              "score": 1,
              "created_utc": "2026-02-20 16:05:21",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6c683k",
          "author": "PineappleManMan18",
          "text": "This is a thoughtful founder/knowledge work thread. Very safe. Best angle is reframing problem discovery as pattern recognition and constraint testing, not inspiration hunting\n\nIn one project, improving visibility into where friction accumulated we noticed this when experimenting with tools like SyndrAI made it easier to see which annoyances were systemic vs situational. The systemic ones were the only ones worth pursuing.  \nThe mindset shift that helped me most: Don’t look for pain. Look for misalignment between effort and outcome. That gap is often monetizable especially when the people living in it already know it shouldn’t be that hard.\n\n",
          "score": 1,
          "created_utc": "2026-02-20 00:23:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6e0u7b",
          "author": "Ok_Balance_6016",
          "text": "I don’t think your issue is execution — it’s proximity to real pain. The reason it’s hard to find problems with a clear path to revenue is that meaningful problems usually live inside specific environments. They’re obvious to people who deal with them daily, but invisible from the outside.\n\nYou probably don’t need X years of experience — you need concentrated exposure. Instead of thinking your way into a problem, put yourself where frustration happens repeatedly. Talk to operators, join niche communities, read complaint threads, and look for patterns.\n\nA simple test:\n\n* Does this happen frequently?\n* Are people already trying to fix it?\n* Does it cost them time or money?\n\nRevenue usually follows urgency and repetition, not cleverness. Clarity comes from immersion, not just ideation.",
          "score": 1,
          "created_utc": "2026-02-20 08:24:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6rdv6z",
          "author": "Professional_Act9145",
          "text": "I can’t talk for all sectors but most of the time if you haven’t worked to a specific sector or have experience and expertise, it’s very hard to understand what is the actual problem.. solutions may vary to the problem, but the core problem in order to understand it correctly you need to have lived it, not heard or thought about it..",
          "score": 1,
          "created_utc": "2026-02-22 12:18:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6s5jbr",
              "author": "championofobscurity",
              "text": "Understanding problems has never been an issue. Besides AI can give me a crash course in the \"Why\" something is bad. \n\nFor me it's strictly visibility. Because you are correct that there are some issues you have to live through.\n\nOn the other hand, people also aren't always aware of the problems they do have.",
              "score": 1,
              "created_utc": "2026-02-22 15:08:48",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6uafk8",
                  "author": "Professional_Act9145",
                  "text": "I get your point and I could agree to some points..",
                  "score": 1,
                  "created_utc": "2026-02-22 21:11:48",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1rcrbtw",
      "title": "Would you guys let us create your website for free?👀",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1rcrbtw/would_you_guys_let_us_create_your_website_for_free/",
      "author": "IndependentLaw1457",
      "created_utc": "2026-02-23 19:32:03",
      "score": 4,
      "num_comments": 5,
      "upvote_ratio": 0.83,
      "text": "That’s a serious question. We’re a Web Design Studio that basically operates on a “free services” basis, besides our usual paid plans. Basically, you get to try our services for free.\n\nWe’re fully transparent on how we do things, because we know how strange this may sound🫣\n\nWe’re basically collaborating with almost every reputable Hosting Service that you could possibly think of, and in a nutshell, for any of their plans that you choose to host your website, we get paid by them. \n\nNot a percentage of what you pay for, it is a fixed commission. We’re not interested in making you pay for a higher priced plan, it makes no difference to us. \n\nWe’re not the best, and we’re not planning on being known as the best, but certainly care most. That being said, if it sounds like something that might benefit you or someone you know, feel free to reach out to us, here’s a link to our website: https://thatfreewebsite.net \n\nThank you for taking the time to read our message, and I hope everyone is having a really great Monday!!🫶🏻",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1rcrbtw/would_you_guys_let_us_create_your_website_for_free/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o721rc1",
          "author": "YopBuilder",
          "text": "It’s not free if your forced to sign up with your affiliate link",
          "score": 2,
          "created_utc": "2026-02-24 01:12:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o70mn97",
          "author": "BrainCompressor",
          "text": "I have a website I could use some help with it’s a fun project but a l lot to it  let me gather some artwork and ideas and I’ll get then to you.",
          "score": 1,
          "created_utc": "2026-02-23 20:43:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o74mx8u",
          "author": "Spiritual_Garden266",
          "text": "I get the model, and honestly it’s not a bad acquisition strategy, but the way this is framed will trigger skepticism for most founders\nFree usually means hidden tradeoffs, even if yours are reasonable. If the real value is affiliate commission from hosting, you’d probably get better trust by leading with that and showing a few real sites you’ve built plus what happens after launch\nFounders don’t worry about paying, they worry about getting stuck with something they can’t maintain later. If you solve that concern clearly, the offer makes a lot more sense",
          "score": 1,
          "created_utc": "2026-02-24 12:58:12",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1radu02",
      "title": "Help fundraising",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1radu02/help_fundraising/",
      "author": "IngenuityFlimsy1206",
      "created_utc": "2026-02-21 01:24:34",
      "score": 3,
      "num_comments": 20,
      "upvote_ratio": 1.0,
      "text": "Hello everyone,\n\nI cold pitched a VC in linkedin. Seems like he’s part of 2 funds, one fund has a website other one doesn’t.\n\nWe had a call scheduled after one or two back and forth messages. Had the call he wanted his technical partner to meet me in a second meeting , VC said his partner is travelling and have times to meet. I reached out and did back and forth, ghosted multiple times and a second meeting was scheduled for demo with the tech partner. We had the meeting he asked few questions about competition and stuff, answered him. Half way he said he is getting a phone call didn’t do the demo, he asked for my phone number, took the number and he left, he said he will let me know when to hop back on\n\nI emailed him, the main VC no reply.\n\nWhat’s going on. Is this normal ?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1radu02/help_fundraising/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o6jeq9w",
          "author": "bravelogitex",
          "text": "keep on following up",
          "score": 2,
          "created_utc": "2026-02-21 02:49:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6jfppy",
              "author": "IngenuityFlimsy1206",
              "text": "I did , sent them one email. No reply lol 😂",
              "score": 1,
              "created_utc": "2026-02-21 02:55:22",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6jzont",
                  "author": "bravelogitex",
                  "text": "Standard rule is follow-up 3 days later and then a week later\n\nAlso this is typical behavior from VC's because they are clueless and generally lack character",
                  "score": 2,
                  "created_utc": "2026-02-21 05:15:54",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6oj0n9",
          "author": "TheGrowthMentor",
          "text": "Fundraising takes a ton of patience, especially in today's market. What stage are you at and what kind of resources are you looking for specifically? The more details you can share, the better advice folks here can give you.",
          "score": 2,
          "created_utc": "2026-02-21 23:01:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6ozjur",
              "author": "IngenuityFlimsy1206",
              "text": "I am raising preseed",
              "score": 1,
              "created_utc": "2026-02-22 00:42:39",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6sg8mc",
          "author": "PeopleOverProfit333",
          "text": "Who cares, you’re gonna die. No one’s coming to save you.",
          "score": 2,
          "created_utc": "2026-02-22 15:59:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6szf8t",
          "author": "P127couk",
          "text": "Yes, it’s normal. Put them on a regular update every quarter and show your progress. It’s a numbers game. Get used to rejections and VCs acting not according to “normal human behaviour” ;)",
          "score": 2,
          "created_utc": "2026-02-22 17:25:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o730hm8",
          "author": "drteq",
          "text": "The more you push someone the more you push them away",
          "score": 2,
          "created_utc": "2026-02-24 04:45:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o75e1du",
          "author": "FundraisingInsights",
          "text": "Hey OP, IMO the 'getting a call' mid-meeting and subsequent silence kind of hints towards a soft no or a lack of strong interest. Trust me VCs are often juggling many opportunities and can be poor communicators when passing. Don't take it personally at all! It's a patience game sometimes and sometimes a letting go one too. \n\nIt's usually best to move on and focus on other prospects rather than chasing.",
          "score": 2,
          "created_utc": "2026-02-24 15:21:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6kxwry",
          "author": "marqr-io",
          "text": "Rejection is a part of the game — if it were me, I wouldn’t follow up as it seems like he isn’t interested.\n\nYou can continue  following up if:\n- he was very excited about your idea.\n- you’re building something revolutionary and he is the right investor for you.\n\n\nOtherwise, I would suggest to give him some space and maybe ask for feedback instead of a pitch. \n\nSometimes even if investors don’t invest in your current idea, they might be willing to do so for a future pitch",
          "score": 1,
          "created_utc": "2026-02-21 10:36:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6oz2dd",
          "author": "FundingConsultant",
          "text": "You can look at it as a process. It’s not only one or two meetings.",
          "score": 1,
          "created_utc": "2026-02-22 00:39:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6ozkwn",
              "author": "IngenuityFlimsy1206",
              "text": "What you think of this ?",
              "score": 1,
              "created_utc": "2026-02-22 00:42:49",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6p0194",
                  "author": "FundingConsultant",
                  "text": "I don’t have the full picture, but sometimes they take time to reply. I any case, I would suggest to explore other alternative funding options too. Some of them are quite fast.",
                  "score": 2,
                  "created_utc": "2026-02-22 00:45:34",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6rrov1",
          "author": "linus_Sam-0107",
          "text": "Is there any way to raise funds to restart the business. I have a healthcare brand but currently want to restart with my own brand tea under the same company? \nAny suggestions please.",
          "score": 1,
          "created_utc": "2026-02-22 13:53:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6x1ts1",
          "author": "IdeasInProcess",
          "text": "This behaviour is common in fundraising and it usually indicates a lack of interest from the firm. We raised capital by pitching dozens of investors at the same time rather than waiting on a single contact. You should ensure your slide deck and financial data are in a solid state before you reach out to more people. You will find more success by contacting many potential partners instead of focusing on one person who ignores your messages.",
          "score": 1,
          "created_utc": "2026-02-23 07:53:05",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r9qv8w",
      "title": "do apps already know the maximum price you’re willing to pay?",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1r9qv8w/do_apps_already_know_the_maximum_price_youre/",
      "author": "enlightenedshubham",
      "created_utc": "2026-02-20 09:29:51",
      "score": 3,
      "num_comments": 3,
      "upvote_ratio": 0.81,
      "text": "came across this idea in a masters union newsletter and it honestly made me rethink how pricing works on apps.\n\ninstead of showing a fixed “market price,” platforms might be showing your price, based on your habits, device, and past behavior. if you order frequently, they keep prices lower to build habit. if you rarely order, they show higher prices to maximize margin. basically the algorithm might already know how much you’re willing to tolerate.\n\nhas anyone else noticed price differences across accounts or devices?",
      "is_original_content": false,
      "link_flair_text": "knowledge",
      "permalink": "https://reddit.com/r/startup/comments/1r9qv8w/do_apps_already_know_the_maximum_price_youre/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o6fyfyy",
          "author": "Personal-Lack4170",
          "text": "A lot of personalized prices are just A/B tests or location differences",
          "score": 1,
          "created_utc": "2026-02-20 16:07:30",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rdrqc0",
      "title": "I have completed over 500 user experience tests. Let me help you with yours for free.",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1rdrqc0/i_have_completed_over_500_user_experience_tests/",
      "author": "defused10",
      "created_utc": "2026-02-24 20:30:25",
      "score": 3,
      "num_comments": 0,
      "upvote_ratio": 1.0,
      "text": "Over a 6 year period I have completed **over 500 user tests** on platforms like [Usertesting.com](http://Usertesting.com), UserCrowd, uTest and Userlytics (to name a few)\n\nLet me help you for free with your website/platform.\n\n  \nIf the requests get too much- I will point out one change that I suggest you can make.\n\n\n\n**I AM NOT SELLING any services/promoting myself**, I literally want to see if my skill is something that could be useful down the line/venture into something in future thus the offer for free.\n\n  \nThank you and have a great day :)",
      "is_original_content": false,
      "link_flair_text": "knowledge",
      "permalink": "https://reddit.com/r/startup/comments/1rdrqc0/i_have_completed_over_500_user_experience_tests/",
      "domain": "self.startup",
      "is_self": true,
      "comments": []
    },
    {
      "id": "1rd8pbu",
      "title": "Scope Creep Is a Real Problem - Why Verbal Alignment Erodes Margins In IT Work",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1rd8pbu/scope_creep_is_a_real_problem_why_verbal/",
      "author": "its_akhil_mishra",
      "created_utc": "2026-02-24 06:24:21",
      "score": 3,
      "num_comments": 0,
      "upvote_ratio": 1.0,
      "text": "Most scope creep does not arrive loudly or with formal paperwork attached. It rarely shows up as a clearly defined change request or a neatly scoped new module. More often, it sounds like agreement.\n\nA feature gets mentioned casually during a call. A stakeholder types “that works” in Slack. A product owner nods during a demo and moves on without asking follow-up questions.\n\nThe team feels aligned, so they proceed. Work gets done. Hours are logged. Dependencies shift slightly to accommodate what feels like a minor tweak rather than a real change.\n\nThen something predictable happens.\n\nAn invoice is questioned. A timeline is challenged. A deliverable is reviewed with fresh eyes. Suddenly, no one remembers approving that change. What once felt like a green light now sounds like “we were just discussing options.”\n\nThis is the quiet danger of verbal scope. In delivery environments, memory is unreliable, especially when pressure increases. Conversations blur, context disappears, and what felt obvious at the time becomes debatable when budgets tighten or deadlines slip.\n\n**### If It Isn’t Written, It Doesn’t Exist**\n\nThis is the uncomfortable legal reality most teams only learn after being burned. If scope is not written down, it effectively does not exist.\n\nThat is not because anyone is acting dishonestly. It is because written confirmation is the only stable record when things become tense. When disagreements arise, intentions stop mattering. What matters is what can be pointed to clearly and unambiguously.\n\nI have seen this pattern across IT service providers, SaaS implementation teams, and development agencies. It rarely begins with conflict. It begins with good intentions.\n\nTeams want to be helpful. They want to maintain momentum. They do not want to slow things down with documentation for what feels like a small adjustment.\n\nBut small adjustments accumulate.\n\nA minor integration tweak turns into additional testing cycles. A quick dashboard change requires backend restructuring. A simple vendor coordination call becomes weeks of cross-team troubleshooting.\n\nBecause none of it was formally recorded, all of it gets absorbed quietly into margins.\n\nThat is how profitable projects slowly turn into break-even projects without anyone being able to pinpoint when the shift happened.\n\n**### Clarity Is an Operational Discipline, Not Distrust**\n\nThe lesson here is not about mistrust. It is about operational clarity.\n\nIf work matters, it deserves a written yes. That principle protects both sides. It creates a shared record of what was agreed, when it was agreed, and what that agreement affects.\n\nFor IT teams, this does not require heavy bureaucracy. It requires discipline.\n\nStart by clearly defining what constitutes a scope change in your contract. Do not limit this to major features alone. Additional integrations, vendor coordination, workflow redesigns, extended support, and new reporting requirements should all be explicitly called out.\n\nNext, implement lightweight written confirmations. This does not mean drafting a lengthy amendment for every adjustment. A structured change order template or a clearly documented email summary that requires written approval is often enough. The goal is traceability, not formality.\n\nThen, build dependency rules into your agreements. If new inputs are required, timelines shift automatically. If third-party vendors delay access or responses, deadlines move by design. When this is agreed upfront, it stops becoming a negotiation later.\n\nFinally, train your team to pause before saying “that works.” Alignment in conversation is not the same as contractual approval. Empower project managers to say, “We’ll confirm this in writing and share an updated scope.” That single sentence can protect months of margin.\n\n**### Final Thoughts**\n\nMost scope creep does not look like a big request. It sounds like verbal agreement. When changes are not written down, they are easy to deny later, and delivery teams quietly absorb extra work.\n\nClear written scope and simple confirmation processes protect margins, timelines, and relationships.\n\nOne of the hardest lessons in running an IT practice long-term is realizing that sustainability is rarely destroyed by large mistakes. It is eroded by small, undocumented agreements repeated over time.\n\nGood clients do not resist clarity. In fact, the best ones appreciate it.\n\nClear scope prevents surprise invoices, misaligned expectations, and unnecessary tension. It keeps delivery predictable, professional, and scalable.\n\nBecause in the end, scope creep is not a dramatic event. It is drift. And drift only stops when someone writes things down.[](https://www.reddit.com/submit/?source_id=t3_1rd8os1)",
      "is_original_content": false,
      "link_flair_text": "knowledge",
      "permalink": "https://reddit.com/r/startup/comments/1rd8pbu/scope_creep_is_a_real_problem_why_verbal/",
      "domain": "self.startup",
      "is_self": true,
      "comments": []
    }
  ]
}