{
  "metadata": {
    "last_updated": "2026-02-13 09:09:58",
    "time_filter": "week",
    "subreddit": "startup",
    "total_items": 17,
    "total_comments": 88,
    "file_size_bytes": 101147
  },
  "items": [
    {
      "id": "1r0759a",
      "title": "i wish someone would have told me this before building my 1st startup",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1r0759a/i_wish_someone_would_have_told_me_this_before/",
      "author": "davidheikka",
      "created_utc": "2026-02-09 15:27:49",
      "score": 53,
      "num_comments": 38,
      "upvote_ratio": 0.93,
      "text": "i’ve grown [my startup](https://aicofounder.com/) to $12k/mo.\n\ni honestly think i could’ve saved myself months of wasted effort going down the wrong paths if i truly understood this before starting.\n\n1. validate your idea before you start building.\n2. don’t chase investors. focus on getting users instead and investors will come knocking on your door.\n3. don’t be cheap when you hire an accountant, you’ll save time and money by spending more.\n4. inspiration is the design key when you’re new. don’t build your own landing page from scratch, copy different sections from the tools you love the most and make it your own this way.\n5. post online daily. x, reddit, linkedin, tiktok, whatever suits you and your target audience.\n6. solve your own problem and let this decide if you’re b2b or b2c. both come with pros and cons. don’t listen to people who try to paint a black/white picture of it.\n7. i’m bootstrapped and therefore highly recommend it. work a 9-5 until you have 1-2 years of runway (living cheap), then go all in.\n8. you earn the right to paid ads by getting organic marketing to work first. ads aren’t $100 in, X customers out. you’ll burn thousands just trying to learn it.\n9. define your most important metrics and track them. they should be the pillars that guide all your decisions.\n10. keep your product free at the start. controversial opinion maybe, but it’s how i did it and it got me feedback and testimonials that helped me grow fast and make a lot of money later on.\n11. the first few minutes of your app is a promise to the user: this app will help you achieve your goal. so put a lot of effort into the beginning to convert more people.\n12. have an mvp mindset with everything you do. get the minimal version out asap then use feedback to improve it.\n13. just because someone else has done it, doesn’t mean you can’t compete. execution is so important and you have no idea how well they’re doing it.\n14. having a co-founder that matches your ambition is the single greatest advantage for success.\n15. if you’re not passionate about what you’re building, it’s going to be difficult to keep going through the early stage where you might not see results for months.\n16. good testimonials will increase the perceived value of your product.\n17. always refund people that want a refund.\n18. marketing is constant experimentation to learn what works. speed up the process by drawing inspiration from what works for similar products.\n19. getting your first paying customers is the hardest part by far. do things that don’t scale to get them.\n20. building a good product comes down to thinking about what your users want.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1r0759a/i_wish_someone_would_have_told_me_this_before/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o4iz7no",
          "author": "This_Cardiologist242",
          "text": "It’s so weird to me, and I’m guilty of this as well. We as founders hear that we need to solve real problems that people realize, so we solve problems that we have when trying to build (idea gen, planning, lead gen, etc). No way you have 12k monthly revenue, and how is this not just an ad?",
          "score": 3,
          "created_utc": "2026-02-10 00:04:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4lcc6p",
              "author": "davidheikka",
              "text": "why is that weird? if someone has a problem and you have a way of helping them with it then go ahead and do it. it doesn't matter if they're a founder, doctor, or lawyer. a problem is a problem and you make the world a better place by solving them.\n\nand what do you mean \"no way\"? how could you possibly know what i make haha? [here's a screenshot](https://imgur.com/a/qMEoB9f) of my january revenue for others but i know you'll make up every reason for why it's fake, because i don't know, maybe it makes you feel better",
              "score": 1,
              "created_utc": "2026-02-10 10:30:16",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4g5xmz",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 4,
          "created_utc": "2026-02-09 15:44:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4lcqqy",
              "author": "davidheikka",
              "text": "i wouldn't say i made a perfect choice on when to flip to paid but the timing felt right in combination with my product hunt launch. at that point i had around 140 users which had given me a lot of feedback and validation that i was sitting on real potential. i made a bet on the launch being a good traffic boost which was a good time to test a paid plan, and it worked out very well!",
              "score": 2,
              "created_utc": "2026-02-10 10:33:57",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4h1kkz",
          "author": "Electronic-Fun-6720",
          "text": "where do you post on X and reddit too ?",
          "score": 1,
          "created_utc": "2026-02-09 18:14:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4hva51",
              "author": "davidheikka",
              "text": "i used to be very active in communities. not sure how well they work nowadays but back then they really amplified reach",
              "score": 1,
              "created_utc": "2026-02-09 20:38:26",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4iu1ka",
                  "author": "2real_4_u",
                  "text": "How do you be active in communities without coming across as an ad? \n\nI’m looking to be more active within different communities, but I’m not sure how to approach it. Do I just say, \"I have this idea and I’m working on an MVP, is anyone interested?\"",
                  "score": 1,
                  "created_utc": "2026-02-09 23:36:03",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4h9wb7",
          "author": "RangeVegetable3375",
          "text": "Thank you! I really needed this information",
          "score": 1,
          "created_utc": "2026-02-09 18:53:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4hvch9",
              "author": "davidheikka",
              "text": "i’m glad to help!",
              "score": 1,
              "created_utc": "2026-02-09 20:38:45",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4ibl9l",
          "author": "GrowthAddict63",
          "text": "Good return of experience, it clearly highlights key lessons learned. Thanks for sharing.",
          "score": 1,
          "created_utc": "2026-02-09 21:59:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ira0n",
          "author": "theusedcomputers",
          "text": "Great read!!!!!",
          "score": 1,
          "created_utc": "2026-02-09 23:20:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4j5azv",
          "author": "creamilk_now",
          "text": "Thinly veiled Ad",
          "score": 1,
          "created_utc": "2026-02-10 00:39:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4kbd0z",
          "author": "divyanthj",
          "text": "Hey I love your startup aicofounder! I've used it extensively to refine my existing one. I love how it acts like an actual cofounder who resists changes you suggest when necessary instead of what normal LLMs do which is agree with everything. :)",
          "score": 1,
          "created_utc": "2026-02-10 04:58:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4lct3s",
              "author": "davidheikka",
              "text": "thanks! that's awesome to hear!",
              "score": 1,
              "created_utc": "2026-02-10 10:34:33",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4ksdw6",
          "author": "sociazy",
          "text": "This is gold. Most founders burn out because they treat their startup like an art project instead of a feedback loop. I've seen so many people waste 6 months building perfect features that nobody actually wants. It’s the main reason I built Sociazy the way I did to help founders skip the \"over-engineering\" phase and ship high-quality stuff fast. Execution is everything, but speed is the real unfair advantage.",
          "score": 1,
          "created_utc": "2026-02-10 07:18:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4lb774",
          "author": "Mediocre-Goose-380",
          "text": "Hi David 👋\n\nGreat post…I checked out aicofounder.com. Really clever how you structure the chat workflow and guide users through the different phases - it gave me some ideas for my own AI SaaS project!\n\nQuick question: does AICofounder use that list of recommendations you shared in your post?\n\nCongrats on hitting $12k/month. that’s impressive.\n\nI’d love to hear any tips for someone just starting out, if you have a moment",
          "score": 1,
          "created_utc": "2026-02-10 10:19:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ldqb5",
          "author": "W_E_B_D_E_V",
          "text": "def agree with #7 and #10\n\nI bootstrapped too and keeping it free early got me 20+ testimonials that became my entire sales pitch later\n\none thing I'd add: #19, do things that don't scale, applies to hiring too. When I needed my first developer for my mvp, I spent 10 days interviewing offshore devs directly instead of using agencies. Saved 80% on costs and found someone who actually cared about the product (this later became a dev shop that rents out these devs). That relationship is still paying dividends",
          "score": 1,
          "created_utc": "2026-02-10 10:42:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4lfahw",
          "author": "albyc_",
          "text": "This is great advice! Just curious whether or not you talked to customers as you were building to validate the idea as that's what we are doing right now. Especially since we are pitching to a big VC in Australia in March so wanna have talked to customers beforehand lol (i heard VC's love that)",
          "score": 1,
          "created_utc": "2026-02-10 10:56:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4mmba2",
              "author": "davidheikka",
              "text": "i reached out to my target audience before building through a survey on Reddit. then i also talked to my users and customers as i was building of course. i made it simple to leave feedback within the app and i also sent out and email asking to jump on a quick call to give feedback and help me understand them better. surprisingly many agreed to a call like that. listening to all the feedback and shaping the app after it really helped with building something people genuinely want.\n\nshoutout to you for doing this at 14 btw, that's awesome! keep going and keep learning and you're going to be so far ahead of everyone else",
              "score": 1,
              "created_utc": "2026-02-10 15:24:59",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4o4p63",
                  "author": "albyc_",
                  "text": "Ok cool. Thanks so much!",
                  "score": 1,
                  "created_utc": "2026-02-10 19:36:03",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4oqstm",
          "author": "augusto-chirico",
          "text": "the organic before paid ads point is underrated. most founders i see burning cash on ads haven't even figured out how to describe their product in a way that gets someone to click.\n\none thing i'd push back on: the co-founder point. a bad co-founder is way worse than no co-founder. solo is harder but at least you're not dealing with misaligned expectations on top of everything else",
          "score": 1,
          "created_utc": "2026-02-10 21:19:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4tgvcu",
          "author": "Icy-Pen3656",
          "text": "Exactly, if you build before you validate, you’re just guessing. Validation isn’t hearing “this sounds cool,” it’s seeing real actions like people trying to solve the problem right now. That’s how you know you’re on something people actually care about.\n\nAnd chasing users before investors is solid advice. Investors pay attention when real people are already using something and getting value from it.\n\nOne thing I’ve learned is to focus on what people actually do, not what they say they might do. Future hypotheticals sound nice but behavior tells you the truth.",
          "score": 1,
          "created_utc": "2026-02-11 16:00:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4zmwo0",
          "author": "shoaibisone",
          "text": "This is the kind of post people only appreciate after learning it the hard way.\n\nCongrats on the $12k/mo, clearly you earned those lessons.",
          "score": 1,
          "created_utc": "2026-02-12 14:54:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o51tmc9",
          "author": "BerkeleyRDI",
          "text": "Those are some great tips. We run an AI-focused accelerator at UC Berkeley, and we've seen similar issues for first-time founders.\n\nWe've noticed that proof definitely beats polish early on. Especially for AI startups, the early traction/proof of a rough MVP is better than pouring resources into a \"finished\" product without early user testing.",
          "score": 1,
          "created_utc": "2026-02-12 21:07:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o53fz53",
          "author": "Desperate-Flow-7489",
          "text": "Great post, but how to find an idea (If I try to think about something that I could solve, I cant really remember anything useful)",
          "score": 1,
          "created_utc": "2026-02-13 02:29:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o53u0f1",
          "author": "Red-eyesss",
          "text": "I always enjoy reading these type of genuine and insightful posts, thanks for sharing.",
          "score": 1,
          "created_utc": "2026-02-13 03:58:59",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qz3fct",
      "title": "Hostinger Coupon codes, are they actually worth it?",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qz3fct/hostinger_coupon_codes_are_they_actually_worth_it/",
      "author": "H_E_Mgayming",
      "created_utc": "2026-02-08 08:15:56",
      "score": 10,
      "num_comments": 41,
      "upvote_ratio": 0.92,
      "text": "I came across a [**Hostinger coupon code (upto 95% off)**](https://webhostingpromo.com/reddit/hostinger). Now I wanted to get some real opinions as I am planning to use it for my startup. I am thinking about signing up long term for around 2 to 3 years to lock in a lower price, but I am unsure if it is worth it in the long run. How has your experience been with performance, support, and renewals?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1qz3fct/hostinger_coupon_codes_are_they_actually_worth_it/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o494f6e",
          "author": "konimozi",
          "text": "I went with a long term Hostinger plan mainly because of the discount, and for the price it has been decent. Performance is solid for small to medium sites, especially on WordPress, and uptime has not been an issue for me. Support is okay, not amazing, but they do respond eventually.\n\nThe main thing to be aware of is renewal pricing. The discount is great upfront, but renewals are much higher, so it only really makes sense if you are sure you will stick with them for a few years. For beginners or budget focused projects, I would say it is worth it. For larger or mission critical sites, there are better options but at a higher cost.",
          "score": 2,
          "created_utc": "2026-02-08 14:02:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o49lmj2",
              "author": "H_E_Mgayming",
              "text": "That lines up with what I am trying to evaluate. My plan would begin as a small WordPress setup, but there is potential for traffic growth later. When your sites picked up more visitors, did you notice any slowdown or resource limits kicking in? Also, how was support when the issue was more technical rather than basic account help?",
              "score": 1,
              "created_utc": "2026-02-08 15:37:40",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4fu0e2",
                  "author": "konimozi",
                  "text": "For me, things were fine until traffic started consistently going up. On shared hosting, you definitely start feeling the limits at some point, mostly CPU and memory caps rather than outright downtime. Pages would load slower during spikes, especially when multiple plugins were running.\n\nSupport was decent for basic stuff, but once it got more technical, like performance tuning or server level questions, the answers were a bit generic. They usually pointed me toward upgrading rather than deeply troubleshooting.\n\nThat said, once I moved to VPS, performance improved a lot and those issues went away. So I would say shared hosting is fine to start, but if growth is likely, planning an upgrade early makes the experience smoother.",
                  "score": 1,
                  "created_utc": "2026-02-09 14:43:20",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o488tyd",
          "author": "Significant_Capita",
          "text": "I've used Hostinger for a couple of small projects. The initial discount pricing is definitely attractive, but be prepared for the renewal rates - they jump up significantly. For a startup, I'd recommend considering the long-term costs. The performance has been decent for basic hosting needs, but if you're expecting rapid growth, you might outgrow their shared hosting faster than you think.",
          "score": 1,
          "created_utc": "2026-02-08 09:48:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o49l33i",
              "author": "H_E_Mgayming",
              "text": "My main dilemma is whether it makes sense to lock into a long term plan now versus starting shorter and upgrading later. On paper the discount looks great, but I am trying to weigh that against flexibility. Did you ever feel limited by their control panel, support, or upgrade paths when those projects started getting more traffic, or was pricing the biggest drawback for you?",
              "score": 1,
              "created_utc": "2026-02-08 15:34:57",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o4g9yja",
              "author": "Common-Pint",
              "text": "That is a fair point, but the renewal jump is pretty much an industry wide practice at this point. Even after renewal, the pricing is still on the lower side compared to many other hosts. As long as the long term cost is factored in from day one, it does not feel like a deal breaker, especially for smaller or early stage projects.",
              "score": 1,
              "created_utc": "2026-02-09 16:03:30",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o4mjm9s",
              "author": "konimozi",
              "text": "That makes sense. I think a lot of people underestimate how quickly “small projects” can change once things start moving. As long as expectations are set that shared hosting is just the starting point, it seems to work fine for that phase.",
              "score": 1,
              "created_utc": "2026-02-10 15:11:40",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o498fiy",
          "author": "klimora",
          "text": "I would look at it less as a “deal” and more as a commitment. The discount makes the entry price very attractive, but you are basically locking yourself into their ecosystem for a couple of years. If your project is simple, like a blog, portfolio, or small business site, it usually works out fine and saves money upfront.\n\nWhere people get disappointed is when their needs grow. Scaling, advanced support, or custom setups can feel limiting compared to higher end hosts. So in my view, the discount is worth it only if you know exactly what you are building and do not expect major changes soon. Otherwise, the cheap price can turn into regret later when renewal time hits or you want to move.",
          "score": 1,
          "created_utc": "2026-02-08 14:26:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o49m4xx",
              "author": "H_E_Mgayming",
              "text": "The lock in aspect is what I am debating most right now. My project is simple today, but there is a real chance the requirements change once it gains traction. Saving money upfront sounds good, but not if it creates friction later when scaling or moving becomes necessary. Out of interest, did you ever hit a point where switching hosts felt harder than expected, or was it more about realizing the plan no longer fit your needs?",
              "score": 1,
              "created_utc": "2026-02-08 15:40:17",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4kpy9n",
                  "author": "klimora",
                  "text": "It was more about realizing the plan no longer fit the project, not that switching was difficult. The actual move was doable, but it felt frustrating because I still had time left on the plan and everything was already set up around that host.\n\nThe lock in starts to matter when your needs change, like wanting more control, better performance tuning, or faster support. At that point, the upfront savings stop feeling that important.\n\nSo I would say the friction comes more from timing and being tied to a long plan, rather than the technical effort of moving to another host.",
                  "score": 1,
                  "created_utc": "2026-02-10 06:56:22",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4ds0y1",
          "author": "Common-Pint",
          "text": "Hostinger can make sense at the starting stage, but only if you plan ahead. Shared hosting seems fine for getting things live and tested, but once traffic starts picking up, you should already be mentally prepared to move to VPS.\n\nFrom what I have seen, Hostinger VPS pricing and specs are actually reasonable compared to many other options, so upgrading within the same ecosystem looks like a practical path rather than a forced jump elsewhere. For an online store, that upgrade readiness probably matters more than saving a few bucks upfront.",
          "score": 1,
          "created_utc": "2026-02-09 04:47:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4fir7f",
              "author": "H_E_Mgayming",
              "text": "Did you personally upgrade to their VPS at some point, or move to a different provider when traffic increased? I am trying to understand whether the in house upgrade path actually holds up in real use or if people still end up switching later.",
              "score": 1,
              "created_utc": "2026-02-09 13:39:16",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4g7ez5",
                  "author": "Common-Pint",
                  "text": "I actually went the VPS route with them instead of switching right away. Moving from shared to VPS was not painful, and the jump in stability and speed was obvious once traffic increased.\n\nFor normal growth, like a WordPress site or a small ecommerce setup, it did what it was supposed to do without constant babysitting. I only see people moving out when they start needing deeper server control or very custom setups.\n\nSo yes, the internal upgrade path is usable in practice. It just depends on whether your project outgrows that middle ground or not.",
                  "score": 1,
                  "created_utc": "2026-02-09 15:51:26",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4fbxo4",
          "author": "Vaibhav_codes",
          "text": "Worth it for the first term, but watch out renewals jump up a lot. Great for getting started cheaply, just plan ahead",
          "score": 1,
          "created_utc": "2026-02-09 12:56:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4g83tx",
              "author": "Common-Pint",
              "text": "True, but to be fair that is pretty much standard across the hosting industry. Intro discounts are aggressive everywhere, and even after renewal Hostinger still ends up cheaper than many comparable providers.",
              "score": 1,
              "created_utc": "2026-02-09 15:54:42",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4kul3d",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-10 07:38:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4kxdst",
          "author": "BymaxTheVibeCoder",
          "text": "i saw some those codes on discord  \n• Horizons: vibecodersnest  \n• Website Builder: buildersnest  \n• VPS: vpsnest (i just used it and it work)",
          "score": 1,
          "created_utc": "2026-02-10 08:05:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4lu7dn",
              "author": "H_E_Mgayming",
              "text": "Appreciate you sharing that. I have seen a few codes floating around on Discord too, but I am trying to figure out whether the discount itself is the main win or if the platform still makes sense once the promo period is over. Did you notice any differences in renewal pricing or plan limitations when using those codes?",
              "score": 1,
              "created_utc": "2026-02-10 12:50:59",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4lw2nn",
                  "author": "BymaxTheVibeCoder",
                  "text": "I used them for domain business mail and now for vps, i do heard that a lot of friends of mine used their website builder for long time and they do find it valuable so i belive it make sense",
                  "score": 1,
                  "created_utc": "2026-02-10 13:02:58",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o4lw80k",
                  "author": "BymaxTheVibeCoder",
                  "text": "I use the vps for running openclaw so i also bought with the discount the one year membership so it was a great deal",
                  "score": 1,
                  "created_utc": "2026-02-10 13:03:56",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o4mi8ss",
              "author": "konimozi",
              "text": "You are right, those codes do work. From what I have seen though, the referral link usually gives the highest discount, around 20 percent, and it applies more consistently across plans compared to random promo codes shared on Discord.",
              "score": 1,
              "created_utc": "2026-02-10 15:04:43",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4n6hoe",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-10 16:59:01",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r1yynt",
      "title": "Zero Trust security is a nightmare for legacy client work",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1r1yynt/zero_trust_security_is_a_nightmare_for_legacy/",
      "author": "N3DSdude",
      "created_utc": "2026-02-11 14:33:45",
      "score": 8,
      "num_comments": 5,
      "upvote_ratio": 1.0,
      "text": "If you run a small dev shop or IT consultancy, you have probably felt the pressure to modernize your security to pass an audit or get cyber insurance. We recently tried moving our team to ZTNA and SASE to check those boxes, but it turned into a massive headache because of our client mix.\n\nThe reality is that a lot of our clients in finance and older industries still rely on legacy environments and on-prem servers. Most of the shiny new Zero Trust tools are built for cloud-native start-ups and they just do not play nice with these older setups. We actually found ourselves in a spot where the very tools meant to make us compliant were stopping us from accessing the environments we needed to bill hours.\n\nWe eventually pivoted back to a business VPN because it actually works across both legacy and modern systems without breaking everything. By handling the network and endpoint security as separate layers, we satisfied the insurance requirements without locking ourselves out of our clients tech.\n\nWhen we compared our options, PureVPN for Teams stood out for multi-client legacy access and was easy for compliance. NordLayer was fine for basic remote access, while Perimeter 81 was great for cloud-only teams but had low compatibility for our legacy needs.\n\nIf you handle a mix of client types, do not feel forced into a modern stack that kills your workflow just to pass a review. Has anyone else had to roll back a modern security setup because it did not work with your clients older infrastructure?",
      "is_original_content": false,
      "link_flair_text": "knowledge",
      "permalink": "https://reddit.com/r/startup/comments/1r1yynt/zero_trust_security_is_a_nightmare_for_legacy/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o4t4w9d",
          "author": "thatdude391",
          "text": "Ill be real. It isn’t necessarily just older infrastructure. Some of these more modern security solutions will basically never pass muster the way they are set up. Zero trust is there for a reason. These companies come and go, but while on the way out let things lapse. For a lot of industries you are still holding the shit bag those companies leave and are financially responsible for anything that goes wrong. Just isn’t worth the risk ever to take on until they are a decade plus of being proven without issues. Even then there is hesitancy.",
          "score": 1,
          "created_utc": "2026-02-11 15:02:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4t6mdh",
          "author": "Lonebot2000",
          "text": "Thank you, very insightful knowledge!",
          "score": 1,
          "created_utc": "2026-02-11 15:11:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4tc0qh",
          "author": "OrganizationSharp681",
          "text": "Yep, same experience here. A lot of ZTNA/SASE tools just aren’t built for mixed environments—great for cloud‑native, but a nightmare when clients still run on‑prem. We also had to roll back to a VPN because it was the only way to stay compliant *and* keep access working. Sometimes the “old” solution is the only one that fits the real‑world client mix.",
          "score": 1,
          "created_utc": "2026-02-11 15:37:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4tjkmh",
          "author": "Horror-Security9277",
          "text": "I’ve also had to roll back newer Zero Trust or SASE deployments because they broke access to legacy client systems that still drive real revenue. Sometimes the “best practice” solution on paper just isn’t practical in mixed environments, and reliability has to come first.",
          "score": 1,
          "created_utc": "2026-02-11 16:12:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4wakux",
          "author": "Aggressive-Brush-204",
          "text": "i feel you, i've migrated old clients, expect surprises",
          "score": 1,
          "created_utc": "2026-02-12 00:16:32",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qy5s1z",
      "title": "How good is Liquid Web for startups in the long run?",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qy5s1z/how_good_is_liquid_web_for_startups_in_the_long/",
      "author": "H_E_Mgayming",
      "created_utc": "2026-02-07 05:50:49",
      "score": 7,
      "num_comments": 4,
      "upvote_ratio": 0.9,
      "text": "I am considering Liquid Web for a startup project and wanted some real world feedback. The pricing is clearly higher than shared hosting or budget VPS providers, but they market themselves around performance, reliability, and managed support.\n\nFor early stage startups, does Liquid Web actually justify the cost in terms of uptime, support quality, and scalability? Or is it something that makes more sense only after traffic and revenue grow?\n\nWould love to hear honest experiences from founders or developers who have used it long term.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1qy5s1z/how_good_is_liquid_web_for_startups_in_the_long/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o4206ei",
          "author": "sailormish980",
          "text": "For early stage startups hell nah\nOnly if you have strong validated idea or lot of money\nBut if u dont then u should create some sort of cashflow at first then it will be better \nMy pov",
          "score": 1,
          "created_utc": "2026-02-07 09:35:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o43kjq3",
          "author": "monkey6",
          "text": "No, go with something better. Can you get credit for Azure, AWS, Oracle, Digital Ocean, or Vultr by applying to their startup programs?",
          "score": 1,
          "created_utc": "2026-02-07 16:05:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o488x4n",
          "author": "Significant_Capita",
          "text": "The cost is steep for early stage. I'd say it makes sense once you have consistent revenue and can't afford downtime. For bootstrapping, you might want to start with something more affordable and migrate later when the business justifies the premium.",
          "score": 1,
          "created_utc": "2026-02-08 09:49:35",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r0vqvp",
      "title": "My AI tool auto-designs workflows for startups. Seeking feedback!",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1r0vqvp/my_ai_tool_autodesigns_workflows_for_startups/",
      "author": "Substantial-Swan671",
      "created_utc": "2026-02-10 08:55:03",
      "score": 7,
      "num_comments": 0,
      "upvote_ratio": 0.55,
      "text": "Hey everyone, My project is the \"Business Scenario AI Agent Architect,\" and it's built to solve process design and efficiency problems for startups.\n\nIt's an AI tool that can analyze your business model, job roles, or website, and then automatically generate an optimized workflow chart that integrates AI agents. The goal is to help early-stage teams quickly establish efficient, scalable operating systems, saving valuable time and consulting fees.\n\n**Feedback I'm looking for:**\n\n1. As a founder, does this tool solve a real pain point for you?\n2. How is the user experience on the site? Is anything unclear?\n3. What features would you most want to see added?\n\nLink: [https://leapility.com/share/6ea30f83-7699-49e4-a387-5590d9bc6f08](https://leapility.com/share/6ea30f83-7699-49e4-a387-5590d9bc6f08) \n\nThank you so much for your valuable input; it's crucial for me!",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1r0vqvp/my_ai_tool_autodesigns_workflows_for_startups/",
      "domain": "self.startup",
      "is_self": true,
      "comments": []
    },
    {
      "id": "1qz51l6",
      "title": "Best remote team productivity tools for a startup in hyper-growth?",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qz51l6/best_remote_team_productivity_tools_for_a_startup/",
      "author": "Significant_Capita",
      "created_utc": "2026-02-08 09:54:42",
      "score": 6,
      "num_comments": 12,
      "upvote_ratio": 1.0,
      "text": "We scaled from 10 to 60 in the last year, and our ops are a mess right now because the informal Slack/Notion workflow has completely fallen apart, and I have no real visibility into employee activity tracking or project progress.\n\nI know I need a better system so I've started doing a basic employee monitoring software comparison, looking at everything from full suites to simple screenshot monitoring software. The overall employee monitoring software cost is a big factor for us, so I'm trying to avoid bloated enterprise tools.\n\nIt mostly seems to come down to a Monitask vs Hubstaff type of decision for our needs, something lightweight to get a baseline.\n\nMy question for founders who've been through this: what was your immediate stop the bleeding move when it came to remote work monitoring? Looking for advice on the approach.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1qz51l6/best_remote_team_productivity_tools_for_a_startup/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o4e6lf5",
          "author": "ArmOk3290",
          "text": "I'd be careful jumping straight to screenshot monitoring. At 60 people the stop the bleeding move is usually process, not surveillance.\n\n  \nWhat worked for us:\n\n\\- Pick one system of record for work (Linear, Jira, Asana). Nothing counts unless it is in there with an owner and a due date.\n\n\\- Weekly written update template per team (what shipped, what's blocked, what's next).\n\n\\- Slack is for questions, not status.\n\n  \nIf you need time tracking for billing, Toggl or Harvest is fine. If you just need visibility, track outcomes like cycle time, PR throughput, and on time delivery.",
          "score": 2,
          "created_utc": "2026-02-09 06:43:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o49kt4g",
          "author": "renebaebae0329",
          "text": "Have you tried ClickUp, [Monday.com](http://Monday.com) or Asana? I have used notion for my clients previously and seemed to work fine but that was something I did for a team of 15 (max) so far. ",
          "score": 1,
          "created_utc": "2026-02-08 15:33:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4bi0b2",
          "author": "augusto-chirico",
          "text": "honestly i'd push back on the monitoring angle. at 60 people what you probably need more than employee activity tracking is better async communication and clearer ownership.\n\nwe went through something similar scaling a remote team. the fix wasn't adding more visibility tools - it was moving to weekly written updates + clear owners per project in linear. slack became just for quick questions, not for status updates.\n\nif you really need time tracking (for billing clients or whatever), toggl works fine. but if the goal is \"know who's doing what\" - project management > monitoring software imo",
          "score": 1,
          "created_utc": "2026-02-08 21:09:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4emxvi",
          "author": "Glittering-North-757",
          "text": "Or you can get the best of both worlds in a virtual office like Roam - you still show up, your team sees you “at your desk,” meetings happen in real rooms, and you get the ambient sense of presence without being forced into a physical space. It’s like having the structure and visibility of an office without the commute or overhead.",
          "score": 1,
          "created_utc": "2026-02-09 09:19:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ep0xq",
          "author": "mycure",
          "text": "Hey. We switched from Notion to Routine (https://routine.co) this year. Way faster (works offline), more integration focused. Great for team that feel like like information is scattered. My 2 cents.",
          "score": 1,
          "created_utc": "2026-02-09 09:41:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4f0sgj",
          "author": "howardlerman",
          "text": "Roam founder here.  Roam Makes Remote Work for over 1,000 companies in a Virtual Office.  Happy to help!",
          "score": 1,
          "created_utc": "2026-02-09 11:31:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4f4uwm",
          "author": "Vaibhav_codes",
          "text": "Focus on visibility and outputs first, not screenshots tools are just the icing; structured boards, async check-ins, and clear deliverables solve most chaos.",
          "score": 1,
          "created_utc": "2026-02-09 12:05:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4hks56",
          "author": "Excellent-Average782",
          "text": "Dude, skip the monitoring software, that's treating symptoms not the disease. Your real problem is process breakdown, not lazy employees. \n\nMy suggestion: \n\n1. Weekly written updates (kills most of \"what's everyone doing\" questions) \n\n2. Clear project owners in something like linear or asana \n\n3. Visual project mapping sessions in miro to get everyone aligned on priorities \n\nMonitoring feels like control but actually creates more chaos. Fix communication flow first.",
          "score": 1,
          "created_utc": "2026-02-09 19:45:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ozfsg",
          "author": "GeorgiafromRipple",
          "text": "Congratulations on the growth! Scaling from 10 to 60 in a year is a massive win, but we know exactly what you mean about that informal workflow hitting its breaking point.\n\nAt that size, the shift from knowing what everyone is doing to feeling like you have zero visibility is a common pain point for startups. However, we found that lean, hyper-growth teams often rebel against screenshot monitoring or active tracking because it can erode trust just when you need the team to be most autonomous. Our \"stop the bleeding\" move was focusing on outcome-based visibility rather than activity tracking. Instead of looking at screenshots, we moved toward a system where progress is visible through structured, async updates that clearly show project velocity. This gives you the oversight you need without the \"Big Brother\" vibe or the heavy enterprise price tag.\n\nWe are a Kiwi startup ourselves, and we built Ripple to solve this exact mess by unifying updates, tasks, and decisions into one clear feed. It helps you keep high-level visibility on progress across your 60-person team without needing to monitor their screens.\n\nHow are you thinking about balancing the need for oversight with maintaining your team culture as you continue to scale?",
          "score": 1,
          "created_utc": "2026-02-10 21:59:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4v0g0k",
          "author": "MarcoMusings",
          "text": "Swear by Monday.com. Some of the stuff you can build is amazing. You need to trust your people. Monitoring them will only make them more unproductive and kill culture.",
          "score": 1,
          "created_utc": "2026-02-11 20:20:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4ybypk",
          "author": "riccardoctl",
          "text": "I'd avoid monitoring people, especially remote workers. I worked fully remote for a few years without any supervision, software, or things like that. What worked for us was giving people full responsibility for a chunk of work.\n\nI'd recommend making your notion a bit more formal or picking up a tool like ClickUp or Linear to manage work. Be careful not to overcomplicate the task management, or it will quickly become hell. Too many hops between files and too many layers of tasks,s and you will end up with just a messy hell no one can use. Since I've struggled with this in the past, I've made a free template for Notion that you can get here: [notionindiekit.com](https://notionindiekit.com). It contains a bit of extra content that you likely won't need, but you can check out how i like to organize the task layers.",
          "score": 1,
          "created_utc": "2026-02-12 09:18:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o510sdk",
          "author": "Weekly_Accident7552",
          "text": "Slack integration in Manifestly changed everything for us. Checklists post straight to channels with mentions so tasks hit Slack without leaving the convo and updates flow back automatically. Been using it daily two years keeps remote team synced without tool switching chaos.\n\n",
          "score": 1,
          "created_utc": "2026-02-12 18:49:48",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qy3nlk",
      "title": "Stop asking for an NDA. Your \"Idea\" is worthless.",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qy3nlk/stop_asking_for_an_nda_your_idea_is_worthless/",
      "author": "Bubbly-Rub-4857",
      "created_utc": "2026-02-07 04:03:17",
      "score": 6,
      "num_comments": 1,
      "upvote_ratio": 1.0,
      "text": "I need you to sign an NDA before I tell you what it is. Here is the brutal reality of the Hardware World factories are too busy to steal from you. A factory owner in Manesar or Shenzhen is worried about keeping his machines running 24/7. He wants your order, not your business model. He doesn't have the time, marketing team, or distribution network to steal your product and sell it himself.Ideas are cheap. Execution is hell. A Smart Water Bottle\" is an idea. Sourcing food-grade steel, waterproofing the PCB, getting BIS certification, and setting up a distribution channel\" is a business. Nobody steals the idea because the idea is the easy part. The execution is the hard part. Real theft happens after success. Copycats (especially the Chinese ones) don't steal unproven prototypes. They wait for you to launch, prove the market demand, and then they copy you. An NDA today protects you from absolutely nothing in 6 months. The \"NDA\" signals one thing, It tells me you are a Novice. It tells me you value the \"Secret\" more than the \"Speed.\"Stop hiding your idea. Scream it from the rooftops. Get feedback. If your idea is so fragile that a conversation can kill it, it wasn't a business anyway.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1qy3nlk/stop_asking_for_an_nda_your_idea_is_worthless/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o41k4zn",
          "author": "Altruistic_Minimum94",
          "text": "I laughed when reading this. This is so true. I have to admit, my co-founder for one of our software did do this. ",
          "score": 1,
          "created_utc": "2026-02-07 07:01:31",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r1ic3h",
      "title": "how would i make a rocket startup company?",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1r1ic3h/how_would_i_make_a_rocket_startup_company/",
      "author": "Hopeful-Fly-9710",
      "created_utc": "2026-02-11 00:28:22",
      "score": 5,
      "num_comments": 15,
      "upvote_ratio": 0.72,
      "text": "how would i make a rocket startup company?, im interested in space and im working on a model rocket liquid engine + model rocket, i would love to start a rocket startup company, im still in high school so i have alot of time to figure out what im doing, my current idea is to go to collage, get a levels in physics, get a MEng in uni and attempt to join the esa or orbex,then once im in either of these companies i have the correct \"leverage\" (maybe?)",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1r1ic3h/how_would_i_make_a_rocket_startup_company/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o4r3i3s",
          "author": "2real_4_u",
          "text": "To get into any meaningful “rocket science” you will need a PhD. The people making the real breakthroughs are the PhDs that dedicated their lives to this. There’s levels to this field and it takes a lot of work to even get your foot in the door. \n\nStay hungry and grind on",
          "score": 1,
          "created_utc": "2026-02-11 05:40:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4toezb",
              "author": "Hopeful-Fly-9710",
              "text": "what about a MEng (masters in engineering)",
              "score": 1,
              "created_utc": "2026-02-11 16:35:10",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4rni9b",
          "author": "Aromatic-Trouble-580",
          "text": "What do you plan to do, in the rocket industry, that others haven't already done, or aren't already doing?",
          "score": 1,
          "created_utc": "2026-02-11 08:39:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4toihw",
              "author": "Hopeful-Fly-9710",
              "text": "thats what i need to work out lmfao",
              "score": 1,
              "created_utc": "2026-02-11 16:35:37",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4rusux",
          "author": "space_nerd_82",
          "text": "Hypothetical question: \n\nIf you were going to pitch to https://moonshotspace.co/\n\nWith your rocket engine what is the point of difference between you and other rocket engine manufacturer’s?\n\nWhat is your experience with rocketry what skills and experience does your team have?  \n\nHave you run simulations on your rocket engine do you have the simulations and calculations?\n\nDo you have a business plan?\nDo you have a risk management strategy and safety plan? \n\nWhat would you do with say 100k initial funding?",
          "score": 1,
          "created_utc": "2026-02-11 09:48:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4tq121",
              "author": "Hopeful-Fly-9710",
              "text": "\"With your rocket engine what is the point of difference between you and other rocket engine manufacturer’s?\" i REAALLY  need to figure that out lol, \"What is your experience with rocketry what skills and experience does your team have?\" im heading towards joining the esa, possibly with a team from people in or about the esa, \"Have you run simulations on your rocket engine do you have the simulations and calculations?\" yes, for sure, \"Do you have a business plan? Do you have a risk management strategy and safety plan?\" i need to figure out a business plan, i have no experience with business, \"What would you do with say 100k initial funding?\" funding for rockets/team research for rocketry",
              "score": 1,
              "created_utc": "2026-02-11 16:42:39",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4uuerz",
                  "author": "space_nerd_82",
                  "text": "You seem keen to do this but if you actually pitched as you currently have to me an Angel investor or someone with venture capital would probably smile politely say something encouraging if polite and you would not hear from them again. \n\nYou have 4 current barriers . \n- You are trying to do everything yourself and you are going to burn out.\n- You don’t have a team .\n- You don’t have background or experience.\n- You have nothing that differentiates you from anyone else. \n\n\nHave you considered whilst you’re in high school starting out by flying basic hobby kits and joining a club \n\nSo what is your end goal are you just wanting to build rocket motors or are you wanting to build a full functional rocket? You need to figure this out. \n\nHow are you going to get to ESA or Orbex? \n\nWhat are you planning to study at university at a minimum you are going to need bachelor degree however you are probably going to need a master’s or a PHD. \n\nWhilst at university you could possibly do a short program at somewhere like the international space university like the space studies program \n\nhttps://www.isunet.edu/ssp/ this program you can get a partial scholarship and this will provide you with connections to network with.\n\nYou say you have run simulations but in r/rocketry subreddit you posted just the preliminary plan in possibly fusion360  but there was no dimensions or simulations as you didn’t want to risk your computer. \n\nBut you were willing to risk blowing yourself up with a kludged together prototype.\n\nhttps://ukra.org.uk/safety/launching-rockets/\n\nAngel investor do their homework and before providing funding will check to make sure your not a reputational risk that includes going through your socials. \n\nYou have said in other subs you needed certain things with 100k you could start acquiring those things make a list and then do a budget. \n\nA business plan isn’t really such a big mystery it is document that has the following points. \n\nhttps://www.gov.uk/write-business-plan\n\nIt sets out what you want to do what funds you have to achieve and do you have appropriate insurances licenses etc.\n\nYou seem to like the practical aspect of things but the problem is you either need to find people do those things or as a start up you need to do them yourself.\n\nThere is a proverb “How do you eat an elephant?” \n\nOne bite at a time at the moment you’re trying to eat the whole elephant at once and that isn’t going to work.",
                  "score": 1,
                  "created_utc": "2026-02-11 19:51:31",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4svnuz",
          "author": "Chriah",
          "text": "I saw your post on several other subreddits yesterday and for some reason I thought about it this morning and looked around for it again.\n\nAll of your interests from rockets, biology etc. will not be successful based solely technical skills or business knowledge.\n\nChris Hadfield is an incredibly successful person in just about every way. He wrote a book called “An Astronaut's Guide to Life on Earth: What Going to Space Taught Me About Ingenuity, Determination, and Being Prepared for Anything”. You need to read this book.\n\nOne thing Chris Hadfield says is that you need to look at a successful person and determine what skills and knowledge they have that lead to that success, and then how you can attain those skills. That’s what reading this book starts.\n\nIt’s not luck. It’s not being really smart magically, nobody is just smart or gifted. It’s not who you know or how much money you have. All of these things can help someone along a path, but that path must be deliberately chosen and developed.\n\nDon’t think people are in their positions because luck or age. Don’t assume you are smarter than people because 100% of the time you aren’t and can learn something from them.\n\nProfessional development > technical skills\nRead 7 habits, how to win friends and influence people, astronauts guide to life on earth, and more. These are the skills that will enable your success. Not every book is 100% right but everyone has something to teach.\n\nKnow your limitations but don’t consider them permanent. There is no ceiling for the hardworking and ambitious.\n\nIf you need a starter mentor, add me and send me a message. I’m not going to tell you how to build a perfect nozzle or what company to buy parts from, but I’ll help you develop into a professional who has the skills to do much more. I am not some weirdo who is looking for payment, just someone who wished they could’ve been given better advice.\n\nHow do you make a rocket startup? A convoluted path that is focused on development rather than a quick answer of “fill out XYZ form.”\n\nIf you are shooting for the stars and only make it halfway, you are still a million times more successful than most people. But that takes work.",
          "score": 1,
          "created_utc": "2026-02-11 14:13:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4tr797",
              "author": "Hopeful-Fly-9710",
              "text": "heres the thing, im wanting to shoot for the esa as early as possible, in the esa i will most likely be a engineer, ill get A-levels in physics and a MEng (masters in engineering), i know this will take alot of my tears sweat and blood but its something im willing to sacrifice, even thinking these things around my age is crazy, i dont know if i need a starter mentor just yet but i know i will need one sometime",
              "score": 1,
              "created_utc": "2026-02-11 16:48:03",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4tyxks",
                  "author": "Chriah",
                  "text": "You are still focusing on the entirely technical. None of which is helpful to the right now and won’t be the deciding factor on landing that amazing EAS position. Also, you might not even end up liking the profession!\n\nFocus on the here and now. Ensure you are excelling at life right now— school, socially, financially. Join clubs. Do applicable hobbies. Learn about investing. If you are really into rocketry, play through Kerbal Space Program without many mods. Make sure you read professional development books.\n\nWhen I started school for my engineering undergrad more than half the students dropped out before they even got to the “weeder” classes where even more students dropped out. They weren’t mature enough to handle even slightly hard content. They were told/believed that they were naturally smarter than others and folded like wet paper.\n\nThe most successful engineers I’ve seen are people who have applicable hobbies that started small and worked up/out and they also had broad interests and knowledge. But of all the skills that lead to success, they had interpersonal skills learned via actual effort, research, and training. \n\nChris Hadfields advice to young people is “Don’t just be an astronaut” which means, the highly successful have broad capabilities and interests, but the common thread is extreme interpersonal skills.",
                  "score": 1,
                  "created_utc": "2026-02-11 17:24:25",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qxiw0r",
      "title": "How good is Hostinger web hosting for startups?",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qxiw0r/how_good_is_hostinger_web_hosting_for_startups/",
      "author": "H_E_Mgayming",
      "created_utc": "2026-02-06 14:21:00",
      "score": 5,
      "num_comments": 25,
      "upvote_ratio": 1.0,
      "text": "I am looking at Hostinger for a new startup website and trying to weigh the pros and cons. I have seen that it is pretty affordable and seems to have good speed for shared hosting, but I am not sure how well it holds up under real use or with growth. Would like to hear from people who have actually used Hostinger for a startup or business site, especially for uptime, support quality, and overall reliability.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1qxiw0r/how_good_is_hostinger_web_hosting_for_startups/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o3wnwc0",
          "author": "Kitchen_Most2433",
          "text": "Works well for me",
          "score": 1,
          "created_utc": "2026-02-06 14:30:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3wvhox",
              "author": "H_E_Mgayming",
              "text": "I am mainly trying to understand how it holds up for startups long term. Pricing looks good at the start, but I want to know how performance, support, and scalability are once the site starts getting more traffic. Real experiences help more than promo reviews.",
              "score": 1,
              "created_utc": "2026-02-06 15:08:58",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3xhj2h",
                  "author": "Kitchen_Most2433",
                  "text": "I’m still early days but currently have 20 websites on my hostinger account and all goes well. Sometimes the caching fucks ups the sites though which is less than ideal lol.",
                  "score": 1,
                  "created_utc": "2026-02-06 16:53:30",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3wvfxv",
          "author": "sailormish980",
          "text": "If you r just starting then hostinger is the best platform out there \nBcz it is cheap for first time users and second easy to host nd maintain",
          "score": 1,
          "created_utc": "2026-02-06 15:08:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o41s9hh",
          "author": "Vaibhav_codes",
          "text": "If it sounds fun to build but awkward to explain who pays for it that’s my red flag.",
          "score": 1,
          "created_utc": "2026-02-07 08:17:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4fljla",
              "author": "H_E_Mgayming",
              "text": "Do you mean from a business model point of view, or more about client trust and explaining value early on?",
              "score": 1,
              "created_utc": "2026-02-09 13:55:32",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o47035c",
          "author": "iNavin",
          "text": "I have been on Hostinger for 5 plus years. I recommend it to everyone.",
          "score": 1,
          "created_utc": "2026-02-08 03:31:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4706mb",
              "author": "iNavin",
              "text": "Their support is good too.",
              "score": 1,
              "created_utc": "2026-02-08 03:32:24",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4fl197",
                  "author": "H_E_Mgayming",
                  "text": "Good to hear a long term perspective like that. Have you used it for just personal sites or any business or startup projects with steady traffic growth?",
                  "score": 1,
                  "created_utc": "2026-02-09 13:52:37",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4c956b",
          "author": "BudgetBon",
          "text": "Hostinger is the 'IKEA furniture' of web hosting. It is cheap, looks good, and gets the job done for a beginner, but don't expect it to hold up under **heavy load**.",
          "score": 1,
          "created_utc": "2026-02-08 23:34:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4flxv9",
              "author": "H_E_Mgayming",
              "text": "At what point did it start feeling limiting, traffic wise or feature wise?",
              "score": 1,
              "created_utc": "2026-02-09 13:57:48",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4fn485",
                  "author": "BudgetBon",
                  "text": "For traffic, it usually feels limiting once you hit **15k–20k monthly visitors** or have multiple users performing heavy actions simultaneously (like a busy WooCommerce store). Shared resources mean your site slows down if your 'neighbors' on the server get a traffic spike.",
                  "score": 1,
                  "created_utc": "2026-02-09 14:04:37",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4f9tmw",
          "author": "No-Signal-6661",
          "text": "I've been with Hostinger in the past, it's not bad, but the deal breaker for me was that they kept increasing their prices before each renewal, and the cost reached a point in which I was paying too much for what I've got. Looking for alternatives, I found out about Nixihost and they had a fair price, 120$ per year for 5 websites with SSL, security and backups included. I've been hosting white Nixihost for the past 2 years without issues. the support is great, my websites are fast and they haven't raised the price at all in this time. Totally worth checking them out!",
          "score": 1,
          "created_utc": "2026-02-09 12:42:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4fkjtf",
              "author": "H_E_Mgayming",
              "text": "That is helpful, thanks for sharing your experience. The renewal price jumps are exactly what I am worried about long term. When you switched, did you notice any big difference in performance or support response time compared to Hostinger, especially during traffic spikes?",
              "score": 1,
              "created_utc": "2026-02-09 13:49:47",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4ms7up",
          "author": "SEOMENTORASSISTANT",
          "text": "It's good 👍",
          "score": 1,
          "created_utc": "2026-02-10 15:53:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4s3zk8",
          "author": "Admirable_Gazelle453",
          "text": "Many founders I’ve talked to picked Hostinger because it’s affordable and performs well for basic business sites, and if you layer in a simple site builder it’s easy to scale your presence while keeping costs down with the buildersnest discount code",
          "score": 1,
          "created_utc": "2026-02-11 11:11:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4zrk67",
              "author": "Certain_Election_371",
              "text": "not working well for me",
              "score": 1,
              "created_utc": "2026-02-12 15:18:03",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3wr6tx",
          "author": "Jealous_Weekend193",
          "text": "Its good, just if you wanna buy please buy from my affiliate link , will earn some buck 🥹",
          "score": 0,
          "created_utc": "2026-02-06 14:47:11",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qxzw81",
      "title": "Am I the droid you’re looking for?",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qxzw81/am_i_the_droid_youre_looking_for/",
      "author": "Existing_Divide_7233",
      "created_utc": "2026-02-07 01:08:53",
      "score": 5,
      "num_comments": 5,
      "upvote_ratio": 1.0,
      "text": "I recently relocated countries and have been working on a few creative projects after a couple years working primarily in b2b sales and business development. \n\nNow looking for a remote sales role so my sales muscles don’t fade away xd \n\nand for money of course!\n\nI’ve worked mainly on outbound campaigns generating my own leads and closing them but I’m also experienced in closing inbound leads. \n\nIndustries are mainly training and development, education, renewables training, online courses and more.\n\nSo if you need an experienced sales / business development professional to close your leads or generate leads for you, I’m the droid you’re looking for.\n\nSystems wise I’ve used Salesforce, hubspot, salesnav, zoom info but I don’t mind if your set up is a google sheet and a dream.\n\nHappy to connect!",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1qxzw81/am_i_the_droid_youre_looking_for/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o40c8ox",
          "author": "UnoMaconheiro",
          "text": "The google sheet and a dream line got me haha. honestly thats like 80% of startups anyway. Good luck with the search man",
          "score": 2,
          "created_utc": "2026-02-07 01:46:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o45uxr1",
              "author": "Existing_Divide_7233",
              "text": "Appreciate it!",
              "score": 1,
              "created_utc": "2026-02-07 23:14:09",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o42mowl",
          "author": "Vaibhav_codes",
          "text": "Sounds like you’ve got a solid mix of outbound and inbound experience any team would be lucky to have your “droid” skills! Curious what’s been your most effective tactic for turning cold leads into actual conversations?",
          "score": 2,
          "created_utc": "2026-02-07 12:57:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o45v2df",
              "author": "Existing_Divide_7233",
              "text": "Finding the right person to talk to and actively listening when they talk.",
              "score": 1,
              "created_utc": "2026-02-07 23:14:56",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4otk5a",
          "author": "Big-Watercress-9943",
          "text": "If you’d work on a freelance basis/weekend gigs in case you are looking for a full time job, please let me know!",
          "score": 1,
          "created_utc": "2026-02-10 21:31:38",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r15gpe",
      "title": "How to Install and Operate Clawdbot / OpenClaw / Moltbot in 10 Minutes",
      "subreddit": "startup",
      "url": "/r/VibeCodersNest/comments/1r12dyp/how_to_install_and_operate_clawdbot_openclaw/",
      "author": "BymaxTheVibeCoder",
      "created_utc": "2026-02-10 16:29:40",
      "score": 5,
      "num_comments": 0,
      "upvote_ratio": 1.0,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1r15gpe/how_to_install_and_operate_clawdbot_openclaw/",
      "domain": "",
      "is_self": false,
      "comments": []
    },
    {
      "id": "1r2qy3u",
      "title": "No Product Market Fit means You’re wasting everyone’s time",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1r2qy3u/no_product_market_fit_means_youre_wasting/",
      "author": "XIFAQ",
      "created_utc": "2026-02-12 11:25:35",
      "score": 4,
      "num_comments": 7,
      "upvote_ratio": 0.84,
      "text": "Most startups don’t fail because of funding. They fail because they never had product–market fit.  \nFounders keep scaling ideas nobody truly needs, burning investor money, exhausting teams, and faking traction instead of solving real pain.\n\nThoughts ?",
      "is_original_content": false,
      "link_flair_text": "knowledge",
      "permalink": "https://reddit.com/r/startup/comments/1r2qy3u/no_product_market_fit_means_youre_wasting/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o4ypw20",
          "author": "jhickman1991",
          "text": "Been in that boat too many times, trying to launch a product with PMF, literally a waste of time and money. It lead me to co-founding Growthmind AI. We’re actually looking for 5 startups to launch and find product market fit for them for free, just asking for a case study in return if it works. DM me if interested and hopefully we can help",
          "score": 1,
          "created_utc": "2026-02-12 11:28:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4yq99u",
              "author": "XIFAQ",
              "text": "Sure. We can discuss. ",
              "score": 1,
              "created_utc": "2026-02-12 11:31:46",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4yqdup",
                  "author": "jhickman1991",
                  "text": "Great! Drop me a message when you’re free, happy to chat!",
                  "score": 1,
                  "created_utc": "2026-02-12 11:32:55",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o53votx",
          "author": "Willing-Training1020",
          "text": "Mostly agree but I'd push back a little. A lot of founders think they don't have PMF when really they just haven't talked to enough people or iterated fast enough. The line between no PMF and not yet PMF is blurry. That said yeah, scaling before you've nailed the core value prop is how most startups die. The best founders I've seen are brutally honest with themselves about whether people actually need what they're building or just say they do to be polite.",
          "score": 1,
          "created_utc": "2026-02-13 04:10:26",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qzpsd5",
      "title": "I can't find any business idea that's meant for me as of now",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qzpsd5/i_cant_find_any_business_idea_thats_meant_for_me/",
      "author": "Candid_Gold2003",
      "created_utc": "2026-02-09 00:35:56",
      "score": 3,
      "num_comments": 18,
      "upvote_ratio": 0.72,
      "text": "I am interested to be an entrepreneur but when I read other people's stories all I can think of is how less I know. I still gather the courage to start a small business but then I'm clouded with several ideas but no idea is a genius idea or something that I can sell easily. Then, I think of resources. I'm 22 and unemployed, I can't afford to get an office, stuidio or anything of that sort so I'd have to do a business from home but idk about the regulations. \n\nI'm always stuck between product vs service, if product then what can it be and idk a thing about manufacturing so yeah makes no sense. Service? what kind of services, business consulting or a pr firm? I've no clue..I see Saas is trending but I'm not good with tech, idk coding or anything that is related to building softwares or apps. I honestly have this desire to start something but I don't know what!! \n\nI'm not asking for a business idea, but can ppl with experience or even starters just share their thoughts & suggestions for my situation. ",
      "is_original_content": false,
      "link_flair_text": "business acumen",
      "permalink": "https://reddit.com/r/startup/comments/1qzpsd5/i_cant_find_any_business_idea_thats_meant_for_me/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o4cmzzz",
          "author": "Glitter_research901",
          "text": "You can't just want to be an entrepreneur and do it instantly, you need to wait until you have a viable idea and then how to implement it. You can't do something you aren't passionate about nor something you aren't focused on",
          "score": 2,
          "created_utc": "2026-02-09 00:52:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4dudj4",
          "author": "Safe_Source4537",
          "text": "Keep looking don't settle",
          "score": 1,
          "created_utc": "2026-02-09 05:04:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4e1dpl",
          "author": "ArmOk3290",
          "text": "A lot of founders start with service first because it needs less capital and teaches customer pain fast. Product can come later after patterns repeat.",
          "score": 1,
          "created_utc": "2026-02-09 05:58:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4el2za",
          "author": "Vaibhav_codes",
          "text": "You’re not stuck because you lack ideas you’re stuck because you’re expecting clarity before action Most founders start with skills and problems, not “genius” ideas",
          "score": 1,
          "created_utc": "2026-02-09 09:01:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4eo1ic",
          "author": "Willing-Training1020",
          "text": "Honestly at 22 and unemployed the best thing you can do is get a job first, maybe target work at a start-up. You'll learn way more about how businesses actually work, what problems people pay to solve, and you'll have income to fund experiments. Most good ideas come from noticing problems in jobs you've had or industries you've worked in, not from brainstorming in silo. Stop waiting for a genius idea, there's no such thing. Just start paying attention to what frustrates people and what they complain about spending money on. ",
          "score": 1,
          "created_utc": "2026-02-09 09:31:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4kwlbv",
              "author": "AttitudeMedical2357",
              "text": "Jumping into real work gives you frontline insight you just can’t get by guessing. If you’re serious about building a business and want to move faster, using frameworks and proven systems helps cut out wasted time. I found FoundNiche useful for turning everyday problems you see into real offers without second guessing every step.",
              "score": 2,
              "created_utc": "2026-02-10 07:57:47",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o4rtaq0",
              "author": "Hopeful-Dot9352",
              "text": "brother how to find a good decent startup",
              "score": 1,
              "created_utc": "2026-02-11 09:34:27",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o4ervv1",
          "author": "augusto-chirico",
          "text": "stop looking for the genius idea. start by noticing what annoys you or what's broken in your daily life. the best businesses come from problems you already understand, not from brainstorming in a vacuum.\n\nat 22 with no capital, service businesses are the move. pick something you're decent at, find people who need it, charge them. you don't need an office for that",
          "score": 1,
          "created_utc": "2026-02-09 10:09:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4f7uru",
          "author": "IdeasInProcess",
          "text": "I wasted years waiting for a perfect idea when I should have just looked for expensive manual work. You do not need an office or coding skills to offer a service like lead qualification or data entry. I built my current company by simply automating a process I had already performed manually five hundred times. You should focus on generating cash flow from a simple service before you worry about building a product.",
          "score": 1,
          "created_utc": "2026-02-09 12:27:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4fmmt5",
          "author": "arpit_0008",
          "text": "If you can develop an app then i can provide you the idea. If you are interested we can connect.",
          "score": 1,
          "created_utc": "2026-02-09 14:01:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4fvtzv",
          "author": "sanjivani__",
          "text": "Well I have found but don’t know how to move forward",
          "score": 1,
          "created_utc": "2026-02-09 14:53:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4g9hoy",
          "author": "PrettyRadio2073",
          "text": "First of all, take a deep breath. You are 22, and what you’re feeling is something I’ve seen in **hundreds of aspiring founders during my 15 years as a mentor** (after 20 years in global multinationals). You are stuck in the **'Circle of Limbo'**: overthinking the destination before even taking the first step. Here is the raw truth you won't find in 'hype' SaaS tweets:\n\n1. **Forget the 'Genius Idea':** Most successful businesses are built on 'boring' problems, not revolutionary inventions. Don't look for an idea; look for a person with a problem they are willing to pay to solve.\n2. **Service > Product (for now):** Since you have no capital and no tech skills, **start with a service**. It teaches you sales and operations without the cost of manufacturing.\n3. **The 'Frankenstein' Trap:** You’re worried about offices and regulations before you even have a single customer. That’s how you build a 'Frankenstein'—a structure with no soul. Your 'office' is your laptop.\n\nIn my book, **'StartUp Inferno'**, I explain that the deepest circle of failure is **Denial**. Don't deny your reality: you are an apprentice. Find a local business, offer to solve a specific problem for them, and start there.\n\nWhat is one skill you have right now that a 50-year-old business owner might struggle with?",
          "score": 1,
          "created_utc": "2026-02-09 16:01:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4idbh4",
          "author": "joshdotmn",
          "text": "what problems do *you* have?",
          "score": 1,
          "created_utc": "2026-02-09 22:08:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4jbdi7",
          "author": "Jealous_Weekend193",
          "text": "Its just the start mate, be same, always think, be consistent. There will be loads of failures coming so be ready, and just start thinking \n\nYou are going on the right track champ!",
          "score": 1,
          "created_utc": "2026-02-10 01:14:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4jtnj5",
          "author": "ShipTomorrow",
          "text": "All you really need at the beginning is one skill.\nThe ability to talk to people about your service. Start with a service, not a product. If you stay close to customers long enough, a product will naturally come out of that work. You will start seeing the real problems, the real gaps, and what people are actually willing to pay for. That is where good product ideas come from.\n\nThe real question is not whether you have the idea. It is whether you have the stomach to hear “no” today and still pick up the phone and continue your outreach tomorrow. Selling is the first skill. Everything else comes later.\n\nYou can always partner with the right people once you know what truly sells. Start selling what you use. If you don’t like to sell a service then look for a product to sell. Now think about how you will reach your first customer",
          "score": 1,
          "created_utc": "2026-02-10 03:01:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4k0ll6",
          "author": "Cupidai111",
          "text": "Have you considered solving a problem for yourself?",
          "score": 1,
          "created_utc": "2026-02-10 03:44:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4wvx7t",
          "author": "Aggressive-Brush-204",
          "text": "I've found small gigs helped me learn what i liked.",
          "score": 1,
          "created_utc": "2026-02-12 02:24:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4y7z3k",
          "author": "ProfessionalYouth676",
          "text": "If there are no difficulties to solve, there is no need for good ideas.",
          "score": 1,
          "created_utc": "2026-02-12 08:38:45",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qz6ck5",
      "title": "Automating My Startup’s Email Marketing With OpenClaw",
      "subreddit": "startup",
      "url": "/r/myclaw/comments/1qz0io5/how_i_connected_openclaw_to_gmail_beginner_step/",
      "author": "Front_Lavishness8886",
      "created_utc": "2026-02-08 11:13:13",
      "score": 3,
      "num_comments": 0,
      "upvote_ratio": 1.0,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": "knowledge",
      "permalink": "https://reddit.com/r/startup/comments/1qz6ck5/automating_my_startups_email_marketing_with/",
      "domain": "",
      "is_self": false,
      "comments": []
    },
    {
      "id": "1r04jdx",
      "title": "What to do with 30sqm free office space as tech startup?",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1r04jdx/what_to_do_with_30sqm_free_office_space_as_tech/",
      "author": "vdelitz",
      "created_utc": "2026-02-09 13:43:18",
      "score": 3,
      "num_comments": 10,
      "upvote_ratio": 1.0,
      "text": "Hi,\n\nWe have \\~30sqm open office space that we currently don't need for our tech startup (we co-rented with another startup who moved out). We used to be in the space with 9 desks ourselves before they moved out. I posted it on the common real estate portals to find preferrably another tech startup or agency but so far no interest, even though it's reasonably priced and quite spacious. Munich commercial real estate market just has too much offer in regard to demand IMO.\n\nWe don't really use it for ourselves and currently, it's just an empty space (ping pong table would be too loud as it's an open space with in our regular office). Thought about renting it out as flexible single spaces. However, I don't want to be burdened with the admin that something like that requires.\n\nDo you have any ideas on what I can do with it? (ping pong table is too loud)",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1r04jdx/what_to_do_with_30sqm_free_office_space_as_tech/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o4fkmh3",
          "author": "n1cepat",
          "text": "Have you thought about a ping pong table?",
          "score": 1,
          "created_utc": "2026-02-09 13:50:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4fn3iz",
              "author": "vdelitz",
              "text": "too loud ",
              "score": 1,
              "created_utc": "2026-02-09 14:04:30",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o4fp2ij",
                  "author": "n1cepat",
                  "text": "I was just joking haha\n\nDepends on your situation, if you can easily pay the extra rent you might think of adding other benefits for your team. E.g. I’ve read about startups that bought professional barber chairs and book a “private barber” for their employees every few weeks.\n\nOtherwise your co working idea seems reasonable, perhaps there’s some saas to reduce the admin burden.",
                  "score": 1,
                  "created_utc": "2026-02-09 14:15:50",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o4fpz4t",
          "author": "Vaibhav_codes",
          "text": "Consider offering it as a quiet coworking/hot desk space for freelancers or early stage startups could automate bookings with a platform like Deskbird or Croissant to reduce admin",
          "score": 1,
          "created_utc": "2026-02-09 14:20:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4frtbk",
              "author": "vdelitz",
              "text": "thanks, have you ever worked with Croissant?",
              "score": 1,
              "created_utc": "2026-02-09 14:31:07",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o4hv40c",
          "author": "Keyendeavors",
          "text": "I would just get a lot more aggressive on the base rate than what other buildings are quoting. Lot's of companies don't want to have to sign 3-5 year leases so offering it on a month to month basis helps.\n\nBut you gotta get aggressive on the rate",
          "score": 1,
          "created_utc": "2026-02-09 20:37:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4hvk4f",
          "author": "MainTarget9537",
          "text": "If renting it out is more hassle than it’s worth, I’d look at low-admin uses: a small meeting/workshop room you can book ad hoc, a quiet focus room, or even offering it short-term to partners, interns, or visiting contractors. You could also test a very lightweight sublet (one team, one contract) rather than flexible desks. Worst case, treat it as optional buffer space—it’s not wasted if it reduces future growth friction.",
          "score": 1,
          "created_utc": "2026-02-09 20:39:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4l51m5",
              "author": "vdelitz",
              "text": "like the idea very much ! where would you post it?",
              "score": 1,
              "created_utc": "2026-02-10 09:20:17",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r0eeq2",
      "title": "Would you guys let us create your website for free?👀",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1r0eeq2/would_you_guys_let_us_create_your_website_for_free/",
      "author": "IndependentLaw1457",
      "created_utc": "2026-02-09 19:48:08",
      "score": 3,
      "num_comments": 2,
      "upvote_ratio": 1.0,
      "text": "That’s a genuine question. We’re a Web Design Studio that basically operates on a “free services” basis, besides our usual paid plans. Basically, you get to try our services for free.\n\nWe’re fully transparent on how we do things, because we know how strange this may sound😂\n\nWe’re basically collaborating with almost every reputable Hosting Service that you could possibly think of, and in a nutshell, for any of their plans that you choose to host your website, we get paid by them. \n\nNot a percentage of what you pay for, it is a fixed commission. We’re not interested in making you pay for a higher priced plan, it makes no difference to us. \n\nWe’re not the best, and we’re not planning on being known as the best, but certainly care most. That being said, if it sounds like something that might benefit you or someone you know, feel free to reach out to us, here’s a link to our website: https://thatfreewebsite.net \n\nThank you for taking the time to read our message, and I hope everyone is having a really great day!!🫶🏻",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1r0eeq2/would_you_guys_let_us_create_your_website_for_free/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o4hvtp0",
          "author": "NationalVast6340",
          "text": "Fair plays lads. I have a vending machine business and built my own website but if I had of known you’d were doing it for free I would have give yous a shout.\n\nKeep up the good work 💪🏽",
          "score": 2,
          "created_utc": "2026-02-09 20:41:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4ocg4n",
              "author": "IndependentLaw1457",
              "text": "Thank you so much🥹",
              "score": 1,
              "created_utc": "2026-02-10 20:12:10",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r1wc34",
      "title": "Lorum vs Banking Circle for EU account infra?",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1r1wc34/lorum_vs_banking_circle_for_eu_account_infra/",
      "author": "emmaparkin99",
      "created_utc": "2026-02-11 12:41:23",
      "score": 3,
      "num_comments": 2,
      "upvote_ratio": 1.0,
      "text": "Hey. Building a regulated platform where money comes in, sits pending for a bit, then goes out. It is a marketplace plus some subscription flows, so matching references matters. Initial launch is EUR/GBP collections, then we add USD for international payuts, and GCC later with AED and BHD.\n\nFrom the infra side, I care about boring stuff. Consistent IDs between API, webhook, and statements. Clear statuses when something gets returned or stuck. And support that does not go silent when an investigation starts. I have seen teams drown in exceptions because the provider story looks great until month-end close, then it gets ugly fast.\n\nBanking Circle gets mentioned a lot for EU account infrastructure. Lorum is also on the shortlist.\n\nAnyone used either in prod?",
      "is_original_content": false,
      "link_flair_text": "marketing",
      "permalink": "https://reddit.com/r/startup/comments/1r1wc34/lorum_vs_banking_circle_for_eu_account_infra/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o4usse4",
          "author": "AndyIsNotKuhl",
          "text": "One thing that really matters if you care about getting predictable outcomes is what I’ll call an intake to recon flow how easy is it to map an incoming collection event through to settlement with as little human context as possible? The teams that get this right tend to:\n\n* define a canonical reference early in the flow\n* treat webhook payloads as first class sources of truth not notifications\n* model statuses conservatively so pending isn’t confused with done\n\nI’ve also seen tools that mesh visibility into those flows not just dashboards cut down support cycles a lot. For example, with some of the newer AI aligned tracking layers like SyndrAI, the value came from removing ambiguity around what was being tracked and what was out of scope it wasn’t about hype, it was about having a single place to compare API events vs what landed in reporting.",
          "score": 1,
          "created_utc": "2026-02-11 19:43:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o50fcqk",
          "author": "CreativeSpare6466",
          "text": "Banking Circle is probably your best bet for the EU leg honestly. solid SEPA coverage, decent account infra and a LU banking license. \n\nLorum is more of a global play from what I see, single integration across markets rather than bolting on providers as you expand. If your GCC phase is definite and not just a maybe, worth looking at them earlier rather than later since adding AED/BHD through a separate provider later is a pain.",
          "score": 1,
          "created_utc": "2026-02-12 17:09:36",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}