{
  "metadata": {
    "last_updated": "2026-02-02 09:09:57",
    "time_filter": "week",
    "subreddit": "startup",
    "total_items": 18,
    "total_comments": 77,
    "file_size_bytes": 76410
  },
  "items": [
    {
      "id": "1qr3yf5",
      "title": "Biggest thing we got wrong moving from beta to public",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qr3yf5/biggest_thing_we_got_wrong_moving_from_beta_to/",
      "author": "coggyboy",
      "created_utc": "2026-01-30 12:21:17",
      "score": 14,
      "num_comments": 5,
      "upvote_ratio": 1.0,
      "text": "We recently opened up **Origami Tech** to the public after running a small beta. It’s a no code crypto automation platform and the biggest learning so far has been how differently early users behave compared to how we expected on paper.\n\nIf you’ve taken something from beta to public, what was the biggest mismatch between your assumptions and real usage?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1qr3yf5/biggest_thing_we_got_wrong_moving_from_beta_to/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o2lh4ia",
          "author": "Willing-Training1020",
          "text": "biggest mismatch for me was assuming people would at least read 😢 beta users were invested and figured stuff out, public users bounce the second something isn't obvious. onboarding and ux clarity mattered way more than i expected. curious what surprised you most with origami, did you get any feedback?",
          "score": 1,
          "created_utc": "2026-01-30 13:07:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2vea2f",
              "author": "coggyboy",
              "text": "This hit home 😅 same experience here. Beta users explored, public users want instant clarity. For Origami Tech, the biggest surprise was how quickly users bounced if results weren’t obvious right away. Onboarding mattered way more than we expected.",
              "score": 1,
              "created_utc": "2026-01-31 22:45:45",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2od54w",
          "author": "RoleHot6498",
          "text": "Being under capitalized to deal with the demand",
          "score": 1,
          "created_utc": "2026-01-30 21:12:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2vgi3l",
              "author": "coggyboy",
              "text": "Both of these resonate. Moving public showed us how impatient real users are compared to beta, anything that wasn’t immediately clear caused drop-off, so onboarding and UX ended up mattering far more than docs. At the same time, it forced us to think more seriously about pacing growth and constraints instead of just chasing demand. A lot of assumptions get stress-tested the moment real users show up",
              "score": 1,
              "created_utc": "2026-01-31 22:57:15",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2z86m4",
                  "author": "RoleHot6498",
                  "text": "Definitely something founders miss when transitioning from beta to live demand. The role funding and cash flow play in facilitating smooth growth is vital",
                  "score": 1,
                  "created_utc": "2026-02-01 14:54:07",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qstjgl",
      "title": "How a B2B company makes millions with their tiny Youtube channel",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qstjgl/how_a_b2b_company_makes_millions_with_their_tiny/",
      "author": "illeatmyletter",
      "created_utc": "2026-02-01 09:02:46",
      "score": 13,
      "num_comments": 0,
      "upvote_ratio": 0.93,
      "text": "I came across this breakdown and it completely flipped how I thought about YouTube. Figured it might be valuable for you as well.\n\nMost founders assume YouTube only works if you go big. Massive subscriber counts, viral videos, influencer-level reach. But this case study proves that's wrong, well at least for B2B.\n\nThere's a small company in immigration + tax optimization. Nothing sexy. Their average client pays around $2,000 though. Their YouTube channel has maybe 1,000 to 1,500 subscribers. And from that channel alone, they've booked 500+ sales calls. That's easily seven figures in revenue from what most people would call a \"dead\" channel.\n\nBut it gets crazier… They get only around 350 to 400 views per day. About 30 videos total. But they close roughly half their calls. They even spun up a second channel in another language with under 30 subscribers, and it already brought in multiple paying clients.\n\nThis is why B2B YouTube is a completely different game.\n\nSubscriber count is a vanity metric. What actually matters:\n\n* Who's watching: are they decision-makers or random browsers?\n* Why they're watching: are they actively looking for a solution?\n* How much one customer is worth: if a client pays $2k, $10k, or more, you don't need scale\n\nThe videos that drive revenue on this channel aren't flashy. They're boring, high-intent, search-driven stuff: \"how to get residency in X,\" \"best tax residency for digital nomads,\" country comparisons etc. These aren't entertainment videos. They're decision-stage videos, which means the viewer is already problem-aware and actively searching for a solution. That's why they convert.\n\nIf you're selling something where one customer is worth a few thousand dollars or more, obsessing over subscriber count makes no sense. A small channel with the right topics can outperform a larger audience watching for entertainment. The leverage comes from intent, not scale.\n\nI’d love to hear form other founders to see if you’ve had similar results? Have any of you tried YouTube as an acquisition channel? What results did you see?",
      "is_original_content": false,
      "link_flair_text": "marketing",
      "permalink": "https://reddit.com/r/startup/comments/1qstjgl/how_a_b2b_company_makes_millions_with_their_tiny/",
      "domain": "self.startup",
      "is_self": true,
      "comments": []
    },
    {
      "id": "1qo5opn",
      "title": "How do startups handle accounting and compliance when expanding internationally?",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qo5opn/how_do_startups_handle_accounting_and_compliance/",
      "author": "sunmc_",
      "created_utc": "2026-01-27 06:01:39",
      "score": 12,
      "num_comments": 5,
      "upvote_ratio": 1.0,
      "text": "I’ve been trying to better understand what really happens *behind the scenes* when a startup begins expanding into multiple countries.\n\nEarly on, accounting is usually simple. But once you start opening entities abroad, hiring internationally, or working with global investors, things seem to get complicated fast — especially around compliance, reporting, and tax structures.\n\nI’ve noticed that larger corporate services firms (for example, groups like JTC that work in fund and corporate administration) often support companies operating across multiple jurisdictions. That got me wondering how startups *before reaching that scale* usually deal with these challenges.\n\nSome things I’m curious about:\n\n* At what stage do startups typically move from a local accountant to a more international accounting structure?\n* How do founders manage multi-country compliance without building a huge in-house finance team?\n* What are the biggest early mistakes startups make with entity structuring when planning to scale globally?\n* Do most startups centralize finance in one country, or run things locally in each market?\n\nNot looking to hire or promote anything — just hoping to learn from founders or finance folks who’ve gone through international expansion.\n\nWould love to hear real experiences, especially lessons learned the hard way.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1qo5opn/how_do_startups_handle_accounting_and_compliance/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o1z10uf",
          "author": "AnaSilva10x",
          "text": "I'm curious in how startups handle accounting and compliance as they go global. What are the biggest first errors in entity structure or multi-country compliance, and when do founders stop using a local accountant? I'd be interested in learning actual lessons.",
          "score": 1,
          "created_utc": "2026-01-27 06:36:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1zekel",
          "author": "_maddy18",
          "text": "Having very few years of experience and knowledge. I have worked for a startup who was active in multiple countries. There we used to do inhouse accounting and everything was done by Indian accountant itself. For additional safety for compliance and knowledge purpose an external consultant contract is madhe who guides the local accountant what and how to manage. \nBased on information, when a startup starts to scale in other countries there needs to be full time account person. This is triggered when compliance get more and more complex.\nWhen a company reaches mnc level it has a entire different team to handle this. Currently where i am working they have a seperate company full decided to monitor entire finance of group companies along with separate finance team for each companies.\nThis all information is based on small amount of experience.",
          "score": 1,
          "created_utc": "2026-01-27 08:34:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1zhr5t",
          "author": "Life-Recognition-997",
          "text": "Great questions, from what I’ve seen most startups lean on EORs and fractional finance early on to avoid entity complexity, and if you’re open to it I’d be happy to connect and swap notes on what founders usually learn the hard way.",
          "score": 1,
          "created_utc": "2026-01-27 09:03:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1zniiq",
          "author": "mandevillelove",
          "text": "Most startups outsource to global accounting/PEO firms early, centralise finance, and only build in house once scale forces it.",
          "score": 1,
          "created_utc": "2026-01-27 09:57:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o20505t",
          "author": "PapayaGlobalOfficial",
          "text": "A great partner with experience in the field and on the ground experts.",
          "score": 1,
          "created_utc": "2026-01-27 12:20:50",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qqzswr",
      "title": "I built a natural language builder for non-tech experts. [Launching today, we’d love your support!]",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qqzswr/i_built_a_natural_language_builder_for_nontech/",
      "author": "Remote-Preference484",
      "created_utc": "2026-01-30 08:23:58",
      "score": 11,
      "num_comments": 0,
      "upvote_ratio": 0.84,
      "text": "Hi fellow builders & productivity lovers! We’re super excited to introduce our first Product Hunt launch - **Leapility**.\n\nLeapility is built to reduce repetitive work and tool-hopping when using AI.\n\nYou describe your playbook in plain language, add your sources, steps, tools, and rules in one place, then hit run and let AI execute it.\n\nIt’s designed for domain experts and small teams, especially non-technical ones, who already have clear processes but don’t want to wire everything together with nodes or prompts.\n\nWe’re early and would really value feedback from this community. Your support and feedback mean a lot! 🙌\n\n👉 [https://www.producthunt.com/products/leapility-3?launch=leapility-3&utm\\_source=reddit&utm\\_campaign=reddit%2520ph%2520posts](https://www.producthunt.com/products/leapility-3?launch=leapility-3&utm_source=reddit&utm_campaign=reddit%2520ph%2520posts)",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1qqzswr/i_built_a_natural_language_builder_for_nontech/",
      "domain": "self.startup",
      "is_self": true,
      "comments": []
    },
    {
      "id": "1qp1abk",
      "title": "I built a caffeine tracker based on actual pharmacokinetics because standard logging apps weren't accurate enough. Giving away free access for feedback.",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qp1abk/i_built_a_caffeine_tracker_based_on_actual/",
      "author": "pythononrailz",
      "created_utc": "2026-01-28 04:23:46",
      "score": 9,
      "num_comments": 9,
      "upvote_ratio": 1.0,
      "text": "Hi everyone,\n\nI’m a software engineering student who recently launched my first native iOS app, Caffeine Curfew.\n\nI realized that most caffeine trackers on the App Store are just glorified counters. They log what you drank, but they don't account for the metabolic decay (half life) of the stimulant. I wanted to build something that actually tells you when you’ll be able to sleep, based on the biology of how caffeine breaks down.\n\nI built this using SwiftUI to be as lightweight and native as possible. It visualizes your caffeine \"stack\" decaying in real time so you can optimize your productivity window without ruining your sleep hygiene.\n\nAs a solo student founder, I don’t have a marketing budget, so I’m relying on product quality and word of mouth. I’d love to get some eyes on the UI/UX and the overall utility from this community.\n\nTo say thanks for your time, I’m giving away 1 year Pro codes to anyone in this sub who wants to test it out.\n\nJust drop a comment below and I’ll DM you a code.\n\nI’m open to brutal feedback, roast the UI, the onboarding, or the features. I just want to make the best utility tool possible.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1qp1abk/i_built_a_caffeine_tracker_based_on_actual/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o26c9kr",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 3,
          "created_utc": "2026-01-28 07:30:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o28fnsf",
              "author": "pythononrailz",
              "text": "Thank you!! The whole experience has been a blast.",
              "score": 1,
              "created_utc": "2026-01-28 15:56:57",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o28hqc6",
                  "author": "[deleted]",
                  "text": "[removed]",
                  "score": 2,
                  "created_utc": "2026-01-28 16:05:52",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2781z8",
          "author": "More_Spend6830",
          "text": "This is a solid idea. Modeling caffeine decay makes a lot of sense.",
          "score": 2,
          "created_utc": "2026-01-28 12:06:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o28fqoq",
              "author": "pythononrailz",
              "text": "Would you like a promo code?",
              "score": 1,
              "created_utc": "2026-01-28 15:57:18",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2mv7xj",
          "author": "CK_LouPai",
          "text": "Hi, can you use this to brew my Coffee exactly when I want it most so I don't have to face life fully sober ever?  ",
          "score": 2,
          "created_utc": "2026-01-30 17:08:05",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qppnp7",
      "title": "I feel like Idk much about business and I want to learn",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qppnp7/i_feel_like_idk_much_about_business_and_i_want_to/",
      "author": "Candid_Gold2003",
      "created_utc": "2026-01-28 22:08:08",
      "score": 8,
      "num_comments": 17,
      "upvote_ratio": 0.9,
      "text": "I'm not an entrepreneur/business owner, I'm just a fresher, but I've researched a lot about business & I've some idea. But, I think I don't know enough. The secrets about having a successful startup/business are certainly not taught online or via courses (I hope I'm wrong), so what resources are available to learn everything about having a business? How can I possibly learn and know things in-depth? Please don't tell me about starting a small business first, that much even ik..I wanna know more. \n\nP.s. I'm open to work as an unpaid intern if you can teach me for a month. ",
      "is_original_content": false,
      "link_flair_text": "business acumen",
      "permalink": "https://reddit.com/r/startup/comments/1qppnp7/i_feel_like_idk_much_about_business_and_i_want_to/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o2avern",
          "author": "Ok_Net_8346",
          "text": "The school of entrepreneurship is like the school of life. You learn by trial and error. \n\nIf you have ideas, you can start by creating a business model canvas. You will be able to find the pros and cons.\n\nAnd ask your friends and family what they honestly think of your idea: does it solve a problem or meet a need.\n\nBon chance mon ami 🙂",
          "score": 6,
          "created_utc": "2026-01-28 22:19:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2b03hx",
              "author": "Candid_Gold2003",
              "text": "Thank you very much!",
              "score": 1,
              "created_utc": "2026-01-28 22:42:08",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2bfevv",
          "author": "swiftbursteli",
          "text": "Start one! Start simple. \n\nWhat bothers you in a day to day? What’s something you do that has something you wish had a solution",
          "score": 2,
          "created_utc": "2026-01-29 00:00:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2c42hq",
              "author": "adardev",
              "text": "While I’m confident in building a strong hardware-software prototype, I do have concerns about go-to-market challenges. Market acceptance isn’t always guaranteed, and factors like customer relationships or competitive positioning, sometimes decided over something as simple as a dinner meeting, can influence outcomes significantly. Even with all the skills to build the product, it’s the challenge of selling it that holds me back.",
              "score": 2,
              "created_utc": "2026-01-29 02:13:03",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2cggcs",
                  "author": "swiftbursteli",
                  "text": "I’m at that challenge right now! Going through it.\n\nIt’s the only path forward. Even if it’s scary and it’s hard, it’s the only way to generate sales",
                  "score": 2,
                  "created_utc": "2026-01-29 03:21:18",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o2dhtum",
                  "author": "Sheenpipin",
                  "text": "Product is something that you build bottom up. Meaning that you first identify a gap between need and solutions available in the market. That is a pain point which you need to focus on. Based on that you build a product. That gives the product the necessary grounding in the market for ultimately the product has to succeed in the market in order to survive or else one would waste one’s time, effort and money on building something that no one needs.",
                  "score": 2,
                  "created_utc": "2026-01-29 07:53:42",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2cioub",
          "author": "No-Equivalent-8726",
          "text": "Agreed, you can only learn the concepts of entrepreneurship and business in the schools or through online courses, but at the end, actual business and entrepreneurship involve a lot of random things when you start executing, which you can only tackle based on your confidence, experience, and skills.\n\nFrom my experience, you can learn practical things and gain a lot of exposure to entrepreneurship by working in a family business or with fellow entrepreneurs first. It's like you are putting your legs in someone else's shoes. I worked under many leaders in multiple organisations previously, and then I co-founded 5 years ago. But my story is different, as I am the first-generation entrepreneur and engineer in my whole direct and indirect family. \n\nWith that said, everyone's story and their inspiration, motivation and aspiration is different.",
          "score": 2,
          "created_utc": "2026-01-29 03:34:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2cwgns",
          "author": "Foreign_Advantage_75",
          "text": "Read The E-Myth",
          "score": 2,
          "created_utc": "2026-01-29 05:02:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2djfcz",
          "author": "Vaibhav_codes",
          "text": "Read books, study real companies, and watch how founders make decisions An internship or shadowing a startup is the fastest way to learn practical business acumen.",
          "score": 2,
          "created_utc": "2026-01-29 08:07:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2dx2gi",
          "author": "Maleficent_Smoke1993",
          "text": "You’re not wrong. Most startup content teaches what to do, not how decisions are get made when things are unclear.\n\nWhat helped me was reading founder failure stories, paying attention to how founders decide what not to do early, and spending time in spaces where execution and trade-offs are discussed honestly.\n\nThere isn’t one place that teaches “everything”, depth comes from seeing the same problems repeat in different contexts.",
          "score": 2,
          "created_utc": "2026-01-29 10:14:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2cjby6",
          "author": "AcanthisittaNo6174",
          "text": "Where u based? Would you do sales? It’s a great starting point",
          "score": 1,
          "created_utc": "2026-01-29 03:38:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2dn6hg",
          "author": "camvill",
          "text": "Businesses are a reflection of your growth and development.  They grow with you.  A lot of trial and error, or, you look for a mentor and work with them side by side.  It's a lot easier to accelerate growth if you have knowledge from someone who's already been there.",
          "score": 1,
          "created_utc": "2026-01-29 08:42:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2kf3rq",
          "author": "MissionElk1785",
          "text": "The real stuff isn't in courses, it's in solving actual problems for real people. Find a business owner in your area and ask to shadow them for free, or better yet, find customers with problems you can solve and try to solve them. You'll learn more in a week of talking to frustrated customers than in months of reading startup blogs",
          "score": 1,
          "created_utc": "2026-01-30 07:58:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2kvgkx",
          "author": "Different_Pain5781",
          "text": "You probably know more than you think already.",
          "score": 1,
          "created_utc": "2026-01-30 10:26:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o31gt83",
          "author": "TheQuatum",
          "text": "Seeking information and knowledge is the first step. The hope is that you will be able to find some good information and help here.",
          "score": 1,
          "created_utc": "2026-02-01 21:12:35",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qocoq5",
      "title": "Making money without any specific skills is possible?",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qocoq5/making_money_without_any_specific_skills_is/",
      "author": "Latter-Wolf4868",
      "created_utc": "2026-01-27 12:37:23",
      "score": 7,
      "num_comments": 24,
      "upvote_ratio": 0.82,
      "text": "Hey guys, can anyone tell me if there is any way I can make money online without having any specific skills or maybe give a 1month time into learning something that will help me make at least 300$ a month at least. \n\n\nPlease guys If anyone have any idea or have done this maybe it'll be a great help I just want to make the bare minimum and somehow afford a stable laptop and later think big. Please consider giving your time in replying me, I will help alot ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1qocoq5/making_money_without_any_specific_skills_is/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o208ku9",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 2,
          "created_utc": "2026-01-27 12:44:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2095m7",
              "author": "Latter-Wolf4868",
              "text": "What's the website even about I see nothing there just a bunch of random letters and loading widgets",
              "score": 1,
              "created_utc": "2026-01-27 12:48:36",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o20e3dm",
                  "author": "[deleted]",
                  "text": "[removed]",
                  "score": 1,
                  "created_utc": "2026-01-27 13:18:11",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o20dr86",
          "author": "Routine_Warthog2336",
          "text": "I was in a similar spot and I’ll be honest: there’s no legit “no skill, instant money” thing that’s sustainable. But $300/month *is* realistic if you give one month to learning something simple. Stuff like basic data entry + Excel, simple Canva design, content formatting, or outreach support for small businesses. These aren’t “passions,” just tools. Learn one, apply it on Upwork/Fiverr/Reddit gigs consistently, and take low-paying work at first to build proof. It’s slow, but it’s real.",
          "score": 2,
          "created_utc": "2026-01-27 13:16:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o26hsbb",
          "author": "Vaibhav_codes",
          "text": "Yes! You can start with microtasks, testing websites, or simple freelance gigs With 1 month of focus, learning basic writing, Canva design, or social media management can realistically help you earn $300/month",
          "score": 1,
          "created_utc": "2026-01-28 08:18:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o29iw6y",
          "author": "shazej",
          "text": "I’ll be blunt but honest: there’s basically no reliable way to make money online with zero skills. Anyone saying otherwise is usually selling something.\n\nThe good news is that $300/month is very achievable if you’re willing to spend a few weeks learning something practical. You don’t need to “learn tech” in a deep way either.\n\nThings I’ve seen work for people:\nBasic no-code tools (Webflow, Notion, Airtable) for small businesses\nSimple WordPress site setup (not design, just setup + fixes)\nVirtual assistant work once you can handle email, docs, and research reliably\n\nNone of these are glamorous, but they’re real and doable. Focus on one thing ignore anyone promising fast money and treat it like learning a trade\nnot a hack.",
          "score": 1,
          "created_utc": "2026-01-28 18:46:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o29nnvd",
          "author": "BitterEarth6069",
          "text": "Do vibe coding ",
          "score": 1,
          "created_utc": "2026-01-28 19:06:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2bc17d",
          "author": "ThinkSpinach3762",
          "text": "Apply for remote personal assistant jobs?",
          "score": 1,
          "created_utc": "2026-01-28 23:42:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2c3w8p",
              "author": "Latter-Wolf4868",
              "text": "Can you guide me If you have any knowledge in this on your free time",
              "score": 1,
              "created_utc": "2026-01-29 02:12:06",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2bcfuq",
          "author": "StunningAd4284",
          "text": "Digital marketing, faceless with Al avatars",
          "score": 1,
          "created_utc": "2026-01-28 23:44:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2mwoor",
          "author": "CK_LouPai",
          "text": "Yup, you are looking for a business degree.",
          "score": 1,
          "created_utc": "2026-01-30 17:14:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o22bz6l",
          "author": "SoftDevilBC",
          "text": "It's possible you can learn while actually doing it. I've a platform in my account, you can try if it's fit you or you can search for affiliat program, there're lot of.",
          "score": 0,
          "created_utc": "2026-01-27 18:38:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o23ekoj",
              "author": "Mdbeast09",
              "text": "pls put the details here.",
              "score": 1,
              "created_utc": "2026-01-27 21:29:15",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o20wkse",
          "author": "highcoeur",
          "text": "Op try out [this app](https://attapoll.app/join/zrcsh) you’ll make $300 per month with no skills",
          "score": -2,
          "created_utc": "2026-01-27 14:53:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o21e6tx",
              "author": "Latter-Wolf4868",
              "text": "Interestingly not available in my region",
              "score": 1,
              "created_utc": "2026-01-27 16:13:18",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qnchkp",
      "title": "AI Influencer app market is tough",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qnchkp/ai_influencer_app_market_is_tough/",
      "author": "Strangewhisper",
      "created_utc": "2026-01-26 10:28:48",
      "score": 6,
      "num_comments": 8,
      "upvote_ratio": 0.8,
      "text": "Last week I posted a video using an AI influencer on X and it got 3k views within 6 days and my X account is not much active. So, I decided to do a bit of market research and found out that top competitors of global markets are Synthesia, Avatarify, Replica etc. But most of them are costly and user retention is pretty low. But the main pain points are deep personalization and niche focus. Would you build an AI influencer app ? What are the things you would improve or like to add ? ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1qnchkp/ai_influencer_app_market_is_tough/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o1sodn5",
          "author": "Life-Recognition-997",
          "text": "AI influencer can work, but only if it’s **niche-first + workflow-first** (e.g., daily shorts for realtors/fitness coaches) — “generic avatar app” retention is brutal.  \nI’d bet on **deep personalization** (voice/style memory, brand kit, consistent character bible) + **1-click distribution** (scripts→video→auto-post + analytics).  \nWhat niche + repeatable job-to-be-done are you anchoring on, and how will you prove week-4 retention?",
          "score": 3,
          "created_utc": "2026-01-26 10:36:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1spgoo",
              "author": "Strangewhisper",
              "text": "I'm just analysing the idea and want some insights from founders.",
              "score": 1,
              "created_utc": "2026-01-26 10:46:01",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1zhm6d",
                  "author": "Life-Recognition-997",
                  "text": "Happy to connect if you’re open to it, would be great to exchange notes and learn from your experience.",
                  "score": 2,
                  "created_utc": "2026-01-27 09:02:37",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1toewu",
          "author": "workpage_dev",
          "text": "That market is so saturated at the moment",
          "score": 3,
          "created_utc": "2026-01-26 14:33:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2dzd3k",
          "author": "Strangewhisper",
          "text": "This analysis is from something I’m building to help founders avoid wasting months on crowded ideas.",
          "score": 1,
          "created_utc": "2026-01-29 10:35:27",
          "is_submitter": true,
          "replies": []
        }
      ]
    },
    {
      "id": "1qnxq2c",
      "title": "is performance marketing just paid ads, or something more?",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qnxq2c/is_performance_marketing_just_paid_ads_or/",
      "author": "Sufficient-Owl1826",
      "created_utc": "2026-01-27 00:04:42",
      "score": 5,
      "num_comments": 5,
      "upvote_ratio": 0.86,
      "text": "I keep seeing people use \"performance marketing\" as a fancy way to say paid ads, but I assume that's not all it is? For a small business, ads alone don't mean much if the landing page doesn't convert or the offer isn't clear. And I've seen campaigns with good CPCs still lose money because retention was weak or checkout had issues.\n\nWhat I want to know is where performance marketing really starts and ends. Is it mostly about media buying, or is it more about testing creatives, fixing funnels, making sure the numbers actually work? At what point does it stop being ads and start being business optimization?\n\nAsking because I don't have the budget to waste, and looking at [performance marketing](https://orangetrail.io/performance-marketing/) pricing I need to know what actually moves profit, not just traffic. Curious how others here define it and what matters more for you guys.",
      "is_original_content": false,
      "link_flair_text": "digital marketing",
      "permalink": "https://reddit.com/r/startup/comments/1qnxq2c/is_performance_marketing_just_paid_ads_or/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o202746",
          "author": "Life-Recognition-997",
          "text": "Performance marketing goes beyond paid ads and is really about owning the whole revenue equation, from creative and targeting to landing pages, conversion rates, retention, and unit economics, with ads just being the traffic lever.",
          "score": 2,
          "created_utc": "2026-01-27 12:00:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o27d0gd",
              "author": "Sufficient-Owl1826",
              "text": "this is the clearest way I've seen it explained, thank you",
              "score": 1,
              "created_utc": "2026-01-28 12:40:03",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1zyzeq",
          "author": "Willing-Training1020",
          "text": "yeah performance marketing is basically paid ads but the \"performance\" part means you're supposed to be optimizing the whole funnel, not just traffic. make sure that your landing page and/or offer is good! i'd honestly fix your funnel with organic traffic first before spending on ads. it's really cheaper to learn what converts that way. can i ask what are you selling?",
          "score": 1,
          "created_utc": "2026-01-27 11:36:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o27cx2s",
              "author": "Sufficient-Owl1826",
              "text": "that makes sense and I agree, ads just amplify whatever funnel you already have. I like the thing with pressure-testing the offer and page with organic traffic first before paying to learn the same lessons. We're selling a pretty simple line of products, accessories for gadgets, people like them",
              "score": 1,
              "created_utc": "2026-01-28 12:39:25",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qrxj1f",
      "title": "I really don't like marketing..",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qrxj1f/i_really_dont_like_marketing/",
      "author": "neivelda",
      "created_utc": "2026-01-31 09:04:15",
      "score": 5,
      "num_comments": 10,
      "upvote_ratio": 1.0,
      "text": "Does anyone have some tips and tricks related to this? It's never been our strong suit. We recently launched our app and we set up all of these social media accounts everywhere, but what now?\n\nI've done the Instagram grind before but that was more personal and I had nothing to \"sell\" then.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1qrxj1f/i_really_dont_like_marketing/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o2rplsz",
          "author": "harv_89",
          "text": "You’re not alone, a lot of builders feel that way. It helps to think of it less as “marketing” and more as just talking to people who might actually have the problem you’re solving. Social posts are fine, but real conversations usually teach you way more early on.",
          "score": 3,
          "created_utc": "2026-01-31 10:39:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2rswg9",
              "author": "SEOMENTORASSISTANT",
              "text": "Sounds good 👍",
              "score": 2,
              "created_utc": "2026-01-31 11:10:05",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2rthyv",
                  "author": "harv_89",
                  "text": "Best of luck with it all!",
                  "score": 1,
                  "created_utc": "2026-01-31 11:15:31",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2u7twl",
          "author": "Anxious_Phase6553",
          "text": "I hate the whole idea! I do it because it is a must in my business but I do not enjoy it at all! I think there is a trick to it but not discovered it yet?",
          "score": 2,
          "created_utc": "2026-01-31 19:16:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2rss29",
          "author": "SEOMENTORASSISTANT",
          "text": "Yes it happens if you are not a marketing person but don't worry you can do one thing think I like this if you have a product and it is not seeing on google 1st page then how your product will sell ?? RIGHT IT MEANS IF YOUR APP IS NOT APPERING ON App store and play store with that keyword then who will download it ...\n\nDm me for more help and discussion",
          "score": 1,
          "created_utc": "2026-01-31 11:08:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2t6r1r",
          "author": "StillLoadingit",
          "text": "That’s way more common than people admit. A lot of founders don’t *like* traditional marketing, but what really matters is understanding your users and showing up where they already are, which feels a lot less like “marketing” and more like solving real problems.",
          "score": 1,
          "created_utc": "2026-01-31 16:19:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2vmzp1",
          "author": "offbyalot",
          "text": "I think marketing isn't fun when it feels like you're creating content you yourself wouldn't find valuable.   \n  \nWhat are you working on? Can you find a community where sharing what you're working on would actually be helpful? And talk to that community in a way that they'll be receptive to?",
          "score": 1,
          "created_utc": "2026-01-31 23:33:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2xhwi2",
          "author": "Tommaso_Ceoldo",
          "text": "I'm not very good on this argument because i didn't practice it many times but if you tell me more details, i may help you grow on social media",
          "score": 1,
          "created_utc": "2026-02-01 06:42:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2xw9xe",
          "author": "gpu-coder",
          "text": "After building a content platform for creators myself and speaking to hundreds of them, they all speak about value… providing value to end customers who have a problem in your posts… \n\nWe built [CreatorStock](https://www.creatorstock.io) to help users find faceless content clips, slap on a value adding caption, and hook. Link to your site… and basically keep repeating it. \n\nIdea: Your selling a course for content creation\nClip: Lady typing on laptop\nCaption: Top 3 tools I use to build content \n\nLet me know if that helps!",
          "score": 1,
          "created_utc": "2026-02-01 08:52:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2zladf",
          "author": "TheGentleAnimal",
          "text": "1. Learn it\n2. Get outsourced help\n\nEither way, it's something you have to do. So do it",
          "score": 1,
          "created_utc": "2026-02-01 15:58:20",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qokrvg",
      "title": "Would you guys let us create your website for free?👀",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qokrvg/would_you_guys_let_us_create_your_website_for_free/",
      "author": "IndependentLaw1457",
      "created_utc": "2026-01-27 17:43:08",
      "score": 5,
      "num_comments": 16,
      "upvote_ratio": 0.86,
      "text": "\nThat’s a genuine question. We’re a fairly new Web Design Agency that basically operates on a “free services” basis, besides our usual paid plans. Basically, you get to try our services for free.\n\nWe’re fully transparent on how we do things, to ensure an effective collaboration with our clients, so if you wonder how is this possible, and what do we get from all of this, I’ll try to explain it to you. \n\nWe’re basically collaborating with almost every reputable Hosting Service that you could possibly think of, and in a nutshell, for any of their plans that you choose to host your website, we get paid by them. \n\nNot a percentage of what you pay for, it is a fixed commission. We’re not interested in making you pay for a higher priced plan, it makes no difference to us. \n\nFor an example, most of the time we recommend people to go for the most basic Hosting Plan, which has a price range of $35-50/year, Domain included. \n\nWe’re not the best, and we’re not planning on being known as the best, but certainly care most. That being said, if it sounds like something that might benefit you or someone you know, feel free to reach out to us, here’s a link to our website: https://thatfreewebsite.net \n\nThank you for taking the time to read our message, and I hope everyone is having a really great day!!🫶🏻",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1qokrvg/would_you_guys_let_us_create_your_website_for_free/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o23q9aq",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 2,
          "created_utc": "2026-01-27 22:22:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o28g3q8",
              "author": "IndependentLaw1457",
              "text": "Thank you so much, I appreciate it!",
              "score": 2,
              "created_utc": "2026-01-28 15:58:51",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o266wx3",
          "author": "monkey6",
          "text": "How many sites have you developed?",
          "score": 1,
          "created_utc": "2026-01-28 06:46:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o28g84c",
              "author": "IndependentLaw1457",
              "text": "I’d say around 24 at this point",
              "score": 1,
              "created_utc": "2026-01-28 15:59:22",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o267ogs",
          "author": "wetfart_3750",
          "text": "So I'm about to purchase a domain and host it on a VPS. Will you make a website for me?",
          "score": 1,
          "created_utc": "2026-01-28 06:52:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o26fqsa",
          "author": "Fahimsenju",
          "text": "Damn you already got 3 hits. great website btw.",
          "score": 1,
          "created_utc": "2026-01-28 08:00:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o28ga79",
              "author": "IndependentLaw1457",
              "text": "Thank you so much! It’s much appreciated👀",
              "score": 1,
              "created_utc": "2026-01-28 15:59:37",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o28gghg",
              "author": "IndependentLaw1457",
              "text": "We’re actually working on a customization integration at the moment, I really hope it’s gonna be fully functional in early March🤭",
              "score": 1,
              "created_utc": "2026-01-28 16:00:21",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o28twy4",
                  "author": "Fahimsenju",
                  "text": "Best of luck. Fellow dev",
                  "score": 1,
                  "created_utc": "2026-01-28 16:58:29",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2pgfmw",
          "author": "linkverse1221",
          "text": "Hey I’ll really appreciate your help",
          "score": 1,
          "created_utc": "2026-01-31 00:35:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2r936y",
              "author": "IndependentLaw1457",
              "text": "Have you got the chance to fill in the form?",
              "score": 1,
              "created_utc": "2026-01-31 08:02:33",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2rq4of",
                  "author": "linkverse1221",
                  "text": "I’ll fill it in",
                  "score": 1,
                  "created_utc": "2026-01-31 10:44:40",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qr3qzq",
      "title": "Friday Showcase: Share what you're building! 🚀",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qr3qzq/friday_showcase_share_what_youre_building/",
      "author": "Ok-Lobster7773",
      "created_utc": "2026-01-30 12:11:20",
      "score": 4,
      "num_comments": 15,
      "upvote_ratio": 0.83,
      "text": "Drop your link below + 2 sentences on the problem you're solving.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1qr3qzq/friday_showcase_share_what_youre_building/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o2lchsw",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-30 12:38:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2m9o6d",
              "author": "Equal_Ad_7668",
              "text": "What problem you are solving here?",
              "score": 1,
              "created_utc": "2026-01-30 15:31:46",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2m9xno",
                  "author": "Minimum-Swordfish293",
                  "text": "People struggle to think clearly when decisions involve trade-offs, emotions, or uncertainty.\nDecisora helps structure those decisions step-by-step so people can see risks, options, and clarity instead of overthinking.",
                  "score": 1,
                  "created_utc": "2026-01-30 15:32:56",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2qgrx9",
          "author": "DarkShark008",
          "text": "I launched the beta today [distill](https://www.distillfeedback.com/). Feedbacks would be appreciated. Btw we manage feedbacks HAHA.",
          "score": 1,
          "created_utc": "2026-01-31 04:13:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2r3xhc",
          "author": "amacg",
          "text": "Built a community where makers can share what they’re building and get fair visibility. Here's the link: [https://trylaunch.ai](https://trylaunch.ai/)",
          "score": 1,
          "created_utc": "2026-01-31 07:14:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2s3oqo",
          "author": "MathematicianWarm781",
          "text": "Hi \nI have coded an app called zenflow and its basically a to do list app that uses AI to break tasks down.Search up Zenflow on the google play store and you should find it.Its under the productivity category.\n\n\nThere are some meditation apps with the same/similar name,but that is not the correct app.Mine has a black and white logo.\n\n\nI would really appreciate any feedback.",
          "score": 1,
          "created_utc": "2026-01-31 12:40:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2s4hja",
              "author": "MathematicianWarm781",
              "text": "The problem im solving is that its quite difficult to start hige vague tasks.This app breaks the large task into small actionable steps.",
              "score": 1,
              "created_utc": "2026-01-31 12:46:15",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2u8bz0",
          "author": "Anxious_Phase6553",
          "text": "I have just launched [cortexcart insight dashboard ](https://cortexcart.com)",
          "score": 1,
          "created_utc": "2026-01-31 19:18:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2y5q1m",
          "author": "vitaepro66",
          "text": "VitaePro is the world’s first cover letter writing system that prioritises human input, crowd-sourced examples, and AI refinement.\n\n\nWe have just opened our beta and looking for genuine feedback. \n\n\nwww.vitaepro.com.au ",
          "score": 1,
          "created_utc": "2026-02-01 10:20:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o34dtly",
          "author": "jundymek",
          "text": "**FakerFill** is a browser extension that removes the boring part of testing - filling the same forms over and over with fake data.\n\n[https://chromewebstore.google.com/detail/ajepcgeokfoanenjolfjfpfdbcpddooe](https://chromewebstore.google.com/detail/ajepcgeokfoanenjolfjfpfdbcpddooe)",
          "score": 1,
          "created_utc": "2026-02-02 08:00:22",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qno3oa",
      "title": "Does anyone know where to find real UK/US/CA developers",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qno3oa/does_anyone_know_where_to_find_real_ukusca/",
      "author": "Curbsidewin",
      "created_utc": "2026-01-26 18:19:55",
      "score": 4,
      "num_comments": 24,
      "upvote_ratio": 0.75,
      "text": "\n\nI've been part of this community for nearly five years, working with developers in the US, UK, and Canada. However, since launching my own projects, I've noticed a shift. Most of the developers reaching out are now from India or the Philippines.\n\nThey often present themselves as experts in everything. The issue is, I’m looking for a specialist, not a generalist 'handyman.' If I need a carpenter, I hire a carpenter, not a street sweeper who does carpentry on the side. Where can I find qualified local devs? Is it just impossible to find them on this sub?",
      "is_original_content": false,
      "link_flair_text": "marketplace",
      "permalink": "https://reddit.com/r/startup/comments/1qno3oa/does_anyone_know_where_to_find_real_ukusca/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o1viowk",
          "author": "FrostingAccurate",
          "text": "Hey. I am Uk based local dev. Please DM .",
          "score": 2,
          "created_utc": "2026-01-26 19:22:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1vnx22",
              "author": "Curbsidewin",
              "text": "Good send me DM",
              "score": 1,
              "created_utc": "2026-01-26 19:45:35",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1wekq3",
          "author": "JacobDilley",
          "text": "You should have a chat with Ben who runs red explosion \n\n\nhttps://redexplosion.com/",
          "score": 2,
          "created_utc": "2026-01-26 21:43:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1wpb7e",
          "author": "Minute-Push-3268",
          "text": "UK based local senior engineer looking for freelancing work. Please DM.",
          "score": 2,
          "created_utc": "2026-01-26 22:32:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1wq45h",
              "author": "Curbsidewin",
              "text": "Good send me DM",
              "score": 1,
              "created_utc": "2026-01-26 22:36:17",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1x9bg7",
          "author": "Renalouca",
          "text": "UK based senior eng. DM",
          "score": 2,
          "created_utc": "2026-01-27 00:12:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o200r46",
              "author": "Curbsidewin",
              "text": "Good send me DM",
              "score": 1,
              "created_utc": "2026-01-27 11:49:54",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1ysju9",
          "author": "Taco-671",
          "text": "Piggybacking on this post… any Canada based Developers seeking projects?? Pls message me.",
          "score": 2,
          "created_utc": "2026-01-27 05:30:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o200q77",
              "author": "Curbsidewin",
              "text": "Good send me DM",
              "score": 1,
              "created_utc": "2026-01-27 11:49:43",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1z0n9m",
          "author": "Gh0stlyHub",
          "text": "I had the same issues a little while back, there are few digital nomad North American devs scattered around the globe, so you must want to contact some of them.",
          "score": 2,
          "created_utc": "2026-01-27 06:32:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o200rbx",
              "author": "Curbsidewin",
              "text": "Good send me DM",
              "score": 1,
              "created_utc": "2026-01-27 11:49:57",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o22c1lb",
          "author": "Hour_Arachnid_2071",
          "text": "Don't know sorry",
          "score": 2,
          "created_utc": "2026-01-27 18:38:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o22fj1l",
              "author": "Curbsidewin",
              "text": "ok",
              "score": 1,
              "created_utc": "2026-01-27 18:53:28",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o200xkq",
          "author": "Kali21x",
          "text": "Canadian based dev here",
          "score": 1,
          "created_utc": "2026-01-27 11:51:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o20tlis",
          "author": "Karn2407",
          "text": "hey OP, I have got a simple and good guide that might help you make better decision while hiring, have a look.:  \n[https://workable-cost-62e.notion.site/The-Insider-s-Guide-to-Finding-Hiring-Developers-for-App-Development-2ee4daac1fb78041a7e6e8d593ffc9e7?source=copy\\_link](https://workable-cost-62e.notion.site/The-Insider-s-Guide-to-Finding-Hiring-Developers-for-App-Development-2ee4daac1fb78041a7e6e8d593ffc9e7?source=copy_link)",
          "score": 1,
          "created_utc": "2026-01-27 14:38:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o22hbj5",
          "author": "SpeechFluenceDotCom",
          "text": "LinkedIn",
          "score": 1,
          "created_utc": "2026-01-27 19:01:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o22yoib",
          "author": "elixon",
          "text": "In India, of course. For a little extra, you can get even better accents and certificates of origin. How much real do you need? 🤡🃏\n\n**Practical advice: whatever Indians or Russians claim, halve it. Whatever Europeans claim, double it. Whatever Americans claim, take it as is. That’s my experience.**",
          "score": 1,
          "created_utc": "2026-01-27 20:18:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1v7yib",
          "author": "overDos33",
          "text": "Have you ever thought on trying an agency from Eastern Europe?\n\n  \nMany big companies like Google,Microsoft etc. has expanded branches in this part for less expenses and still same quality like in USA/UK.\n\n  \nI own a software agency based in Eastern Europe so if you are interested kindly DM me.\n\n  \nGood luck.",
          "score": 1,
          "created_utc": "2026-01-26 18:37:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1z7x54",
              "author": "Significant-Level178",
              "text": "Where about?",
              "score": 2,
              "created_utc": "2026-01-27 07:33:49",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o1vh7w2",
              "author": "Curbsidewin",
              "text": "Thanks.",
              "score": 1,
              "created_utc": "2026-01-26 19:16:39",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qoh2ey",
      "title": "We are planning to start an agency but cofounder has some doubt",
      "subreddit": "startup",
      "url": "/r/marketingagency/comments/1qodca4/we_are_planning_to_start_an_agency_but_cofounder/",
      "author": "ConferenceDry2969",
      "created_utc": "2026-01-27 15:33:17",
      "score": 3,
      "num_comments": 5,
      "upvote_ratio": 1.0,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1qoh2ey/we_are_planning_to_start_an_agency_but_cofounder/",
      "domain": "",
      "is_self": false,
      "comments": [
        {
          "id": "o24j2rb",
          "author": "CalmMonk60",
          "text": "Make sure you have good legal agreements so if they leave you don’t get screwed",
          "score": 1,
          "created_utc": "2026-01-28 00:46:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2925jh",
          "author": "RoyalsValleyFounder",
          "text": "growth is there no doubt",
          "score": 1,
          "created_utc": "2026-01-28 17:34:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2dbkxc",
          "author": "Aromatic-Trouble-580",
          "text": "Have you answered these questions for yourself?",
          "score": 1,
          "created_utc": "2026-01-29 06:59:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o21h71x",
          "author": "Savings-Sell8319",
          "text": "Throw him out doubt kills",
          "score": 1,
          "created_utc": "2026-01-27 16:26:22",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qojny4",
      "title": "Pivoted after a year of flat growth — and just closed our first SAFE. Some lessons from the other side.",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qojny4/pivoted_after_a_year_of_flat_growth_and_just/",
      "author": "Lembergdk",
      "created_utc": "2026-01-27 17:04:55",
      "score": 3,
      "num_comments": 0,
      "upvote_ratio": 1.0,
      "text": "I started working on my startup in summer 2024, along with a couple of co-founders.\n\nWe got our first paying customers fairly quickly. Not a huge number, but enough to feel like: *“Okay, this is real. We provide value”*\n\nThen… nothing.\n\nFor almost a year, traction basically flatlined. Same conversations, same objections, same lukewarm interest. We shipped features, tweaked pricing, improved onboarding. It all felt productive — but the numbers didn’t move.\n\nBy fall last year, it was obvious: The problem we were solving was just not painful enough for anyone to really care.\n\nSo in November, we did the thing everyone tells you not to do lightly:\n\n* Full pivot\n* New brand\n* Completely reshaped product\n* Completely different target audience\n\nIt was uncomfortable. It meant admitting that a year of work wasn’t leading where we hoped. It meant killing things we’d invested a lot of pride into. It meant starting conversations from zero again.\n\nBut almost immediately, something felt different.\n\nPeople *got it* faster. Sales calls stopped being educational lectures and turned into “how soon can we use this?” conversations. Feedback became sharper. Our leads started referring new leads.\n\nSince then:\n\n* We’ve seen consistent growth month over month\n* Inbound actually exists now (still wild to me)\n* And today, we received our **first SAFE investment**\n\nI’m excited — but also weirdly calm. Mostly because this time, the progress feels earned and repeatable, not accidental.\n\nA few takeaways for anyone in the “year of nothing” phase:\n\n* Early revenue ≠ product-market fit\n* Flat growth is a signal, not a moral failure\n* Pivots aren’t resets — they’re compounding learning\n* If explaining your product takes 10 minutes, that’s the problem\n\nHappy to answer questions about the pivot, fundraising, or what we did wrong the first time.",
      "is_original_content": false,
      "link_flair_text": "investor relations",
      "permalink": "https://reddit.com/r/startup/comments/1qojny4/pivoted_after_a_year_of_flat_growth_and_just/",
      "domain": "self.startup",
      "is_self": true,
      "comments": []
    },
    {
      "id": "1qowywc",
      "title": "Stack choice dilemma: speed vs familiarity, what would you do?",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qowywc/stack_choice_dilemma_speed_vs_familiarity_what/",
      "author": "T-rex_smallhands",
      "created_utc": "2026-01-28 01:13:52",
      "score": 3,
      "num_comments": 1,
      "upvote_ratio": 1.0,
      "text": "We are mid build our core product that is live with a couple clients and we are about to start an \"extension\" that we are building as a favor + to take the difference in the cost and what we are paid and funnel that into our core product. \n\nWe have no intention of reselling or marketing the product. We will be supporting it, making 15k ARR less support costs. \n\nOur current core product is java + vue \n\nWebsite is nextjs (no backend, just landing page) \n\nnew product constraints\n\n\\- 10 concurrent users\n\n\\- multitenant\n\n\\- HIPAA compliant\n\n\\- needs to ship fast, but be maintainable \n\nHere is the debate internally:\n\nA) Hire externally, support internally\n\nBuild the new product in Java + vue, so our current team can take over support. we also have the option of bringing developer into the core product if they kick ass, so they can help speed up core development plus support platform. \n\nB) Hire externally, support externally\n\nBuild in Django/react/nextjs, small contract to make sure someone is available for p2 issues, most of which would be taken care of during the first 3 months to stabilize system. \n\nAll future enhancements would be done through additional SOWs \n\nIs it worth picking a different stack to speed development (we don't know by how much) or is familiarity better, so we don't have to hire out support and can definitely meet SLAs?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1qowywc/stack_choice_dilemma_speed_vs_familiarity_what/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o2eff5e",
          "author": "Vaibhav_codes",
          "text": "For a small, internal facing extension with low concurrency, I’d lean familiarity over speed Java + Vue means your team can support it directly, reduce risk, and avoid SLA headaches Shipping a bit slower is fine if future maintenance is smooth and you can redeploy devs to the core product Changing stacks only makes sense if the speed gain is huge and the team can handle handoffs safely",
          "score": 1,
          "created_utc": "2026-01-29 12:38:13",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qq62rh",
      "title": "Need Beta testers for our product",
      "subreddit": "startup",
      "url": "/r/biotechnology/comments/1qq62kc/need_beta_testers_for_our_product/",
      "author": "Responsible_Region91",
      "created_utc": "2026-01-29 11:28:03",
      "score": 3,
      "num_comments": 1,
      "upvote_ratio": 1.0,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1qq62rh/need_beta_testers_for_our_product/",
      "domain": "",
      "is_self": false,
      "comments": []
    },
    {
      "id": "1qpwsmh",
      "title": "I help small businesses grow on social media — simple monthly packages, no long-term contracts",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qpwsmh/i_help_small_businesses_grow_on_social_media/",
      "author": "pankaj662",
      "created_utc": "2026-01-29 03:03:41",
      "score": 3,
      "num_comments": 8,
      "upvote_ratio": 1.0,
      "text": "I’m a freelance Social Media Marketer who works mainly with small businesses, startups, and solo founders who don’t have time to post consistently or figure out what actually converts.\n\nIf your social media feels random, inactive, or just isn’t bringing results — that’s exactly what I help with.\n\nWhat I do\n\n• Content planning & posting\n\n• Reels/short-form strategy\n\n• Profile optimization\n\n• Basic ad guidance (if needed)\n\n• Engagement & growth tactics that don’t rely on bots\n\nI focus on clarity + consistency, not fluff metrics.\n\n💼 Monthly Packages\n\nStarter – $149/month\n\n✔ 8 posts/month\n\n✔ Caption + hashtag strategy\n\n✔ Content calendar\n\n✔ Ideal for new or local businesses\n\nGrowth – $299/month\n\n✔ 12 posts/month\n\n✔ 4 short-form videos (Reels/Shorts)\n\n✔ Engagement support\n\n✔ Best for brands that want steady growth\n\nAuthority – $499/month\n\n✔ 20 posts/month\n\n✔ 8 short-form videos\n\n✔ Strategy calls + analytics\n\n✔ Perfect for personal brands & scaling businesses\n\n📌 No long-term contracts\n\n📌 Cancel anytime\n\n📌 Platforms: Instagram, Facebook, LinkedIn, X (Twitter)\n\nWhy me?\n\nI don’t promise “10k followers overnight.”\n\nI focus on real engagement, positioning, and leads.\n\nIf you’re interested, comment “INFO” or DM me and I’ll share examples + see if we’re a good fit.\n\nHappy to answer questions in the comments too ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1qpwsmh/i_help_small_businesses_grow_on_social_media/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o2ddtuj",
          "author": "Prince_Ramanan89",
          "text": "Great the package seems pocket friendly.",
          "score": 1,
          "created_utc": "2026-01-29 07:18:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2dlrxx",
          "author": "mandevillelove",
          "text": "what type of businesses have seen the fastest results with your packages?",
          "score": 1,
          "created_utc": "2026-01-29 08:29:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2gnd1f",
              "author": "Ok_Review_9887",
              "text": "Important question!!",
              "score": 1,
              "created_utc": "2026-01-29 19:01:56",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2el95q",
          "author": "AdhesivenessBrief625",
          "text": "Info.",
          "score": 1,
          "created_utc": "2026-01-29 13:14:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2fi1n8",
              "author": "pankaj662",
              "text": "How can I help you?",
              "score": 1,
              "created_utc": "2026-01-29 15:56:48",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2gno4v",
                  "author": "Ok_Review_9887",
                  "text": "Any reference instagram pages to see your work?\n\nDm works too",
                  "score": 1,
                  "created_utc": "2026-01-29 19:03:21",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2kt9fw",
          "author": "MORPHOICES",
          "text": "While this quote is solid, its optimized for buyers and not for Reddit. \\~\n\nLong service menus + pricing not helpful; they trigger “self-promo” blindness especially on r/startup. People glance, assume pitch and move on even if the offer is fair\n\nWhich one works the most?\n\nUse one concrete outcome that you delivered, such as, helped a local biz go from X to Y in 60 days.\n\nExplain your thinking process, not your offerings.\n\nPackages shall only be sent up on request.\n\nLanding page is almost like a Reddit post.Both are UI component. Insight comes before offer at Reddit.\n\nThe framing is the problem, not the service.",
          "score": 1,
          "created_utc": "2026-01-30 10:07:16",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}