{
  "metadata": {
    "last_updated": "2026-02-05 17:09:59",
    "time_filter": "week",
    "subreddit": "startup",
    "total_items": 15,
    "total_comments": 54,
    "file_size_bytes": 77891
  },
  "items": [
    {
      "id": "1qstjgl",
      "title": "How a B2B company makes millions with their tiny Youtube channel",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qstjgl/how_a_b2b_company_makes_millions_with_their_tiny/",
      "author": "illeatmyletter",
      "created_utc": "2026-02-01 09:02:46",
      "score": 19,
      "num_comments": 3,
      "upvote_ratio": 0.95,
      "text": "I came across this breakdown and it completely flipped how I thought about YouTube. Figured it might be valuable for you as well.\n\nMost founders assume YouTube only works if you go big. Massive subscriber counts, viral videos, influencer-level reach. But this case study proves that's wrong, well at least for B2B.\n\nThere's a small company in immigration + tax optimization. Nothing sexy. Their average client pays around $2,000 though. Their YouTube channel has maybe 1,000 to 1,500 subscribers. And from that channel alone, they've booked 500+ sales calls. That's easily seven figures in revenue from what most people would call a \"dead\" channel.\n\nBut it gets crazier… They get only around 350 to 400 views per day. About 30 videos total. But they close roughly half their calls. They even spun up a second channel in another language with under 30 subscribers, and it already brought in multiple paying clients.\n\nThis is why B2B YouTube is a completely different game.\n\nSubscriber count is a vanity metric. What actually matters:\n\n* Who's watching: are they decision-makers or random browsers?\n* Why they're watching: are they actively looking for a solution?\n* How much one customer is worth: if a client pays $2k, $10k, or more, you don't need scale\n\nThe videos that drive revenue on this channel aren't flashy. They're boring, high-intent, search-driven stuff: \"how to get residency in X,\" \"best tax residency for digital nomads,\" country comparisons etc. These aren't entertainment videos. They're decision-stage videos, which means the viewer is already problem-aware and actively searching for a solution. That's why they convert.\n\nIf you're selling something where one customer is worth a few thousand dollars or more, obsessing over subscriber count makes no sense. A small channel with the right topics can outperform a larger audience watching for entertainment. The leverage comes from intent, not scale.\n\nI’d love to hear form other founders to see if you’ve had similar results? Have any of you tried YouTube as an acquisition channel? What results did you see?",
      "is_original_content": false,
      "link_flair_text": "marketing",
      "permalink": "https://reddit.com/r/startup/comments/1qstjgl/how_a_b2b_company_makes_millions_with_their_tiny/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o34om7b",
          "author": "NetnbsClg_Tradition",
          "text": "Seems quite intriguing",
          "score": 2,
          "created_utc": "2026-02-02 09:44:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o34yjbu",
          "author": "Federal-Process-6504",
          "text": "Do you think this will translate well in a Travel and Tourism B2B company?",
          "score": 1,
          "created_utc": "2026-02-02 11:16:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3iy7ef",
          "author": "Otherwise_Hope_3597",
          "text": "Idk why but this gave me motivation to start a yt channel🤣",
          "score": 1,
          "created_utc": "2026-02-04 13:26:01",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qr3yf5",
      "title": "Biggest thing we got wrong moving from beta to public",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qr3yf5/biggest_thing_we_got_wrong_moving_from_beta_to/",
      "author": "coggyboy",
      "created_utc": "2026-01-30 12:21:17",
      "score": 14,
      "num_comments": 5,
      "upvote_ratio": 1.0,
      "text": "We recently opened up **Origami Tech** to the public after running a small beta. It’s a no code crypto automation platform and the biggest learning so far has been how differently early users behave compared to how we expected on paper.\n\nIf you’ve taken something from beta to public, what was the biggest mismatch between your assumptions and real usage?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1qr3yf5/biggest_thing_we_got_wrong_moving_from_beta_to/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o2lh4ia",
          "author": "Willing-Training1020",
          "text": "biggest mismatch for me was assuming people would at least read 😢 beta users were invested and figured stuff out, public users bounce the second something isn't obvious. onboarding and ux clarity mattered way more than i expected. curious what surprised you most with origami, did you get any feedback?",
          "score": 1,
          "created_utc": "2026-01-30 13:07:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2vea2f",
              "author": "coggyboy",
              "text": "This hit home 😅 same experience here. Beta users explored, public users want instant clarity. For Origami Tech, the biggest surprise was how quickly users bounced if results weren’t obvious right away. Onboarding mattered way more than we expected.",
              "score": 1,
              "created_utc": "2026-01-31 22:45:45",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2od54w",
          "author": "RoleHot6498",
          "text": "Being under capitalized to deal with the demand",
          "score": 1,
          "created_utc": "2026-01-30 21:12:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2vgi3l",
              "author": "coggyboy",
              "text": "Both of these resonate. Moving public showed us how impatient real users are compared to beta, anything that wasn’t immediately clear caused drop-off, so onboarding and UX ended up mattering far more than docs. At the same time, it forced us to think more seriously about pacing growth and constraints instead of just chasing demand. A lot of assumptions get stress-tested the moment real users show up",
              "score": 1,
              "created_utc": "2026-01-31 22:57:15",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2z86m4",
                  "author": "RoleHot6498",
                  "text": "Definitely something founders miss when transitioning from beta to live demand. The role funding and cash flow play in facilitating smooth growth is vital",
                  "score": 1,
                  "created_utc": "2026-02-01 14:54:07",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qqzswr",
      "title": "I built a natural language builder for non-tech experts. [Launching today, we’d love your support!]",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qqzswr/i_built_a_natural_language_builder_for_nontech/",
      "author": "Remote-Preference484",
      "created_utc": "2026-01-30 08:23:58",
      "score": 13,
      "num_comments": 2,
      "upvote_ratio": 0.85,
      "text": "Hi fellow builders & productivity lovers! We’re super excited to introduce our first Product Hunt launch - **Leapility**.\n\nLeapility is built to reduce repetitive work and tool-hopping when using AI.\n\nYou describe your playbook in plain language, add your sources, steps, tools, and rules in one place, then hit run and let AI execute it.\n\nIt’s designed for domain experts and small teams, especially non-technical ones, who already have clear processes but don’t want to wire everything together with nodes or prompts.\n\nWe’re early and would really value feedback from this community. Your support and feedback mean a lot! 🙌\n\n👉 [https://www.producthunt.com/products/leapility-3?launch=leapility-3&utm\\_source=reddit&utm\\_campaign=reddit%2520ph%2520posts](https://www.producthunt.com/products/leapility-3?launch=leapility-3&utm_source=reddit&utm_campaign=reddit%2520ph%2520posts)",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1qqzswr/i_built_a_natural_language_builder_for_nontech/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o3ck6cy",
          "author": "Loose-Drummer-206",
          "text": "Hey, if ever you want, we have a program where we make TikTok videos for your app. We have a 7-day free trial and one free video. \nDm me if you’re interested, thanks!",
          "score": 1,
          "created_utc": "2026-02-03 14:42:34",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qv0gup",
      "title": "Asked my customer one question that led to 10% more revenue",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qv0gup/asked_my_customer_one_question_that_led_to_10/",
      "author": "Worldly_Expression43",
      "created_utc": "2026-02-03 18:47:08",
      "score": 12,
      "num_comments": 2,
      "upvote_ratio": 0.93,
      "text": "I see a lot of posts here celebrating wins related to landing new customers, which is awesome, but you are leaving money on the table (because I sure have) if you are only optimizing and focusing on net new lands or raising prices on them.                               \n\nI've been building Answer HQ, a customer support SaaS, the past year. \n\nLast week, I asked my existing customers, who on average spend between $200-$300 a month, if they would like to add more seats to their assistant so their team doesn't need to share just one account. \n\nTo my surprise, within the first hour of me asking that question, three companies replied yes, they needed more seats. I know this sounds totally made up, but if you DM me, I can send you screenshots of the conversation. It surprised me too.                                              \n\nSo bro, I've had these larger customers for over a year now, and it turns out they all needed more seats, and I could have been making at minimum 10% more per customer. I just literally needed to ask the question. \n\nI never thought to upsell them this way. I'm a fucking idiot. \n\nI will be charging them $20/mo/seat, and it was an instant upsell that increased the revenue for all three accounts in less than an hour by 10%.                                  \n\nSo yeah. Don't just focus on net new customers. Focus on landing & expanding and upselling to existing customers. You don't need to just rely on increasing prices. The side benefit to upselling is that it helps with churn. It won't fix high churn, but it helps with the small leaks.             \n\nIf you're building a B2B SaaS, what other ways have you experimented with to increase revenue for existing customers? What value were you trying to drive? ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1qv0gup/asked_my_customer_one_question_that_led_to_10/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o3f0qeo",
          "author": "ruibranco",
          "text": "The fact that they said yes within an hour tells you something even more important than the revenue bump - they were already sharing one account across the team and silently wishing they had their own. You didn't upsell them, you removed friction they were too polite to complain about. Bet if you ask what other workflows they've hacked together with your tool, you'll find your next feature and your next pricing tier.",
          "score": 2,
          "created_utc": "2026-02-03 21:35:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3kknsz",
          "author": "Conscious-Month-7734",
          "text": "This is the most common kind of expansion win: you did not “upsell,” you removed a real usage bottleneck. Shared accounts are annoying, risky, and they quietly cap adoption, so seats is an easy yes when the team is growing.\n\nOther ways to expand in B2B support tools without feeling salesy:\n\nCharge on outcomes or usage that maps to value, like volume, channels, automations, AI assisted resolutions, knowledge base coverage.\n\nOffer add ons that reduce operational pain, onboarding help, integrations support, priority support, quarterly workflow reviews.\n\nAdd manager level features as a higher tier, reporting, QA, coaching, audit trails, because that pulls in a second buyer inside the account.\n\nUse product triggers when you detect shared logins or multiple agents, so the expansion ask feels like a natural prompt, not a cold email.\n\nWhat was the main driver for those three customers. Headcount growth, security, or workflow friction. That usually tells you the next clean expansion lever.",
          "score": 1,
          "created_utc": "2026-02-04 18:08:34",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qr3qzq",
      "title": "Friday Showcase: Share what you're building! 🚀",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qr3qzq/friday_showcase_share_what_youre_building/",
      "author": "Ok-Lobster7773",
      "created_utc": "2026-01-30 12:11:20",
      "score": 7,
      "num_comments": 17,
      "upvote_ratio": 0.99,
      "text": "Drop your link below + 2 sentences on the problem you're solving.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1qr3qzq/friday_showcase_share_what_youre_building/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o2lchsw",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-30 12:38:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2m9o6d",
              "author": "Equal_Ad_7668",
              "text": "What problem you are solving here?",
              "score": 1,
              "created_utc": "2026-01-30 15:31:46",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2m9xno",
                  "author": "Minimum-Swordfish293",
                  "text": "People struggle to think clearly when decisions involve trade-offs, emotions, or uncertainty.\nDecisora helps structure those decisions step-by-step so people can see risks, options, and clarity instead of overthinking.",
                  "score": 1,
                  "created_utc": "2026-01-30 15:32:56",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2qgrx9",
          "author": "DarkShark008",
          "text": "I launched the beta today [distill](https://www.distillfeedback.com/). Feedbacks would be appreciated. Btw we manage feedbacks HAHA.",
          "score": 1,
          "created_utc": "2026-01-31 04:13:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2r3xhc",
          "author": "amacg",
          "text": "Built a community where makers can share what they’re building and get fair visibility. Here's the link: [https://trylaunch.ai](https://trylaunch.ai/)",
          "score": 1,
          "created_utc": "2026-01-31 07:14:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2s3oqo",
          "author": "MathematicianWarm781",
          "text": "Hi \nI have coded an app called zenflow and its basically a to do list app that uses AI to break tasks down.Search up Zenflow on the google play store and you should find it.Its under the productivity category.\n\n\nThere are some meditation apps with the same/similar name,but that is not the correct app.Mine has a black and white logo.\n\n\nI would really appreciate any feedback.",
          "score": 1,
          "created_utc": "2026-01-31 12:40:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2s4hja",
              "author": "MathematicianWarm781",
              "text": "The problem im solving is that its quite difficult to start hige vague tasks.This app breaks the large task into small actionable steps.",
              "score": 1,
              "created_utc": "2026-01-31 12:46:15",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2y5q1m",
          "author": "vitaepro66",
          "text": "VitaePro is the world’s first cover letter writing system that prioritises human input, crowd-sourced examples, and AI refinement.\n\n\nWe have just opened our beta and looking for genuine feedback. \n\n\nwww.vitaepro.com.au ",
          "score": 1,
          "created_utc": "2026-02-01 10:20:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o34dtly",
          "author": "jundymek",
          "text": "**FakerFill** is a browser extension that removes the boring part of testing - filling the same forms over and over with fake data.\n\n[https://chromewebstore.google.com/detail/ajepcgeokfoanenjolfjfpfdbcpddooe](https://chromewebstore.google.com/detail/ajepcgeokfoanenjolfjfpfdbcpddooe)",
          "score": 1,
          "created_utc": "2026-02-02 08:00:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o34wrts",
          "author": "Possible-Change-9560",
          "text": "Freelancer in 120 seconds on gopluto.ai",
          "score": 1,
          "created_utc": "2026-02-02 11:01:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o368to7",
          "author": "PrettyRadio2073",
          "text": "STARTUP INFERNO [https://www.amazon.it/dp/B0GHFYBHG5](https://www.amazon.it/dp/B0GHFYBHG5)\n\nAfter 38 years in tech (from DEC to the SaaS era), I wrote **Startup Inferno** to help founders stop the \"Startup Cosplay\" and face reality. I solve founder blindness by providing a map to spot early failure signals before your burn rate turns into a death sentence.",
          "score": 1,
          "created_utc": "2026-02-02 15:53:21",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qu5f2l",
      "title": "could use all the advice I could get...",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qu5f2l/could_use_all_the_advice_i_could_get/",
      "author": "grazmakes",
      "created_utc": "2026-02-02 19:45:07",
      "score": 6,
      "num_comments": 19,
      "upvote_ratio": 0.88,
      "text": "Hey everyone,\n\nNew to this subreddit but I am looking for all the advice I can get. About 20 years ago, I had an idea for a social media website (sorry don’t want to give too much info away) while I was college and tried to learn as much web development as I could (design and database) and after awhile I just gave up as I had no connections to anyone in the development world and just gave up. Fast forward to today, with the help of Claude and Codex and about 6 months of time, I have the site just about fully working beyond just a proof of concept. I know people always feel confident about their ideas and whatnot, but this site has potential to make money from day one and the more people use it the more money it could generate. I’m about as new to the startup world as you can get and looking for any advice I can to see how I can either find funding from investors, to perhaps try to keep going and get this idea off the ground myself? As I'm the only one navigating this path, I have so many questions but I’m finding it tough to find a course that will educate me to even ask the questions I need if that makes sense. Again my apologies for the lack of details as far as the site goes, but I'm just trying not to get burned. thank you in advance. I'm located in Boston if that help :-)",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1qu5f2l/could_use_all_the_advice_i_could_get/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o38bg6r",
          "author": "BirthdayTreatsClub",
          "text": "Burnt my money and time in building social network. Pivoted to something else post that. \n\nWent live with both web and mobile app but the base use case was not that strong and did not create the network effect. \n\nMy two cents - nail down the base use case which will bring in both content creators and content consumers from day 1 and they both engage at least once in a week to begin with.\n\nWishing you the best!",
          "score": 3,
          "created_utc": "2026-02-02 21:38:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ahq95",
          "author": "Altruistic_Minimum94",
          "text": "Network effect and word of mouth are huge. I build a portfolio platform for developers and anyone in the tech industry and my first customers told me that they found it because a friend recommended it to them.",
          "score": 3,
          "created_utc": "2026-02-03 05:01:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3e1mou",
              "author": "grazmakes",
              "text": "great advice! I'm very fortunate and have quite a network of people who have pretty large following so when im ready to pull the trigger I figure I can reach out to them to ask their following to give the site a chance and to spread the word.",
              "score": 2,
              "created_utc": "2026-02-03 18:52:05",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3f9ygs",
                  "author": "Altruistic_Minimum94",
                  "text": "That's super important. Keep it up.",
                  "score": 2,
                  "created_utc": "2026-02-03 22:19:00",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3bxg7a",
          "author": "Vaibhav_codes",
          "text": "Focus on getting early users, learning from their feedback, and iterating fast traction matters more than funding at this stage",
          "score": 3,
          "created_utc": "2026-02-03 12:31:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3deubz",
              "author": "grazmakes",
              "text": "thanks! yeah getting a focus group's feedback is definitely going to help improve all aspects of the site for sure!",
              "score": 2,
              "created_utc": "2026-02-03 17:08:56",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3aelgu",
          "author": "RevolutionFluffy6316",
          "text": "Wow, first of all, congrats on getting the site this far. Doing all of that mostly on your own and actually building something beyond a proof of concept is a huge achievement. Honestly, most first-time founders don’t get that far before giving up.\n\nAt this stage, the most important thing is just getting people to use it and seeing how they react. Even a small group of active users can prove that your idea has traction and help you figure out what works and what doesn’t. Networking is also really important. You don’t have to know everyone in tech, but meeting other founders, going to local meetups in Boston, or joining online startup communities can open doors for advice, partnerships, and eventually funding.\n\nSince you’re new to fundraising, it helps to start simple. Try putting together a one-page pitch that explains the problem you’re solving, how your product does it, who it’s for, and any traction you already have. Even if it’s just a few users, showing that people are actually using your product speaks volumes to investors. You could also consider bootstrapping at first if your site can make money early, because showing revenue makes it much easier to attract investment later.",
          "score": 2,
          "created_utc": "2026-02-03 04:39:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3cn15n",
              "author": "grazmakes",
              "text": "thank you! I appreciate the kinds words! its tricky, because I've shown some friends the idea and site and all of them have told me in one way or another that its a great idea and they would use it once its up and running....but they are friends and they are obviously bias. i guess my current problem is that all of this is new to me and the site is currently in the in between stage. Minus some bugs, it's pretty much fully working but on a very small and free level (vercel, supabase) and i don't have the income or know how to scale up to the point where i could have 1,000 beta testers. I guess that's where I need guidance and advice. In all honestly I don't feel the idea of the site and whether is good or bad is the question, its about I have a site and I don't know what the next steps are to get close to launch if that makes sense?   I currently have a pitch deck, one sheet and business plan that I've worked quite a bit on. I definitely plan on going to local meet ups soon. i just really wanted something I could show off that's a but more than an MVP which i feel like I'm just about there now. again, thank you for the constructive input!",
              "score": 1,
              "created_utc": "2026-02-03 14:57:11",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3ecwtc",
          "author": "IncubationStudio",
          "text": "You will get burned, make mistakes, see progress, all is a part of a small business. Who else, besides you, will really use it? Also separate out people being supportive of you vs supportive of your idea. If the love your idea, ask them to use it or give you a little cash to keep it going...",
          "score": 2,
          "created_utc": "2026-02-03 19:44:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3eflkw",
          "author": "ZeeZam_xo",
          "text": "Congrats on getting it built! that’s already farther than most people get.\n\nMy main advice is to launch and validate before chasing investors. If it can make money from day one, prove that with even a small group of paying users. Traction matters way more than a pitch deck. Don’t stress too much about the idea being stolen, execution is what counts, and you’ll have to talk about it eventually anyway. Since you’re solo and already have a working product, I’d bootstrap, launch small, charge early, and learn fast. Also, Boston has a solid startup scene, meetups and founder communities can be incredibly helpful. You’re in a good spot. Real users will teach you what to do next.",
          "score": 2,
          "created_utc": "2026-02-03 19:57:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3fsz6d",
          "author": "SpicyRanks",
          "text": "Just repeating what others have said at this point, but network effect is indeed the main thing that will help it grow at the start. However, from my own experience I'd also recommend looking at it fully from a user perspective rather than a founder/developer perspective. What is the reason someone would use your platform, particularly instead of one of the other well established ones?   \nDoes yours have clear distinctions that set it apart in an attractive way? What can you do better than these larger companies can do?   \nIf you have solid answers to those questions, then leverage that and promote your platform from that stance. Instead of \"hey, can you check out my site and see if you like it?\", maybe something like \"I've noticed that (insert popular social media site here) has x-issues (or lacks x-feature), and I wanted to make something that addresses that. Can you try it out and see how it feels to have those features in place and issues fixed?\"",
          "score": 2,
          "created_utc": "2026-02-03 23:59:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o385vc3",
          "author": "Loan-Pickle",
          "text": "For a Social Media web site it is all about the network effect. Without users it does not have any value. I would suggest running it as a side project until you can get a fair amount of users, and some income from ads/subscriptions. Then seek out investment.\n\nJust a word of warning though. Vide coded stuff tends not to scale well. You will probably start running into issues pretty quickly. I would start looking at the code now and understanding it so you can fix it before it breaks.",
          "score": 1,
          "created_utc": "2026-02-02 21:12:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3kx6e4",
          "author": "Conscious-Month-7734",
          "text": "You did the hard part that most people never finish, which is turning the idea into something that works, but the next part is not “investors,” it is proving a real use case with real people, because social products live or die on adoption loops, not on the existence of a working site.\n\nA few practical steps that keep you from getting burned.\n\nDo not worry about secrecy. Execution and distribution matter more than the idea. If you cannot describe the problem and who it is for, you will struggle to get users or funding anyway.\n\nPick one tight audience in Boston and run a small closed beta. Twenty to fifty people you can personally recruit is enough to learn whether they actually come back, invite others, and use it the way you expect.\n\nDefine the one behavior that matters. For a social product it is usually a repeat action plus an invite. If you cannot get that, money will not fix it.\n\nTreat “money from day one” carefully. Ask yourself who pays, for what, and why now. You can test willingness to pay early, but you need usage first.\n\nOn funding, most investors will not fund an early social app without traction, because the risk is distribution. If you want to raise later, your job now is to show retention, growth from invites, and a clear niche you dominate.\n\nIf you want one concrete next move: write a one paragraph description of who it is for, what problem it solves, and what someone does on day one that makes them want to return. Then recruit a small beta around that and watch behavior, not opinions.",
          "score": 1,
          "created_utc": "2026-02-04 19:04:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3en2et",
          "author": "EndpointWrangler",
          "text": "I think social media space is saturated enough.",
          "score": 0,
          "created_utc": "2026-02-03 20:32:32",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qrxj1f",
      "title": "I really don't like marketing..",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qrxj1f/i_really_dont_like_marketing/",
      "author": "neivelda",
      "created_utc": "2026-01-31 09:04:15",
      "score": 5,
      "num_comments": 10,
      "upvote_ratio": 1.0,
      "text": "Does anyone have some tips and tricks related to this? It's never been our strong suit. We recently launched our app and we set up all of these social media accounts everywhere, but what now?\n\nI've done the Instagram grind before but that was more personal and I had nothing to \"sell\" then.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1qrxj1f/i_really_dont_like_marketing/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o2rplsz",
          "author": "harv_89",
          "text": "You’re not alone, a lot of builders feel that way. It helps to think of it less as “marketing” and more as just talking to people who might actually have the problem you’re solving. Social posts are fine, but real conversations usually teach you way more early on.",
          "score": 3,
          "created_utc": "2026-01-31 10:39:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2rswg9",
              "author": "SEOMENTORASSISTANT",
              "text": "Sounds good 👍",
              "score": 2,
              "created_utc": "2026-01-31 11:10:05",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2rthyv",
                  "author": "harv_89",
                  "text": "Best of luck with it all!",
                  "score": 1,
                  "created_utc": "2026-01-31 11:15:31",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2u7twl",
          "author": "Anxious_Phase6553",
          "text": "I hate the whole idea! I do it because it is a must in my business but I do not enjoy it at all! I think there is a trick to it but not discovered it yet?",
          "score": 2,
          "created_utc": "2026-01-31 19:16:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2rss29",
          "author": "SEOMENTORASSISTANT",
          "text": "Yes it happens if you are not a marketing person but don't worry you can do one thing think I like this if you have a product and it is not seeing on google 1st page then how your product will sell ?? RIGHT IT MEANS IF YOUR APP IS NOT APPERING ON App store and play store with that keyword then who will download it ...\n\nDm me for more help and discussion",
          "score": 1,
          "created_utc": "2026-01-31 11:08:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2t6r1r",
          "author": "StillLoadingit",
          "text": "That’s way more common than people admit. A lot of founders don’t *like* traditional marketing, but what really matters is understanding your users and showing up where they already are, which feels a lot less like “marketing” and more like solving real problems.",
          "score": 1,
          "created_utc": "2026-01-31 16:19:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2vmzp1",
          "author": "offbyalot",
          "text": "I think marketing isn't fun when it feels like you're creating content you yourself wouldn't find valuable.   \n  \nWhat are you working on? Can you find a community where sharing what you're working on would actually be helpful? And talk to that community in a way that they'll be receptive to?",
          "score": 1,
          "created_utc": "2026-01-31 23:33:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2xhwi2",
          "author": "Tommaso_Ceoldo",
          "text": "I'm not very good on this argument because i didn't practice it many times but if you tell me more details, i may help you grow on social media",
          "score": 1,
          "created_utc": "2026-02-01 06:42:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2xw9xe",
          "author": "gpu-coder",
          "text": "After building a content platform for creators myself and speaking to hundreds of them, they all speak about value… providing value to end customers who have a problem in your posts… \n\nWe built [CreatorStock](https://www.creatorstock.io) to help users find faceless content clips, slap on a value adding caption, and hook. Link to your site… and basically keep repeating it. \n\nIdea: Your selling a course for content creation\nClip: Lady typing on laptop\nCaption: Top 3 tools I use to build content \n\nLet me know if that helps!",
          "score": 1,
          "created_utc": "2026-02-01 08:52:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2zladf",
          "author": "TheGentleAnimal",
          "text": "1. Learn it\n2. Get outsourced help\n\nEither way, it's something you have to do. So do it",
          "score": 1,
          "created_utc": "2026-02-01 15:58:20",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qtuq4w",
      "title": "Looking for startups to intern for",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qtuq4w/looking_for_startups_to_intern_for/",
      "author": "Lord__Sam",
      "created_utc": "2026-02-02 13:15:12",
      "score": 5,
      "num_comments": 8,
      "upvote_ratio": 0.78,
      "text": "Hey there   \nI’m a 3rd year design student, and as the title suggests, I’m looking to intern/part-time work for some startups!(remote)   \n  \nI have around 2 years of experience and and take something from 0 → 1, I’m hoping to work for a tech startup (I’m a tech nerd)   \n  \nMy background: \n\n*  I’m a human computer interaction designer (By degree), Design generalist(By skillset) \n* Have shipped products as freelance product designer  \n* Have competed in and won designathons.(I’m insanely fast) \n* Have built and sold websites \n* I can work without supervision and I take accountability of my work\n\nlet me know if you have something going where i can add any value",
      "is_original_content": false,
      "link_flair_text": "services",
      "permalink": "https://reddit.com/r/startup/comments/1qtuq4w/looking_for_startups_to_intern_for/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o35gxgd",
          "author": "Maleficent_Ant_6717",
          "text": "There was a program in Austin, through a college, that would put design students in internships with startups.\n\nI ran through it a few times (I ran incubators so I participated as a few different startups where I was involved indirectly) and can offer a perspective that might explain why you're having difficulty.\n\nStartups are built on marketing and execution (do it, build it). Anything else is not just a distraction, it's a risk, \"what if that's wrong.\"\n\nStartup communities, and in my 30 years working with startups, are flush with investors and experienced founders saying, \"I don't care how good it looks! Ship it!!\" while business plan people, designers, product people, pitch deck creators, tend to push that their work is critical (i.e. \"How it looks is critical\")\n\nI can count on the hundreds, how many startups failed because the team was fixated on the quality of the UX, design of the pitch deck, etc., and were blind to if it was actually any good, worked, and got released.\n\nPoint being, I stopped supporting that design internship program because they'd come up with great ideas and beautiful things, but at the end of the day, we'd then say, \"great, build it,\" and they wouldn't do anything else for you.\n\nRespectfully, because I know you've been taught or believe otherwise, but we don't need design, we need build.\n\nCraigslist and Wikipedia thrived for decades while people built better looking things.\n\nAnd so internships are even more challenging because while we're trying to get shit done, you're seeking to learn, and design, and take up time and attention to do so.... While we need it built and released.\n\nTake that for what it's worth. Get it shipped or you're not what startups are seeking.",
          "score": 1,
          "created_utc": "2026-02-02 13:28:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o35h0p9",
              "author": "Lord__Sam",
              "text": "Thank you for the valuable insights, My interest lays in how things work and finding low effort high impact improvements, while being able to implement(code) it or communicate with developers. If required I'll learn things(technical) on my own . I want to learn fast paced environments work.",
              "score": 1,
              "created_utc": "2026-02-02 13:29:09",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o35h46m",
                  "author": "Maleficent_Ant_6717",
                  "text": "Try approaching people then as \"marketing and data driven solution implementation.\"\n\nIf you can tell me you know how to use Analytics, multivariate testing, and you can *yourself* improve newsletters, website, app, or platform, by measuring impact, iterating, and testing different possibilities (not just designing one and seeking approval or support to do it), then you might be on to something valuable to startups.\n\nIf you're going at it as a \"designer,\" you're like the 99 other cold inquiries we get every day, offering to something everyone else can do that none of us need.",
                  "score": 1,
                  "created_utc": "2026-02-02 13:29:42",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o37lffq",
          "author": "Ok_Abbreviations4012",
          "text": "DM me, if still interested. Thanks",
          "score": 1,
          "created_utc": "2026-02-02 19:35:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3c0zyw",
              "author": "bella_omeezsolutions",
              "text": "hey i also looking for business startup last time my friend suggested me a social media management it really help you understanding your goals can you try it ...",
              "score": 1,
              "created_utc": "2026-02-03 12:54:41",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o38dwxt",
          "author": "bimomax",
          "text": "There might be a chance; could we see some of your work? ",
          "score": 1,
          "created_utc": "2026-02-02 21:50:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o39ime2",
              "author": "Lord__Sam",
              "text": "Yep, will share my portfolio",
              "score": 2,
              "created_utc": "2026-02-03 01:27:17",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3cx0mf",
          "author": "Weary-Step-8818",
          "text": "We are building frontier applied ai lab. Share details in dm",
          "score": 1,
          "created_utc": "2026-02-03 15:45:41",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qs03jc",
      "title": "I’ll Find You Real B2B Leads for $50/hr — You Pay Only After You See the Work",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qs03jc/ill_find_you_real_b2b_leads_for_50hr_you_pay_only/",
      "author": "pankaj662",
      "created_utc": "2026-01-31 11:35:50",
      "score": 4,
      "num_comments": 3,
      "upvote_ratio": 0.83,
      "text": "Cold outreach doesn’t fail because of emails.\nIt fails because your lead list sucks.\nBad data = wasted time + zero replies.\nSo here’s my offer:\nI’ll personally build you clean, targeted, verified leads for $50/hour\nAnd you don’t pay upfront.\nYou pay after you see the finished work.\nZero risk.\nWhat you get:\n• Decision-maker names (Founders, CEOs, Marketing Heads, etc.)\n• Verified emails\n• LinkedIn profiles\n• Company info\n• Clean Google Sheets/Excel file\n• No scraped garbage lists\nEverything is researched manually + tools + verification.\nWho this is for:\n• Agencies\n• SaaS founders\n• Freelancers\n• Coaches\n• Anyone doing cold email or LinkedIn outreach\nIf you need quality leads, not quantity junk, this is for you.\nHow it works:\nYou tell me your niche + target\nI build the list\nYou check it\nYou pay if satisfied\nSimple.\nDM me with:\n• Niche\n• Target audience\n• Number of leads needed\nI’ll start today.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1qs03jc/ill_find_you_real_b2b_leads_for_50hr_you_pay_only/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o34vdjr",
          "author": "DifficultyScared555",
          "text": "If you want I can bring you clients regarding the same and in return you can give me 10% commission on every successful deal?? 🤝",
          "score": 1,
          "created_utc": "2026-02-02 10:48:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3hxxzb",
              "author": "Intelligent_Owl8189",
              "text": "I'm open to discussing this.",
              "score": 1,
              "created_utc": "2026-02-04 08:34:12",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3734ku",
          "author": "leadg3njay",
          "text": "Bad lead data kills cold outreach, but $50/hour manual research is overkill. Verified leads are cheap through tools like Apollo or ZoomInfo. The real challenge is defining a tight ICP and targeting correctly, great copy won’t fix a bad list. Manual research only makes sense for very niche audiences. Pay-after-delivery models are risky, so differentiate with niche expertise, not just clean data.",
          "score": 1,
          "created_utc": "2026-02-02 18:12:27",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qtmip7",
      "title": "Here are the results of the last 30 days for my startup. See how much I earned!",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qtmip7/here_are_the_results_of_the_last_30_days_for_my/",
      "author": "Buckwheat469",
      "created_utc": "2026-02-02 05:35:07",
      "score": 3,
      "num_comments": 1,
      "upvote_ratio": 1.0,
      "text": "Haha. I haven't earned anything, but that's OK, I'm only 30 days in! Here's my story (none of this is generated, no AI for this post!).\n\nI created [RidgeText](https://ridgetext.com) as a tool for myself to use when I'm hunting. I realized that with satellite texting I could message my wife and kids to ask questions, like \"what's the weather for the next few days?\" but I couldn't really use them for everything. I hunt in an area that has spotty cell phone coverage and barely any data. My hunting spot has absolutely no coverage, so satellite texting is so valuable.\n\nI realized that I could develop an AI tool to do the Google searches for me, look up the weather, get the news, perform research tasks, analyze images, generate images, produce trail maps, and so much more. \n\nThis was during the fire season as well, and we were working with the forest service to get the wilderness areas reopened in time for hunting. They were absolutely incredible, but the fire maps would update on a daily basis and conditions would change regularly. Keeping up on Facebook was an hour-by-hour affair. It would have been useful at the time to have a tool to get the public information and maps.\n\nI also considered people who are hiking and lost. It's easy to find their location with a map pin, and then generate a trail map for them. It could help people like [Celine Cremer](https://www.youtube.com/watch?v=wIRrBtt4-UE&list=PLvs9mmSHrd6QjZ6Xnub3X-0X-L4Ra7el6) who got lost in New Zealand, or [these 2 hikers on Mount Rainier](https://people.com/bodies-of-2-missing-climbers-recovered-at-approx-9600-ft-in-mount-rainier-national-park-11891924).\n\nIn November I started development, then I broke my leg, and in December I finished the initial MVP. I registered my LLC, did all the paperwork, and talked with my tax advisor and a business consultant. I ran the idea past a number of people and they all thought it was amazing.\n\nMy initial users had fun with it and found it extremely easy to use. You just send a text message, no app. I gave away a few free accounts, knowing that I would eat those costs.\n\nI posted the app here and in LinkedIn to see how many users would bite. I got a bunch of bot accounts that couldn't verify their phone numbers, one real user who verified their phone number and earned the free account (thanks!), but I realized that I couldn't give away free accounts to bots, so I made a change to prevent bad signups and everything stopped. I also removed the free tier since I'm not made of money (but I really want to bring it back!).\n\nThe change was to prevent bots from flooding my database with crap accounts by verifying your phone number during sign up. Pretty simple really, if you're a real person then you have your phone with you. The problem was, I didn't know that Stripe has a test system, so I didn't initially have a way to test purchases without spending my own money (stupid that I didn't ask Claude or Gemini first). I have since fixed this, and found that there were a few signup and login bugs which would hinder signups and completely block email-based logins. \n\nMy Twilio API also got hacked by a South African person, I fixed that. I think I know who it was, some nice kid who tried to scam me for money for a PS5. I could only offer him a free account with unlimited usage, but he never registered. Twilio locks the account when they see weird things like this, blocking the business from working. I had to create a notification system at 2am that night. Then I changed my geo rules to allow registration for certain countries. My first international user was from Denmark, but the service can work for 24 countries and 4 satellite phone services.\n\nThis was a real lesson in ensuring your login and signup/payment forms are damn near perfect before release.\n\nNow to the numbers. This is for the last 30 days or for January (depending on the service billing).\n\n**Twilio**: \n\n- 1290 transactions\n- $10.707 SMS spend\n- $23.86 total spend. \n- That's $0.018 average spend per transaction.\n- Carrier fees are roughly 1/2 of SMS fees. MMS fees are minimal.\n- The largest day was Jan 03 when I was doing a lot of testing with 104 messages running a bill of $2.37.\n\n**Stripe**: \n\n- $0 earned\n- ($1.82) owed due to refunding myself like an idiot instead of using a test token. This will come out of the first real customer (or my payment if I buy my own product for a quick test).\n\n**GCS** (usage cost and subtotal shown, savings are being applied): \n\n- Vertex AI: $185/$84 (usage vs what I paid)\n- Cloud Run: $59/$45\n- Others: $14.90/$9.93\n\n**AWS**:\n\n- App Runner: $41.94\n- Others: $3.77\n\nOther business expenses (registration, phone number, etc.): ~$500.\n\n**Total**: \n\n- $208.50 in service costs/mo\n- ~$708.50 total counting business registrations and other factors.\n\n**Claude**: \n\n- We don't talk about it. Claude is a money whore, and I only use it occasionally when Gemini just can't figure it out.\n- Claude is much better than Gemini for coding tasks IMO, but it's so darned expensive! Every interaction is another $11, and they spam my email every time.\n\n**Gemini**:\n\n- Essentially free. I think I have a Pro plan for personal use and I always use Gemini 3. I've only hit the limit once and it switched back to Gemini 2.5, which is arguably a better system IMO. Gemini 3 is like an ADD child that always wants to take shortcuts and do the lazy thing first. My GEMINI.md file is like a prison rulebook compared to Claude's file.\n\n**Path to profitability**:\n\nIf I can get about 120 paid Explorer users then I'll cover my costs (net earnings).   \nOR If I can get 69 Ranger users then I can cover costs.  \nOR if I can get 1 enterprise user then I can cover the costs.\n\n**Marketing**:\n\nMarketing is the next challenge. I have no income at the moment, so everything has to be grassroots (hello redditors!). \n\n- I've posted on LinkedIn, reddit, and facebook. I have business profiles in all three places, see /r/ridgetext\n- I've optimized the website and began adding more pages for [better searchability](https://imgur.com/a/WXBCboN).\n- I [created a Youtube short](https://youtube.com/shorts/TQMcDPrAa8s) - accidentally, I thought it would be a regular video but Youtube decided to post it to Shorts. My son actually saw it! 37 people saw it, 1 like (me).\n- I've recorded a number of videos and deleted every one of them in shame because I'm not good at making videos, or because I found a bug in the middle of the video. I have to get over this because people need to see it in action.\n\nI want to go to outdoors shows and see what people think. I also want to see if people in /r/hunting would like it, or any of the camping subreddits.\n\nI've also considered enterprise users like forest service, firefighters, rangers (hence the name of one of the pricing tiers), government agencies (SAM registration is pending), fishing boats, and international shipping. The main bottleneck for me is finding who to contact and what to say. My next step is creating a pitch deck for these enterprises.\n\nAnyways, I'm having a lot of fun creating this, even if it's just something I use myself, but I would love if more people could find value in such a simple solution for off-grid internet and mapping access.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1qtmip7/here_are_the_results_of_the_last_30_days_for_my/",
      "domain": "self.startup",
      "is_self": true,
      "comments": []
    },
    {
      "id": "1qugoim",
      "title": "“We Paid for It, So We Own It” Is Where IT Contracts Go Wrong",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qugoim/we_paid_for_it_so_we_own_it_is_where_it_contracts/",
      "author": "its_akhil_mishra",
      "created_utc": "2026-02-03 03:12:46",
      "score": 3,
      "num_comments": 3,
      "upvote_ratio": 1.0,
      "text": "“If we paid for it, we own it.”\n\nOn the surface, that statement feels reasonable because it matches how most people think about buying something: money changes hands, the work gets delivered, and ownership transfers cleanly from one side to the other.\n\nBut anyone who has actually delivered IT projects at scale knows the reality is far more layered, because most teams are not building everything from scratch for every engagement, and they cannot afford to if they want to ship quickly, price competitively, and maintain quality.\n\nBehind almost every “custom build” sits an ecosystem of existing frameworks, internal libraries, deployment scripts, templates, boilerplate modules, and tooling that existed long before a particular client ever entered the picture.\n\nThose assets are not shortcuts in the lazy sense. They are the delivery engine.\n\n**### Where Contracts Flatten the Most Important Nuance**\n\nThe problem usually starts with one sentence that looks harmless when the relationship is healthy:\n\n“All deliverables belong to the client.”\n\nThat clause rarely causes conflict while things are going well, because during delivery everyone is focused on progress, timelines, and getting to the finish line. But contracts are not really interpreted during good times. They get interpreted when something becomes uncomfortable, when a deadline slips, when a handover becomes tense, or when someone on the client side starts asking for “everything” as part of closure.\n\nOnce that clause is read literally, reusable components start getting treated like bespoke IP that was created specifically for the project. Internal tooling is assumed to be part of the handover. Build scripts, deployment automation, templates, and even general-purpose modules that you use across multiple clients start getting pulled into the client’s ownership expectations, even though none of those items were scoped, priced, or intended to leave your environment.\n\nAnd when you try to explain the distinction later, it rarely lands as a reasonable boundary. It often lands as “you’re withholding what we already paid for,” which is where relationships start to strain even when nobody is acting in bad faith.\n\nThe uncomfortable truth is that ownership is not implied by effort, timelines, or invoices paid. Ownership is created by what the agreement clearly defines, and anything left vague will eventually be interpreted in the way that benefits the party who is demanding more.\n\nIf you do not separate what is built specifically for the client from what powers your business internally, you end up giving away leverage without noticing it in the moment. Each vague clause makes the next project harder to price because you lose the ability to reuse what you have already built. Each unclear handover expectation chips away at your standardisation, your delivery speed, and your ability to scale without burning out your team.\n\nOver time, this stops being a one-off misunderstanding and becomes a structural business problem, because you start hesitating to invest in better internal tooling when there is a risk that every improvement will later be treated as client-owned property.\n\n**### How IT Teams Fix This Without Making It Adversarial**\n\nThe fix is not aggressive language or defensive behaviour. The fix is practical clarity that removes ambiguity before it becomes emotional.\n\nStrong agreements define categories of IP in plain terms, so there is a clear separation between:\n\na) what is custom-developed for the client during the engagement, and\n\nb) what already existed before the project began, including your internal libraries, frameworks, scripts, templates, and know-how.\n\nWhere ownership does not make commercial sense, the contract should grant a license instead, so the client can use what they need to operate the deliverables without turning your internal engine into their asset.\n\nJust as importantly, the agreement should clearly state what gets handed over at the end of the project and what does not, because handovers are where misunderstandings tend to surface first.\n\nAnd pricing needs to match those boundaries, because clients are rarely upset about limits when those limits were visible upfront and reflected in the commercial structure, rather than introduced after delivery when they already feel entitled to everything.\n\n**### Final Thoughts**\n\nPaying for development does not automatically mean owning everything behind it. When contracts fail to separate custom work from pre-existing IP, IT teams quietly give away leverage, create avoidable friction, and make future delivery harder than it needs to be.\n\nGood contracts do not slow teams down. They protect the engine that makes delivery possible.\n\nWhen ownership is clear from the start, projects stay focused on outcomes instead of arguments, and teams grow sustainably without accidentally giving their business away one vague clause at a time.[](https://www.reddit.com/submit/?source_id=t3_1qugnjt)",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1qugoim/we_paid_for_it_so_we_own_it_is_where_it_contracts/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o3aewh1",
          "author": "prepend",
          "text": "I don’t understand your point. In what situation would deliverables not belong to the client?",
          "score": 1,
          "created_utc": "2026-02-03 04:41:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3aubkg",
              "author": "HalastersCompass",
              "text": "The only thing I can think of is the software itself sometimes the IP stays with the developer and it's rented back to the organisation....",
              "score": 1,
              "created_utc": "2026-02-03 06:41:09",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3b7iti",
          "author": "Jury-Technical",
          "text": "This chat gpt level Argumentation. I neither own the algorithm that controls The ABS in my car but i do own the car. And btw neither do the developers made their tools from scratch , does that mean that they also do not own the tools and architecture they made?",
          "score": 1,
          "created_utc": "2026-02-03 08:42:41",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qvms0t",
      "title": "Cyber/Online Security Services",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qvms0t/cyberonline_security_services/",
      "author": "Reasonable_Slide4320",
      "created_utc": "2026-02-04 12:05:01",
      "score": 3,
      "num_comments": 8,
      "upvote_ratio": 1.0,
      "text": "Hello!\n\nI help SMBs and private individuals secure their online accounts after witnessing how often small businesses fall victim to phishing, account takeovers, and data leaks.\n\nPlease see list of basic services below.\n\n✔ Facebook Page Security Audits\n\nPrevent page hijacking, fake ads, and unauthorized admins.\n\n✔ Device & Account Security\n\nStop hackers from spreading from one compromised account to everything else.\n\n✔ Scam & Phishing Guidance\n\nIdentify fake emails/messages fast and know what to do if you already clicked.\n\n✔ Darknet Exposure Checks\n\nFind out if your email, passwords, or company data were leaked and lock them down before attackers use them.\n\nShould you need other services that are relevant to cyber security, you can send me a message.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1qvms0t/cyberonline_security_services/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o3jnsb7",
          "author": "Forsaken_Lie_8606",
          "text": "cybersecurity is a massive market but super crowded. what s your differentiator? are you targeting smbs or enterprise? smbs are easier to reach but harder to retain unless you nail the onboarding",
          "score": 2,
          "created_utc": "2026-02-04 15:37:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3jnzdh",
          "author": "Forsaken_Lie_8606",
          "text": "cybersecurity is a massive market but super crowded. what s your differentiator? smbs are easier to reach but harder to retain unless you nail the onboarding",
          "score": 2,
          "created_utc": "2026-02-04 15:38:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3jt7q6",
              "author": "Reasonable_Slide4320",
              "text": "This is a good question. It made me think why I wanted to start this kind of service.\n\nI am actually an employee of a MSSP company overseas. They tried to acquire clients here in the PH and I did my best to help them. However, their pricing is more of enterprise level and still in the expensive end.\n\nI kind of felt bad for SMBs and Solopreneurs who often get scammed, phished, or hacked. They need some sort of protection too but most of the service packages in the cyber security field are often enterprise level.\n\nWith that being said, I think my differentiator lies in the service’s customizability and a more SMB friendly pricing.",
              "score": 1,
              "created_utc": "2026-02-04 16:02:35",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3jpvr3",
          "author": "sailormish980",
          "text": "I should recommend you to create one landing page which must contain everything you offerbut before offering you must explain the potential scams in simple way possible then CTA to your solution (means services you offer) in regional language and share that landing page as much as possible\nI think this will help",
          "score": 2,
          "created_utc": "2026-02-04 15:47:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3jteww",
              "author": "Reasonable_Slide4320",
              "text": "I am just starting so any feedback such as yours is very well appreciated🙏",
              "score": 1,
              "created_utc": "2026-02-04 16:03:31",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3oqoyg",
          "author": "Vaibhav_codes",
          "text": "This kind of practical security help is underrated most SMBs don’t need enterprise tools, they need someone to spot risks early and clean things up fast",
          "score": 2,
          "created_utc": "2026-02-05 08:54:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3ovzd5",
              "author": "Reasonable_Slide4320",
              "text": "Exactly👌 its also the enterprise level tools that make cyber security services mostly expensive. To support SMBs is to do things hands on most of the time.",
              "score": 1,
              "created_utc": "2026-02-05 09:46:27",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qs90ls",
      "title": "I’ll write or edit your content using AI + human polish for $10 — Pay only if you like it",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qs90ls/ill_write_or_edit_your_content_using_ai_human/",
      "author": "pankaj662",
      "created_utc": "2026-01-31 17:49:49",
      "score": 3,
      "num_comments": 0,
      "upvote_ratio": 0.8,
      "text": "Need help writing or fixing your content fast?\n\nI’ll write or edit your:\n• Blog posts\n• LinkedIn posts\n• Product descriptions\n• Emails\n• Website copy\n• Captions\n• AI drafts that sound robotic\n\nI use AI to work fast, then manually rewrite and polish everything so it sounds natural and human — not copy-paste AI junk.\n\nPrice: $10 per piece\nAnd here’s the simple part: Don’t pay if you don’t like the result.\nNo risk. You only pay when you’re satisfied.\n\nIf you’re interested, comment or DM me with:\n– What you need written/edited\n– Word count (approx)\n– Deadline\n\nI’ll reply quickly and start right away.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1qs90ls/ill_write_or_edit_your_content_using_ai_human/",
      "domain": "self.startup",
      "is_self": true,
      "comments": []
    },
    {
      "id": "1qwj03h",
      "title": "A problem I ignored for years before finally fixing it",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qwj03h/a_problem_i_ignored_for_years_before_finally/",
      "author": "Loading_Humor",
      "created_utc": "2026-02-05 11:37:40",
      "score": 3,
      "num_comments": 3,
      "upvote_ratio": 1.0,
      "text": "For a long time, I treated messy feedback as just part of the job. Comments on outdated files, revisions based on older versions, and repeated clarifications felt annoying but normal.\n\nIt wasn’t until I started tracking where my time was actually going that I realized how much effort was being wasted after the work was done. Not building, not designing, just untangling feedback.\n\nTo fix this for myself, I built a simple internal solution that later became QuickProof, focused only on keeping feedback attached to the right version. No big vision at the start, just an attempt to remove friction from my own workflow.\n\nIt made me realize how many startup ideas don’t come from inspiration, but from finally getting tired of a problem you’ve normalized for too long.\n\nFor founders here, what’s a problem you put up with for years before deciding it was worth solving?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1qwj03h/a_problem_i_ignored_for_years_before_finally/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o3pd466",
          "author": "IdeasInProcess",
          "text": "I tolerated unstructured client feedback for years until I calculated the exact cost of the rework cycles. We found that sixty percent of our engineering time was spent clarifying requirements rather than writing code. I implemented a rigid approval system where every piece of feedback had to map to a specific line item in the scope. You are right that the best revenue opportunities often come from simply removing the friction you have normalised.",
          "score": 1,
          "created_utc": "2026-02-05 12:14:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3pj5t8",
          "author": "Vaibhav_codes",
          "text": "Love this so many ideas come from simply getting fed up with a recurring pain Tracking the “hidden friction” in daily work is such a powerful way to spot real problems worth solving",
          "score": 1,
          "created_utc": "2026-02-05 12:55:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3qpedh",
          "author": "sameer_somal",
          "text": "lack of structure can kill a lot of great ideas and even implementation processes. messy feedback, repeated follow ups, misalignment, all these are definitely silent killers that need to be tackled early on for startups.",
          "score": 1,
          "created_utc": "2026-02-05 16:34:10",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qu53d9",
      "title": "Where do you gather and read customer feedback?",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qu53d9/where_do_you_gather_and_read_customer_feedback/",
      "author": "The_Rusemaster",
      "created_utc": "2026-02-02 19:33:35",
      "score": 2,
      "num_comments": 10,
      "upvote_ratio": 0.67,
      "text": "Doing research on a new tool I'm theorycrafting for my business and could use some input from likeminded people\n\nI’m trying to understand where business owners really end up spending time reading feedback once the product or service is live.\n\nIOW I’m interested in concrete examples of what sources you personally check on a regular basis.\n\nSpecifically:\n\n* What channels do you read most? (support tickets, app reviews, email, Slack, Reddit, sales calls, etc.)\n* Do you use any tools to aggregate/summarize feedback, or do you mostly skim manually?\n* Roughly how much time per week do you spend on this?\n* Any part of the process that's annoying/tedious?\n\nI realize this might not apply to all types of businesses but maybe there's some angle I haven't thought of. Appreciate any input!",
      "is_original_content": false,
      "link_flair_text": "business acumen",
      "permalink": "https://reddit.com/r/startup/comments/1qu53d9/where_do_you_gather_and_read_customer_feedback/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o38aex1",
          "author": "ruibranco",
          "text": "Honestly the highest signal feedback I get isn't from any tool - it's from support tickets and sales call recordings. People don't sugarcoat things when they're trying to get something fixed or deciding whether to buy. I skim app store reviews weekly and check Reddit/Twitter mentions but those skew toward extremes (love or hate). The tedious part is definitely connecting the dots across channels. Someone complains on Twitter, another files a ticket about the same thing, a third mentions it on a call - recognizing those as the same issue is where most feedback processes break down. I just keep a simple shared doc where I tag recurring themes manually. Not sexy but it works.",
          "score": 1,
          "created_utc": "2026-02-02 21:33:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3ay7nq",
              "author": "The_Rusemaster",
              "text": "Interesting. The tool I'm thinking of basically solves the problem of scattered feedback. Idea is it gathers feedback across multiple channels and then delivers you a concise weekly report. Sounds a bit similar to what you are already doing?   \n  \nObviously the sales call transcripts would be tricky to automate unless provided by you",
              "score": 1,
              "created_utc": "2026-02-03 07:15:02",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3cm6nz",
          "author": "Intrepid_Boss9449",
          "text": "I mostly check app reviews and support tickets for feedback since they’re direct and detailed. I spend about an hour a week skimming through them but it can get tedious without a good tool to summarize stuff. If you’re targeting Reddit for sales, a tool like SocListener could help by pulling relevant posts and comments so you don’t waste time searching manually.",
          "score": 1,
          "created_utc": "2026-02-03 14:52:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3cq0v1",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-03 15:12:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3d2in9",
              "author": "The_Rusemaster",
              "text": "Appreciate the input! What kind of aggregators did you try? And why did you go back to skimming manually?\n\nExploring the possibility of adding custom data sources as well (your internal ticket feeds) etc.",
              "score": 1,
              "created_utc": "2026-02-03 16:11:47",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3e76nn",
          "author": "jBlesse",
          "text": "Once things are live, I’ve found feedback ends up scattered whether you want it to be or not. Support tickets and email are the most obvious, but a lot of the unfiltered stuff shows up in places like Reddit threads, community comments, and even replies to unrelated posts.\n\nEarly on I was skimming manually, which worked until volume picked up. What helped was separating collection from synthesis. I still read raw feedback myself, but I rely on tooling to surface patterns so I’m not reacting to the loudest comment of the week. We use Syndr AI on the discovery side to monitor recurring themes in public conversations and route that back into product and messaging decisions. It doesn’t replace direct feedback like tickets or calls, but it saves a ton of time by showing what keeps coming up across channels.",
          "score": 1,
          "created_utc": "2026-02-03 19:17:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3o6tbg",
          "author": "harshXgrowth",
          "text": "This is a great question! For my own projects, I find a mix of direct customer interviews and monitoring social media, especially Twitter and Reddit, to be most insightful. I also keep an eye on app store reviews. I haven't found a perfect aggregation tool yet, so it's mostly manual skimming, which can definitely be tedious. It probably takes me a few hours a week, but it's invaluable for understanding user sentiment and identifying pain points. What channels have been most effective for you so far?",
          "score": 1,
          "created_utc": "2026-02-05 05:55:11",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}