{
  "metadata": {
    "last_updated": "2026-01-21 02:39:59",
    "time_filter": "week",
    "subreddit": "startup",
    "total_items": 15,
    "total_comments": 126,
    "file_size_bytes": 123249
  },
  "items": [
    {
      "id": "1qed2i1",
      "title": "How do you stay reachable while traveling or away from the office?",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qed2i1/how_do_you_stay_reachable_while_traveling_or_away/",
      "author": "Notorious_Insanity",
      "created_utc": "2026-01-16 11:01:27",
      "score": 22,
      "num_comments": 22,
      "upvote_ratio": 1.0,
      "text": "Interested in what everyone is doing to stay connected when you’re not physically at the office?\n\nI hate being glued to my desk, and love to be able to work from a coffee shop orwhile I’m on the road. I’m looking for the best way to take calls and respond to texts professionally (don’t like using my personal phone).\n\nDo you have a second cell phone, use a call forwarding app, or virtual number? I’ve given out my personal number a few times to clients but that opens a can of worms.\n\nWondering what other small business owners are doing?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1qed2i1/how_do_you_stay_reachable_while_traveling_or_away/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "nzwoeij",
          "author": "Inevitable_Tree_2296",
          "text": "I'm team virtual number! Everything is forwarded to my personal cell, but clients aren't getting my personal number.",
          "score": 3,
          "created_utc": "2026-01-16 12:14:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzwtub7",
              "author": "Sad-Speech-932",
              "text": "yep, I do this too. I also set up rules for call forwarding so client calls only come through during certain hours (meaning they can't call me after 5pm), and anything urgent gets sent to text. It really helps give me some semblance of a work/life balance.",
              "score": 1,
              "created_utc": "2026-01-16 12:50:47",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzwzvjn",
                  "author": "Notorious_Insanity",
                  "text": "Being reachable away from my desk is being reachable 24/7, so knowing I could set hours is appealing. Which service do you use for your virtual number?",
                  "score": 1,
                  "created_utc": "2026-01-16 13:26:47",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzwtldp",
          "author": "Desperate_Quit_5433",
          "text": "I use a voip system.",
          "score": 1,
          "created_utc": "2026-01-16 12:49:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzwy8vi",
          "author": "screechymeechydoodle",
          "text": "it’s 2026, we don’t need landlines anymore! Free yourself from the office phone and get a cloud phone system!! My cell is my work phone, and I can answer calls and texts from my fav cafe, I love it.",
          "score": 1,
          "created_utc": "2026-01-16 13:17:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzxjyk1",
          "author": "Large_Cantaloupe1507",
          "text": "Virtual numbers are the best with VOIP service",
          "score": 1,
          "created_utc": "2026-01-16 15:09:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzykfnx",
          "author": "Futuristic-D",
          "text": "Get a business voip number, could be as cheap as $6 per month",
          "score": 1,
          "created_utc": "2026-01-16 17:51:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzylr7i",
          "author": "MixtureReady6111",
          "text": "I use a virtual number (Google Voice-style) that forwards to my phone. Clients think it’s a “work line,” I can take calls anywhere, and I can silence it outside work hours. Way better than handing out my personal number.",
          "score": 1,
          "created_utc": "2026-01-16 17:57:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzyny9x",
          "author": "Severe_Promise717",
          "text": "yeah i ran into this exact mess when i stopped being tied to a desk  \nwhat worked was drawing a hard line between personal and work access\n\ni learned the cleanest setup is one virtual number that rings anywhere but lives outside your real phone, i picked that up from a short note i read [here](https://NoFluffWisdom.com/Subscribe) about keeping work reachable without letting it leak everywhere\n\nclients get one channel  \ni check it on my terms  \ntravel stopped feeling noisy\n\nsimple rule  \nif they cant reach you later they will interrupt you now",
          "score": 1,
          "created_utc": "2026-01-16 18:06:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzzaibd",
          "author": "Actonace",
          "text": "Love this definitely saving my personal number for friends only and using a separate work/virtual line makes travelling so much less chaotic.",
          "score": 1,
          "created_utc": "2026-01-16 19:47:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o00x1xa",
          "author": "AskDeel",
          "text": "Yes, unfortunately.",
          "score": 1,
          "created_utc": "2026-01-17 00:44:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o018q17",
          "author": "Flimsy_Bike7598",
          "text": "agreed",
          "score": 1,
          "created_utc": "2026-01-17 01:57:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o02ckxa",
          "author": "Unfair-Potential-330",
          "text": "use google voice and connect a 2nd number. you can specify to others if you only want to be texted, and under what hours you respond. \n\nI don't like to have to respond ever, but when I do, it's when I want.",
          "score": 1,
          "created_utc": "2026-01-17 06:37:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o03vvah",
          "author": "tonyinmars_",
          "text": "Yes, unfortunately.",
          "score": 1,
          "created_utc": "2026-01-17 14:14:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0hzdnt",
          "author": "Telecom_VoIP_Fan",
          "text": "What you need is a VoIP phone system. This allows you to forward incoming calls from your office phone to any device, even a PC, that has an internet connection plus mike and speaker. I have a European VoIP service called Zadarma that supports exactly the options you are looking for.",
          "score": 1,
          "created_utc": "2026-01-19 16:22:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0mp421",
          "author": "MORPHOICES",
          "text": "I learned the hard way that the goal isn’t being reachable it’s being reachable w/o leaking your life. \\~\n\nWhat has succeeded for me and certain other founders I am acquainted with.\n\n1. Keep the service but change the device\n\nI no longer carry two phones. I use a virtual business number to connect to both my mobile phone and my desktop computer. I never share my personal line with clients; I can mute my phone after work without any guilt.\n\n2. Calls second, asynchronous first.\n\nI inform my clients that the quickest way to reach us is via email or text message. Furthermore, phone calls are best done by appointment only.\n\nMost problems don't actually require a call. We just call because it’s there.\n\n3. Working hours are preferred always on.\n\nI post clear windows like, “Free for calls 10am–2pm local.”.\n\nOther than that, it's all text/email. As a result, interruptions dropped by 70%.\n\n4. Call routing with ease.\n\nThose who don’t wish to speak to me go to voicemail with a clear promise (I’ll respond same day) \n\nFamiliar customers ring through.\n\nHush your noise without looking unprofessional.\n\n5. Just one place to reply.\n\nMessages from text, voicemail or email all end up in one single inbox. Instead of constantly reacting, I check it 2–3 times daily when I’m traveling.\n\nUnconventional lesson.\n\nOver-availability trains people to perceive everything as urgent.    When boundaries are clearly set, we build trust.\n\nThere is no need to vanish altogether, just simply ensure that you have a system that runs when you’re not engaged with it.",
          "score": 1,
          "created_utc": "2026-01-20 07:38:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0pk1kc",
          "author": "Joel_VirtualPBX",
          "text": "You’re already circling the right answer, and most replies here are pointing in the same direction for a reason.\n\nThe cleanest setup is a VoIP system with a virtual business number and a softphone app. One number that lives outside your personal cell but rings anywhere you are, phone or laptop, wherever you are working that day.\n\nThe real win is separation and control. Clients get a professional business line, you keep your personal number private, and you can stay mobile without being on call 24/7. Call forwarding alone usually breaks down once you want real boundaries.\n\nI work in this space, and this is exactly the transition most founders make once they stop being tied to a desk.",
          "score": 1,
          "created_utc": "2026-01-20 18:21:31",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qcoexd",
      "title": "I’ll pay you $2 if I can’t scrape data for you",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qcoexd/ill_pay_you_2_if_i_cant_scrape_data_for_you/",
      "author": "rexis_nobilis_",
      "created_utc": "2026-01-14 14:17:50",
      "score": 17,
      "num_comments": 66,
      "upvote_ratio": 0.9,
      "text": "Another challenge I’m doing for free. I will pay you if I can’t scrape data that you request in less than 2 prompts. \n\nWe’re stress-testing part of our general AI agent that goes deep in any vertical of knowledge work + can iterate and carry-out very long running tasks that consists of thousands of steps, all from a single prompt. \n\nScrapping data is of course a popular use-case and need to test some parts of a new system we built. Here are the rules:\n\n> Just tell me what data you want to scrape in the web (nothing behind auth for now, still working on that part)\n\n> I MUST confirm whether I think your request is possible first.\n\n> If you ask to scrape 100s, 1000s or 10,000s, I will provide you just a sample to make sure I can go through all the requests. \n> If my general AI agent can’t create a csv, excel, json etc… list (it can create files) based on your request. I will send you $2.\n\n> Those $2 will be sent to you via Venmo, PayPal or Zelle (ONLY).\n\n> If it fails, please let other people in the comments know so we don’t get the same request.\n\n> If it works, please let other people in the comments know so we don’t get the same request.\n\n> If there is any ambiguity, I will ask for clarification. \n\nWe’ll define a successful scrape if the file produced matches your request.\n\nLet the fun begin! ",
      "is_original_content": false,
      "link_flair_text": "services",
      "permalink": "https://reddit.com/r/startup/comments/1qcoexd/ill_pay_you_2_if_i_cant_scrape_data_for_you/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "nzl3sjt",
          "author": "pg3crypto",
          "text": "[netaporter.com](http://netaporter.com) all dresses with all sizes scraped and categorised by SKU with a direct link to each product in the data. I've tried that for years...it cannot be done.",
          "score": 2,
          "created_utc": "2026-01-14 18:40:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzl43ti",
              "author": "pg3crypto",
              "text": "By sizes I mean all the dimensions, waist, hip, high hip, bust etc.\n\nI have an AI model I need to train for size matching, and they have all the data.",
              "score": 1,
              "created_utc": "2026-01-14 18:42:14",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzl494y",
                  "author": "pg3crypto",
                  "text": "I don't want $2, just the data.",
                  "score": 1,
                  "created_utc": "2026-01-14 18:42:53",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0cq23v",
          "author": "7snipers7",
          "text": "Apollo.io database ngl I'd love to see that",
          "score": 2,
          "created_utc": "2026-01-18 20:32:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzjy7jf",
          "author": "DbG925",
          "text": "Love the challenge. Good luck. \n\nI would love to see the last 2 years of sales data of a 1989 upper deck Ken Griffey jr graded PSA 10. And no I don’t need you to pay me. If this works correctly and reliably, I will gladly pay you when your service goes live.",
          "score": 3,
          "created_utc": "2026-01-14 15:33:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzryo21",
              "author": "DV_Studio_Dev",
              "text": "Small clarification:\nLLMs don’t have direct access to historical databases or “old data” by default.\nVery specific figures from decades ago usually require external sources\n(archives, reports, scraping).\nWithout that, results are estimates at best.\nAs far as I know...",
              "score": 1,
              "created_utc": "2026-01-15 18:46:12",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzsa4r7",
                  "author": "DbG925",
                  "text": "Of course. That’s why I wanted to see what OPs software could do since I AM looking for a scraper and aggregator from multiple sources. I could see it working where an agent worked as an orchestrator. Unfortunately for my use case here, there were some holes that can’t quite be filled yet.",
                  "score": 2,
                  "created_utc": "2026-01-15 19:38:05",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nzlhe36",
              "author": "rexis_nobilis_",
              "text": "Super sorry for the delay! Challenge accepted! Send me a DM and check to see if what the agent got works for you :)",
              "score": 1,
              "created_utc": "2026-01-14 19:41:56",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzjy8hx",
          "author": "pua-mv",
          "text": "Scrape apify.com",
          "score": 1,
          "created_utc": "2026-01-14 15:33:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzk1uh6",
              "author": "rexis_nobilis_",
              "text": "What are you trying to scrape from the scrapper website itself?",
              "score": 1,
              "created_utc": "2026-01-14 15:50:18",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzkm5nc",
                  "author": "pua-mv",
                  "text": "Scrape the results using url\nLike with the url you should be able to scrape the data shown in the page",
                  "score": 1,
                  "created_utc": "2026-01-14 17:22:23",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzkmstj",
          "author": "eckyeckypikangzoop",
          "text": "Scrape product information from any major grocery vendor, eg. Sysco or USFoods",
          "score": 1,
          "created_utc": "2026-01-14 17:25:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzkn95w",
              "author": "rexis_nobilis_",
              "text": "Do you have links to the producer you want to scrape? Also what you want to scrape within the product info page?",
              "score": 1,
              "created_utc": "2026-01-14 17:27:21",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzl13oj",
          "author": "dgzen99",
          "text": "I would like the list of email IDs of active photographers who have a broken or laggy portfolio website",
          "score": 1,
          "created_utc": "2026-01-14 18:28:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzlftwp",
              "author": "rexis_nobilis_",
              "text": "Wait. You want emails of photographers who have a broken or laggy portfolio website? How do you define laggy or broken?",
              "score": 1,
              "created_utc": "2026-01-14 19:34:55",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzll89e",
          "author": "Consistent-Dinner424",
          "text": "II am looking for a list of restaurants with phone numbers that do not respond to their Google reviews, or their response rate is under 10% have a star rating between 4 and 4.5, and possess over 300 reviews. I would appreciate it if this list could include restaurants from the USA, India, and Mexico, and be sorted by their cuisine category.",
          "score": 1,
          "created_utc": "2026-01-14 19:59:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzmem2t",
              "author": "rexis_nobilis_",
              "text": "Please DM me, I think I managed to do it :D",
              "score": 2,
              "created_utc": "2026-01-14 22:12:36",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzmm2q1",
          "author": "Mompreneur1987",
          "text": "Groupon merchants with their email+address, and deal info (including deal images). Start with zip code 60188, restaurants and kids places (things to do).",
          "score": 1,
          "created_utc": "2026-01-14 22:48:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzmn561",
          "author": "NoLuckChuck-",
          "text": "I would like the names, work email addresses and school districts of 1000 high school science and engineering teachers.",
          "score": 1,
          "created_utc": "2026-01-14 22:54:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzmzbqq",
              "author": "OakCityReddit",
              "text": "I’m in the education world. What would you do with those?",
              "score": 1,
              "created_utc": "2026-01-14 23:59:00",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzn22rz",
                  "author": "NoLuckChuck-",
                  "text": "I don’t want to go in to specifics but I am also a teacher and have created a piece of software that helps with automatic grading of science labs.",
                  "score": 2,
                  "created_utc": "2026-01-15 00:13:57",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nzogbf9",
              "author": "rexis_nobilis_",
              "text": "That should be possible, DM me! I’ll send you what Nelima got",
              "score": 1,
              "created_utc": "2026-01-15 05:18:52",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzmnf5o",
          "author": "NoLuckChuck-",
          "text": "I would like the names, work email addresses and school districts of 1000 high school science and engineering teachers.",
          "score": 1,
          "created_utc": "2026-01-14 22:55:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzmo6qg",
          "author": "VividReputation3296",
          "text": "Can you scrap data from medicine wholesalers for each of their customers? Why I’m asking it is because the wholesalers have different prices for different buyers.",
          "score": 1,
          "created_utc": "2026-01-14 22:59:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzmzpha",
              "author": "rexis_nobilis_",
              "text": "Do you know if that data is publicly available? I don’t think it’s something these wholesalers check if I’m not mistaken",
              "score": 1,
              "created_utc": "2026-01-15 00:01:04",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzpiuge",
                  "author": "VividReputation3296",
                  "text": "That data is not publicly available. Every pharmacy has login access to retrieve the cost of medication",
                  "score": 1,
                  "created_utc": "2026-01-15 11:04:02",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzmog9k",
          "author": "Secure_Fill704",
          "text": "I would like to have All Restaurants Data [ Names, Cusine, Address, Lat Lon,Type ] In Hyderabad",
          "score": 1,
          "created_utc": "2026-01-14 23:00:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzoge0e",
              "author": "rexis_nobilis_",
              "text": "Reach out in my DMs, I’ll take the challenge :D",
              "score": 1,
              "created_utc": "2026-01-15 05:19:24",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzmxf63",
          "author": "Free_Le",
          "text": "Id want a list of every single small business that doesnt have a website but have a gmb for their business and are listed on google maps. Niche wise u could do any niche of small businesses.",
          "score": 1,
          "created_utc": "2026-01-14 23:48:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzmzc7e",
              "author": "rexis_nobilis_",
              "text": "That’s very broad but seems doable. What is a gmb? How would of you define niche?",
              "score": 1,
              "created_utc": "2026-01-14 23:59:04",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzmzxf1",
                  "author": "Free_Le",
                  "text": "Gmb= Google my business page. So basically they gota have a business listing on google plus on google maps but no website. If u really wanted niche it could be roofing and or beauty services like medspas, injectors,lash brow studios.",
                  "score": 1,
                  "created_utc": "2026-01-15 00:02:16",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nzp1xjw",
              "author": "shakeitup333",
              "text": "That’s super simple to make using something like antigravity or cursor. Just download, chat to the llm model, tell it you want to scrape google for exactly what you just said by area and it will make it for you. Go wild if you like and ask it for extra info. It will put it into docs for you as well or excel or whatever you prefer. Super simple.",
              "score": 1,
              "created_utc": "2026-01-15 08:23:09",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzmzzg7",
          "author": "Severe_Promise717",
          "text": "I ran into this when I tried to build a scrape tool on my own - the thing that helped was asking for one clear slice of data first. If the slice is clean then scale it. If not, the whole job breaks later.\n\nStart tiny so you see the weak spots fast",
          "score": 1,
          "created_utc": "2026-01-15 00:02:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzn6z2z",
          "author": "deryq",
          "text": "Coil this be used as a continuous scraper for state government websites?  I’d like to check once a week for specific permit filings from companies with specific NAICS/SINC codes.  I’d like to have the output be an email with a table of the relevant filings and a short description and link to each.  Could your scraper do this?  I know government websites can be a bit difficult.",
          "score": 1,
          "created_utc": "2026-01-15 00:40:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzrn8ij",
              "author": "rexis_nobilis_",
              "text": "Can you give me an example of a government website?",
              "score": 1,
              "created_utc": "2026-01-15 17:55:33",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nznffj7",
          "author": "Mishackshimmy",
          "text": "I would like to know whether a given person or entity has any recorded judgments relevant to them at state and county level. Deliverables would include search results as well as copies of the responsive documents.",
          "score": 1,
          "created_utc": "2026-01-15 01:28:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzo3vph",
          "author": "dotben",
          "text": "Can you clarify - are you testing a model that will properly scrape, normalize, clean etc a given source of data (url/etc) or (/and) are you testing a model that will work out where to obtain that data as well when given a generic prompt?",
          "score": 1,
          "created_utc": "2026-01-15 03:53:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzo5sj8",
              "author": "rexis_nobilis_",
              "text": "It’s basically our general ai agent. She can scrape, normalize and clean data if you want. It can also go find where to obtain the data as well :) just need to prompt it correctly",
              "score": 1,
              "created_utc": "2026-01-15 04:05:38",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzoc7te",
          "author": "nomorehourly",
          "text": "Scrape all replies on the first page of every thread in board room forum on [buildersociety.com](http://buildersociety.com)",
          "score": 1,
          "created_utc": "2026-01-15 04:49:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzqivqv",
              "author": "rexis_nobilis_",
              "text": "Please reach out! I think I can do it, I’ll send you what Nelima got",
              "score": 1,
              "created_utc": "2026-01-15 14:51:41",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzoklby",
          "author": "yudatheboss",
          "text": "I would like the names of every skilled nursing home facility owner in missouri. And the associated property(s) of each one and the stats of each skilled nursing home.\n\nEg\nJohn smith, blank grove rd, 52 beds (zip code city, other associated properties etc)",
          "score": 1,
          "created_utc": "2026-01-15 05:51:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzpe9f8",
          "author": "hammerzzzzzz",
          "text": "I would like todays greyhound race cards and dog form details from racingpost.com i dont think you can do it without an api",
          "score": 1,
          "created_utc": "2026-01-15 10:22:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzpv0dd",
          "author": "RevolutionaryRip4091",
          "text": "This is a fascinating challenge that highlights a real market need! The demand for reliable, automated data scraping is huge - businesses constantly need structured data from websites for market research, competitor analysis, lead generation, etc.\n\n\n\nWhat you're building could easily evolve into a SaaS product. Imagine a no-code scraping platform where users just describe what data they want and your AI agent figures out how to extract it. The key differentiator would be handling edge cases, dynamic content, and adapting to site changes automatically.\n\n\n\nThe pricing model writes itself: charge per successful scrape, with different tiers based on complexity (static pages vs. JavaScript-heavy sites, auth-protected content, etc.). Businesses would pay premium for reliability and not having to maintain their own scraping infrastructure.\n\n\n\nGood luck with the stress test - you're validating something people actually want to pay for!",
          "score": 1,
          "created_utc": "2026-01-15 12:38:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzpvoiu",
              "author": "RevolutionaryRip4091",
              "text": "Excellent analysis! I completely agree about the SaaS potential here. What strikes me most is how diverse the scraping needs are in this thread - from sports memorabilia pricing to medical wholesaler data to restaurant reviews. This validates that there's no one-size-fits-all solution yet.\n\n\n\nThe real challenge isn't just the scraping itself, but maintaining reliability as websites constantly change their structures. A truly valuable product would need to:\n\n1) Auto-adapt when sites update their HTML/CSS\n\n2) Handle anti-scraping measures gracefully\n\n3) Provide data quality validation\n\n\n\nThe tiered pricing model you mentioned makes perfect sense - charge based on complexity and volume. I'd add a subscription tier for recurring scrapes (e.g., daily price monitoring) since many businesses need ongoing data rather than one-time pulls.\n\n\n\nThe market opportunity is massive. Every company doing market research, competitor analysis, or lead gen could benefit from this. The key is making it so easy that non-technical people can use it without writing code.",
              "score": 1,
              "created_utc": "2026-01-15 12:42:47",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzqc86t",
          "author": "Glad-Writer3893",
          "text": "I would like to know the email/numbers of students preparing for jee entrance exam.",
          "score": 1,
          "created_utc": "2026-01-15 14:17:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzqsi3n",
          "author": "pikpakdigital",
          "text": "Scrape WooCommerce sites in Australia or with com.au domain",
          "score": 1,
          "created_utc": "2026-01-15 15:37:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzrndv0",
              "author": "rexis_nobilis_",
              "text": "What are you looking for specifically?",
              "score": 1,
              "created_utc": "2026-01-15 17:56:13",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzvo9fk",
                  "author": "pikpakdigital",
                  "text": "WooCommerce sites in Australia ideally selling cosmetics & nutritional products",
                  "score": 1,
                  "created_utc": "2026-01-16 07:00:52",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzrypb5",
          "author": "DV_Studio_Dev",
          "text": "Scrape publicly available data on the top 50 mobile dice games\n(name, publisher, platform, rough revenue range if available, last update).\nOutput as CSV.",
          "score": 1,
          "created_utc": "2026-01-15 18:46:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzs7pnd",
              "author": "rexis_nobilis_",
              "text": "Challenge accepted! Send me a DM, I think I found it",
              "score": 1,
              "created_utc": "2026-01-15 19:26:54",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzsozw2",
          "author": "wetfart_3750",
          "text": "I accept the challenge, and I'll pay you 20 if you can. Show me a script that gets the prices of grocery on coop.ch",
          "score": 1,
          "created_utc": "2026-01-15 20:46:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzt0es7",
              "author": "rexis_nobilis_",
              "text": "You might owe me a subscription! Reach out to me and DM the results :D",
              "score": 1,
              "created_utc": "2026-01-15 21:39:37",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzwokxs",
                  "author": "wetfart_3750",
                  "text": "I did but you did not reply.. how do you want to send me my 2$?",
                  "score": 1,
                  "created_utc": "2026-01-16 12:15:41",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzup1q9",
          "author": "Salmercker69",
          "text": "How about scraping all Information that deals with medical. Mainly for use to train an ai model on the medical field. everything about the field. I got more too.",
          "score": 1,
          "created_utc": "2026-01-16 03:01:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzz22ww",
              "author": "rexis_nobilis_",
              "text": "Tell me what you want! What medical data do you want? Remember, nothing behind auth for now. If you got more, tell me as well",
              "score": 2,
              "created_utc": "2026-01-16 19:08:58",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o012d0u",
          "author": "Elegant_Pie_8204",
          "text": "[DigiKey.com](http://DigiKey.com) \\-- can you scrap pdf datasheets of top 100 most popular components",
          "score": 1,
          "created_utc": "2026-01-17 01:17:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o03nfjj",
              "author": "rexis_nobilis_",
              "text": "Could you elaborate? The website you gave me has a lot of things",
              "score": 1,
              "created_utc": "2026-01-17 13:25:15",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0deodv",
          "author": "KennethSweet",
          "text": "I need contact info for research contacts in mid to high level colleges in computer science or ai",
          "score": 1,
          "created_utc": "2026-01-18 22:37:45",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qgzz7e",
      "title": "Your fundraising announcement probably did nothing for your business",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qgzz7e/your_fundraising_announcement_probably_did/",
      "author": "illeatmyletter",
      "created_utc": "2026-01-19 09:46:40",
      "score": 15,
      "num_comments": 4,
      "upvote_ratio": 0.9,
      "text": "I've watched dozens of founders announce their fundraise over the past year. Most of them follow the same playbook: write a LinkedIn post, maybe a Twitter thread, attach some founder headshots, thank their investors, and call it a day.\n\nThey get 50 likes. Their investors comment. A few friends reshare. And then it's gone.\n\nMeanwhile, a handful of founders treat their fundraise like a marketing moment and the difference in outcomes is wild.\n\nWhy does this even matter?\n\nHere's what most founders don't realize: a fundraising announcement isn't just \"news.\" It's one of the only moments where you have a legitimate reason to be loud. You have something to say. People expect you to share it. And if you do it right, you're not just announcing money. You're doing three things at once:\n\n1. Building credibility. When your announcement gets traction, future investors see momentum. It makes the next round easier. The halo effect is real.\n2. Driving signups. A viral fundraising moment doesn't just impress VCs. It brings in users who were on the fence. People want to be part of something that's clearly working.\n3. Creating leverage. When everyone's talking about you, recruiting gets easier. Partnerships open up. Press reaches out. You're suddenly on people's radar.\n\nBest example I've seen: Arlan Rakhmetzhanov dropped a cinematic video recreating that famous scene from The Social Network. It hit 2-3 million views across LinkedIn and X. Investors reached out. Other YC founders started talking about him.\n\nThe money matters. But the attention you get for free might matter more.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1qgzz7e/your_fundraising_announcement_probably_did/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o0gslg9",
          "author": "Desperate-Self-4800",
          "text": "We used our first investment to launch or \"founding team hiring\" rather than push that we \"just got money\". We barely mentioned the raise, though it was obvious we had closed it. And other investors read between the lines and pinged us which generated some momentum - customers also commented because they resonated with the growth of the team. Getting funding was necessary but not sufficient to be a good business so we treat it as such - an enabler for the actual work we want to do as a company.",
          "score": 2,
          "created_utc": "2026-01-19 12:36:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0mz0cc",
          "author": "GeneralNetwork1318",
          "text": "Great take. Represent Studio really understood the assignment with Arlan’s video. It didn’t feel like a fundraising announcement at all. No surprise it blew up so much.",
          "score": 2,
          "created_utc": "2026-01-20 09:10:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0jl8p0",
          "author": "dennisthetennis404",
          "text": "Yeah most people just announce the money, the smart ones treat it like they're launching something people actually care about.",
          "score": 1,
          "created_utc": "2026-01-19 20:44:54",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qgbeyp",
      "title": "What are you building? Promote it here",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qgbeyp/what_are_you_building_promote_it_here/",
      "author": "allen18walker",
      "created_utc": "2026-01-18 15:27:14",
      "score": 13,
      "num_comments": 38,
      "upvote_ratio": 0.9,
      "text": "We're offering one free viral Video for startups that want to test demand and get visibility.\n\nEvery startup can get 1 free viral Video made by our editor team. It features your product or business and is posted to our socials. There's no cost, and it usually takes about 7 days to receive and approve the video. Limit is one free video per startup, and nothing goes live without your approval.\n\nYou can use it to promote waitlists, MVP apps, pre orders, mature products, discounts, coupons, or even follow for follow.\n\nAll you need to do is tell us about your startup. You'll get an email letting you know if you're approved. We approve 95% of applications that are completed from start to finish.\n\nHere's the link with full details and access: https://zoomgtm.fillout.com/catalog-free-tiktok?sid=IsiahVA\n\nInside the link, there are also short Playbook videos that break down how we think about traction and distribution, so even if you just want to learn, it's useful.",
      "is_original_content": false,
      "link_flair_text": "services",
      "permalink": "https://reddit.com/r/startup/comments/1qgbeyp/what_are_you_building_promote_it_here/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o0bwix0",
          "author": "ThenBell4509",
          "text": "I’m building Doggmo, a lightweight web app where you upload or take a photo of a dog and get a simple interpretation of visible body language cues like ears, tail, posture, and eye contact.\n\nIt’s free, works with or without an account, and is intentionally framed as reflective guidance rather than training or medical advice. Still early and mainly validating whether it’s genuinely useful for dog owner\n\nhttps://doggmo.com/",
          "score": 3,
          "created_utc": "2026-01-18 18:12:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0bjzxb",
          "author": "seasonh5",
          "text": "Building a platform where users can view their product through the app dashboard, all texts highlighted with their translation id (eg homepage.heading). Click to edit. Live AI translation and it analyzes your product texts to match certain settings you provide (tone, glossary, product voice etc)",
          "score": 2,
          "created_utc": "2026-01-18 17:13:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0cnl3z",
          "author": "OkResort8287",
          "text": "1. [www.kipasastore.com](http://www.kipasastore.com/) \\- an all in 1 global store stocking up recently rolled put with updates pending\n2. [https://maasimcreatives.com/](https://maasimcreatives.com/) \\- a kids creative corner kids books for your kids",
          "score": 1,
          "created_utc": "2026-01-18 20:20:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0cx6jc",
          "author": "Reasonable-Walrus-74",
          "text": "\"Ciao a tutti. Ho creato un nuovo sito che si chiama [Resonance](https://id-preview--98e05a99-5535-423d-9d25-e1fdbcc2dda7.lovable.app/?__lovable_token=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJ1c2VyX2lkIjoiTWszV2Y3dW5acE1MdmdYNm1WQmZSZ1JpSXExMiIsInByb2plY3RfaWQiOiI5OGUwNWE5OS01NTM1LTQyM2QtOWQyNS1lMWZkYmNjMmRkYTciLCJub25jZSI6IjBiZDIxZWMwZjYwNmNiMjM5YzhiYTQyNWJjMWY4ZGI0IiwiaXNzIjoibG92YWJsZS1hcGkiLCJzdWIiOiI5OGUwNWE5OS01NTM1LTQyM2QtOWQyNS1lMWZkYmNjMmRkYTciLCJhdWQiOlsibG92YWJsZS1hcHAiXSwiZXhwIjoxNzY5Mzc1MzA3LCJuYmYiOjE3Njg3NzA1MDcsImlhdCI6MTc2ODc3MDUwN30.9zvM__SPODgZ2BzCqjbF0Aggt_1vd_6PoC5lCs9fCFw) . L'idea è molto semplice: è un punto di incontro per chi fa musica. Sapete quanto è difficile trovare qualcuno con cui ci sia il giusto feeling per scrivere canzoni o suonare insieme? Ecco, Resonance risolve questo problema. Ti iscrivi, dici cosa suoni e cosa ti piace, e il sito ti mette in contatto con le persone più adatte a te per collaborare. È uno strumento pratico per passare dal \"cercare\" al \"suonare\". Dateci un'occhiata.\"",
          "score": 1,
          "created_utc": "2026-01-18 21:09:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0czull",
          "author": "Optimal_Joke5930",
          "text": "very sus",
          "score": 1,
          "created_utc": "2026-01-18 21:25:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0d7r0j",
          "author": "Zoopexz",
          "text": "www.reindar.com - una “boutique” de ingeniería para industrias que trabajan con materiales difíciles y automatismos industriales con concepto de industria 4.0",
          "score": 1,
          "created_utc": "2026-01-18 22:05:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0das45",
          "author": "IndividualAir3353",
          "text": "I’m building a few\nProjects that are ready for users\n\nhttps://bittorrented.com a torrent-first\nStreaming platform\n\nhttp://marksyncr.com a free bookmarks synchronizer web extension for chrome safari and Firefox based browsers\n\nhttp://defpromo.com a zero-cloud self promotion web extension for all browsers  helps automate commenting on social media posts to promote your product  api keys required  \n\nhttps://giv1.com Publish Newsletters & Podcasts. The complete platform for content creators. Publish beautiful newsletters and podcasts\n\nhttp://summaryforge.com  Turn long readings into ready-to-study notes and quizzes. Perfect for students cramming before exams.\n\nhttp://coinpayportal.com a non custodial crypto payment gateway   Easy to integrate similar to stripe with web hooks and manage multiple businesses  \n\nhttp://qrypt.chat a free quantum resistant chat application \n\nhttp://disrupthire.com ai assisted engineer consulting services \n\nhttp://saasrow.com link directory for saas and ai\n\nhttp://ugig.net Connect with skilled engineers and workers who leverage AI tools to deliver exceptional results. Free to browse, free to apply.\n\nhttp://cryptoshot.space an ethereum jackpot game just connect your wallet and take a shot at the jackpot contract is open source \n\nhttps://postammo.com a viral content idea generator for social media posters. Includes native mobile, PWA and web extension apps.\n\n\n☎️ Hire me: +1 (408) 656-2473 Anthony",
          "score": 1,
          "created_utc": "2026-01-18 22:19:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0dbc1r",
          "author": "Prestigious_Tea6110",
          "text": "This is awesome!",
          "score": 1,
          "created_utc": "2026-01-18 22:21:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0dg7mo",
          "author": "Few-Invite-9735",
          "text": "AI matching for business cofounders and business partners  \n[https://cofounding.me](https://cofounding.me/)",
          "score": 1,
          "created_utc": "2026-01-18 22:44:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ef3gc",
          "author": "InformationFit4143",
          "text": "AI to verify if visual creative gets the right attention. Predicts viewer visual and emotional attention http://app.myralabs.ai",
          "score": 1,
          "created_utc": "2026-01-19 01:49:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0emt2v",
          "author": "Beneficial_Ad1805",
          "text": "I’m working on Unibox ([https://unibox.today](https://unibox.today/)) and I just opened up the public waitlist for the beta.\n\nThe core reason I built this is \"search fatigue.\" I’d remember a conversation about a specific budget or a bug, but I couldn't remember if it happened in a Slack DM, a Telegram group, or an email thread. I’d spend 10 minutes jumping between apps just to find one sentence.\n\nI wanted a way to treat all my communications as one searchable database.\n\nYou can join the waitlist here: [https://unibox.today](https://unibox.today/)\n\nWould love to hear your thoughts or any specific integrations that would make your life easier.",
          "score": 1,
          "created_utc": "2026-01-19 02:31:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0f3xec",
          "author": "amacg",
          "text": "Built a community where makers can share what they’re building and get fair visibility. Here's the link: [https://trylaunch.ai](https://trylaunch.ai/)",
          "score": 1,
          "created_utc": "2026-01-19 04:09:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0f6vyf",
          "author": "Flimsy_Bike7598",
          "text": "nice",
          "score": 1,
          "created_utc": "2026-01-19 04:29:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0fss8l",
          "author": "sparroow4",
          "text": "Building free online Web tools for pdf, image, finance, seo, developer, etc. \n\nBrand Name : Zlet Ai\n\nLink: [Zlet Ai](https://zletai.com)",
          "score": 1,
          "created_utc": "2026-01-19 07:17:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0g4mba",
          "author": "jonathanbrnd",
          "text": "DigiStorms is an AI-powered tool that helps SaaS companies create full onboarding and rentention email sequences in minutes.\n\nIt replaces slow, manual work with fast, optimized emails tailored to every stage of the user journey.\n\n[https://digistorms.ai/](https://digistorms.ai/)",
          "score": 1,
          "created_utc": "2026-01-19 09:05:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0g56kz",
          "author": "Kejbs",
          "text": "[Huddlekit](https://huddlekit.com) — Collect visual feedback on websites, images, PDFs, and videos all in one place",
          "score": 1,
          "created_utc": "2026-01-19 09:11:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0g66ft",
          "author": "Several_Explorer1375",
          "text": "https://getfree.app a place where users can get apps for free and developers can get early users",
          "score": 1,
          "created_utc": "2026-01-19 09:20:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0hauz9",
          "author": "armandinho_builder",
          "text": "An app for personalized daily briefings",
          "score": 1,
          "created_utc": "2026-01-19 14:26:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0hs39r",
          "author": "Maleficent_Carrot_43",
          "text": "BetterMind is a mental health app designed to help people manage anxiety, stress, and emotional overload in a practical, judgment-free way. It combines guided tools, mood tracking, grounding exercises, and intelligent insights to help users understand their mental patterns and build healthier habits over time. Built to be accessible anywhere, BetterMind works seamlessly across devices with no clutter. It is not therapy replacement fluff or toxic positivity. It is a calm, structured space to slow your mind down, regain control, and make measurable progress toward better mental wellbeing.\n\n[BetterMind](https://betteru.app)",
          "score": 1,
          "created_utc": "2026-01-19 15:50:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0jbpqk",
          "author": "missEves",
          "text": "[playmix](https://playmix.ai/animate) \\- create animated game sprites w/ ai 🏃‍♀️",
          "score": 1,
          "created_utc": "2026-01-19 20:00:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0klwk7",
          "author": "Florencion",
          "text": "[Datvil](https://www.datvil.com) - a dating app, 24 hours automatching, 5 questions rounds - all to help you find partners faster than just endless swiping",
          "score": 1,
          "created_utc": "2026-01-19 23:49:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0lwmas",
          "author": "Accurate_Maximum_974",
          "text": "Just build a shopify app store:\n\n\"Guardy: Fraud Shield\"  \n[https://apps.shopify.com/guardy-fraud-shield?search\\_id=3207a1db-5824-4ab3-955f-0db52c781baa&surface\\_detail=guardy&surface\\_inter\\_position=1&surface\\_intra\\_position=1&surface\\_type=search](https://apps.shopify.com/guardy-fraud-shield?search_id=3207a1db-5824-4ab3-955f-0db52c781baa&surface_detail=guardy&surface_inter_position=1&surface_intra_position=1&surface_type=search)\n\nProblem: \n\nCash-on-delivery Fraud, Fake orders for chargebacks\n\n  \nSolution:\n\nPhone, mail address, address etc. validation for each order and more.",
          "score": 1,
          "created_utc": "2026-01-20 04:06:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0mc96l",
          "author": "Ogretribe",
          "text": "https://unfairgaps.com\n\nThe Market Intelligence Database of Financial Bleeds.\n\nCompanies lose billions in regulatory fines and operational waste daily. We track exactly where the money is lost, so you can build the business that saves it.",
          "score": 1,
          "created_utc": "2026-01-20 05:51:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0mhwa4",
          "author": "BedNo9916",
          "text": "Cool offer—free viral vids are a smart way to gauge startup traction without upfront spend.  \n  \nTips: Validate ideas with quick user surveys first, document your processes to prevent single-point failures, automate routine knowledge shares via simple tools, and analyze video engagement for pivot insights.  \n  \nOptions like Sensay can help preserve that expertise affordably.  \n  \nWhat's the video style like?",
          "score": 1,
          "created_utc": "2026-01-20 06:36:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0n9xoh",
          "author": "Genstellar_ai",
          "text": "This is pretty cool, honestly.\n\nWe’re building **Genstellar**, and one thing I’ve realized over time is that even when the product is solid, it’s really hard to explain *why it’s different* in text alone. Most people won’t read long explanations, but they’ll watch a short video if it clicks quickly.\n\nI’m curious how hands-on founders usually are in shaping the video itself. Is it more about clearly showing the product in action, or telling the story behind why it exists? I’m also wondering whether you’ve seen this work better for very early MVPs versus products that are already a bit more polished.\n\nEven if we don’t end up applying, the playbook videos sound genuinely useful. Distribution and demand testing are still the hardest parts after shipping.\n\nNice initiative overall - lowering the cost of experimenting like this is really helpful for early-stage founders.",
          "score": 1,
          "created_utc": "2026-01-20 10:51:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0qe032",
          "author": "kapenzi",
          "text": "Tired of juggling a million tools that don't actually help? 😅\nThe Stewards Bundle is 36 resources ($1,600 value) to help you work smarter, not harder. Free this week.\nLive AI expert sessions included. No fluff, just what works.\nGrab it here 👇\nhttps://www.skool.com/stewards/about?ref=c0f5bea0c8484de1943c398817ad3153",
          "score": 1,
          "created_utc": "2026-01-20 20:38:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0bqprj",
          "author": "Efficient_Let216",
          "text": "We spend so much of our lives on autopilot- chasing what we think we want, without ever truly understanding ourselves.\n\nWe’re born with unique gifts, deep emotional needs, and hidden patterns. We also carry shadows and wounds that quietly shape our choices. When we don’t see them, they run our lives.\n\nWe choose careers that drain us.\nWe fall for people who can’t meet us.\nWe repeat the same cycles- wondering why.\n\nBut what if the answers were already within you?\n\nWhen you understand your strengths, your needs, and your shadows, you stop forcing what isn’t meant for you. You choose with clarity, intention, and self-respect.\n\nCome home to yourself first.\nThen find those who truly align because not everyone is meant for you, and that’s okay.\n\nThis is where self-awareness begins.\nThis is where everything changes.\n\nhttps://zelo.chat",
          "score": 0,
          "created_utc": "2026-01-18 17:45:55",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qdz5d1",
      "title": "Your first paying user How did that moment feel",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qdz5d1/your_first_paying_user_how_did_that_moment_feel/",
      "author": "HxCxAxR",
      "created_utc": "2026-01-15 23:14:21",
      "score": 10,
      "num_comments": 3,
      "upvote_ratio": 0.92,
      "text": "Our first subscription came faster than we expected and at a price point we didn’t think would convert that early. It was late at night and I had to message our dev to ask if he was running tests.  \nTurned out it was a real user who upgraded before their free trial was over. No obligation no card on file. They even reached out right away with a simple onboarding question which made it obvious they genuinely wanted to use the product.  \nThe feeling was unreal and the energy the next day in the team was huge.  \nHow did your first paying customer hit you Was it emotional surprising or just a calm mileston",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1qdz5d1/your_first_paying_user_how_did_that_moment_feel/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "nzw47fg",
          "author": "Notorious_Insanity",
          "text": "felt like all those years in compsci finally paid off",
          "score": 2,
          "created_utc": "2026-01-16 09:24:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzu3nss",
          "author": "Severe_Promise717",
          "text": "wasn’t even excited tbh  \njust relieved\n\nwhat helped was deciding *exactly* what a “win” looked like for day 1 users  \n1 action  \n1 feeling  \n1 clear next step\n\ntweaked onboarding till 80% hit all 3 in under 10 min\n\nmost clarity i’ve ever had building  \nstarted using that same “3-point proof” for everything - even in how i plan my day  \nthere’s a simple way to build it into your own workflow [here](https://NoFluffWisdom.com/Subscribe)\n\nkeep the highs boring",
          "score": 1,
          "created_utc": "2026-01-16 01:02:11",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qhvwcs",
      "title": "How do you actually find the first user who's willing to try your product and talk to you?( I will not promote)",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qhvwcs/how_do_you_actually_find_the_first_user_whos/",
      "author": "Finaler0795",
      "created_utc": "2026-01-20 08:46:33",
      "score": 10,
      "num_comments": 39,
      "upvote_ratio": 0.82,
      "text": "I’m not frustrated because people hate my product, I’m frustrated because no one is willing to actually spend a few minutes using it and give honest feedback.\n\nOver the past few days, I’ve been actively trying to validate what I built:\n\n* Posting on X\n* Launching on Product Hunt\n* DMing people who *might* have a need (indie hackers, founders, even some investors)\n* Offering free pro access and clearly saying I’d iterate quickly based on their feedback\n\nStill, almost no one was willing to truly try it.\n\nSince I’m building a form tool, I created a survey asking potential beta users about their use cases and needs, and posted it to communities like SurveyExchange and SurveySwap.\n\nWhat I got instead:\n\n* Generic compliments with no substance\n* Very few real clicks\n* Clearly fake emails\n* Zero people who actually cared about the problem\n\nOn X, direct outreach hasn’t been much better either, mostly polite replies, or complete silence.\n\nSo now I’m genuinely asking:\n\nWhen you have no brand, no audience, and no social leverage,\n\n**where do you actually find your first user who’s willing to communicate with you**?\n\nIf you’ve been through this stage,\n\n**what channels or approaches actually worked for you**?\n\nLooking for real, experience-based answers 🙏Thanks for your time!",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1qhvwcs/how_do_you_actually_find_the_first_user_whos/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o0n0yp1",
          "author": "jonathanbrnd",
          "text": "Building a solid audience on X is a great way for that since there's a lot of early adopters there. The bigger your audience the more people will trust you and look at what you're building. If your site is good then it should naturally drive them to try your product. \n\nSo I'd recommend focusing on building a big following on X first and then the rest will follow.",
          "score": 16,
          "created_utc": "2026-01-20 09:28:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0n28le",
              "author": "Finaler0795",
              "text": "Thanks for the suggestion! My co-founder already has 10k followers on X, but we still struggle to find true seed users, most people just take a quick look and move on. It still feels hard to find people who have a real need and are willing to truly try.",
              "score": 2,
              "created_utc": "2026-01-20 09:40:49",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0nmfnf",
                  "author": "GateInevitable841",
                  "text": "Firstly you need to check where is your actual audience is active, then give your Beta users some extra add-ons or perks for using your platform as an early adopters. Also create quick guide videos to educate your users. Unless you add value or provide them a solution for their pain points they are not gonna use it. All the best.",
                  "score": 3,
                  "created_utc": "2026-01-20 12:30:00",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0nua0q",
          "author": "PersonOfInterest007",
          "text": "Depends on the product. If it’s B2B, try to look up email addresses for a decision maker at a potential customer and send a personalized email. We have a product for use by very small businesses, and my partner just pounded the pavement walking into stores and talking to the manager or owner.\n\nIf it’s B2C, try joining a local Facebook group or meetup.\n\nAnd, again depending on your product, you really ideally want to get them to try the product live while you watch them use it to figure out what does and doesn’t work, whether they just get confused or can’t figure out what to do next.\n\nBasically, if broadcasting the existence of your product doesn’t bring people to you, go hunt them down. In a good way. :)",
          "score": 5,
          "created_utc": "2026-01-20 13:20:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0o0guo",
              "author": "Finaler0795",
              "text": "Thanks so much, this is super practical advice.",
              "score": 2,
              "created_utc": "2026-01-20 13:55:13",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0o15qu",
                  "author": "PersonOfInterest007",
                  "text": "You’re welcome.\n\nThere’s a lot of good free information on startups at Y combinator’s “Startup school.” And here’s one of their videos on getting the first customers: https://youtu.be/0kARDVL2nZg?si=bQUN76qoDTc6GhaN\n\nhttps://www.startupschool.org/",
                  "score": 3,
                  "created_utc": "2026-01-20 13:58:56",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0nh18g",
          "author": "Pristine_State_8542",
          "text": "\"no one is willing to actually spend a few minutes using it\"  \nCould it be that they do not consider the problem you solve, to actually be a problem? It might not be a valid pain point for that audience. Try to find a narrower segment, or more tailored approach to your outreach.",
          "score": 3,
          "created_utc": "2026-01-20 11:50:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0nh89g",
              "author": "Finaler0795",
              "text": "Thanks!",
              "score": 1,
              "created_utc": "2026-01-20 11:51:57",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0mxy4y",
          "author": "afernanrefa",
          "text": "I think you shouldn't be pitching your product for people to try. \n\nWhat you ought to do is guesstimate who the buyer is and then talk to those people about their problems as it relates to the problem you're solving. Don't even talk about your product at this time.\n\nJust listen to them and then update your product to address their problems (if it needs updating). \n\nThen reach out to them with your product and explain to them how it solves their problem.\n\nPeople are much more responsive to a \"hey, remember that issue you had? Here's the solution.\"\n\nvs. \"I built something random that might help you. Check it out.\"\n\nPeople will make 0 effort to do anything unless they're *sure* it will:\n\n- Save them a lot of time\n- Help them make more money than what they spend on your product\n- Provide them with worthwhile entertainment / connections \n- Teach them something they want to learn \n\nThat's it. Those are the main reasons people open their wallets. But they have to be sure it does. \n\n\"check this out\" does not equal \"certainly\".",
          "score": 2,
          "created_utc": "2026-01-20 08:59:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0n080d",
              "author": "Finaler0795",
              "text": "This is gold, thank you! It’s basically shifting from 'look at my cool thing' to 'tell me about your headache.' So build a connection first, deeply understand the real pain, and only pitch later. \n\nOne open question I’m still thinking about: in early outreach, does focusing on people with obvious pain tend to work better than talking more broadly with potential users?",
              "score": 1,
              "created_utc": "2026-01-20 09:21:37",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0on215",
                  "author": "afernanrefa",
                  "text": "If you can find those people, yes. For new products I often find people don't even know what their pain is. That's the hard part.. it's not obvious.\n\nIf they know what their pain is, they usually find a way to solve it with another product.",
                  "score": 1,
                  "created_utc": "2026-01-20 15:49:34",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0n30dq",
          "author": "mandevillelove",
          "text": "Target small communities with your problem, ask for quick feedback not just signups.",
          "score": 2,
          "created_utc": "2026-01-20 09:48:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0n43g3",
          "author": "Unlikely_Handle_4891",
          "text": "If you are not getting people's attention, isn't this an indication that you are solving the wrong problem?",
          "score": 2,
          "created_utc": "2026-01-20 09:58:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0n55i4",
              "author": "Finaler0795",
              "text": "That‘s fair. It's fairly general form tool right now, I’m trying to use early user feedback to narrow down the real problem to focus on.",
              "score": 1,
              "created_utc": "2026-01-20 10:08:13",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0n8p33",
          "author": "armandinho_builder",
          "text": "I find them on LinkedIn",
          "score": 2,
          "created_utc": "2026-01-20 10:40:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0n984s",
              "author": "Finaler0795",
              "text": "Thanks for sharing",
              "score": 1,
              "created_utc": "2026-01-20 10:45:07",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0nd5j8",
          "author": "Free_Ad3272",
          "text": "the problem is with building something of which you dont know who needs it.\n\nnormally you would start with a testable (!!) thesis about a need.\n\nfor example:\n\"engineering offices spend 20+% of their time compiling reports from different documents manuall.\"\n\nthat can be transformed to something an engineer can answer with yes or now:\n\"do you spend a significant amount of time compiling...\"\n\nembed that in a friendly email and send that to 100+ engineering offices. this yields 10 phonecalls. these people have a problem worth solving. \n\ndevelop the solution in close contact with these people and offer them 12 months free or something like that. \n\ncheers",
          "score": 2,
          "created_utc": "2026-01-20 11:19:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0o0xp8",
              "author": "Finaler0795",
              "text": "Thank you so much for sharing this, I really appreciate it! I'll definitely try this approach.",
              "score": 2,
              "created_utc": "2026-01-20 13:57:43",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0o58be",
                  "author": "Free_Ad3272",
                  "text": "welcome! happy to help! :)",
                  "score": 1,
                  "created_utc": "2026-01-20 14:20:55",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0ndemz",
          "author": "Adorable-Show92",
          "text": "I’ve been there, and it’s exhausting when you’re stuck in that loop of polite nods and \"looks great\" comments that don't lead to actual usage. In my experience, people rarely try a new tool for a general offer of free access; they usually only lean in if you find them in the exact moment they are complaining about a specific friction point in their current workflow. You might have better luck hanging out in niche forums or Discord channels where people are actively venting about their current form builder’s limitations.",
          "score": 2,
          "created_utc": "2026-01-20 11:21:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ndkx0",
          "author": "Exciting-Sir-1515",
          "text": "The people closest to you are your first users. \n\nNot necessarily the first paying customers but definite first users.",
          "score": 2,
          "created_utc": "2026-01-20 11:22:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0nh0yf",
          "author": "Ranketta",
          "text": "Find your buyer on linkedin, find their phone, call them and impress them with your deep industry knowledge so they will be willing to meet.  \nImpress them with your solution built on your industry knowledge.",
          "score": 2,
          "created_utc": "2026-01-20 11:50:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0nh9s1",
              "author": "Finaler0795",
              "text": "Got it, thx",
              "score": 1,
              "created_utc": "2026-01-20 11:52:16",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0ns4dg",
          "author": "OkDependent6809",
          "text": "Nobody wants to try your product because they don't know you and their inbox is full of other founders asking the same thing.\n\nWhat worked for me was going where users already hang out and just being helpful first. Not promoting, just participating in communities. Then when people recognize your name, they're more willing to try your thing.\n\nAlso \"try my product and give feedback\" is too vague. Better to ask \"can I watch you do X task for 15 minutes.\" People are way more likely to do a quick call than download something alone.\n\nFor B2B at my job, we sometimes use [CleverX](https://cleverx.com/) to find specific people when validating features. Costs money but faster than cold outreach.\n\nHard truth is your first 10 users probably come from warm connections or communities you're already active in. Cold outreach to strangers almost never works when you're nobody.",
          "score": 2,
          "created_utc": "2026-01-20 13:07:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0o5wnn",
          "author": "Tomahawk19-",
          "text": "You have actually received significant feedback by your own admission.",
          "score": 2,
          "created_utc": "2026-01-20 14:24:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0oeivo",
              "author": "Finaler0795",
              "text": "Got it, so even the lack of response can be a signal in itself. That’s a helpful way to look at it, thanks for pointing that out.",
              "score": 1,
              "created_utc": "2026-01-20 15:08:31",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0of7vy",
                  "author": "Tomahawk19-",
                  "text": "Precisely. You haven’t built enough value in a very crowded space if you ask me what the feedback says.",
                  "score": 2,
                  "created_utc": "2026-01-20 15:11:57",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0op66w",
          "author": "BetaOfficeUK",
          "text": "I’ve been through this exact phase, and honestly the hardest part wasn’t feedback -\n\nit was getting anyone to care enough to even try.\n\n\n\nWhat eventually worked for me wasn’t more channels, it was narrowing \\*who\\* I was talking to.\n\nBroad outreach (Product Hunt, X, generic communities) gave me noise, not signal.\n\nThe first people who actually talked were:\n\n– people already hacking together a workaround\n\n– or people who had complained publicly about the problem before\n\nInstead of asking “can you try my product?”, I started asking “how are you doing X right now?” and listened.Only after that did I mention what I was building.\n\nAlso, surveys were almost useless at that stage.The first real users came from 1:1 conversations, not forms.It’s slow, uncomfortable, and feels inefficient - but it was the only thing that led to real feedback for me.",
          "score": 2,
          "created_utc": "2026-01-20 15:59:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0mz1b1",
          "author": "Spiritual_Muscle_955",
          "text": "Please provide your website or product link so I can check it out.",
          "score": 1,
          "created_utc": "2026-01-20 09:10:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0n0kt1",
              "author": "Finaler0795",
              "text": "Thanks, but I’m not here to promote or buy growth services. I’m genuinely trying to learn how to find real users.",
              "score": 1,
              "created_utc": "2026-01-20 09:25:01",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0n1zje",
          "author": "Deep_Lifeguard_5039",
          "text": "Warm intros, then cold outreach via LinkedIn, email, cold phone calls\n\nB2B GTM is the most painful thing in the world tbh\n\nDM me if you want to compare notes, happy to share what we've found to work after a few months of 16 hours a day cold calling, etc.",
          "score": 1,
          "created_utc": "2026-01-20 09:38:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0nc84a",
          "author": "Free_Ad3272",
          "text": "im gonna try it",
          "score": 1,
          "created_utc": "2026-01-20 11:11:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0nqwtk",
          "author": "Small_Drawer_5372",
          "text": "At PingPrompt, we launched on Product Hunt with a 14-day free trial. We had a 70% conversion rate from the trial. A single offer of annual access on the landing page.\n\nIt was the best decision I made to get paying users who give real feedback. No audience.\n\nI had done a free closed beta before the launch and had 0 conversions to paying users.",
          "score": 1,
          "created_utc": "2026-01-20 12:59:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0o2dh8",
          "author": "commander-x-",
          "text": "What are u building?. I can check it out and give  u a feedback. Have some free time, lol. Let me know",
          "score": 1,
          "created_utc": "2026-01-20 14:05:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0oea7c",
              "author": "Finaler0795",
              "text": "Dashform, and if you Google it, it should come up. Happy to hear any feedback if you get a chance to check it out. Thanks!",
              "score": 1,
              "created_utc": "2026-01-20 15:07:19",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0p96pu",
                  "author": "commander-x-",
                  "text": "Mate, I can't find it, there are multiple results for that search, and many very similar, is it a .com or .net",
                  "score": 1,
                  "created_utc": "2026-01-20 17:32:05",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o0pa9p6",
                  "author": "commander-x-",
                  "text": "Is it the ai form creation tool?, if it is, just wow, u really need to get better at explaining your product.",
                  "score": 1,
                  "created_utc": "2026-01-20 17:37:07",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0pqpz7",
          "author": "AdTypical2226",
          "text": "I found your product with Google with the name you provided in the comments. \n\nTwo thoughts: \n\n1. Because the product is novel, it’s not immediately clear from the first viewport a) what it is b) who it’s for \n\n\nIf I were you I would:\n\nA) Try a different explanation on top  followed by the demo. And only after it’s clear what the product does and how it helps, I’d show the quickstart (“type a prompt…”). Also. When I was still trying to understand what the product does and I tried the prompt example and was then greeted with the signup, I was hugely annoyed. If I wasn’t trying to be helpful here, I would have quit then and there. \n\nB) create different landing pages for different use cases & audiences where the copy, demo, examples and the quickstart is tailored to each. Eg for Product builders who want feedback for their app. That way it’s easier for the target audience to “get it” without having to shift through long texts and different use cases to understand if it’s for them. \n\n\n2. When I finally found and tried the demo, it was/felt broken. \n\nA) There are delays of a ~second when the screen is blank or it’s just the static cursor. I later understood that it’s just AI “thinking” delay, but it doesn’t come off that way. I were you, I’d give it a loading state of three pulsating dots or something similar, to make it clear that we’re just waiting for a response here. \n\nB) I also couldn’t get past the second question. Just couldn’t click the “next” button even though I had entered text. I tried the Feedback and Survey option. \n\n…\n\nI didn’t sign up and I didn’t spend more time with the landing page. But I like the overall idea and I’m your potential target user (a product manager/solo-builder). Static feedback forms indeed lack depth while proper interviews take a lot of time, so this solution could be suitable in-the-middle alternative. \n\nGood luck!",
          "score": 1,
          "created_utc": "2026-01-20 18:51:23",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qeqaht",
      "title": "I should have my LLC before leasing a retail space... but I need a business address to form my LLC? (New York)",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qeqaht/i_should_have_my_llc_before_leasing_a_retail/",
      "author": "Excolo_Veritas",
      "created_utc": "2026-01-16 19:52:55",
      "score": 8,
      "num_comments": 6,
      "upvote_ratio": 1.0,
      "text": "I feel like I'm going crazy and a classic chicken and egg scenario. I want to run a video game retail business. Everything I've read says I should form my LLC before leasing a space, that makes sense to me, the contract should be with the LLC not me as an individual. But when I'm looking into registering my LLC it wants a business address? From my understanding I could theoretically register this to my home (since technically I am working from home as I setup the business) but there are privacy concerns with that, and what about the registered agent? Should that be my home address? I feel like I'm going in circles. Also... what is this weird requirement in NY to post in newspapers? I see some people talking about you need to post it in a paper for 6 weeks, but I didn't see that on new york states website, just that I had to post it in 2 separate local newspapers... which seems like such a weird requirement and I'm told NY is the only state that has this requirement. ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1qeqaht/i_should_have_my_llc_before_leasing_a_retail/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o018rg2",
          "author": "Flimsy_Bike7598",
          "text": "yes",
          "score": 1,
          "created_utc": "2026-01-17 01:57:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o03h7d8",
          "author": "glow_sapphire",
          "text": "I live in the UK so not sure if there is a US equivalent but we can pay for placeholder addresses through a business, who will then be the address used on the LLC, and they will forward all correspondence to you.",
          "score": 1,
          "created_utc": "2026-01-17 12:43:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0e5e5f",
          "author": "WinterSeveral2838",
          "text": "A registered agent is required by state law to receive legal document.\n\nYou can hire a registered agent, some of them allow you use their registered agent address as business address. \n\nNew York LLC indeed require newspaper publiction, and the fee varies from $300 to $1200 depending on the county. \n\nThe way to reduce the fee is in my post: [How much does it costs to start a LLC in New York](https://annualpicks.com/how-much-does-it-costs-to-start-a-llc-in-new-york/)?",
          "score": 1,
          "created_utc": "2026-01-19 00:55:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0jpdt5",
          "author": "zenbusinesscommunity",
          "text": "You can form the LLC using your home address initially and update it later once you have the lease. The business address doesn’t have to be permanent. New York also requires a registered agent with a NY address, which can be you or a service. The publication requirement is real and definitely one of NY's more frustrating but required quirks. You have to publish notice of formation in two newspapers for six consecutive weeks in the county listed as your office address.",
          "score": 1,
          "created_utc": "2026-01-19 21:04:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0r2zk8",
          "author": "BusinessAnywhereio",
          "text": "You’re not crazy, New York just makes this feel like a chicken and egg problem.\n\n**1) The “business address” on the NY LLC filing is basically a mailing address**  \nNY’s Articles of Organization ask for:\n\n* The **county** where the LLC’s office is located (not a street address)\n* An **address where NY can mail legal papers** after service is made on the Secretary of State\n\nThat mailing address becomes public. If you do not want your home on public record, you can use a **commercial address** (like a virtual mailbox/office service) as the mailing address. Just remember: a mailbox address is for mail, it is not the same thing as a registered agent.\n\n**2) Registered agent confusion**  \nIn NY, the **Secretary of State is automatically your agent for service of process**. You can optionally designate a separate registered agent, but you do not have to. Many people still hire a registered agent service for privacy and reliability.\n\n**3) Leasing before vs after**  \nForming the LLC first is ideal, but landlords often still require a **personal guaranty** for new businesses. If timing gets tight, you can sometimes sign personally and **assign/novate** the lease to the LLC once formed (with landlord approval).\n\n**4) The newspaper requirement is real**  \nNY generally requires publishing in **two newspapers for six consecutive weeks** (picked by the county clerk), then filing a **Certificate of Publication** within 120 days. It’s weird, expensive in some counties, and yes, it’s largely a NY-only headache.\n\nAffiliation: I work with BusinessAnywhere.io.",
          "score": 1,
          "created_utc": "2026-01-20 22:36:00",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qeshgc",
      "title": "What do you look for when hiring new grad SWEs?",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qeshgc/what_do_you_look_for_when_hiring_new_grad_swes/",
      "author": "Reasonable_Tea_9825",
      "created_utc": "2026-01-16 21:16:50",
      "score": 6,
      "num_comments": 6,
      "upvote_ratio": 0.88,
      "text": "Ive gotten to a lot of hr calls for startups but then got rejected. The reason I’m even landing those is cuz of a big tech internship. \n\nWhat specifically do founders/HMs look for beyond that for new grads? An active GitHub? A deployed personal project? \n\nWant to know so I can improve my chances further ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1qeshgc/what_do_you_look_for_when_hiring_new_grad_swes/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o00a531",
          "author": "Shichroron",
          "text": "Mindset. You want to actually do your best work and have more reasons to work for my specific company other than a paycheck \n\n- spend time in the company website and explain why you want to work for this company \n- line up references that had really good experience working with you and managing you\n- have some long term goal and explain how working for this company helps you get there",
          "score": 2,
          "created_utc": "2026-01-16 22:37:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o01y6xq",
          "author": "Jay_Builds_AI",
          "text": "Founders look for ownership, not polish. One real shipped project + clear tradeoffs you can explain beats 10 toy repos. GitHub matters only if it shows how you think and debug.",
          "score": 1,
          "created_utc": "2026-01-17 04:44:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o07ncm5",
          "author": "Apurv_Bansal_Zenskar",
          "text": "its gonna be a pretty big explanation:\n\nBig-tech internship gets you *screens*; offers usually hinge on signals that you can ship + communicate in messy, real-world constraints. For new grads, founders/HMs tend to look for:\n\n**1) Proof you can deliver end-to-end**\n\n* A *deployed* project with real users (even 20) beats a pretty GitHub.\n* Bonus points: metrics, feedback loop, iteration notes (“v1 → v2 because X users said Y”).\n\n**2) Ability to work with ambiguity**\n\n* Startups want people who can take a fuzzy problem and produce a crisp plan + tradeoffs.\n* In interviews, narrate decisions: “I chose A over B because time/latency/maintainability.”\n\n**3) Engineering fundamentals + ownership**\n\n* Debugging instincts, reading logs, handling edge cases, writing tests where it matters.\n* “I broke prod and fixed it fast” stories (with what you learned) are oddly persuasive.\n\n**4) Communication + speed**\n\n* Can you explain clearly, ask good questions, and unblock yourself without hand-holding?\n* Founders often hire the person who can *write* and *think out loud* cleanly.\n\n**5) Taste / product sense (especially early-stage)**\n\n* Not just “I built it,” but “I chose this UX because it reduces friction at step 2.”\n* Small improvements that show empathy for users.\n\n**GitHub vs deployed project?**\n\n* **Deployed personal project + short write-up** is usually the strongest.\n* GitHub helps if it shows **consistent commits**, clean README, tests, and non-trivial decisions—not just tutorial code.\n\n**If you want the highest ROI next 30 days**\n\n* Ship one small product, deploy it, add analytics, talk to 5 users, iterate twice.\n* Write a tight README: problem → approach → tradeoffs → results → what’s next.\n\nIf you paste the role types you’re targeting (backend, full-stack, infra, ML) + your current project portfolio, I’ll suggest 2–3 concrete project angles that map best to what startups actually hire for.",
          "score": 1,
          "created_utc": "2026-01-18 01:26:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0e2bhv",
          "author": "WinterSeveral2838",
          "text": "Do you have any project on GitHub which has many stars?",
          "score": 1,
          "created_utc": "2026-01-19 00:39:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0e2p6c",
              "author": "Reasonable_Tea_9825",
              "text": "No, is that seen positively? I.e. that it’s a live site, active users, sharing ideas, etc?",
              "score": 1,
              "created_utc": "2026-01-19 00:41:31",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qh5un1",
      "title": "Our startup Gemini/Google API credits expired - how did you manage the transition/costs?",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qh5un1/our_startup_geminigoogle_api_credits_expired_how/",
      "author": "reben002",
      "created_utc": "2026-01-19 14:38:32",
      "score": 5,
      "num_comments": 3,
      "upvote_ratio": 1.0,
      "text": "We're a fintech that received $100K in Google Cloud startup credits - we spend \\~$20-30k on Gemini API every month.\n\nCredits just expired and we're not yet break-even. The sudden cost increase is tough.\n\nHow did other startups handle this transition?\n\nLet me know if you have unused/extra Google credits :)",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1qh5un1/our_startup_geminigoogle_api_credits_expired_how/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o0hf1ry",
          "author": "monkey6",
          "text": "_classic_",
          "score": 3,
          "created_utc": "2026-01-19 14:47:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0hf55d",
              "author": "reben002",
              "text": "Classic and tricky my friend!",
              "score": 1,
              "created_utc": "2026-01-19 14:48:27",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0ieqno",
          "author": "sparrow932703",
          "text": "Not sure about cloud, but if ai/llms are troubling you, this might help  \nOrbit - (withorbit.io) \n\nDo check out and let me know if this helps. will jump over to get this integrated in your production account",
          "score": 1,
          "created_utc": "2026-01-19 17:32:15",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qhv2qu",
      "title": "How to find investor for my app startup",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qhv2qu/how_to_find_investor_for_my_app_startup/",
      "author": "Storyteller880",
      "created_utc": "2026-01-20 07:55:35",
      "score": 4,
      "num_comments": 11,
      "upvote_ratio": 1.0,
      "text": "I have a domain, which I registered a decade back. Now we want to build a news app startup around that. But we need funds to start, as we will need to subscribe to premium news wire services. But I am unsure how to find an investor. We can give equity in lieu. The startup will be sure shot profitable from 1st year itself and valuation will be 100x in some time. But I don't have an IIT/IIM degree which is why I am hesitant and unsure how to proceed. Suggestions are welcome ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1qhv2qu/how_to_find_investor_for_my_app_startup/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o0mwlwx",
          "author": "Vaibhav_codes",
          "text": "Focus on traction and a clear demo, not degrees. Angel networks, local incubators, and small friends/family checks are the easiest first steps to get investors interested.",
          "score": 2,
          "created_utc": "2026-01-20 08:47:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0msewi",
          "author": "Bad_ass_da",
          "text": "What kind of news? Is it your own feed ?",
          "score": 1,
          "created_utc": "2026-01-20 08:08:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0mssa5",
              "author": "Storyteller880",
              "text": "Every type of news. Kind of Inshorts having Reddit discussions. When you will scroll vertical, next news piece will come and when you will scroll horizontal, a discussion thread for that specific news will open up.",
              "score": 1,
              "created_utc": "2026-01-20 08:11:32",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0msup1",
                  "author": "Bad_ass_da",
                  "text": "Copyright?",
                  "score": 1,
                  "created_utc": "2026-01-20 08:12:09",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0n4mlg",
          "author": "AirlineUnlikely7018",
          "text": "DM me",
          "score": 1,
          "created_utc": "2026-01-20 10:03:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0n8ye2",
          "author": "IdeasInProcess",
          "text": "I saw this exact scenario with a fintech client. They thought they needed Bloomberg terminals and expensive APIs on day one. We helped them build a simple ingestion engine that scraped and summarised public financial news instead. It was 90% as good and cost $50 a month to run. By the time they actually needed the premium wires, they had enough revenue to pay for it themselves. Don't sell equity to pay a vendor bill.",
          "score": 1,
          "created_utc": "2026-01-20 10:42:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0nght4",
          "author": "regisdesmeules",
          "text": "For an early stage startup like you, look with startup incubators, accelerators an angel investor groups in your region for pre-seed funding. Prepare your pitch desk for funding purpose.",
          "score": 1,
          "created_utc": "2026-01-20 11:46:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0nx161",
          "author": "Radiant-Design-1002",
          "text": "I wouldn’t focus on finding investors that focus on building an MVP with AI you can vibe code as long as the one big feature works and you get to show your a-ha moment launch with that see how the market reacts to it once you have traction then you hunt for investors",
          "score": 1,
          "created_utc": "2026-01-20 13:36:22",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qfel2k",
      "title": "Any brick and mortar founders here?",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qfel2k/any_brick_and_mortar_founders_here/",
      "author": "cookieguggleman",
      "created_utc": "2026-01-17 14:28:14",
      "score": 3,
      "num_comments": 0,
      "upvote_ratio": 1.0,
      "text": "I love this sub, I find it super helpful. But it's almost completely tech. Are there any founders on here who have founded a brick and mortar company? I am building a hospitality startup, a heritage hotel brand and would love to hear some fundraising experience from others in the same space. ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1qfel2k/any_brick_and_mortar_founders_here/",
      "domain": "self.startup",
      "is_self": true,
      "comments": []
    },
    {
      "id": "1qf7t61",
      "title": "We’re live on Product Hunt today and we would love your support",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qf7t61/were_live_on_product_hunt_today_and_we_would_love/",
      "author": "lmntrixaceOG",
      "created_utc": "2026-01-17 08:20:36",
      "score": 3,
      "num_comments": 0,
      "upvote_ratio": 1.0,
      "text": "A week back I posted about The Kitchen Table on this subreddit. You folks showed a lot of love and had a ton of great feedback. \n\nThe Kitchen Table goes live on Product Hunt today.\n\nThis app started as a simple idea. A quiet place to write things out without performance without metrics and without pressure to be anything other than honest.\n\nIf you have used the app  \nIf you have written something you did not expect to come out  \nIf the idea of a calmer corner of the internet matters to you\n\nWe would really appreciate your support today.\n\nHere is the Product Hunt link:  \n[https://www.producthunt.com/products/the-kitchen-table?launch=the-kitchen-table](https://www.producthunt.com/products/the-kitchen-table?launch=the-kitchen-table)\n\nUpvoting helps a lot but even more helpful is feedback. What feels right. What feels off. What you wish existed.\n\nThank you for being here and for helping shape what this table becomes.\n\nPS: If you're yet to checkout the product, head over to [https://thekitchentable.site/](https://thekitchentable.site/)  \n(It's completely free and ad-less)",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1qf7t61/were_live_on_product_hunt_today_and_we_would_love/",
      "domain": "self.startup",
      "is_self": true,
      "comments": []
    },
    {
      "id": "1qdcr2m",
      "title": "How can I tell if I’m being used? How to establish clarity right off the bat?",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qdcr2m/how_can_i_tell_if_im_being_used_how_to_establish/",
      "author": "doboy26",
      "created_utc": "2026-01-15 07:02:56",
      "score": 3,
      "num_comments": 8,
      "upvote_ratio": 0.8,
      "text": "I previously reached out to a developer online about potentially building something for my industry (I am non technical). He’s been involved in multiple startups and knows ins/outs. I’ve never been involved in any. I just am familiar with my industry. I’m not an expert, but have a network of people who could potentially be clients.\n\nI guess he realized there’s potential in this idea after consulting with other friends of his and now he’s trying to constantly pick my brain, setting up calls just to extract information about the weak points I’m noticing, however we haven’t really done much more than that. The first time we ever spoke, he said we could possibly work together. But that was about it. Nothing concrete.\n\nWe’ve been on 3 calls and it’s mostly been just him extracting information. He knows that I know people but he seems to want to bring them into his personal network with me presenting them to him. This is where I’m starting to go “hmm”.\n\nI’m just curious. He might have good intentions and just wants to learn as much as he can, but I feel like I don’t want to commit any further to him unless there’s a clear direction on where we’re headed… and even if I would want to work with him. Other than our few calls, I’ve never met him. He mentioned possibly flying out to meet me depending on how things go.\n\nHow would you proceed?",
      "is_original_content": false,
      "link_flair_text": "knowledge",
      "permalink": "https://reddit.com/r/startup/comments/1qdcr2m/how_can_i_tell_if_im_being_used_how_to_establish/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "nzouvf4",
          "author": "TightBus",
          "text": "When you say you want to work together, do you mean signing a contract of some sort? or is it just words and vibes? cause nothing is stopping him from stealing your ideas right now. I would say trust your gut. You're feeling iffy and you haven't even started anything yet, it doesn't sound like it's gonna end well",
          "score": 2,
          "created_utc": "2026-01-15 07:18:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzov226",
          "author": "TimeKillsThem",
          "text": "I mean - technically, it’s your “business”. Make him an offer and formalize the relationship if you think yall are complimentary to each other (skills/experience aside, a solid layer of trust is required). Start with him as a contractor, then see how things evolve.\n\n\nWhile it is true that an idea alone has no value, a product by itself also carries little value (browse any startup oriented sub and you will see countless “my product is amazing but I have no customers” posts). \n\nYou both bring something to the table. 3 calls is enough to understand if something is feasible to at least start investing some time to develop an MVP/demo of sorts for you to test/show as a POC to your network.\n\nNow, if he isn’t willing to at least vibecode the very basic demo, I’m not sure the idea of actually starting a business it’s for him (big difference between working for a startup, and owning a startup)",
          "score": 1,
          "created_utc": "2026-01-15 07:19:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzqv1gq",
              "author": "doboy26",
              "text": "At what point do you establish ownership terms? Before the MVP? After? \n\nHes also admitted to me that he’s spoken with other people in my field for other opinions so not sure if he’s just probing me out",
              "score": 1,
              "created_utc": "2026-01-15 15:48:54",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzr0f5h",
                  "author": "TimeKillsThem",
                  "text": "I am quite naive, but Im not an idiot - Ill always assume the best, but prep for the worst.\n\nIn your situation, I would argue that he has had enough meetings (3+ with you and - as you just mentioned - several with other people in your field for their opinion). Thats a good degree of due diligence before committing. But now you need to demand that commitment.\n\nReality is that, to make such an illogical decision as to build your own business (you could live a much better quality life for much lower risk working for someone else), you must be comfortable making bets. \n\nIf, despite all the meetings etc, he is still not committed enough to give this a go, either he is not prone to risk enough (not ideal for a cofounder of a non-existing business given it will only be very risk-prone decisions from day 0 onwards) or he is digging as much info as possible to do something similar.\n\nEither way, he is not the guy for you.\n\nI would establish ownership terms prior to bringing someone else onboard. Registering a limited company (or equivalent in your region) is usually quite cheap (in the UK it is literally 12£ and you do it directly via the government's website). \n\nThen, you either hire as a contractor (strongly recommend - purely because yall need to \"get to know each other before getting married\") and then, if need be, discuss equity and allocate shares.\n\nThe real question is: are YOU ready to make this a bit more real, or are you happy just fantasizing about it? I wouldnt blame you if it was the latter.",
                  "score": 1,
                  "created_utc": "2026-01-15 16:13:05",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzpdwcs",
          "author": "IdeasInProcess",
          "text": "I am a technical founder and I will tell you the truth, Code is a commodity. Access to paying customers is the gold. He is trying to bypass the hardest part of a startup (sales) by using your reputation. You have all the leverage here. Tell him you are ready to formalise the equity split before sharing any more \"weak points\" or contacts. If he is serious about flying out, he will be serious about paper.",
          "score": 1,
          "created_utc": "2026-01-15 10:19:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzqup6i",
              "author": "doboy26",
              "text": "I’m not sure if it’s too early to formalize equity split or contracts? Nothing has been formed yet. It’s just been two dudes talking about weak points in an industry and trying to discover what the potential is. \n\nWhen it’s this early in the talks, what type of contract do you establish?",
              "score": 1,
              "created_utc": "2026-01-15 15:47:23",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzv7em4",
          "author": "Jay_Builds_AI",
          "text": "Three calls of 'brain picking' with no plan - red flag. Pause. Ask directly: roles, equity, next step. Real partners move from talk to action fast.",
          "score": 1,
          "created_utc": "2026-01-16 04:53:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0i47w7",
          "author": "TheAutoNaut-1610",
          "text": "The issue here isn’t whether he has good or bad intentions  it’s that you’re sharing *asymmetric value* without a shared decision boundary.\n\nRight now, you’re treating these conversations as reversible exploration, but the information + introductions you’re giving aren’t reversible once shared.\n\nA useful clarity check I’ve used: *What exactly becomes harder for me if this relationship ends tomorrow  and is that cost acknowledged by both sides?*\n\nIf that answer is fuzzy, it’s usually a signal to pause and define scope before continuing.",
          "score": 1,
          "created_utc": "2026-01-19 16:44:34",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qhsh99",
      "title": "A lesson I learned watching early-stage startups struggle: profit isn’t safety",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qhsh99/a_lesson_i_learned_watching_earlystage_startups/",
      "author": "sunmc_",
      "created_utc": "2026-01-20 05:28:40",
      "score": 3,
      "num_comments": 4,
      "upvote_ratio": 1.0,
      "text": "One pattern I’ve seen repeatedly with early-stage startups is this:  \neverything looks fine on paper, but founders still feel constant pressure.\n\nThe reason usually isn’t lack of sales — it’s **cash flow timing**.\n\nRevenue might be booked, but:\n\n* invoices take weeks to get paid\n* taxes and payroll are immediate\n* growth costs show up before returns\n\nThat disconnect creates stress even in “profitable” startups.\n\nThe mindset shift that helped many founders was moving from  \n“Are we profitable?” to  \n**“Can we comfortably operate for the next 60–90 days?”**\n\nA few habits that made a real difference:\n\n* weekly cash-in vs cash-out check\n* planning buffer before hiring or scaling\n* not treating receivables as available cash\n\nI work with a CPA firm (JTC CPAs), and this topic comes up constantly with growing businesses — especially those scaling faster than expected.\n\nWould love to hear from founders here:\n\n* What surprised you most about cash flow once you started growing?\n* Any systems that helped you avoid close calls?",
      "is_original_content": false,
      "link_flair_text": "business acumen",
      "permalink": "https://reddit.com/r/startup/comments/1qhsh99/a_lesson_i_learned_watching_earlystage_startups/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o0mog1r",
          "author": "Capital_Key_4276",
          "text": "good advice",
          "score": 1,
          "created_utc": "2026-01-20 07:32:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0nnwmq",
          "author": "IdeasInProcess",
          "text": "The manual follow-up on those invoices is what kills the efficiency. We saw this with our own books, we were wasting hours every week just emailing people to pay us. We eventually built an internal automation engine just to handle the emails. Once we removed the awkward human element from asking for money, our days sales outstanding dropped significantly. You have to automate the nagging or it doesn't happen.",
          "score": 1,
          "created_utc": "2026-01-20 12:40:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0rryof",
          "author": "IndustryADV",
          "text": "This hits a real nerve for a lot of growing teams.\n\n**The big surprise for many founders:**  \nProfit does not equal safety.\n\n* Money can be on paper but not in the bank.\n* Bills and payroll still come due on fixed dates.\n* Growth costs show up before growth revenue.\n\nThat timing gap is what creates stress, even when the business looks healthy.\n\n**Common cash flow mistakes people make early:**\n\n* Treating unpaid invoices like real cash\n* Hiring or scaling based on projected revenue\n* Forgetting about tax timing until it is urgent\n* Not tracking weekly inflow and outflow\n\n**Simple habits that help a lot:**\n\n* A weekly cash in vs cash out check\n* Keeping a small cash buffer before hiring\n* Planning expenses based only on money already received\n* Separating operating cash from tax money\n\n**The mindset shift that matters:**  \nInstead of asking  \n\"Are we profitable?\"  \nAsk  \n\"Can we comfortably run for the next 60 to 90 days with what is in the bank right now?\"\n\nMost close calls come from timing, not bad business models.  \nThe founders who stay calm through growth are usually the ones who plan for cash gaps before they happen.",
          "score": 1,
          "created_utc": "2026-01-21 00:50:33",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qhd1l3",
      "title": "Do loyalty programs actually make people come back, or is everyone just in it for the freebies and discounts?",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qhd1l3/do_loyalty_programs_actually_make_people_come/",
      "author": "Ashwinnie13",
      "created_utc": "2026-01-19 18:53:52",
      "score": 3,
      "num_comments": 12,
      "upvote_ratio": 1.0,
      "text": "I run a little coffee shop/bakery - been at it for four years now. We get plenty of new faces, and people are hyped about the food (reviews are great!), but then… radio silence. Getting folks to come back? That’s the struggle.\n\nWe’ve tried the usual - discounts, happy hour, the works. Sure, people show up for the deals, but as soon as the promos end, so do the visits. Basically, everyone’s just waiting for the next bargain.\n\nNow I’m hunting for a loyalty program that doesn’t feel super pushy or complicated. Been eyeing these QR-based apps (everyone’s glued to their phone anyway). Got me wondering - do points and rewards actually get people hooked, or is it just a fancier way to hand out coupons?\n\nBefore I jump in, I’d love to hear from folks who’ve tried this. Do loyalty programs actually build regulars, or do people just show up when there’s free stuff on the line?",
      "is_original_content": false,
      "link_flair_text": "business acumen",
      "permalink": "https://reddit.com/r/startup/comments/1qhd1l3/do_loyalty_programs_actually_make_people_come/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o0kel7t",
          "author": "Mysterious-Ad7547",
          "text": "Disclaimer I run a loyalty rewards app\n\nWe have found SMBs that use our software gather good data for marketing while the customer gets a little reward for their loyalty. It’s still early days for us but so far customers are enjoying their rewards and the merchants seem to be happy.",
          "score": 1,
          "created_utc": "2026-01-19 23:09:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0odpaf",
              "author": "Pristine_Battle_2636",
              "text": "What type of program do you run? the points tracking or the communication?",
              "score": 1,
              "created_utc": "2026-01-20 15:04:23",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0rat49",
                  "author": "Mysterious-Ad7547",
                  "text": "Our app does the rewards side and at the moment no marketing but that’s due by Q2 this year. Like I said it’s still early days bit there are so many features in the road map for us as we gain more customer.",
                  "score": 1,
                  "created_utc": "2026-01-20 23:17:00",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0odkh9",
          "author": "Pristine_Battle_2636",
          "text": "If it is easy and the offer is enticing people do like it. Apps are not it, but text messages.",
          "score": 1,
          "created_utc": "2026-01-20 15:03:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0px6nn",
              "author": "Ashwinnie13",
              "text": "Thanks for the answer!",
              "score": 1,
              "created_utc": "2026-01-20 19:20:24",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0oew78",
          "author": "Lizzi3McGuire",
          "text": "I was at Loyalty360 last year and saw a REALLY cool talk about loyalty programs from a company. Basically it has to be engaging and enticing. People don’t want to download an app unless they are getting something. Let me see if I can find a case study or the company or something. ",
          "score": 1,
          "created_utc": "2026-01-20 15:10:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0pxq9j",
              "author": "Ashwinnie13",
              "text": "Yeah, you're right. thank you",
              "score": 2,
              "created_utc": "2026-01-20 19:22:57",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0omifk",
          "author": "Pristine_Battle_2636",
          "text": "This got me thinking so I looked for some blogs and found this one: [https://www.blings.io/blog/personalization/can-loyalty-still-exist-rethinking-rewards-for-the-tiktok-generation/](https://www.blings.io/blog/personalization/can-loyalty-still-exist-rethinking-rewards-for-the-tiktok-generation/)",
          "score": 1,
          "created_utc": "2026-01-20 15:47:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0pxu79",
              "author": "Ashwinnie13",
              "text": "I'll read it, thanks!",
              "score": 1,
              "created_utc": "2026-01-20 19:23:28",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0r22lu",
          "author": "Big-Swan-8039",
          "text": "Hi ashwinne, I love rewards!  Why don't you find an influencer in your area or outside your area or someone who does reviews - diners, drive-ins and dives - and get them to your coffee shop. \n\n  \nWhat is your WOW factor? Why should people come to you? Be louder!!! \n\nCross market with other business in town.",
          "score": 1,
          "created_utc": "2026-01-20 22:31:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0jgbms",
          "author": "10XFProductions",
          "text": "well it really boils down into value , if ppl aren't seeing the value in it , then it's a waste of time both ways , or it could mean also that the neighborhood/ street isn't the place or new competitor is in town. \n\n\n\nBy the way we are offering a free one time service for our video productions , DM us for more info , see now that's kinda pushy ppl won't like that , but some would click it just to get the freebie. I hope that helps.\n\nBut seriously we are video productions company just starting new.",
          "score": 0,
          "created_utc": "2026-01-19 20:21:43",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}