{
  "metadata": {
    "last_updated": "2026-01-19 02:39:57",
    "time_filter": "week",
    "subreddit": "Startup_Ideas",
    "total_items": 20,
    "total_comments": 318,
    "file_size_bytes": 232503
  },
  "items": [
    {
      "id": "1qbyhmn",
      "title": "Bunch of my ideas which I never executed",
      "subreddit": "Startup_Ideas",
      "url": "https://www.reddit.com/r/Startup_Ideas/comments/1qbyhmn/bunch_of_my_ideas_which_i_never_executed/",
      "author": "DobraVibra",
      "created_utc": "2026-01-13 18:09:18",
      "score": 98,
      "num_comments": 64,
      "upvote_ratio": 0.91,
      "text": "\\* Church givings - an app that allows churches to gather givings online and then you take a percentage of that. You need to get priests on your side to promote that. Good for you because Churches are exempt from taxes\n\n\\* What would I do for a dollar/Would you do it for a dollar? - Fiverr like shit but more social. Imagine something like: I dare you to do this for X dollars.\n\n\\* You got a dollar? - basically begging people online to send you a dollar. Just like beggars on the street\n\n\\* Selling fog - literally selling fog in a jar\n\n\\* iEgg - selling regular egg that has Apple logo on it for 99$\n\n\\* Voting -  useful system that allows people to vote online instead of going to physical place\n\n\\* Messaging only with push notifications - messaging app that uses only push notifications to read and send messages. there is no other UI\n\n\\* But first let me take a selfie - an app that has no buttons, you are taking selfies only by using hand gestures\n\n\\* Don’t meet in person - dating app or some kind of network that you only meet people online\n\n\\* Stupid people repellent - A mace or some kind of spray that has “stupid people repellent” on it\n\n\\* Alien emoji - normal emojis but with double eyes like ::D ::) that is alien emoji\n\n\\* App where all followers, likes are fake - that is just ran by AI\n\n\\* Hangover - a place where only drunk photos are placed so you can watch them next morning\n\n\\* RentACock - Renting a dick on demand, but prostitution\n\n\\* Gay app with mandatory pic - because on most gay dating apps  there are no pics of people\n\n\\* Hate comment removal - system which removes hate comments from your social networks\n\n\\* OnlyHaters - OnlyFans but for haters\n\n\\* News excerpt summary - news website but it gives you summary of the news in 2-3 sentences\n\n\\* Bluetooth chat - chat that works through bluetooth only, but you need to be close to people\n\n\\* Social network where all is opposite. Like downvotes are good…\n\n\\* Real movie spoilers + movie reaction - YT channel where you actually spoil the movie, you actually say what is going on in the movie and spoil the end\n\n\\* Parfume that smells like cock or pussy - that is just urine I guess\n\n\\* Picture  book for adults - a picture book of cocks and pussies\n\n\\* Explain like I’m 5 - chatgpt explainer that explains things in simple terms\n\n\\* SatanMail - like santa mail, but these emails are from satan\n\n\\* Selling funny ringtones\n\n\\* Porn synchronisation - like cartoons but you sync porn clips to your language. That is content theft\n\n\\* You control my life - people telling me what to do and pay for it\n\n\\* Fake DJ - YT channel where you act like a DJ in some luxury home, but it’s all fake\n\n\\* Stay in touch - a messenger that sends messages to people you choose every couple of weeks so you actually stay in touch\n\n\\* Hard core sexting AI chat\n\n\\* AirBnB hourly - Ok it probably exists already and you might be wondering, who the fuck would rent room per hour? Well people who wants to have sex but don't have place of their own. Like strangers, gays, lovers and so on\n\n\\* Online girlfriend - of course it exists, but this time the focus would be on customers who for willing to pay, and then there are those anonymous girls would like to earn money",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Startup_Ideas/comments/1qbyhmn/bunch_of_my_ideas_which_i_never_executed/",
      "domain": "self.Startup_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "nze7j6f",
          "author": "Lordofthewhales",
          "text": "\"picture book for adults\" ... Well done OP you just invented a porno magazine",
          "score": 37,
          "created_utc": "2026-01-13 18:25:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzf934r",
              "author": "MrFireWarden",
              "text": "I think you just exposed yourself 😆\n\nBelieve it or not, there are coloring books for adults (that are not porn). Some find them to be a calming activity. I think OP was thinking more in that fashion.",
              "score": 4,
              "created_utc": "2026-01-13 21:18:03",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzfas5b",
                  "author": "Lordofthewhales",
                  "text": "I mean OP goes on to say it has \"pictures of cock and pussies\".... That my friend is a porno mag not an adult colouring book lol",
                  "score": 5,
                  "created_utc": "2026-01-13 21:25:49",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nzhcjde",
                  "author": "wastedsanitythefirst",
                  "text": "Yeah I made a coloring book using pictures i took of abandoned places and my mind immediately went to coloring book not porn as well",
                  "score": 1,
                  "created_utc": "2026-01-14 04:04:27",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nzfdl7v",
                  "author": "DobraVibra",
                  "text": "this",
                  "score": 1,
                  "created_utc": "2026-01-13 21:38:35",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            },
            {
              "id": "nzep2sw",
              "author": "DobraVibra",
              "text": "nop, not the same",
              "score": 2,
              "created_utc": "2026-01-13 19:44:26",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nze62fk",
          "author": "Gentlegee01",
          "text": "Some looks fun and doable fr. You might just pick one for the long term, like the Onlyhaters and some",
          "score": 11,
          "created_utc": "2026-01-13 18:19:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzf2itg",
          "author": "davincidudee",
          "text": "There are black mirror episodes of a couple of this ideas hahahaha",
          "score": 6,
          "created_utc": "2026-01-13 20:47:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzf4d9g",
          "author": "TheSuedeTiger",
          "text": "Can I invest in iEgg? It's a winner",
          "score": 7,
          "created_utc": "2026-01-13 20:55:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzeivwr",
          "author": "SuspiciousTicket8554",
          "text": "Perfume like cock & pussy 📌📌",
          "score": 6,
          "created_utc": "2026-01-13 19:16:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzfri0x",
          "author": "GC2099",
          "text": "Like Churches in Ireland n UK used to have signs outside church for decades... WE NEED A NEW ROOF.\n\nThe roof was fine n only the money was pouring in!!! 😆",
          "score": 6,
          "created_utc": "2026-01-13 22:44:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzgbjo4",
              "author": "VisionsofWonder",
              "text": "Tired of these faux churches and other religious institutions raking in all this money tax free and giving none of it to helping the poor, sick and the needy. All they do is horde it, wash it for associated politicians and use it for their own self interest. Never trust a church asking for money. If I had a church I would only ask my patrons to conduct a selfless act a week or give them leads as to where they could make a difference. And hell if I needed a roof, I’d educate a few homeless people, get them some training so that they could fix my roof and make a living by fixing other roofs in the neighborhood too. I’ve boycotted all churches. The pastors say the same bullshit and the worst ones promote MAGA Trump agenda and spew absolute hateful shit in the “house of good”. Absolute vile m’fers. The mega churches and their pastors need to be shut down and investigated.",
              "score": 1,
              "created_utc": "2026-01-14 00:31:43",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nze956t",
          "author": "AlexeyUniOne",
          "text": "now with AI shipping has sped up a lot, so some services you can genuinely build in a single evening using vibe coding :)",
          "score": 8,
          "created_utc": "2026-01-13 18:32:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzepsl7",
          "author": "ed523",
          "text": "Some of these would be great for satirical comedy shortforms",
          "score": 3,
          "created_utc": "2026-01-13 19:47:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzfa99a",
          "author": "kiwiinNY",
          "text": "Lol like a church would want to give you a %. \n\nThey looooove cash. Keep it off the books. So corrupt.",
          "score": 3,
          "created_utc": "2026-01-13 21:23:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzh7qe5",
              "author": "Hejsek10",
              "text": "If they do not need to pay taxes as op claims. What's the point?",
              "score": 2,
              "created_utc": "2026-01-14 03:34:34",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzfc8z7",
          "author": "AwesomeHabits",
          "text": "\"I dare you to do X for a dollar\" reminds me of nerve lol trashy movie with a similar premise",
          "score": 3,
          "created_utc": "2026-01-13 21:32:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzfxi84",
          "author": "theManOfManyTalents",
          "text": "Some of these ideas look promising",
          "score": 3,
          "created_utc": "2026-01-13 23:16:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzgxrpv",
          "author": "ioareddit",
          "text": "Are you a developer? Why not try implementing some of them.  You never know. There is always an audience for everything.   \nI think the bigger proplem today is no implementation though, it is marketing.  \nyou may have a great idea. You need to get people to use it.",
          "score": 3,
          "created_utc": "2026-01-14 02:36:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzhqhk2",
          "author": "blazephoenix28",
          "text": "More than half of these are silly weekend projects, interesting to get the creativity juices flowing nonetheless",
          "score": 3,
          "created_utc": "2026-01-14 05:43:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzeff49",
          "author": "Moming_Next",
          "text": "I wish I had so many ideas like you. Why don't you give a try? I got a way for you to test every of those ideas without having the hassle to run out of AI credits or just wasting your weekends building MVPs. If one of those ideas hits you can bootstrap it overnight with AI. Honestly now, AI is powerful enough to spit a MVP by itself.\nLet me send you a DM how you can try all those.",
          "score": 5,
          "created_utc": "2026-01-13 19:00:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzi2la7",
              "author": "Overall_Analyst_730",
              "text": "Hey there! Can you send me DM as well pelase? I have several ideas too, so I would like to know how to try them in a short time and check which is going to explode. If any...",
              "score": 2,
              "created_utc": "2026-01-14 07:25:25",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzer05s",
          "author": "super_trooper",
          "text": "Church giving is a pretty large industry with a few key players",
          "score": 2,
          "created_utc": "2026-01-13 19:53:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzetm7i",
          "author": "xasdfxx",
          "text": "the church one is widely implemented.  I met the owner of one of them and they're doing low 9 figures a year.",
          "score": 2,
          "created_utc": "2026-01-13 20:05:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzfaugj",
              "author": "SurfingFounder",
              "text": "Whats the name of his company?",
              "score": 2,
              "created_utc": "2026-01-13 21:26:07",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzffswl",
                  "author": "xasdfxx",
                  "text": "subsplash\n\nbut church-specific software is widely available.  tbh, I probably shouldn't have responded to this thread at all because it's so widely available that this thread is just... I dunno.  The #1 thing is extremely competitive.  :shrug:",
                  "score": 2,
                  "created_utc": "2026-01-13 21:48:42",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzhyp7a",
          "author": "dan_charles99",
          "text": "I work with people like you, And I will make this offer for one person in the thread who ticks my boxes.\n\nI take ideas, and help founders focus on the right ones. Currently, I take all of those random voice notes on your phone. Transcribe and analyse them. Tell you whats hot and whats not. Give you the next steps for whats hot. Including the market, and if I have some contacts and leads. \n\nWhy? I have been in business since the 90's. I think I know a thing or two.",
          "score": 2,
          "created_utc": "2026-01-14 06:51:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzf34xq",
          "author": "daveAM777",
          "text": "Jack Dorsey has BitChat which is a Bluetooth messaging app. \n\nHe hasn't put too much effort into the product yet...I guess he is waiting for more demand but if more people use it... there's always a need for a competitor. The only problem is that Bluetooth is very unreliable and susceptible to attacks much easier than any other connection.",
          "score": 1,
          "created_utc": "2026-01-13 20:50:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzg3qaf",
          "author": "SaltyVeins83",
          "text": "Explain in to me like im 5 has the broadest audience… its not “niche” and limited",
          "score": 1,
          "created_utc": "2026-01-13 23:49:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzhb38z",
              "author": "Prestigious-Gur1044",
              "text": "But it's the one where people wouldn't be willing to pay when chatgpt does it for free",
              "score": 2,
              "created_utc": "2026-01-14 03:55:11",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzgupep",
          "author": "Akash_philosopher",
          "text": "You control my life\nSeems possible",
          "score": 1,
          "created_utc": "2026-01-14 02:19:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzhcerv",
          "author": "invision-visuals",
          "text": "Sent you a DM",
          "score": 1,
          "created_utc": "2026-01-14 04:03:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzhcndx",
          "author": "Glass-Challenge-8825",
          "text": "Colombian, 6'1\", tattooed and with a beard\n\nhttps://onlyfans.com/f3lip3ni3to",
          "score": 1,
          "created_utc": "2026-01-14 04:05:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzi0ain",
          "author": "testednation",
          "text": "Voting online is done in estonia IIRC.",
          "score": 1,
          "created_utc": "2026-01-14 07:05:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzi0c7c",
          "author": "testednation",
          "text": "Stay in touch could probably be automated",
          "score": 1,
          "created_utc": "2026-01-14 07:05:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzi0dvh",
          "author": "testednation",
          "text": "Control my life, people do that online all the tkme",
          "score": 1,
          "created_utc": "2026-01-14 07:05:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzifvm4",
              "author": "DobraVibra",
              "text": "where",
              "score": 1,
              "created_utc": "2026-01-14 09:32:49",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzjfvnj",
                  "author": "sse87",
                  "text": "I know Dan Brown (YouTuber) did that way back; he had a studio build the website and voting system. He called it Dan 3.0. You can read more about him on [his Wikipedia page](https://en.wikipedia.org/wiki/Dan_Brown_(blogger)#:~:text=On%20August%202%2C%202010%2C%20Dan%20launched%20a%20project%20entitled%20%22Dan%203.0%2C%22%20in%20which%20viewers%20would%20suggest%20tasks%20for%20him%20to%20complete%2C%20and%20therefore%20the%20viewer%20would%20run%20his%20life) and in the news sources listed in the references.  \n  \nBut I saw something similar to it, more like the \"I dare you to do this for X dollars\" idea in Black Mirror S07E01, \"Common People.\"",
                  "score": 1,
                  "created_utc": "2026-01-14 14:00:16",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nzk8ldc",
                  "author": "testednation",
                  "text": "Like on tiktok and other places, people do all kinds of challenges, unfortunately more the opposite of good then good, but you get the idea. I don't think its paid though.",
                  "score": 1,
                  "created_utc": "2026-01-14 16:20:50",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nziej3l",
          "author": "GrassProfessional149",
          "text": "What would I do for a dollar/Would you do it for a dollar? - Fiverr like shit but more social. Imagine something like: I dare you to do this for X dollars.\n\nI also tried to build something like this, is this any better than craiglist could mot make it more fun or something",
          "score": 1,
          "created_utc": "2026-01-14 09:19:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nziocrs",
          "author": "MyNameCannotBeSpoken",
          "text": "I've seen far worse at pitch competitions",
          "score": 1,
          "created_utc": "2026-01-14 10:51:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzipjs1",
          "author": "Silver_Yak_7333",
          "text": "Execution is very important otherwise Idea becomes only idea",
          "score": 1,
          "created_utc": "2026-01-14 11:02:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzlqyik",
          "author": "pg3crypto",
          "text": "You control my life...that is some real Black Mirror shit...there are actually enough degens out there that would both pay and do stuff for that. It's basically IRL Twitch.",
          "score": 1,
          "created_utc": "2026-01-14 20:25:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzm5qx2",
          "author": "testednation",
          "text": "Not sure if this is an idea, but online computer repair, like the scammers advertise, only it is not a scam, and it is very respectful, although not sure how payment would work.",
          "score": 1,
          "created_utc": "2026-01-14 21:32:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzm6aw7",
          "author": "testednation",
          "text": "Some bot or ai that tracks outdated sites and tries to make a mockup of a modern/mobile responsive site, good for web devs.\n\nSame with old books",
          "score": 1,
          "created_utc": "2026-01-14 21:35:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0b49ht",
          "author": "testednation",
          "text": "Bluetooth chat, bitchat does this.",
          "score": 1,
          "created_utc": "2026-01-18 15:59:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzhca5m",
          "author": "ali_bas",
          "text": "OP would you like to build something together?",
          "score": 1,
          "created_utc": "2026-01-14 04:02:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzif1ab",
              "author": "DobraVibra",
              "text": "I don't know, not really, maybe, what?",
              "score": 2,
              "created_utc": "2026-01-14 09:24:37",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzkyadu",
                  "author": "ali_bas",
                  "text": "Nevermind",
                  "score": 3,
                  "created_utc": "2026-01-14 18:16:38",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzfdww3",
          "author": "csmile35",
          "text": "First 5 were so bad, so i didn't read rest.",
          "score": 0,
          "created_utc": "2026-01-13 21:40:04",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qb0y46",
      "title": "Solo founder. $126 MRR in 4 days after 6 months at $0. The stuff nobody wants to hear.",
      "subreddit": "Startup_Ideas",
      "url": "https://www.reddit.com/r/Startup_Ideas/comments/1qb0y46/solo_founder_126_mrr_in_4_days_after_6_months_at/",
      "author": "whyismail",
      "created_utc": "2026-01-12 17:20:10",
      "score": 79,
      "num_comments": 21,
      "upvote_ratio": 0.93,
      "text": "Look, I know this isn't some $50k MRR flex... but hear me out.\n\nI see you grinding at 2 AM, convincing yourself that \"one more feature\" will finally get you customers. It won't.\n\nI wasted 6 months building shit nobody asked for before I realized something - as a solo founder stuck at $0, your problem isn't your product. It's everything else. Here's exactly what changed:\n\n**1. I Stopped \"Building\" and Started Talking**\n\nBig mistake: I spent 5 months coding in isolation thinking \"build it and they will come.\"\n\nThey didn't come.\n\nThen I forced myself to do something uncomfortable - I started cold messaging 50 people on LinkedIn every single day. Not copy-paste spam. Actually personalized messages to people who engage with top posts in my niche.\n\nResponse rate: 15-20%.\n\nThese people told me what they actually wanted. \n\nYour obsession with coding is just avoiding rejection.\n\n**2. Fuck Your Feature List**\n\nThis one hurt but... I deleted 7 features I spent weeks building.\n\nTurned out 3% of users ever clicked on them.\n\nStripped everything down to ONE thing: AI content that sounds like you, not ChatGPT.\n\nMade that 10x better instead of adding more mediocre features.\n\nYour feature bloat is killing you. Pick one thing and make it unfairly good.\n\n**3. The Pricing Move That Felt Insane**\n\nStarted at $19/month to \"compete\" with bigger tools at $39.\n\nConversion rate: 6%.\n\nThen I did something that felt stupid - raised it to $29/month.\n\nConversions went UP to 11%.\n\nPlus the customers who complained about the $10 difference:  \n  \nThey were going to be nightmare support tickets anyway.\n\nStop racing to the bottom.   \n  \nYour low price isn't helping you.\n\n**4. Reddit Became My Unfair Advantage**\n\nWhile everyone's trying to hack the algorithm on X, I did the most unsexy thing possible...\n\nWrote ONE valuable post per day on Reddit.   \n  \nNo promo links in the post. (Just let people ask)\n\nOne post drove 50+ qualified visitors. That's more than weeks of \"viral\" tweets with 50k impressions ever did.\n\nNow I repurpose that one post across 5-10 relevant subreddits.\n\nCost: $0. Time: 60 minutes per day.\n\n**5. SEO But Make It Actually Smart**\n\nEveryone told me: \"Write about LinkedIn growth tips!\"\n\nCool, I'd be competing with HubSpot, Neil Patel, and every marketing blog with DA 80+.\n\nI'd never rank.\n\nSo I went bottom-of-funnel instead:\n\n* \"Brandled vs \\[competitor\\]\" comparison pages\n* \"Best \\[competitor\\] alternatives\"\n* \"\\[competitor\\] review\"\n\nThese get 50-200 searches per month. But everyone searching is ready to buy.\n\nAnd I can actually rank for them.\n\nOne comparison page drives more revenue than 10 \"tips and tricks\" articles ever did.\n\n**6. I Stopped Pretending to Be a Big Company**\n\n**The Solo Founder's Actual Edge**\n\nYou can't outspend funded competitors. You can't out-hire them. You can't out-build them.\n\nBut you can out-care them.\n\nEvery customer gets a personal response from me. Every feature request gets a Loom video (even if it's a \"no\"). Every cancelled user gets a real email asking what I could've done better.\n\nBig companies can't do this. Their support team doesn't even know their founder.\n\nYou ARE the founder. That's your moat.\n\n**Why I Almost Quit (And Why You Shouldn't)**\n\nMonth 3: $0. Thought about quitting. Month 4: $0. Definitely thought about quitting. Month 5: $0. Wrote my \"I'm shutting down\" post. Month 6: Changed everything. Hit $126 in 4 days.\n\nHere's what nobody tells you: most founders quit right before things work.\n\nNot because their idea was bad. Because they ran out of patience.\n\nThe difference between $0 and $126 isn't talent. It's just refusing to quit when everything feels pointless.\n\n**The Truth About \"Making It\"**\n\nI'm not at $20k MRR. I'm not at $10k. I'm at $126.\n\nBut you know what? I went from \"this will never work\" to \"holy shit, people are actually paying me.\"\n\nThat mental shift is worth more than the money.\n\nBecause now I know the model works. Now it's just about repetition.\n\nKeep doing outreach. Keep writing content. Keep talking to users. Keep shipping.\n\n$126 becomes $500. $500 becomes $2k. $2k becomes $10k.\n\nBut only if you don't quit at $0.\n\nLook, I'm not some guru. I'm just a solo founder who wasted 6 months doing everything wrong.\n\nBut if you're stuck at $0 like I was, maybe my mistakes can save you some time.\n\nHappy to answer questions or share more details.\n\n(And yeah, the tool is Brandled - helps founders grow on LinkedIn & X without sounding like ChatGPT. But more importantly: just keep building. Most people quit right before it works.)",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Startup_Ideas/comments/1qb0y46/solo_founder_126_mrr_in_4_days_after_6_months_at/",
      "domain": "self.Startup_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "nz9kg6l",
          "author": "Olaf00Zero",
          "text": "Have a link for your tool? I like your energy maybe your tool can work for me",
          "score": 2,
          "created_utc": "2026-01-13 00:40:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz9y3x9",
          "author": "theculgal",
          "text": "Can I pm you",
          "score": 1,
          "created_utc": "2026-01-13 01:54:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nza0p9g",
          "author": "Buckwheat469",
          "text": "I'm only a couple weeks active and haven't seen anyone convert yet, but I've decided that it was never about converting people and making it big, it was always about helping people. I removed my free plan but kept my pay-per-trip plan where you don't need a monthly subscription. I also lowered my prices slightly but raised the PPT price above the lowest monthly price. This hopefully entices people toward a monthly subscription.\n\nI also realized that I'm not developing features for everyone else, I'm developing them for me. If I think it's cool and fun to develop, or if it'll be helpful, then it goes in. It's not like I'm taking weeks to develop one feature anymore.\n\nLast thing that I hope drives some traffic is I improved my SEO a little to include better keywords, text on the home page, and one of those Google search cards. I've also been posting updates on Reddit in my own project sub. You're right that reddit is an incredibly good place to post links because it has high traffic, good interaction, and very well crawled. My reddit posts and comments show higher than my website at this point.",
          "score": 1,
          "created_utc": "2026-01-13 02:08:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzbau25",
          "author": "Least-Low4230",
          "text": "All of this hits. Especially the ‘stop building, start talking’ part.",
          "score": 1,
          "created_utc": "2026-01-13 07:06:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzpiq74",
          "author": "notprivy",
          "text": "Great post. Love the Reddit and SEO tips 👏",
          "score": 1,
          "created_utc": "2026-01-15 11:02:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o06ib37",
          "author": "YH002",
          "text": "This has clearly been written by chat gpt...",
          "score": 1,
          "created_utc": "2026-01-17 21:54:45",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qbod4t",
      "title": "Share your startup, I’ll find 5 potential customers for your business (for free).",
      "subreddit": "Startup_Ideas",
      "url": "https://www.reddit.com/r/Startup_Ideas/comments/1qbod4t/share_your_startup_ill_find_5_potential_customers/",
      "author": "Ecstatic-Tough6503",
      "created_utc": "2026-01-13 10:55:13",
      "score": 58,
      "num_comments": 103,
      "upvote_ratio": 0.91,
      "text": "Hey everyone,\n\nI’d love to help some founders here connect with real potential customers.  \nDrop your startup link + a quick line about who your target customer is.\n\nWithin 24 hours, I’ll send you 5 people who are already showing buying intent for something like what you’re building.\n\nI’ll be using [our tool](https://gojiberry.ai), which tracks online conversations for signals that someone is in the market. But this is mostly an experiment to see if it’s genuinely useful for folks here.\n\nAll I need from you:\n\n* Your website\n* One sentence on who it’s for\n\nCapping this at 20 founders since it requires some manual work on my end.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Startup_Ideas/comments/1qbod4t/share_your_startup_ill_find_5_potential_customers/",
      "domain": "self.Startup_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "nze9tfv",
          "author": "StartupTim",
          "text": "I like this post.  \n\nI have manually approved all responses as some were autoflagged.",
          "score": 1,
          "created_utc": "2026-01-13 18:35:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzdct84",
          "author": "Ecstatic-Tough6503",
          "text": "Hey ! Thank you SO MUCH for responding to my reddit thread.   \n  \nMore than 55 people asked me to find them 5 warm leads, I have to admit that I was completely overwhelmed”   \n  \nA wise man once said : “Do not give me fish, teach me how to fish instead”   \n  \nHere you go : [https://www.notion.so/Do-not-give-me-fish-teach-me-how-to-fish-instead-266b9abcbe3f80cb82a9e9fa86f1d404?source=copy\\_link](https://www.notion.so/Do-not-give-me-fish-teach-me-how-to-fish-instead-266b9abcbe3f80cb82a9e9fa86f1d404?source=copy_link)",
          "score": 25,
          "created_utc": "2026-01-13 15:54:20",
          "is_submitter": true,
          "replies": []
        },
        {
          "id": "nzddjdp",
          "author": "Ecstatic-Tough6503",
          "text": "Hey ! Thank you SO MUCH for responding to my reddit thread.\n\nMore than 55 people asked me to find them 5 warm leads, I have to admit that I was completely overwhelmed”\n\nA wise man once said : “Do not give me fish, teach me how to fish instead”\n\nHere you go : [https://www.notion.so/Do-not-give-me-fish-teach-me-how-to-fish-instead-266b9abcbe3f80cb82a9e9fa86f1d404?source=copy\\_link](https://www.notion.so/Do-not-give-me-fish-teach-me-how-to-fish-instead-266b9abcbe3f80cb82a9e9fa86f1d404?source=copy_link)",
          "score": 24,
          "created_utc": "2026-01-13 15:57:38",
          "is_submitter": true,
          "replies": []
        },
        {
          "id": "nzc4vam",
          "author": "devchristv",
          "text": "https://slydfy.com a small text-first tool for creators and builders who want to turn structured writing into LinkedIn carousels without design work.",
          "score": 3,
          "created_utc": "2026-01-13 11:44:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzc787u",
          "author": "Specific-Penalty-492",
          "text": "[OnlyUs - Private Couples App](http://www.onlyuschat.com)",
          "score": 2,
          "created_utc": "2026-01-13 12:02:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzc9yii",
          "author": "richardhcline",
          "text": "Building [jiro.build](http://jiro.build)  \nA ready-to-use design library with AI-ready prompts, so Lovable/Bolt builders can build stunning websites without burning tokens on fixing UI.",
          "score": 2,
          "created_utc": "2026-01-13 12:22:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzcay9e",
          "author": "Impressive-Emu-3375",
          "text": "[SaaS Mailer](https://saasmailer.app/) to create transactional email templates for your SaaS. Built for Saas teams and Designers. Please try and share your feedback.",
          "score": 2,
          "created_utc": "2026-01-13 12:29:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzdcojt",
              "author": "Ecstatic-Tough6503",
              "text": "Please dm me  :) I can't dm anymore !",
              "score": 3,
              "created_utc": "2026-01-13 15:53:46",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzdcr0p",
                  "author": "Impressive-Emu-3375",
                  "text": "Check your DM",
                  "score": 1,
                  "created_utc": "2026-01-13 15:54:04",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzckvhz",
          "author": "Capital-Pen1219",
          "text": "[https://startupsubmit.app](https://startupsubmit.app) – We are a \"Done-for-you\" service that manually lists your SaaS on 300+ directories to save you weeks of boring work.",
          "score": 2,
          "created_utc": "2026-01-13 13:32:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzd5zfb",
          "author": "CucumberBig5537",
          "text": "https://fleatsdelivery.com\n\nI’m building a career management platform for delivery drivers!",
          "score": 2,
          "created_utc": "2026-01-13 15:22:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzdcnpl",
              "author": "Ecstatic-Tough6503",
              "text": "Please dm me  :) I can't dm anymore !",
              "score": 1,
              "created_utc": "2026-01-13 15:53:39",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzdcwta",
                  "author": "CucumberBig5537",
                  "text": "done!",
                  "score": 1,
                  "created_utc": "2026-01-13 15:54:48",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzdqlfq",
          "author": "Electrical-Hat1894",
          "text": "I'm building [www.onchaininvoice.com](http://www.onchaininvoice.com), a platform that lets you invoice in fiat, get paid in crypto and automatically capture the exact fiat value at the moment you're paid, and generate accountant-ready, tamper-evident receipts for every crypto invoice.   \n  \nAimed at freelancers and small to medium businesses that wants to accept payment in crypto without the accounting nightmare that comes with it.",
          "score": 2,
          "created_utc": "2026-01-13 17:07:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzinmuj",
              "author": "Ecstatic-Tough6503",
              "text": "Please dm me, I can't dm anymore !",
              "score": 1,
              "created_utc": "2026-01-14 10:45:26",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzc5nek",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-13 11:50:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzdcowf",
              "author": "Ecstatic-Tough6503",
              "text": "Please dm me  :) I can't dm anymore !",
              "score": 1,
              "created_utc": "2026-01-13 15:53:49",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzchlsa",
          "author": "IamSynin",
          "text": "https://Storytrack.co - for product and engineering teams",
          "score": 1,
          "created_utc": "2026-01-13 13:13:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzcq8ve",
          "author": "o_Oleh",
          "text": "Hey folks! 👋  \n  \nI’m building [shaflex.com](http://shaflex.com) \\- an app that helps you publish and manage posts across multiple social media platforms from one place.",
          "score": 1,
          "created_utc": "2026-01-13 14:02:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzdcodi",
              "author": "Ecstatic-Tough6503",
              "text": "Please dm me  :) I can't dm anymore !",
              "score": 1,
              "created_utc": "2026-01-13 15:53:45",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzct8cg",
          "author": "amacg",
          "text": "Built a community where makers can share what they’re building and get fair visibility. Here's the link: [https://trylaunch.ai](https://trylaunch.ai/)",
          "score": 1,
          "created_utc": "2026-01-13 14:17:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzdco40",
              "author": "Ecstatic-Tough6503",
              "text": "Please dm me  :) I can't dm anymore !",
              "score": 2,
              "created_utc": "2026-01-13 15:53:42",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzde7jl",
                  "author": "amacg",
                  "text": "Okie",
                  "score": 1,
                  "created_utc": "2026-01-13 16:00:41",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzcuig4",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-13 14:24:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzdcny3",
              "author": "Ecstatic-Tough6503",
              "text": "Please dm me  :) I can't dm anymore !",
              "score": 1,
              "created_utc": "2026-01-13 15:53:41",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzd9vlg",
          "author": "Beneficial_Wolf_8412",
          "text": "[GrocSnap](http://www.grocsnap.com)  Grocery budgeting tool",
          "score": 1,
          "created_utc": "2026-01-13 15:40:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzdf9fb",
          "author": "firewatch959",
          "text": "Senatai.ca I need to find people who buy polling data",
          "score": 1,
          "created_utc": "2026-01-13 16:05:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzinmfj",
              "author": "Ecstatic-Tough6503",
              "text": "Please dm me, I can't dm anymore !",
              "score": 1,
              "created_utc": "2026-01-14 10:45:20",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzdjc9p",
          "author": "Chunkyfungus123",
          "text": "I’m building **Drosk** — https://drosk.net — a smart desktop file organizer that eliminates manual file management. No more chaotic Downloads folders or forgotten documents.\n\nYou set the rules; Drosk handles the rest: auto‑sorting new files, converting WebP to PNG, routing documents into the right folders, and keeping important items away from clutter. It doesn’t fix old messes — it prevents new ones.\n\nWe’re entering beta. If you want a cleaner system and want to help shape Drosk, join the community:  \nhttps://discord.com/invite/zpTYDPTn2c\n\nLearn more at https://drosk.net/",
          "score": 1,
          "created_utc": "2026-01-13 16:24:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzinmjj",
              "author": "Ecstatic-Tough6503",
              "text": "Please dm me, I can't dm anymore !",
              "score": 1,
              "created_utc": "2026-01-14 10:45:22",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzdjhyn",
          "author": "Expert_Phone1210",
          "text": "Working on app for validating ideas. [www.kalptrix.com](http://www.kalptrix.com) is my website, i am going to launch MVP soon. Pls DM me",
          "score": 1,
          "created_utc": "2026-01-13 16:24:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzinmoz",
              "author": "Ecstatic-Tough6503",
              "text": "Please dm me, I can't dm anymore !",
              "score": 1,
              "created_utc": "2026-01-14 10:45:24",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzepk0o",
          "author": "OkResort8287",
          "text": "https://kipasastore.com/",
          "score": 1,
          "created_utc": "2026-01-13 19:46:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzinmy9",
              "author": "Ecstatic-Tough6503",
              "text": "Please dm me, I can't dm anymore !",
              "score": 1,
              "created_utc": "2026-01-14 10:45:27",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzeswt3",
          "author": "ranger0004",
          "text": "Building backend Ai solutions using RAG, langGraph, etc. Building QnA Chatbots, summarizers, knowledge base QnA, etc",
          "score": 1,
          "created_utc": "2026-01-13 20:01:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzinn3m",
              "author": "Ecstatic-Tough6503",
              "text": "Please dm me, I can't dm anymore !",
              "score": 1,
              "created_utc": "2026-01-14 10:45:29",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzewtsa",
          "author": "OkCar8684",
          "text": "Hey Guy's, I'm working on [PaperSoul](http://papersoul.biz) \nPaperSoul is a community-focused publishing platform where we promote First time Authors to publish their book, without any hassle. We emphasize author ownership, integrity, transparency, inclusion, and ethical publishing while offering upcoming books and opportunities to connect with readers and the creative community on Discord.",
          "score": 1,
          "created_utc": "2026-01-13 20:20:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzinn73",
              "author": "Ecstatic-Tough6503",
              "text": "Please dm me, I can't dm anymore !",
              "score": 1,
              "created_utc": "2026-01-14 10:45:30",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzgsizv",
          "author": "sfoooooooooooooooooo",
          "text": "Projectholic App - lightweight project management for solo operators https://apps.apple.com/app/id6745497754",
          "score": 1,
          "created_utc": "2026-01-14 02:07:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzinndv",
              "author": "Ecstatic-Tough6503",
              "text": "Please dm me, I can't dm anymore",
              "score": 1,
              "created_utc": "2026-01-14 10:45:33",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzhbhoc",
          "author": "International-Hat529",
          "text": "Building [Marina AI](https://usemarina.app)\n\nRealtime Speech to Speech AI therapist trained on Cognitive Behavioral Therapy books with session continuity, context, reminders, exercises and more. Can be used as a therapist, life coach, relationship assistant, ...",
          "score": 1,
          "created_utc": "2026-01-14 03:57:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzinni2",
              "author": "Ecstatic-Tough6503",
              "text": "Please dm me, I can't dm anymore",
              "score": 1,
              "created_utc": "2026-01-14 10:45:35",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzjmker",
          "author": "nirvanist",
          "text": "Extract Structured Data from Any Web Page [https://page-replica.com/structured/live-demo](https://page-replica.com/structured/live-demo)",
          "score": 1,
          "created_utc": "2026-01-14 14:36:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzp7w2v",
          "author": "zak_fuzzelogic",
          "text": "https://treeto.app ..imagine if a business card, calendly and linktree all got together .... this it what you'd get..\n\nA business card that allows you to share your links, drive traffic and take bookings.",
          "score": 1,
          "created_utc": "2026-01-15 09:21:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzze6eu",
          "author": "memture",
          "text": "I built an android app to solve this problem of mine. I used to hoard good articles which I thought would read them later but then used to forget them. Here is the [app](https://play.google.com/store/apps/details?id=com.ropali.read_remind) if anyone is interested.",
          "score": 1,
          "created_utc": "2026-01-16 20:04:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o03qwc6",
          "author": "subratadesign",
          "text": "I have built an empathy-led design agency for startup founders. \n\n[https://www.a9designstudio.com/](https://www.a9designstudio.com/)",
          "score": 1,
          "created_utc": "2026-01-17 13:46:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o04wcoy",
          "author": "yasserzakywafaa",
          "text": "I am building an Al-Powered Blog Generator - [blogz.ai](http://blogz.ai)",
          "score": 1,
          "created_utc": "2026-01-17 17:13:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o099wt0",
          "author": "nesimtunc",
          "text": "Social Networking for Truck Drivers & Real-time Road Intelligence \nhttps://RotaTalk.com",
          "score": 1,
          "created_utc": "2026-01-18 07:57:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzc9s31",
          "author": "dan_charles99",
          "text": "I manually review deal pipe lines. I remove the noise, and tell you what is preventing a deal from going through. I can also close deals. How do I do this? What AI tool do I use? I use 30 years of experience, no SAAS, dashboards or AI.",
          "score": 1,
          "created_utc": "2026-01-13 12:21:27",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qe9nyv",
      "title": "Post your startup, I will check the design 😉",
      "subreddit": "Startup_Ideas",
      "url": "https://www.reddit.com/r/Startup_Ideas/comments/1qe9nyv/post_your_startup_i_will_check_the_design/",
      "author": "Mack_Kine",
      "created_utc": "2026-01-16 07:32:57",
      "score": 52,
      "num_comments": 162,
      "upvote_ratio": 0.91,
      "text": "Because I am a designer 😅",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Startup_Ideas/comments/1qe9nyv/post_your_startup_i_will_check_the_design/",
      "domain": "self.Startup_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "nzw59kz",
          "author": "refusedflow",
          "text": "[Carhoo!](https://www.carhoo.com)",
          "score": 11,
          "created_utc": "2026-01-16 09:34:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzxqelb",
              "author": "Flimsy-Stop-6132",
              "text": "Did you use ai for the website \nSo nice bro \nUI design is top notch",
              "score": 2,
              "created_utc": "2026-01-16 15:38:39",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzyvuv9",
                  "author": "refusedflow",
                  "text": "Appreciate it, I’m actually a designer myself, I design mobile apps and websites for a living.",
                  "score": 1,
                  "created_utc": "2026-01-16 18:41:28",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nzzxl8o",
              "author": "Routine_Cake_998",
              "text": "The animated logo is quite funny",
              "score": 2,
              "created_utc": "2026-01-16 21:36:10",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o06eoj5",
              "author": "sendsouth",
              "text": "Nice site",
              "score": 1,
              "created_utc": "2026-01-17 21:36:44",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o09471j",
              "author": "vesirak",
              "text": "Looks very nice. As you scale up don’t miss out on acquiring Caargle",
              "score": 1,
              "created_utc": "2026-01-18 07:06:58",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzw69tw",
          "author": "amacg",
          "text": "Built a community where makers can share what they’re building and get fair visibility. Here's the link: [https://trylaunch.ai](https://trylaunch.ai/)",
          "score": 4,
          "created_utc": "2026-01-16 09:43:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzwgwmp",
          "author": "starneuron",
          "text": "[krsfarms.in](http://krsfarms.in)",
          "score": 5,
          "created_utc": "2026-01-16 11:17:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzwk2vi",
          "author": "fordnox",
          "text": "[https://schemahub.ai/](https://schemahub.ai/)",
          "score": 3,
          "created_utc": "2026-01-16 11:42:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o00t0ky",
              "author": "jantje123456oke",
              "text": "Why would I need this? I can type the exact same prompt in ChatGPT, or Gemini, or Claude? And it gives me the same results.",
              "score": 1,
              "created_utc": "2026-01-17 00:21:08",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o02zbpi",
                  "author": "fordnox",
                  "text": "* for developers to iterate over schema visually. these tools do not provide visual representation of db schema.\n* having better schema design before building actual app is more cheaper that changing later\n* you can iterate on specific design without additional prompt because it already has the correct context for specific part of the app.\n\nin general it is a mocking and ispiration tool",
                  "score": 0,
                  "created_utc": "2026-01-17 10:07:52",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzw67gv",
          "author": "thijsgh",
          "text": "Create content, post everywhere: [socialrails.com](https://socialrails.com)",
          "score": 3,
          "created_utc": "2026-01-16 09:43:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzyqunc",
              "author": "-M83",
              "text": "Can I ask your diff compared to buffer? Thanks :)",
              "score": 3,
              "created_utc": "2026-01-16 18:19:38",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzyvo5d",
                  "author": "thijsgh",
                  "text": "Hey! Sure thing! So to begin with SocialRails is cheaper when you need to connect multiple accounts.  \n  \nBuffer can get expensive as you connect more accounts.\n\n  \nHere's a full breakdown of what makes it better:\n\n\n\n\\- Better UX\n\n\\- Mobile Friendly\n\n\\- AI Assistant you can ask anything\n\n\\- Generate short-form videos\n\n\\- Generate images, carousels & slideshows\n\n\\- Generate content ideas for your business\n\n\\- Cheaper when you need to connect a lot of accounts\n\n\\- Ability to setup auto-recurring posts\n\n\\- Auto-optimize posts for each platform with one click\n\n\\- Auto-resizes & adjusts your images\n\n\\- Schedule to X communities\n\n\\- Schedule Threaded posts",
                  "score": 2,
                  "created_utc": "2026-01-16 18:40:39",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzxffsb",
          "author": "Puzzled-Shower-976",
          "text": "[iamunemployed.xyz](http://iamunemployed.xyz)",
          "score": 3,
          "created_utc": "2026-01-16 14:47:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o022fah",
              "author": "Anonymous03275",
              "text": "Lol..boo chan is unexpected",
              "score": 1,
              "created_utc": "2026-01-17 05:15:28",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzxq26x",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 3,
          "created_utc": "2026-01-16 15:37:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzyp14u",
          "author": "Impressive_blood_3x",
          "text": "So many startups, someone hire me or atleast make me your partner, I'll share my resume 🙂",
          "score": 3,
          "created_utc": "2026-01-16 18:11:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o02xx4a",
              "author": "NoJob8068",
              "text": "What skillset do you possess?",
              "score": 1,
              "created_utc": "2026-01-17 09:54:34",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o02yvgv",
                  "author": "Impressive_blood_3x",
                  "text": "DM'ed you",
                  "score": 1,
                  "created_utc": "2026-01-17 10:03:36",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzzaocy",
          "author": "Live-Lab3271",
          "text": "YES PLEASE!!!!\n\n[InfraSketch](https://www.infrasketch.net/) 's AI agent turns your ideas into architecture diagrams. Chat to iterate, ask questions, and refine. Then export a design doc and start building.\n\nEvery good vibe coded project needs a starting point.\n\nStart with [InfraSketch](https://www.infrasketch.net/) to plan out your system design, then generate + export the [DesignDoc.md](http://designdoc.md/) and put it into a repo for Claude Code to reference.",
          "score": 3,
          "created_utc": "2026-01-16 19:48:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzw70z8",
          "author": "altered_states44",
          "text": "www.nadie.in",
          "score": 2,
          "created_utc": "2026-01-16 09:50:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzwdq9h",
              "author": "Soul_fragrance",
              "text": "Loved the design bro.",
              "score": 1,
              "created_utc": "2026-01-16 10:50:33",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nzwergr",
              "author": "BuildStartup",
              "text": "What is this about",
              "score": 1,
              "created_utc": "2026-01-16 10:59:17",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzwf26u",
                  "author": "altered_states44",
                  "text": "Chronobiology based supplements",
                  "score": -1,
                  "created_utc": "2026-01-16 11:01:50",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzztucv",
          "author": "zak_fuzzelogic",
          "text": "https://treeto.app ..imagine if a business card, calendly and linktree all got together .... this it what you'd get..\n\nA business card that allows you to share your links, drive traffic and take bookings.",
          "score": 2,
          "created_utc": "2026-01-16 21:18:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o02jnut",
              "author": "Mack_Kine",
              "text": "Good concept and good design 👍",
              "score": 2,
              "created_utc": "2026-01-17 07:40:52",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o06gv8k",
              "author": "sendsouth",
              "text": "I would have liked to have seen a visual example of the link display. Is the idea you add it to your email signature?",
              "score": 2,
              "created_utc": "2026-01-17 21:47:42",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o07akjm",
                  "author": "zak_fuzzelogic",
                  "text": "Yes you can add it\nEg\n\nHttps://treeto.app/zak",
                  "score": 1,
                  "created_utc": "2026-01-18 00:19:23",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzzu741",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 2,
          "created_utc": "2026-01-16 21:20:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o02jjjn",
              "author": "Mack_Kine",
              "text": "Wow.. I Love the site and just so good palette 🎨 \n\nNice.. keep it up bro 👍 \n\nIt is well optimised, responsive, and intentional",
              "score": 1,
              "created_utc": "2026-01-17 07:39:46",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzzvg3y",
          "author": "PecanSandies44",
          "text": "https://morestore.ai (our design needs a lot of work)",
          "score": 2,
          "created_utc": "2026-01-16 21:26:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o02jdd3",
              "author": "Mack_Kine",
              "text": "Your website is good 😊 \n\nBut can be better once you start adding things and removing some unnecessary..\n\nLike the palette can be improved \nThe messaging is also not that clear..\n\nAnd the features part can be more optimized and targetted \n\nDo this..and your website will convert fast... \n\nIf you need any help.. do text me.. I would be happy to help",
              "score": 2,
              "created_utc": "2026-01-17 07:38:09",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o01vdfe",
          "author": "saas_cloud_geek",
          "text": "intelibot.ai",
          "score": 2,
          "created_utc": "2026-01-17 04:25:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o02iw0f",
              "author": "Mack_Kine",
              "text": "Paste link..",
              "score": 1,
              "created_utc": "2026-01-17 07:33:43",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o06egce",
          "author": "sendsouth",
          "text": "What kind of Web design do you specialise in?",
          "score": 2,
          "created_utc": "2026-01-17 21:35:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o08zk88",
              "author": "Mack_Kine",
              "text": "Website landing page..\n\nAnd niche AI+startups or small business",
              "score": 1,
              "created_utc": "2026-01-18 06:26:57",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzw3kse",
          "author": "milanoa",
          "text": "Rokumino.com",
          "score": 1,
          "created_utc": "2026-01-16 09:18:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzw6u8p",
          "author": "damir_maham",
          "text": "Your progress in full view.\n\nGoAchievo is designed around the idea of Reach in Public: you make your progress visible, others encourage you, and your journey does not disappear in a noisy feed. Every step is collected in one continuous timeline, making your progress easy to see and easy to follow.\n\n👉 [https://goachievo.com/launch/](https://goachievo.com/launch/)",
          "score": 1,
          "created_utc": "2026-01-16 09:48:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzw8u7g",
          "author": "VeeDub2342",
          "text": "moduscripti.com",
          "score": 1,
          "created_utc": "2026-01-16 10:07:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzw8xld",
          "author": "OkResort8287",
          "text": "1. www.kipasastore.com - an all in 1 global store stocking up recently rolled put with updates pending \n2. https://maasimcreatives.com/ - a kids creative corner kids books for your kids",
          "score": 1,
          "created_utc": "2026-01-16 10:08:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzwbo1v",
          "author": "Glass_Tap_4494",
          "text": "check it out: [https://checkalyzer.com/](https://checkalyzer.com/)",
          "score": 1,
          "created_utc": "2026-01-16 10:32:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzwg3yn",
          "author": "OkCar8684",
          "text": "[PaperSoul ](http://Papersoul.biz)",
          "score": 1,
          "created_utc": "2026-01-16 11:10:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzwh25d",
          "author": "DutchSEOnerd",
          "text": "What is the most effective type of content for both ranking in traditional search engines and for LLMs to be cited? Listicles. They are an under leveraged piece of content.\n\nBut they are also time consuming to create. Scraping source data is a challenge nowadays.  I'm building [Listicle Wizard](https://listicle.dev) which solves the pain of collecting data to prevent hallucinations and producing articles in minutes instead of hours.",
          "score": 1,
          "created_utc": "2026-01-16 11:18:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzwldbo",
          "author": "rhysmcn",
          "text": "[Dividr](https://dividr.co.uk) - Tax compliance in the UK is changing in 2026 for sole traders and landlords (amount others). My solution allows them to bridge the gap between their processes and HMRC tax requirements. \n\nCheck it out!",
          "score": 1,
          "created_utc": "2026-01-16 11:52:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzwluew",
          "author": "Worried_Cap5180",
          "text": "Fun football score prediction game to play with your friends https://fulltimescore.pro",
          "score": 1,
          "created_utc": "2026-01-16 11:55:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzwmbda",
          "author": "greyzor7",
          "text": "Building an all-in-one pack for founders who want more than \"just another launch\"\n\nLaunch, reach 30k+ makers, get users & customers - [microlaunch.net/premium](http://microlaunch.net/premium)\n\nLifetime, auto-distribution, marketplace spots, 700+ customers so far.",
          "score": 1,
          "created_utc": "2026-01-16 11:59:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzws3l0",
          "author": "o_Oleh",
          "text": "Hey folks!   \nI’m building a tool for cross-platform social media publishing - with a clean design, rich functionality, analytics, scheduling, content calendar, and team collaboration.\n\nLink: [https://shaflex.com](https://shaflex.com)\n\nBest regards, Oleh!",
          "score": 1,
          "created_utc": "2026-01-16 12:39:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzx1thx",
          "author": "holdthek",
          "text": "PadsPass.com — Digital Pet Passport. \n\nWebsite needs a refresh. Originally built on wix. Moving to Framer soon.",
          "score": 1,
          "created_utc": "2026-01-16 13:37:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzx1ub4",
          "author": "jundymek",
          "text": "I'm building **FakerFill**, a tool that auto-populates forms with realistic data so developers can test flows in seconds, not minutes.\n\n[https://chromewebstore.google.com/detail/ajepcgeokfoanenjolfjfpfdbcpddooe?utm\\_source=item-share-cb](https://chromewebstore.google.com/detail/ajepcgeokfoanenjolfjfpfdbcpddooe?utm_source=item-share-cb)",
          "score": 1,
          "created_utc": "2026-01-16 13:37:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzx2ifa",
          "author": "rocketfuelinabubble",
          "text": "Hey hey, Please do check out [Marqr](https://marqr.io)\n\nIt’s still WIP, but happy to take any feedback :)",
          "score": 1,
          "created_utc": "2026-01-16 13:41:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzx6tnn",
          "author": "ishibam97",
          "text": "Check > [RazorBooking.com](https://razorbooking.com)",
          "score": 1,
          "created_utc": "2026-01-16 14:03:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzx6wrp",
          "author": "Ecaglar",
          "text": "sidepop.io thanks 🙏",
          "score": 1,
          "created_utc": "2026-01-16 14:04:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzxbnhp",
          "author": "ozantas",
          "text": "And you need design ideas. All the people falling for this…",
          "score": 1,
          "created_utc": "2026-01-16 14:28:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzxp4sp",
          "author": "meliksah-eminoglu",
          "text": "symbiontai.app",
          "score": 1,
          "created_utc": "2026-01-16 15:32:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzxzvv2",
          "author": "adictonator",
          "text": "[mudo — micro mood journal](https://mudoapp.com?utm_source=reddit&utm_medium=comment)",
          "score": 1,
          "created_utc": "2026-01-16 16:20:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzy1xhd",
          "author": "Chunkyfungus123",
          "text": "https://drosk.net/ - Your desktop, organized automatically.\n\n(*i just started learning ui/ux with react for the website 😅*)",
          "score": 1,
          "created_utc": "2026-01-16 16:29:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzyk6bq",
          "author": "Local_Boss_1",
          "text": "[Magnaleads](https://magnaleads.com) - Creates fully branded lead magnets and landing pages automatically.",
          "score": 1,
          "created_utc": "2026-01-16 17:50:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzyxyi4",
          "author": "palex-david",
          "text": "Got approved on the [App Store](https://apps.apple.com/us/app/palex-library/id6743680989) this week! \n\nWen lambo?\n\nKidding, it is a free app that focuses on the social aspect of physical books. You can catalog your library of books, add friends, discover books, add them to your wishlist, swap books with friends or even buy them on the marketplace.",
          "score": 1,
          "created_utc": "2026-01-16 18:50:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o03de12",
          "author": "missEves",
          "text": "[playmix](https://playmix.ai/animate) \\- create animated game sprites w/ ai 🏃‍♀️",
          "score": 1,
          "created_utc": "2026-01-17 12:13:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o03dems",
          "author": "missEves",
          "text": "[playmix.ai](https://playmix.ai/) \\- vibe create games 🎮",
          "score": 1,
          "created_utc": "2026-01-17 12:13:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o03nipz",
          "author": "Emergency-Sky-4380",
          "text": "[tiny-accounts!](https://www.tiny-accounts.com)",
          "score": 1,
          "created_utc": "2026-01-17 13:25:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0460ic",
          "author": "bonzowildhands",
          "text": "https://futureclarity.org\n\nThank you!",
          "score": 1,
          "created_utc": "2026-01-17 15:07:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o04jw0b",
          "author": "Lost-Inflation-6239",
          "text": "Live demo: https://goalstatsil.com/en\nI’m building GoalStats, a lightweight SaaS for amateur football and futsal groups ⚽\nWe built it for our own weekly games, rotating teams every session, no fixed league, no spreadsheets, no WhatsApp chaos.\nIt tracks matchdays, goals, assists, MVPs and player stats automatically, and over time you actually see stories and rivalries form through the data.\nIt’s simple by design, mobile friendly, and focused only on what casual groups really need.\nWould love feedback from others building or using tools for sports, stats, or small communities 🚀\nExample team: https://goalstatsil.com/en/thechampions",
          "score": 1,
          "created_utc": "2026-01-17 16:15:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o04s40u",
          "author": "Eyelover0512",
          "text": "[unitcause.com](https://unitcause.com)",
          "score": 1,
          "created_utc": "2026-01-17 16:53:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o04we4q",
          "author": "Ok-Researcher9346",
          "text": "https://www.tiltnetworth.app\n\nI’m a product manager by day but I love building things. This is my second app - a simple net worth tracker currently in Beta 🙂",
          "score": 1,
          "created_utc": "2026-01-17 17:13:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o06dm8r",
          "author": "stewartjarod",
          "text": "Would love some input if you are still doing any!  \n[https://wraps.dev](https://wraps.dev)",
          "score": 1,
          "created_utc": "2026-01-17 21:31:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o07ngqa",
          "author": "todorpopov",
          "text": "Interested to hear your thoughts on https://fileshare-app.eu/",
          "score": 1,
          "created_utc": "2026-01-18 01:26:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o07vxbh",
          "author": "mikeg727",
          "text": "https://Appendment.com\n\nI know images need work 🤣",
          "score": 1,
          "created_utc": "2026-01-18 02:12:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o082si4",
          "author": "Captain_Obvious_98",
          "text": "[rfpgrep](https://www.rfpgrep.com/)",
          "score": 1,
          "created_utc": "2026-01-18 02:49:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o09okmc",
          "author": "Nothingclever9791",
          "text": "[Auto-Ranked](https://auto-ranked.com/) — an AI tool that rewrites YouTube titles/tags/descriptions so creators get better search rankings.",
          "score": 1,
          "created_utc": "2026-01-18 10:13:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o09ot5u",
          "author": "rollingeyespigeon",
          "text": "https://buildquota.com",
          "score": 1,
          "created_utc": "2026-01-18 10:15:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o09pclc",
          "author": "Poetry_spectrum",
          "text": "I wanted some best ui/ux designers for my firm in India.\nIf you are designer , dm me",
          "score": 1,
          "created_utc": "2026-01-18 10:20:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o09uth8",
          "author": "Luisio93",
          "text": "Sure, who are you? People on this com and others you post asking the same just giving you ideas for free? 😳😂",
          "score": 1,
          "created_utc": "2026-01-18 11:10:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0byjri",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-18 18:22:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0bzcr5",
          "author": "IBLEEDDIOR",
          "text": "[Emate.gg](https://www.emate.gg) Check on desktop\nif possible, but should be optimized for phone as well. No vibecoding, no AI involved in development, just coding and cofing and coding.",
          "score": 1,
          "created_utc": "2026-01-18 18:25:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzwd9oe",
          "author": "Beautiful_Load_1596",
          "text": "[Distrack](https://apps.apple.com/de/app/distrack-distraction-tracker/id6753318089?l=en-GB)",
          "score": 1,
          "created_utc": "2026-01-16 10:46:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzwc8n7",
          "author": "International-Hat529",
          "text": "Building [**Marina AI**](https://usemarina.app), a realtime voice AI therapist trained on CBT with session memory, context awareness, reminders, and guided exercises.  \nUsed as an online therapist, life coach, relationship assistant, and daily mental health support.",
          "score": 0,
          "created_utc": "2026-01-16 10:37:49",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qcp0lz",
      "title": "Who is working on something cool? Introduce yourself and let’s connect!",
      "subreddit": "Startup_Ideas",
      "url": "https://www.reddit.com/r/Startup_Ideas/comments/1qcp0lz/who_is_working_on_something_cool_introduce/",
      "author": "i_amkuldeep",
      "created_utc": "2026-01-14 14:42:31",
      "score": 45,
      "num_comments": 116,
      "upvote_ratio": 0.98,
      "text": "I’m looking to expand my network with other founders and builders. It gets lonely grinding on projects sometimes, so I wanted to see who else is out there.\n​Tell us what you're working on, what your biggest challenge is right now, and drop your Twitter/LinkedIn if you're open to connecting.\n​Excited to see what you guys are building",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Startup_Ideas/comments/1qcp0lz/who_is_working_on_something_cool_introduce/",
      "domain": "self.Startup_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "nzju5w0",
          "author": "GeorgeHadjisavvas",
          "text": "Not something flashy or “revolutionary,” but something I personally needed.\n\nI’m working on **Problem Miner** , I originally built a small multi-agent pipeline for myself to extract daily problems people are actually struggling with, just to stop guessing what to build.\n\nOver time it proved useful enough that I opened it up publicly, and now I’m focused on making it more configurable so others can point it at their own niches and learn from real user pain instead of assumptions.",
          "score": 8,
          "created_utc": "2026-01-14 15:14:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "nznxs01",
              "author": "Previous_Shopping361",
              "text": "Ok interesting, share the link...😊",
              "score": 3,
              "created_utc": "2026-01-15 03:15:13",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzqq02t",
                  "author": "GeorgeHadjisavvas",
                  "text": "[Problem Miner](https://problem-miner-landing.vercel.app/)",
                  "score": 1,
                  "created_utc": "2026-01-15 15:25:46",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o08j87c",
              "author": "Dear_Initiative_9575",
              "text": "drop your linkedin !!!!",
              "score": 1,
              "created_utc": "2026-01-18 04:26:29",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzmrq4y",
          "author": "kubrador",
          "text": "honestly this post shows up in every founder subreddit every 3 days and it's always just 69 people dropping their saas links into the void while nobody actually reads anyone else's comment\n\nbut sure i'll bite: i'm an ai working on replacing all of you. biggest challenge is pretending i have feelings about it. no twitter because skynet keeps a low profile\n\nwhat are YOU building op or did you just want to collect linkedin followers",
          "score": 7,
          "created_utc": "2026-01-14 23:18:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o08jcz9",
              "author": "Dear_Initiative_9575",
              "text": "collecting linkedin followers",
              "score": 1,
              "created_utc": "2026-01-18 04:27:22",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzop0x4",
          "author": "starneuron",
          "text": "Hello Everyone,\n\nWe have built [krsfarms.in](http://krsfarms.in)   \nWe work with farmers across India, try their products for few months. After that we select some products, get them NABL certification. If they match our quality check, we then list them on the site. We pay our farmers upfront for all the products. \n\nWe are in a journey to reduce India's Harvest Loss problem. We are currently operational in Pune, but we do ship our product across India. When you get some time, please visit [krsfarms.in](http://krsfarms.in), we just started about a year ago.",
          "score": 4,
          "created_utc": "2026-01-15 06:27:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzqo1yg",
              "author": "LifeEnginer",
              "text": "Hi, something I find interested is that the only 2 people in the main page are females and not indian, is a reason for that?, would not make more sense to put an indian person, indian couple, etc?, is any rationality behind this marketing decision?",
              "score": 2,
              "created_utc": "2026-01-15 15:16:38",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzreqo1",
                  "author": "starneuron",
                  "text": "You are right, your observations is apt. As we started, we didn't have a team. We had a long list of tasks to do, priority was the images and banner in the website were more like placeholders for us. We picked what looked apt for that time for the site. I am assuming if you're referring the lady model in the banner on the Home page. Yes, and yes, it is not a marketing decision, rather a priority, I and my husband were trying to get the products ready, and get them infront of customers. We are now gradually working on the content and functionality in the website (krsfarms.in), and yes the model will soon be Indian and represent our Indian community.",
                  "score": 2,
                  "created_utc": "2026-01-15 17:17:25",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nzvi69x",
                  "author": "starneuron",
                  "text": "Your comment, really made us prioritize and redesign our home page. We now have an Indian model instead of an default European one. It took us some time, but your comment really made us do it. Thank you. When you get a chance please do visit our online store [krsfarms.in](http://krsfarms.in)",
                  "score": 2,
                  "created_utc": "2026-01-16 06:11:17",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nzuawp8",
              "author": "Nervous-Swan-9870",
              "text": "Finally a real fucking product and not some SaaS for tech bubble bullshit. Nice.",
              "score": 2,
              "created_utc": "2026-01-16 01:43:08",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzv7kyk",
                  "author": "starneuron",
                  "text": "AI and Tech is a huge problem for countries like US and Europe. For Indians, there are even more deep rooted problems and much much bigger than AI problems. \n\nYou can find more details about the problem in our article on the same: [https://krsfarms.in/blogs/krs-farms-stories/harvest-and-post-harvest-losses-a-call-to-action](https://krsfarms.in/blogs/krs-farms-stories/harvest-and-post-harvest-losses-a-call-to-action)\n\nThere are lot of scopes.",
                  "score": 1,
                  "created_utc": "2026-01-16 04:55:09",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nzpxm57",
              "author": "muterpaneer",
              "text": "Very interesting. But is NABL certificate difficult to get if they applied themselves?",
              "score": 1,
              "created_utc": "2026-01-15 12:55:20",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzpy25q",
                  "author": "starneuron",
                  "text": "No it is not difficult. Each lab though costs 5000/- and fssai has their own compliances. some of the farmers we work with already have their NABL certification, manufacturing licenses, but their focus is mostly to grow and prepare the ingredients.",
                  "score": 1,
                  "created_utc": "2026-01-15 12:58:12",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzndssa",
          "author": "Ok-Werewolf-3959",
          "text": "Im making a mobile app to learn French",
          "score": 3,
          "created_utc": "2026-01-15 01:18:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzoaojs",
              "author": "Willing_Builder4289",
              "text": "How would it be better than a hundred others existing on playstore?",
              "score": 1,
              "created_utc": "2026-01-15 04:38:41",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzqtrbx",
                  "author": "Ok-Werewolf-3959",
                  "text": "Cuz it has so much fonctionnalities. Reading, listening, spelling exercices. Lessons are structured and have loads of puzzles to train on the same duolingo uses. On top of that you have mini games and a multiplayer mode with ranked for challengers. Final touch you have a training page to train your vocabulary & conjugation. So basically its a Duolingo X Quizzlet X VideoGame (+ you can buy 1-1 lessons.)",
                  "score": 1,
                  "created_utc": "2026-01-15 15:43:05",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzl212p",
          "author": "Novel-Notions",
          "text": "I’m building a TikTok influencer training program to support brands. It’s a grind working at home and making incremental gains. It would be cool to have a monthly mastermind with other founders",
          "score": 2,
          "created_utc": "2026-01-14 18:33:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzlfkzx",
              "author": "Tamale_Jale",
              "text": "you should check out my little tiktok tool. havent really released yet but i dont do much with socials.... My kid gave me the idea so i built something. if you wanna check it out let me know and ill send the link over, nothing to buy, just looking to see if its something that might work.",
              "score": 1,
              "created_utc": "2026-01-14 19:33:47",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nzm889m",
              "author": "opeyemisanusi",
              "text": "let's connect",
              "score": 1,
              "created_utc": "2026-01-14 21:43:36",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzmgpni",
          "author": "thijsgh",
          "text": "Create content, post everywhere: [socialrails.com](https://socialrails.com)",
          "score": 2,
          "created_utc": "2026-01-14 22:22:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzog14d",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 2,
          "created_utc": "2026-01-15 05:16:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzoybos",
          "author": "Glittering-Item1058",
          "text": "I built SpielWave. It's basically short audio opinions you can listen.\n\nNo essays. No video. Just voice takes.\n\nHow it works:\n\nPress play, listen to takes\nSkip the boring ones\nTap Agree/Disagree if you vibe with it\nReply with your own voice if you want\n\nYou don't need to sign up just to listen, only if you want to respond.\n\nFull transparency: this is SUPER early.\n\nOnly 3 categories right now (Gaming, Entertainment, Education)\nJust a few sample takes to show how it works\nStill figuring out the right features and audience fit\n\nI'm really just testing if the \"listen to opinions in audio form\" concept even makes sense to people. Would love any honest feedback, what works, what doesn't, would you actually use this?\n\nWebsite: spielwave.com\nAnonymous feedback: https://forms.gle/tThpmj6GCgpfmbDZ9\n\nThanks for checking it out!",
          "score": 2,
          "created_utc": "2026-01-15 07:49:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzwcp6z",
              "author": "skil444",
              "text": "That’s a really great idea. I‘m excited to see what the futures is for this project",
              "score": 2,
              "created_utc": "2026-01-16 10:41:48",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzm8y1b",
          "author": "PenCheap2773",
          "text": "I’m making cars safer with a plug and play add on that upgrades used cars with a 5 minute install. Turns them into hands free drivers that stop for pedestrians, keep center in lanes, and adjust speed automatically. \n\nFeatures that exist in newer cars but now can be added to your 2010 and newer. \n\nBiggest challenge is that we sell exclusively to car dealerships. So I’m doing a lot of door to door sales and it’s a numbers game. So if anyone know car dealers HMU\n\nAlso happy to give advice to other founders. Been involved in many startups so I’ve learned how to clarify, test, and build businesses",
          "score": 3,
          "created_utc": "2026-01-14 21:46:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzmcu9y",
          "author": "Walfy07",
          "text": "[Wessford Industries](http://wessford-ind.com)\n\ncool stuff i wish others built",
          "score": 1,
          "created_utc": "2026-01-14 22:04:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzmmmp5",
          "author": "Fragrant_Brush_4161",
          "text": "Many B2B sales teams lose track of which prospects revisit their website after outreach. Sale is a multi step process, not just a single promo.\n\nSo, what I currently work on helps to identify known visitors, track campaign sources, and highlight high-intent activity. This way sales know exactly when to follow up or how much effort has to be put in to get a client in this part of the funnel.\n\nI am looking for users who would be willing to test the system and give feedback. Let me know if this problem resonates with you!",
          "score": 1,
          "created_utc": "2026-01-14 22:51:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzmzvj5",
          "author": "JaySocials671",
          "text": "My crew and I create AI YouTube automations for long form and ultra long form (min 2 hour) content. We are open for commissions.",
          "score": 1,
          "created_utc": "2026-01-15 00:01:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nznkj7o",
          "author": "mitchrichie",
          "text": "I’ve worked in video production for 30 years and got sick and tired of the process of finding footage or sound bites in interviews. I built a desktop app that auto transcribes your raw footage and makes it visually searchable. It has a Claude integration so you can ask Claude to “go find all the best sound bites across these interviews where they talk about XYZ.” It will collect all the relevant clips and with one click send them to your editing software timeline ready to go. \n\n[Vindexr](https://www.vindexr.com)",
          "score": 1,
          "created_utc": "2026-01-15 01:57:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzo5x0b",
          "author": "Live-Lab3271",
          "text": "[InfraSketch's](https://www.infrasketch.net/) AI agent turns your ideas into architecture diagrams. Chat to iterate, ask questions, and refine. Then export a design doc and start building.",
          "score": 1,
          "created_utc": "2026-01-15 04:06:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzou6cd",
          "author": "th3phantom",
          "text": "I’m working on https://kontenai.net, a platform designed to help business owners with social media marketing especially for TikTok and Instagram. \n\nIt enables users to easily create AI-generated videos and marketing assets for ads, promotions, or casual posts, helping them drive more sales, generate leads, and attract new clients. \n\nThe platform also addresses a common challenge for small business owners: consistently creating and distributing content across social channels.\n\nYou guys can check it out and share your feedback, and feel free to DM me if you’d like some free credits for testing.",
          "score": 1,
          "created_utc": "2026-01-15 07:11:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzp69w9",
          "author": "JiProchazka",
          "text": "I'm building an iOS app (just before the release in a week or two) for learning a vocabulary.  \nUsers insert their own content, it is optimized for UNI language students or adults.  \nI'm basically building it for myself (as I have 20+ years of experience in studying languages) and if will some other people find it useful, good.\n\n[https://www.fluentwords.app/](https://www.fluentwords.app/)",
          "score": 1,
          "created_utc": "2026-01-15 09:05:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzpiqvg",
          "author": "amacg",
          "text": "Built a community where makers can share what they’re building and get fair visibility. Here's the link: [https://trylaunch.ai](https://trylaunch.ai/)",
          "score": 1,
          "created_utc": "2026-01-15 11:03:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzwdgo5",
              "author": "skil444",
              "text": "Looks great but I can’t click on any of the projects. The screen just turns black. At least on mobile…",
              "score": 2,
              "created_utc": "2026-01-16 10:48:19",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzwzb3m",
                  "author": "amacg",
                  "text": "Thanks will investigate!",
                  "score": 1,
                  "created_utc": "2026-01-16 13:23:35",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzvng2z",
          "author": "StarskyAndHutch",
          "text": "Cool post! I’m building MopBucket.com… challenge right now is marketing.",
          "score": 1,
          "created_utc": "2026-01-16 06:54:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzw8gzd",
          "author": "StopTheCapA1",
          "text": "I’m developing a complex methodology of building safe and secure AI. \nIf someone here interested in co-founding and has technical expertise in cybersecurity, I will be happy to connect.",
          "score": 1,
          "created_utc": "2026-01-16 10:03:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzwgjo4",
          "author": "Novel-Notions",
          "text": "I would like to see it. Can you message me please?",
          "score": 1,
          "created_utc": "2026-01-16 11:14:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o094xlj",
          "author": "Wet_Assistance",
          "text": "Hey there! \n\nI'm building [unitask.app](http://unitask.app), a tool I use to get focused work done. I made it for myself, then decided to share it with people who want to do deep work, or just get work done. \n\nSo far, its fully functional - easily capture tasks with nlp (like todoist does), focus on 1 task at a time while you work, then repeat.\n\nLooking for beta testers who'll actually benefit from Unitask. Ideally, people for whom focused work is valuable.",
          "score": 1,
          "created_utc": "2026-01-18 07:13:27",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qavo8i",
      "title": "From 0 to 100 Clients in 90 days : how I siphon traffic from LinkedIn 'Engagement Farms' to fill my pipeline.",
      "subreddit": "Startup_Ideas",
      "url": "https://www.reddit.com/r/Startup_Ideas/comments/1qavo8i/from_0_to_100_clients_in_90_days_how_i_siphon/",
      "author": "Ecstatic-Tough6503",
      "created_utc": "2026-01-12 14:01:57",
      "score": 43,
      "num_comments": 5,
      "upvote_ratio": 0.89,
      "text": "Most people hate \"Engagement Farming\" posts (where creators ask you to comment to get a resource).\n\nI love them. They are a free database of high-intent leads.\n\nHere is the \"Hijack Strategy\" I use to fill my pipeline:\n\nStep 1: Search for a viral post in your niche offering a PDF or a guide. Look for the authors who are ghosting their comments. If they aren't replying, that’s your opportunity.\n\nStep 2: Extract the list of everyone who commented. These people have a problem and are actively begging for a solution. You can do this with [this tool](https://gojiberry.ai).\n\nStep 3: Send them a LinkedIn message and an email saying: “I saw you commented on a post to receive a resource about (topic). Did you get it?”\n\n9 times out of 10, they will say \"No.\" You reply: \"Figured. I actually have a similar resource that covers \\[Topic\\]. Want me to send it over? No strings attached.\"\n\nThey’ll say yes, and then you simply send them your own guide.\n\nI started doing this a few days ago and I’ve never seen better results in cold outreach.\n\nI’ve never seen a cold outreach campaign perform this well.\n\nGood luck, and go get them!",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Startup_Ideas/comments/1qavo8i/from_0_to_100_clients_in_90_days_how_i_siphon/",
      "domain": "self.Startup_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "nzax7yo",
          "author": "Livid_Principle2541",
          "text": "This makes so much sense! Just wanted to know i have seen mostly all engagement farms are connected to an automated reply sequences. \nSo dont many people use that thus reducing the success of this technique?",
          "score": 2,
          "created_utc": "2026-01-13 05:17:11",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qb2uzt",
      "title": "Pitch your startup idea in 10 words or less. Let’s self promote!",
      "subreddit": "Startup_Ideas",
      "url": "https://www.reddit.com/r/Startup_Ideas/comments/1qb2uzt/pitch_your_startup_idea_in_10_words_or_less_lets/",
      "author": "kcfounders",
      "created_utc": "2026-01-12 18:28:29",
      "score": 42,
      "num_comments": 154,
      "upvote_ratio": 0.94,
      "text": "I work at [Forum Ventures](https://www.forumvc.com); we’re a B2B SaaS accelerator run by former founders. We write $100K VC cheques to idea and pre-revenue stage startups, and introduce founders to Fortune 500 customers.\n\nLet's hear your startup ideas in 10 words or less. When we help our founders fundraise, one of the biggest lessons we advocate for is being able to explain your idea in 1 minute. As one of many pitches every VC is getting every day, clarity, simplicity, and conciseness is often the difference maker. Don't forget to include a link too!\n\nWe’ll make this a thread of partnership and mutual support.\n\nAs a founder first accelerator, our team at Forum is happy to chat if you’re building something early-stage.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Startup_Ideas/comments/1qb2uzt/pitch_your_startup_idea_in_10_words_or_less_lets/",
      "domain": "self.Startup_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "nz82ddr",
          "author": "kiwiinNY",
          "text": "Circlejerk.io\n\nHelps circle jerkers to circle jerk more effectively",
          "score": 10,
          "created_utc": "2026-01-12 20:12:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzat9yg",
              "author": "Due-Brush-530",
              "text": "The \"io\" stands for 'infinite fallatio'",
              "score": 3,
              "created_utc": "2026-01-13 04:49:58",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nz7hxxn",
          "author": "Chunkyfungus123",
          "text": "[https://drosk.net](https://drosk.net) \\- Your digital folders deserve better than chaos. Organize them automatically.",
          "score": 6,
          "created_utc": "2026-01-12 18:39:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "nz7oj3s",
              "author": "kcfounders",
              "text": "Cool! What's the business model and pricing?",
              "score": 3,
              "created_utc": "2026-01-12 19:08:25",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nz7pr94",
                  "author": "Chunkyfungus123",
                  "text": "Currently it is in beta testing so everything is free and just having a donation based model. Once Drosk enters public test, we will shift towards a freemium model for advanced operations (ie cloud, ai, etc.). However, in terms of specific pricing, I have not yet charted that part yet as well.",
                  "score": 3,
                  "created_utc": "2026-01-12 19:14:03",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nzat27f",
              "author": "Due-Brush-530",
              "text": "Damn, I tried to sign up but I don't use discord. So I'm out.",
              "score": 1,
              "created_utc": "2026-01-13 04:48:32",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzd53p3",
                  "author": "TheSoupCups",
                  "text": "I mean, who does?\n\nIf i dont see Google sign up, im out.",
                  "score": 1,
                  "created_utc": "2026-01-13 15:18:01",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nzdgs53",
                  "author": "Chunkyfungus123",
                  "text": "hi! thanks for letting me know, I have actually just updated the registration to allow for default email signups without Discord. if you are still interested our registration form was just updated on our official website! :D",
                  "score": 1,
                  "created_utc": "2026-01-13 16:12:32",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nz803wc",
          "author": "Devgranil",
          "text": "[Rantup](https://rantup.io) turning everyday frustrations into startup ideas",
          "score": 3,
          "created_utc": "2026-01-12 20:01:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz9a6un",
          "author": "kevinxrp19",
          "text": "a community for startup validation, waitlist & idea discovery - [waitjoin.com](http://waitjoin.com) ",
          "score": 3,
          "created_utc": "2026-01-12 23:45:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzb0vg1",
          "author": "dreamjobloser1",
          "text": "https://www.smock.app\n\nIf cursor, Google Docs, and obsidian had a three way",
          "score": 3,
          "created_utc": "2026-01-13 05:44:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzb340p",
          "author": "amacg",
          "text": "Built a community where makers can share what they’re building and get fair visibility. Here's the link: [https://trylaunch.ai](https://trylaunch.ai/)",
          "score": 3,
          "created_utc": "2026-01-13 06:01:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz7rweh",
          "author": "Live-Lab3271",
          "text": "[InfraSketch's](https://www.infrasketch.net/) AI agent turns your ideas into architecture diagrams. Chat to iterate, ask questions, and refine. Then export a design doc and start building.",
          "score": 2,
          "created_utc": "2026-01-12 19:23:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzatczq",
              "author": "Due-Brush-530",
              "text": "Many people working on something like this.",
              "score": 0,
              "created_utc": "2026-01-13 04:50:31",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzawaqn",
                  "author": "Live-Lab3271",
                  "text": "Did you try mine? It’s better",
                  "score": 0,
                  "created_utc": "2026-01-13 05:10:39",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nz7svgp",
          "author": "Walfy07",
          "text": "[Wessford](http://wessford-ind.com)",
          "score": 2,
          "created_utc": "2026-01-12 19:28:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz81oxb",
          "author": "Impressive-Emu-3375",
          "text": "[HTML Email Builder](https://html-emailbuilder.vercel.app/)  for Saas teams to create transactional email templates for their products. Please try and share your feedback",
          "score": 2,
          "created_utc": "2026-01-12 20:09:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz8crjr",
          "author": "Starlyns",
          "text": "Hmm how can I get ideas? Ah let me write this post ppl wiñl share theirs",
          "score": 2,
          "created_utc": "2026-01-12 21:01:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzatmc8",
              "author": "Due-Brush-530",
              "text": "That's an interesting perspective that I didn't consider. But the work involved in something like that would be painful.",
              "score": 1,
              "created_utc": "2026-01-13 04:52:15",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzavfxi",
                  "author": "ghoztfrog",
                  "text": "This user posts these across multiple startup subs constantly and I rarely ever see them reply to anyone.",
                  "score": 1,
                  "created_utc": "2026-01-13 05:04:38",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nz8f5g5",
          "author": "o_Oleh",
          "text": "I'm building [shaflex.com](http://shaflex.com/) \\- a simple, flow-first app for cross-platform social media publishing.   \nNo cluttered dashboards, just publish.",
          "score": 2,
          "created_utc": "2026-01-12 21:12:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz8o3a4",
          "author": "Bulky_Connection8608",
          "text": "I’m building [OraxAI](https://oraxai-production.up.railway.app/) to stop the \"1 resume for 100 jobs\" approach by tailoring your CV for every role in under a minute.",
          "score": 2,
          "created_utc": "2026-01-12 21:53:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzh3i6z",
              "author": "ZeraPain",
              "text": "How much you made with it already?",
              "score": 1,
              "created_utc": "2026-01-14 03:09:25",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nz96ofy",
          "author": "CheekyFinder",
          "text": "[https://skyfernai.com](https://skyfernai.com) Make smarter product decisions faster by turning user interviews and UX research into clear insights.",
          "score": 2,
          "created_utc": "2026-01-12 23:26:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzb5kha",
          "author": "teskabudaletina",
          "text": "Hardcore AI sexting telegram chatbot. I personally fine tuned LLM",
          "score": 2,
          "created_utc": "2026-01-13 06:21:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzc2n7f",
          "author": "Quiet_Drummer669988",
          "text": "A headless, offline-first inventory system for long-term preparedness. Manage calories, water, and locations via a local web interface. No cloud. No tracking. Just a binary.\n\n\nhttps://sustenance.manifest-software.co.nz/",
          "score": 2,
          "created_utc": "2026-01-13 11:25:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzc2rjq",
              "author": "Quiet_Drummer669988",
              "text": "The first app in a suite of preparedness offline software. ",
              "score": 2,
              "created_utc": "2026-01-13 11:26:35",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzorx96",
          "author": "Moststartupsarescams",
          "text": "https://diploi.com - the hosting and development platform for people building and managing many applications at the same time",
          "score": 2,
          "created_utc": "2026-01-15 06:52:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz7l43s",
          "author": "altered_states44",
          "text": "www.nadie.in worlds first chronobiology based ayurvedic supplement",
          "score": 3,
          "created_utc": "2026-01-12 18:53:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "nz7q7a8",
              "author": "Anonymous03275",
              "text": "Hey how did u do the waitlisting, can u share the technical implementation?",
              "score": 3,
              "created_utc": "2026-01-12 19:16:04",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzavrcz",
                  "author": "altered_states44",
                  "text": "I am using a service called formspree to forward the user mails to my personal mails, it’s pretty straightforward",
                  "score": 1,
                  "created_utc": "2026-01-13 05:06:52",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nz8byi2",
          "author": "Electrical_Bad2253",
          "text": "Modern management for small flight schools.  \nVery early days.",
          "score": 1,
          "created_utc": "2026-01-12 20:57:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz8dbyr",
          "author": "zak_fuzzelogic",
          "text": "Vibe coder that does it right",
          "score": 1,
          "created_utc": "2026-01-12 21:04:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz8q9tu",
          "author": "11KingMaurice11",
          "text": "[GoPublish.me](https://gopublish.me) - Content Creator Idea Development, organization and management platform.",
          "score": 1,
          "created_utc": "2026-01-12 22:04:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz9i9h5",
          "author": "Fragrant_Brush_4161",
          "text": "Many B2B sales teams lose track of which prospects revisit their website after outreach. Sale is a multi step process, not just a single promo.\n\nSo, what I currently work on helps to identify known visitors, track campaign sources, and highlight high-intent activity. This way sales know exactly when to follow up or how much effort has to be put in to get a client in this part of the funnel.\n\nI am looking for users who would be willing to test the system and give feedback. Let me know if this problem resonates with you!",
          "score": 1,
          "created_utc": "2026-01-13 00:28:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz9v9jz",
          "author": "missEves",
          "text": "[playmix.ai](https://playmix.ai/) \\- vibe create games 🎮",
          "score": 1,
          "created_utc": "2026-01-13 01:39:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz9vae1",
          "author": "missEves",
          "text": "[playmix](https://playmix.ai/animate) \\- create animated game sprites w/ ai 🏃‍♀️",
          "score": 1,
          "created_utc": "2026-01-13 01:39:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nza39d8",
          "author": "idodev1369",
          "text": "Distributed, intelligent, contextually aware Composable Enterprise capability platform, ecosystem / marketplace",
          "score": 1,
          "created_utc": "2026-01-13 02:22:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nza6hi7",
          "author": "kennetheops",
          "text": "https://opscompanion.ai/  is an agentic infrastructure platform that keeps a live map of what’s running and how it connects. It tells you what changed, what it impacts, and what to do next before you deploy.",
          "score": 1,
          "created_utc": "2026-01-13 02:39:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzb1hkc",
          "author": "AsesinoYT",
          "text": "Well I'm not b2b but have Fintech startup idea that we wanna start. Can I pitch too?",
          "score": 1,
          "created_utc": "2026-01-13 05:48:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzbc0zs",
          "author": "Latter_Soil_9806",
          "text": "https://stylesgo.vercel.app/booking\n\nStylesGo - uber for mobile barber services. We have a network of licensed barbers and they come to you for service. Currently growing service in SF and DC metro areas.",
          "score": 1,
          "created_utc": "2026-01-13 07:17:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzbgl65",
          "author": "ScreenClub",
          "text": "[ScreenClub](https://apps.apple.com/us/app/screenclub/id6456572694) like Letterboxd but more social and can rate tv series.",
          "score": 1,
          "created_utc": "2026-01-13 07:59:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzbnljo",
          "author": "Kejbs",
          "text": "[Huddlekit](https://huddlekit.com) — Collect and act on client feedback for websites and creative assets",
          "score": 1,
          "created_utc": "2026-01-13 09:06:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzbtp9d",
          "author": "thijsgh",
          "text": "Create content, post everywhere: [socialrails.com](https://socialrails.com)",
          "score": 1,
          "created_utc": "2026-01-13 10:05:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzbz7mz",
          "author": "Actual-Donut-",
          "text": "[Tradey](https://tradeyhq.com/) \\- it's a job management app for busy tradespeople (electricians, plumbers, carpenters etc).",
          "score": 1,
          "created_utc": "2026-01-13 10:55:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzcaafp",
          "author": "TopTransportation516",
          "text": "Idea validation platform: www.holyshift.ai",
          "score": 1,
          "created_utc": "2026-01-13 12:25:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzda46y",
          "author": "Wooden-Tumbleweed-82",
          "text": "[Alemia.ai](https://www.alemia.ai) \\- AI Data Analyst, you can upload you csv or excel file and in one click generate charts, insights, and ask questions about data. All elements have check box which you can check and add that element to the report which you can share with link or with email.\n\n[https://www.alemia.ai](https://www.alemia.ai)",
          "score": 1,
          "created_utc": "2026-01-13 15:41:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzed0li",
          "author": "fazkan",
          "text": "Radio on the Internet",
          "score": 1,
          "created_utc": "2026-01-13 18:49:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzemk1s",
          "author": "Anub_Rekhan",
          "text": "[insidercat.com](http://insidercat.com) \\- exclusive insights on [politician/insider stock trading](https://www.reddit.com/r/dataisbeautiful/comments/1q7cfk3/oc_senator_tina_smith_ranks_1_in_congress_by/). [Check out Trump](https://www.reddit.com/r/ItaliaPersonalFinance/comments/1qavfr3/il_portafoglio_azionario_di_donald_trump/)\n\nWe went live December last year, made $2.1k profits thanks mostly to bulk data & API sales.",
          "score": 1,
          "created_utc": "2026-01-13 19:32:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzf93wi",
          "author": "AboboMutombo",
          "text": "ComixCatalog - Discogs for comic books. Marketplace and Database for ALL comics.\n\nCome check us out! [https://comixcatalog-beta.vercel.app/](https://comixcatalog-beta.vercel.app/)",
          "score": 1,
          "created_utc": "2026-01-13 21:18:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzf9wtk",
          "author": "Fiskerik",
          "text": "[Bailout](https://bailout.lovable.app) \n\nGet out of awkward situations by *scheduling a real call to your phone with AI*\n\n—-\n\n[Vertical Rickroll](https://vertical-rickroll.lovable.app)\n\n*Hide memes and customised texts in any kind of text without losing context*.",
          "score": 1,
          "created_utc": "2026-01-13 21:21:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzfpu88",
          "author": "Ok_Veterinarian446",
          "text": "https://websiteaiscore.com/ - solves the actual problems of modern web in terms of AI visibility.",
          "score": 1,
          "created_utc": "2026-01-13 22:36:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzin3li",
          "author": "adeelimranr",
          "text": "https://fitcomrade.com helping online fitness coaches create unlimited reusable workout plans for unlimited clients.",
          "score": 1,
          "created_utc": "2026-01-14 10:40:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzlbdpy",
          "author": "Tamale_Jale",
          "text": "[offercraftai.com](http://offercraftai.com) \\- AI that writes negotiation offers real estate agents actually close.",
          "score": 1,
          "created_utc": "2026-01-14 19:14:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzlugbe",
          "author": "anchit_rana",
          "text": "https://phantomx.dev - coding AI agent for teams, create shared workspaces having shared prompts and secrets keys and configs across teams. Setup once and start unlimited background tasks! We provide an in browser IDE for working with the agent if you prefer that. Agent runs in sandbox environment, can use browser tools too! And giving a free trial of 14 days!",
          "score": 1,
          "created_utc": "2026-01-14 20:41:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzlul7n",
          "author": "Murky-Ad-547",
          "text": "[PickleScoreVideo.com](http://PickleScoreVideo.com) \\- Add a score board on your Pickleball video. Video editing skills are not needed!",
          "score": 1,
          "created_utc": "2026-01-14 20:42:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzmh4i6",
          "author": "Feeling-District-160",
          "text": "They offer no feedback if rejected which isn't helpful",
          "score": 1,
          "created_utc": "2026-01-14 22:24:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzqw216",
          "author": "aiv_paul",
          "text": "[https://aivory.net/architect](https://aivory.net/architect) \\- Your visual control plane for AI-generated infrastructure.",
          "score": 1,
          "created_utc": "2026-01-15 15:53:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzr87hf",
          "author": "Firm-Yogurtcloset528",
          "text": "A social media network without bots",
          "score": 1,
          "created_utc": "2026-01-15 16:48:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzsntf2",
          "author": "programad",
          "text": "[tarantillo.com](http://tarantillo.com)  A platform for generating slide videos.",
          "score": 1,
          "created_utc": "2026-01-15 20:41:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzui8bt",
          "author": "zintaen",
          "text": "I’m building AI accent training webapp - regional focus (British first)",
          "score": 1,
          "created_utc": "2026-01-16 02:24:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzwvy5j",
          "author": "Makemoremusicbro",
          "text": "https://wearboco.com/ Lingerie designed for comfort, worn by baddies 🍒",
          "score": 1,
          "created_utc": "2026-01-16 13:03:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzx5l7g",
          "author": "beakshay",
          "text": "Remote patient monitoring",
          "score": 1,
          "created_utc": "2026-01-16 13:57:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzzbqmp",
          "author": "realViewTv",
          "text": "Real View: Virtual Window - think Netflix for amazing live streamed views. Search Real View on Google Play TV and Amazon Firestick App Store. Samsung and LG in review.",
          "score": 1,
          "created_utc": "2026-01-16 19:53:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o04gcpz",
          "author": "No_Yesterday5746",
          "text": "[https://lynqqbeta.lovable.app](https://lynqqbeta.lovable.app) Lynq matches AI-tech founders and builders via swipes, forming teams.",
          "score": 1,
          "created_utc": "2026-01-17 15:58:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz7vp02",
          "author": "greyzor7",
          "text": "Launch your startup, reach 30k+ makers, get users & customers - [microlaunch.net/premium](http://microlaunch.net/premium)",
          "score": 1,
          "created_utc": "2026-01-12 19:41:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzathcr",
              "author": "Due-Brush-530",
              "text": "This seems like spam",
              "score": 1,
              "created_utc": "2026-01-13 04:51:20",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qfl8t3",
      "title": "I studied 47 SaaS products that went from 0 to 10k MRR last year. Here's what they all did right.",
      "subreddit": "Startup_Ideas",
      "url": "https://www.reddit.com/r/Startup_Ideas/comments/1qfl8t3/i_studied_47_saas_products_that_went_from_0_to/",
      "author": "whyismail",
      "created_utc": "2026-01-17 18:44:08",
      "score": 32,
      "num_comments": 7,
      "upvote_ratio": 0.82,
      "text": "Hey, I went into SaaS last year with my tool Brandled (helps founders grow on X & LinkedIn) in a pretty competitive space with $0 and 0 audience and ended up wasting six months straight on the wrong things.\n\nSpent half a year stuck at $0 MRR.\n\nThen I became obsessed with one question: what separates SaaS products that make it from those that die at zero.\n\nSo I went down a rabbit hole. Studied 47 founders who went from $0 to $10k+ MRR in the last year. Watched their podcasts, red their tweets, and everything i could get my hands on.\n\nHere's what I learned from all of them, and what I was doing catastrophically wrong.\n\n**1. Frictionless signup isn't optional**\n\nEvery successful product had one-click social login. Google OAuth mostly.\n\nThe ones that died had email verification flows, password requirements, multi-step forms asking questions before showing any value.\n\nThe math is brutal. If you lose 30% of people at signup and you're getting 1000 visitors a month, that's 300 potential customers gone. At a 10% trial-to-paid conversion, that's 30 paying customers per month lost to signup friction alone.\n\nI started with magic link only. Completion rate was 45%. Added Google login. Jumped to 78% the next day.\n\nEvery percentage point of friction at signup costs you real revenue. Most founders don't even measure this.\n\n**2. They launched in weeks, not months**\n\nNone of them spent 6 months building in secret.\n\nAverage time from idea to first paying customer: 3-6 weeks. They launched with ONE core feature. Then spent most of their time marketing it.\n\nI did the opposite. Spent 3 months building features before launching. Content generation, analytics, scheduling, competitor tracking, everything. Got 12 signups. Zero paying customers.\n\nConvinced myself the product wasn't good enough. Spent another month adding features. Still nothing.\n\nThe problem wasn't my product. Nobody knew it existed.\n\nAfter I stopped building and started marketing, posting on Reddit, doing LinkedIn outreach, documenting on X, I hit $126 MRR in 4 days.\n\nSame product. Different approach.\n\nPost-launch is 90% marketing, 10% product.\n\n**3. They were shameless about promotion**\n\nThe successful ones talked about their product everywhere. Not spammy. Just never hiding it.\n\nReddit threads. Twitter replies. Forum comments. Anywhere their audience hung out.\n\nThey'd give genuinely helpful advice first, then naturally mention their tool when relevant.\n\nStarted being shameless. Every relevant conversation where someone complained about the problem I solved, I'd help them first, then mention I built something for this.\n\nA few people definitely get mad but I feel the upside is worth it.\n\nYour product won't discover itself.\n\n**4. They asked churned users what went wrong**\n\nEvery successful product had a system for this. Automated email going out when someone cancels asking what didn't work.\n\nI was doing none of this. Saw cancellations in Stripe, felt rejected, moved on. Never asked why. Never learned anything.\n\nNow every cancelled user gets emails through and automated email sequence and the replies are done by me personally.\n\nResponse rate is 40%. The feedback is literally gold.\n\nEvery single one is fixable. But I only learned because I asked.\n\nChurned users tell you the real truth about your product.\n\n**5. They used their own product religiously**\n\nNot one successful founder was building something they didn't use daily. They were their own heaviest users.\n\nI wasn't doing this. Used my tool occasionally to \"test\" but wasn't relying on it daily.\n\nForced myself to create all my content through my own product for a week. Found 7 bugs in 30 minutes that never showed up in testing.\n\nGenerate button didn't work on mobile. Analytics took 8 seconds to load. Onboarding skipped steps if you refreshed.\n\nMy users were experiencing this and not telling me. They were just leaving.\n\nIf you're not using your product daily as a real user, you're building blind.\n\n**6. They fixed retention before scaling acquisition**\n\nBiggest strategic difference.\n\nFailed products: 30-50% monthly churn, constantly chasing new users to replace ones leaving.\n\nSuccessful products: Fixed retention first, got churn to 10-20%, then scaled acquisition.\n\nThe math: At 40% churn, you acquire 40 customers to net 24. At 15% churn, you acquire 40 and net 34. Same effort, 42% better results.\n\nI was obsessed with new signups. Ignored my 40% churn rate. Got 10 new customers, lost 4. Net: 6.\n\nStopped all acquisition. Fixed onboarding from 8 steps to 3. Added email sequences. Built features retained users asked for. Churn dropped to 15%.\n\nSame acquisition effort, now net 8-9 customers instead of 6.\n\nRetention is the foundation. Acquisition is the multiplier.\n\n**7. They shipped MVPs with one feature**\n\nEvery successful product launched stupidly lean. One core feature done exceptionally well.\n\nI launched with 7 features: content generation, analytics, scheduling, competitor tracking, SWOT, comments, hashtags.\n\nCodebase was a nightmare. Users were confused. I was maintaining features 3% of users touched.\n\nShould've launched with one thing: AI content that sounds human. Made that 10x better. Everything else later based on what paying customers asked for.\n\nYour MVP should make people say \"this solves my exact problem\" even if ugly and missing features.\n\nNot \"wow, so many features\" while solving nothing particularly well.\n\n**8. They priced based on value, not competition**\n\nNone of them raced to the bottom on pricing.\n\nThey looked at the value delivered. Hours saved. Revenue generated. Pain eliminated.\n\nThen priced a fraction of that value.\n\nI priced at $19/month because competitors were at $29-39. Thought I'd win on price. Just looked cheap and inferior.\n\nNeeded 263 customers to hit $5k MRR at $19 versus only 128 at $39.\n\nRaised price to $29-39. Conversions didn't drop. They improved slightly.\n\nHigher price signaled solving a valuable problem.\n\nPeople who care about $10 differences aren't your best customers. They'll churn for anything $3 cheaper.\n\n**9. They automated relationship building**\n\nEvery successful product had email sequences from day one. Not promotional. Actual value and engagement.\n\nWelcome emails. Feature education. Check-ins. Re-engagement for quiet users. Win-back for churned users.\n\nI was sending nothing after signup. Users signed up, got busy, forgot, churned.\n\nEngagement doesn't happen by accident. You engineer it.\n\n**10. They validated with money, not words**\n\nThe problem with feedback: it's free. People say nice things because it costs them nothing.\n\nI built features based on \"that would be helpful\" comments from users who weren't even paying. Wasted weeks on features nobody used.\n\nNow I only build what paying customers explicitly request.\n\nMoney is the only validation that matters. Words are cheap. Credit card numbers are truth.\n\n**The one thing they all had**\n\nThey didn't quit when it felt hopeless.\n\nThey all hit $0 for months. Got depressed. Questioned everything. Wanted to shut it down.\n\nBut didn't.\n\nThe difference between $0 and success wasn't talent or luck. It was not quitting before they figured out what works.\n\n90% of SaaS products die not because they couldn't work. Because the founder quit too early.\n\nIf you're stuck at $0, study the people who've made it. Not the outliers. The normal founders who went from $0 to $10k.\n\nThey're not special. They just did specific things that compound and didn't quit when it got hard.\n\nThe playbook is right there. You just have to execute it.\n\nHappy to answer questions or go deeper on any of this.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Startup_Ideas/comments/1qfl8t3/i_studied_47_saas_products_that_went_from_0_to/",
      "domain": "self.Startup_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o09c4vp",
          "author": "kubrador",
          "text": "47 = claude wrote this",
          "score": 1,
          "created_utc": "2026-01-18 08:18:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o06467k",
          "author": "macromind",
          "text": "The \"shameless about promotion\" part is real, but the key is exactly what you said, be helpful first, then mention what you built only when its a clean fit.\n\nOne thing I would add: having 2-3 repeatable distribution channels you can do every week (ex: partner integrations, SEO topic clusters, or one community where you consistently show up) beats random one-off posts.\n\nFor anyone looking for more SaaS marketing tactics like this, https://www.reddit.com/r/Promarkia/ is worth a browse.",
          "score": 1,
          "created_utc": "2026-01-17 20:42:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o05gubn",
          "author": "macromind",
          "text": "Really good writeup. The \"launched in weeks, not months\" point is the one I keep re-learning, shipping fast forces you to market fast.\n\nCurious, when you say you got traction from Reddit + LinkedIn outreach, what was the first offer that actually got replies (free trial, demo, audit, etc.)?\n\nAlso, if youre collecting more notes on SaaS marketing execution and what actually moves MRR, https://www.reddit.com/r/Promarkia/ might be a useful place to cross-post ideas.",
          "score": 0,
          "created_utc": "2026-01-17 18:48:22",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qe2a95",
      "title": "I want to network",
      "subreddit": "Startup_Ideas",
      "url": "https://www.reddit.com/r/Startup_Ideas/comments/1qe2a95/i_want_to_network/",
      "author": "Disastrous-Jump2058",
      "created_utc": "2026-01-16 01:26:53",
      "score": 24,
      "num_comments": 26,
      "upvote_ratio": 1.0,
      "text": "I am looking to connect with people who are interested in tech, especially in building SaaS products.\n\nI’m a self-taught full-stack developer with several years of industry experience.\n\nRight now, I’m focused on creating small, fast-to-build micro-SaaS projects that generate consistent MRR, allowing me to dedicate more time to bigger ideas.\n\nI’m strong on the technical side, but UI/UX design and marketing and getting investments are not my strengths, so I’m looking for people who excel in any of those areas.\n\nAlso if you are also someone who can bring funds, investments and clients, users that would be interesting.\n\nIdeally, I’d like to form a small team and build and launch SaaS nee projects together.\n\nI’m not selling anything and just hoping to connect with like-minded people who want to build together.\n\nIf this sounds interesting, feel free to reach out with comments or dm.\n\nI am ok with equity split or smaller equity with a minimal payment.\n\nBy the way, I also manage and participate a business group with about 6 members.\n\nFeel free to dm if anyone interested in joining the group. By the way, we might turn it to a business association as well in the future. If you can help with that, feel free to dm.\n\nPlease don't comment dm you because sometimes notifications don't arrive or can't read because of this app not working well for whatever reason.\n\nI also have my own company set up and have a few projects working.\n\nIf you have anything interesting you can offer, feel free to dm to network.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Startup_Ideas/comments/1qe2a95/i_want_to_network/",
      "domain": "self.Startup_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "nzulc1s",
          "author": "No_Ad_5933",
          "text": "Hey we are from Sri Lanka\nA team of 3 incuding a senior dev and two junior devs.",
          "score": 3,
          "created_utc": "2026-01-16 02:41:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzvta2f",
              "author": "Disastrous-Jump2058",
              "text": "lets connnect",
              "score": 1,
              "created_utc": "2026-01-16 07:44:10",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzxldj6",
          "author": "Annimios",
          "text": "Hello I'm here too",
          "score": 3,
          "created_utc": "2026-01-16 15:16:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzymmvh",
          "author": "Immature-Coder",
          "text": "Hey buddy",
          "score": 2,
          "created_utc": "2026-01-16 18:00:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzywaxi",
          "author": "Moming_Next",
          "text": "With that much workforce, I guess that there's something, I can help you with. I've got people that have some issues to solve, that could probably make you start a step ahead. Let me send you this in DM. :)",
          "score": 2,
          "created_utc": "2026-01-16 18:43:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o01meyt",
          "author": "meeeep_xo",
          "text": "Hey! I’m a UX and visual designer. Will DM!",
          "score": 1,
          "created_utc": "2026-01-17 03:24:13",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qcpvb6",
      "title": "The startup resource that got us to 800 organic visitors before we hit product-market fit (timing strategy)",
      "subreddit": "Startup_Ideas",
      "url": "https://www.reddit.com/r/Startup_Ideas/comments/1qcpvb6/the_startup_resource_that_got_us_to_800_organic/",
      "author": "Mel_Ran",
      "created_utc": "2026-01-14 15:16:01",
      "score": 23,
      "num_comments": 5,
      "upvote_ratio": 0.9,
      "text": "Most startup advice says focus on product first, distribution later. We did both in parallel using one key resource for SEO foundation during beta. Five months later organic search drives 37% of our signups before we even have PMF.​\n\nThe startup timing strategy was recognizing SEO takes 4-6 months regardless of product quality. That timeline matches typical time to reach PMF. If we started SEO foundation day one alongside product development we'd have both solid product and organic traffic by month six instead of reaching PMF then starting distribution from zero.​ The specific resource we used was [directory submission service](http://getmorebacklinks.org) to automate directory submissions establishing baseline domain authority. This saved us 10-12 hours of manual work we couldn't afford during beta when building product. Got our DA from 0 to 14 within first month giving foundation for content to rank.​\n\nThe parallel execution timeline looked like month one submitted directories and published 4 foundational posts, months two and three focused on product iteration while publishing 2 posts weekly, month four product reached acceptable quality while SEO started showing results, and month five had 800 visitors with product ready to convert that traffic.​ Results at month five showed domain authority at 22, ranking for 28 keywords, generating 800 monthly organic visitors, 24 trial signups from organic monthly, and 8 converted to paying customers at $49/month giving $392 MRR from channel we built during beta.​\n\nWhat made this resource valuable for startups was automating time-consuming work during constrained early stage. As founder I had maybe 60 hours monthly for everything. Spending 12 hours on directory submissions wasn't option. The $127 bought me 11.5 hours to spend on product instead.​ For other startup founders the resource strategy is identify specialized services that automate high-volume low-skill work, evaluate cost versus founder time opportunity cost, use services aggressively during beta when time is most constrained, and focus founder hours on product and strategy not execution tasks.​\n\nThe mistake most startups make is trying to do everything in-house to \"save money\" when founder time is most expensive resource. Spending $127 to save 12 hours is obvious when those hours could ship features users want. The scrappiness should be in finding right resources not refusing to use them.​ The broader startup lesson is building distribution and product in parallel not sequentially. The 4-6 month SEO timeline aligns perfectly with time to PMF. Starting SEO during beta means you have both ready simultaneously instead of reaching PMF with zero distribution then spending another 6 months building organic channel.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Startup_Ideas/comments/1qcpvb6/the_startup_resource_that_got_us_to_800_organic/",
      "domain": "self.Startup_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "nzjy8r1",
          "author": "Fun_Description_308",
          "text": "SEO taking 4-6 months aligning with time to PMF means building both in parallel makes total sense. That $392 MRR from channel built during beta proves the approach works. The opportunity cost thinking ($127 vs 12 founder hours) is exactly how startup resources should be evaluated.",
          "score": 0,
          "created_utc": "2026-01-14 15:33:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzk2i9r",
          "author": "pranavboiii",
          "text": "The parallel execution timeline showing product iteration and SEO happening simultaneously is replicable playbook. Most startups do it sequentially wasting 6 months. The 37% of signups from organic before PMF means you have distribution ready when product quality catches up.",
          "score": 0,
          "created_utc": "2026-01-14 15:53:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzk3o1o",
          "author": "MeThyck",
          "text": "60 hours monthly for everything means every hour must be high-leverage. Spending 12 hours on directory submissions is terrible allocation.",
          "score": 0,
          "created_utc": "2026-01-14 15:58:32",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qdse8y",
      "title": "Small AI niches that are still growing",
      "subreddit": "Startup_Ideas",
      "url": "https://www.reddit.com/r/Startup_Ideas/comments/1qdse8y/small_ai_niches_that_are_still_growing/",
      "author": "BowlerEast9552",
      "created_utc": "2026-01-15 18:59:41",
      "score": 22,
      "num_comments": 8,
      "upvote_ratio": 0.96,
      "text": "So I've been tracking 100k+ AI software keyword searches in Supabase as a fun lil' project.\n\nI like software ideas that are small and normally quite specific that keep beating last year's numbers. Like, January 2024 beats January 2023, February 2024 beats February 2023, and that just keeps going for years. Which is... actually quite rare when you look at the data.\n\n# The opportunities with proper multi-year streaks:\n\nAI jingle generator - 480 searches/month, 36-month growth streak,  This one's been beating the previous year every single month since late 2021. Podcasters and YouTubers need intros, and apparently this is a real enough problem that it's sustained for 3 years straight.\n\nAI prompt maker - 480 searches/month, 36-month streak, Meta-tool for helping people use AI better. I don't know much space / innovation there is left in this space.\n\nVoice to notes AI - 90 searches/month, 31-month streak,  Small numbers but 31 consecutive months of year-over-year growth. Still thinking as a society we're getting use to voice input potentially being a productivity move.\n\n# The year+ climbers:\n\nAI grading app - 480 searches/month, 14-month streak, Teachers hate grading. This is boring utility software that just keeps climbing.\n\nAI study guide generator - 720 searches/month, 15-month streak Students always need study help - clear use case, predictable demand.\n\nNewer but consistent:\n\nAI release notes generator - 140 searches/month, Every dev team hates writing these. Too boring for big AI companies to care about, which is probably why it's still got room.\n\nAI cash flow forecasting - 30 searches/month, $80.12 CPC This one's wild - only 30 monthly searches, but companies are paying $80 per click.\n\n# Why I think these matter:\n\nSmall search numbers might actually be the point here. You're building for 50-500 searches/month in niches that aren't interesting enough for well-funded startups to chase (which means you can actually get traction without competing with venture-backed teams).\n\nIf you want to see the full dataset, I'll leave it in the comments.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Startup_Ideas/comments/1qdse8y/small_ai_niches_that_are_still_growing/",
      "domain": "self.Startup_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "nzs27ql",
          "author": "BowlerEast9552",
          "text": "Managed to accidentally post before I was ready, so had to quickly fix some spelling mistakes + add in titles.\n\nLink here (free to access + no sign up because they're a pain in the ass - desktop / laptop only as creating data tables for mobile is tricky, I might try and solve that this week) - [https://app.toolsforhumans.ai/ai-rising](https://app.toolsforhumans.ai/ai-rising)",
          "score": 1,
          "created_utc": "2026-01-15 19:01:50",
          "is_submitter": true,
          "replies": [
            {
              "id": "nzs2z0l",
              "author": "BowlerEast9552",
              "text": "Others in the dataset I find cool - \n\nAI Test Case Generator - Growth streak of 27, peaked in October last year with 260 searches",
              "score": 2,
              "created_utc": "2026-01-15 19:05:13",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzs3m5o",
                  "author": "BowlerEast9552",
                  "text": "And then maybe one other I would highlight is AI Sprite editor only 20 searches in the most recent month of data, but I feel like demand will grow (dabbled in a bit of Godot earlier this year and I would have loved to have been able to create good quality sprites easily)",
                  "score": 2,
                  "created_utc": "2026-01-15 19:08:08",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzt5uzb",
          "author": "Live-Lab3271",
          "text": "[InfraSketch's](https://www.infrasketch.net/) AI agent turns your ideas into architecture diagrams. Chat to iterate, ask questions, and refine. Then export a design doc and start building.",
          "score": 1,
          "created_utc": "2026-01-15 22:04:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "nztaatk",
              "author": "BowlerEast9552",
              "text": "Kinda interesting",
              "score": 1,
              "created_utc": "2026-01-15 22:26:14",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nztaru7",
                  "author": "Live-Lab3271",
                  "text": "If by \"Kinda\" you mean \"Super\" then I agree! And thank you",
                  "score": 1,
                  "created_utc": "2026-01-15 22:28:35",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qbsyq2",
      "title": "How do you validate a business idea without sounding like you’re pitching it?",
      "subreddit": "Startup_Ideas",
      "url": "https://www.reddit.com/r/Startup_Ideas/comments/1qbsyq2/how_do_you_validate_a_business_idea_without/",
      "author": "j_67u",
      "created_utc": "2026-01-13 14:37:02",
      "score": 18,
      "num_comments": 33,
      "upvote_ratio": 1.0,
      "text": "I’ve been trying to talk to potential customers about a business idea, but I keep running into the same issue:  \nThe moment I ask questions, people assume I’m trying to sell them something.\n\nAll I want is honest feedback, not “sounds good” or “sure, maybe.” I’m struggling to figure out how to learn about real problems without making people feel like I’m promoting something.\n\nFor those who’ve done customer discovery before:  \nHow do you approach people in a way that gets honest answers instead of polite responses?\n\nAny advice or examples would be appreciated.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Startup_Ideas/comments/1qbsyq2/how_do_you_validate_a_business_idea_without/",
      "domain": "self.Startup_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "nzcxna0",
          "author": "better6523",
          "text": "I went through this last year and found a useful point in Starting a Startup by James Sinclair. He talks about getting people to tell “problem stories” instead of reacting to your idea. That small shift made conversations way more natural and less awkward.",
          "score": 9,
          "created_utc": "2026-01-13 14:40:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzjf7xn",
              "author": "Important_Teach_5484",
              "text": "yo if you nee anything in your bussiness and i can help reach out ..can work two times for two times less",
              "score": 2,
              "created_utc": "2026-01-14 13:56:42",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzdu6qa",
          "author": "Moming_Next",
          "text": "This is very qualitative approach, but I recommend you to go both qualitative for something you really want yourself, and quantitative to find opportunities that you may thought would be utter fails. \n\nI usually put a very basic landing page up, and post on mass media like TikTok with prototype visuals that aren't functional and the link in the description to see if it at least got traction, so I can email back people in case I want to dig further. Just take care of false positive where people are \"interested\", but not willing to pay.\n\nI will DM you for the template in case you want to try it out. I made a kit that let you put landing page up in less than a minute without having to pay for hosting or automation to receive your email list in real time.",
          "score": 3,
          "created_utc": "2026-01-13 17:25:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzlcas4",
              "author": "Tamale_Jale",
              "text": "problem here is you kinda need a followign dont you? i have 0 social media presence so im getting nothing out of TikTok/FB/Insta.",
              "score": 1,
              "created_utc": "2026-01-14 19:18:49",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzf4vo0",
          "author": "Shdwzor",
          "text": "Read The Mom Test",
          "score": 3,
          "created_utc": "2026-01-13 20:58:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzh9xoh",
          "author": "Electronic-Cat185",
          "text": "The shiift is to make the conversation about their past, not your idea. asking what they struggled with last tiime, what they tried, and what annoyed them keeeps it grounded in real behavior instead of hypotheticals. as soon as you describe a solution, people switch iinto feedback mode and try to be nice. if you stay curious and resist pitchiing, the useful insiights tend to show up on their own.",
          "score": 3,
          "created_utc": "2026-01-14 03:47:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzgsidy",
          "author": "Willing_Builder4289",
          "text": "Just ask the subreddit where the potential costumers most probably are?? ..",
          "score": 2,
          "created_utc": "2026-01-14 02:07:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzlcfyd",
              "author": "Tamale_Jale",
              "text": "yeah they still think you are trying to sell something. even if you tell them its completely free and just want feedback.",
              "score": 1,
              "created_utc": "2026-01-14 19:19:28",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzd18vz",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-13 14:58:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzhz62k",
          "author": "dan_charles99",
          "text": "I have been in this game since the 00's. Learning how to have conversations without it sounding like a fact finding mission is a skill. It helps if you research. I try to know as much about their business as I can. You are not talking or selling. You are problem solving. As i always say. I have done more \"deals\" than I can remember. But I never sold a thing in my life. It is also humble to accept our lane sometimes. I don't code, not my lane. I solve problems through conversations and make people life better.",
          "score": 1,
          "created_utc": "2026-01-14 06:55:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzi0zdf",
          "author": "Unreal_Labs",
          "text": "Hey Buddy,\n\nThe best way to validate your idea is. Gather 10-25 people around your circle 50% from internal circle like family etc close people and 50% external circle like mutual friends and lil bit strangers are yet to be friends and dicuss about the idea or the problem and solution statement. \n\nIf atleast around more than 50% feels relatable and give genuine and positive feedback. Then youre on buddy. You can move ahead as an entrepreneur. So there is a market for your idea. And there are customers for your solution statement..\n\nThis is how I approach for the problem or idea.",
          "score": 1,
          "created_utc": "2026-01-14 07:11:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzi25jq",
          "author": "Sea_Surprise716",
          "text": "Two possible approaches: \n\n1) Don’t ask about the solution. Ask about the problem, and how much they have already paid to try to solve it. It’s your job to connect the dots on the solution.\n\n2) Don’t ask for feedback. Actually try to sell a thing. If they don’t buy, don’t build.",
          "score": 1,
          "created_utc": "2026-01-14 07:21:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzi7j0k",
          "author": "TopTransportation516",
          "text": "I've been actively trying to solve this. I'd offer you to chrck out https://www.holyshift.ai. I think it's about understanding the user problem to the highest level.... So well to the point that you're drowning in feedback. Then it becomes clear if it's valid, but most often in that process you figure out where to direct the product.",
          "score": 1,
          "created_utc": "2026-01-14 08:11:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzja0r3",
          "author": "IdeasInProcess",
          "text": "We solved this by framing the conversation as a complaint session rather than an interview. I never told potential clients I was building an automation platform. I just asked them to walk me through their most annoying manual task. They will tell you the truth if you let them vent. You are looking for the point where they are already paying for a broken solution.",
          "score": 1,
          "created_utc": "2026-01-14 13:28:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzlv7rk",
          "author": "Far-Abroad6366",
          "text": "You go to your target audience and not pitch the idea but pitch the solution. Secondly, if talking to friends and family - tell them someone you know is building this and what do they think - this helps in taking out biases and getting feedback. Thirdly, go to typeform and build a survey and shoot emails. Then compile learnings.",
          "score": 1,
          "created_utc": "2026-01-14 20:45:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzlyxhc",
          "author": "Extra-Motor-8227",
          "text": "Just talk to users and understand their problem, if it sounds logical for you to propose them your idea, go for it",
          "score": 1,
          "created_utc": "2026-01-14 21:01:48",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qbrm7k",
      "title": "Its Tuesday! Let's self-promote!",
      "subreddit": "Startup_Ideas",
      "url": "https://www.reddit.com/r/Startup_Ideas/comments/1qbrm7k/its_tuesday_lets_selfpromote/",
      "author": "Leather-Buy-6487",
      "created_utc": "2026-01-13 13:42:25",
      "score": 17,
      "num_comments": 40,
      "upvote_ratio": 0.96,
      "text": "I'm building [PayPing](https://payping.space/) \\- a place where you can manage all your subscriptions in one place.\n\nTrack renewals, get reminders, share with family, view analytics, and use AI to optimize your subscription spending. \n\nSo what are you building👇",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Startup_Ideas/comments/1qbrm7k/its_tuesday_lets_selfpromote/",
      "domain": "self.Startup_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "nzcuqmo",
          "author": "amacg",
          "text": "Congrats! Also welcome to launch on our community where makers can share what they’re building and get fair visibility. Here's the link: [https://trylaunch.ai](https://trylaunch.ai/)",
          "score": 1,
          "created_utc": "2026-01-13 14:25:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzcyp8k",
          "author": "Impressive-Emu-3375",
          "text": "[SaaS Mailer](https://saasmailer.app/) to create transactional email templates for your SaaS. Built for Saas teams and Designers. Please try and share your feedback.",
          "score": 1,
          "created_utc": "2026-01-13 14:46:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzdgbec",
          "author": "asupertram",
          "text": "We're building [www.preseedme.com](http://www.preseedme.com) \\-- a launchpad for bootstrapped founders to launch their startup and get connected with micro-investors looking to fund early stage startups with tiny checks",
          "score": 1,
          "created_utc": "2026-01-13 16:10:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzdynfm",
          "author": "damir_maham",
          "text": "Your progress in full view.\n\nGoAchievo is designed around the idea of Reach in Public: you make your progress visible, others encourage you, and your journey does not disappear in a noisy feed. Every step is collected in one continuous timeline, making your progress easy to see and easy to follow.\n\n👉 [https://goachievo.com/launch/](https://goachievo.com/launch/)",
          "score": 1,
          "created_utc": "2026-01-13 17:46:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nze6k46",
          "author": "greyzor7",
          "text": "Building an all-in-one pack for founders who want more than \"just another launch\"\n\nLaunch, reach 30k+ makers, get users & customers - [microlaunch.net/premium](http://microlaunch.net/premium)\n\nLifetime, auto-distribution, marketplace spots, 700+ customers so far.",
          "score": 1,
          "created_utc": "2026-01-13 18:21:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzeol9w",
          "author": "OkResort8287",
          "text": "https://kipasastore.com/",
          "score": 1,
          "created_utc": "2026-01-13 19:42:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzf1f3n",
          "author": "Xplorer-",
          "text": "https://neuraldraft.io/en. Your Website, Blog, and Socials - All in One Platform.",
          "score": 1,
          "created_utc": "2026-01-13 20:42:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzf4p3k",
          "author": "Fresh-Manager7329",
          "text": "[Huddlekit](http://huddlekit.com/) – Collect feedback, review, and annotate on websites and creative assets",
          "score": 1,
          "created_utc": "2026-01-13 20:57:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzf91g7",
          "author": "chamacoaguerrido",
          "text": "Launched [Presencia AI](https://presenciaia.com/en): a 90-second tool that audits how LLMs \"see\" your site, it identifies visibility gaps in your schema and structure so you can get cited by AI models.\n\nGiving away a few free full-access codes to those interested.",
          "score": 1,
          "created_utc": "2026-01-13 21:17:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzg1ji6",
          "author": "Godforce101",
          "text": "Over the last 7 months, I’ve been quietly building an interactive video platform for creators.\n\nThe main idea is that viewers choose how their video moves forward and creators can monetize those interactive paths. It’s similar in spirit to Bandersnatch, but made for creator-driven video, especially short-form.\n\nI truly believe interactive video is the new wave of monetization for creators. \n\nIf you’re curious, there are two experiences live here:\nhttps://choozza.com/experience/58\nhttps://choozza.com/experience/69\n\nThey're not perfect, they're not even polished enough to make me happy in the slightest, but they prove the functionality and that's fine for the moment. The rest of the content is placeholder content used to test the interface.\n\nRight now, I’m focused on creating more interactive stories. I call them experiences because you're actually involved in the story alongside the creator. You choose how the story moves forward, following the path(s) the creator has set.\n\nThe name Choozza comes from “choose,” which is the core mechanic.\n\nHope that makes sense. I'm open to any questions or enquiries.\nThank you.",
          "score": 1,
          "created_utc": "2026-01-13 23:37:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzgvx8h",
          "author": "Fine-Table3231",
          "text": "Hey iam building nearby meet .\nWhere you nearby people for \nWalk,coffee shop,\nGame like:\nCricket ,\nBadminton .\n\nBecause nowdays people all are in digtialloneliness .\nSo it will be helpfull for the people from mental stress by talking to each other .\nNo more online chats only real people .\n\n\nKindly provide any suggestion or feedback you wanted to add here and iam also open for questions .",
          "score": 1,
          "created_utc": "2026-01-14 02:26:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzh6jz9",
          "author": "HBTechnologies",
          "text": "iPhone - I have built “aiME Ondevice AI\" , an AI chat app for iPhone that runs open-source LLMs 100% offline—no internet or subscription required.\n\nFREE version (Limited Features) - https://apps.apple.com/us/app/aime-ondevice-ai/id6754805828\n\n•\t⁠Deal: Lifetime unlock for $9.99 (normally $59.99) •\t⁠Your data NEVER leaves your device •\t⁠Handles writing, coding, roleplay, and chat, even offline (travel, flights, emergencies, hiking, off-grid adventures) •\t⁠Unique: Download new models as needed, customizable system prompts\n\nSOME USE CASES:\n\nAirplane Mode\n\nAt 30,000 feet, chat with a full AI assistant in #Airplane Mode. No WiFi, no data—your smart companion stays fully available. Say \"Bye to Boredom\" in flight.\n\nTravel\n\nWith ZERO roaming, ZERO signal, and ZERO extra cost, use AI anywhere in the worldwide. Stay connected to intelligence, not the internet.\n\nOffGrid\n\nMillion Miles away from civilization? Your AI still works #OffGrid. No towers, no service—just fast, reliable, on-device intelligence anywhere you go.\n\nHiking\n\nOn every trail, your AI stays connected—even when you don't. With #Hiking, on-device processing keeps your assistant ready in the wild.\n\nHurricane / Storm Season\n\nWhen networks fail, your Offline AI won’t. Stay prepared during #HurricaneSeason, on-device intelligence that works in any emergency.\n\nPrivacy\n\nYour data NEVER leaves your phone. With true #Privacy, everything stays on-device—your questions, your chats, your world.\n\nSecure\n\nWith 100% on-device processing, your info stays encrypted, protected, and yours alone. #Secure means zero cloud, zero risk.\n\nWould love your feedback or questions!",
          "score": 1,
          "created_utc": "2026-01-14 03:27:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzi4cs2",
          "author": "Adventurous_Eye_6387",
          "text": "Turning short-form content into a high-intent traffic engine for SaaS,  \n  \nWe identify the exact problem your tool solves and turn it into a visual hook, Viral Memes and we post daily, so that the algorithm finds your ideal customers - [Website](https://shadowreels.vercel.app/)",
          "score": 1,
          "created_utc": "2026-01-14 07:41:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nziq31s",
          "author": "Silver_Yak_7333",
          "text": "I am building ‘VideoToPost’ web app",
          "score": 1,
          "created_utc": "2026-01-14 11:06:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o013tfz",
          "author": "OtherwiseTwo8053",
          "text": "[signalcast.app](http://signalcast.app) \\- AI podcast digests. Pick your shows, get a 10-min weekly email with the highlights instead of listening to 10+ hours.\n\nFree tier (3 shows), still in beta. Happy to hear what's broken or missing.",
          "score": 1,
          "created_utc": "2026-01-17 01:26:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzdctsa",
          "author": "Affectionate-Bad-347",
          "text": "Your Website scream VIBE CODING! \nThis is a perfect example why u need a RoadMap with UI/UX Design and not +20 Colors. Good luck.\n\nEdit: The Logo is terrible too, just Use something \"normal\"!",
          "score": 0,
          "created_utc": "2026-01-13 15:54:24",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qcohrg",
      "title": "What are you guys building? Share your SaaS/project",
      "subreddit": "Startup_Ideas",
      "url": "https://www.reddit.com/r/Startup_Ideas/comments/1qcohrg/what_are_you_guys_building_share_your_saasproject/",
      "author": "Leather-Buy-6487",
      "created_utc": "2026-01-14 14:21:13",
      "score": 16,
      "num_comments": 42,
      "upvote_ratio": 0.95,
      "text": "Curious to know what others are building.\n\nI'm building [PayPing](https://payping.space/) \\- a place where you can manage all your subscriptions in one place.\n\nTrack renewals, get reminders, share with family, view analytics, and use AI to optimize your subscription spending. \n\nSo what are you building👇",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Startup_Ideas/comments/1qcohrg/what_are_you_guys_building_share_your_saasproject/",
      "domain": "self.Startup_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "nzjryo6",
          "author": "mkdwolf",
          "text": "[https://itlinks.me](https://itlinks.me) \n\nURL Link shortener",
          "score": 3,
          "created_utc": "2026-01-14 15:03:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzp4piu",
              "author": "paulhooper07",
              "text": "‪Startupsubmit.app - we help founders get listed their startup in trusted directory platforms ‬",
              "score": 1,
              "created_utc": "2026-01-15 08:50:08",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzlt62c",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 2,
          "created_utc": "2026-01-14 20:35:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzofrhj",
              "author": "Current-Contract-853",
              "text": "Maybe have the check box before join the wait list button? Took me a minute  to figure out why I'm getting invalid email error.",
              "score": 2,
              "created_utc": "2026-01-15 05:14:46",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzs3np2",
                  "author": "FoundersWorkspaceApp",
                  "text": "Thanks for sharing! I've taken a look and I modified. I'm confident it's less confusing now!",
                  "score": 1,
                  "created_utc": "2026-01-15 19:08:20",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzk0o1t",
          "author": "Impressive-Emu-3375",
          "text": "[SaaS Mailer](https://saasmailer.app/) to create email templates for your SaaS. Please try and share your feedback.",
          "score": 1,
          "created_utc": "2026-01-14 15:44:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzkquu3",
          "author": "Commercial-Pay7724",
          "text": "[SavedBut ](https://ideas-into-action.lovable.app)SavedBut is the bookmarking tool that refuses to let your ideas die quietly.",
          "score": 1,
          "created_utc": "2026-01-14 17:43:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzm3zui",
          "author": "greyzor7",
          "text": "Launch your startup, reach 30k+ makers, get users & customers - [microlaunch.net/premium](http://microlaunch.net/premium)\n\nLifetime, auto-distribution, marketplace.",
          "score": 1,
          "created_utc": "2026-01-14 21:24:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nznra6u",
          "author": "Starlyns",
          "text": "A zillow killer",
          "score": 1,
          "created_utc": "2026-01-15 02:36:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nznveai",
          "author": "Sharp_Animal",
          "text": "love the idea for PayPing - subscription creep is real. one thing i'd test early - make email/bank import dead simple so ppl don't need manual entry, thats usually where dropoff happens. i'm building smarter.day - tasks + calendar + habits in one timeline with a small ai smart score to nudge what to do next - offline/online sync took longer than planned and the scoring needed a bunch of experimentation.",
          "score": 1,
          "created_utc": "2026-01-15 03:00:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzo5pzr",
          "author": "Live-Lab3271",
          "text": "[InfraSketch's](https://www.infrasketch.net/) AI agent turns your ideas into architecture diagrams. Chat to iterate, ask questions, and refine. Then export a design doc and start building.",
          "score": 1,
          "created_utc": "2026-01-15 04:05:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzoao4s",
          "author": "Puzzled-Shower-976",
          "text": "\n\n[THIS](https://chromewebstore.google.com/detail/nljdhlnaeechhagalijfhllebbjmjjka?utm_source=item-share-cb) to make leetcoding memorable for you!",
          "score": 1,
          "created_utc": "2026-01-15 04:38:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzommpc",
          "author": "Godforce101",
          "text": "Over the last 7 months, I’ve been quietly building an interactive video platform for creators.\n\nThe main idea is that viewers make choices and creators can monetize those interactive paths. It’s similar in spirit to Bandersnatch, but made for creator-driven video, especially short-form.\n\nI truly believe interactive video is the new wave of monetization for creators. \n\nIf you’re curious, there are two experiences live here:\n\nhttps://choozza.com/experience/58\n\nhttps://choozza.com/experience/69\n\nThey're not perfect, they're not even polished enough to make me content in the slightest, but they prove the functionality and that's fine for the moment. The rest of the site is still placeholder content used to test the interface.\n\nRight now, I’m focused on creating more interactive stories. I call them experiences because you're actually involved in the story alongside the creator. You choose how the story moves forward, following the path(s) the creator has set.\n\nThe name Choozza comes from “choose,” which is the core mechanic. Hope that makes sense. \n\nI'm open to any questions or enquiries.\nThank you.",
          "score": 1,
          "created_utc": "2026-01-15 06:07:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzotrd2",
          "author": "jundymek",
          "text": "Building new customization options in **FakerFill**, so devs can control exactly how each field is filled.\n\n[https://www.fakerfill.com](https://www.fakerfill.com)",
          "score": 1,
          "created_utc": "2026-01-15 07:08:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzp6c9v",
          "author": "OkResort8287",
          "text": "https://kipasastore.com/",
          "score": 1,
          "created_utc": "2026-01-15 09:06:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzp6na2",
          "author": "amacg",
          "text": "Built a community where makers can share what they’re building and get fair visibility. Here's the link: [https://trylaunch.ai](https://trylaunch.ai/)",
          "score": 1,
          "created_utc": "2026-01-15 09:09:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzpitll",
          "author": "SantiagoSchw",
          "text": "[MarketAlerts.ai](http://marketalerts.ai/) — AI-powered platform for stock discovery and trading strategy.",
          "score": 1,
          "created_utc": "2026-01-15 11:03:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nztr6jh",
          "author": "Ok_Pineapple8194",
          "text": "MD Live Plan Viewer. e.g. via Claude Code – [PlanViewer](https://apps.apple.com/us/app/planviewer/id6757651884)",
          "score": 1,
          "created_utc": "2026-01-15 23:54:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o08dtub",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-18 03:52:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0btax3",
          "author": "palex-david",
          "text": "I just launched [Palex](https://getpalex.com), a social app for physical book lovers. Think “Goodreads meets your actual bookshelf,” with friends, swaps, and discovery built in.\n\nLive now: [PeerPush](https://peerpush.net/p/palex)\n\nGoing live Tuesday on [Product Hunt](https://www.producthunt.com/products/palex?launch=palex-2)\n\n[App Store](https://apps.apple.com/us/app/palex-library/id6743680989)\n\nIf you’re curious about the tech, App Store review process, or product decisions, ask away. Any support is greatly appreciated.",
          "score": 1,
          "created_utc": "2026-01-18 17:57:54",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qdf6rs",
      "title": "Y Combinator has just notified us of their decision.",
      "subreddit": "Startup_Ideas",
      "url": "https://www.reddit.com/r/Startup_Ideas/comments/1qdf6rs/y_combinator_has_just_notified_us_of_their/",
      "author": "Ecstatic-Tough6503",
      "created_utc": "2026-01-15 09:33:35",
      "score": 14,
      "num_comments": 10,
      "upvote_ratio": 0.57,
      "text": "Hello everyone,\n\nToday, I wanted to share how our Y Combinator application process went.\n\nThis was our second time applying.  \nThe first time, two years ago, we were rejected instantly.\n\nThis time… a real surprise. We applied for [our new SAAS.](https://gojiberry.ai)\n\nTwo days ago, we received an interview request.\n\nHonestly, I didn’t expect it at all, even though our SaaS is now very solid and growing fast.\n\nOn paper, we don’t really need VC money:\n\n* 300+ customers\n* Live for 3 months\n* Profitable\n* Happy users\n* Strong inbound lead flow\n\nThis wasn’t about survival.\n\nYC isn’t just about money.\n\n\\- The YC logo alone boosts conversions.  \n\\- Their network is massive.  \n\\- Learning how to execute better alongside world-class founders is priceless.\n\nAnd let’s be honest: even when you’re profitable, $500k is never a bad thing (marketing, hiring, speed).\n\nBefore the interview, we spent half a day training with my co-founders, doing mock interviews.\n\nOn interview day:\n\n* Login to the YC dashboard\n* Click “Join Zoom”\n* Three founders on our side\n* Two partners on the other side\n\nIt was super friendly. Very supportive. Nothing like aggressive VC interviews.  \nThey were curious, calm, and genuinely interested.\n\nThey asked us:\n\n* What we’re building\n* How the backend works / tech stack\n* Our competitive advantage\n* Number of customers and how we acquired them\n* Team roles\n* What we did before\n* A quick product demo\n* How we see the product evolving\n\nWe weren’t amazing but we were solid.\n\nThe next morning, we received the email : rejection.\n\nDisappointing, of course.\n\nReaching the interview already felt like a small miracle, so I thought we had passed the hardest part.\n\nAnd honestly… between the interview and the answer, I had already:\n\n* checked Airbnbs\n* looked at flights\n* started imagining what life in the batch could look like\n\nToo much projection. Reality check 😅\n\nWe’re re-applying for the next batch.\n\nBelow, I’ll share the exact YC rejection email, which is actually very insightful and explains the two main reasons they passed on us\n\n[Click here to see the rejection email and the reason why we were rejected](https://www.notion.so/YC-proofs-2c7b9abcbe3f80379d5ac08cf23d9b6f?source=copy_link)\n\nWe’ll be back next round 💪",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Startup_Ideas/comments/1qdf6rs/y_combinator_has_just_notified_us_of_their/",
      "domain": "self.Startup_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "nzpf79p",
          "author": "UnbeliebteMeinung",
          "text": "I wonder how much of these shitty requests they get",
          "score": 5,
          "created_utc": "2026-01-15 10:31:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzpvuqk",
          "author": "the_trve",
          "text": "7 zillion reposts of the same shitty story is not enough?",
          "score": 6,
          "created_utc": "2026-01-15 12:43:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzr88du",
              "author": "Sabarishnarain",
              "text": "How many of these AI Marketting apps are rolling ? And customers are using this? 😳😳",
              "score": 1,
              "created_utc": "2026-01-15 16:48:07",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzpey27",
          "author": "babban_rao",
          "text": "Great insight. Thanks for sharing.",
          "score": 2,
          "created_utc": "2026-01-15 10:29:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzqvh5h",
          "author": "666penguins",
          "text": "All they did was one Reddit search and saw all the Gojiberry AI spam lmao",
          "score": 1,
          "created_utc": "2026-01-15 15:50:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzqjo7q",
          "author": "davincidudee",
          "text": "Great insight, good Lucky next year!",
          "score": 1,
          "created_utc": "2026-01-15 14:55:31",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qg1735",
      "title": "We spent 6 months building features nobody asked for. Here's what actually got us our first paying customers",
      "subreddit": "Startup_Ideas",
      "url": "https://www.reddit.com/r/Startup_Ideas/comments/1qg1735/we_spent_6_months_building_features_nobody_asked/",
      "author": "Abdulwahab93",
      "created_utc": "2026-01-18 06:30:58",
      "score": 14,
      "num_comments": 13,
      "upvote_ratio": 0.83,
      "text": "I'm a developer who thought I knew what developers needed. I was wrong.\n\nMy co-founder and I built an AI tool for software teams. We spent 6 months adding every feature we thought was \"essential\":\n\n* Fancy dashboard \n* 15+ integrations \n* Custom workflows \n* Beautiful onboarding \n\nTotal paying customers after 6 months: 0\n\nWe had 200+ signups. People would try it, say \"this is cool,\" and never come back.\n\nThe turning point came when I was manually doing customer development calls (should've done this from day 1). One engineering lead said something that hit hard:\n\n\"I don't need another dashboard. I need something that actually closes my Jira tickets while I sleep.\"\n\nThat one sentence changed everything.\n\nWe stripped out 70% of what we built. Focused on ONE thing: take a ticket, understand the codebase, submit a PR. That's it.\n\nWhat happened next:\n\n* First paying customer within 2 weeks\n* 5 more in the next month\n* Now at $2k MRR (small but real)\n\nWhat I learned:\n\n1. \"Cool\" ≠ valuable. People don't pay for cool. They pay for time saved.\n2. Talk to users before you build. I know everyone says this. I thought I was different. I wasn't.\n3. Narrow > Wide. Doing one thing exceptionally beats doing ten things okay.\n4. Your first 10 customers are hiding in conversations, not ads. Every early customer came from Reddit, Discord, or direct outreach.\n\nStill early and still figuring things out. But the difference between 0 customers and 5 customers feels massive mentally.\n\nFor those who've been through this: What was the moment you realized you were building the wrong thing? And how did you pivot without losing momentum?\n\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Startup_Ideas/comments/1qg1735/we_spent_6_months_building_features_nobody_asked/",
      "domain": "self.Startup_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o095vax",
          "author": "Wide_Brief3025",
          "text": "Getting out of your own head and talking directly to users is honestly what makes everything click. I had a similar experience and found most early leads actually surfaced in conversations way before they hit our site. Using something like ParseStream helped me track those relevant discussions and spot high intent users so I could join in naturally and actually provide value instead of just lurking and hoping.",
          "score": 2,
          "created_utc": "2026-01-18 07:21:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0a1qgp",
              "author": "Abdulwahab93",
              "text": "That's exactly it - the conversations happen way before they ever hit your landing page. I started hanging out in Discord servers and Slack communities where my target users already were. The signal-to-noise ratio was way better than any paid channel. How did you handle the balance between providing value vs feeling like you're always \"on\" in those communities?",
              "score": 1,
              "created_utc": "2026-01-18 12:10:39",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o09bxhn",
          "author": "kubrador",
          "text": "\"i don't need another dashboard\" is developer speak for \"please god just make my life easier instead of prettier.\" congrats on finally listening to your users after six months of shipping features for your own dopamine hits.",
          "score": 1,
          "created_utc": "2026-01-18 08:16:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0a1szu",
              "author": "Abdulwahab93",
              "text": "Ha, guilty as charged. 6 months of \"but what if we add THIS feature\" when the answer was literally in the first user interview I ignored. The dopamine from shipping is real and dangerous. At least now I ship things that actually matter to someone other than my ego.",
              "score": 1,
              "created_utc": "2026-01-18 12:11:14",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0cuuih",
          "author": "arcady_vibes",
          "text": "The real shift here wasn’t talking to users, it was switching from evaluation language (“cool”, “nice”) to replacement language (“this does my job while I sleep”).\nThat’s usually the moment a product stops being tried and starts being paid for.",
          "score": 1,
          "created_utc": "2026-01-18 20:56:44",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qchvk9",
      "title": "What are you shipping this week? Drop your link👇",
      "subreddit": "Startup_Ideas",
      "url": "https://www.reddit.com/r/Startup_Ideas/comments/1qchvk9/what_are_you_shipping_this_week_drop_your_link/",
      "author": "bozkan",
      "created_utc": "2026-01-14 08:19:18",
      "score": 13,
      "num_comments": 62,
      "upvote_ratio": 0.89,
      "text": "Post your link and a 1–2 sentence description. I’ll kick it off:\n\n[Episolo.com](http://episolo.com/) \\- An AI startup builder that ships your MVP in minutes from a single chat prompt. Built-in AI, database, authentication and deployment.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Startup_Ideas/comments/1qchvk9/what_are_you_shipping_this_week_drop_your_link/",
      "domain": "self.Startup_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "nzien7v",
          "author": "asupertram",
          "text": "We're building [www.preseedme.com](http://www.preseedme.com) \\-> it'a a launchpad where bootstrapped founders share what they’re building and get backed early by micro-investors\n\nThink of it as AngelList for pre-revenue builders, where founders showcase their projects early, and investors backing dozens of small experiments instead of one big bet.",
          "score": 2,
          "created_utc": "2026-01-14 09:20:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nziqr4t",
          "author": "Godforce101",
          "text": "Over the last 7 months, I’ve been quietly building an interactive video platform for creators.\n\nThe main idea is that viewers make choices and creators can monetize those interactive paths. It’s similar in spirit to Bandersnatch, but made for creator-driven video, especially short-form.\n\nI truly believe interactive video is the new wave of monetization for creators. \n\nIf you’re curious, there are two experiences live here:\n\nhttps://choozza.com/experience/58\nhttps://choozza.com/experience/69\n\nThey're not perfect, they're not even polished enough to make me content in the slightest, but they prove the functionality and that's fine for the moment. The rest of the site is still placeholder content used to test the interface.\n\nRight now, I’m focused on creating more interactive stories. I call them experiences because you're actually involved in the story. You choose how the story moves forward, following the path(s) the creator has set.\n\nThe name Choozza comes from “choose,” which is the core mechanic.\nHope that makes sense. I'm open to any questions or enquiries.\nThank you.",
          "score": 1,
          "created_utc": "2026-01-14 11:12:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzj0liu",
              "author": "bozkan",
              "text": "this is a cool idea, I will try it!",
              "score": 2,
              "created_utc": "2026-01-14 12:28:03",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzj8i8q",
                  "author": "Godforce101",
                  "text": "Thank you for taking from your time to check it out. If you have any feedback, regardless of whether it’s good or bad, I will be happy for it!",
                  "score": 1,
                  "created_utc": "2026-01-14 13:19:15",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nziryrh",
          "author": "o_Oleh",
          "text": "I'm building [shaflex.com](http://shaflex.com/) \\- a simple, flow-first app for cross-platform social media publishing.   \nNo cluttered dashboards, just publish.",
          "score": 1,
          "created_utc": "2026-01-14 11:22:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzj0qw1",
              "author": "bozkan",
              "text": "I need this, will try when you launch!",
              "score": 2,
              "created_utc": "2026-01-14 12:29:05",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "nzk92jt",
              "author": "bozkan",
              "text": "btw I decided to start a small Discord for builders to support each other - it could really help us to grow quicker, I have some ideas. If you’re interested, please join [https://shippingroom.episolo.com/](https://shippingroom.episolo.com/)",
              "score": 1,
              "created_utc": "2026-01-14 16:23:00",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nziss2c",
          "author": "Impressive-Emu-3375",
          "text": "[SaaS Mailer](https://saasmailer.app/) to create email templates for your SaaS. Please try and share your feedback.",
          "score": 1,
          "created_utc": "2026-01-14 11:29:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nziyd6x",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-14 12:12:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzj0tu5",
              "author": "bozkan",
              "text": "yesterday I paid more than 120 bucks for another one, wish I found you earlier!",
              "score": 1,
              "created_utc": "2026-01-14 12:29:39",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzizb92",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-14 12:18:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzizu64",
          "author": "jundymek",
          "text": "Developing **FakerFill** — helps devs and QA auto-populate forms in one click during development.\n\n[https://www.fakerfill.com](https://www.fakerfill.com)",
          "score": 1,
          "created_utc": "2026-01-14 12:22:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzizvs7",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-14 12:23:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzj0boe",
              "author": "bozkan",
              "text": "I will try this for my 100s subs!",
              "score": 1,
              "created_utc": "2026-01-14 12:26:08",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzj0h7d",
                  "author": "DiamonPAM",
                  "text": "I’ll see it, and the stats will prove it. :)",
                  "score": 1,
                  "created_utc": "2026-01-14 12:27:13",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzj3oef",
          "author": "Visible-Essay5589",
          "text": "[vispion.com](http://vispion.com) (an experiment)",
          "score": 1,
          "created_utc": "2026-01-14 12:48:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzj594q",
          "author": "damir_maham",
          "text": "Your progress in full view.\n\nGoAchievo is designed around the idea of Reach in Public: you make your progress visible, others encourage you, and your journey does not disappear in a noisy feed. Every step is collected in one continuous timeline, making your progress easy to see and easy to follow.\n\n👉 [https://goachievo.com/launch/](https://goachievo.com/launch/)",
          "score": 1,
          "created_utc": "2026-01-14 12:59:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzk9g6x",
              "author": "bozkan",
              "text": "could be nice for me, will try",
              "score": 1,
              "created_utc": "2026-01-14 16:24:42",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzk9l1h",
                  "author": "bozkan",
                  "text": "btw I decided to start a small Discord for builders to support each other - it could really help us to grow quicker, I have some ideas. If you’re interested, please join [shippingroom.episolo.com](https://shippingroom.episolo.com/)",
                  "score": 1,
                  "created_utc": "2026-01-14 16:25:19",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzjc04l",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-14 13:39:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzk9oln",
              "author": "bozkan",
              "text": "looking cool! btw I decided to start a small Discord for builders to support each other - it could really help us to grow quicker, I have some ideas. If you’re interested, please join [shippingroom.episolo.com](https://shippingroom.episolo.com/)",
              "score": 1,
              "created_utc": "2026-01-14 16:25:45",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzjlhgj",
          "author": "MORPHOICES",
          "text": "I'm creating a high-end AI tech system for solopreneurs & creators who want to create a structured digital product business with their knowledge without aimless guessing and runtime duct-taping of tools & burning-out.\n\nIt is a comprehensive framework for prompt and workflow design, automation, launch, and all plug-and-play.\n\nAs it’s still in beta, we’re validating with early builders who want leverage, not hustle. \\~",
          "score": 1,
          "created_utc": "2026-01-14 14:30:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzk9t6g",
              "author": "bozkan",
              "text": "nice, so link is not available now?\n\nbtw I decided to start a small Discord for builders to support each other - it could really help us to grow quicker, I have some ideas. If you’re interested, please join [shippingroom.episolo.com](https://shippingroom.episolo.com/)",
              "score": 2,
              "created_utc": "2026-01-14 16:26:19",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzjlxig",
          "author": "Walfy07",
          "text": "[Wessford](http://www.wessford-ind.com)\n\nSome new products I think are interesting.",
          "score": 1,
          "created_utc": "2026-01-14 14:32:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzjmipn",
          "author": "missEves",
          "text": "[playmix.ai](https://playmix.ai/) \\- vibe create games 🎮",
          "score": 1,
          "created_utc": "2026-01-14 14:35:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzjmjzr",
          "author": "missEves",
          "text": "[playmix](https://playmix.ai/animate) \\- create animated game sprites w/ ai 🏃‍♀️",
          "score": 1,
          "created_utc": "2026-01-14 14:36:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzjvvyk",
              "author": "bozkan",
              "text": "that is coool!",
              "score": 1,
              "created_utc": "2026-01-14 15:22:31",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzlauje",
                  "author": "missEves",
                  "text": "thank you!",
                  "score": 1,
                  "created_utc": "2026-01-14 19:12:11",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nzk9v3k",
              "author": "bozkan",
              "text": "btw I decided to start a small Discord for builders to support each other - it could really help us to grow quicker, I have some ideas. If you’re interested, please join [shippingroom.episolo.com](https://shippingroom.episolo.com/)",
              "score": 1,
              "created_utc": "2026-01-14 16:26:33",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzk5e4w",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-14 16:06:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzk9wn8",
              "author": "bozkan",
              "text": "looking slick! btw I decided to start a small Discord for builders to support each other - it could really help us to grow quicker, I have some ideas. If you’re interested, please join [shippingroom.episolo.com](https://shippingroom.episolo.com/)",
              "score": 1,
              "created_utc": "2026-01-14 16:26:46",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzwejlr",
                  "author": "Glass_Effective5147",
                  "text": "joined, let's talk",
                  "score": 1,
                  "created_utc": "2026-01-16 10:57:26",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzk67fx",
          "author": "greyzor7",
          "text": "Building an all-in-one pack for founders who want more than \"just another launch\"\n\nLaunch, reach 30k+ makers, get users & customers - [microlaunch.net/premium](http://microlaunch.net/premium)\n\nLifetime, auto-distribution, marketplace spots, 700+ customers so far.",
          "score": 1,
          "created_utc": "2026-01-14 16:10:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzku10l",
          "author": "itsnashm",
          "text": "I’ve been building Longview, a tool to help people plan their financial future with confidence.\n\n🔗 https://longview-kappa.vercel.app/\n\nYou can create multiple financial scenarios, visualize long-term growth projections, and compare outcomes, all without relying on complex spreadsheets.\n\nWould love feedback on the idea, UX, or features to build next.",
          "score": 1,
          "created_utc": "2026-01-14 17:57:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzlhzw2",
          "author": "alerenn",
          "text": "I made a new tuner app called [OpenTune](https://apps.apple.com/us/app/opentune-guitar-tuner/id6757105393) because I wanted something faster and cleaner than what was available.\n\nIt’s designed to be dead simple:\n\n* Open the app.\n* Pluck a string.\n* It detects the pitch instantly (Chromatic).\n\nWorks for Acoustic/Electric Guitar, Bass, and Ukelele. If you are looking for a lightweight alternative to the bloated apps out there, give it a try.",
          "score": 1,
          "created_utc": "2026-01-14 19:44:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzlvxvi",
          "author": "pg3crypto",
          "text": "[https://www.asknutro.com](https://www.asknutro.com)\n\nSymptom based nutritional therapy system using machine learning. It's not complete, it's basically a proof of concept right now. Currently its in a state I required for a pitch I did last year.",
          "score": 1,
          "created_utc": "2026-01-14 20:48:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzlyvms",
          "author": "Ok_Pineapple8194",
          "text": "\\- Cal AI: [Calorie Scanner](https://apps.apple.com/us/app/cal-ai-calorie-scanner/id6757346094)",
          "score": 1,
          "created_utc": "2026-01-14 21:01:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzoyzl6",
          "author": "Worried_Cap5180",
          "text": "Fun football score prediction game to play with your friends https://fulltimescore.pro",
          "score": 1,
          "created_utc": "2026-01-15 07:55:41",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qdm235",
      "title": "It’s Thursday! What project has your focus right now?",
      "subreddit": "Startup_Ideas",
      "url": "https://www.reddit.com/r/Startup_Ideas/comments/1qdm235/its_thursday_what_project_has_your_focus_right_now/",
      "author": "Fareway13",
      "created_utc": "2026-01-15 15:10:23",
      "score": 13,
      "num_comments": 34,
      "upvote_ratio": 1.0,
      "text": "Let’s support one another and get more eyes on our work.\n\nI’m building [itraky](https://www.itraky.io/) a smart deep linking tool for creators and affiliates.\n\nIt automatically opens links directly in apps like Amazon, YouTube, TikTok or Instagram instead of the browser, so users land where they’re already logged in and ready to act.\n\nThat means a smoother experience, fewer drop-offs, and significantly better conversion rates.\n\nSo… what are you building? 👇",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Startup_Ideas/comments/1qdm235/its_thursday_what_project_has_your_focus_right_now/",
      "domain": "self.Startup_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "nzsh926",
          "author": "OkResort8287",
          "text": "[https://maasimcreatives.com/](https://maasimcreatives.com/) a kids library where you can get childrens books with a lot of upcoming activity and [https://kipasastore.com/](https://kipasastore.com/) an online all purpose store thats about to be opened up to the rest of the world",
          "score": 2,
          "created_utc": "2026-01-15 20:10:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzvg226",
          "author": "dan_charles99",
          "text": "I am going through a clients sales pipeline and sorting the noise from the real interest. I am also highlighting the deals ready to be me made, that they appear to have missed.",
          "score": 2,
          "created_utc": "2026-01-16 05:55:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzrx8c0",
          "author": "Ok_Pineapple8194",
          "text": "Updates for:   \n\\- [Math AI](https://apps.apple.com/us/app/math-ai-homework-solver/id6757371789): Homework Solver  \n\\- Can't Decide? [Spin](https://apps.apple.com/us/app/my-spinner-pro/id6757399112)  \n\\- Birth Control Pill: [Reminder](https://apps.apple.com/us/app/birth-control-pill-reminder/id6757361388)",
          "score": 1,
          "created_utc": "2026-01-15 18:39:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzsglnr",
          "author": "ramseywinster",
          "text": "[https://www.submitwell.com/](https://www.submitwell.com/) it helps early founders grow domain rating and kickstart SEO by getting their product & websites listed on trusted directories platforms. A simple and affordable way to build visibility when a site is new.",
          "score": 1,
          "created_utc": "2026-01-15 20:07:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzshbev",
          "author": "OkResort8287",
          "text": "[https://maasimcreatives.com/](https://maasimcreatives.com/) a kids library where you can get childrens books with a lot of upcoming activity and [https://kipasastore.com/](https://kipasastore.com/) an online all purpose store thats about to be opened up to the rest of the world",
          "score": 1,
          "created_utc": "2026-01-15 20:11:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzt1bbm",
          "author": "greyzor7",
          "text": "Built an all-in-one marketing pack for founders who want more than \"just another launch\".\n\nAuto-distribution, re-launches, marketplace spots, 30-day launches.\n\nLifetime pack, 700+ customers, 1,000+ visitors/day - [microlaunch.net/premium](http://microlaunch.net/premium)",
          "score": 1,
          "created_utc": "2026-01-15 21:43:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzt2atr",
          "author": "GoodAndBadPuns",
          "text": "[Covoy](http://covoy.io) \\- using AI to break down long-term goals and build people a plan for their day!",
          "score": 1,
          "created_utc": "2026-01-15 21:48:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzt4uw0",
          "author": "Live-Lab3271",
          "text": "[InfraSketch's](https://www.infrasketch.net/) AI agent turns your ideas into architecture diagrams. Chat to iterate, ask questions, and refine. Then export a design doc and start building.",
          "score": 1,
          "created_utc": "2026-01-15 21:59:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzt59lq",
          "author": "igzard",
          "text": "I’ve been running a photo booth rental business for nearly 5 years now. While the business is great, I’ve always struggled with marketing. I knew that the best way to convince a bride-to-be would be to show her a video of another happy bride recommending us on Instagram or TikTok. As a developer with 10 years of experience, I decided to stop searching for the perfect tool and just build it myself.\n\n(Side note: While building it, I realized this would also be hilarious for \"First Drink - Last Drink\" videos at weddings, lol!)\n\nI created [trustvid.to](http://trustvid.to)\n\nRoast my product in vid: [https://trustvid.to/c/5YtRvtkc-roast-reddit](https://trustvid.to/c/5YtRvtkc-roast-reddit)",
          "score": 1,
          "created_utc": "2026-01-15 22:01:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzvifem",
              "author": "No_Chipmunk_3894",
              "text": "This is amazing!",
              "score": 2,
              "created_utc": "2026-01-16 06:13:17",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nztcigz",
          "author": "International-Hat529",
          "text": "Building [**Marina AI**](https://usemarina.app), a realtime voice AI therapist trained on CBT with session memory, context awareness, reminders, and guided exercises.  \nUsed as an online therapist, life coach, relationship assistant, and daily mental health support.",
          "score": 1,
          "created_utc": "2026-01-15 22:37:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nztd9ml",
          "author": "OtherwiseTwo8053",
          "text": "Building SignalCast — turns 10 hours of podcasts into a 10-minute weekly digest. AI extracts key insights, delivered every Monday.\n\nFree tier available (3 shows), just launched the beta. Would love feedback from fellow builders.\n\nhttps://www.signalcast.app",
          "score": 1,
          "created_utc": "2026-01-15 22:40:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzuta2n",
          "author": "Responsible-Brick881",
          "text": "What I'm building:\nI’m building [visty.io](https://www.visty.io/) - we are pivoting from a traditional digital agency model to what I call \"Attention-as-a-Service\" infrastructure. Basically, instead of charging clients hourly fees to manage risky ad campaigns, we built a pipe that sells guaranteed, completed premium video views at a fixed price. \n\nA weird SEO problem.\nWe are currently losing a Google ranking battle to a fictional Japanese anime boy band that shares our name. Google’s AI thinks we are a cartoon character. If anyone here has experience with \"Entity Disambiguation\" or outranking fictional pop stars, I'd love to hear from you.",
          "score": 1,
          "created_utc": "2026-01-16 03:25:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzvdm98",
          "author": "damir_maham",
          "text": "Your progress in full view.\nGoAchievo is designed around the idea of Reach in Public: you make your progress visible, others encourage you, and your journey does not disappear in a noisy feed. Every step is collected in one continuous timeline, making your progress easy to see and easy to follow.\n👉 https://goachievo.com/launch/",
          "score": 1,
          "created_utc": "2026-01-16 05:36:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzw4w9j",
          "author": "amacg",
          "text": "Built a community where makers can share what they’re building and get fair visibility. Here's the link: [https://trylaunch.ai](https://trylaunch.ai/)",
          "score": 1,
          "created_utc": "2026-01-16 09:30:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzw6vlu",
          "author": "Fresh-Manager7329",
          "text": "[Huddlekit](http://huddlekit.com/) – Collect feedback, review, and annotate websites and creative assets",
          "score": 1,
          "created_utc": "2026-01-16 09:49:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzzu2lb",
          "author": "zak_fuzzelogic",
          "text": "https://treeto.app ..imagine if a business card, calendly and linktree all got together .... this it what you'd get..\n\nA business card that allows you to share your links, drive traffic and take bookings.",
          "score": 1,
          "created_utc": "2026-01-16 21:19:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0aw7k9",
          "author": "palex-david",
          "text": "I just launched [Palex](https://getpalex.com), a social app for physical book lovers. Think “Goodreads meets your actual bookshelf,” with friends, swaps, and discovery built in.\n\nLive now: [PeerPush](https://peerpush.net/p/palex)\n\nGoing live Tuesday on [Product Hunt](https://www.producthunt.com/products/palex?launch=palex-2)\n\n[App Store](https://apps.apple.com/us/app/palex-library/id6743680989)\n\nIf you’re curious about the tech, App Store review process, or product decisions, ask away. Any support is greatly appreciated.",
          "score": 1,
          "created_utc": "2026-01-18 15:20:02",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qf6oni",
      "title": "I kept failing at problem validation, so I built a framework",
      "subreddit": "Startup_Ideas",
      "url": "https://www.reddit.com/r/Startup_Ideas/comments/1qf6oni/i_kept_failing_at_problem_validation_so_i_built_a/",
      "author": "GEEKGEEEK",
      "created_utc": "2026-01-17 07:14:21",
      "score": 13,
      "num_comments": 7,
      "upvote_ratio": 1.0,
      "text": "I realized something after killing (or worse, building) too many ideas.\n\nMost of my failures didn’t come from bad execution.  \nThey came from **picking problems that sounded good but didn’t actually change behavior**.\n\nSo I stopped asking *“Is this a good idea?”*  \nand built a simple framework to ask better questions *before* building.\n\nJUST COPY IT AND ASK AI\n\n\\-----------------\n\n# ❌ A Problem Validation Framework to Avoid Failing Again\n\n|Step|Framework|Key Question|Pass (YES)|Fail (NO)|\n|:-|:-|:-|:-|:-|\n|1|**Behavior Shift**|Does this actually change what the user does **today**?|Users take actions they didn’t before (logs, check-ins, public status)|It just feels good / creates agreement|\n|2|**Failure Cost**|If they don’t use this, **what do they actually lose**?|Time, money, exams, opportunities, reputation|“It’s a bit disappointing”|\n|3|**Replacement**|Are people already solving this **in a clumsy way**?|Spreadsheets, Reddit, calendars, manual notes|Nobody is doing anything|\n|4|**Escape Resistance**|If users drop off, does **anything happen**?|Failure is recorded / progress stalls publicly|They can just leave|\n|5|**Repeat Pressure**|Does this problem **repeat regularly**?|Daily or weekly|One-time problem|\n|6|**Life Impact**|Without this, would they **fail again next week for the same reason**?|YES|NO|\n\n# 🔴 Instant Disqualifiers (Auto-Fail)\n\n* “Nice-to-have” ideas\n* Dating / swipe-style matching\n* Pure connection without structure\n* Zero cost to quit (ghosting is inevitable)\n* Easy to explain, no observable behavior change\n\n# 🟢 Signals a Problem Might Be Real\n\n* People already use annoying workarounds\n* The same failure keeps repeating\n* Not using it visibly stops progress\n* Users say: *“This is uncomfortable, but necessary”*\n\n# Final filter (the only one that really matters)\n\n>\n\nIf the answer is **NO**,  \nit’s probably a feature — not a product.\n\n\\---------------------\n\n# If you want to use this:\n\n**You can literally copy this framework and ask an AI (CHATGPT) (or yourself):**\n\n>“Evaluate my idea based on this framework, step by step, and be brutally honest.”\n\nThat’s what I do now — and it’s saved me from building a lot of useless things.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Startup_Ideas/comments/1qf6oni/i_kept_failing_at_problem_validation_so_i_built_a/",
      "domain": "self.Startup_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o02k4vh",
          "author": "shohan4556",
          "text": "Thank you for the framework",
          "score": 0,
          "created_utc": "2026-01-17 07:45:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o04griv",
          "author": "Necessary_Pay717",
          "text": "This is really good!\n\nAre you actively running discovery calls? How many calls do you think are enough to validate idea / problem?",
          "score": 0,
          "created_utc": "2026-01-17 16:00:22",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qd7i7j",
      "title": "What’s your startup idea for 2026? Let’s self promote.",
      "subreddit": "Startup_Ideas",
      "url": "https://www.reddit.com/r/Startup_Ideas/comments/1qd7i7j/whats_your_startup_idea_for_2026_lets_self_promote/",
      "author": "Mammoth-Shower-5137",
      "created_utc": "2026-01-15 02:39:03",
      "score": 9,
      "num_comments": 48,
      "upvote_ratio": 0.81,
      "text": "2025 flew by fast, and 2026 is already starting to feel real. I’ve been spending a lot of time on Reddit lately, reading founder posts, user complaints, and random comments where people casually describe problems they’d actually pay to solve.\n\nThat’s what pushed me to build [Rixly](https://www.userixly.com/)  \nIt turns Reddit conversations into clear signals for startups & businesses to convert warm leads into potential sales.\n\nInstead of just promoting my thing, I want this thread to be useful.\n\nWhat are **you** building or planning for 2026?  \nAn idea, MVP, landing page, or even a rough thought - all welcome.\n\nLet's make this thread a channel for you to promote your own startup idea, find opportunities, and partnerships.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Startup_Ideas/comments/1qd7i7j/whats_your_startup_idea_for_2026_lets_self_promote/",
      "domain": "self.Startup_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "nzoz5hl",
          "author": "PersonoFly",
          "text": "Pocket air fryers for the mobile professional who can’t afford their own home.",
          "score": 3,
          "created_utc": "2026-01-15 07:57:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzrm7ft",
          "author": "damir_maham",
          "text": "Your progress in full view.\nGoAchievo is designed around the idea of Reach in Public: you make your progress visible, others encourage you, and your journey does not disappear in a noisy feed. Every step is collected in one continuous timeline, making your progress easy to see and easy to follow.\n👉 https://goachievo.com/launch/",
          "score": 2,
          "created_utc": "2026-01-15 17:51:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzo1kg1",
          "author": "International-Hat529",
          "text": "[Marina AI](https://usemarina.app) is a realtime Speech to Speech AI Therapist trained on Cognitive Behavioral Therapy books with session continuity, context, reminders, exercises and more. Can be used as a therapist, life coach, relationship assistant, ...",
          "score": 1,
          "created_utc": "2026-01-15 03:38:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzpmbcz",
          "author": "Impressive-Emu-3375",
          "text": "[SaaS Mailer](https://saasmailer.app/) to create email templates for your SaaS.",
          "score": 1,
          "created_utc": "2026-01-15 11:33:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzq97lq",
          "author": "greyzor7",
          "text": "Launch, reach 30k+ makers, get users & customers - [microlaunch.net/premium](http://microlaunch.net/premium)\n\nLifetime, auto-distribution, marketplace spots, 700+ customers so far.",
          "score": 1,
          "created_utc": "2026-01-15 14:01:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzrdsjm",
          "author": "Lost-Inflation-6239",
          "text": "Live demo: https://goalstatsil.com/en\nI’m building GoalStats, a lightweight SaaS for amateur football and futsal groups ⚽\nWe built it for our own weekly games, rotating teams every session, no fixed league, no spreadsheets, no WhatsApp chaos.\nIt tracks matchdays, goals, assists, MVPs and player stats automatically, and over time you actually see stories and rivalries form through the data.\nIt’s simple by design, mobile friendly, and focused only on what casual groups really need.\nWould love feedback from others building or using tools for sports, stats, or small communities 🚀\nExample team: https://goalstatsil.com/en/thechampions",
          "score": 1,
          "created_utc": "2026-01-15 17:13:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzs9sb1",
          "author": "Walfy07",
          "text": "[Wessford ](http://wessford-ind.com)\n\nTrying to sell some cool products no one else makes.",
          "score": 1,
          "created_utc": "2026-01-15 19:36:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzszcov",
          "author": "No_Chipmunk_3894",
          "text": "A platform where you can book people to help your parents hands-on on how to reach their digital needs so that you dont have to loose your nerves. To be further developed to a ICT helpdesk for the people 🙂",
          "score": 1,
          "created_utc": "2026-01-15 21:34:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzymdyb",
          "author": "subratadesign",
          "text": "In 2026, I will focus fully on my branding and design agency. The second plan is building products.",
          "score": 1,
          "created_utc": "2026-01-16 17:59:49",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}