{
  "metadata": {
    "last_updated": "2026-02-20 03:06:13",
    "time_filter": "week",
    "subreddit": "startup",
    "total_items": 7,
    "total_comments": 45,
    "file_size_bytes": 51827
  },
  "items": [
    {
      "id": "1r4waih",
      "title": "reddit communities that actually matter for builders",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1r4waih/reddit_communities_that_actually_matter_for/",
      "author": "tiguidoio",
      "created_utc": "2026-02-14 21:21:39",
      "score": 22,
      "num_comments": 0,
      "upvote_ratio": 0.87,
      "text": "ai builders & agents  \n[r/AI\\_Agents](https://www.reddit.com/r/AI_Agents/) – tools, agents, real workflows  \n[r/AgentsOfAI](https://www.reddit.com/r/AgentsOfAI/) – agent nerds building in public  \n[r/AiBuilders](https://www.reddit.com/r/AiBuilders/) – shipping AI apps, not theories  \n[r/AIAssisted](https://www.reddit.com/r/AIAssisted/) – people who actually use AI to work\n\nvibe coding & ai dev  \n[r/vibecoding](https://www.reddit.com/r/vibecoding/) – 300k people who surrendered to the vibes  \n[r/AskVibecoders](https://www.reddit.com/r/AskVibecoders/) – meta, setups, struggles  \n[r/cursor](https://www.reddit.com/r/cursor/) – coding with AI as default  \n[r/ClaudeAI](https://www.reddit.com/r/ClaudeAI/) / [r/ClaudeCode](https://www.reddit.com/r/ClaudeCode/) – claude-first builders  \n[r/ChatGPTCoding](https://www.reddit.com/r/ChatGPTCoding/) – prompt-to-prod experiments\n\nstartups & indie  \n[r/startups](https://www.reddit.com/r/startups/) – real problems, real scars  \n[r/startup](https://www.reddit.com/r/startup/) / [r/Startup\\_Ideas](https://www.reddit.com/r/Startup_Ideas/) – ideas that might not suck  \n[r/indiehackers](https://www.reddit.com/r/indiehackers/) – shipping, revenue, no YC required  \n[r/buildinpublic](https://www.reddit.com/r/buildinpublic/) – progress screenshots > pitches  \n[r/scaleinpublic](https://www.reddit.com/r/scaleinpublic/) – “cool, now grow it”  \n[r/roastmystartup](https://www.reddit.com/r/roastmystartup/) – free but painful due diligence\n\nsaas & micro-saas  \n[r/SaaS](https://www.reddit.com/r/SaaS/) – pricing, churn, “is this a feature or a product?”  \n[r/ShowMeYourSaaS](https://www.reddit.com/r/ShowMeYourSaaS/) – demos, feedback, lessons  \n[r/saasbuild](https://www.reddit.com/r/saasbuild/) – distribution and user acquisition energy  \n[r/SaasDevelopers](https://www.reddit.com/r/SaasDevelopers/) – people in the trenches  \n[r/SaaSMarketing](https://www.reddit.com/r/SaaSMarketing/) – copy, funnels, experiments  \n[r/micro\\_saas](https://www.reddit.com/r/micro_saas/) / [r/microsaas](https://www.reddit.com/r/microsaas/) – tiny products, real money\n\nno-code & automation  \n[r/lovable](https://www.reddit.com/r/lovable/) – no-code but with vibes  \n[r/nocode](https://www.reddit.com/r/nocode/) – builders who refuse to open VS Code  \n[r/NoCodeSaaS](https://www.reddit.com/r/NoCodeSaaS/) – SaaS without engineers (sorry)  \n[r/Bubbleio](https://www.reddit.com/r/Bubbleio/) – bubble wizards and templates  \n[r/NoCodeAIAutomation](https://www.reddit.com/r/NoCodeAIAutomation/) – zaps + AI = ops team in disguise  \n[r/n8n](https://www.reddit.com/r/n8n/) – duct-taping the internet together\n\nproduct & launches  \n[r/ProductHunters](https://www.reddit.com/r/ProductHunters/) – PH-obsessed launch nerds  \n[r/ProductHuntLaunches](https://www.reddit.com/r/ProductHuntLaunches/) – prep, teardown, playbooks  \n[r/ProductManagement](https://www.reddit.com/r/ProductManagement/) / [r/ProductOwner](https://www.reddit.com/r/ProductOwner/) – roadmaps, tradeoffs, user pain\n\nthat’s it.  \nno fluff. just places where people actually build and launch things",
      "is_original_content": false,
      "link_flair_text": "social media",
      "permalink": "https://reddit.com/r/startup/comments/1r4waih/reddit_communities_that_actually_matter_for/",
      "domain": "self.startup",
      "is_self": true,
      "comments": []
    },
    {
      "id": "1r67nmx",
      "title": "why doesn't education teach you how to fail?",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1r67nmx/why_doesnt_education_teach_you_how_to_fail/",
      "author": "Lol_Panda2004",
      "created_utc": "2026-02-16 11:54:07",
      "score": 17,
      "num_comments": 19,
      "upvote_ratio": 1.0,
      "text": "thinking about this because of a friend in a \"build businesses\" program (he is in tetr college). he failed twice in his first year. first product flopped. second pivot didn't work. third one is finally getting traction. in traditional school this would be: F, F, C maybe. in his program: \"good, you now know what doesn't work\". meanwhile i spent 4 years getting A's by avoiding anything i might fail at. optimized for grades not learning.\n\nnow i'm scared to start anything because i've never failed safely. shouldn't education be the safe place to fail? while stakes are low? before you have mortgage and kids? why do we design education to punish failure when real life rewards learning from it?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1r67nmx/why_doesnt_education_teach_you_how_to_fail/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o5oike1",
          "author": "Vaibhav_codes",
          "text": "Totally  school trains us to avoid failure, not learn from it Small, safe experiments are the real classroom",
          "score": 6,
          "created_utc": "2026-02-16 13:38:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5okdss",
              "author": "DoubleReturn5726",
              "text": "Yes, you are right.",
              "score": 1,
              "created_utc": "2026-02-16 13:48:56",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5o4qcw",
          "author": "imbuilding",
          "text": "I guess most people don't see value in failing, and it can be harsh. \nGoing for the safest alternative is not necessarily the worst strategy, it works for most of people.\n\nFailure is not for everyone. It is deeply uncomfortable, and the risks of it going badly are of course higher. However, at the same time, after talking to some people, they never regretted taking the risk.\n\nI think it would be good to prepare people for failure in an educative setting, but it may be irresponsible to prompt them towards the riskier option as a life building goal.\n\nIf you want to start something, go for it. As you haven't failed yet, the first couple of times it might feel horrible, but you will also most likely not regret it. \nIt sounds line you don't have big responsibilities right now, so today is the day to risk it and fail, tomorrow you may not have the privilege",
          "score": 2,
          "created_utc": "2026-02-16 12:06:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5q2rvp",
              "author": "Tim-Sylvester",
              "text": "> I guess most people don't see value in failing\n\nFailure is the only way you learn. Success teaches nothing.",
              "score": 3,
              "created_utc": "2026-02-16 18:12:54",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5q6c88",
                  "author": "imbuilding",
                  "text": "I'd argue otherwise\nlearning doesn't come from failure alone, it comes from reflection, you cannot fail forever. You have to learn from your wins and losses. In an ideal world you would only win and still learn from it, as long as you understand why you won.\n\nHaving a structured approach to that result, whether it's failure or success, will provide you with valuable information.\n\nLearning from success, yours and other's, is important too. Failure should be the fallback option.",
                  "score": 1,
                  "created_utc": "2026-02-16 18:29:01",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o5ucgjc",
                  "author": "IndependentEast-3640",
                  "text": "I gave up far too many times",
                  "score": 1,
                  "created_utc": "2026-02-17 10:17:11",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5op7vt",
          "author": "rjkdavin",
          "text": "OP clearly wasn’t a bad student.",
          "score": 2,
          "created_utc": "2026-02-16 14:15:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6awsy6",
              "author": "OvaMadhya-30",
              "text": "Or paid attention in math, where a lot of the work is learning why and which were the steps that might've failed.",
              "score": 1,
              "created_utc": "2026-02-19 20:24:00",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5p6txz",
          "author": "AdUnlucky2432",
          "text": "Failure is innate it doesn’t need to be taught. What needs to be taught is recovery from failure.",
          "score": 1,
          "created_utc": "2026-02-16 15:44:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5qutsb",
          "author": "Ok-Initiative-4009",
          "text": "this is hitting close to home. spent 4 years at a big tech company doing good safe work. got good reviews, good raises, never really failed at anything because the environment was designed so you wouldn't. then i quit to start something on my own and realized i had no idea how to handle not knowing if what i'm doing is right. the first few months were genuinely scary, not because the work was hard but because there was no rubric. no manager telling me i'm on track. just me making decisions and hoping they're not stupid. my first 5 customer interviews were terrible. asked the wrong questions, talked too much, got useless answers. in school that would've been a fail. in startup world it was just tuesday. i redid them and got better. your friend's program sounds great honestly. i wish i'd had something like that instead of learning to fail for the first time at 29 with my savings on the line. the mortgage and kids point is real. the best time to get comfortable with failure is when the worst case scenario is moving back in with your parents, not missing a mortgage payment. most education has it completely backwards.",
          "score": 1,
          "created_utc": "2026-02-16 20:25:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5r5uzj",
          "author": "augusto-chirico",
          "text": "the problem isn't that education doesn't teach failure - it's that it actively punishes it. your brain gets 20 years of conditioning to avoid the red marks, and then you're supposed to suddenly be fine with launching something nobody wants. the deprogramming takes way longer than anyone admits",
          "score": 1,
          "created_utc": "2026-02-16 21:19:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5s9lq7",
          "author": "shazej",
          "text": "I think education optimizes for standardization, not experimentation.\n\nGrades require clear right/wrong answers. Failure in school usually means “you didn’t meet the rubric.” But in startups, failure often means “you tested something and gathered information.”\n\nThe system rewards predictability because it has to scale to millions of students. Entrepreneurship rewards uncertainty because that’s where opportunity lives.\n\nThat said, you can create your own “safe to fail” environment now. Small bets. Tiny experiments. $50 projects. Landing pages with no product. Things where the downside is embarrassment not bankruptcy.\n\nYou don’t have to jump from straight A student to risking everything. You can build your tolerance for failure gradually.",
          "score": 1,
          "created_utc": "2026-02-17 00:52:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5t0ae8",
          "author": "Connect-Subject188",
          "text": "School is designed to minimize variance, not maximize growth. \n\nConsistency, not experimentation. In real life and especially in startups, you get paid for testing things that might not work. The problem is not that education ignores failure, it is that it penalizes visible failure, if you want to get comfortable with it, you have to build your own small safe experiments outside the system. ",
          "score": 1,
          "created_utc": "2026-02-17 03:34:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5tczq8",
          "author": "ninadpathak",
          "text": "It doesn’t because every parent want their kid to win. Its impossible for everyone to win but who’s going to explain it to the parents",
          "score": 1,
          "created_utc": "2026-02-17 05:01:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5tz1gv",
          "author": "Adorable-Show92",
          "text": "The grading system is essentially designed for compliance and standardized output, which is the exact opposite of the iterative \"guess and check\" nature of building something new. In a typical classroom, a mistake is a permanent deduction from your GPA, whereas in a startup, that same mistake is just a data point that narrows down your path to a viable product.",
          "score": 1,
          "created_utc": "2026-02-17 08:09:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5u8mb7",
          "author": "IdeasInProcess",
          "text": "Totally agree with this because I had to unlearn the fear of failure while scaling my first company from zero. In the logistics of building a startup, a failed pivot is just data that tells you where the market logic is broken. I found that the most successful founders are the ones who treat every error as a necessary debugging step. You should start a small project today with the literal goal of finding where it fails so you can learn to manage the risk.",
          "score": 1,
          "created_utc": "2026-02-17 09:41:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5vxw6q",
          "author": "RoleHot6498",
          "text": "The modern American school system was designed to create factory workers at the beginning of the industrial revolution in the early 20th century. What you do not want in a good factory worker is created intent critical thinking... For the ability to fail and iterate",
          "score": 1,
          "created_utc": "2026-02-17 16:13:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5zs0rb",
          "author": "ElegantAlbatross1165",
          "text": "The mistake is believe you learn books you learn how to learn to keep learning.",
          "score": 1,
          "created_utc": "2026-02-18 03:54:36",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r8ry28",
      "title": "Is anyone else drowning in trying to manage 4+ social platforms while building…",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1r8ry28/is_anyone_else_drowning_in_trying_to_manage_4/",
      "author": "Equivalent-Spend-415",
      "created_utc": "2026-02-19 06:34:15",
      "score": 7,
      "num_comments": 21,
      "upvote_ratio": 0.89,
      "text": "I’ve realized the hard way that my biggest hurdle isn’t the code… it’s the distribution. I spent 3 months building in total silence, and when I finally launched, it was absolute silence. I know the fix is building in public but the sheer overhead is killing my productivity.   \n  \nI am trying to find a way to consistently produce and repurpose content to stay active on LinkedIn for investors, X (Twitter) for the tech community, and now Instagram/YouTube for brand personality. By the time I’ve tailored the founder journey content for each platform's vibe, I’ve lost half a day of deep work. As a solo founder, I can’t afford to be a full-time Social Media Manager, but I also can't afford to be invisible. What’s your workflow for staying visible across multiple channels without losing your focus on the product?",
      "is_original_content": false,
      "link_flair_text": "knowledge",
      "permalink": "https://reddit.com/r/startup/comments/1r8ry28/is_anyone_else_drowning_in_trying_to_manage_4/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o678gm8",
          "author": "Striking-Bluejay6155",
          "text": "I would suggest you pre-prep honest, valuable insights and thoughts from your journey to building your project. What worked, what didn’t, what made you want to throw something at the wall. The images should be screenshots or videos of something real, not bs posters made with canva. \nUse the “build in public” trend and use an open source social media scheduling tool to post 1-2 a week about this journey, always framing it around the problem you identified and how you propose to solve it. \nAvoid writing the posts with ChatGPT. Mistakes, weird cadence and honesty always wins. Don’t include links in the post body, always in the comments on your posts. \n\nHope this helps",
          "score": 3,
          "created_utc": "2026-02-19 06:39:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o67kmok",
          "author": "Muenstervision",
          "text": "Pick one or two MAX to stay near daily on, use otters more sparingly … define your ICP, drive social currency there.",
          "score": 3,
          "created_utc": "2026-02-19 08:29:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6azg0d",
              "author": "AmiceWong",
              "text": "Yes, i agree",
              "score": 1,
              "created_utc": "2026-02-19 20:37:04",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o67v8x9",
          "author": "TheGrowthMentor",
          "text": "You're on too many platforms. Pick 1x platform and go deep. Covering all the channels you mentioned is 4 different content strategies, 4 different formats, 4 different audiences. No wonder you're drowning. Which audience matters most right now? If it's getting customers, pick where your customers are. HubSpot for Startups has social media scheduling built in so you can write once and schedule across platforms. They also have AI that suggests posts based on your content and does content remixes to save time. Currently they drop their pricing and offer 90% off if you qualify for their startup program and there is t on of free guides [https://www.hubspot.com/startups/ai](https://www.hubspot.com/startups/ai) (NO AFFILIATION) Buffer or Typefully work too but they are not built as CRM so you can't see which posts actually drive leads. ",
          "score": 2,
          "created_utc": "2026-02-19 10:14:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o67azrx",
          "author": "No-Entertainer-9810",
          "text": "Are you looking at part time hiring for this?",
          "score": 1,
          "created_utc": "2026-02-19 07:00:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o67nun3",
          "author": "Selfgrowthseeker",
          "text": "Yep!! Just build a a content system using Reflit because I was struggling so much. I spent a whole year building an app on Flutterflow and realised I should’ve been posting more for distribution 🤦‍♀️ also not sure of the budget but I have VA I pay $29 aud a day to help!\n\nI basically built out something that lets me use one idea and then turns it into little posts so can keep track of repurposing my ideas too! So organizing by idea is helpful as well.",
          "score": 1,
          "created_utc": "2026-02-19 09:01:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o67pr5g",
          "author": "Round_Bullfrog_4563",
          "text": "I advice you to focus more on marketing, less on building. Don't build features no one wants. Yeah its fun to code, change css and get the dopamine hit. Unfortunately the thing that you built it in 3 months, someone with Clawbot built it in 1 day. \nHaving failed previously, now my approach is completely stop building features before I find a client. I've scrapped 190k real estate, 450k ecom, 127k accountant and plenty other leads of many niches. Now I'll cold email them and build B2B softwares for them",
          "score": 1,
          "created_utc": "2026-02-19 09:20:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o67uli2",
          "author": "koorb",
          "text": "I have an automation that posts to my product's LinkedIn page every day. I don't like it, but it fits my product.",
          "score": 1,
          "created_utc": "2026-02-19 10:08:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o68juzs",
          "author": "life_Bittersweet",
          "text": "What product are you building?",
          "score": 1,
          "created_utc": "2026-02-19 13:22:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o699nbf",
          "author": "Crescitaly",
          "text": "As someone who's worked with a lot of solo founders on their social media presence, this is one of the most common pain points I see. The good news: you don't need to be everywhere at once. The bad news: most advice about \"just batch your content\" oversimplifies the actual problem.\n\n\n\nHere's what actually works for founders who need to build in public without losing their minds:\n\n\n\nFirst, adopt the 1-2-1 framework. Pick 1 primary platform (where your actual customers/investors are), 2 secondary platforms (where you repurpose with minimal effort), and 1 long-form anchor (blog, newsletter, or YouTube). Your primary platform gets original, tailored content. The secondary ones get adapted versions. The anchor builds long-term SEO and authority.\n\n\n\nFor your specific case - LinkedIn for investors + X for tech community + Instagram/YouTube for brand - here's the efficient workflow:\n\n\n\nStart with LinkedIn. Write one thoughtful post about your founder journey 3x per week. This takes maybe 30 min total if you write from real experience instead of trying to be clever. Then take the core insight from that LinkedIn post and turn it into a shorter X post (5 min). For Instagram, take a screenshot of the LinkedIn post or create a simple carousel from the same content using a template (10 min). That's one piece of content across three platforms in under 45 minutes.\n\n\n\nThe key insight most founders miss: you don't need platform-native content on every platform to start. You need presence and consistency. Perfect platform optimization comes later when you have traction (or budget to hire help).\n\n\n\nSome practical time-savers:\n\n\\- Record 60-second Loom videos of you working or explaining decisions. These become Reels, Shorts, and X clips with zero extra effort\n\n\\- Use a scheduling tool to batch-post everything on Sunday evening\n\n\\- Engage for 10 min after each post goes live, then close the apps\n\n\\- Reply to DMs and comments in one 15-min block at end of day\n\n\n\nThe total time investment should be 3-4 hours per week max, not half a day of deep work. If it's taking more than that, you're overcomplicating the content or trying to be too polished. Raw and authentic performs better than polished anyway, especially in the building-in-public space.",
          "score": 1,
          "created_utc": "2026-02-19 15:41:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o69d4pe",
          "author": "YopBuilder",
          "text": "The fix is not building in public, most likely",
          "score": 1,
          "created_utc": "2026-02-19 15:58:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6aijmk",
          "author": "vatoho",
          "text": "I feel this. After my startup got acqui-hired I swore I'd never go silent mode again if I did another one. But yeah the context switching is brutal.\n\nOne thing that helped when I was doing the founder thing was treating social like monitoring first, posting second. I used something called Hazelbase to track conversations where people were already asking about problems in our space. Way easier to just jump into existing threads on reddit or twitter than trying to manufacture content from scratch every day. You're being helpful, you're visible, and it takes like 20 min instead of 2 hours.\n\nThe other thing is honestly just picking one or two platforms max. LinkedIn and Twitter probably make the most sense for you. Instagram and YouTube are content black holes unless you're doing something super visual. Better to actually ship product and be occasionally visible than to be everywhere poorly.",
          "score": 1,
          "created_utc": "2026-02-19 19:14:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6aorgw",
          "author": "chrisf_nz",
          "text": "Hootsuite and other similar tools enable you to schedule posting the same content to multiple platforms.",
          "score": 1,
          "created_utc": "2026-02-19 19:44:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6b91lp",
          "author": "Tiny-Celery4942",
          "text": "this is brutal, been there. stop tailoring full posts to every platform, pick one source of truth and repurpose fast, not perfect. batch a week of raw material on slow days, make one long linkedin post or thread, chop it into a few x posts, a short instagram caption and a 30s reel clip, schedule the lot and only spend 30-60 minutes daily on engagement. it saved my deep work.\n\ni use Depost AI for linkedin to turn drafts into timed posts and track follow ups, i have a short workflow i can share if you want it",
          "score": 1,
          "created_utc": "2026-02-19 21:23:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6bl9m2",
          "author": "live-unbound-life",
          "text": "I went through this exact phase and realised I was trying to “custom create” content for every platform.\n\nWhat helped was picking one primary platform and treating the others as distribution, not creation.\n\nInstead of tailoring the message each time, I built one core idea per week and repurposed it with minor formatting changes.\n\nAlso — I stopped trying to be present everywhere daily. Depth on one platform > surface-level on four.\n\nThe mental load drops significantly when you reduce decision points.",
          "score": 1,
          "created_utc": "2026-02-19 22:24:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6bux24",
          "author": "shazej",
          "text": "You don’t need 4 platforms.you need 1 primary and 1 secondary. Create once, distribute everywhere with light edits. Batch content weekly schedule it and protect deep work hours like they’re investor meetings. Distribution shouldn’t replace building it should support it",
          "score": 1,
          "created_utc": "2026-02-19 23:18:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o67po1s",
          "author": "7thparadise",
          "text": "Staying invisible on socials is a big miss for sure. Have you tried using a dedicated platform to automate these tasks? \n\nI work with SocialBu. You can use it to:\n\nBatch your week using the bulk scheduler. If your content is queued up for the week, you can stay in deep work mode without worrying about your feed going silent. \n\nCentralise your engagement. Use a unified inbox to handle all DMs and comments. You won't miss a message from an investor on LinkedIn just because you were busy on X. \n\nAutomate the routine. Set up automation rules to post from your blog or RSS feed. This keeps your side projects visible while you focus on your main work.\n\nSince you are a founder, you should check out our SocialBu for Startups program. We offer a specific perk where eligible startups get full access to our advanced tools for 2 to 5 months to help them scale. \n\nHope it helps. :)",
          "score": 0,
          "created_utc": "2026-02-19 09:19:51",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r71ttj",
      "title": "Becoming a founder to help people with poor mental health.",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1r71ttj/becoming_a_founder_to_help_people_with_poor/",
      "author": "justchoo",
      "created_utc": "2026-02-17 09:47:13",
      "score": 5,
      "num_comments": 10,
      "upvote_ratio": 0.86,
      "text": "Building Fog of Mind: practical mental health support for high-pressure UK workplaces (NHS, education, construction)\n\nI’m John, UK-based, ex-British Army and now a risk manager. I built **Fog of Mind** after my own run-in with depression and years of watching capable people go quiet, burn out, or break, usually long before anyone calls it “a mental health issue”.\n\n# The problem I can’t unsee (and the numbers back it up)\n\nThese are three sectors where stress is not a footnote, it’s baked into the job:\n\n* **NHS:** In the NHS Staff Survey 2024, **41.63%** of staff said they felt unwell due to work-related stress, and **55.77%**reported going to work despite not feeling well enough to do their duties. ([nhsstaffsurveys.com](https://www.nhsstaffsurveys.com/static/c1a573e95b1a49428676ef4b24f5efe7/National-Results-Briefing-2024.pdf?utm_source=chatgpt.com))\n* **UK education:** Education Support’s Teacher Wellbeing Index reports **77%** of education staff experience symptoms of poor mental health due to work, and **49%** say workplace culture negatively affects their mental health. ([educationsupport.org.uk](https://www.educationsupport.org.uk/resources/for-organisations/research/teacher-wellbeing-index/))\n* **UK construction:** Construction workers have been reported as being at **3.7x higher** risk of suicide than the national average (citing ONS), with evidence also pointing to **507 suicides in construction in 2021**. ([Mates in Mind](https://www.matesinmind.org/news/mental-health-in-uk-construction-the-statistics?utm_source=chatgpt.com))\n\nZoom out and it’s not just a “wellbeing” issue, it’s a productivity and stability issue: in Great Britain, **40.1 million working days** are lost due to work-related illness and injury, with an estimated **£22.9bn** cost (2023/24). ([HSE](https://www.hse.gov.uk/statistics/overview.htm))\n\n# Why this feels urgent (and why I’m building a startup around it)\n\nBecause the current pattern is predictable:\n\n1. people struggle silently\n2. performance drops, relationships fray, absence increases\n3. the “support” arrives late, or not at all\n\nA lot of workplace mental health support is either too generic, too reactive, or too divorced from real working life. Fog of Mind is built around **early, practical intervention**: simple tools, conversation prompts, and routines that help people create headspace before things hit crisis level. It’s **not therapy**, and it doesn’t pretend to be.\n\n# What I’m looking for from the startup community\n\nIf you’ve built or scaled something in a regulated, people-heavy space (health, education, construction, HR), I’d value input on:\n\n* the fastest route to **first pilots** without getting trapped in procurement cycles\n* whether to start with **SMEs** (especially construction) vs going straight at enterprise/public sector\n* what you’ve found works for **pricing** practical workshops + ongoing support (without selling “wellbeing theatre”)\n\n.",
      "is_original_content": false,
      "link_flair_text": "knowledge",
      "permalink": "https://reddit.com/r/startup/comments/1r71ttj/becoming_a_founder_to_help_people_with_poor/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o5uhfl5",
          "author": "AM04_z7",
          "text": "Hi John, I think Fog of Mind is a great idea. The following is my take on the entire thing\n\n1. If you are pushing this towards business, the primary idea needs to shift from well-being, to impacts on their business due to a quantifiable change in well-being( risk reduction). Then possibly push wellbeing as a second part.\n\n2. I would recommend SMEs to go with, your background and experiences would work in your favour in pushing the change. Additionally,  you could also take a look at sectors that would easily adopt what you have; it is likely that there is going to be some \"cultural\" resistance to the entire concept of well-being.\n\n3. Pilots needn't be perfect for you, but I think they would need to be fast. Say 2-3 paid pilots, some testimonials and most definitely before and after data. You also use this to farm urgency.\n\n4. As for the pricing, it is imperative in my opinion that you don't price yourself on the lower end of the spectrum. It might be easier to sell initially but once you ramp up operations it will come to bite back at you.\n\nAgain these are just my thoughts on it, hopefully this helps you out in some capacity.\n\nAnd Best of Luck!",
          "score": 3,
          "created_utc": "2026-02-17 11:01:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5uru65",
              "author": "justchoo",
              "text": "Thank you so much 😊",
              "score": 1,
              "created_utc": "2026-02-17 12:24:24",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5v0d1i",
          "author": "esterling",
          "text": "We’ve built a number of projects and applications for the medical sector (for example, [Mysti AI](https://lexogrine.com/success-stories/mystiai)). Many of them were startups, and their access to the market was fairly limited. The main challenges founders ran into were significant legal complexity and strict requirements around processing medical data (by definition, the most sensitive category of data), long, and sometimes very long, procurement cycles on the enterprise side, and often a certain reluctance to adopt new solutions.\n\nBased on that experience, I’d suggest starting with mid-sized organizations (10+, or even 50+ employees). Their budgets are typically large enough to make room for buying new solutions, their teams are big enough that chronic stress and burnout already meaningfully impact overall organizational performance, and their willingness to adopt innovation is often still high because they usually don’t have “ossified” processes. In large enterprises, even a small change can have major downstream consequences, so they are often less eager to introduce change.\n\nAn SMB customer base also helps you build experience and a track record that should make it easier to win enterprise clients later.\n\nHope this helps!\n\nFast iteration will be critical, because the market is highly competitive right now and you need to test multiple approaches to land on the best offer. At the same time, AI creates room for more flexibility, meaning you can deliver functionality that is more tailored to each client. Still, a human supervisor for the code will remain essential given the sensitivity of the data. I wouldn’t trust approaches like “vibe coding” in this context.",
          "score": 2,
          "created_utc": "2026-02-17 13:19:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5v4b1m",
              "author": "justchoo",
              "text": "Great insights. Thank you for taking g time to replay. Much appreciated",
              "score": 2,
              "created_utc": "2026-02-17 13:41:47",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o60yj4k",
          "author": "NatAllie_D",
          "text": "This is a brilliant idea and I wish you well I have a similar kind of idea helping undiagnosed women with the ADHD and anxiety struggles as the numbers this year as so many women hit 35+ are increasingly high. Trying to get any support or preventative support is just not an option with the NHS waiting list become in so long.. my brainstorming is still in the beginning stages at the moment but I'm hoping to build a community with a little extra, that can help people get back into work stay in work or start their own small business that can fit in better for someone with a neurodivergent brain. \nAll the best with your start up I'll look forward to following your success also",
          "score": 2,
          "created_utc": "2026-02-18 09:44:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o615z82",
              "author": "justchoo",
              "text": "Thank you for your kind words. Your vision is definitely needed. I’ll drop you a DM.",
              "score": 2,
              "created_utc": "2026-02-18 10:50:33",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o619jid",
                  "author": "NatAllie_D",
                  "text": "Brill look forward to brainstorming together",
                  "score": 1,
                  "created_utc": "2026-02-18 11:20:31",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5zjle6",
          "author": "Electronic_Shoe8405",
          "text": "Appreciate how grounded this is.\n\nOne thing I’ve seen in regulated spaces — pilots move faster when framed as risk reduction, not wellbeing. Especially in construction and healthcare.\n\nSMEs might be easier to close, but enterprise/public sector gives you stronger validation once you crack it.\n\nHave you thought about starting with one hyper-specific use case (e.g. burnout prevention for shift managers) instead of a broader mental health angle?\n\nCurious how you’re planning to measure impact without it turning into another “wellbeing initiative” box-tick exercise.",
          "score": 1,
          "created_utc": "2026-02-18 03:03:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o681ki3",
          "author": "prodigy_ai",
          "text": "Thanks for building this, John. Much needed work — especially in those sectors.",
          "score": 1,
          "created_utc": "2026-02-19 11:11:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6bahko",
          "author": "agent_iff",
          "text": "Great idea. I've been through the mental health system and in the UK and it is severely lacking. Prevention is better than cure.\n\nKudos",
          "score": 1,
          "created_utc": "2026-02-19 21:30:35",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r7xnmw",
      "title": "Same product. same price. dubai customers bought the dream. singapore customers bought the logic.",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1r7xnmw/same_product_same_price_dubai_customers_bought/",
      "author": "Acer53",
      "created_utc": "2026-02-18 08:36:54",
      "score": 3,
      "num_comments": 1,
      "upvote_ratio": 0.72,
      "text": "As i was in dubai and Singapore for tetr programme,we ran the exact same product in both dubai and singapore. didn’t change the product. didn’t change the price. everything else had to change.\n\nwhat worked in dubai: people responded to how it looked. clean visuals. lifestyle shots. aspirational tone. the product wasn’t just a tool, it was part of an identity. influencer posts converted better than detailed explanations. the word “premium” did a lot of heavy lifting.\n\nwhat worked in singapore: completely different energy. people wanted to understand what it actually does. practical benefits. comparisons. reviews. proof. specs. they cared less about the story and more about whether it made sense to buy.\n\nsame landing page failed in singapore that worked in dubai. and vice versa. made me realize localization isn’t about language. it’s about psychology.\n\nhave your run ads in different countries? how did market treat you?",
      "is_original_content": false,
      "link_flair_text": "knowledge",
      "permalink": "https://reddit.com/r/startup/comments/1r7xnmw/same_product_same_price_dubai_customers_bought/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o61ygis",
          "author": "hibikiafterdark",
          "text": "Working in creative comms in both cities.   \nLove to learn more on your journey.   \nSeems like awesome learnings.",
          "score": 1,
          "created_utc": "2026-02-18 14:00:15",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r3w0q0",
      "title": "Small ATS tip that made a big difference for my team",
      "subreddit": "startup",
      "url": "/r/ModernHiring/comments/1r3vwp3/small_ats_tip_that_made_a_big_difference_for_my/",
      "author": "luce_scotty",
      "created_utc": "2026-02-13 17:52:38",
      "score": 3,
      "num_comments": 0,
      "upvote_ratio": 1.0,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1r3w0q0/small_ats_tip_that_made_a_big_difference_for_my/",
      "domain": "",
      "is_self": false,
      "comments": []
    },
    {
      "id": "1r79ldb",
      "title": "Where does one find the right co-founder?",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1r79ldb/where_does_one_find_the_right_cofounder/",
      "author": "Bubbly-Air7302",
      "created_utc": "2026-02-17 15:49:28",
      "score": 3,
      "num_comments": 14,
      "upvote_ratio": 1.0,
      "text": "I’m more of a visionary, strategic thinker — whilst I can do the nitty gritty I’d prefer to have someone else who is good at operations / finance as I don’t believe that is my strong suit.\n\n**Q is — if your network is limited:**\n\na) are you f\\*cked?\n\nb) if not, where does one find a compatible & trustworthy co-founder?\n\nis it best to start a venture with someone you know or can one feasibly find someone trustworthy who is technically a complete stranger?\n\napologies if this is a dumb question & thank you for your advice.",
      "is_original_content": false,
      "link_flair_text": "knowledge",
      "permalink": "https://reddit.com/r/startup/comments/1r79ldb/where_does_one_find_the_right_cofounder/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o5zad22",
          "author": "chrisf_nz",
          "text": "Just out of interest, what have you achieved to consider yourself a visionary?",
          "score": 3,
          "created_utc": "2026-02-18 02:12:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o63538l",
              "author": "Bubbly-Air7302",
              "text": "Being a visionary or displaying visionary thinking is about the thought process not necessarily achievements. Not that interested in going through all of my achievements though I know I’m capable of thinking about problems/solutions at a grand scale. ",
              "score": 1,
              "created_utc": "2026-02-18 17:21:18",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o63uulk",
                  "author": "joshdotmn",
                  "text": "Thoughts are cheap. Execution is not.",
                  "score": 1,
                  "created_utc": "2026-02-18 19:15:13",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o642ip5",
                  "author": "Successful-Brick-783",
                  "text": "Hard disagree, outcomes are what differentiate \"visionary thinking\" from delusion",
                  "score": 1,
                  "created_utc": "2026-02-18 19:50:36",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5z99f2",
          "author": "shazej",
          "text": "You’re not screwed if your network is small you just have to build it intentionally. Hackathons, startup events, operator communities, even Twitter/LinkedIn DMs. But don’t ‘find’ a co-founder first build something small together. Trust comes from shared execution, not resumes. Starting with someone you know helps, but working on a real problem together matters more.",
          "score": 1,
          "created_utc": "2026-02-18 02:06:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5zjq24",
          "author": "Electronic_Shoe8405",
          "text": "You’re not screwed if your network is small.\n\nBut you probably shouldn’t rush into a co-founder just to fill a gap either.\n\nI’ve seen better outcomes when people work together on a small project first. Something low-stakes. You learn way more from 4 weeks of working together than from 20 coffee chats.\n\nStrangers can work. But trust usually comes from shared stress, not shared vision.\n\nAlso worth asking — do you actually need a co-founder right now, or just someone strong in ops/finance you can contract early on?\n\nWhat stage are you at? Idea or already building?",
          "score": 1,
          "created_utc": "2026-02-18 03:04:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o605s2c",
          "author": "Willing-Training1020",
          "text": "Not a dumb question and no you're not f\\*cked. Limited network just means you have to be more intentional. YC cofounder matching, Indie Hackers, On Deck, and LinkedIn all have people actively looking. The key is to work on something small together before committing, a side project, a few weeks of building, anything that shows how you collaborate under pressure. Starting with a stranger can work but treat it like dating, don't get married after the first date, build the trust first.",
          "score": 1,
          "created_utc": "2026-02-18 05:29:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o60xfjo",
          "author": "NatAllie_D",
          "text": "Oooh thank you for this... This validates a idea I have running around living rent free in my head at the moment. Yes it's another networking idea but I like to do things out of the box too and not follow the norm, so stay turned and I'll hop back on this sub Reddit when I've done some more research myself. Thanks guys & girls",
          "score": 1,
          "created_utc": "2026-02-18 09:33:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o633vkk",
          "author": "KiraKgoesRdt",
          "text": "where are you located? You know there are not only match making events out there but also incubators that help you with this explicitly?",
          "score": 1,
          "created_utc": "2026-02-18 17:15:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o634l38",
              "author": "Bubbly-Air7302",
              "text": "I’m based in DC currently, soon to be back to London.\n\nAnd yes I am aware and would also like to hear about people’s experiences using this type of match service. ",
              "score": 1,
              "created_utc": "2026-02-18 17:19:02",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o66thdk",
          "author": "Unlikely_Handle_4891",
          "text": "That's a million dollar question mate, and you are not alone. \n\nI am a non tech founder running a tech product. Have flipped through 3 tech co founders, always to find missing synergies & compatabilities. It's a journey that you have to keep travelling. \n\nI got the first from my college network (a senior of mine), the second came from a local founder's community and the third one came from an online community.\n\nWhat I have learnt now is that you always start with a trial, dont commit things upfront in excitement. It's exactly like dating, go slow.",
          "score": 1,
          "created_utc": "2026-02-19 04:43:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6acavz",
          "author": "andynadal_",
          "text": "I would go out looking for a Founder for an existing idea, but build a network from people in the space, even startup employees, they might want to start a startup at some point. The founders dynamic is like marriage, you need to know how they work and operate, the most important trait? Stability",
          "score": 1,
          "created_utc": "2026-02-19 18:45:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ccew7",
          "author": "derpingthederps",
          "text": "A stranger is fine... But find the right stranger. \n\nFind someone passionate, interested, and who can communicate with you easily.\nLike, finding a friend.\n\nSet the rules early too. Stake in the business, profit share, etc? \n\nPeople will expect an equal share though, your idea sure, but you want their expertise and until you have revenue... you don't have much leverage. \n\nOr if it's small time... Hire someone on an hourly rate to support your needs. A few hours a week or something.\nIt's also really about what your idea is too and its scale. \nOtherwise, try a business support event for advice.\n\nDon't get hung up on small stuff though",
          "score": 1,
          "created_utc": "2026-02-20 01:00:25",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}