{
  "metadata": {
    "last_updated": "2026-03-01 16:49:58",
    "time_filter": "week",
    "subreddit": "Startup_Ideas",
    "total_items": 20,
    "total_comments": 168,
    "file_size_bytes": 151489
  },
  "items": [
    {
      "id": "1rcbo62",
      "title": "My SaaS just crossed 3,000 users in 60 days 🥳",
      "subreddit": "Startup_Ideas",
      "url": "https://www.reddit.com/r/Startup_Ideas/comments/1rcbo62/my_saas_just_crossed_3000_users_in_60_days/",
      "author": "Conscious-Ferret-937",
      "created_utc": "2026-02-23 08:08:20",
      "score": 106,
      "num_comments": 48,
      "upvote_ratio": 0.96,
      "text": "Hey guys,\n\n3 months ago, I built an AI tool that turns screen recordings into polished SaaS demo videos with AI instructional scripting and human-like voiceover.\n\nI grew to these numbers by:\n\n→ Launching my SaaS on subreddits where founders and indiehackers hangout\n\n* SaaS\n* MicroSaaS\n* Buildinpublic\n* scaleinpublic\n* SideProject\n* launchignitor\n\n→ Using reddit alerts tool f5bot, to track every post with keyword related to \"SaaS demo\", \"Support\" and commenting my thoughts before asking them to try videomule.\n\n→ Targeting \"what are you building?\" posts on founder-related subreddits.\n\n* I went through the comment section on these posts and shortlisted products that didn’t have demo videos on their websites\n* Then I created a short product demo video for them using my tool.\n* Finally I replied to their comments with the link to the video. This helped me plug VideoMule organically by showing them what was possible.\n\n→ I also launched on 15 high-quality SaaS & AI directories, which will help us generate consistent inbound traffic over time.\n\nApart from Reddit, I experimented with manual LinkedIn outreach to founders:\n\n→ I made a list of founders who got funded by YC in the last 24 months.\n\n→ Reached out through LinkedIn InMail and connection requests with short,  \npersonalized messages\n\nHere's the stats for VideoMule so far:\n\n* 3,400+ total users\n* 12,000 website visitors\n\nFor those who have never heard of VideoMule, it works like this:\n\n* You upload a screen recording showing any of your SaaS features (no voice needed)\n* The app analyzes each frame of the video & writes a clean step-by-step script\n* Finally, the AI adds a humanlike voiceover & creates a polished product demo video\n\nYou can check it out here: [https://videomule.ai/](https://videomule.ai/)\n\nI'm glad for any feedback/suggestions/roasts in the comments.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Startup_Ideas/comments/1rcbo62/my_saas_just_crossed_3000_users_in_60_days/",
      "domain": "self.Startup_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o6x4caz",
          "author": "HarjjotSinghh",
          "text": "this is unreasonably cool actually!",
          "score": 6,
          "created_utc": "2026-02-23 08:17:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6xdcq5",
              "author": "Conscious-Ferret-937",
              "text": "Hey, thanks a lot for the support!",
              "score": 1,
              "created_utc": "2026-02-23 09:46:52",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6xhrlr",
          "author": "moosic",
          "text": "Can you do mobile app demos?",
          "score": 3,
          "created_utc": "2026-02-23 10:28:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6x4ym3",
          "author": "Upstairs-Score-4167",
          "text": "Okay this is actually refreshing to read.\n\nYou did not just post links everywhere and hope something sticks. You literally created demo videos for founders who did not even ask for it. That is such a simple move but most of us would not take the time to do it. Showing instead of telling is underrated.\n\nThe Reddit angle makes sense too. Commenting early, being helpful first, then plugging your tool organically is way smarter than just dropping a link and disappearing. I have tried the lazy version before and yeah… it does not work.\n\n3k plus users in 60 days is solid. Not “Twitter hype” solid, but real traction solid. Respect for sharing the actual playbook instead of vague growth advice. Curious what your retention looks like so far?",
          "score": 2,
          "created_utc": "2026-02-23 08:23:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6x5yub",
          "author": "RelationCharacter476",
          "text": "nice work with F5Bot. i've been using RedShip for similar monitoring and it catches a lot of the same stuff but with AI relevance scoring so you're not digging through as much noise. F5Bot did the job for you though so honestly if it's working, no need to switch. curious if you tracked which subreddits actually converted best for you?",
          "score": 1,
          "created_utc": "2026-02-23 08:33:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6xkin4",
          "author": "udaan04",
          "text": "Why name if videomule though? 🤔",
          "score": 1,
          "created_utc": "2026-02-23 10:54:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6xyxrr",
          "author": "Regular-Mission-1860",
          "text": "Unique startup idea",
          "score": 1,
          "created_utc": "2026-02-23 12:50:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6y1iv9",
          "author": "velarion123",
          "text": "*This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*\n\nsmell governor connect cheerful fearless instinctive society cake bow deer",
          "score": 1,
          "created_utc": "2026-02-23 13:07:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6y2t9u",
          "author": "Rajp321",
          "text": "Interesting. Can i ask how many are paid users and whats your major traffic source?\n\n",
          "score": 1,
          "created_utc": "2026-02-23 13:15:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ya4x2",
          "author": "Professional-Cold405",
          "text": "This is awesome! I need this",
          "score": 1,
          "created_utc": "2026-02-23 13:58:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6yddc0",
          "author": "Arpit735",
          "text": "Congratulations, mate! How did you gather that list of YC startup founders?",
          "score": 1,
          "created_utc": "2026-02-23 14:17:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6yhfqa",
          "author": "Consistent_School969",
          "text": "Congrats on the traction — 3,400 users in 3 months from a cold start is no joke.\n\nCurious about one thing though: what drove the spike to 20k+ monthly visitors? Was that purely organic from the Reddit + directory strategy, or did you layer in any paid distribution at some point? Trying to understand if the numbers are replicable without ad spend.",
          "score": 1,
          "created_utc": "2026-02-23 14:39:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ym3g8",
          "author": "RoleHot6498",
          "text": "Sounds like somebody should think about raising capital and scaling big ",
          "score": 1,
          "created_utc": "2026-02-23 15:03:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ywlr1",
          "author": "Simple-Optimist-93",
          "text": "Looks very promising! Congratulations.\nHow did you approach pricing for VideoMule.ai?",
          "score": 1,
          "created_utc": "2026-02-23 15:54:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6z5gxc",
          "author": "GarbageOk5505",
          "text": "That's basically productized cold outreach  you're leading with value instead of a pitch. Smart.\n\nCurious about the Reddit alerts strategy  how fast do you typically respond after f5bot triggers? I've found the first 30-60 min window on a post is where most of the engagement happens. After that you're buried.",
          "score": 1,
          "created_utc": "2026-02-23 16:35:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6zd192",
              "author": "Wide_Brief3025",
              "text": "You’re spot on about the power of that first engagement window. I try to have notifications set as granular as possible so I can catch posts right away and jump in with something genuinely useful. If you want even faster and more targeted alerts, ParseStream does a solid job filtering key discussions so you can respond almost instantly where it matters most.",
              "score": 1,
              "created_utc": "2026-02-23 17:10:57",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6z8b5r",
          "author": "Substantial-Mark3690",
          "text": "This looks really good. I’m very happy for you. :)\nI’m working on a project too. \nI’m working more towards beta and getting a waiting list (to ensure the idea is validated by the market).",
          "score": 1,
          "created_utc": "2026-02-23 16:48:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6zn457",
              "author": "EarEnvironmental5991",
              "text": "what you working on, need some help? looking for a cofounder. Got a project myself",
              "score": 1,
              "created_utc": "2026-02-23 17:58:04",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o709l1e",
          "author": "mdsb_",
          "text": "Chapeau, l’approche est carré 👍",
          "score": 1,
          "created_utc": "2026-02-23 19:41:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o71pxj9",
          "author": "chaibytesai",
          "text": "This is a really good guide. Really love you approach of “Targeting \"what are you building?\" posts on founder-related subreddits.” \n\nDo you know how much of your traffic came from reddit vs directories?\n\nIn a similar situation with my product (just starting with marketing to get initial users) and trying to evaluate reddit as an option vs other channels",
          "score": 1,
          "created_utc": "2026-02-24 00:06:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o72gs8u",
          "author": "CachinnateOfficial",
          "text": "Congratulations! Thank you for the actual data and steps you took, great Idea too I can see how it solves founders pain points for promoting their products.",
          "score": 1,
          "created_utc": "2026-02-24 02:40:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o72kd1u",
          "author": "Sharp_Animal",
          "text": "huge congrats on 3k in 60 days - that reddit playbook is tight and the unsolicited demo angle is genius  \nif you haven’t already, track the funnel like comment -> click -> signup -> first export and test a tiny watermark-free teaser export to cut dropoff - those 10s wins add up  \ni’m solo building smarter.day and batching outreach in timeboxed blocks (tasks + calendar in one view) helped alot with focus, and yeah balancing perf vs features took longer than i planned",
          "score": 1,
          "created_utc": "2026-02-24 03:00:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o72vl8w",
          "author": "Little_Total9000",
          "text": "Which AI did you use and what was its cost?",
          "score": 1,
          "created_utc": "2026-02-24 04:11:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o75mwon",
          "author": "Volitium",
          "text": "Congrats 🍾🎉",
          "score": 1,
          "created_utc": "2026-02-24 16:02:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7hegxf",
          "author": "InvitePatient9411",
          "text": "È una buona idea ma pagare per un test non mi convince.",
          "score": 1,
          "created_utc": "2026-02-26 08:38:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7xn1js",
          "author": "Penguin_Aerie9983",
          "text": "Amazing distribution! Tool is really needed in the founder space.",
          "score": 1,
          "created_utc": "2026-02-28 20:01:52",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rd3pg0",
      "title": "solo founder. $7k+ MRR. zero ads. zero employees. here's exactly what worked.",
      "subreddit": "Startup_Ideas",
      "url": "https://www.reddit.com/r/Startup_Ideas/comments/1rd3pg0/solo_founder_7k_mrr_zero_ads_zero_employees_heres/",
      "author": "CleverSquirrel_p",
      "created_utc": "2026-02-24 03:29:55",
      "score": 92,
      "num_comments": 44,
      "upvote_ratio": 0.82,
      "text": "look i know another \"how i made it\" post. but hear me out.\n\ni see you grinding at 2am wondering if you should dump your last $500 into google ads. don't.\n\ni wasted months trying to run paid campaigns before i realized something. as a solo founder with zero budget you have superpowers that funded teams don't. here's exactly how i used them.\n\n1\\\\ the \"one person everywhere\" illusion\n\nbig companies need meetings to tweet. you don't.\n\ni set up alerts for every keyword related to my niche. responded to every relevant question on twitter, reddit, indie hackers, and random discord servers within minutes. for months straight. people thought i was a team of 5.\n\nreality: just me with notifications turned up to 11.\n\n2\\\\ forget your roadmap\n\nthis one's controversial but i threw away my 6 month roadmap.\n\nstarted shipping what users asked for this week. literally built features while on calls with customers. one guy watched me push his feature request live. he referred 4 customers that month.\n\nyour speed is your moat when you're solo. use it.\n\n3\\\\ the pricing move that saved everything\n\ni charged $45/mo from day one. people told me i was crazy. \"nobody will pay that for a new tool from some random founder.\"\n\nbut here's what happened. the people who paid $45 actually used the product. they gave real feedback. they stuck around. they told other founders about it.\n\nthe free users from my earlier products? ghosted after 3 days. every single time.\n\nhigher price = more serious customers = less support = more revenue. it's not even close.\n\n4\\\\ the boring marketing goldmine\n\nwhile everyone's trying to go viral on twitter i did the most unsexy thing possible.\n\nwrote posts answering the most specific questions my exact customers google at 2pm on a tuesday. stuff like \"how to find saas ideas on reddit\" or \"best way to validate a startup idea\" or \"what are people complaining about on g2\"\n\nnow i get signups on autopilot every single day. been steady for months.\n\n5\\\\ competitor's worst nightmare strategy\n\nthis one's borderline evil but\n\n\\> set up alerts for \"\\[competitor\\] alternative\"\n\n\\> made comparison content for every major competitor\n\n\\> hung out in their communities and genuinely helped people\n\n\\> created guides for switching from their tool to mine\n\na huge chunk of my customers are competitor refugees. sorry not sorry.\n\n6\\\\ the solo founder's real edge\n\nyou can't outspend them. you can't out-hire them. you can't out-feature them.\n\nbut you can out-care them.\n\nevery customer knows my name. every feature request gets a personal response even if it's a no. every churned user gets a message asking what i could've done better.\n\nbig companies literally cannot do this. their support team doesn't know their ceo. you ARE the ceo.\n\n7\\\\ why ads are a solo founder trap\n\nreal talk. ads need constant feeding. new creatives. split tests. landing page optimization. tracking pixels. attribution windows.\n\nthat's a full time job. you know what you should be doing instead? building stuff that compounds while you sleep.\n\none reddit post i wrote 3 months ago still brings in signups today. one directory submission i did in week 2 still ranks. that's the kind of marketing that actually works when you're solo.\n\nmy actual daily routine (total cost: $0)\n\nmorning:\n\n\\> check reddit and twitter mentions. respond to everything\n\n\\> send a personal message to every new signup\n\nafternoon:\n\n\\> one customer call\n\n\\> ship one thing even if it's tiny\n\nevening:\n\n\\> write one piece of content. post. tweet. whatever\n\nthat's it. no fancy automation. no virtual assistants. no growth hacks.\n\nthe part nobody talks about:\n\ni still have time for school. i take weekends mostly off. revenue keeps growing even on days i don't touch the product.\n\nbecause sustainable beats scalable when you're solo.\n\nyou don't need to mass hiring or 80 hour weeks. you need to work on the right things for 3 to 4 focused hours a day.\n\n500+ paying customers. $7k+ MRR. zero ads. zero employees. just showing up every single day in the places where my customers already hang out.\n\nthe best part? when people eventually come knocking asking how i did it the answer is embarrassingly simple.\n\ni just didn't quit.\n\nEdit: [link](https://bigideasdb.com/) if you are curious",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Startup_Ideas/comments/1rd3pg0/solo_founder_7k_mrr_zero_ads_zero_employees_heres/",
      "domain": "self.Startup_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o73icdj",
          "author": "logicalflex",
          "text": "Been seeing your posts for a while now. You use to have a lot more engagement. What happen? Do you think people are getting tired of your spam?",
          "score": 13,
          "created_utc": "2026-02-24 07:09:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o76bwnf",
              "author": "mugadaud",
              "text": "bro was waiting for this",
              "score": 2,
              "created_utc": "2026-02-24 17:55:18",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o76cv4o",
                  "author": "logicalflex",
                  "text": "Nope.🙂‍↔️",
                  "score": 1,
                  "created_utc": "2026-02-24 17:59:32",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o79p7c4",
              "author": "Hazy_Fantayzee",
              "text": "lol I knew what this was spam for even before clicking the link!!",
              "score": 1,
              "created_utc": "2026-02-25 04:13:13",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o7ppduw",
              "author": "teatopmeoff",
              "text": "He couldn’t continue to pay for the astroturf bots",
              "score": 1,
              "created_utc": "2026-02-27 15:20:33",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7ppzsw",
                  "author": "logicalflex",
                  "text": "Lol",
                  "score": 1,
                  "created_utc": "2026-02-27 15:23:30",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o75htfx",
          "author": "architecturlife",
          "text": "Account age: 14 days. \n\nSpam",
          "score": 7,
          "created_utc": "2026-02-24 15:39:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o73g225",
          "author": "random-trader",
          "text": "I was serious about you advise and there are good points there. But then I looked at the saas. Immediately, fuck. Yet another lead gen or idea gen. 0 usp. Chatgpt wrapper. Only useless people wiiuse you product and you need to do this constantly. You wouldn't have succeed on ads anyway.",
          "score": 5,
          "created_utc": "2026-02-24 06:49:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o77mvnk",
          "author": "_SeaCat_",
          "text": "A month ago, it was just 3K MRR ;-)\n\nIf any of this would be true, you would tell us rather how you jumped from 3K to 7K instead. \n\n[https://www.reddit.com/r/SaaS/comments/1qmpkip/my\\_saas\\_hit\\_3k\\_monthly\\_in\\_8\\_months\\_heres\\_what\\_id/](https://www.reddit.com/r/SaaS/comments/1qmpkip/my_saas_hit_3k_monthly_in_8_months_heres_what_id/)\n\n",
          "score": 2,
          "created_utc": "2026-02-24 21:28:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o74t1d2",
          "author": "boz_lemme",
          "text": "Super nice write-up, thanks! Curious, what's your target customer profile? $199 is quite a big sum for most indies and you're obviously not targeting teams.",
          "score": 1,
          "created_utc": "2026-02-24 13:34:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o764yoq",
          "author": "gregb_parkingaccess",
          "text": "Point 3 hit hard. I launched a voice task app at $4.99/mo and the free users from beta ghosted within days. The ones who paid? They send me bug reports, feature requests, and tell their friends. Paid users are co-builders. Free users are tourists.\n\nPoint 6 is the real moat though. I reply to every single App Store review personally. One user told me that's the reason she recommended it to her entire ADHD support group. No funded team is doing that.\n\nOnly thing I'd push back on: the \"forget your roadmap\" advice works early but breaks down once you have 500+ users pulling you in 50 directions. At some point you need a filter for which requests actually move retention, not just make one loud customer happy.",
          "score": 1,
          "created_utc": "2026-02-24 17:23:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o76a7ee",
          "author": "Dry-Necessary-1302",
          "text": "What did you build but?",
          "score": 1,
          "created_utc": "2026-02-24 17:47:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o78zjj0",
          "author": "Intelligent-Past1633",
          "text": "The \"one person everywhere\" illusion really hits home for me – I've been doing something similar by setting up Google Alerts for industry keywords and it's insane how many opportunities pop up that bigger companies just miss.",
          "score": 1,
          "created_utc": "2026-02-25 01:44:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o79399g",
              "author": "Wide_Brief3025",
              "text": "Staying on top of conversations in your niche is such a game changer, and Google Alerts only scratches the surface. I found that using something like ParseStream, which scans multiple platforms and alerts you in real time, makes it easier to spot the most relevant leads before anyone else. It definitely helped me be quicker to jump in where it matters.",
              "score": 1,
              "created_utc": "2026-02-25 02:05:20",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o75mnt9",
          "author": "Extension-Mousse-526",
          "text": "This is solid gold! Thank you so much for the encouragement.  I appreciate you and what you built.  As a solo founder its always hard to see yourself up against the giants of industry.  I created a ai music generator and google just entered the fray, albeit 30 second clips and we do full songs.  I also launched a mobile home listing site i know is better than my top conpeteitor but they do $30m per years and I am over here sometimes like how will i compete.  I can get better because I am leaner, faster and more creative than they can even with their huge budget.  I know it can be done and you just validated that it can.",
          "score": 1,
          "created_utc": "2026-02-24 16:01:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o72sa04",
          "author": "purnasatyap",
          "text": "Very interesting. Very innovative. Thinking in the same lines of late.",
          "score": 0,
          "created_utc": "2026-02-24 03:49:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o73nt11",
          "author": "Informal-Virus4452",
          "text": "this is the unsexy truth. it’s just reps and showing up.\n\nthe “one person everywhere” thing works because most people quit after 2 weeks. consistency makes you look bigger than you are.\n\nand yeah I’d rather tighten positioning or clean up a landing page in Notion/Runable than burn cash on ads. compounding beats spikes every time.",
          "score": 0,
          "created_utc": "2026-02-24 07:59:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o72vuyw",
          "author": "MusicTechGearhead",
          "text": "I kind of agree with every one of your points you made. And the beauty of solopreneurship is that you don’t have to make millions of dollars just to keep the employees.  Small dedicated customers will be enough to quit your day job. You just have to take care of your customers very well.",
          "score": -2,
          "created_utc": "2026-02-24 04:13:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o72v4gx",
          "author": "Wide_Brief3025",
          "text": "Jumping into conversations right as they happen is seriously underrated for solo founders. I found tracking keywords across different platforms essential but it got overwhelming to stay on top of everything, so using ParseStream to monitor and get instant alerts for mentions really helped me join those needle in the haystack threads without burning out.",
          "score": -3,
          "created_utc": "2026-02-24 04:08:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o73of9q",
              "author": "Informal-Virus4452",
              "text": "yeah 100%. the speed matters more than people think. early reply = visibility. late reply = ghost town.  \nI’ve tried doing it manually and it just turns into chaos after a week. alerts are basically mandatory if you’re solo.  \n as long as you don’t fall into the trap of monitoring more than building, it’s a solid edge.\n\n",
              "score": -2,
              "created_utc": "2026-02-24 08:05:25",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1rft2og",
      "title": "I spend 30 minutes a day on marketing and it brings in more customers than any ad ever did",
      "subreddit": "Startup_Ideas",
      "url": "https://www.reddit.com/r/Startup_Ideas/comments/1rft2og/i_spend_30_minutes_a_day_on_marketing_and_it/",
      "author": "CleverSquirrel_p",
      "created_utc": "2026-02-27 01:32:33",
      "score": 76,
      "num_comments": 30,
      "upvote_ratio": 0.81,
      "text": "everyone overcomplicates marketing when you're a solo founder. you don't need to mass dm people or spend hours a day writing content from scratch. here's my actual daily routine that costs $0 and consistently brings in signups every week.\n\nthe core idea: automate the creation, approve the output, stay consistent without burning out.\n\ni use an ai agent called openclaw that basically handles 90% of the grunt work. it sends me drafts on telegram (but i switched to whatsapp recently) every morning. i review them, tap approve, and move on. the whole thing takes about 45 minutes a day and covers every channel.\n\nhere's the breakdown:\n\ntiktok and instagram reels (10 min/day)\n\nopenclaw scans what's performing in my niche daily and generates slideshow carousels with hooks based on other performing posts. it writes the captions, adds text overlays, positions everything correctly, and uploads them as drafts. i open tiktok, pick a trending audio, hit publish. that's it. if a hook flopped it gets logged. if one hit 200k views, three variations show up the next morning automatically.\n\ntwitter and linkedin (15 min/day)\n\nevery morning openclaw drafts 3 posts based on what's trending in my space. it uses my best performing post formats as templates so the style stays consistent. it also finds conversations where someone is literally asking about the problem i solve and drafts replies. everything gets sent to my telegram for approval. i scroll through, tap approve on the ones i like, and they go live. over time it learns which hooks get engagement and which post styles drive profile clicks and adjusts on its own. i also just scroll twitter for fun during this time and if i see something interesting in my niche i'll note it and openclaw turns it into content the next day.\n\nseo and blog content (5 min/day)\n\nopenclaw identifies high intent keywords people are already googling. stuff like \"\\[competitor\\] alternatives\" and \"best \\[category\\] tools 2026.\" it drafts full blog posts targeting those bottom of funnel searches. it also repurposes my top performing reddit posts and twitter threads into long form articles so the content is already validated by upvotes before it even becomes a blog post. i get the draft, approve it, it publishes.\n\nreddit (10 min, 2x per week)\n\nnothing crazy here. openclaw scans 5 to 8 subreddits daily for posts mentioning keywords in my niche. it flags threads where people are complaining about the exact problem i solve and drafts long form value posts following the format that actually gets upvoted on reddit. real data, real lessons, product mentioned naturally somewhere in the middle. it also drafts comment replies for high intent posts. sends me everything on telegram, i read it, approve it, it goes live. i only do this twice a week so it never feels like a grind.\n\ncold emails (5 min/day)\n\nopenclaw pulls prospects from apollo matching my icp, scrapes their recent linkedin posts, and references something specific they said. it drafts a full 5 email sequence. no pitch in email 1, case study in email 2, specific niche data in email 3, social proof in email 4, breakup in email 5. sends 150 to 200 personalized emails daily through resend. a/b tests subject lines automatically and flags anyone who opened 3 or more times so i can follow up personally.\n\nthat's 45 minutes a day total. here's what this has done over 1 month: 1,000+ users with $0 ad spend/\n\nthe whole system learns from itself. every post, email, and article feeds data back in. it doesn't get lucky. it gets better. every single day.\n\nwhat didn't work before i set this up:\n\ntrying to do all of this manually. i burned out in 2 weeks\n\nmarketing doesn't have to take the entire day if you have the right system setup. openclaw also runs on my old raspberry pi too lol I don't have a mac mini. can run on anything really. if you're a solo founder doing zero marketing because \"the product should sell itself\" it won't.\n\nEdit: here is [the link](https://bigideasdb.com/) if anyone is interested",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Startup_Ideas/comments/1rft2og/i_spend_30_minutes_a_day_on_marketing_and_it/",
      "domain": "self.Startup_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o7ozy5o",
          "author": "the_general1",
          "text": "Did you ask claude to not capitalize a single letter, just so people wouldn't identify it as AI generated?",
          "score": 24,
          "created_utc": "2026-02-27 13:02:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7q8mkh",
          "author": "Relevant-Rabbit5280",
          "text": "Por qué permiten este tipo de publicaciones mierdas?",
          "score": 6,
          "created_utc": "2026-02-27 16:51:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7pdf9r",
          "author": "CurveNo5173",
          "text": "So AI generated that you write 30 minutes in the title and you ended up with 45 in the description.  \nPeople like you will be the ones who are going to lose their job because of AI in the first place, because you just completely forgot to think and started to copy paste AI answers without review or any actual thinking.\n\nLet's hope at least you spend more than 30/45 minutes on the product or it will be as useless as this post.",
          "score": 6,
          "created_utc": "2026-02-27 14:19:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7sy45w",
          "author": "_SeaCat_",
          "text": "You forgot to mention spamming reddit :))))",
          "score": 1,
          "created_utc": "2026-02-28 01:15:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o80v2h2",
          "author": "ConfidentReality9024",
          "text": "AI slop generator ",
          "score": 1,
          "created_utc": "2026-03-01 08:42:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o82pgza",
          "author": "EvenVacation4024",
          "text": "\"an ai agent called openclaw\" 😄",
          "score": 1,
          "created_utc": "2026-03-01 16:28:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7njvot",
          "author": "mkdwolf",
          "text": "Maybe you can try some other marketing tools relevant for you. \n\nThere are some free options here: [https://offerfinder.org/marketing.html](https://offerfinder.org/marketing.html) ",
          "score": -5,
          "created_utc": "2026-02-27 05:41:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7osvjd",
          "author": "Mean-Arm659",
          "text": "This is such a clean example of systems over hustle. The feedback loop is the real asset here, not just the automation. Most solo founders burn out because they never close that loop.",
          "score": -6,
          "created_utc": "2026-02-27 12:14:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7pbrsk",
              "author": "Hazy_Fantayzee",
              "text": "What in the gpt does any of that mean ?",
              "score": 4,
              "created_utc": "2026-02-27 14:10:39",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7qnepo",
                  "author": "RoleHot6498",
                  "text": "😂... Took the words right out of my mouth",
                  "score": 3,
                  "created_utc": "2026-02-27 18:02:03",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1rgyiko",
      "title": "The 2026 Growth Strategy Everyone's Sleeping On",
      "subreddit": "Startup_Ideas",
      "url": "https://www.reddit.com/r/Startup_Ideas/comments/1rgyiko/the_2026_growth_strategy_everyones_sleeping_on/",
      "author": "WorthFan5769",
      "created_utc": "2026-02-28 09:40:09",
      "score": 32,
      "num_comments": 11,
      "upvote_ratio": 0.92,
      "text": "Here's a startup idea nobody's talking about:\n\nOptimization for AI search is still early.\n\nBut it's going to be huge.\n\n**The Problem:**\n\n* Google has 1000 results for every query\n* ChatGPT gives 2-4 results\n* Getting recommended by ChatGPT = 17x conversion\n* But nobody's optimizing for it yet\n\n**The Opportunity:** Write comparison pages optimized for AI.\n\nGet recommended by ChatGPT.\n\nGet customers.\n\n**Why now:**\n\n* ChatGPT is 1 year old (barely adopted yet)\n* Competition is low\n* Early movers will dominate\n\n**Real example:** Tally (form builder):\n\n* Wrote comparison pages\n* Got recommended by ChatGPT\n* 2000 new users\n* 17x conversion vs Google\n\nThis is the play right now.\n\nIn 2-3 years:\n\n* Everyone will be optimizing for AI search\n* Competition will be fierce\n* Prices will be lower\n\nBut right now?\n\nEarly movers can dominate.\n\n**How to execute:**\n\n1. Pick a niche with 5-10 main competitors\n2. Write 10-15 comparison pages (2000+ words each)\n3. Optimize for AI (comprehensive, honest, actionable)\n4. Wait for ChatGPT to recommend you\n5. Get customers at 17x conversion rate\n\nThis is the 2026 play.\n\nAnyone thinking about this?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Startup_Ideas/comments/1rgyiko/the_2026_growth_strategy_everyones_sleeping_on/",
      "domain": "self.Startup_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o7v5k7b",
          "author": "jonathonjames",
          "text": "4. How long is the wait?",
          "score": 3,
          "created_utc": "2026-02-28 11:44:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7xme84",
          "author": "elVanPuerno",
          "text": "I’m glad you say no one is doing it because it’s how I’ve been winning business the last 6 months. I have real closed deals, launched websites, and AEO performance case studies…\n\nWhy did OP say ChatGPT is less than a year old?\n",
          "score": 2,
          "created_utc": "2026-02-28 19:58:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7w8b4k",
          "author": "NellieApp",
          "text": "Sounds promising, but it would probably be very hard to measure your exposure compared to typical search. Do you have any insight on what objectively 'optimizes a page for AI'?  \n  \nAs far as I know we don't understand their data collection pipeline, or how they deduplicate and minify their dataset.  \n  \nUnless we're just working with their web search tool, you could only appear in future versions using future datasets, and if you're not performing well in that dataset you'll never really know, and you can't check again until there's a new version.",
          "score": 1,
          "created_utc": "2026-02-28 15:46:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7wiask",
          "author": "c4tchmeifuc4n",
          "text": "[exa.ai](http://exa.ai)",
          "score": 1,
          "created_utc": "2026-02-28 16:36:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7zlxl3",
          "author": "n3rder",
          "text": "It’s called AEO. What was formerly Search Engine Optmization, is now called Answering Engine Optimization. Definitely still a nascent field but very much discussed and worried about,",
          "score": 1,
          "created_utc": "2026-03-01 02:47:52",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rd1gqr",
      "title": "GIVEAWAY: Unlimited Veo 3.1 / Sora 2 access + FREE 30-day Unlimited Plan codes!",
      "subreddit": "Startup_Ideas",
      "url": "https://www.reddit.com/r/Startup_Ideas/comments/1rd1gqr/giveaway_unlimited_veo_31_sora_2_access_free/",
      "author": "Excellent-Grape-4758",
      "created_utc": "2026-02-24 01:52:04",
      "score": 29,
      "num_comments": 157,
      "upvote_ratio": 1.0,
      "text": "Hey everyone! 👋\n\nWe just launched a huge update on swipe.farm:\n\nThe Unlimited Plan now includes unlimited generations with Veo 3.1, Sora 2, Nano Banana, and many more models!\n\nTo celebrate this update, for the next 24 hours we’re giving away a limited batch of FREE 30-day Unlimited Plan access codes!\n\nJust comment “Unlimited Plan” below and we will send you a code (each one gives you full unlimited access for a whole month, not just today).\n\nFirst come, first served. We will send out as many as we can before they run out.\n\nGo crazy with the best models, zero per-generation fees, for the next 30 days. Don’t miss it! 🎁",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Startup_Ideas/comments/1rd1gqr/giveaway_unlimited_veo_31_sora_2_access_free/",
      "domain": "self.Startup_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o72jic9",
          "author": "Manjunath_Patil",
          "text": "Wow that's amazing!",
          "score": 1,
          "created_utc": "2026-02-24 02:55:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o79l3fb",
              "author": "Excellent-Grape-4758",
              "text": "Can you please email me at sam\\[at\\]swipe\\[dot\\]farm with a quick ‘Hi’ and I will add you to the list and reply with the access code?",
              "score": 1,
              "created_utc": "2026-02-25 03:47:19",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o72tjnm",
          "author": "Ill_Lavishness_4455",
          "text": "Count me in",
          "score": 1,
          "created_utc": "2026-02-24 03:57:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o79l3on",
              "author": "Excellent-Grape-4758",
              "text": "Can you please email me at sam\\[at\\]swipe\\[dot\\]farm with a quick ‘Hi’ and I will add you to the list and reply with the access code?",
              "score": 1,
              "created_utc": "2026-02-25 03:47:21",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o72upf9",
          "author": "edm23",
          "text": "Unlimited plan",
          "score": 1,
          "created_utc": "2026-02-24 04:05:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o79l3xn",
              "author": "Excellent-Grape-4758",
              "text": "Can you please email me at sam\\[at\\]swipe\\[dot\\]farm with a quick ‘Hi’ and I will add you to the list and reply with the access code?",
              "score": 1,
              "created_utc": "2026-02-25 03:47:24",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o72vksm",
          "author": "mildlystoic",
          "text": "Unlimited Plan",
          "score": 1,
          "created_utc": "2026-02-24 04:11:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o79l44q",
              "author": "Excellent-Grape-4758",
              "text": "Can you please email me at sam\\[at\\]swipe\\[dot\\]farm with a quick ‘Hi’ and I will add you to the list and reply with the access code?",
              "score": 1,
              "created_utc": "2026-02-25 03:47:26",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o72w2kv",
          "author": "Old_Pollution9050",
          "text": "Unlimited Plan",
          "score": 1,
          "created_utc": "2026-02-24 04:15:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o79l4di",
              "author": "Excellent-Grape-4758",
              "text": "Can you please email me at sam\\[at\\]swipe\\[dot\\]farm with a quick ‘Hi’ and I will add you to the list and reply with the access code?",
              "score": 1,
              "created_utc": "2026-02-25 03:47:28",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7319zg",
          "author": "blueicemali",
          "text": "Unlimited Plan",
          "score": 1,
          "created_utc": "2026-02-24 04:51:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o79l35r",
              "author": "Excellent-Grape-4758",
              "text": "Can you please email me at sam\\[at\\]swipe\\[dot\\]farm with a quick ‘Hi’ and I will add you to the list and reply with the access code?",
              "score": 2,
              "created_utc": "2026-02-25 03:47:16",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o79mb9l",
                  "author": "blueicemali",
                  "text": "Done",
                  "score": 1,
                  "created_utc": "2026-02-25 03:54:50",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o79mdxz",
                  "author": "blueicemali",
                  "text": "Done",
                  "score": 1,
                  "created_utc": "2026-02-25 03:55:18",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7n6wi6",
                  "author": "blueicemali",
                  "text": "I subscribed and have an issue. pls check your DMs",
                  "score": 1,
                  "created_utc": "2026-02-27 04:10:38",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o731ayi",
          "author": "CosmicDrifter188",
          "text": "Unlimited Plan",
          "score": 1,
          "created_utc": "2026-02-24 04:51:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o79l4jl",
              "author": "Excellent-Grape-4758",
              "text": "Can you please email me at sam\\[at\\]swipe\\[dot\\]farm with a quick ‘Hi’ and I will add you to the list and reply with the access code?",
              "score": 1,
              "created_utc": "2026-02-25 03:47:30",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o79llhf",
                  "author": "CosmicDrifter188",
                  "text": "Sent. Please check",
                  "score": 1,
                  "created_utc": "2026-02-25 03:50:23",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o731gjy",
          "author": "Outrageous_Text_2479",
          "text": "Unlimited plan",
          "score": 1,
          "created_utc": "2026-02-24 04:52:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o79l4r1",
              "author": "Excellent-Grape-4758",
              "text": "Can you please email me at sam\\[at\\]swipe\\[dot\\]farm with a quick ‘Hi’ and I will add you to the list and reply with the access code?",
              "score": 1,
              "created_utc": "2026-02-25 03:47:32",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o733aiw",
          "author": "blaze_005",
          "text": "Unlimited plan",
          "score": 1,
          "created_utc": "2026-02-24 05:06:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o79l4wo",
              "author": "Excellent-Grape-4758",
              "text": "Can you please email me at sam\\[at\\]swipe\\[dot\\]farm with a quick ‘Hi’ and I will add you to the list and reply with the access code?",
              "score": 1,
              "created_utc": "2026-02-25 03:47:34",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o733t7r",
          "author": "bizshark",
          "text": "Unlimited plan",
          "score": 1,
          "created_utc": "2026-02-24 05:09:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o79l53u",
              "author": "Excellent-Grape-4758",
              "text": "Can you please email me at sam\\[at\\]swipe\\[dot\\]farm with a quick ‘Hi’ and I will add you to the list and reply with the access code?",
              "score": 1,
              "created_utc": "2026-02-25 03:47:36",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o735ao1",
          "author": "BuyerStunning",
          "text": "Unlimited Plan",
          "score": 1,
          "created_utc": "2026-02-24 05:20:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "o79l5b4",
              "author": "Excellent-Grape-4758",
              "text": "Can you please email me at sam\\[at\\]swipe\\[dot\\]farm with a quick ‘Hi’ and I will add you to the list and reply with the access code?",
              "score": 1,
              "created_utc": "2026-02-25 03:47:38",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o735vrh",
          "author": "DegTrader",
          "text": "sure",
          "score": 1,
          "created_utc": "2026-02-24 05:25:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o73c9vh",
          "author": "Magnificent_bod",
          "text": "Unlimited Plan",
          "score": 1,
          "created_utc": "2026-02-24 06:17:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o79l5m0",
              "author": "Excellent-Grape-4758",
              "text": "Can you please email me at sam\\[at\\]swipe\\[dot\\]farm with a quick ‘Hi’ and I will add you to the list and reply with the access code?",
              "score": 1,
              "created_utc": "2026-02-25 03:47:41",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o73f2yj",
          "author": "TacticalConsultant",
          "text": "Unlimited Plan",
          "score": 1,
          "created_utc": "2026-02-24 06:40:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o79l62f",
              "author": "Excellent-Grape-4758",
              "text": "Can you please email me at sam\\[at\\]swipe\\[dot\\]farm with a quick ‘Hi’ and I will add you to the list and reply with the access code?",
              "score": 1,
              "created_utc": "2026-02-25 03:47:46",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o73f4pn",
          "author": "random-trader",
          "text": "Unlimited plan",
          "score": 1,
          "created_utc": "2026-02-24 06:41:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o79l69z",
              "author": "Excellent-Grape-4758",
              "text": "Can you please email me at sam\\[at\\]swipe\\[dot\\]farm with a quick ‘Hi’ and I will add you to the list and reply with the access code?",
              "score": 1,
              "created_utc": "2026-02-25 03:47:48",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o73frbp",
          "author": "ShoddyBoysenberry390",
          "text": "unlimited plan",
          "score": 1,
          "created_utc": "2026-02-24 06:46:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o79l6gj",
              "author": "Excellent-Grape-4758",
              "text": "Can you please email me at sam\\[at\\]swipe\\[dot\\]farm with a quick ‘Hi’ and I will add you to the list and reply with the access code?",
              "score": 1,
              "created_utc": "2026-02-25 03:47:49",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o73gcxu",
          "author": "Advisor-Temporary",
          "text": "Unlimited plan",
          "score": 1,
          "created_utc": "2026-02-24 06:52:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o79l6qn",
              "author": "Excellent-Grape-4758",
              "text": "Can you please email me at sam\\[at\\]swipe\\[dot\\]farm with a quick ‘Hi’ and I will add you to the list and reply with the access code?",
              "score": 1,
              "created_utc": "2026-02-25 03:47:52",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o73hhj9",
          "author": "oasacorp",
          "text": "Please count me in.  Unlimited plan codes",
          "score": 1,
          "created_utc": "2026-02-24 07:01:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o79l6x7",
              "author": "Excellent-Grape-4758",
              "text": "Can you please email me at sam\\[at\\]swipe\\[dot\\]farm with a quick ‘Hi’ and I will add you to the list and reply with the access code?",
              "score": 1,
              "created_utc": "2026-02-25 03:47:54",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o73hini",
          "author": "Far_Candy4515",
          "text": "Unlimited Plan",
          "score": 1,
          "created_utc": "2026-02-24 07:02:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o79l81o",
              "author": "Excellent-Grape-4758",
              "text": "Can you please email me at sam\\[at\\]swipe\\[dot\\]farm with a quick ‘Hi’ and I will add you to the list and reply with the access code?",
              "score": 1,
              "created_utc": "2026-02-25 03:48:05",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o73hwqj",
          "author": "NibanaCoach",
          "text": "Unlimited plan",
          "score": 1,
          "created_utc": "2026-02-24 07:05:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o79l8bz",
              "author": "Excellent-Grape-4758",
              "text": "Can you please email me at sam\\[at\\]swipe\\[dot\\]farm with a quick ‘Hi’ and I will add you to the list and reply with the access code?",
              "score": 1,
              "created_utc": "2026-02-25 03:48:09",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o73iip1",
          "author": "Alternative-Swim-230",
          "text": "Unlimited plan",
          "score": 1,
          "created_utc": "2026-02-24 07:11:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o79l8k1",
              "author": "Excellent-Grape-4758",
              "text": "Can you please email me at sam\\[at\\]swipe\\[dot\\]farm with a quick ‘Hi’ and I will add you to the list and reply with the access code?",
              "score": 1,
              "created_utc": "2026-02-25 03:48:11",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o73pq28",
          "author": "alvinpaul76",
          "text": "Unlimited Plan",
          "score": 1,
          "created_utc": "2026-02-24 08:17:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o79l8qw",
              "author": "Excellent-Grape-4758",
              "text": "Can you please email me at sam\\[at\\]swipe\\[dot\\]farm with a quick ‘Hi’ and I will add you to the list and reply with the access code?",
              "score": 1,
              "created_utc": "2026-02-25 03:48:13",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o73upi9",
          "author": "QuantNinjaStonkNerd",
          "text": "Unlimited Plan",
          "score": 1,
          "created_utc": "2026-02-24 09:05:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o79l8xc",
              "author": "Excellent-Grape-4758",
              "text": "Can you please email me at sam\\[at\\]swipe\\[dot\\]farm with a quick ‘Hi’ and I will add you to the list and reply with the access code?",
              "score": 1,
              "created_utc": "2026-02-25 03:48:15",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o73w0fl",
          "author": "LimiT600",
          "text": "Unlimited Plan",
          "score": 1,
          "created_utc": "2026-02-24 09:17:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o79l94d",
              "author": "Excellent-Grape-4758",
              "text": "Can you please email me at sam\\[at\\]swipe\\[dot\\]farm with a quick ‘Hi’ and I will add you to the list and reply with the access code?",
              "score": 1,
              "created_utc": "2026-02-25 03:48:17",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o73ygty",
          "author": "Wet_Assistance",
          "text": "Unlimited plan",
          "score": 1,
          "created_utc": "2026-02-24 09:41:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o79l9bi",
              "author": "Excellent-Grape-4758",
              "text": "Can you please email me at sam\\[at\\]swipe\\[dot\\]farm with a quick ‘Hi’ and I will add you to the list and reply with the access code?",
              "score": 1,
              "created_utc": "2026-02-25 03:48:18",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o749vj4",
          "author": "soloattorneyclub",
          "text": "Unlimited plan",
          "score": 1,
          "created_utc": "2026-02-24 11:24:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o79l9ln",
              "author": "Excellent-Grape-4758",
              "text": "Can you please email me at sam\\[at\\]swipe\\[dot\\]farm with a quick ‘Hi’ and I will add you to the list and reply with the access code?",
              "score": 1,
              "created_utc": "2026-02-25 03:48:21",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o74aid7",
          "author": "Budget-Inflation-491",
          "text": "Unlimited plan",
          "score": 1,
          "created_utc": "2026-02-24 11:29:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o79l9tf",
              "author": "Excellent-Grape-4758",
              "text": "Can you please email me at sam\\[at\\]swipe\\[dot\\]farm with a quick ‘Hi’ and I will add you to the list and reply with the access code?",
              "score": 1,
              "created_utc": "2026-02-25 03:48:23",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o74bgfy",
          "author": "anand5995",
          "text": "Unlimited plan",
          "score": 1,
          "created_utc": "2026-02-24 11:37:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o79l9zd",
              "author": "Excellent-Grape-4758",
              "text": "Can you please email me at sam\\[at\\]swipe\\[dot\\]farm with a quick ‘Hi’ and I will add you to the list and reply with the access code?",
              "score": 1,
              "created_utc": "2026-02-25 03:48:25",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o74n5qg",
          "author": "Dramatic_Author_9504",
          "text": "Unlimited Plan",
          "score": 1,
          "created_utc": "2026-02-24 12:59:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o79la6a",
              "author": "Excellent-Grape-4758",
              "text": "Can you please email me at sam\\[at\\]swipe\\[dot\\]farm with a quick ‘Hi’ and I will add you to the list and reply with the access code?",
              "score": 1,
              "created_utc": "2026-02-25 03:48:27",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7ag1y5",
                  "author": "Dramatic_Author_9504",
                  "text": "Done",
                  "score": 1,
                  "created_utc": "2026-02-25 07:43:20",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o74pvid",
          "author": "3ASYW1N",
          "text": "Unlimited Plan",
          "score": 1,
          "created_utc": "2026-02-24 13:16:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o79ladc",
              "author": "Excellent-Grape-4758",
              "text": "Can you please email me at sam\\[at\\]swipe\\[dot\\]farm with a quick ‘Hi’ and I will add you to the list and reply with the access code?",
              "score": 1,
              "created_utc": "2026-02-25 03:48:29",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o74rinr",
          "author": "Busy-Challenge-5219",
          "text": "Unlimited plan,count me in",
          "score": 1,
          "created_utc": "2026-02-24 13:25:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o79laji",
              "author": "Excellent-Grape-4758",
              "text": "Can you please email me at sam\\[at\\]swipe\\[dot\\]farm with a quick ‘Hi’ and I will add you to the list and reply with the access code?",
              "score": 1,
              "created_utc": "2026-02-25 03:48:31",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o74ypch",
          "author": "SleepDigest",
          "text": "Unlimited Plan",
          "score": 1,
          "created_utc": "2026-02-24 14:04:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o79larj",
              "author": "Excellent-Grape-4758",
              "text": "Can you please email me at sam\\[at\\]swipe\\[dot\\]farm with a quick ‘Hi’ and I will add you to the list and reply with the access code?",
              "score": 1,
              "created_utc": "2026-02-25 03:48:33",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7aizyf",
                  "author": "SleepDigest",
                  "text": "Yes sent:)",
                  "score": 1,
                  "created_utc": "2026-02-25 08:10:14",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o75500t",
          "author": "The_Pancake88",
          "text": "Unlimited Plan",
          "score": 1,
          "created_utc": "2026-02-24 14:37:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o79laz3",
              "author": "Excellent-Grape-4758",
              "text": "Can you please email me at sam\\[at\\]swipe\\[dot\\]farm with a quick ‘Hi’ and I will add you to the list and reply with the access code?",
              "score": 1,
              "created_utc": "2026-02-25 03:48:35",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o758u2c",
          "author": "Ill-Farmer-6174",
          "text": "Unlimited plan",
          "score": 1,
          "created_utc": "2026-02-24 14:56:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o79lba0",
              "author": "Excellent-Grape-4758",
              "text": "Can you please email me at sam\\[at\\]swipe\\[dot\\]farm with a quick ‘Hi’ and I will add you to the list and reply with the access code?",
              "score": 1,
              "created_utc": "2026-02-25 03:48:38",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o79tidq",
                  "author": "Ill-Farmer-6174",
                  "text": "Mailed it",
                  "score": 1,
                  "created_utc": "2026-02-25 04:42:10",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o75fx8a",
          "author": "SecretActual4524",
          "text": "unlimited plan",
          "score": 1,
          "created_utc": "2026-02-24 15:30:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o79lbjh",
              "author": "Excellent-Grape-4758",
              "text": "Can you please email me at sam\\[at\\]swipe\\[dot\\]farm with a quick ‘Hi’ and I will add you to the list and reply with the access code?",
              "score": 1,
              "created_utc": "2026-02-25 03:48:41",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o75m0i5",
          "author": "Winter-Echo-2675",
          "text": "Unlimited plan",
          "score": 1,
          "created_utc": "2026-02-24 15:58:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o79lbrh",
              "author": "Excellent-Grape-4758",
              "text": "Can you please email me at sam\\[at\\]swipe\\[dot\\]farm with a quick ‘Hi’ and I will add you to the list and reply with the access code?",
              "score": 1,
              "created_utc": "2026-02-25 03:48:43",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o75vy54",
          "author": "Anise121",
          "text": "Unlimited plan",
          "score": 1,
          "created_utc": "2026-02-24 16:43:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o79lc1y",
              "author": "Excellent-Grape-4758",
              "text": "Can you please email me at sam\\[at\\]swipe\\[dot\\]farm with a quick ‘Hi’ and I will add you to the list and reply with the access code?",
              "score": 1,
              "created_utc": "2026-02-25 03:48:46",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o76dzrs",
          "author": "wonderkidf8ukfy",
          "text": "Unlimited Plan",
          "score": 1,
          "created_utc": "2026-02-24 18:04:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o79lc5s",
              "author": "Excellent-Grape-4758",
              "text": "Can you please email me at sam\\[at\\]swipe\\[dot\\]farm with a quick ‘Hi’ and I will add you to the list and reply with the access code?",
              "score": 1,
              "created_utc": "2026-02-25 03:48:47",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o76hgoo",
          "author": "OTGOp",
          "text": "Unlimited Plan",
          "score": 1,
          "created_utc": "2026-02-24 18:19:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o79lcfr",
              "author": "Excellent-Grape-4758",
              "text": "Can you please email me at sam\\[at\\]swipe\\[dot\\]farm with a quick ‘Hi’ and I will add you to the list and reply with the access code?",
              "score": 1,
              "created_utc": "2026-02-25 03:48:50",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o77mpf9",
          "author": "artic0x",
          "text": "Unlimited Plan",
          "score": 1,
          "created_utc": "2026-02-24 21:28:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o79lcnq",
              "author": "Excellent-Grape-4758",
              "text": "Can you please email me at sam\\[at\\]swipe\\[dot\\]farm with a quick ‘Hi’ and I will add you to the list and reply with the access code?",
              "score": 1,
              "created_utc": "2026-02-25 03:48:52",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o780zsu",
          "author": "LittlePeenaut",
          "text": "Unlimited plan",
          "score": 1,
          "created_utc": "2026-02-24 22:36:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o79lcvc",
              "author": "Excellent-Grape-4758",
              "text": "Can you please email me at sam\\[at\\]swipe\\[dot\\]farm with a quick ‘Hi’ and I will add you to the list and reply with the access code?",
              "score": 1,
              "created_utc": "2026-02-25 03:48:55",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o79ggs6",
          "author": "Mroute",
          "text": "Unlimited Plan",
          "score": 1,
          "created_utc": "2026-02-25 03:19:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o79ld5x",
              "author": "Excellent-Grape-4758",
              "text": "Can you please email me at sam\\[at\\]swipe\\[dot\\]farm with a quick ‘Hi’ and I will add you to the list and reply with the access code?",
              "score": 1,
              "created_utc": "2026-02-25 03:48:57",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7av3mk",
          "author": "Major-Algae-8038",
          "text": "Unlimited Plan",
          "score": 1,
          "created_utc": "2026-02-25 10:03:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ccyrp",
          "author": "samirsss",
          "text": "Unlimited Plan",
          "score": 1,
          "created_utc": "2026-02-25 15:44:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7cprc5",
          "author": "shanti_priya_vyakti",
          "text": "Unlimited Plan",
          "score": 1,
          "created_utc": "2026-02-25 16:42:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7vlno0",
          "author": "Commercial-Fig27",
          "text": "Unlimited plan",
          "score": 1,
          "created_utc": "2026-02-28 13:40:55",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rccx21",
      "title": "What are you building this week? Drop your startup or project idea 👇",
      "subreddit": "Startup_Ideas",
      "url": "https://www.reddit.com/r/Startup_Ideas/comments/1rccx21/what_are_you_building_this_week_drop_your_startup/",
      "author": "asupertram",
      "created_utc": "2026-02-23 09:26:00",
      "score": 25,
      "num_comments": 45,
      "upvote_ratio": 1.0,
      "text": "New week. Fresh momentum.\n\nWe’re always curious what founders are working on, whether you’re:\n\n* At the idea stage\n* Bootstrapping solo\n* Pre-launch\n* Already live and generating revenue\n\nShare a quick pitch below. One sentence is perfect. Link it if you’ve got one.\n\nWe’re especially excited about founders who aren’t afraid to go solo, build in public, and start raising small amounts early instead of waiting for a big VC round.\n\nBecause let’s be real...fundraising is exhausting!!  \nMonths refining a deck, chasing investors, sending cold emails with 1–2% reply rates, only to face silence or mismatched expectations. It drains time and energy that could be spent building.\n\nThat’s why we built **Preseedme** \\- a place where founders can share their startups early and get connected with micro-investors from the beginning of their journey.  \nThink of it as a matching layer between startups and early backers, running quietly in the background while you focus on building.\n\nWhat are you building this week? 🚀",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Startup_Ideas/comments/1rccx21/what_are_you_building_this_week_drop_your_startup/",
      "domain": "self.Startup_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o6zqh8l",
          "author": "Peter-Park11",
          "text": "I am building Startupsubmit(.)app help for founder to get listing 250+ high Authority Directory",
          "score": 2,
          "created_utc": "2026-02-23 18:13:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6xbhlo",
          "author": "HarjjotSinghh",
          "text": "my startup's already built itself!",
          "score": 1,
          "created_utc": "2026-02-23 09:28:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6xda9f",
          "author": "asupertram",
          "text": "Come share your startups at: [www.preseedme.com](http://www.preseedme.com) \\- and start raising your first pre-seed round on autopilot  ",
          "score": 1,
          "created_utc": "2026-02-23 09:46:11",
          "is_submitter": true,
          "replies": []
        },
        {
          "id": "o6xhnbo",
          "author": "greyzor7",
          "text": "Building an all-in-one pack for founders who want more than \"just another launch\"\n\nLaunch, reach 30k+ makers, get users & customers - https://microlaunch.net/premium\n\nLifetime, auto-distribution, marketplace spots, 800+ customers so far.",
          "score": 1,
          "created_utc": "2026-02-23 10:27:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6xkyjh",
          "author": "edmund870",
          "text": "Find the Absolute Best Price Across Every Store\n\nWe scan thousands of listings across major marketplaces in seconds so you don't have to. Stop overpaying, start saving.\n\n[Fetchlyhub](https://fetchlyhub.net/)",
          "score": 1,
          "created_utc": "2026-02-23 10:58:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6xm7w3",
          "author": "SantinoMafioso",
          "text": "[PDF Compiler ](https://pdf-compiler.com) \\- A website built for compiling multiple sets of documents sharing the same data at once.\n\nBuilt for businesses to automate data entry of multiple recurring documents. I used it myself for tender documents and it saved me hours per day.",
          "score": 1,
          "created_utc": "2026-02-23 11:10:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6y5dxl",
          "author": "ymbstudios",
          "text": "My team and I are building App Idea Report, it'll be a comprehensive research and validation tool for your app/saas ideas. We expect to be able to bring on users to test it within no more than a week!",
          "score": 1,
          "created_utc": "2026-02-23 13:31:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6yba5c",
          "author": "pvfakten",
          "text": "https://www.oidapost.com/\nSocial media on autopilot for vibe coders. \nLaunch in 2 weeks. Waitlist is open :)",
          "score": 1,
          "created_utc": "2026-02-23 14:05:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6yfgvz",
          "author": "Tytanidze",
          "text": "[Pocket Links](https://play.google.com/store/apps/details?id=com.nofutureapps.pocketlinks) is a minimalist Android app to save and organize links from your mobile browser - movies/anime, manga, recipes, articles, online tools, job listings, products, and anything else you discover.",
          "score": 1,
          "created_utc": "2026-02-23 14:28:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6yyo53",
          "author": "-listnr",
          "text": "Built Listnr after paying $40/mo to monitor Reddit mentions.\n\nNow it’s usage-based (~$1.20 for ~40 alerts).\nTexts are $0.03, Discord + Slack webhooks are $0.01 per alert.\n\nAdded “Pitchfork” groups for shared live alerts.\n\nhttps://listnrapp.com\nFree Pitchfork group: https://listnrapp.com/join/bkax5j30\n\nFeedback welcome.",
          "score": 1,
          "created_utc": "2026-02-23 16:04:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6z4795",
          "author": "No_Painting8637",
          "text": "[https://manavdeveloper.github.io/Crediva/](https://manavdeveloper.github.io/Crediva/) \\-Crediva.ink is a creator–brand collaboration platform built to make partnerships faster, safer, and more reliable. It addresses two major pain points in the creator economy: long payment delays faced by creators and the difficulty brands have in finding verified, dependable creators.  \nOn [Crediva.ink](http://Crediva.ink), creators list their profiles with key details such as audience metrics, engagement, rates, and past work, while brands post their campaign requirements. Both parties can connect directly through the platform without unnecessary intermediaries. All profiles are manually verified to ensure authenticity, and a built-in reporting and dispute system protects both creators and brands.  \nCreators receive payments within two weeks of content delivery, and brands are assured on-time posting. Personal dashboards allow both sides to track collaborations, deadlines, and ongoing projects efficiently.",
          "score": 1,
          "created_utc": "2026-02-23 16:29:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6zflar",
          "author": "Afraid_Pandas",
          "text": "I'm making a booking web app to sell as a complete package, starting with salons and spas. If it goes well, I'll expand to other niches like pet training. You can check out a demo here: https://salonxpa.laravel.cloud\n\nDM me for more info, I'm also up for commission-based selling.",
          "score": 1,
          "created_utc": "2026-02-23 17:22:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6zp55z",
          "author": "praneethb7",
          "text": "Working on a simple system to help founders go from idea to execution without everything living in random docs and Notion pages.\n\nMost early-stage chaos isn’t lack of ideas, it’s messy workflows.\n\nBeen experimenting with structuring launch tasks, pitch updates, and experiments inside tools like Runable so it’s less “scramble mode” and more repeatable process.\n\nStill refining it. Curious what everyone else is building this week?",
          "score": 1,
          "created_utc": "2026-02-23 18:07:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6zpu70",
          "author": "t1llmann",
          "text": "Nice! We‘ve been working on lumenfall.ai - our unified api for ai media generation",
          "score": 1,
          "created_utc": "2026-02-23 18:10:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6zq7qd",
          "author": "codejunkie1992",
          "text": "Building an AI-powered micro-SaaS that helps small businesses automate lead follow-ups and customer retention without needing a full marketing team.",
          "score": 1,
          "created_utc": "2026-02-23 18:12:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o707umi",
              "author": "Wide_Brief3025",
              "text": "Focusing on automating follow ups is a huge unlock for small businesses, especially when resources are tight. You might also want to monitor conversations happening online in real time to catch fresh leads and engage right away. ParseStream helps with this by tracking discussions across platforms and sending you keyword alerts for timely engagement opportunities.",
              "score": 1,
              "created_utc": "2026-02-23 19:32:52",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o70dgiv",
          "author": "Fit_Procedure_7330",
          "text": "Building CraftUp [https://craftuplearn.com](https://craftuplearn.com)\n\nA daily interactive learning app that helps solo founders and aspiring PMs master real product skills like validation, early traction, and growth in just a few minutes a day.\n\nBootstrapped, live, and generating revenue. This week I’m shipping new modules and tightening onboarding to improve activation.",
          "score": 1,
          "created_utc": "2026-02-23 19:59:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o70j93t",
          "author": "jundymek",
          "text": "Improving **FakerFill** \\- smarter auto-fill built for dev and QA workflows.\n\n[https://www.fakerfill.com](https://www.fakerfill.com)",
          "score": 1,
          "created_utc": "2026-02-23 20:26:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o71sto9",
          "author": "Otherwise-List9028",
          "text": "Its kids storybook creation app. That doubles as an early diagnosis research tool for autism research holographically projected games or interactions with children puts less pressure on them getting more accurate findings and I'm donating.05 on the dollar made on it to the same research",
          "score": 1,
          "created_utc": "2026-02-24 00:22:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o72hyyb",
          "author": "CachinnateOfficial",
          "text": "Currently working on [Marketersbox](https://marketersbox.com/) a platform currently offering call tracking to help local service businesses connect phone calls to the marketing channels that generated them, so they can make better budget decisions without guessing. Is it your flyers from door knocking driving in customers or is it your social media posts, most businesses can't answer that question.",
          "score": 1,
          "created_utc": "2026-02-24 02:46:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o72rcn2",
          "author": "amacg",
          "text": "Built a community where makers can share what they’re building and get fair visibility. Here's the link: [https://trylaunch.ai](https://trylaunch.ai/)",
          "score": 1,
          "created_utc": "2026-02-24 03:43:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o76dyaq",
          "author": "Antique_Inflation455",
          "text": "For all you soccer coaches out there. PepAI uses AI to save you time designing and sharing training session plans.  \n[pepai.vercel.app](http://pepai.vercel.app)",
          "score": 1,
          "created_utc": "2026-02-24 18:04:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7dsrzw",
          "author": "FarmerParticular8829",
          "text": "I havent launched outside of friends and family yet but building [inbucket.co](http://inbucket.co); pre-CRM that tells you where you stand with all your important companies.\n\nIts mainly cos I lose track of emails, superhuman is overkill, and I dont have the discipline for a CRM. This simply creates a view where each company has its own inbox so its easy to see whos waiting on you, vs who you're waiting on. Would love any feedback!\n\nTarget is:  \n\\- Founders managing sales, investors etc.  \n\\- consultants  \n\\- investors managing dealflow.",
          "score": 1,
          "created_utc": "2026-02-25 19:40:07",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1renils",
      "title": "Up for testing the ideas/creations of first 20 startups that comment",
      "subreddit": "Startup_Ideas",
      "url": "https://www.reddit.com/r/Startup_Ideas/comments/1renils/up_for_testing_the_ideascreations_of_first_20/",
      "author": "Low_Piglet_2257",
      "created_utc": "2026-02-25 19:40:12",
      "score": 25,
      "num_comments": 34,
      "upvote_ratio": 0.96,
      "text": "I’m just here, curious to learn what we’ve been building lately. Seeking genuine ideas and knowledge, while leveraging on making long-lasting connections.  \nDoesn’t matter if you’re just ideating, or have just started out.  \n\n\n***I will try your product, explore and play around, and provide you a genuine insight of what I felt about it as a random user.***  \n***In return, you do the same for me.***\n\n  \nIf you are seeking brutal and honest feedback, nothing sugarcoated whatsoever, this space is for you. ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Startup_Ideas/comments/1renils/up_for_testing_the_ideascreations_of_first_20/",
      "domain": "self.Startup_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o7dxnog",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 2,
          "created_utc": "2026-02-25 20:02:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7ew895",
              "author": "Low_Piglet_2257",
              "text": "Straight into your DMs. :)",
              "score": 1,
              "created_utc": "2026-02-25 22:46:16",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7h11b3",
          "author": "Volitium",
          "text": "[Media-ana](https://media-ana.volitium.com/home), an analytics platform that detects deepfakes, impersonations, and malicious edits of images and videos, targeting to help individuals and organizations mitigate frauds from AI deception.",
          "score": 2,
          "created_utc": "2026-02-26 06:36:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7hf2b9",
          "author": "Jrawrig",
          "text": "I have a robust system I’d like tested. That’s not what she said. But I am interested. I have a white paper titled the shadow of death. I’m uploading it on my substack. QRAWTHINK. Would love real eyes. Real feedback outside of my AI and my family that “knows” me better than I do only because they don’t recognize me anymore. The shit about it is I keep telling them I don’t recognize myself anymore. And that’s ok. I’m 50 shades different than I once I was.",
          "score": 1,
          "created_utc": "2026-02-26 08:44:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7ju14a",
              "author": "Low_Piglet_2257",
              "text": "There’s a link to it?\n\n",
              "score": 1,
              "created_utc": "2026-02-26 17:40:25",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7i2v70",
          "author": "Ibz04",
          "text": "https://apps.apple.com/app/swypn-ai-photo-detection/id6759467546: Swypn app, a game to test if you can identify ai images or not",
          "score": 1,
          "created_utc": "2026-02-26 12:15:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ihplo",
          "author": "kubrador",
          "text": "lmao \"leveraging on making long-lasting connections\" is startup speak for \"i want free product testing and networking\"",
          "score": 1,
          "created_utc": "2026-02-26 13:48:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7iitwj",
              "author": "Low_Piglet_2257",
              "text": "Ofcourse. Atleast not having to disguise my startup link by an “OnlyFans” named link to lure people to check it out.",
              "score": 1,
              "created_utc": "2026-02-26 13:54:08",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1rg70zp",
      "title": "I Spend 40 Minutes a Day on Marketing. It Brings More Users Than Ads Ever Did.",
      "subreddit": "Startup_Ideas",
      "url": "https://www.reddit.com/r/Startup_Ideas/comments/1rg70zp/i_spend_40_minutes_a_day_on_marketing_it_brings/",
      "author": "Interesting_Belt_736",
      "created_utc": "2026-02-27 13:42:33",
      "score": 21,
      "num_comments": 8,
      "upvote_ratio": 0.93,
      "text": "When I first launched my product, I thought I needed ads.\n\nTried them. Burned money. Got random traffic.\n\nWhat actually worked?  \nA simple daily system.\n\nNo growth hacks. No 8-hour content grind. Just consistency.\n\nHere’s exactly what I do.\n\n**The rule:**\n\nDon’t create from scratch every day.  \nCreate once. Reuse. Improve. Repeat.\n\n**Twitter + LinkedIn (15 min)**\n\nEvery morning I draft 2–3 short posts.\n\nNothing fancy. Just:\n\n* Something I learned\n* A mistake I made\n* A result I got\n\nIf one performs well, I rewrite it 2–3 different ways the next week.\n\nMost of my signups come from people who’ve seen me post consistently for weeks.\n\n**Short-form content (10 min)**\n\nI turn my best posts into simple carousels.\n\nNo crazy editing. Just clean slides with strong hooks.\n\nIf a post flops, I tweak the hook.  \nIf it works, I double down.\n\n**SEO (5–10 min)**\n\nInstead of writing random blogs, I target:\n\n* “\\[competitor\\] alternatives”\n* “best tools for \\[specific niche\\]”\n* Comparison posts\n\nHigh intent > high traffic.\n\nOne good bottom-of-funnel article brings better users than 10 viral posts.\n\n**Reddit (2–3 times per week)**\n\nI don’t spam links.\n\nI look for posts where someone is already struggling with the problem I solve.\n\nThen I write a real answer.\n\nProduct mention is natural, not forced.\n\nThis alone brings steady weekly signups.\n\n**Cold outreach (5–10 min)**\n\nI send a small number of highly targeted emails daily.\n\nShort. Personal. No pitch in the first line.\n\nJust relevance.\n\nThat’s it.\n\nTotal time: \\~40 minutes per day.\n\nResult after 30 days:  \nConsistent weekly signups.  \n$0 ad spend.\n\nWhat didn’t work before this?  \nTrying to do everything manually and randomly. Burned out fast.\n\nMarketing isn’t about doing more.  \nIt’s about having a repeatable system.\n\nIf anyone’s curious what I’m building, here’s the [link](https://www.statshub.ai/):\n\nHappy to answer questions about the setup.\n\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Startup_Ideas/comments/1rg70zp/i_spend_40_minutes_a_day_on_marketing_it_brings/",
      "domain": "self.Startup_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o7pcfag",
          "author": "Wide_Brief3025",
          "text": "Love this approach, especially the way you recycle and refine content instead of starting from scratch. One thing that might save even more time is using a conversation tracking tool so you find high intent posts to reply to on multiple platforms. ParseStream helps automate that part, which takes a lot of the manual search out and lets you focus on writing genuinely useful replies.",
          "score": 2,
          "created_utc": "2026-02-27 14:14:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7peiae",
          "author": "Forsaken_Lie_8606",
          "text": "ime ive been doing something similar with my own project, where i spend about 30 minutes a day just engaging with potential users on social media and its crazy how much of a difference its made, i mean i was paying for ads and getting like 10 signups a week but now im getting 20-30 just from being consistent and actually talking to people, one thing thats worked for me is to just focus on helping people first and not even thinking about promoting my product, it sounds kinda weird but its actually been%sreally effective, i just try to provide value and then if someone asks about my project ill mention it, but only if its relevant to the conversation",
          "score": 2,
          "created_utc": "2026-02-27 14:25:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7pjtdw",
          "author": "RoleHot6498",
          "text": "For businesses not requiring scalability, this is a fantastic approach. If you need to scale however, you will obviously need to understand ads and how they work as well",
          "score": 2,
          "created_utc": "2026-02-27 14:53:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7qxn4j",
          "author": "GarbageOk5505",
          "text": "The Reddit piece is the most underrated part of this whole system. One genuine answer in the right thread compounds for weeks - I've seen posts from months ago still driving signups.\n\nWhat's your split between threads where you mention the product vs pure value-add with no link? Curious about the ratio that works for you.",
          "score": 2,
          "created_utc": "2026-02-27 18:50:08",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rhmkv1",
      "title": "My small startup brought in $2,400 profit in the last quarter!",
      "subreddit": "Startup_Ideas",
      "url": "https://www.reddit.com/r/Startup_Ideas/comments/1rhmkv1/my_small_startup_brought_in_2400_profit_in_the/",
      "author": "ImprovementBasic8024",
      "created_utc": "2026-03-01 03:26:19",
      "score": 17,
      "num_comments": 4,
      "upvote_ratio": 1.0,
      "text": "Six months ago, I was stuck on a \"big idea\" that never launched: custom eco yoga mats with ocean plastic. I spent weeks on designs, got factory quotes (MOQ 1,200 units!), and almost maxed a credit card on samples… Luckily before I did, I asked my friends and online ppl and found out that nobody wants sth like that. The honest answer? \"Looks cool, but I'd just grab a Lululemon on sale.\"\n\nSo I scrapped the grand plan and tried something smaller:\n\nI started looking for practical, everyday products people actually use. Turns out, living next to a university is basically free market research. You quickly notice what breaks, runs out, or gets lost in the first month of school… and my best sellers are always the things students keep replacing.\n\nMy process is simple: order just 50–100 units from a verified supplier on Alibaba, take honest photos in my apartment, and list them with clear, no-fluff descriptions. Each batch costs me around $250–$300 upfront. If it sells out in 4–6 weeks, I reorder, and maybe add a simple branded sticker or custom packaging next time. If it doesn't? I'm only out a few hundred bucks, I don't have boxes piling up in my closet, and I can pivot fast.\n\nLast quarter, this low-risk, micro-batch approach netted $2,400 in profit after all fees and shipping. It's not huge, but I'm really excited about this win.\n\nNow I'm thinking: could I bundle these into \"dorm refresh kits\" or offer light subscriptions? Still testing!\n\nIf you're working on your own startup idea, no matter how small or half-baked, I'd love to hear about it! Plz share!",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Startup_Ideas/comments/1rhmkv1/my_small_startup_brought_in_2400_profit_in_the/",
      "domain": "self.Startup_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o80o5rr",
          "author": "pissagainstwind",
          "text": "So your startup is drop shipping?",
          "score": 3,
          "created_utc": "2026-03-01 07:37:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o81k3te",
              "author": "sannchit",
              "text": "With a lot of manual labour than drop shipping",
              "score": 1,
              "created_utc": "2026-03-01 12:33:49",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o82b3jk",
          "author": "Cupidai111",
          "text": "Really happy for you, congrats!",
          "score": 1,
          "created_utc": "2026-03-01 15:18:29",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rcc58a",
      "title": "how do i get ideas that solve an actual problem?",
      "subreddit": "Startup_Ideas",
      "url": "https://www.reddit.com/r/Startup_Ideas/comments/1rcc58a/how_do_i_get_ideas_that_solve_an_actual_problem/",
      "author": "kaizenYA",
      "created_utc": "2026-02-23 08:38:36",
      "score": 15,
      "num_comments": 29,
      "upvote_ratio": 0.99,
      "text": "i need help finding ideas for a startup. some say go and talk to your niche and then see but i dont really have any specific niche as of now. how do i go about this? i wanna be able to build simple, creative solutions to problems that matter to us people and actually move us towards well being.\n\nfew problems i see are overstimulating oneself with distraction, misuse of resources, consumption of unhealthy food for both body and mind. lack of clarity and inner wellbeing,   \nthe need to be approved by people, validation over truth, not pushing ourselves to creativity and lack in a sense of community and connection and few more.\n\nthese are few problems i see but again, is there any actual system/framework to come up with ideas. how do i go about it inorder to understand what is it that i need create?  \nwould appreciate it if  experienced peeps can share their inputs as well",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Startup_Ideas/comments/1rcc58a/how_do_i_get_ideas_that_solve_an_actual_problem/",
      "domain": "self.Startup_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o6xp7lp",
          "author": "StillVeterinarian578",
          "text": "Step 1: Have a problem...",
          "score": 8,
          "created_utc": "2026-02-23 11:36:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o71kn9c",
          "author": "kubrador",
          "text": "just pick one problem you actually experience daily and try to solve it for yourself first. if it takes off, cool. if not, you learned something.\n\n\n\nthe \"talk to your niche\" advice works better when you already have a niche because you're just bad at being a generalist right now and no framework fixes that.",
          "score": 5,
          "created_utc": "2026-02-23 23:36:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6yhmxk",
          "author": "ThoriDay",
          "text": "Ask people around you what problems they are facing, ask people you look upto, ask yourself. If they are worth solving, solve them. Also not necessary to keep this a starting point, could also improve an existing solution, innovate something new and better in it. However easier said than done",
          "score": 2,
          "created_utc": "2026-02-23 14:40:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o70j9z2",
          "author": "Outrageous_Push_2673",
          "text": "De donde sos? Fijate en tu entorno los problemas que existen, investiga al respecto, busca dolores reales, prueba ideas simples y vas a ir encontrando un criterio para saber que hacer ",
          "score": 1,
          "created_utc": "2026-02-23 20:27:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o72jnxz",
          "author": "Ok-Hornet-6819",
          "text": "Experience the problem",
          "score": 1,
          "created_utc": "2026-02-24 02:56:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o797ph9",
          "author": "Perfect_Honey7501",
          "text": "The unpopular answer is coming up with an original idea is really hard.  There is a massive leap of faith that you'll find something, others will share the same pain, you find the correct deliverable, and then hope the market is large enough\n\nThe even more unpopular answer is to find something already working - a product with real users and revenue - and ask yourself \"who does this miss?\"  What angle is it ignoring?  Can I offer it cheaper? Then build that version.\n\nMost successful companies aren't original. \n\n\\- Notion rebuilt what Confluence already did, just better for a different audience.\n\n\\- Zoom cloned Skype - just made it reliable\n\n\\- Spotify cloned Napster - just made it legal\n\nThe idea doesn't need to be new, it just needs to be right for a specific person in a specific situation that nobody's nailed yet.\n\nIf you're looking for a list of ideas you can clone/pivot and make 1% different or better, you should look [here](https://cloneabledb.com/) \\- it removes the guessing, shows validated MRR, and options to pivot.",
          "score": 1,
          "created_utc": "2026-02-25 02:30:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o79c1xa",
          "author": "FreeSpirit3000",
          "text": "You seem to be interested in psychology and in human nature. Those are all issues of our minds/souls: \n\n\noverstimulating oneself with distraction, consumption of unhealthy food, the need to be approved by people\n\n\nSo have a look. What offers, what solutions are there already? Do they work? Are they accessible for everyone who needs them? Are people aware that they need them? \n\n\nWhat could you improve? The thing itself (therapy, courses, apps, devices, whatever)? Could you improve the access (price, supply in rural areas) or the usability? Could you raise awareness? \n\n\nThere are many ways to work on the problems that you listed, so there's no framework. Just develop an improvement that you are able to build with your means, your skills and interests. \n\n\nI'm also interested in problems like that, so if you like, DM me to brainstorm ideas. ",
          "score": 1,
          "created_utc": "2026-02-25 02:54:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6xcpq1",
          "author": "ai_consultant",
          "text": "DM me will suggest",
          "score": -6,
          "created_utc": "2026-02-23 09:40:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6zrtkb",
              "author": "super_trooper",
              "text": "For a small fee I'll send you various outputs from chatgpt",
              "score": 5,
              "created_utc": "2026-02-23 18:19:38",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o70t8b8",
                  "author": "ai_consultant",
                  "text": "So it's better to take a payment from chatgpt .\n\nI was just trying to help someone, not start an argument. It’s honestly frustrating that instead of helping the person who asked, people focus on questioning someone who’s actually trying. If you want to help, go ahead and suggest something. If not, just let it be — no need to discourage others who are trying.",
                  "score": 1,
                  "created_utc": "2026-02-23 21:16:36",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1rgsu57",
      "title": "How to validate idea?",
      "subreddit": "Startup_Ideas",
      "url": "https://www.reddit.com/r/Startup_Ideas/comments/1rgsu57/how_to_validate_idea/",
      "author": "TheSeeAndTheSaw",
      "created_utc": "2026-02-28 04:15:38",
      "score": 15,
      "num_comments": 50,
      "upvote_ratio": 1.0,
      "text": "I have a startup idea, but before I start building it, I need to validate the idea and see if users actually have that problem.\n\nPlease help me out, how do you guys validate your startup ideas?\n\nAre there any tools that you use? Or manually -- if so, how?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Startup_Ideas/comments/1rgsu57/how_to_validate_idea/",
      "domain": "self.Startup_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o7tx2ry",
          "author": "spiderjohnx",
          "text": "You gotta talk to humans and a lot of them",
          "score": 10,
          "created_utc": "2026-02-28 05:04:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o80gndc",
              "author": "TheSeeAndTheSaw",
              "text": "should i cold dm/email them? any tips on that?",
              "score": 1,
              "created_utc": "2026-03-01 06:29:43",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o82lk3e",
                  "author": "spiderjohnx",
                  "text": "If you have a customer avatar, yes you should go to groups where this ideal customer is, cold email/dm. The Last question you ask them after interviewing is “do you know anyone else I can speak to about this problem you are having” that can get you subsequent interviews. Have you read “The Mom Test”? Highly recommended.",
                  "score": 1,
                  "created_utc": "2026-03-01 16:09:50",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7ux8y5",
          "author": "CompetitivePop-6001",
          "text": "Before building anything, just talk to real people. Do 10–20 quick calls with your target users and focus only on their current problems (not pitching your idea yet).\nYou can use simple tools like Google Forms for surveys or a basic landing page on Carrd to test interest. If no one’s excited enough to sign up or pay, that’s your signal.",
          "score": 4,
          "created_utc": "2026-02-28 10:27:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o80gvdc",
              "author": "TheSeeAndTheSaw",
              "text": "thanks for answering, where do i find these people?",
              "score": 0,
              "created_utc": "2026-03-01 06:31:39",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o8169p6",
                  "author": "Sleepy_panther77",
                  "text": "It’s kind of a bad sign you don’t know how to find the people who you want to be your customers. But if you really want an answer you’d have to tell us your idea and then who you want to target basically. But you should have a very very clear idea of who your customer is, what their needs are, what they want, and especially where to find them, and how to reach them.",
                  "score": 1,
                  "created_utc": "2026-03-01 10:30:02",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7va6pu",
          "author": "GeorgeHadjisavvas",
          "text": "**1. Look for existing pain, not opinions.**\n\nSearch Reddit, niche forums, X, etc. Use keywords like:\n\n* “How do I…”\n* “I’m tired of…”\n* “Is there a tool that…”\n* “Why is it so hard to…”\n\n**2. DM or comment on those threads.**\n\n* ask more on the frustrations\n* ask if they are willing to **pay**\n\nI’ve been building a small [project](https://problem-miner-landing.vercel.app/feed) that scans Reddit daily and structures recurring frustrations across different niches. There’s also a newsletter that sends a curated list of these pain points each day.",
          "score": 5,
          "created_utc": "2026-02-28 12:21:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7vj1nd",
              "author": "Wide_Brief3025",
              "text": "Tracking real user frustrations across platforms is a solid approach since it uncovers consistent pain points you can actually solve. To level up, you might want to automate monitoring for fresh opportunities in multiple communities. I have seen ParseStream do this pretty well by sending instant alerts when your keywords pop up so you never miss out on a potential lead.",
              "score": 2,
              "created_utc": "2026-02-28 13:24:29",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o80h6jd",
                  "author": "TheSeeAndTheSaw",
                  "text": "oh cool, is ParseStream free?",
                  "score": 1,
                  "created_utc": "2026-03-01 06:34:20",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            },
            {
              "id": "o82m1q0",
              "author": "spiderjohnx",
              "text": "Asking if they are willing to pay is not a great question. Setting up a landing page where they have to click through to the purchase page and then fill out email for waiting list is a better signal. Still not foolproof.",
              "score": 1,
              "created_utc": "2026-03-01 16:12:13",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7ttc5b",
          "author": "Gloomy_Judge_7607",
          "text": "Pretty much supply and demand method",
          "score": 3,
          "created_utc": "2026-02-28 04:37:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o82m6bd",
              "author": "spiderjohnx",
              "text": "Thanks professor",
              "score": 1,
              "created_utc": "2026-03-01 16:12:50",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o80h7kt",
              "author": "TheSeeAndTheSaw",
              "text": "ooh, could you explain more?",
              "score": 0,
              "created_utc": "2026-03-01 06:34:35",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7wm4wm",
          "author": "Emma_4_7",
          "text": "Honestly the biggest mistake I made early on was asking people “would you use this?”. Everyone said yes. Nobody actually used it. What worked later was manually doing the service for 5 people and seeing if they came back a second time.",
          "score": 3,
          "created_utc": "2026-02-28 16:54:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7wm8a3",
          "author": "fatmax5",
          "text": "I remember reading Starting a Startup by James Sinclair and one idea stuck with me opinions are cheap, behavior is expensive. So now I only count validation if someone changes their routine or commits effort, not just feedback.",
          "score": 3,
          "created_utc": "2026-02-28 16:55:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7wme8w",
          "author": "Fragrant_Western4730",
          "text": "Pre-sell or concierge test. If they won’t spend time or money before automation, they won’t after.",
          "score": 3,
          "created_utc": "2026-02-28 16:56:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7uknfp",
          "author": "EarlyNeedleworker",
          "text": "Best validation is embarrassingly simple: build a landing page describing the problem and solution, drive some traffic to it (even just Reddit posts or cold DMs), and see if people click \"Join Waitlist.\"\nNo code, no product, just a page. If nobody signs up, the idea needs work. If people sign up, you have signal.\nTools people use: Carrd or Framer for the page, Tally for forms, and even manual outreach in communities where your target user hangs out (like you're doing right now, actually).\nThe landing page step gets skipped too often, founders jump straight to building and waste months. A week on validation can save you a year of the wrong work.",
          "score": 4,
          "created_utc": "2026-02-28 08:26:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7yc6zd",
              "author": "wtiawtiaw",
              "text": "Is there a chance our ideas get poached this way from competitors taking inspiration from the landing page test?",
              "score": 1,
              "created_utc": "2026-02-28 22:17:08",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o80gqrn",
              "author": "TheSeeAndTheSaw",
              "text": "that's actually really helpful, thanks!",
              "score": 1,
              "created_utc": "2026-03-01 06:30:32",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7upcyc",
          "author": "greyzor7",
          "text": "By getting first customers, ideally even before launch day.\n\nTry launching your app on a combo of social media: X/Twitter, Reddit + launch platforms: Product Hunt, Microlaunch. And any channel relevant to your ICP.\n\nRun campaigns, measure all ROIs, then simply double down on what worked. Then keep doing this until you get users & customers.\n\nFix conversions, channel selection, targeting when necessary.",
          "score": 2,
          "created_utc": "2026-02-28 09:10:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7uy600",
          "author": "Solid_Mongoose_3269",
          "text": "If only there was something in my head that could name noises, and other people had things in their head that could interpret them and then use the hole in their head to do the same. \n\nSomeone should make an app for that",
          "score": 2,
          "created_utc": "2026-02-28 10:36:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7wd609",
          "author": "Starlyns",
          "text": "Let me guess: someone will reply with an ai  validation saas",
          "score": 2,
          "created_utc": "2026-02-28 16:10:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7wggc8",
          "author": "leads_",
          "text": "Is it an idea or a problem? You should probably start with the identification of a problem you are willing to focus on solving and be flexible with the idea or solution. If you are solving you're own problem, great - you will build something of value even if no one else if like you. If you're NOT solving you're own problem, there is no other way around it, you need to talk to people.   \n  \nSee \"The Mom Test\" book and its approach to talk to customers the right way, without asking leading questions. ",
          "score": 2,
          "created_utc": "2026-02-28 16:26:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7wmgsh",
          "author": "leo7854",
          "text": "Cold DM + specific problem questions works well. Not “do you like the idea” ask how they currently solve it and what it costs them. The gaps in that answer are the validation.",
          "score": 2,
          "created_utc": "2026-02-28 16:56:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7xzy1r",
          "author": "HarjjotSinghh",
          "text": "you've got the goldmine right there - just need to dig it out!",
          "score": 1,
          "created_utc": "2026-02-28 21:11:12",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rh4j6f",
      "title": "Don't spend any single penny for Your Website or Saas",
      "subreddit": "Startup_Ideas",
      "url": "https://www.reddit.com/r/Startup_Ideas/comments/1rh4j6f/dont_spend_any_single_penny_for_your_website_or/",
      "author": "Independent_Lynx_439",
      "created_utc": "2026-02-28 14:50:21",
      "score": 14,
      "num_comments": 12,
      "upvote_ratio": 0.94,
      "text": "If you’re building a **Lovable project**, you can simply migrate it and structure it like this. The key is using **Cloudflare**.\n\nYou can run **Next.js on Cloudflare using OpenNext**, which gives you a serverless architecture. Along with that, you can use **Cloudflare R2 for storage**, **D1 for the database**, **Workers for backend logic**, and even **Cloudflare AI** if needed.\n\nBasically, the entire stack is available inside Cloudflare.\n\nThe best part is that **you can run everything on the free tier**. Cloudflare provides a very generous free plan for example, you can get **up to 1 million Worker invocations per day for free**.\n\nSo you can build and run your SaaS **without paying for hosting in the beginning**",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Startup_Ideas/comments/1rh4j6f/dont_spend_any_single_penny_for_your_website_or/",
      "domain": "self.Startup_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o809j8h",
          "author": "Kazumz",
          "text": "Great idea. \n\nAzure and AWS consumption plans with a simple CSR Vite app on a free Azure Static Web App instance is another good way of infra-for-free.",
          "score": 1,
          "created_utc": "2026-03-01 05:31:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o80qbt9",
          "author": "gael2456",
          "text": "Who would trust US infrastructure in the long run?  Data is not safe anymore under US laws and politics.",
          "score": 1,
          "created_utc": "2026-03-01 07:57:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o812e7t",
              "author": "Ok-Breakfast-4676",
              "text": "What do you suggest then?",
              "score": 1,
              "created_utc": "2026-03-01 09:52:48",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o82p7vr",
          "author": "StrongerThanLife",
          "text": "Odoo?",
          "score": 1,
          "created_utc": "2026-03-01 16:27:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o82qdwr",
              "author": "Independent_Lynx_439",
              "text": "Odum…",
              "score": 1,
              "created_utc": "2026-03-01 16:33:21",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1repsx2",
      "title": "Thinking of Starting My Own Agency – Looking for the Right Partner",
      "subreddit": "Startup_Ideas",
      "url": "https://www.reddit.com/r/Startup_Ideas/comments/1repsx2/thinking_of_starting_my_own_agency_looking_for/",
      "author": "Prize_Carpet_9891",
      "created_utc": "2026-02-25 21:03:19",
      "score": 12,
      "num_comments": 11,
      "upvote_ratio": 1.0,
      "text": "Hi everyone,\n\nI’m planning to start my own agency and I’m looking for a serious and committed partner to build it with. I want someone who brings ideas, energy, and skills to the table , whether in marketing, tech, design, strategy, or something new and innovative.\n\nA bit about me and my background is shared here:\n\nhttps://www.reddit.com/r/IndiaCareers/s/yTgvJw7wRe\n\nI’m open to exploring different directions and creating something meaningful together. If you have suggestions, ideas, or want to collaborate, let’s have a conversation here.\n\nLooking forward to connecting with like-minded people.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Startup_Ideas/comments/1repsx2/thinking_of_starting_my_own_agency_looking_for/",
      "domain": "self.Startup_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o7er8cl",
          "author": "TheGrowthMentor",
          "text": "What type of agency are you thinking about? The partner search can be tricky. I've seen too many agencies/startups fail because co-founders didn't align on vision early on. Would definitely recommend being super clear about roles and equity splits before diving in.",
          "score": 2,
          "created_utc": "2026-02-25 22:21:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7gl4t9",
              "author": "Prize_Carpet_9891",
              "text": "Please dm me",
              "score": 1,
              "created_utc": "2026-02-26 04:35:42",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7hknpk",
          "author": "Aasheshh_Kulkarni",
          "text": "You are right to think carefully before jumping into a partnership in starting this. \n\nQuick intro about me for context.. I work as a strategic advisor with founders and early-stage businesses, majorly around clarity, positioning, and go-to-market structure. My work sits at the layer before execution:- defining the problem, tightening the narrative, shaping the offer, and building a direction that can actually scale.\n\nI have been a part of a few agencies in my experience and have seen them struggle less because of skill gaps and more because of unclear positioning and co-founder misalignment early on.\n\nIf you are serious about building something meaningful and not just “starting an agency,” I’d be open to a conversation. DM if you would like to explore this properly.",
          "score": 2,
          "created_utc": "2026-02-26 09:39:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7h0uxi",
          "author": "Adventurous_Town517",
          "text": "Hey. Let’s connect. We have currently built CrewCaller India. Also foraying into a healthcare mobile app. \nAnd are building some animation and defence based AI models.",
          "score": 1,
          "created_utc": "2026-02-26 06:34:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7h4oaz",
          "author": "xivey69",
          "text": "What kind of Agency are you looking to build, having a clear Idea is very important plus you have not mentioned what skills are you bringing on the table in a TLDR way. \n\nOnce you have the idea, getting a partner will be easier, because I feel you need someone to complement your skills so you can work as a team. ",
          "score": 1,
          "created_utc": "2026-02-26 07:07:40",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rg76zj",
      "title": "66 repos with 1 star. The 67th got 700 stars and 1000 users in 12 days. Here's what finally worked.",
      "subreddit": "Startup_Ideas",
      "url": "https://www.reddit.com/r/Startup_Ideas/comments/1rg76zj/66_repos_with_1_star_the_67th_got_700_stars_and/",
      "author": "alichherawalla",
      "created_utc": "2026-02-27 13:49:22",
      "score": 9,
      "num_comments": 2,
      "upvote_ratio": 0.8,
      "text": "Edit: Links are in the first comment\n\nI've mass shipped for years. 66 public repos on GitHub. \n\nTwo weeks ago, the 67th hit different:\n\n* 700+ GitHub stars\n* 1000+ installs across iOS and Android\n* \\#1 on Hacker News for 3 days\n* 157K views on a single Reddit post\n\nSame skills. Different approach. Here's what you can steal:\n\n**1. Ship before it's ready.** Your \"almost done\" project is dying in silence. My app had bugs on launch day. Nobody cared. They cared that it existed.\n\n**2. Emotional hook > feature list.** \"Hated giving my data to third party companies\" outperformed every clever technical title. People share feelings, not features.\n\n**3. Launch more than once.** My first HN post flopped. Second flopped. Third hit #1. Most people quit after one rejection. That's the gap.\n\n**4. Treat launch day like a job.** I responded to every comment in the first 2 hours. Engagement feeds the algorithm. Silence kills it.\n\n**5. Stack your channels.** HN → Twitter → Reddit → repeat. Each channel fed the next. Distribution composites.\n\n**The real lesson:**\n\nYour 67th attempt might be the one. But only if you stop perfecting and start shipping. Only if you launch more than once. Only if you treat distribution like it matters as much as the product.\n\nI'm documenting everything in r/findingPMF \\- what's working, what's failing, real numbers. If you're stuck at 1 star, come build with us.\n\nI know how lonely it is. Join us in the journey of r/findingPMF, a real community, a real support system, and a real cohort of \"first users\".\n\nI promise honest feedback from the community and a safe space to learn and grow.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Startup_Ideas/comments/1rg76zj/66_repos_with_1_star_the_67th_got_700_stars_and/",
      "domain": "self.Startup_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o7p82zm",
          "author": "alichherawalla",
          "text": "[https://github.com/alichherawalla/off-grid-mobile](https://github.com/alichherawalla/off-grid-mobile)  \n[https://www.reddit.com/r/VibeCodeDevs/comments/1r199dk/i\\_was\\_struggling\\_with\\_generic\\_looking\\_uis\\_with/](https://www.reddit.com/r/VibeCodeDevs/comments/1r199dk/i_was_struggling_with_generic_looking_uis_with/)  \n[https://news.ycombinator.com/item?id=47019133](https://news.ycombinator.com/item?id=47019133)",
          "score": 1,
          "created_utc": "2026-02-27 13:50:12",
          "is_submitter": true,
          "replies": []
        }
      ]
    },
    {
      "id": "1rg1f8e",
      "title": "2025 Was the Era of AI Agents. 2026 Will Be the Era of AI Organizations. (Here Are 5 SaaS Ideas That Prove It)",
      "subreddit": "Startup_Ideas",
      "url": "https://www.reddit.com/r/Startup_Ideas/comments/1rg1f8e/2025_was_the_era_of_ai_agents_2026_will_be_the/",
      "author": "SaasFounder110",
      "created_utc": "2026-02-27 08:45:29",
      "score": 9,
      "num_comments": 8,
      "upvote_ratio": 0.8,
      "text": "In 2025, we were fascinated by AI agents. Little digital operators that could draft emails, automate workflows, summarize reports, reconcile accounts. They were fast, efficient, impressive. But they were still assistants.\n\nWhat’s coming next feels different.\n\n2026 won’t be about smarter tools. It will be about AI-native structures, systems that don’t just support teams, but *become* the team. We’re shifting from “AI that helps employees” to “AI that replaces entire functional layers.”\n\nI was researching B2B SaaS trends on Google recently and came across Startup Ideas DB. What caught my attention wasn’t just the innovation, it was the psychological shift behind the ideas. The strongest concepts weren’t productivity hacks. They were blueprints for AI-powered departments.\n\nHere are five that genuinely feel like signals of what’s next:\n\nOne idea focused on an **AI Regulatory Intelligence Hub** for global companies. Instead of scrambling every time tax rules, trade laws, or reporting standards change, this platform would continuously monitor jurisdictions, auto-adjust filings, and predict compliance risk before it surfaces. For companies scaling across borders, this isn’t a “nice-to-have.” It’s protection against chaos.\n\nAnother concept was a **Self-Operating Finance Division for SMBs**. Not just accounting automation, but a coordinated AI system handling receivables, forecasting, tax optimization, vendor payouts, and capital planning. Founders don’t just need data, they need decision support without hiring a full finance team. This kind of SaaS doesn’t just cut costs. It restores clarity.\n\nThere was also an **Autonomous Procurement Optimizer,** software that benchmarks supplier contracts in real time, runs negotiation simulations, and automatically re-engages vendors when better pricing becomes available. In an environment where margins are razor thin, procurement stops being administrative and becomes algorithmically strategic.\n\nAnother standout was a **Compliance-Embedded Product Infrastructure Layer** for regulated industries. Instead of building software and layering legal reviews later, this system would bake regulatory logic directly into workflows and product architecture. It’s like coding with guardrails that update themselves. For fintech, healthtech, and climate startups, that changes everything.\n\nAnd finally, an **AI Operations Architect for Hybrid Workforces**. A system that doesn’t just assign tasks, but dynamically redistributes work based on skill sets, performance patterns, deadlines, and capacity signals. It behaves less like project management software and more like a continuously adapting digital COO.\n\nThe emotional thread connecting all of these ideas is pressure. Founders are stretched. CFOs are cautious. Compliance leaders are overwhelmed. Businesses don’t just want automation, they want stability in an unpredictable world.\n\nThat’s why the next wave of SaaS will resonate differently. It won’t sell speed. It will sell certainty. 2025 proved AI could execute tasks. 2026 will prove it can coordinate systems. We’re moving beyond AI as a feature. Beyond AI as a copilot. Into AI as infrastructure.\n\nThe companies that win won’t just build smarter dashboards. They’ll build AI organizations, finance departments, compliance units, procurement teams, operations engines, all running on coordinated intelligence.\n\nAnd when that happens, the org chart doesn’t shrink. It transforms.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Startup_Ideas/comments/1rg1f8e/2025_was_the_era_of_ai_agents_2026_will_be_the/",
      "domain": "self.Startup_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o7r8gk2",
          "author": "zica-do-reddit",
          "text": "I am building in the AI regulatory/compliance space. It's hairy stuff...",
          "score": 3,
          "created_utc": "2026-02-27 19:42:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7o9cke",
          "author": "jannemansonh",
          "text": "totally agree on the shift to coordinated systems... spent way too long trying to wire together separate agents for client workflows. ended up moving that to needle app since you just describe what workflow you need and it builds it. way easier than configuring everything separately, especially if you're not super technical",
          "score": 2,
          "created_utc": "2026-02-27 09:26:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7orbl2",
          "author": "Background-Might3453",
          "text": "The shift from “assistant” to “system” feels right. Once AI starts coordinating work instead of just executing tasks, the value jumps.\n\nYou can already see early signals of this in workflow tools like Runable and similar platforms. Not replacing teams yet, but starting to glue functions together. That direction feels inevitable.",
          "score": 2,
          "created_utc": "2026-02-27 12:02:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7oswjp",
          "author": "Mean-Arm659",
          "text": "The shift from agents to AI native org design feels spot on. The winners will be the ones who think in coordinated systems, not isolated tools.  \nWhat you are describing is less automation and more operational architecture.",
          "score": 2,
          "created_utc": "2026-02-27 12:14:31",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rfnu9b",
      "title": "Lead drop-off problem for a local service business",
      "subreddit": "Startup_Ideas",
      "url": "https://www.reddit.com/r/Startup_Ideas/comments/1rfnu9b/lead_dropoff_problem_for_a_local_service_business/",
      "author": "InformationIcy4827",
      "created_utc": "2026-02-26 21:59:12",
      "score": 8,
      "num_comments": 6,
      "upvote_ratio": 0.91,
      "text": "A few months ago I was helping a small pest control operation that had a classic problem: decent traffic, okay form conversions, but leads were ghosting between inquiry and booked job. They were spending real money on ads and losing it somewhere in the follow-up gap.\n\nIn this context I decided to make some \"basic\" automation like immediate SMS response to any form submission, email follow-up at 2h and 24h, and for leads that went cold on both - voicemail drops that left a short personalized message directly in voicemail without ringing the phone.\n\nBooking rate on inquiries went from around 31% to 56% over 8 weeks. The biggest mover was the voicemail segment - people who had ignored both the SMS and email but called back after getting the voicemail. Not all of them, but enough to shift the numbers significantly.\n\nWhat surprised me was how transferable the setup was. Ran a version of the same stack for a dental practice (appointment reminders + re-engagement for lapsed patients) and a solar installer (quote follow-up). Similar pattern each time - the voicemail touchpoint was pulling conversions from leads that every other channel had already written off.\n\nYou can do this for pest control, HVAC, dental, legal, solar - that handles the entire lead-response flow automatically. No technical setup, plug in a webhook or CRM, running in an afternoon + charge 15-20 local businesses $600-900/month to run this for them, hit $12–15k MRR, operate lean.\n\nSuggestions or improvements anyone?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Startup_Ideas/comments/1rfnu9b/lead_dropoff_problem_for_a_local_service_business/",
      "domain": "self.Startup_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o7li68q",
          "author": "Wide_Brief3025",
          "text": "Love how you leaned into layered follow ups and tested voicemail drops. To keep pushing results, consider monitoring where people talk about these services in real time so you can address hesitations right as they come up. I use ParseStream for keyword alerts across places like Reddit and LinkedIn to spot conversion opportunities before leads go cold.",
          "score": 1,
          "created_utc": "2026-02-26 22:24:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7lo4qk",
          "author": "jbreckca",
          "text": "This is great! I’m not new to automations in CRMs but still learning the conversation AI aspect. Are you using conversation AI or just one-way automations in something like GHL? Trying to build a similar pluggable stack.",
          "score": 1,
          "created_utc": "2026-02-26 22:55:19",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rbrwh2",
      "title": "Brutally honest feedback",
      "subreddit": "Startup_Ideas",
      "url": "https://www.reddit.com/r/Startup_Ideas/comments/1rbrwh2/brutally_honest_feedback/",
      "author": "LachException",
      "created_utc": "2026-02-22 17:32:55",
      "score": 8,
      "num_comments": 4,
      "upvote_ratio": 0.99,
      "text": "Hey everyone,\n\nHope you all had a great weekend :)\n\nI am currently working on a project together with my co-founder. We are always seeking for some feedback on our idea and our tool as we are building.\n\nWe have talked to a lot of people. So it would be great, if you could share your thoughts on what we are working on. If you are a developer or cybersecurity expert (especially AppSec) we would like to have a very quick chat with you.\n\nYou would help us a lot! And maybe we could stay in touch, so we can give the tool to you for some time for free, for more feedback, if what we build is something that you are interested in.\n\n  \nThank you a lot! Just text beneath this post or DM me, if you would like to have a chat via Reddit, talk for a bit or something else. I am open for everything :D",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Startup_Ideas/comments/1rbrwh2/brutally_honest_feedback/",
      "domain": "self.Startup_Ideas",
      "is_self": true,
      "comments": []
    },
    {
      "id": "1rhwbi8",
      "title": "My Startup Idea crossed $100 MRR🎉",
      "subreddit": "Startup_Ideas",
      "url": "https://www.reddit.com/r/Startup_Ideas/comments/1rhwbi8/my_startup_idea_crossed_100_mrr/",
      "author": "chacha_chu",
      "created_utc": "2026-03-01 12:40:45",
      "score": 8,
      "num_comments": 4,
      "upvote_ratio": 1.0,
      "text": "Hey everyone,\n\nMy Startup Idea Clickcast.tech crossed $100 MRR in just 21 days after launch.\n\nBy the way the Idea is Simple Generate Motion graphics style or Screenshot based marketing or launch video for your website just by it's URL in few minutes.\n\nProof : https://trustmrr.com/startup/clickcast\n\nAsk anything!",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Startup_Ideas/comments/1rhwbi8/my_startup_idea_crossed_100_mrr/",
      "domain": "self.Startup_Ideas",
      "is_self": true,
      "comments": []
    },
    {
      "id": "1rcmont",
      "title": "This SaaS idea feels so practical it almost feels boring… and that’s why I like it.",
      "subreddit": "Startup_Ideas",
      "url": "https://www.reddit.com/r/Startup_Ideas/comments/1rcmont/this_saas_idea_feels_so_practical_it_almost_feels/",
      "author": "HomeworkHQ",
      "created_utc": "2026-02-23 16:49:48",
      "score": 7,
      "num_comments": 7,
      "upvote_ratio": 1.0,
      "text": "For the past few months I’ve been in that weird founder limbo where you’re consuming everything, AI agents, automation, vertical SaaS plays, but not actually committing to anything. Every idea sounded impressive on paper, but when I asked myself, “Would someone urgently pay for this?” the answer was usually… maybe.\n\nThen I came across an idea on StartupIdeasDB that didn’t scream hype. It was almost quiet. And the more I sat with it, the more it made sense.\n\nThe core concept is an agentic AI SaaS focused on contract and compliance management for small and mid-sized businesses. Not just summarizing documents. Not just generating templates. An autonomous system that actually monitors obligations inside contracts, tracks renewal clauses, watches for regulatory changes in a specific industry, and proactively flags risks before they become expensive problems.\n\nMost SMBs don’t have full legal teams. They’re juggling vendor agreements, tax requirements, licensing rules, privacy policies, and they’re mostly reactive. They find out something changed when they’re already late or exposed. That’s stressful, and more importantly, it’s costly.\n\nWhat if instead there was an AI agent operating in the background that mapped out every obligation from uploaded contracts, tracked deadlines automatically, monitored relevant policy changes, and nudged the business owner before something slipped? Even drafting suggested updates or summaries for review. Less “AI assistant,” more “AI risk manager.”\n\nThe reason this stood out to me is because it’s tied to downside protection. Founders often chase growth tools, but tools that prevent loss can be just as powerful. If a marketing tool disappears, it’s inconvenient. If you miss a compliance requirement, that can mean fines, legal exposure, or damaged partnerships.\n\nI’ve started having early conversations in a couple of niche industries, and the pattern is consistent: people don’t want more dashboards. They want fewer surprises. If something could quietly reduce operational risk and mental load, that’s worth paying for.\n\nI’m still validating, but this feels different from the usual “AI for X” wave. It’s focused, specific, and anchored in a problem that already costs real money.\n\nWould something like this be valuable in your industry, or is compliance already handled smoothly where you are?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Startup_Ideas/comments/1rcmont/this_saas_idea_feels_so_practical_it_almost_feels/",
      "domain": "self.Startup_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o7oruuv",
          "author": "Background-Might3453",
          "text": "This feels more grounded than most AI ideas I see. Preventing downside usually gets budget faster than chasing upside.\n\nThe framing around “fewer surprises” is strong. If people already pay for mistakes in your niche, that’s usually the clearest signal to keep digging.",
          "score": 2,
          "created_utc": "2026-02-27 12:06:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7pqkq6",
              "author": "HomeworkHQ",
              "text": "That’s exactly what’s been clicking for me.\n\nA lot of AI pitches feel like they’re selling potential upside, “grow faster, automate more, scale bigger.” Which is exciting… but optional. Downside protection feels different. It’s tied to anxiety, liability, and reputation. Those budgets tend to unlock faster because the pain already exists.\n\nThe “fewer surprises” angle is honestly the part I didn’t expect to resonate so much in early chats. Nobody wakes up excited to buy compliance software. But they do remember the time they missed a renewal window, signed a vendor contract with a bad clause, or got hit with a regulatory notice they didn’t see coming. That emotional memory is strong.\n\nAnd you’re right, if a niche is already quietly paying for mistakes (fines, legal cleanups, rushed amendments, consultant retainers), that’s a signal the value is measurable. It’s not theoretical ROI. It’s “this cost me $7000 last year, I’d rather not repeat that.”\n\nI think the real challenge will be trust and accuracy. If the system is positioned as a true “AI risk manager,” it has to be extremely reliable. But if that’s solved even partially, it stops being a cool AI tool and starts being infrastructure.\n\nAppreciate the thoughtful take, this is the kind of feedback that makes me want to keep digging instead of jumping to the next shiny idea.",
              "score": 1,
              "created_utc": "2026-02-27 15:26:18",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6zfgu3",
          "author": "Daisy_prime",
          "text": "I think that would be really valuable because most SMBs don’t have the bandwidth to stay ahead of shifting compliance rules.",
          "score": 1,
          "created_utc": "2026-02-23 17:22:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o72a6w1",
              "author": "HomeworkHQ",
              "text": "That’s exactly what I’ve been hearing too.\n\nIt’s not that SMBs don’t *care* about compliance, it’s that it’s always reactive. They’re busy running operations, serving clients, chasing revenue. Staying ahead of shifting rules just doesn’t make it to the top of the list… until something breaks.\n\nIf this works, the real value wouldn’t be “AI.” It would be giving them back mental bandwidth and preventing expensive surprises. That’s the part that feels interesting to me.",
              "score": 1,
              "created_utc": "2026-02-24 02:01:57",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7x2npj",
          "author": "ajija-khatun-1521",
          "text": "It sounds useful. I can imagine ways to expand it too, like moving from contract monitoring to managing performance. If you ever start doing things like managing vendor agreements and holding deposits, I recommend Xplor Pay for embedded payments. Good luck. I hope your project will be a success.",
          "score": 0,
          "created_utc": "2026-02-28 18:18:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o80utv4",
              "author": "Global_Worth_1598",
              "text": "Thanks for the tip, I’m looking for embedded payments.",
              "score": 1,
              "created_utc": "2026-03-01 08:40:23",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1reduqb",
      "title": "Physician interested in advising on early-stage health startups",
      "subreddit": "Startup_Ideas",
      "url": "https://www.reddit.com/r/Startup_Ideas/comments/1reduqb/physician_interested_in_advising_on_earlystage/",
      "author": "AnglePast1245",
      "created_utc": "2026-02-25 13:55:21",
      "score": 6,
      "num_comments": 3,
      "upvote_ratio": 1.0,
      "text": "I’m a practicing physician who enjoys vibe-coding and collaborating on early ideas. I’m interested in advising or thought-partnering with early-stage startups in healthcare, medicine, digital health, or AI in health.\n\nNot looking for payment — open to an advisory role or potential partnership if there’s a good fit. Happy to give clinical perspective, product feedback, and realism around healthcare workflows.\n\nComment or DM with a brief description of what you’re building.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/Startup_Ideas/comments/1reduqb/physician_interested_in_advising_on_earlystage/",
      "domain": "self.Startup_Ideas",
      "is_self": true,
      "comments": [
        {
          "id": "o7d2rg8",
          "author": "Excellent_Bid3260",
          "text": "Building cuerie - [https://cuerie.app](https://cuerie.app)  \nHere's how the idea originated - [https://www.reddit.com/r/ADHD/comments/1qz90pp/phone\\_alarms\\_never\\_worked\\_for\\_my\\_dads\\_meds](https://www.reddit.com/r/ADHD/comments/1qz90pp/phone_alarms_never_worked_for_my_dads_meds)",
          "score": 2,
          "created_utc": "2026-02-25 17:42:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7ttu0l",
              "author": "AnglePast1245",
              "text": "Good idea and useful. Compliance with medication is a big deal in clinical medicine. Older patients definitely need a user friendly app because I often see they are overwhelmed even with patient portal etc. I could see how you could even expand your idea to giving reminders to check glucose or INR level, keep doctor appointments, requests refills, log BP etc. I wonder if you could even link it to the physicians EMR so the staff in the doctors office could track compliance. Of course, like with any medical app make sure you protect yourself legally. Good luck.",
              "score": 1,
              "created_utc": "2026-02-28 04:40:47",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    }
  ]
}