{
  "metadata": {
    "last_updated": "2026-01-28 02:39:59",
    "time_filter": "week",
    "subreddit": "startup",
    "total_items": 20,
    "total_comments": 90,
    "file_size_bytes": 113779
  },
  "items": [
    {
      "id": "1qjcsvd",
      "title": "Non-Technical Co-Founder trying to figure out how to find Technical Leads (Equity)",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qjcsvd/nontechnical_cofounder_trying_to_figure_out_how/",
      "author": "Huge-Signature-7143",
      "created_utc": "2026-01-21 22:41:38",
      "score": 9,
      "num_comments": 49,
      "upvote_ratio": 0.85,
      "text": "Hi all, \n\nMe and my cofounder have spent the last two years designing a product that I have honestly been waiting my whole life to build. I have people waiting for me to get this product running, but we are having a really hard time finding developers. \n\nOur main issue is we don't have money. We have been doing this as a passion project and have been really avoiding VC and investing because we don't want the product to be owned by people who aren't invested in the concept and/or just want to use it for money. \n\nI understand equity can be sketchy or even end up being a dead end, but I was just hoping to get some advice maybe from other non-technical founders on where to look for people. \n\nUltimately we may very well just have to go the funding route, and I get that. We have a pitch deck made for that purpose and are getting to the point where we will probably have to do that, but just wanted to check here to see if anyone had any other ideas. \n\nThanks! ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1qjcsvd/nontechnical_cofounder_trying_to_figure_out_how/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o0z63k3",
          "author": "chymakyr",
          "text": "As someone who has been on the Y Combinator founder matching service for over a year, I can say with absolute certainty that it's been a joke.  It got to the point of having so many meetings and pitches from others to get me to jump in on hair-brained ideas for no money that I had to direct people to an F-U page before they bothered to reach out to me.  Most anyone messaging me after that obviously didn't read it because it was the same tired story. the few that did read it and messaged anyway \"got it\", and usually had some kind of traction and an MVP already (poorly) built - but still no money.  That matching service showed me unequivocally that 99% of these \"founders\" have no idea what they're getting into.  I'm between jobs now and broke, but even if I had substantial savings I wouldn't waste my time on any of those pitches.\n\nIt basically amounts to someone is the \"ideas\" person who has domain knowledge and sees an opportunity. they write a few documents, come up with an outline, pretend to be the \"business\" side, then expect a developer to spend months of their lives for no money working on nothing more than someone else's dream.  I feel bad for young techies who will get burned far too many times before they realize the path they've gotten themselves into.\n\nMy advice for you - cough up some money, sell your car, mortgage your house, borrow from your parents to have some skin in the game.  then, hire a very-trusted and experienced developer that you can immediately fire if things don't go right. stay away from \"offshore\" devs who have zero accountability, or junior devs who haven't gained the wisdom to avoid pitfalls. if necessary, go through a technical recruiting agency who already has a roster of proven professionals.",
          "score": 5,
          "created_utc": "2026-01-22 02:39:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1199qq",
              "author": "Desperate_Quit_5433",
              "text": "Coming from the non tech side founder, u r 💯 right! I spent so much energy and time with YC CO founder platform . What they promote is the survivor success stories  meanwhile most people dont find success on the platform.",
              "score": 1,
              "created_utc": "2026-01-22 12:22:22",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o13z5bf",
                  "author": "RoleHot6498",
                  "text": "There's truth in that. Did your startup workout in the end?",
                  "score": 1,
                  "created_utc": "2026-01-22 20:15:02",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o0za4mi",
              "author": "Huge-Signature-7143",
              "text": "My co-founder is a vet. Creative director. We have a fully prototyped high fidelity application with a full business plan. I do understand your points, but we have put two years of free time into this. I am very broke as well, but it’s really in no way just an idea. We probably will end up going the money route. That is a very real possibility. I understand what im asking, and i get why you feel how you do. We are prepping for that route. In the meantime, i am looking for ways around it until we get there. Appreciate the advice. It will probably come to that, but i am not losing all hope yet.",
              "score": 1,
              "created_utc": "2026-01-22 03:01:48",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o11ef03",
                  "author": "StoneCypher",
                  "text": "> We have a fully prototyped high fidelity application\n\nsounds like you don’t need a developer ",
                  "score": 1,
                  "created_utc": "2026-01-22 12:56:08",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0zbs5s",
          "author": "Shichroron",
          "text": "Line up customers",
          "score": 2,
          "created_utc": "2026-01-22 03:11:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o14tkje",
              "author": "Huge-Signature-7143",
              "text": "I have people waiting for it. At least the people i have shown it to.",
              "score": 1,
              "created_utc": "2026-01-22 22:44:34",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o152hxt",
                  "author": "Shichroron",
                  "text": "So have the pre-buy it or provide \"monkey in a box\" kind of service for a few for a small fee\n\nThis is the real proof that you have a business",
                  "score": 1,
                  "created_utc": "2026-01-22 23:31:04",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0zyb4o",
          "author": "Worldy_Dance42",
          "text": "What are you intending to build?   Have you validated the idea?",
          "score": 2,
          "created_utc": "2026-01-22 05:38:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o14uhs4",
              "author": "Huge-Signature-7143",
              "text": "Its a personal training app. Ive been a personal trainer for around 8 years, and a lot of it is based on what ive seen as needed. As far as validation, i have a lot of people waiting for me to actually get it developed. And scientific article proof of the concept. Obviously i dont have real people on it. But thats what i have.",
              "score": 1,
              "created_utc": "2026-01-22 22:49:30",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0y2qxf",
          "author": "LookHairy8228",
          "text": "I went through a pretty rough job search last year and watched a few friends try to recruit on equity-only, and the pattern I kept seeing was that senior engineers won’t touch equity until they see either real capital or real traction. What sometimes works better is scoping the absolute smallest possible version of your product and paying for that as a discrete contract instead of trying to bring on a “technical cofounder” outright. It gives people something concrete to build, reduces the trust barrier, and if you like working together, then the equity conversation becomes way easier. My husband’s in recruiting and he always says the same thing: equity is a story, not compensation, so your job is to make the story compelling enough that someone wants to opt in",
          "score": 2,
          "created_utc": "2026-01-21 23:02:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0y8z6p",
              "author": "Huge-Signature-7143",
              "text": "Yeah thats why weve been working on a pitch deck to better represent the business aspects and traction. I do take some real fault for losing people based on how i was proposing it before (showing the designs). Appreciate that tho. Totally right.",
              "score": 1,
              "created_utc": "2026-01-21 23:35:28",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o10e8cx",
              "author": "Super_Maxi1804",
              "text": "finding a good tech cofounder is the easiest thig in the world, all a good tech cofounder wants is for you to have done your job,   \ndon't come out with \"need the product first\" and \"if we build it they will come\" excuses.  \nstart with - \"this is the website\", \"this is how much traffic it have\", \"this are the wireframes\", \"this are the results of the user interviews\", \"this are the results of the AD campaigns\", \"this is the GTM\", \"This is the pricing model\", \"this is the expected number of users based on this tested marketing plan\" or for B2B \"this are the companies ready to be early adopters, this ones will pay when the product is ready\".\n\nyou will not be able to respond to all the tech people interested in working with you. (assuming you do not start with something stupid as less than 50/50)",
              "score": 0,
              "created_utc": "2026-01-22 07:52:10",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o10g49f",
          "author": "meddyjay",
          "text": "this is what exacly im suffering bro :)",
          "score": 1,
          "created_utc": "2026-01-22 08:09:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o14tuwo",
              "author": "Huge-Signature-7143",
              "text": "Its a tough one. Good luck soldier.",
              "score": 1,
              "created_utc": "2026-01-22 22:46:06",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o10klnv",
          "author": "Vaibhav_codes",
          "text": "Try Indie Hackers, GitHub, Reddit, and local startup meetups to find technical co founders willing to work for equity. Clear vision and ownership are key",
          "score": 1,
          "created_utc": "2026-01-22 08:51:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o14v1yl",
              "author": "Huge-Signature-7143",
              "text": "Thank you! We are trying to refine the vision so the business side makes sense.",
              "score": 1,
              "created_utc": "2026-01-22 22:52:28",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o10ncfv",
          "author": "IdeasInProcess",
          "text": "You likely do not need a custom codebase to start. We faced this same gap and instead of giving away equity we used automation platforms to string together the backend logic. It allowed us to launch the product and process data without a dedicated engineering team.",
          "score": 1,
          "created_utc": "2026-01-22 09:17:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o14umfk",
              "author": "Huge-Signature-7143",
              "text": "We have been looking at this! What tool did you use?",
              "score": 1,
              "created_utc": "2026-01-22 22:50:11",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o17pqc9",
                  "author": "IdeasInProcess",
                  "text": "We have our own called Dart chain",
                  "score": 1,
                  "created_utc": "2026-01-23 10:14:55",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o10rtk2",
          "author": "mandevillelove",
          "text": "consider networking in dev communities, hackathons, or offering early equity to passionate technical co-founders.",
          "score": 1,
          "created_utc": "2026-01-22 09:59:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o14v5ns",
              "author": "Huge-Signature-7143",
              "text": "Oh totally we were offering equity for each piece made and had that in writing.",
              "score": 1,
              "created_utc": "2026-01-22 22:53:01",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o10wtnq",
          "author": "MapSensitive9894",
          "text": "Engineer here, curious as to why two years were spent on business planning/prototypes? To be honest, in two years you could’ve taught yourself to code, and built your product. Before Ai, i would estimate 1-2 years to learn how to code+building a fullstack app. With Ai, this should take a dedicated person 3-6 months. What’s stopping you from running a quick intro course on code academy, then using your favorite Ai tool to guide you during development?",
          "score": 1,
          "created_utc": "2026-01-22 10:44:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o115vtq",
              "author": "Powerful-Software850",
              "text": "That part!!! It took me 6 months to learn how to code but the thing is I’m not doing high level interface coding. But honestly I feel like that’s something I can learn this year too.",
              "score": 1,
              "created_utc": "2026-01-22 11:58:09",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o14vrxt",
                  "author": "Huge-Signature-7143",
                  "text": "Yeah i need to go into it. Im just not sure i can get good enough fast enough to get to the level i need to make it.",
                  "score": 1,
                  "created_utc": "2026-01-22 22:56:15",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            },
            {
              "id": "o14vlhy",
              "author": "Huge-Signature-7143",
              "text": "I have to pay to live that was what most of the time was spent doing. It took two years because it was a side hobby. We are looking into using ai tools. Mostly i have just been hesistant in that area because I was worried about messing up the back end and having to face the repercussions later. The product is also fairly dense in concept. It is something we are considering for sure tho.",
              "score": 1,
              "created_utc": "2026-01-22 22:55:19",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o21uj8b",
                  "author": "MapSensitive9894",
                  "text": "Yeah fair enough, I’m doing the same. One thing to note is that early technical decisions should favor speed as you’ll need to move features quickly to align with customer expectations. Even with an engineer, the product will accumulate technical debt that will bring scalability, availability, or even security issues down the road - which will require refactoring, and rearchitecting either-way. I’ve definitely used products that were ugly or unstable just because they solved a big enough hassle for me. So I’d say give it your best shot until you get some funding or revenue to make a hire (even offshore). Best of luck!",
                  "score": 1,
                  "created_utc": "2026-01-27 17:23:59",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o11k0do",
          "author": "Big_Being_1466",
          "text": "Im an engineer can you tell me more about the product?",
          "score": 1,
          "created_utc": "2026-01-22 13:28:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o13vs5s",
          "author": "Far_from_world",
          "text": "Well I was at that stage few months ago \n\nBut then I took the risk \nPaying the developer from my pocket but it turned out really great. I am able to see my idea getting built into a product.\n\nInitially I was also thinking about money and all but then realised that if you really want somebody who’s serious then you will need to pay them \n\nI would also suggest you to pick up a good open source guy who’s in second last/last year of his college. And if the guy is good then offer him the equity. But first hire him. Don’t get in the bed with any guy blindly.",
          "score": 1,
          "created_utc": "2026-01-22 19:59:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o14wdbo",
              "author": "Huge-Signature-7143",
              "text": "Yeah i know. I am 26 and i dont rlly just have the money available to pay someone. Ive been part time working trying to design this, so ive been kind of living on the edge. We are looking at getting investment, so probably we will just end up paying someone. Appreciate the advice!",
              "score": 1,
              "created_utc": "2026-01-22 22:59:19",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o13ypyx",
          "author": "RoleHot6498",
          "text": "First, congrats to you and your partner for pursuing the dream your way. Second, your hesitation about outside capital is understandable but short sighted. It's not outside investment that creates problem, it's the WRONG outside investment. Have you guys considered really honing exactly who you want for investors beyond just the money?",
          "score": 1,
          "created_utc": "2026-01-22 20:13:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o14w3tu",
              "author": "Huge-Signature-7143",
              "text": "We spoke to a few people at the end of last year, but until rlly the end of last year, we were trying to reach out to people we knew who were devs. Definitely something we are looking into now, but if you have any idea i will happily take them!",
              "score": 1,
              "created_utc": "2026-01-22 22:57:57",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o16fg8b",
                  "author": "RoleHot6498",
                  "text": "Certainly. It takes some strategy but much of it is deciding what you need for you business to succeed like connections, insight, past experience, industry prowess and of course capital and then determining how that mix comes together in the ideal investor mindset. Then the work really begins by creating a campaign specifically aligned with your targeted investor. \n\n\nHappy to look at what you're doing in more detail via PM",
                  "score": 1,
                  "created_utc": "2026-01-23 04:01:51",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o176eu5",
          "author": "Dyagz",
          "text": "Have you tried to vibe code it yet? There is absolutely no reason you couldn't vibe code a training app on your own between 2 people.",
          "score": 1,
          "created_utc": "2026-01-23 07:18:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o17yurg",
              "author": "Huge-Signature-7143",
              "text": "I havent yet but that was a step i was considering. Partly i dont love the idea? Im a little worried if we vibe code rather than getting someone experienced to build that the back end will be messy and result in a later need to fix. It is something we are looking at tho!",
              "score": 1,
              "created_utc": "2026-01-23 11:32:50",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o19mnys",
                  "author": "Dyagz",
                  "text": "Tech debt is normal, building and launching and patching bugs is far superior to waiting and finding a partner who also could make mistakes. The models are so good now, you can get them to critique each others suggestions and then synthesize and a robust architecture.",
                  "score": 1,
                  "created_utc": "2026-01-23 16:52:50",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1lq1gq",
          "author": "Brief_Praline1195",
          "text": "I wouldn't do this for 100% of the equity. 100% of of f..... Is still.....",
          "score": 1,
          "created_utc": "2026-01-25 11:45:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o23r5ju",
          "author": "ZipZapBob",
          "text": "I wish you luck, my MVP does need some kind of grant - the reason is [similar.works](http://similar.works) fine, but the project done with A/ I  needs HUMANS now. Real engineers. So yes - for me the money is a problem either. Don't worry about your product, 2 years of development means this is something solid.  All the best!",
          "score": 1,
          "created_utc": "2026-01-27 22:26:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o10eavr",
          "author": "Super_Maxi1804",
          "text": "finding a good tech cofounder is the easiest thig in the world, all a good tech cofounder wants is for you to have done your job,  \ndon't come out with \"need the product first\" and \"if we build it they will come\" excuses.  \nstart with - \"this is the website\", \"this is how much traffic it have\", \"this are the wireframes\", \"this are the results of the user interviews\", \"this are the results of the AD campaigns\", \"this is the GTM\", \"This is the pricing model\", \"this is the expected number of users based on this tested marketing plan\" or for B2B \"this are the companies ready to be early adopters, this ones will pay when the product is ready\".\n\nyou will not be able to respond to all the tech people interested in working with you. (assuming you do not start with something stupid as less than 50/50)",
          "score": 0,
          "created_utc": "2026-01-22 07:52:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o14u1in",
              "author": "Huge-Signature-7143",
              "text": "Yeah we have been working on more of a business proposition. Appreciate the advice.",
              "score": 1,
              "created_utc": "2026-01-22 22:47:05",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qo5opn",
      "title": "How do startups handle accounting and compliance when expanding internationally?",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qo5opn/how_do_startups_handle_accounting_and_compliance/",
      "author": "sunmc_",
      "created_utc": "2026-01-27 06:01:39",
      "score": 8,
      "num_comments": 5,
      "upvote_ratio": 1.0,
      "text": "I’ve been trying to better understand what really happens *behind the scenes* when a startup begins expanding into multiple countries.\n\nEarly on, accounting is usually simple. But once you start opening entities abroad, hiring internationally, or working with global investors, things seem to get complicated fast — especially around compliance, reporting, and tax structures.\n\nI’ve noticed that larger corporate services firms (for example, groups like JTC that work in fund and corporate administration) often support companies operating across multiple jurisdictions. That got me wondering how startups *before reaching that scale* usually deal with these challenges.\n\nSome things I’m curious about:\n\n* At what stage do startups typically move from a local accountant to a more international accounting structure?\n* How do founders manage multi-country compliance without building a huge in-house finance team?\n* What are the biggest early mistakes startups make with entity structuring when planning to scale globally?\n* Do most startups centralize finance in one country, or run things locally in each market?\n\nNot looking to hire or promote anything — just hoping to learn from founders or finance folks who’ve gone through international expansion.\n\nWould love to hear real experiences, especially lessons learned the hard way.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1qo5opn/how_do_startups_handle_accounting_and_compliance/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o1z10uf",
          "author": "AnaSilva10x",
          "text": "I'm curious in how startups handle accounting and compliance as they go global. What are the biggest first errors in entity structure or multi-country compliance, and when do founders stop using a local accountant? I'd be interested in learning actual lessons.",
          "score": 1,
          "created_utc": "2026-01-27 06:36:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1zekel",
          "author": "_maddy18",
          "text": "Having very few years of experience and knowledge. I have worked for a startup who was active in multiple countries. There we used to do inhouse accounting and everything was done by Indian accountant itself. For additional safety for compliance and knowledge purpose an external consultant contract is madhe who guides the local accountant what and how to manage. \nBased on information, when a startup starts to scale in other countries there needs to be full time account person. This is triggered when compliance get more and more complex.\nWhen a company reaches mnc level it has a entire different team to handle this. Currently where i am working they have a seperate company full decided to monitor entire finance of group companies along with separate finance team for each companies.\nThis all information is based on small amount of experience.",
          "score": 1,
          "created_utc": "2026-01-27 08:34:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1zhr5t",
          "author": "Life-Recognition-997",
          "text": "Great questions, from what I’ve seen most startups lean on EORs and fractional finance early on to avoid entity complexity, and if you’re open to it I’d be happy to connect and swap notes on what founders usually learn the hard way.",
          "score": 1,
          "created_utc": "2026-01-27 09:03:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1zniiq",
          "author": "mandevillelove",
          "text": "Most startups outsource to global accounting/PEO firms early, centralise finance, and only build in house once scale forces it.",
          "score": 1,
          "created_utc": "2026-01-27 09:57:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o20505t",
          "author": "PapayaGlobalOfficial",
          "text": "A great partner with experience in the field and on the ground experts.",
          "score": 1,
          "created_utc": "2026-01-27 12:20:50",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qmkgrn",
      "title": "online shopping revolution",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qmkgrn/online_shopping_revolution/",
      "author": "Latter-Wolf4868",
      "created_utc": "2026-01-25 14:26:07",
      "score": 6,
      "num_comments": 24,
      "upvote_ratio": 0.81,
      "text": "\n\n\n\nI’ve had this idea in my head since last year. I even made a small WhatsApp group with a few people to start working on it. One guy was ready to help too, but everyone slowly disappeared like they got flushed down the toilet.\n\n\n\nThe idea: When we shop online, it’s usually for three things:\n\n\n\nCost\n\n\n\nConvenience\n\n\n\nVariety\n\n\n\nThe problem: A lot of people shop online not because they prefer it, but because they can’t find what they need in their own city. Sometimes the product is already nearby — we just don’t know where to look. Because of this, people end up waiting days or even a week for delivery.\n\n\n\nThe solution: Imagine if there was one platform that showed you every store and product available in your city. You could sit at home, browse all local shops, compare prices, and see exactly who sells what — before stepping out.\n\n\n\nExample: It’s Diwali and I need a specific disco light bulb I saw online. I don’t have time to wait for shipping, and I’m not sure it’ll arrive in good condition. Right now, I’d have to walk around town asking shop after shop if they have it. Most of them don’t. I can’t go asking ten stores.\n\n\n\nBut with a platform like this, I could search for the product, find which nearby shop has it, and buy it right away. That saves time and helps local sellers too.\n\n\n\nWhy I’m posting this: I’ve tried to start this project a few times, but without funding, it’s been hard to test it in the real market. I was honestly about to give up, but figured I’d share it here. Maybe someone else sees the same potential or has advice on how to bring this idea to life.\n\n\n\nI’m open to all kinds of feedback — good or bad. Just wanted to finally put it out there and see what people think.\n\n\n\n🙌🏽 Would really appreciate your thoughts in the comments. 🙌🏽\n\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1qmkgrn/online_shopping_revolution/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o1mvfbo",
          "author": "Ambitious-Pirate3620",
          "text": "Woah , 🙂 superv , bro literally you cracked the system I am impressed, need help ?",
          "score": 2,
          "created_utc": "2026-01-25 15:48:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1mvsk8",
              "author": "Latter-Wolf4868",
              "text": "why does your tone makes me feel like your'e making fun of it :(",
              "score": 1,
              "created_utc": "2026-01-25 15:50:15",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1mzpow",
                  "author": "Ambitious-Pirate3620",
                  "text": "Sorry bro , I didn't meant that 🙃",
                  "score": 2,
                  "created_utc": "2026-01-25 16:07:31",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1mwe1m",
          "author": "Ambitious-Pirate3620",
          "text": "Maybe since I prefer hindi as indian , and not familiar with English but seriously as struggling teen 17 yr old my manners refuse to make fun of you , seriously I do say it's very good idea !",
          "score": 2,
          "created_utc": "2026-01-25 15:52:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1niyc8",
              "author": "Latter-Wolf4868",
              "text": "Thanks! Koii baat NAHI bro I understand the English situation:)",
              "score": 1,
              "created_utc": "2026-01-25 17:30:18",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1nlael",
                  "author": "Ambitious-Pirate3620",
                  "text": "Welcome ,",
                  "score": 2,
                  "created_utc": "2026-01-25 17:40:19",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1sd5oe",
          "author": "IdeasInProcess",
          "text": "i feel like you are solving the wrong problem. The issue is not the user interface, it is the data ingestion. Small shop owners do not have APIs. They often do not even have accurate digital inventory records for themselves. To make this work, you would need to integrate with fifty different Point of Sale (POS) systems or force busy shop owners to manually update a CSV every morning, which they won't do. The reason this platform does not exist yet is not a lack of funding, it is because the inventory data is trapped in analog formats. I've spoken to restaurant owners about this exact issue",
          "score": 2,
          "created_utc": "2026-01-26 08:54:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1my4uy",
          "author": "Outrageous_Guess_962",
          "text": "the issue is scale rather than idea, cuz...aint u js rebuilding instamart or blinkit (am assuming ur indian)\n\nand lets say you are able to find a niche different than both of the titans, how do you plan on scaling? cuz, lets be honest talking with local shops when, one exists like every 5min is very difficult",
          "score": 1,
          "created_utc": "2026-01-25 16:00:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1njhhm",
              "author": "Latter-Wolf4868",
              "text": "Let each shop fill out forms or just ask them a list of what they keep and later have them sign up with some ease method. \nInstamart and blinkit could be a partner as our business is like a portal for customers that can easily access the whole market area from THEIR home unlike instamart and blinkit that focuses on groceries and stuff.",
              "score": 1,
              "created_utc": "2026-01-25 17:32:38",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1nmzey",
                  "author": "Outrageous_Guess_962",
                  "text": "love the idea, but isnt the whole point of instamart and blinkit to get as much margins as possible (they are loss making btw) so partnering isnt possible even in the next 2-3years. Then again ur idea on signing up local shops is kinda....impossible, have you ever tried to get a local shop to get the ideas u need by suggesting? (not the shop you go to loyally) It has a lot of friction and issues when look at which a different scope\n\n  \nTake this, would u need smth frm local shop when:   \nInstamart can send to your location in 10min, and updates their stock (ex: Christmas they had santa clause themed caps and stuff) or will local shops really be interested to sign up, you have to feed in consumer behavior from the start. So i dont think its the best idea, best to pivot. Or as a man once told me, \"beat the dead horse for a year or two then see where it leads\"\n\nAll the best to you regardless",
                  "score": 1,
                  "created_utc": "2026-01-25 17:47:22",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1ndhjn",
          "author": "LongIslandIceTeas",
          "text": "I love the idea and as someone mentioned already is scale. I would love to help (I’ll dm u) but first let’s talk it out. It would for sure be a scale issue here, but Amazon started out with a similar issue too…bezos use to deliver packages himself to customers. I read somewhere that these are the best thing to do for an early stage company anyways as it builds your brand and u get to be face to face with your customers (shop owners, end consumers)",
          "score": 1,
          "created_utc": "2026-01-25 17:06:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1nnirj",
              "author": "Outrageous_Guess_962",
              "text": "dont you think the local stores will be mostly replaced in the next 5-10 years? cuz tell me other than you local stores when have you gone shop to shop for almost anything, and if it does exist dont you think it will be updated into the instamart or blinkit catalogue soon enough? (saying this frm a T-1 city so could be different from place to place but principles are the same regardless)",
              "score": 1,
              "created_utc": "2026-01-25 17:49:39",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1ppzc5",
                  "author": "LongIslandIceTeas",
                  "text": "Wrong. I think there will be more local shops opening as giants such as Amazon need a physical retail presence. That says a lot about consumer preferences. We rather visit shops not just stay online since different products call for different experiences. If u think local shops only meaning delis, supermarkets, barber shops, cosmetic stores, etc. will be reduced in our local economy then you think of internet and AI as a big threat when it will be and is an enhancement to in store physical experiences.",
                  "score": 1,
                  "created_utc": "2026-01-25 23:12:07",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1qskow",
          "author": "CrackerWacker2000",
          "text": "I wasted months manually wiring databases, layouts, and auth before switching to Softr. It helped me build the app layer directly from spreadsheets, which removed a ton of friction for me. If you’re stuck gluing tools together or overengineering something simple, this shortcut is genuinely worth trying: [https://studio-softr.cello.so/TgYio9AYYhz](https://studio-softr.cello.so/TgYio9AYYhz). I hope this will genuinely help you to build something within a month -Cracker",
          "score": 1,
          "created_utc": "2026-01-26 02:23:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1st33k",
          "author": "Life-Recognition-997",
          "text": "You’re not crazy — the “Amazon for local inventory” idea dies or lives on **data ingestion**, not UI.  \nIf you test this, start **niche + one city + POS-led supply** (integrate 1–2 billing/POS systems or do “photo of invoice → SKU list” onboarding) so stock stays fresh.  \nWhat category are you anchoring on first (electronics parts, hardware, festive items, pharmacy)?",
          "score": 1,
          "created_utc": "2026-01-26 11:17:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1vep0x",
          "author": "RoleHot6498",
          "text": "You're right that without funding this kind of idea would just flounder. How much funding are you thinking it will take to launch it right?",
          "score": 1,
          "created_utc": "2026-01-26 19:05:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1yi7qg",
              "author": "Latter-Wolf4868",
              "text": "5-10k USD would've been enough to launch this. Can you raise 2 billions for me like you did for others 😂😂?",
              "score": 1,
              "created_utc": "2026-01-27 04:20:55",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o204mi3",
                  "author": "RoleHot6498",
                  "text": "Ok buddy",
                  "score": 1,
                  "created_utc": "2026-01-27 12:18:09",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1vje3z",
          "author": "random_roamer0",
          "text": "This is actually a very real problem, especially in Indian cities.\n\nPeople in the comments saying “just go to the market” are missing the point. Walking around 10 shops asking the same question is exactly the friction you’re talking about. Online shopping didn’t win because people love delivery delays. It won because discovery is easy.\n\nThe interesting part of your idea isn’t “local Amazon.” It’s local **visibility**. Most shops already have inventory. They just don’t exist digitally in a usable way. Google Maps listings and WhatsApp catalogs don’t solve search or comparison.\n\nThat said, this is execution hell. Inventory accuracy, seller onboarding, and keeping data fresh are brutal problems. If you try to boil the ocean, it’ll fail. If you start with one category where urgency matters (electronics accessories, lighting, hardware, festival items), it might actually click.\n\nAlso, the fact that people dropped off isn’t a signal the idea is bad. It’s a signal that unfunded, ops-heavy ideas are hard to push part-time. That’s normal.\n\nI wouldn’t frame this as a startup immediately. This feels like something you validate city by city, category by category, even manually at first. If demand shows up, money and people follow.\n\nNot saying it’s easy. Just saying it’s not stupid.",
          "score": 1,
          "created_utc": "2026-01-26 19:25:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1whzue",
          "author": "cezece",
          "text": "This is basically UberEats for everything (not just food).",
          "score": 1,
          "created_utc": "2026-01-26 21:58:34",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qj05ys",
      "title": "From Side Hustle to Startup, Built the Platform I Always Wanted",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qj05ys/from_side_hustle_to_startup_built_the_platform_i/",
      "author": "Hairy_Memory6232",
      "created_utc": "2026-01-21 15:01:23",
      "score": 6,
      "num_comments": 7,
      "upvote_ratio": 1.0,
      "text": "For the last 4–5 years, I’ve been freelancing and tutoring alongside my day job. What started as extra income slowly grew into something bigger and at one point, it even crossed my monthly salary.\n\nWhile tutoring international students and helping with assignments, I kept thinking:\n\nWhy isn’t there one simple platform for both 1-on-1 tutoring and homework help?\n\nSo I built it in last 1 year.\n\nIntroducing TeacherAndTask a place where students can connect with real teachers for tutoring, homework help, and project support.\n\nThe site just launched and I’m already seeing early sign-ups across globe, which feels amazing.\n\nNeed your feeedback on [**teacherandtask.com**](http://teacherandtask.com)",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1qj05ys/from_side_hustle_to_startup_built_the_platform_i/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o0v9msp",
          "author": "FrostingAccurate",
          "text": "Looks really good.",
          "score": 2,
          "created_utc": "2026-01-21 15:22:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0x3kz4",
          "author": "Fulcilives1988",
          "text": "Love the hustle. checking this out for my brother who is struggling with calc.",
          "score": 2,
          "created_utc": "2026-01-21 20:17:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o10k4xk",
          "author": "Delicious-Ground1570",
          "text": "Looks good, is it 1-1 video call or chat only?",
          "score": 2,
          "created_utc": "2026-01-22 08:46:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o10spwe",
              "author": "Hairy_Memory6232",
              "text": "1-1 video sessions ,and chat  , white board",
              "score": 2,
              "created_utc": "2026-01-22 10:07:59",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1603rs",
                  "author": "Delicious-Ground1570",
                  "text": "is the video call built-in or use external free app like zoom or google?",
                  "score": 1,
                  "created_utc": "2026-01-23 02:34:01",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o119f8n",
          "author": "Vaibhav_codes",
          "text": "Congrats on the launch! The concept is clear and solves a real problem. Early sign ups globally is a great sign maybe highlight teacher reviews/testimonials more upfront to build trust",
          "score": 2,
          "created_utc": "2026-01-22 12:23:25",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qnxq2c",
      "title": "is performance marketing just paid ads, or something more?",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qnxq2c/is_performance_marketing_just_paid_ads_or/",
      "author": "Sufficient-Owl1826",
      "created_utc": "2026-01-27 00:04:42",
      "score": 6,
      "num_comments": 2,
      "upvote_ratio": 1.0,
      "text": "[](https://www.reddit.com/r/startups/?f=flair_name%3A%22I%20will%20not%20promote%22)I keep seeing people use \"performance marketing\" as a fancy way to say paid ads, but I assume that's not all it is? For a small business, ads alone don't mean much if the landing page doesn't convert or the offer isn't clear. And I've seen campaigns with good CPCs still lose money because retention was weak or checkout had issues.\n\nWhat I want to know is where performance marketing really starts and ends. Is it mostly about media buying, or is it more about testing creatives, fixing funnels, making sure the numbers actually work? At what point does it stop being ads and start being business optimization?\n\nAsking because I don't have the budget to waste, and I need to know what actually moves profit, not just traffic. Curious how others here define it and what matters more for you guys.",
      "is_original_content": false,
      "link_flair_text": "digital marketing",
      "permalink": "https://reddit.com/r/startup/comments/1qnxq2c/is_performance_marketing_just_paid_ads_or/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o1zyzeq",
          "author": "Willing-Training1020",
          "text": "yeah performance marketing is basically paid ads but the \"performance\" part means you're supposed to be optimizing the whole funnel, not just traffic. make sure that your landing page and/or offer is good! i'd honestly fix your funnel with organic traffic first before spending on ads. it's really cheaper to learn what converts that way. can i ask what are you selling?",
          "score": 1,
          "created_utc": "2026-01-27 11:36:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o202746",
          "author": "Life-Recognition-997",
          "text": "Performance marketing goes beyond paid ads and is really about owning the whole revenue equation, from creative and targeting to landing pages, conversion rates, retention, and unit economics, with ads just being the traffic lever.",
          "score": 1,
          "created_utc": "2026-01-27 12:00:36",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qksgu9",
      "title": "Build in-house or pay for niche-specific content?",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qksgu9/build_inhouse_or_pay_for_nichespecific_content/",
      "author": "[deleted]",
      "created_utc": "2026-01-23 14:36:57",
      "score": 6,
      "num_comments": 9,
      "upvote_ratio": 0.79,
      "text": "Curious how other founders think about this.\n\nWhen it comes to content (posts, short-form, newsletters):\n\nDo you build it in-house\n\nAutomate with tools\n\nOr outsource completely?\n\nIf a service existed that only served one niche and handled content end-to-end, would that be attractive — or does content need to stay close to the founder/team?\n\nTrying to understand:\n\nWhere outsourcing breaks down\n\nWhat would make you trust an external content provider\n\nWhether this is a real “buy” problem or something founders prefer to own\n\nAppreciate any insights.",
      "is_original_content": false,
      "link_flair_text": "marketing",
      "permalink": "https://reddit.com/r/startup/comments/1qksgu9/build_inhouse_or_pay_for_nichespecific_content/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o18wlmq",
          "author": "Mundane-Stranger-588",
          "text": "Short answer: it depends on your niche.  \nAs obvious as it may sound, If you’re working in a narrow niche, hiring in-house usually makes more sense. You can pass on your expertise directly, while with outsourcing, gaps often appear between how things actually work in your business and how an external specialist presents them.\n\nI’d base the decision on how niche your business is and how you want these processes to work. If you need close collaboration and real synergy, go in-house. If you’re comfortable delegating the task to professionals, outsourcing is a good option.",
          "score": 1,
          "created_utc": "2026-01-23 14:53:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o19pbuw",
          "author": "-night_knight_",
          "text": "what worked for us was to partner up with an influencer who was responsible for all our content on a rev share basis, this is a way easier and faster way than producing content in house",
          "score": 1,
          "created_utc": "2026-01-23 17:04:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o19r63d",
          "author": "RoyalsValleyFounder",
          "text": "I’ve seen this work both ways, but one thing feels consistent: **strategy needs to stay close to the founder, execution doesn’t**.\n\nIn-house makes sense early when you’re still finding voice and positioning. Outsourcing usually breaks when the team doesn’t truly understand the niche and just ships volume.\n\nA niche-specific, end-to-end content service *could* work if it’s opinionated and grounded in real customer insight — not generic playbooks.\n\nMost founders don’t want to own content creation; they want to own clarity. If a service protects that, it’s a real buy.",
          "score": 1,
          "created_utc": "2026-01-23 17:13:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o19wmb8",
          "author": "Hour_Arachnid_2071",
          "text": "Pay for niche. Always.",
          "score": 1,
          "created_utc": "2026-01-23 17:39:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1bkmqd",
          "author": "Embarrassed_Snow_492",
          "text": "I’ve found strategy has to stay close to the founder, but execution doesn’t. Outsourcing usually (in my experience) breaks when the people creating content don’t really understand the niche or the feedback loop.",
          "score": 1,
          "created_utc": "2026-01-23 22:17:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1cvlnr",
          "author": "teadragon25",
          "text": "So far, I've gotten more traffic and views from creating the content myself than from hiring influencers, but I'm new to this so I know I still have a lot to learn",
          "score": 1,
          "created_utc": "2026-01-24 02:34:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1dv4c8",
          "author": "Terrible-Repair-9421",
          "text": "It’s not build *vs* buy — it’s **who owns the POV**.\n\nWhat works:  \n• In-house → positioning, opinions, final say  \n• External/tools → research, drafts, repurposing, consistency\n\nWhere outsourcing fails:  \n• Generic voice  \n• No customer context  \n• Content without outcomes\n\nNiche, end-to-end works **only** if founders keep POV + veto.  \nPeople will outsource execution — **not trust**.",
          "score": 1,
          "created_utc": "2026-01-24 06:35:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1gakqe",
          "author": "Intelligent-Past1633",
          "text": "Definitely seen the strategy vs. execution split work well. You gotta own the core message, but the grind of content creation can absolutely be outsourced.",
          "score": 1,
          "created_utc": "2026-01-24 16:47:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1z5f4p",
          "author": "Vaibhav_codes",
          "text": "Most founders start content in house to protect their voice, but niche specific services can work if they really understand your audience and brand Trust and alignment are key otherwise it feels generic",
          "score": 1,
          "created_utc": "2026-01-27 07:12:13",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qk9224",
      "title": "$0 to $149 ARR on day 1. Feels good man.",
      "subreddit": "startup",
      "url": "/r/SaaS/comments/1qk8lvs/the_first_person_i_reached_out_to_about_my_app/",
      "author": "NiceLasers",
      "created_utc": "2026-01-22 22:34:53",
      "score": 5,
      "num_comments": 3,
      "upvote_ratio": 0.86,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1qk9224/0_to_149_arr_on_day_1_feels_good_man/",
      "domain": "",
      "is_self": false,
      "comments": [
        {
          "id": "o1ygw38",
          "author": "Limp-Raise-4390",
          "text": "That's amazing mate... What have you done for marketing? Is it just reaching out to people? Whats ur app about? I wanna do marketing for my platform as well but not getting any idea on how to do it.",
          "score": 1,
          "created_utc": "2026-01-27 04:12:39",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qnchkp",
      "title": "AI Influencer app market is tough",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qnchkp/ai_influencer_app_market_is_tough/",
      "author": "Strangewhisper",
      "created_utc": "2026-01-26 10:28:48",
      "score": 4,
      "num_comments": 5,
      "upvote_ratio": 0.7,
      "text": "Last week I posted a video using an AI influencer on X and it got 3k views within 6 days and my X account is not much active. So, I decided to do a bit of market research and found out that top competitors of global markets are Synthesia, Avatarify, Replica etc. But most of them are costly and user retention is pretty low. But the main pain points are deep personalization and niche focus. Would you build an AI influencer app ? What are the things you would improve or like to add ? ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1qnchkp/ai_influencer_app_market_is_tough/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o1sodn5",
          "author": "Life-Recognition-997",
          "text": "AI influencer can work, but only if it’s **niche-first + workflow-first** (e.g., daily shorts for realtors/fitness coaches) — “generic avatar app” retention is brutal.  \nI’d bet on **deep personalization** (voice/style memory, brand kit, consistent character bible) + **1-click distribution** (scripts→video→auto-post + analytics).  \nWhat niche + repeatable job-to-be-done are you anchoring on, and how will you prove week-4 retention?",
          "score": 3,
          "created_utc": "2026-01-26 10:36:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1spgoo",
              "author": "Strangewhisper",
              "text": "I'm just analysing the idea and want some insights from founders.",
              "score": 1,
              "created_utc": "2026-01-26 10:46:01",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1zhm6d",
                  "author": "Life-Recognition-997",
                  "text": "Happy to connect if you’re open to it, would be great to exchange notes and learn from your experience.",
                  "score": 2,
                  "created_utc": "2026-01-27 09:02:37",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1toewu",
          "author": "workpage_dev",
          "text": "That market is so saturated at the moment",
          "score": 2,
          "created_utc": "2026-01-26 14:33:59",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qno3oa",
      "title": "Does anyone know where to find real UK/US/CA developers",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qno3oa/does_anyone_know_where_to_find_real_ukusca/",
      "author": "Curbsidewin",
      "created_utc": "2026-01-26 18:19:55",
      "score": 4,
      "num_comments": 24,
      "upvote_ratio": 0.75,
      "text": "\n\nI've been part of this community for nearly five years, working with developers in the US, UK, and Canada. However, since launching my own projects, I've noticed a shift. Most of the developers reaching out are now from India or the Philippines.\n\nThey often present themselves as experts in everything. The issue is, I’m looking for a specialist, not a generalist 'handyman.' If I need a carpenter, I hire a carpenter, not a street sweeper who does carpentry on the side. Where can I find qualified local devs? Is it just impossible to find them on this sub?",
      "is_original_content": false,
      "link_flair_text": "marketplace",
      "permalink": "https://reddit.com/r/startup/comments/1qno3oa/does_anyone_know_where_to_find_real_ukusca/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o1viowk",
          "author": "FrostingAccurate",
          "text": "Hey. I am Uk based local dev. Please DM .",
          "score": 2,
          "created_utc": "2026-01-26 19:22:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1vnx22",
              "author": "Curbsidewin",
              "text": "Good send me DM",
              "score": 1,
              "created_utc": "2026-01-26 19:45:35",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1wekq3",
          "author": "JacobDilley",
          "text": "You should have a chat with Ben who runs red explosion \n\n\nhttps://redexplosion.com/",
          "score": 2,
          "created_utc": "2026-01-26 21:43:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1wpb7e",
          "author": "Minute-Push-3268",
          "text": "UK based local senior engineer looking for freelancing work. Please DM.",
          "score": 2,
          "created_utc": "2026-01-26 22:32:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1wq45h",
              "author": "Curbsidewin",
              "text": "Good send me DM",
              "score": 1,
              "created_utc": "2026-01-26 22:36:17",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1x9bg7",
          "author": "Renalouca",
          "text": "UK based senior eng. DM",
          "score": 2,
          "created_utc": "2026-01-27 00:12:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o200r46",
              "author": "Curbsidewin",
              "text": "Good send me DM",
              "score": 1,
              "created_utc": "2026-01-27 11:49:54",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1ysju9",
          "author": "Taco-671",
          "text": "Piggybacking on this post… any Canada based Developers seeking projects?? Pls message me.",
          "score": 2,
          "created_utc": "2026-01-27 05:30:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o200q77",
              "author": "Curbsidewin",
              "text": "Good send me DM",
              "score": 1,
              "created_utc": "2026-01-27 11:49:43",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1z0n9m",
          "author": "Gh0stlyHub",
          "text": "I had the same issues a little while back, there are few digital nomad North American devs scattered around the globe, so you must want to contact some of them.",
          "score": 2,
          "created_utc": "2026-01-27 06:32:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o200rbx",
              "author": "Curbsidewin",
              "text": "Good send me DM",
              "score": 1,
              "created_utc": "2026-01-27 11:49:57",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o22c1lb",
          "author": "Hour_Arachnid_2071",
          "text": "Don't know sorry",
          "score": 2,
          "created_utc": "2026-01-27 18:38:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o22fj1l",
              "author": "Curbsidewin",
              "text": "ok",
              "score": 1,
              "created_utc": "2026-01-27 18:53:28",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o200xkq",
          "author": "Kali21x",
          "text": "Canadian based dev here",
          "score": 1,
          "created_utc": "2026-01-27 11:51:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o20tlis",
          "author": "Karn2407",
          "text": "hey OP, I have got a simple and good guide that might help you make better decision while hiring, have a look.:  \n[https://workable-cost-62e.notion.site/The-Insider-s-Guide-to-Finding-Hiring-Developers-for-App-Development-2ee4daac1fb78041a7e6e8d593ffc9e7?source=copy\\_link](https://workable-cost-62e.notion.site/The-Insider-s-Guide-to-Finding-Hiring-Developers-for-App-Development-2ee4daac1fb78041a7e6e8d593ffc9e7?source=copy_link)",
          "score": 1,
          "created_utc": "2026-01-27 14:38:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o22hbj5",
          "author": "SpeechFluenceDotCom",
          "text": "LinkedIn",
          "score": 1,
          "created_utc": "2026-01-27 19:01:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o22yoib",
          "author": "elixon",
          "text": "In India, of course. For a little extra, you can get even better accents and certificates of origin. How much real do you need? 🤡🃏\n\n**Practical advice: whatever Indians or Russians claim, halve it. Whatever Europeans claim, double it. Whatever Americans claim, take it as is. That’s my experience.**",
          "score": 1,
          "created_utc": "2026-01-27 20:18:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1v7yib",
          "author": "overDos33",
          "text": "Have you ever thought on trying an agency from Eastern Europe?\n\n  \nMany big companies like Google,Microsoft etc. has expanded branches in this part for less expenses and still same quality like in USA/UK.\n\n  \nI own a software agency based in Eastern Europe so if you are interested kindly DM me.\n\n  \nGood luck.",
          "score": 1,
          "created_utc": "2026-01-26 18:37:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1z7x54",
              "author": "Significant-Level178",
              "text": "Where about?",
              "score": 2,
              "created_utc": "2026-01-27 07:33:49",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o1vh7w2",
              "author": "Curbsidewin",
              "text": "Thanks.",
              "score": 1,
              "created_utc": "2026-01-26 19:16:39",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qocoq5",
      "title": "Making money without any specific skills is possible?",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qocoq5/making_money_without_any_specific_skills_is/",
      "author": "Latter-Wolf4868",
      "created_utc": "2026-01-27 12:37:23",
      "score": 4,
      "num_comments": 16,
      "upvote_ratio": 0.83,
      "text": "Hey guys, can anyone tell me if there is any way I can make money online without having any specific skills or maybe give a 1month time into learning something that will help me make at least 300$ a month at least. \n\n\nPlease guys If anyone have any idea or have done this maybe it'll be a great help I just want to make the bare minimum and somehow afford a stable laptop and later think big. Please consider giving your time in replying me, I will help alot ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1qocoq5/making_money_without_any_specific_skills_is/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o208ku9",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 2,
          "created_utc": "2026-01-27 12:44:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2095m7",
              "author": "Latter-Wolf4868",
              "text": "What's the website even about I see nothing there just a bunch of random letters and loading widgets",
              "score": 1,
              "created_utc": "2026-01-27 12:48:36",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o209k2a",
                  "author": "ZipZapBob",
                  "text": " could u give me a screenshot. it is a strange thing with some smartpones. that would help",
                  "score": 1,
                  "created_utc": "2026-01-27 12:51:09",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o20e3dm",
                  "author": "ZipZapBob",
                  "text": "I made a fix right away, please check again",
                  "score": 1,
                  "created_utc": "2026-01-27 13:18:11",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o20dr86",
          "author": "Routine_Warthog2336",
          "text": "I was in a similar spot and I’ll be honest: there’s no legit “no skill, instant money” thing that’s sustainable. But $300/month *is* realistic if you give one month to learning something simple. Stuff like basic data entry + Excel, simple Canva design, content formatting, or outreach support for small businesses. These aren’t “passions,” just tools. Learn one, apply it on Upwork/Fiverr/Reddit gigs consistently, and take low-paying work at first to build proof. It’s slow, but it’s real.",
          "score": 1,
          "created_utc": "2026-01-27 13:16:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o22bz6l",
          "author": "SoftDevilBC",
          "text": "It's possible you can learn while actually doing it. I've a platform in my account, you can try if it's fit you or you can search for affiliat program, there're lot of.",
          "score": 1,
          "created_utc": "2026-01-27 18:38:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o23ekoj",
              "author": "Mdbeast09",
              "text": "pls put the details here.",
              "score": 1,
              "created_utc": "2026-01-27 21:29:15",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o20wkse",
          "author": "highcoeur",
          "text": "Op try out [this app](https://attapoll.app/join/zrcsh) you’ll make $300 per month with no skills",
          "score": 0,
          "created_utc": "2026-01-27 14:53:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o21e6tx",
              "author": "Latter-Wolf4868",
              "text": "Interestingly not available in my region",
              "score": 1,
              "created_utc": "2026-01-27 16:13:18",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qjyaaq",
      "title": "Is it just me, or does Product-Market Fit basically reset the second you cross a border?",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qjyaaq/is_it_just_me_or_does_productmarket_fit_basically/",
      "author": "Gourab_Ghosh-",
      "created_utc": "2026-01-22 15:57:59",
      "score": 3,
      "num_comments": 7,
      "upvote_ratio": 0.72,
      "text": "I've had a \"Category King\" product in the US kitchen niche for two years. Gr⁤eat reviews, solid 15% conversion rate, and consistent rankings. Naturally, I thought expanding to the UK and Germany would be a copy-paste job. I translated the listing, shipped the inventory, and... crickets.\n\nThe conversion rate in the UK is half of what it is in the States, and my German PPC is just burning cash with zero sales to show for it. I used the same polished lifestyle images that worked here, but I'm starting to wonder if the aesthetic just doesn't land there.\n\nHow do you guys actually test for international product-market fit? Do you just launch and hope for the b⁤est, or is there a way to see how local consumers in different countries actually perceive your branding before you commit to localized inventory and VAT registration? I'm tired of guessing why my \"proven\" product is failing.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1qjyaaq/is_it_just_me_or_does_productmarket_fit_basically/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o13iqe4",
          "author": "PitifulAd502",
          "text": "You've hit on the biggest hurdle in global expansion: Visual Translation. What we consider \"bold and energetic\" in the US often comes across as \"cheap and loud\" in European markets like Germany or the UK. I stopped doing the \"launch and pray\" method after a similar disaster in Japan.\n\nNow, before I even localize a listing, I run a series of polls on Pic⁤kFu specifically targeting respondents in the country I'm entering. You can actually filter for UK or German panels and ask them to rank your US images against the local top sellers. The written feedback is a goldmine - they'll tell you if your colors feel \"off\" or if your messaging feels too \"salesy\" for their culture.\n\nIt's way cheaper to spend $50 on a localized poll than to realize your entire packaging design is a cultural mismatch after you've already sent 2,000 units to a warehouse in Berlin.",
          "score": 2,
          "created_utc": "2026-01-22 19:00:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o16svxx",
          "author": "Cutie_potato7770",
          "text": "The Category kings in Europe look nothing like the ones in the US. If you go on Amazon Japan, the listings are incredibly dense with information compared to the clean, minimalist look that is trending in the States right now. If you try to force a US-style listing into a market that expects a different visual language, you're going to lose every time. \n\nI've started using PickFu to run head-to-head blind tests where I put my US hero image up against the local leader in the UK or Australia. Seeing a British consumer explain why they trust the \"local\" brand over mine gives me the exact roadmap I need to fix my listing optimization. You can't just translate words; you have to translate the vibe and the level of trust the packaging communicates.",
          "score": 2,
          "created_utc": "2026-01-23 05:30:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o15i6ty",
          "author": "BiteyHorse",
          "text": "Just guessing and hoping for the best is indeed a strategy, but it's a shitty one.\n\nTest, test, test.  Work out variants with a creative partner, track performance, iterate.  Explore big differences then hone in on more subtle ones.  There's no shortcut around this.",
          "score": 1,
          "created_utc": "2026-01-23 00:53:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o17hixv",
          "author": "Vaibhav_codes",
          "text": "Not just you PMF resets by market US success doesn’t guarantee UK/DE conversions. Test with local copy, images, and small campaigns first to see how buyers actually respond before committing inventory.",
          "score": 1,
          "created_utc": "2026-01-23 08:58:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o17osap",
          "author": "Rough-Dragonfly-1898",
          "text": "Not just you PMF doesn’t “reset,” but your assumptions do. UK/Germany often behave like totally different markets in terms of trust, expectations, and even what signals quality. What worked for me was testing demand without going all-in: run localized landing pages, price tests, and small paid traffic experiments before touching inventory/VAT. Also, US lifestyle imagery can read as “try-hard” or inauthentic in Germany, so even if the product is strong, the brand wrapper can tank conversion.",
          "score": 1,
          "created_utc": "2026-01-23 10:06:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o17osvd",
          "author": "Overall_Broccoli_844",
          "text": "100% real. Crossing borders is like restarting PMF on hard mode because your winning combo (positioning + creative + offer + trust) was tuned to US buyer psychology. Germany especially is brutal if your value prop is vague or your price doesn’t match perceived durability/engineering. The fastest way I’ve found is to validate with micro-batches and local feedback loops (native copy, local creators, and customer calls) before scaling spend—otherwise PPC just becomes an expensive way to learn your messaging is wrong.",
          "score": 1,
          "created_utc": "2026-01-23 10:06:30",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qj7jwb",
      "title": "Early users wanted: help shape a new DeFi platform on Solana",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qj7jwb/early_users_wanted_help_shape_a_new_defi_platform/",
      "author": "MadamGao",
      "created_utc": "2026-01-21 19:26:21",
      "score": 3,
      "num_comments": 4,
      "upvote_ratio": 1.0,
      "text": "Hey everyone,\n\nWe’re two developers who’ve spent the past year building a DeFi platform on Solana. We’re opening a closed beta and are looking for people who want to help shape it early through real usage and honest feedback.\n\n# Why we built this\n\nUsing crypto still feels harder than it should.\n\nEven experienced users end up juggling multiple tools, explorers, dashboards, and half-broken UIs just to answer basic questions like:\n\n* What actually happened on-chain?\n* Did my transaction go through?\n* Why did something fail?\n\nWe’ve both been actively using blockchains for over two years, and if we were running into these issues regularly, it was clear that the UX barrier for newer users is even higher.\n\nOur goal became straightforward:  \nBuild a transparent, community-first DeFi platform that reduces friction, explains what’s happening, and keeps users informed — without requiring 10 tabs or constant explorer checks.\n\n# What’s already live\n\n**Core functionality includes:**\n\n* **Activity Feed** – Discover and trade newly created tokens (on our platform and across Solana)\n* **Token Trading** – Full trading dashboard with charts and key metrics for any Solana token\n* **Swap** – Token swaps across the ecosystem\n* **Token Creation (V1 & V2)**\n* **Token Management** – Metadata updates, authority management, burns, supply locks, fee collection\n* **Liquidity Pool Creation & Management**\n\n# What we’re working on next\n\n* Public release\n* Different types of incubators\n* Deeper protocol integrations (and deploying our own programs)\n* Personalized news feeds\n* A gaming-focused section\n\n# Features we think matter\n\n* **Free API** with full documentation, integration guides, and demo apps\n* **Chain-style activity history** – see everything you’ve done with full context (no explorer needed)\n* **Learning modules** – structured education from beginner to advanced\n* **Step-by-step guides** throughout the platform\n* **4 supported languages**: EN, FR, DE, ES\n* Revenue-generation programs\n\nWe didn’t want to build “another DeFi site with three input fields.”  \nThe goal is something usable, explainable, and extensible — shaped by real users, not assumptions.\n\n# Why we’re opening a closed beta\n\nWe believe DeFi products work best when they’re shaped with the community, not after launch.\n\nWe’re inviting beta users to:\n\n* Test the platform\n* Share honest feedback (good or bad)\n* Suggest features or improvements\n* Help align the product with actual user needs\n\nIt doesn’t matter if you’re:\n\n* A casual user\n* New to crypto\n* A designer\n* A developer\n* Or someone with strong opinions about UX\n\nIf you care about improving DeFi usability, your input is valuable.\n\n# Beta details\n\n* The platform is public but it work based on wallet whitelisting for those who perform transactions\n* **Drop a comment and we will contact you.**\n\n**Notes:**\n\n* No downloads required\n* No wallet connection required to explore\n* Test wallets with SOL can be provided\n* No personal information required\n\nThanks for reading.  \nWe’re looking forward to learning from the community and improving this with your help.",
      "is_original_content": false,
      "link_flair_text": "services",
      "permalink": "https://reddit.com/r/startup/comments/1qj7jwb/early_users_wanted_help_shape_a_new_defi_platform/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o0ytnvq",
          "author": "Project_Extraction",
          "text": "Hey, feel free to send me a DM.",
          "score": 1,
          "created_utc": "2026-01-22 01:28:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o10g10z",
          "author": "meddyjay",
          "text": "good luck",
          "score": 1,
          "created_utc": "2026-01-22 08:08:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1zub1h",
          "author": "redblddrp",
          "text": "this actually sounds solid ux is still the biggest pain point on solana so anything that reduces explorer hopping is a win also would be cool if you integrate an aggregator like rubic for swaps so users get best routing without leaving the app happy to try the beta if spots are open",
          "score": 1,
          "created_utc": "2026-01-27 10:57:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1zuiul",
              "author": "MadamGao",
              "text": "Hi, I’ve sent you a DM.",
              "score": 1,
              "created_utc": "2026-01-27 10:59:36",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qkq7cy",
      "title": "Partner or team member",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qkq7cy/partner_or_team_member/",
      "author": "matarrwolfenstein",
      "created_utc": "2026-01-23 13:01:50",
      "score": 3,
      "num_comments": 9,
      "upvote_ratio": 1.0,
      "text": "Hi all,\n\nI’m a UK-based early-stage founder with a live SaaS product in the construction space. We’ve built estimating software specifically for SME construction companies – focused on pricing jobs properly, protecting margins, and reducing the time builders spend stuck behind a laptop at night.\n\nThe product launched last year and is now doing \\~£2k MRR with paying users. It’s already becoming a core operational tool for many of them (not a “nice to have”), and the feedback has been strong. The fundamentals are solid, churn is low, and paid acquisition via Google and Meta is running consistently.\n\nThis year, the goal is to scale meaningfully – targeting £10k+ MRR – and I’m at the point where I don’t want to do that alone.\n\nI’m looking to speak with either:\n\n**1. A partner / collaborator**  \nSomeone entrepreneurial who wants to help grow a real, working product in a defined niche. This could be commercial, content-led, or strategic, depending on fit.\n\n**2. A content-first operator / creator**  \nIdeally someone comfortable being the *face and voice* of the product on social platforms (TikTok, Instagram, LinkedIn, etc.). The content itself is intentionally simple: short, practical videos talking to builders about pricing jobs, common estimating mistakes, margins, overheads, and running a more profitable construction business. No over-produced influencer stuff – just clarity, consistency, and credibility.\n\nI’ve spent years in marketing and know the construction industry extremely well, so you wouldn’t be guessing what to say or who you’re speaking to. I can provide structure, topics, direction, and support. There’s also scope to build tutorial and walkthrough content as the product continues to expand.\n\nThis is very much an open conversation at this stage – I’m interested in finding the *right working relationship*, not forcing a predefined role. Equity, commercial arrangements, or paid + upside models are all on the table depending on experience and involvement.\n\nIf this sounds interesting, feel free to reply or DM me. Happy to answer questions and share more detail about the product, traction, and roadmap.\n\nCheers.",
      "is_original_content": false,
      "link_flair_text": "digital marketing",
      "permalink": "https://reddit.com/r/startup/comments/1qkq7cy/partner_or_team_member/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o19gd53",
          "author": "Practical_Tank8083",
          "text": "Dm",
          "score": 1,
          "created_utc": "2026-01-23 16:24:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o19pvhc",
          "author": "-night_knight_",
          "text": "hey! sure please dm me!",
          "score": 1,
          "created_utc": "2026-01-23 17:07:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o19s0fo",
          "author": "RoyalsValleyFounder",
          "text": "This is a solid place to be — £2k MRR with low churn in a niche where the product is already operationally critical is a good foundation.\n\nOne thought from experience: be clear whether you’re looking for a **growth partner** or a **distribution operator**, because those attract very different people. A true partner will care about pricing, positioning, funnels, and retention. A content-first operator will care about cadence, clarity, and audience trust — and may not want broader ownership decisions.\n\nThe construction angle is actually a big advantage here. Builders respond well to **plain, practical content**, not polished marketing, so the “face of the product” approach makes sense — but credibility matters more than polish.\n\nIf I were evaluating this, I’d want clarity on:\n\n* What growth lever you believe content unlocks that paid ads won’t\n* How success is measured in the first 90 days\n* Whether the role evolves into ownership of a channel or a function\n\nSounds like a real opportunity if expectations are aligned early.",
          "score": 1,
          "created_utc": "2026-01-23 17:17:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1aebth",
          "author": "ssc456",
          "text": "Have sent you a DM. I'm sure you are being flooded but I'm 100% serious and interested in learning more. \nI'm UK based and currently head of technical operations in my current role. \nWould love to arrange a Teams call!",
          "score": 1,
          "created_utc": "2026-01-23 18:58:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1amu8p",
          "author": "alex-clovegrid",
          "text": "Happy to help with design, copy, and positioning.\n\nFeel free to DM.",
          "score": 1,
          "created_utc": "2026-01-23 19:38:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1t6hro",
          "author": "Upbeat-Employer-3194",
          "text": "Hello, I'm currently working on a platform designed to help people build a business using AI agents (business plans, logos/branding, pitch decks, landing pages, grant submissions etc.) You just need to prompt one idea and the agents will build a full business plan and project plan. Would you be interested in testing if some of our AI agent can help you fill some positions/jobs first?",
          "score": 1,
          "created_utc": "2026-01-26 12:55:45",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qjo6ny",
      "title": "I have few discounted LinkedIn premium coupons",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qjo6ny/i_have_few_discounted_linkedin_premium_coupons/",
      "author": "Then_Ad_8224",
      "created_utc": "2026-01-22 07:29:16",
      "score": 3,
      "num_comments": 1,
      "upvote_ratio": 1.0,
      "text": "for career plan valid  for 3 months \nDM if you are interested",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1qjo6ny/i_have_few_discounted_linkedin_premium_coupons/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o1ctqhe",
          "author": "Then_Ad_8224",
          "text": "DM if you are interested",
          "score": 1,
          "created_utc": "2026-01-24 02:23:43",
          "is_submitter": true,
          "replies": []
        }
      ]
    },
    {
      "id": "1qkls10",
      "title": "im in my last year of highschool and need some business advice (no hate pls)",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qkls10/im_in_my_last_year_of_highschool_and_need_some/",
      "author": "Necessary_Wonder1322",
      "created_utc": "2026-01-23 08:51:36",
      "score": 3,
      "num_comments": 6,
      "upvote_ratio": 1.0,
      "text": "so im in my last year of high school so im going to be really busy this year but I really want to set a good foundation so when I'm in college next year I've got businesses I can work on instead of scratching my head trying to find something new. and what better way to set a foundation than get into content creation. so basically i have 2 \"projects\" i will be working on throughout the year.\n\nbtw these accounts are faceless\n\nthe first - an IB tips/resources account (on Instagram/Tiktok)\n\n* since I do the IB doing something like this makes sense/is easier for me since i kinda know what im talking abt\n* basically i want to grow a following on instagram/tiktok so I can monetise it next year - maybe through starting a tutoring business or promoting tutoring businesses whatever it is\n* currently I just passed 50 followers. basically the content I post on there is like a mix of study tips and memes - I use a couple carousel posts a week, a couple memes and also a couple IB tips reels\n* the thing is for my first couple videos I used an AI avatar but some of my friends said to stop because it just looked bad so ive stopped and now switched to just ai voice so it might be a video of someone studying and then an ai voice in the background giving tips - let me know what you think about this\n* **I've set a goal of 30k followers by December this year and yeah just wanted some advice/tips on how I can achieve that**\n\nthe second 'project\" - a money/business tips account (this one I still haven't really solidifed the purpose yet I'm learning as I go) - on Insta, TikTok & Ytshorts\n\n* I only started this, this week but its always been a passion of mine to do this\n* So right now I'm not really sure what I'm doing - I've been posting reels like \"How did this celebrity get rich\" and they've been doing well but in the future I want to do reels like \"the best times to post content\", \"the best sidehustles for teens to start\"\n* I do use an ai avatar for this but since I edit my content pretty well and include B roll footage as well its not too bad\n* the thing is this type of content takes a while to edit which is why I only plan on having 3 videos a week of this kind and the rest maybe business quotes, movie scenes (such as wolf of wall street) stuff like that\n* **Monetisation** \\- I plan to monetise next year by helping people scale/build their businesses and brands - what else can I do for monetisation?, obviously thats in the future but I want to have something I can work towards. Also, I've seen faceless channels that post memes and stuff and once they've built a following they monetise through things like helping brand owners scale but I don't really want to post bs content - I want to post content thats actually helpful throughout (for example stuff like business strategy/tips)\n* **I want to hit 100k followers by December - do y'all think its possible, any advice?**\n\nWould really like some advice for these 2 projects I'm doing - thanks guys.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1qkls10/im_in_my_last_year_of_highschool_and_need_some/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o17icad",
          "author": "ImperialPartner",
          "text": "If you want to start monitizing instead of building your own IG or TikTok page I would suggest you find 2 to 3 people in your area with business and try and build there personal pages this will be helpful in a year time when you approach people and ask to do the same thing for them … the conversation wont be hi I built my social media page I can also do it for you but rather it will be hi I helped this 3 business owner grow from this to that I can also do the same for you… this shifts the buys mind into thinking that you already proofed what you can do now it just becomes a matter of how much rather the. Have you done this before…",
          "score": 1,
          "created_utc": "2026-01-23 09:05:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o17ndlq",
          "author": "mandevillelove",
          "text": "focus on consistent and valuable content, test what sticks, and grow one audience at a time before monetising.",
          "score": 1,
          "created_utc": "2026-01-23 09:53:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o17s27k",
          "author": "IdeasInProcess",
          "text": "Your friends are right about the AI avatar. It signals spam to the algorithm and to humans. We saw this with our own marketing, raw screenshots of messy workflows performed 40% better than polished AI videos because they looked real. For the IB account, stop trying to be a creator and just document your actual work. Film your notes. Screen record your essay structure. That is the content people actually save. Do not worry about monetising That is a fake guru business model. Monetise by selling the study notes you are already writing.",
          "score": 1,
          "created_utc": "2026-01-23 10:35:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o17z7ik",
          "author": "devhisaria",
          "text": "Hitting 30k and 100k followers by December from scratch is super unlikely especially with school focus on consistent quality content over follower numbers.",
          "score": 1,
          "created_utc": "2026-01-23 11:35:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o19tju9",
          "author": "RoyalsValleyFounder",
          "text": "You’re thinking about this the right way — **foundation > quick wins**, especially with a busy year ahead.\n\n**IB account:**  \nFaceless + AI voice over study footage is fine. AI avatars feel “off” in education because they hurt trust. Study clips + clear voice + on-screen text is much more credible.\n\nI’d tighten:\n\n* One clear promise (e.g. *IB tips that save time*)\n* Memes as **IB inside jokes**, not generic study memes\n* Reels for growth, carousels for trust — keep both\n\n30k by December is ambitious but realistic if you post consistently and lean into formats that get saves/shares (exam seasons matter).\n\n**Money/business account:**  \nBroad business + celebrities grows fast but monetizes poorly. I’d narrow it to:\n\n* Business for teens/students\n* Content & brand building at a young age\n* Documenting what you’re learning in real time\n\nThat builds legitimacy early.\n\n**Monetisation:**  \nYou don’t need this fully defined yet. Strong paths later:\n\n* Digital products (guides, templates)\n* Tutoring/coaching adjacent to the niche\n* Genuine affiliates\n* Services after public proof\n\n100k is possible, but it’ll come from **clear positioning, repeatable formats, and growing** ***with*** **the audience**, not over-editing.",
          "score": 0,
          "created_utc": "2026-01-23 17:24:55",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qlshcu",
      "title": "Recommendation for low cost incorporation agencies in Singapore?? I will not promote",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qlshcu/recommendation_for_low_cost_incorporation/",
      "author": "Glittering-Water1103",
      "created_utc": "2026-01-24 17:07:59",
      "score": 3,
      "num_comments": 1,
      "upvote_ratio": 1.0,
      "text": "Hi All! \n\nI plan on incorporation my startup in the singapore for its benefits, but it looks a bit expensive.I wanted to Do it myself because I thought it's simpler like the UK incorporation process but I guess not. If anyone has gone through the process, could you please suggest me some genuine and low cost agencies that help with the incorporation!  Thanks x ",
      "is_original_content": false,
      "link_flair_text": "services",
      "permalink": "https://reddit.com/r/startup/comments/1qlshcu/recommendation_for_low_cost_incorporation/",
      "domain": "self.startup",
      "is_self": true,
      "comments": []
    },
    {
      "id": "1qn8kad",
      "title": "“We’re Just Infrastructure” Is Not a Good Shield - Fintech Platforms Need To Learn This",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qn8kad/were_just_infrastructure_is_not_a_good_shield/",
      "author": "its_akhil_mishra",
      "created_utc": "2026-01-26 06:37:19",
      "score": 3,
      "num_comments": 1,
      "upvote_ratio": 1.0,
      "text": "Many fintech founders say this with confidence: “We’re just infrastructure.”\n\nNo funds move through the system. No balances sit on the platform. No lending activity is visible on paper. From the inside, this feels like a clean separation from regulatory exposure, almost like placing the product at a safe distance from anything that might attract scrutiny.\n\nRegulators do not evaluate that distance the same way.\n\nIn fintech, labels carry very little weight. What matters is what the product enables in practice, not how it is described in a pitch deck, on a website, or in internal discussions.\n\nIf your APIs, workflows, or dashboards allow a client to carry out credit-like or otherwise regulated activity without the appropriate licenses, the separation you believe you have created tends to collapse very quickly. From the regulator’s point of view, your system did not simply exist in the background. It actively made something possible.\n\n**### When Infrastructure Becomes Evidence**\n\nThis is usually the point where the idea of neutrality starts to fall apart.\n\nLogs that once felt like routine technical records begin to look like evidence. APIs stop being seen as generic tools and start resembling regulated pathways. The platform itself becomes part of the factual narrative, even if that was never the intention behind its design.\n\nEnforcement almost never starts with questions about intent. It starts with feasibility.\n\nRegulators are not usually asking whether you meant for a particular outcome to occur. They are asking whether your system made that outcome achievable. If the answer is yes, your platform is already inside the frame, regardless of whether you touched funds or held balances.\n\nAt that stage, what you thought you were building matters less than what the product allowed others to do.\n\n**### Why Contracts Define the Real Boundary**\n\nThis is where many fintech teams underestimate how much weight contract design actually carries.\n\nProducts can be misused even when they are built carefully and in good faith. You cannot control every downstream behaviour, but you can decide how close you stand to that behaviour when things are examined later.\n\nContracts are where that boundary is drawn in writing. They are not administrative formalities. They are evidence of where responsibility was taken on and where it was explicitly refused.\n\nThat requires being clear about what use cases are permitted and which activities are prohibited. It requires spelling out licensing assumptions instead of leaving them implied. It requires stating, in plain terms, what happens if a client crosses those lines, rather than assuming enforcement will never be tested.\n\nJust as important, those rights need to be operationally real. A theoretical right to suspend access or terminate a relationship does very little if it cannot be exercised quickly and decisively when misuse appears.\n\nThe ability to pause access, demand remediation, or exit without friction is what creates meaningful legal distance when things go wrong.\n\n**### Final Thoughts**\n\nCalling yourself “just infrastructure” does not place you outside regulatory scrutiny. Regulators focus on outcomes, not labels, and on what your product enables rather than how it is positioned.\n\nIn fintech, distance from risk is not created by intention or architecture alone. It is created by clarity.\n\nThat clarity has to exist on paper well before it is tested in practice. When something breaks, the question will not be what you meant to build, but what your system made possible and whether you clearly defined the line before anyone crossed it.[](https://www.reddit.com/submit/?source_id=t3_1qn8jv1)",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1qn8kad/were_just_infrastructure_is_not_a_good_shield/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o1sa6w3",
          "author": "payments_ops",
          "text": "This hits home with me for sure,  especially the point about enforcement starting with feasibility rather than intent.\n\nOne thing I’ve noticed is that once money, coordination, or shared outcomes are involved, “neutrality” stops being a philosophical position and starts being an operational one. If the system can’t clearly show where responsibility begins and ends at the moment of failure, it tends to inherit liability by default.\n\nDesigning those boundaries early feels slower, but it's  often the only way infrastructure survives real world stress.",
          "score": 2,
          "created_utc": "2026-01-26 08:27:16",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qoh2ey",
      "title": "We are planning to start an agency but cofounder has some doubt",
      "subreddit": "startup",
      "url": "/r/marketingagency/comments/1qodca4/we_are_planning_to_start_an_agency_but_cofounder/",
      "author": "ConferenceDry2969",
      "created_utc": "2026-01-27 15:33:17",
      "score": 3,
      "num_comments": 3,
      "upvote_ratio": 1.0,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1qoh2ey/we_are_planning_to_start_an_agency_but_cofounder/",
      "domain": "",
      "is_self": false,
      "comments": [
        {
          "id": "o21h71x",
          "author": "Savings-Sell8319",
          "text": "Throw him out doubt kills",
          "score": 2,
          "created_utc": "2026-01-27 16:26:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o24j2rb",
          "author": "CalmMonk60",
          "text": "Make sure you have good legal agreements so if they leave you don’t get screwed",
          "score": 1,
          "created_utc": "2026-01-28 00:46:49",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qljb91",
      "title": "How do you actually structure and manage UGC creator deals so you can scale 10–30 creators posting ~10 videos/week without losing your mind?",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qljb91/how_do_you_actually_structure_and_manage_ugc/",
      "author": "Ok-War-9040",
      "created_utc": "2026-01-24 10:08:35",
      "score": 3,
      "num_comments": 4,
      "upvote_ratio": 1.0,
      "text": "Hey Reddit 👋\n\n**Disclaimer:** This is not an ad. I’m not promoting or mentioning any tools or services. I’m genuinely looking for advice and trying to learn. PLEASE HELP ME OUT.\n\nI’ve been watching growth hack videos from SaaS/founder creators where they talk about having *30 creators*, each posting *10–12 UGC videos per week* for TikTok... videos that are basically short, casual, not polished, very UGC-style, and feel like someone sharing a “secret” not an ad.\n\nEverything about the strategy makes sense conceptually… *but how does this work IRL?*\n\nI already know how to **find creators** (different platforms for it I know). What I **don’t** know is:\n\n1. **Creator Contracts / Deals**\n   * How do you structure deals with creators who are expected to produce *multiple videos per week*?\n   * Are they paid per-video, on retainer, or performance-based (e.g. bonus per view/conversions)?\n   * What do real deals look like (usage rights, exclusivity, payment terms)?\n   * Do experienced folks start with 50% upfront? Net 30? Monthly retainer?\n2. **Pricing / Budgets**\n   * What do creators actually charge for *recurring weekly content,* especially smaller UGC folks vs pros?\n   * Is $150–$500 per video a realistic rate in this context, or do teams typically negotiate bundle pricing or monthly retainers? I’ve seen people claim they produce hundreds of videos per week across \\~30 creators, and I’m trying to understand how that’s financially and operationally feasible.\n   * What are people paying for *ongoing production systems* vs one-off videos?\n3. **Briefing & Management**\n   * What’s the best way to *brief*, *track*, *approve*, and *feedback* high volumes of UGC without losing efficiency?\n   * Are there templates for briefs/contracts/shot lists/usage rights?\n   * How do you ensure content *feels native* and not “ad-y”?\n4. **Scaling & Retention**\n   * How do you keep creators engaged *long-term* so they don’t post 2–3 then disappear?\n   * Do people use systems (Notion/Sheets/automation tools) to organize schedules + deliverables?\n\n# Bonus: if anyone has:\n\n* Actual **contract templates / UGC brief templates**\n* Examples of **payment structures**\n* Tips people use in agencies to manage UGC at scale\n* Real numbers you’re comfortable sharing\n\nWould love a breakdown of how *experienced marketers* do this on the *SaaS/TikTok UGC* side.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1qljb91/how_do_you_actually_structure_and_manage_ugc/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "o1l5kx8",
          "author": "Emotional-Nerve-5944",
          "text": "Your main win is building a repeatable system, not hunting for more creators. Think in pods: 5–8 creators per pod, each on a simple monthly retainer + performance kicker. Example: flat $800–$1.2k/month for 8–12 vids + tiered bonus if a video passes X views or drives a tracked signup (unique links, codes, or TikTok attribution). Keep usage rights simple: 6–12 months paid media + organic, no exclusivity unless you pay noticeably more.\n\n\n\nOps-wise, treat it like a content pipeline: Notion or Airtable for briefs and status, Slack/Discord channel per pod, and one weekly batch call or Loom to give direction and review winners. One-page briefs: 3 key pains, 3 proof points, 3 example hooks; no scripts, just angles so it stays native. For sourcing and messaging ideas, I’ve used Billo and Incense for creators, and Pulse for Reddit alongside Sprout to mine actual phrasing from niche subs and turn that into new hooks. Your main win is the system, not the volume.",
          "score": 2,
          "created_utc": "2026-01-25 08:45:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1leu5v",
              "author": "Ok-War-9040",
              "text": "Thank you so much!",
              "score": 1,
              "created_utc": "2026-01-25 10:07:07",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o1v14hl",
                  "author": "Emotional-Nerve-5944",
                  "text": "Main thing is turning that into a repeatable playbook. After a month, tag which hooks/creators drive demos, then double their pods and cut weak ones. I’ve used Incense, Billo, and Pulse’s Reddit tracking for fresh angles that feel like real user talk.",
                  "score": 1,
                  "created_utc": "2026-01-26 18:09:15",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qojny4",
      "title": "Pivoted after a year of flat growth — and just closed our first SAFE. Some lessons from the other side.",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qojny4/pivoted_after_a_year_of_flat_growth_and_just/",
      "author": "Lembergdk",
      "created_utc": "2026-01-27 17:04:55",
      "score": 3,
      "num_comments": 0,
      "upvote_ratio": 1.0,
      "text": "I started working on my startup in summer 2024, along with a couple of co-founders.\n\nWe got our first paying customers fairly quickly. Not a huge number, but enough to feel like: *“Okay, this is real. We provide value”*\n\nThen… nothing.\n\nFor almost a year, traction basically flatlined. Same conversations, same objections, same lukewarm interest. We shipped features, tweaked pricing, improved onboarding. It all felt productive — but the numbers didn’t move.\n\nBy fall last year, it was obvious: The problem we were solving was just not painful enough for anyone to really care.\n\nSo in November, we did the thing everyone tells you not to do lightly:\n\n* Full pivot\n* New brand\n* Completely reshaped product\n* Completely different target audience\n\nIt was uncomfortable. It meant admitting that a year of work wasn’t leading where we hoped. It meant killing things we’d invested a lot of pride into. It meant starting conversations from zero again.\n\nBut almost immediately, something felt different.\n\nPeople *got it* faster. Sales calls stopped being educational lectures and turned into “how soon can we use this?” conversations. Feedback became sharper. Our leads started referring new leads.\n\nSince then:\n\n* We’ve seen consistent growth month over month\n* Inbound actually exists now (still wild to me)\n* And today, we received our **first SAFE investment**\n\nI’m excited — but also weirdly calm. Mostly because this time, the progress feels earned and repeatable, not accidental.\n\nA few takeaways for anyone in the “year of nothing” phase:\n\n* Early revenue ≠ product-market fit\n* Flat growth is a signal, not a moral failure\n* Pivots aren’t resets — they’re compounding learning\n* If explaining your product takes 10 minutes, that’s the problem\n\nHappy to answer questions about the pivot, fundraising, or what we did wrong the first time.",
      "is_original_content": false,
      "link_flair_text": "investor relations",
      "permalink": "https://reddit.com/r/startup/comments/1qojny4/pivoted_after_a_year_of_flat_growth_and_just/",
      "domain": "self.startup",
      "is_self": true,
      "comments": []
    }
  ]
}