{
  "metadata": {
    "last_updated": "2026-01-12 16:49:59",
    "time_filter": "week",
    "subreddit": "startup",
    "total_items": 33,
    "total_comments": 319,
    "file_size_bytes": 295242
  },
  "items": [
    {
      "id": "1q3t9ml",
      "title": "The lessons I learned scaling my app from $0 to $30k/mo in 1 year",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1q3t9ml/the_lessons_i_learned_scaling_my_app_from_0_to/",
      "author": "felixheikka",
      "created_utc": "2026-01-04 15:50:59",
      "score": 77,
      "num_comments": 26,
      "upvote_ratio": 0.95,
      "text": "* 80%+ of people prefer Google sign in\n* Removing all branding/formatting from emails and sending them from a real name increases open rate\n* You won’t know when you have PMF but a good sign is that people buy and tell their friends about your product\n* 99.9% of people that approach you with some offer are a waste of time\n* Sponsoring creators is cheaper but takes more time than paid ads\n* Building a good product comes down to thinking about what your users want\n* Once you become successful there will be lots of copy cats but they only achieve a fraction of what you do. You are the source to their success\n* I would never be able to build a good product if I didn’t use it myself\n* Always monitor logs after pushing new updates\n* Bugs are fine as long as you fix them fast\n* People love good design\n* Getting your first paying customers is the hardest part by far\n* Always refund people that want a refund\n* Asking where people heard about you during onboarding makes marketing 10x easier\n* Marketing is constant experimentation to learn what works. Speed up the process by drawing inspiration from what works for similar products.\n* Don’t be cheap when you hire an accountant, you’ll save time and money by spending more\n* A surprising amount of users are willing to get on a call to talk about your product and it’s super helpful\n* Good testimonials will increase the perceived value of your product\n* Having a co-founder that matches your ambition is the single greatest advantage for success\n* Even when things are going well you’ll have moments when you doubt everything, just have to shut that voice out and keep going\n\nFor context, [my app](https://aicofounder.com) guides users through ideation and idea validation.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1q3t9ml/the_lessons_i_learned_scaling_my_app_from_0_to/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "nxnctoc",
          "author": "the-silva",
          "text": "Valuable content! I have several curiosities, but one in particular: how did you find or decide who would be your co-founder?",
          "score": 3,
          "created_utc": "2026-01-04 16:32:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxo9frs",
              "author": "felixheikka",
              "text": "I found him in my house. My co-founder is my brother :)",
              "score": 5,
              "created_utc": "2026-01-04 18:59:19",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nxnujtc",
          "author": "WallygatorPL",
          "text": "Congrats on $30k MRR - that's a huge milestone! Few questions if you don't mind:\n\n1. \"Sponsoring creators is cheaper but takes more time\" - how did you measure this vs paid ads? Time to first conversion or overall CAC?\n\n2. The Google sign-in stat is interesting - did you A/B test this or just noticed it in analytics? I'm implementing OAuth now and debating whether to even offer email/password signup.\n\n3. \"Asking where people heard about you during onboarding\" - do you make this required or optional? I'm worried about adding friction but totally see the value.\n\nAlso totally agree on the co-founder point, doing this solo is brutal. What's your product if you don't mind sharing?",
          "score": 3,
          "created_utc": "2026-01-04 17:54:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "nyd3r15",
              "author": "Fun-Shop9937",
              "text": "About the Google Sign-in I think that is sort of Google that has been educating people for some time. Apple has a similar thing, Apple prefers that you use their Sign-in in the apps. If you use others, they may look a little more suspicious. And either way they are just more practical than having to create/remember passwords, so less friction.",
              "score": 1,
              "created_utc": "2026-01-08 08:16:28",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nxni6ph",
          "author": "jellyturtsy",
          "text": "wow I'm really surprised by that first stat of prefering the Google signin. I've been building the whole get a link to sign-in setup and now you got me rethinking it",
          "score": 2,
          "created_utc": "2026-01-04 16:57:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxrlghj",
          "author": "zyakita",
          "text": "I swear I've read similar posts more than 50 times. Is this becoming the way to farm?",
          "score": 2,
          "created_utc": "2026-01-05 05:03:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxnqyun",
          "author": "shohan4556",
          "text": "**Having a co-founder that matches your ambition is the single greatest advantage for success.** I agree thsi is very difficult to find right co-founder.",
          "score": 1,
          "created_utc": "2026-01-04 17:38:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxoqhzs",
          "author": "Kooky-Muffin-5569",
          "text": "Thanks for the advice!! Fully agree that finding a cofounder with the same vision is the single most important thing",
          "score": 1,
          "created_utc": "2026-01-04 20:15:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxs71rn",
          "author": "ApprehensiveTry4850",
          "text": "Thanks for all the tips  ! & is there any canadian in there ?",
          "score": 1,
          "created_utc": "2026-01-05 07:57:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxsd8k9",
          "author": "Terrible-Repair-9421",
          "text": "Great breakdown. A lot of these points—PMF being obvious only in hindsight, fast bug fixes, talking directly to users, and constant marketing experiments—are lessons most founders learn the hard way. Solid reminder that growth is more about fundamentals and consistency than hacks.",
          "score": 1,
          "created_utc": "2026-01-05 08:55:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxsw11c",
          "author": "windows-cli",
          "text": "Thanks a lot, was this your first startup?",
          "score": 1,
          "created_utc": "2026-01-05 11:44:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxtf35h",
          "author": "Radiant-Design-1002",
          "text": "Definitely needed to hear this. I'm launching my app in the next couple weeks and I've been very nervous about how well it's going to perform.\n\nI have my technical cofounder who has built the entire backend and made sure everything's functional. I myself have helped with design marketing in overall vision.\n\nOnce we launch, I know that most of the pressure is going to be on me to advertise as much as possible and get people to our app. This is obviously very new for the both of us, but it's just good to hear someone else that went through it, especially because my goal by the end of year one is to be doing 50,000 a month.\n\nDo you have any advice on how to get the competitive advantage in organic marketing for an app?",
          "score": 1,
          "created_utc": "2026-01-05 13:52:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxv701s",
          "author": "bartrirel",
          "text": "Thanks for sharing your lessons!",
          "score": 1,
          "created_utc": "2026-01-05 18:59:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxzskhr",
          "author": "Automatic_Bus1187",
          "text": "This is a very cool app, i'm enjoying it.  Useful post as well.  Would love to hear more about how you've built and marketed your own app.",
          "score": 1,
          "created_utc": "2026-01-06 12:07:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "ny0c1ov",
          "author": "Annual_Mall_8990",
          "text": "Being a founder saying this. Getting the first paying users really is the hardest part. Everything after that is just different problems. That first “will anyone actually pay for this” phase is rough mentally.",
          "score": 1,
          "created_utc": "2026-01-06 14:08:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "ny2i1mo",
          "author": "mouhcine_ziane",
          "text": "Co founder alignment matters most",
          "score": 1,
          "created_utc": "2026-01-06 20:11:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nykvb4i",
          "author": "KiraKgoesRdt",
          "text": "\"80%+ of people prefer Google sign in\"  \ndo you think that is specific to your app or the target group of your app?",
          "score": 1,
          "created_utc": "2026-01-09 11:37:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nylzkdh",
          "author": "Western_Net_529",
          "text": "One thing I’d add is writing down why you shipped a decision or change, because when doubt hits later it helps to look back at your reasoning instead of rewriting history. Curious which of these lessons surprised you the most once you actually lived through it.",
          "score": 1,
          "created_utc": "2026-01-09 15:26:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nymjwhm",
          "author": "Dear_Big_279",
          "text": "having a co-founder is in some case a headache. If you are not matching your common goal will be blurry in a short time of period.",
          "score": 1,
          "created_utc": "2026-01-09 16:58:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nyurhyk",
          "author": "Ok_Abbreviations4012",
          "text": "Nice thanks",
          "score": 1,
          "created_utc": "2026-01-10 21:13:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxo1rgg",
          "author": "palexeev",
          "text": "Some super valuable tips here! I launched a YouTube channel where I publish weekly interviews with world-class founders and marketers that cover the strategies, tactics, and tools that power their growth. \n\nIn the last decade, I’ve grown 4x businesses from $0 to multi-million exits and with the cost of building going to zero, I truly believe the only remaining moats in business are marketing and distribution.\n\nI built this channel to help the next generation of founders and builders grow their businesses. Let me know what you think: https://www.YouTube.com/phillionaire",
          "score": -1,
          "created_utc": "2026-01-04 18:26:06",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1q77sns",
      "title": "I thought scaling was the Goal… It almost killed the business",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1q77sns/i_thought_scaling_was_the_goal_it_almost_killed/",
      "author": "Ramosisend",
      "created_utc": "2026-01-08 09:52:45",
      "score": 39,
      "num_comments": 6,
      "upvote_ratio": 0.96,
      "text": "I’ve built a few things over the years (some worked, some died quietly) and honestly a lot of startup advice online is either overly romantic (“just hustle!”) or so generic it’s basically fortune cookies, so here are the lessons that actually mattered for me (and the “productivity” stuff that didn’t):\n\nDiscipline isn’t a personality trait, it’s a system. The founders who “stay consistent” aren’t magically motivated, they just remove friction. I started seeing results when I stopped relying on willpower and built simple habits like daily shipping (even tiny updates), weekly review loops, and a short list of priorities. Even 10 minutes of focused planning every morning beats trying to brute-force your day (at least for me).\n\nProduct-market fit comes from doing the boring work. It’s not one big breakthrough, it’s customer conversations, support tickets, watching people fail to use your product, and refining one key interaction until it feels inevitable. Most founders skip the uncomfrotable part, actually listening. The best growth strategy I’ve ever used was doing interviews every week even after launching, because the market never stops moving tbh.\n\nThe “one more feature” trap is real, and it’s mostly fear. When things aren’t working, it’s tempting to hide behind building. Building feels productive. Selling and marketing feels like rejection. But most startups die because they didn’t distribute, not because they didn’t build enough. The moment I adopted the “ship it, learn, iterate” mindset, I started building things people actually wanted instead of just stuff I thought was cool.\n\nGrowth comes from channels and repitition, not creativity alone. A lot of founders think growth is about big viral moments. It’s usually about doing one or two channels consistently for months. Content that answers questions completely (SEO), user-generated proof, and community engagement (Reddit, niche forums, etc.) compound over time. Some of my best ROI has come from writing deeply helpful posts in communities and letting the long-tail do the work.\n\nMost tool stacks are just procrastination in disguise. I’ve wasted absurd time chasing the “perfect” software stack. What finally helped was keeping it boring: one place to track tasks, one CRM, one way to capture notes, one automation tool. Tools should reduce repeat work, not create a second job managing your tools. I still use a mix of basic docs and automations, and if I’m testing something new I sanity check what actually sticks long-term on sites like G2 or Business Heroes (and sometimes Product Hunt lists) just to compare what’s legit vs hype.\n\nScaling doesn’t fail because of ideas, it fails because of cashflow and systems. Lots of businesses stay small because they don’t have predictable margins, repeatable acquisition, or operational systems that survive hiring. Scaling means your chaos becomes expensive fast. If your business depends on you for everything, growth becomes a trap.\n\nThe most underated skill is emotional durability. You will get rejected, ignored, doubted, and sometimes publicly roasted. If that breaks you, you can’t win long-term. The best founders I know treat discomfort like a signal, not a stop sign. Rejection is just data.\n\nIf you’ve built something (or you’re in the trenches right now) what’s one lesson you learned the hard way that you wish every new founder knew?",
      "is_original_content": false,
      "link_flair_text": "knowledge",
      "permalink": "https://reddit.com/r/startup/comments/1q77sns/i_thought_scaling_was_the_goal_it_almost_killed/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "nydlg40",
          "author": "IdeasInProcess",
          "text": "Hi founder here. \"Scaling means your chaos becomes expensive fast\" This sentence really struck a chord with me in the whole post. I always tell people: Scaling doesn't fix problems, it magnifies them. If you have a manual onboarding process that takes 20 minutes, it’s fine at 5 customers. At 500 customers, that same process kills a business because it requires 3 full-time hires you can't afford.",
          "score": 3,
          "created_utc": "2026-01-08 10:55:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "nyjhhmo",
              "author": "Apprehensive_Age1937",
              "text": "this is so true and nobody talks about it enough. I learned this the painful way when we started getting actual traction and suddenly every little inefficiency we had became this massive bottleneck. Like we had this janky way of handling customer data that worked fine when it was just me and one other person, but once we hit like 50 customers a week it turned into a complete nightmare - we were literally drowning in spreadsheets and missing shit left and right. The worst part is you don't even realize how broken your systems are until you're already in the middle of the fire trying to fix them while also trying to keep everything running. Now I'm obsessed with documenting processes and automating the repetitive stuff before we scale anything, because trying to retrofit systems when you're already underwater is basically impossible and will burn you out faster than anything else.",
              "score": 2,
              "created_utc": "2026-01-09 04:43:57",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nydhox3",
          "author": "SurroundFlashy1252",
          "text": "Hi, Ana Kogovšek here. I’m growth manager at HolyShift. Over the years I’ve worked on 250+ SaaS projects, some scaled, some stalled, some quietly died.\n\nFor a long time, I thought scaling was the goal. Faster growth, more users, more features. In hindsight, chasing scale too early almost killed more than one business I was involved in.\n\nA lot of startup advice online sounds great, but most of it never really helped me when things got messy. \n\nI realized that discipline isn’t a personality trait. The founders I admired for being “consistent” weren’t more motivated than me. They just built systems that removed friction. I only started seeing progress when I stopped relying on willpower and kept things boring. Shipping something every day, even if it was small. Reviewing the week regularly. Writing down a short list of priorities instead of juggling everything in my head. Ten minutes of planning in the morning changed more for me than pushing longer hours ever did.\n\nAnother thing I learned is that product-market fit comes from doing unglamorous work. There was never a big breakthrough moment for me. It came from talking to users, reading support tickets, watching people struggle with things I thought were obvious, and slowly fixing one interaction at a time. I noticed that the moment teams stop talking to users, usually right after launch, things start drifting. The market doesn’t stand still, even if your roadmap does.\n\nI also fell into the “one more feature” trap more times than I’d like to admit. When things weren’t working, building felt safe. It felt productive. Distribution and selling felt like rejection. Looking back, most things that failed didn’t fail because they were missing features. They failed because not enough of the right people ever saw them. Shifting to a mindset of shipping, learning, and iterating helped me build things people actually wanted, not just things I enjoyed building.\n\nGrowth itself was another illusion for me. I used to think it came from clever ideas or one big moment. In reality, most growth I’ve seen came from repetition. Doing one or two channels consistently for months. Writing content that genuinely answered questions. Showing real user proof. Participating in communities without trying to sell. Some of the best results I’ve seen came quietly, over time.\n\nI also learned that most tool stacks are just procrastination in disguise. I’ve spent way too much time chasing the perfect setup. What finally helped was keeping things simple. Tools only helped when they reduced repeat work, not when they added another system to maintain.\n\nScaling itself didn’t fail because of ideas. It failed because of cash flow and systems. I’ve seen businesses stay small because margins weren’t predictable, acquisition wasn’t repeatable, or everything depended on one person. Growth made the chaos more expensive, not better.\n\nAnd probably the most important thing I learned was emotional durability. Rejection, silence, and doubt are part of the process. The founders I admire most don’t treat discomfort as a stop sign. They treat it as information. Rejection stopped feeling personal once I started seeing it as data.",
          "score": 2,
          "created_utc": "2026-01-08 10:23:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "nydm14r",
              "author": "Ramosisend",
              "text": "Appreciate you sharing this Ana, fr it’s kinda reassuring hearing someone with that much SaaS time say the same thing I been feeling… scaling early can be a trap, not some flex. The part about “building feels safe, distribution feels like rejection” hit hard cause that’s exactly how I used to hide, and it took me waay too long to realize most failures weren’t product failures, they were like… attention failures. Also love your point that PMF is basically boring reps (tickets, interviews, watching users struggle) cause that’s where the real signal comes from, not the roadmap. What’s the earliest sign you look for now that a team is scaling before they’ve actually stabilized the core loop (retention, margins, acquisition)?",
              "score": 1,
              "created_utc": "2026-01-08 11:00:49",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nyiacch",
          "author": "Proof-Camel-9152",
          "text": "Also a founder, and this resonates hard.\n\nWhen I was vague about who the product was for or what pain it solved, no amount of hustle helped. The moment I got brutally specific, everything got easier: messaging, distribution, and even what not to build.",
          "score": 1,
          "created_utc": "2026-01-09 00:46:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nynf5zz",
          "author": "pandemoniumayhem94",
          "text": "I think scaling amount just depends on business and the people involved",
          "score": 1,
          "created_utc": "2026-01-09 19:17:58",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pyg6z8",
      "title": "How to start a blog",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1pyg6z8/how_to_start_a_blog/",
      "author": "hb3th",
      "created_utc": "2025-12-29 07:42:09",
      "score": 39,
      "num_comments": 49,
      "upvote_ratio": 0.97,
      "text": "I am planning to launch a startup in 2026 and want to start a blog alongside it to build organic traffic and brand trust from day one. I am completely new to blogging and content marketing.\n\nWhat should I focus on first in 2026? Platform choice, content strategy, SEO, or promotion? Also curious if blogging is still worth it for startups with AI content everywhere.\n\nWould appreciate advice from founders or marketers who have done this recently.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1pyg6z8/how_to_start_a_blog/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "nwievct",
          "author": "wildour",
          "text": "Start by being clear about why you want the blog. For a startup, blogging works best when it solves real problems for your target users, not when it is just company updates. Pick a niche related to your product or service and write content your ideal customer is already searching for.\n\nNext step is choosing the platform. WordPress is still the safest choice because you own your content and can scale SEO long term. Do not overthink themes or plugins at the beginning. A fast site with clean design matters more than fancy layouts.\n\nContent wise, focus on quality over volume. One helpful post per week that answers real questions will beat ten AI generated posts. Use basic SEO like proper titles, internal links, and clear structure, but write for humans first.\n\nPromotion comes last. Share posts where your audience already hangs out like Reddit, Twitter, or niche communities. Blogging still works in 2026, but only if you treat it as a long term asset, not a quick traffic hack.",
          "score": 8,
          "created_utc": "2025-12-29 07:53:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxisfnk",
              "author": "Sinatra2727",
              "text": "+1  🙌",
              "score": 1,
              "created_utc": "2026-01-03 22:39:54",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nwkev0a",
          "author": "psanilp",
          "text": "If its opinion or content based blog, easy option could be to use Substack. It is trending",
          "score": 3,
          "created_utc": "2025-12-29 16:21:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwiegos",
          "author": "piyushgoel23",
          "text": "you can create a new blogging website using wordpress, if you have proper knowledge of domains and hosting. else there are websites like Squarespace, Wix and more that is pretty easy to setup a blogging website.",
          "score": 3,
          "created_utc": "2025-12-29 07:49:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwj4kvv",
          "author": "TheGrowthMentor",
          "text": "You can start your blog on different platforms like WordPress, Beehiiv, HubSpot Content Hub, Wix etc. Depends how you envision it down the line and what you want to track. I would focus on being original, quality, research topics thoroughly. You should use SEO and AEO both to improve. There are free SEO and AEO graders if you can use. Promotion wise you could maybe start solving and learning about issues on specific subreddits from what your startup is about and grow from there - that way you get very honest feedback immediately. It's defientely worth it! I can add some great resources about this if that would be helpful? Let me know",
          "score": 3,
          "created_utc": "2025-12-29 11:49:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwjavii",
          "author": "SergeiSolod",
          "text": "Based on my experience, you should prioritize social media platforms over a traditional self-hosted blog. In 2026, the reality is that social media algorithms actively push your content to relevant audiences, whereas a standalone website often struggles to gain any traction. To be honest, SEO is largely dead for new players because the landscape is oversaturated with AI-generated content, making it nearly impossible to rank. My advice is to build your brand where the attention already is, social networks provide immediate reach and engagement, while a private blog, unfortunately, will likely be ignored by everyone but you.",
          "score": 3,
          "created_utc": "2025-12-29 12:38:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxisuaz",
              "author": "Sinatra2727",
              "text": "I thought the same!! For example, I’ll show my support on 𝕏! e.g., Articles or long posts there",
              "score": 1,
              "created_utc": "2026-01-03 22:41:54",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nwlivmx",
          "author": "FounderBrettAI",
          "text": "Start with content strategy first. I'd write 5-10 posts solving problems your target customers search for, then worry about platform and SEO optimization once you know you can consistently produce valuable content. Blogging still works but only if you're offering genuine expertise or unique POV, not just regurgitating the same AI-generated \"Top 10 Tips\" posts everyone else is publishing.",
          "score": 3,
          "created_utc": "2025-12-29 19:28:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwljbvg",
          "author": "Visible_Trade6113",
          "text": "Work on content strategy and organic SEO keywords while writing the blog posts; that would create organic traffic. Make sure you utilise all the key combinations of keywords.",
          "score": 3,
          "created_utc": "2025-12-29 19:30:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwjoa7d",
          "author": "swertato",
          "text": "Find a SEO agency or a freelancer who can help you.",
          "score": 2,
          "created_utc": "2025-12-29 14:05:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwjrzoo",
          "author": "FudgeLucky8529",
          "text": "Start by choosing one clear topic and audience, then focus on writing useful content instead of worrying about design or traffic. The hardest part is research knowing what to write and what actually matters.\n\nYou can use an AI like  Promti (promti . in) to  handle that part. It helps you research a subject deeply, analyze multiple sources, spot gaps in existing content, and structure blog posts properly. That way you’re not guessing topics you’re writing based on real questions and solid analysis, which is how blogs actually grow, and also its pretty useful for market research and helps in many ways as a start up Good search tool in my opinion",
          "score": 2,
          "created_utc": "2025-12-29 14:26:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwmisnd",
          "author": "Golden-heart-rides",
          "text": "Blogs are still super relevant these days and remain a great way for business to connect with people. There are plenty of easy to use platforms out there, with WordPress being a popular choice as needed. When thinking of content ideas and making changes as needed. When thinking of content ideas consider what your customers are asking about observe trending topics on platforms like Reddit, and always keep your actual customers in mind. It's also a good idea to review some SEO basics like using the right keywords and linking internally with your contact. Don't forget to share your blog where your audience is already hanging out and go beyond. Just the biggest social media sites. Find some niche spots to place your blog. Staying consistent with your posting schedule is really important because it helps keep your loyal readers interested. Encourages them to share your content and boost your SEO. All of these things together will help you attract new readers and grow your presence",
          "score": 2,
          "created_utc": "2025-12-29 22:24:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwmiz6x",
          "author": "mouhcine_ziane",
          "text": "Content strategy first Write about real problems in your space authentic founder insights cut through AI noise WordPress is fine, just stay consistent",
          "score": 2,
          "created_utc": "2025-12-29 22:25:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwnb25l",
          "author": "TerryusNo1965",
          "text": "a blog is great building tool for entrepreneurs. SEO would be a great start.",
          "score": 2,
          "created_utc": "2025-12-30 00:56:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwnw2un",
          "author": "FullMacaroon995",
          "text": "Blogging is still worth it in 2026, but only if you do it right.\n\nPriority order:\n\t1.\tContent strategy first\n\t•\tWrite for a very specific audience\n\t•\tShare real experience, mistakes, decisions\n\t•\tGeneric AI-style posts are useless\n\t2.\tSEO comes after\n\t•\tTarget low-volume, high-intent queries\n\t•\tFocus on updates and internal links, not hacks\n\t3.\tPlatform doesn’t matter much\n\t•\tOwn your domain (Webflow, Ghost, Next.js)\n\t•\tMedium/Substack don’t build long-term assets\n\t4.\tPromotion should be light\n\t•\tUse posts to answer questions on Reddit/X\n\t•\tParticipate, don’t spam links\n\nBottom line:\nAI content is everywhere, which makes authentic, experience-based blogs more valuable. It’s slow, but it compounds and builds real trust.",
          "score": 2,
          "created_utc": "2025-12-30 02:52:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwoswy7",
          "author": "NorthRope3703",
          "text": "When was the last time you actually read a blog?  Is this 2010?",
          "score": 2,
          "created_utc": "2025-12-30 06:27:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwrvoq0",
          "author": "brad-tot",
          "text": "The biggest problem with AI and blogging isn’t slop content- it’s the AI summary people get from search engines. When the answer they want is provided in succinct detail by AI, there’s little reason to scroll down the results to start reading blog posts. It was already a fool’s errand to blog before AI, because content ranking needs so much consistency that the front load cost of blogging without seeing returns is unsustainable. Factor in AI, though, and it’s a hopeless waste of time.",
          "score": 2,
          "created_utc": "2025-12-30 18:32:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwsbane",
          "author": "ASQ_Logic",
          "text": "Blogging can still work in 2026, but relying only on a blog is much harder now, especially with AI content flooding search.\n\nIf you’re starting from zero, I’d keep the blog simple on your startup site and focus more on sharing real problems and learnings rather than trying to “do SEO” perfectly from day one. Basic SEO matters, but distribution matters more. Most blogs fail because no one ever sees the content.\n\nHonestly, I’d strongly suggest starting a YouTube channel alongside it, or even before the blog. Video builds trust much faster, people connect with a face, and YouTube is still a massive search engine. You can always repurpose videos into blog posts, social content, and emails later.\n\nIn 2026, blogs are better for authority and long-term search, while video is better for visibility and trust. Using both together is a much stronger play than blogging alone.",
          "score": 2,
          "created_utc": "2025-12-30 19:46:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwt4kup",
          "author": "merthopia",
          "text": "Stay away from new and trending options. WordPress is the best. The first 10 articles don’t necessarily need to be the best blog posts; after that, focus only on high-quality content.",
          "score": 2,
          "created_utc": "2025-12-30 22:05:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwur1ww",
          "author": "Standard_Effective10",
          "text": "I am building on an idea to make blogging easy. Ping me to check out our MVP. I am sure you will love it",
          "score": 2,
          "created_utc": "2025-12-31 03:31:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwuti71",
          "author": "Mr_Hariharan",
          "text": "Follow your curiosity, but focus on one thing at a time. Learn from mistakes and feedback. Prioritize progress over perfection. adapt, and improve in your own way. Best of luck on your journey 🙌💯",
          "score": 2,
          "created_utc": "2025-12-31 03:46:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwwzrqg",
          "author": "Difficult-Ask9412",
          "text": "One thing of starting is just start the rest of it, youll find on the way",
          "score": 2,
          "created_utc": "2025-12-31 14:11:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwjx21l",
          "author": "Pitiful-Gur-4045",
          "text": "Personally, I use Skool for my community; there are lots of advantages, plus I have a link for a 14-day free trial.\n\n\nhttps://www.skool.com/signup?ref=85b7e4d12e0f4970b7128cdb96ed21c5",
          "score": 2,
          "created_utc": "2025-12-29 14:54:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwng66i",
              "author": "mj__1988",
              "text": "I'm not OP but I checked Skool too awhile ago and still can't figure out why/how/what to do about it. I mean it's mostly for course or teaching I honestly don't know what else",
              "score": 2,
              "created_utc": "2025-12-30 01:25:32",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nwkpwlt",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2025-12-29 17:14:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwpijt8",
          "author": "Vaibhav_codes",
          "text": "Start with clear positioning and content strategy. Blogging still works if it’s experience-driven and specific generic AI content won’t win trust or traffic.",
          "score": 1,
          "created_utc": "2025-12-30 10:20:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwvi5xa",
          "author": "TraditionalDuck5551",
          "text": "Your post helped me deal with the situation, thank you very much.",
          "score": 1,
          "created_utc": "2025-12-31 06:42:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwvuj5x",
          "author": "Extra-Attitude-9196",
          "text": "This helped me more than you know.",
          "score": 1,
          "created_utc": "2025-12-31 08:35:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx1n1sy",
          "author": "Annual-Scallion1969",
          "text": "I would prefer that you start with finding a idea for startup that is valid and is solving a pain point for a bug nom of people.  Then you have to decide how to solve the problem, in this step I would highly recommend you to use chatgpt and perplexity. Then you can do surveys, carry out questions etc. Then finally start building and scale it. And to market, you can use yt shorts, insta etc.\n\nGo for it bud 💪",
          "score": 1,
          "created_utc": "2026-01-01 06:46:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx2j0wo",
          "author": "No_shecher_5528",
          "text": "I'm coming late to this conversation and you already have great comments and suggestions. I'll just add a few tidbits. A website blog is still the top driver of traffic to your website. As a startup you need eyes on your brand and you need to establish trust between you and your target consumers. So a blog is definitely worth the effort. Also, your blog article gives you tons of repurposing opportunities and when you're running solo or with a small team, you want to repurporse as much as possible. Much success!",
          "score": 1,
          "created_utc": "2026-01-01 12:17:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx8o7n7",
          "author": "Extension_Bet_7101",
          "text": "Blogs are one of the best things which can help you with the SEO. You can check my company’s website, there you will see blogs but all the blog posts are having different UI, that’s the game changer. The posts need to be interactive, not just a common file changing images and texts. For reference and idea you can have a look at \n\nhttps://www.vesperontech.com/blog",
          "score": 1,
          "created_utc": "2026-01-02 12:00:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx95syn",
          "author": "isaaclhy13",
          "text": "What's your target audience and top 3 problems they care about? I'm a founder too and struggled with starting content from zero, clueless about traction; took me months to find a rhythm. Try focusing on niche, problem-first posts that answer specific questions so SEO and trust build naturally, and document the founder journey to create unique, reusable content that feeds newsletters and social. I built SignalScouter to find Reddit threads where users ask for solutions and generate founder-style replies, which helped get 89 signups in 2 days and 10k+ views; would love feedback or to connect if you try it, it could help jumpstart organic traffic from day one. Good luck!",
          "score": 1,
          "created_utc": "2026-01-02 14:01:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxaa2rm",
          "author": "Ok_Persimmon_8888",
          "text": "Definitely use substack",
          "score": 1,
          "created_utc": "2026-01-02 17:23:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxbnp7j",
          "author": "BlockGuardApp",
          "text": "You will need to have a presence on all the social media platforms. It's a lot for one person to manage, but it can be done. You just have to do one thing at a time. Baby steps.",
          "score": 1,
          "created_utc": "2026-01-02 21:18:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxbtrm4",
          "author": "Fearless_Stable6765",
          "text": ">",
          "score": 1,
          "created_utc": "2026-01-02 21:47:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxismxt",
          "author": "Sinatra2727",
          "text": "I’ll 1,000% show support if it’s all done on 𝕏!!  Lol…",
          "score": 1,
          "created_utc": "2026-01-03 22:40:53",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1q3iq3c",
      "title": "What are you building in 2026? How’s the progress so far?",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1q3iq3c/what_are_you_building_in_2026_hows_the_progress/",
      "author": "allen18walker",
      "created_utc": "2026-01-04 06:31:03",
      "score": 25,
      "num_comments": 97,
      "upvote_ratio": 0.97,
      "text": "Hey everyone, curious what apps you're working on right now. I might be down to collaborate with founders building interesting products.\n\nAs we kick off 2026, I'm looking to work with founders who want early traction and want to move fast this year. What I do is pretty simple: I help founders grow using proven sales funnels and platform-specific playbooks.\n\nWe share ready-to-use funnel frameworks and custom tools for TikTok, X, Reddit, LinkedIn, and other platforms, each tailored to your app's niche.\n\nIn 2026, we're actively building and testing multiple funnels every week with real products in real markets. The goal is to help founders get clearer on distribution, acquire users more predictably, and validate faster.\n\nYou could run everything yourself, but this saves time, removes guesswork, and gives you a clearer path to traction.\n\nDrop a comment or DM",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1q3iq3c/what_are_you_building_in_2026_hows_the_progress/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "nxl9ckf",
          "author": "unalayta",
          "text": "Building Callnfy - AI phone receptionist for small businesses. Answers calls 24/7, books appointments, captures leads.\n\nJust launched, now working on early traction. Tested Reddit this week, mixed results 😅\n\nWould love to hear what's working for similar B2B SaaS products. Open to chat!",
          "score": 3,
          "created_utc": "2026-01-04 07:44:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxlczpd",
              "author": "allen18walker",
              "text": "Nice. for early traction, it usually helps to get very clear on one use case and one channel, then double down fast. Check DM.",
              "score": 2,
              "created_utc": "2026-01-04 08:17:15",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "nyhfweh",
              "author": "Dizzy-Airport-1291",
              "text": "Interesting project",
              "score": 2,
              "created_utc": "2026-01-08 22:14:45",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nxl9kn6",
          "author": "valvze",
          "text": "http://neobloc.org\n\nMy uni club needed a way to distribute student made learning resources to our members (I'm in a medical degree). On top of that, I've been making all my learning materials with AI for the past couple of years so Neobloc combines these two purposes.\n\nIn short, you can turn your notes and PDFs into several different learning forms like flashcards and quizzes and share them with other people. On top of that, you can quickly transform one pre-existing resource (say a quiz) into flashcards.\n\nJust waiting for people to come back from the holidays so I can start amassing a user base :))",
          "score": 2,
          "created_utc": "2026-01-04 07:46:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxlchcu",
              "author": "allen18walker",
              "text": "I sent you a message",
              "score": 1,
              "created_utc": "2026-01-04 08:12:37",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "ny8lx2o",
              "author": "SnooMachines8911",
              "text": "This is GOLD!",
              "score": 1,
              "created_utc": "2026-01-07 17:54:45",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nykbde8",
                  "author": "valvze",
                  "text": "Glad you like it!",
                  "score": 1,
                  "created_utc": "2026-01-09 08:41:42",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nxm4h0b",
          "author": "jundymek",
          "text": "I'm building **FakerFill**, an extension that makes form testing fast instead of painful.\n\n[https://www.fakerfill.com](https://www.fakerfill.com)",
          "score": 2,
          "created_utc": "2026-01-04 12:20:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxlk50k",
          "author": "greyzor7",
          "text": "Building an all-in-one pack for founders who want more than \"just another launch\"\n\nLaunch, reach 30k+ makers, get users & customers - [microlaunch.net/premium](http://microlaunch.net/premium)\n\nLifetime, auto-distribution, marketplace spots, 600+ customers so far.",
          "score": 1,
          "created_utc": "2026-01-04 09:22:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxlt9ol",
          "author": "rishabh9012",
          "text": "Building Vetra: AI Health Companion that lets you ask questions like - \"Should you train hard today?\", \"What’s the best workout for me today?\" etc just like chat gpt but with all your health data. It also shows all whoop like metrics like recovery score, training load score etc.   \nUpcoming: Real Human personal trainer coaching that also has all your data and will use ai to make more personalised plan for you much faster.  \n[https://apps.apple.com/ae/app/vetra-ai-health-companion/id6754910101](https://apps.apple.com/ae/app/vetra-ai-health-companion/id6754910101)",
          "score": 1,
          "created_utc": "2026-01-04 10:44:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxlve3b",
          "author": "Mean_History_9196",
          "text": "Building fintech startup specialising in algo trading. Now stuck at the part of getting clients..any1 here want to know more details, can share. POC done with verified pnl.",
          "score": 1,
          "created_utc": "2026-01-04 11:03:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxm7ecl",
          "author": "Kejbs",
          "text": "[Huddlekit](https://huddlekit.com) — Collect visual feedback on websites and creative assets",
          "score": 1,
          "created_utc": "2026-01-04 12:43:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxmb4rs",
              "author": "allen18walker",
              "text": "I sent you a message",
              "score": 1,
              "created_utc": "2026-01-04 13:09:39",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nxmmsvg",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-04 14:21:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxmo6yu",
              "author": "allen18walker",
              "text": "This is awesome. anyways, I sent you a message.",
              "score": 1,
              "created_utc": "2026-01-04 14:29:19",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nxmz6mq",
          "author": "Alert-Warthog7255",
          "text": "I’m building GitaPath — a small Android & iOS app inspired by the Bhagavad Gita, but focused on practical daily use, not philosophy.\n\nThe idea is simple: one verse → one short reflection → one small action you can actually do that day.\n\nI built it after struggling with overthinking and mental noise, and realizing most spiritual apps felt either too heavy or too abstract.\n\nCurrent stage:\n• App is live on Android & iOS\n• Early organic traction via Reddit & X\n• Still figuring out distribution without ads or big budget\n\nWould love feedback from anyone interested in wellness / mindfulness / spirituality as product niches.\n\n📱 Android:\nhttps://play.google.com/store/apps/details?id=com.geeta.geeta_app&pcampaignid=web_share\n\n🍎 iOS:\nhttps://apps.apple.com/in/app/gitapath-verse-wisdom/id6754448724",
          "score": 1,
          "created_utc": "2026-01-04 15:28:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxnjnx4",
          "author": "jellyturtsy",
          "text": "I've been working on AuthorityBacklinker (DOT com) as a way to automate getting backlinks from journalists (HARO links) at a flat monthly cost. Agencies are charging like $800 each for these links but my tool uses AI to identify relevant journalist queries, write your response and pitch it to them for only $249/mo. And I guarantee three links each month. Been getting a pretty good success rate in landing backlinks for early clients. Haven't really done much to promote it yet, but early feedback is promising. I had a few people asking for access to the backend so they can DIY it for a cheaper fee but I'm not confident enough in my code to do that. Plus I feel like my pricing is still a good deal compared to what digital PR agencies charge per link. Right now all they get access to is the user dashboard and everything else is done on the backend where they can't see the nuts and bolts.",
          "score": 1,
          "created_utc": "2026-01-04 17:04:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxp28hn",
          "author": "Efficient_Let216",
          "text": "Socials, in-person events (mostly for singles), astrology- all packed in one. \n\nhttps://zelo.chat\n\nThe app is in production and fully usable. Adding new features soon! The critical part was getting it from POC to a usable product and I’m super excited!!",
          "score": 1,
          "created_utc": "2026-01-04 21:10:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxrfm3i",
              "author": "allen18walker",
              "text": "I sent you a message",
              "score": 2,
              "created_utc": "2026-01-05 04:28:20",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nxpfket",
          "author": "Lip_Muse_Vip",
          "text": "I’m building a tiny B2B tool for agencies, basically to stop repeating the same reporting and client update stuff. Progress is slow but real, I’ve got a usable MVP and 2 people testing it.",
          "score": 1,
          "created_utc": "2026-01-04 22:12:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxrevhl",
              "author": "allen18walker",
              "text": "I sent you a message",
              "score": 1,
              "created_utc": "2026-01-05 04:24:20",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nxpnjft",
          "author": "Money_Mind_3365",
          "text": "I have a question. I can talk about the project I'm currently working on, but I'm a bit confused because it requires me to provide services.",
          "score": 1,
          "created_utc": "2026-01-04 22:49:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxre1oe",
              "author": "allen18walker",
              "text": "I sent you a message",
              "score": 1,
              "created_utc": "2026-01-05 04:19:24",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nxpx2rb",
          "author": "BalakrishnaGoudS",
          "text": "Kinetic Harmony – A Movement-Responsive Sound Tool\n\nI’d like to share a web-based experimental tool called Kinetic Harmony that explores the relationship between movement, sensory feedback, and sound.\n\nThe app translates gentle phone movement (wobbling, slow shifts, intentional motion) or touch input into music in real time. It is designed to support:\n\nGrounding and present-moment awareness\n\nMind–body connection\n\nSensory regulation through non-verbal interaction\n\nLow-pressure creative expression\n\nThe tool may be useful as a supplementary aid in mindfulness practices, somatic awareness exercises, or stress-reduction routines, rather than as a clinical intervention.\n\nYou can access the web app here:\nhttps://kinetic-harmony.vercel.app\n\nShort demonstration video:\nhttps://youtube.com/shorts/jkQhrHy7R98\n\nFeedback from professionals working in therapy, counseling, mindfulness, or rehabilitation contexts would be very welcome.",
          "score": 1,
          "created_utc": "2026-01-04 23:37:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxrduy9",
              "author": "allen18walker",
              "text": "I sent you a message",
              "score": 1,
              "created_utc": "2026-01-05 04:18:21",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nxq0djr",
          "author": "ApprehensiveTry4850",
          "text": "I’m building Eternis, a healthcare app designed to help address Canada’s doctor shortage.",
          "score": 1,
          "created_utc": "2026-01-04 23:53:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxrdokn",
              "author": "allen18walker",
              "text": "I sent you a message",
              "score": 1,
              "created_utc": "2026-01-05 04:17:17",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nxq5w7y",
          "author": "Pitiful-Ear4595",
          "text": "Building frunka - an App Only grocery store based in Dublin. We do free home delivery, scheduled delivery slots and our moq is way less than market. \nMy problem is I think I have a killer product that solves the problem of convenience, but I’m not getting the traction. Primarily because my catalog is very small in my opinion. I’m still figuring out. The journey is hard but worth it",
          "score": 1,
          "created_utc": "2026-01-05 00:20:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxrdikl",
              "author": "allen18walker",
              "text": "I sent you a message",
              "score": 1,
              "created_utc": "2026-01-05 04:16:15",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nxqd53e",
          "author": "immerzyve",
          "text": "Reducing $100K worth guesswork for newhomebuyers.",
          "score": 1,
          "created_utc": "2026-01-05 00:56:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxrd507",
              "author": "allen18walker",
              "text": "I sent you a message",
              "score": 1,
              "created_utc": "2026-01-05 04:14:00",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nxqnc0k",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-05 01:51:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxrctr6",
              "author": "allen18walker",
              "text": "I sent you a message",
              "score": 1,
              "created_utc": "2026-01-05 04:12:11",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nxr4vqf",
          "author": "Constant_Marketing18",
          "text": "Helping to founders to increase their digital visibility.\n\n  \n[https://coolwebtool.com/](https://coolwebtool.com/)",
          "score": 1,
          "created_utc": "2026-01-05 03:26:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxra6co",
          "author": "thinking_byte",
          "text": "We are building a pretty unsexy B2B product focused on operational pain that kept interrupting founders on our team. Progress has been steady but slower than we wanted because we are ruthless about not adding features unless they remove real day to day friction. Right now the focus is getting a small set of users to rely on it weekly before worrying about growth. Collaboration wise, I am usually cautious early on, clarity on the problem matters more than funnels at this stage for us.",
          "score": 1,
          "created_utc": "2026-01-05 03:56:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxrcdz4",
              "author": "allen18walker",
              "text": "I sent you a message",
              "score": 1,
              "created_utc": "2026-01-05 04:09:32",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nxrbdwe",
          "author": "Glass_Effective5147",
          "text": "memore.live- Couple's private space\n\nPublished it to playstore, ios pending",
          "score": 1,
          "created_utc": "2026-01-05 04:03:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxrccmx",
              "author": "allen18walker",
              "text": "I sent you a message",
              "score": 1,
              "created_utc": "2026-01-05 04:09:19",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nxsh1yy",
          "author": "oletrn",
          "text": "[TeamScribe.io](http://teamscribe.io/) – confidentiality-first feedback tool & morale tracker for teams (web app and Slack app).",
          "score": 1,
          "created_utc": "2026-01-05 09:32:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxshdy9",
              "author": "allen18walker",
              "text": "Let's collab. check DM.",
              "score": 1,
              "created_utc": "2026-01-05 09:35:38",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nxsvi96",
          "author": "PsychoticRaven",
          "text": "[https://janus.cam](https://janus.cam)\n\nWe're building a face swap tool for streamers to turn their webcam into any character they'd like. It's a bit like vtubing, but without any rigging, setup, 3D models. Just started looking into how we can get some traffic and reach the correct audience.",
          "score": 1,
          "created_utc": "2026-01-05 11:39:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxszffs",
              "author": "allen18walker",
              "text": "Hi, I sent you a message",
              "score": 1,
              "created_utc": "2026-01-05 12:10:18",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nxswa94",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-05 11:46:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxszfd1",
              "author": "allen18walker",
              "text": "Hi, I sent you a message",
              "score": 1,
              "created_utc": "2026-01-05 12:10:17",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nxveeey",
          "author": "harshXgrowth",
          "text": "Building Alloe - AI that screens prospects before they hit your calendar. Think of it as a qualification layer before the discovery call.\n\nWe’re live, talking to early users, and iterating fast. Distribution is exactly what we’re figuring out right now.\n\nWould love to swap notes if you’re working with B2B or creator-focused tools.",
          "score": 1,
          "created_utc": "2026-01-05 19:33:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxxrmp0",
              "author": "allen18walker",
              "text": "Hi, I sent you a message",
              "score": 1,
              "created_utc": "2026-01-06 02:40:00",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nxw8m4n",
          "author": "ConstantinoTheGreat",
          "text": "https://www.AIREBroker.casa",
          "score": 1,
          "created_utc": "2026-01-05 21:53:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxwdhn8",
          "author": "Horror-Coyote-7596",
          "text": "I'm building a AI agent for quick data visualization. It turns data into short video ready to share. It's called Play Graph AI (https://playgraph.ai), launching soon",
          "score": 1,
          "created_utc": "2026-01-05 22:16:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxxrm23",
              "author": "allen18walker",
              "text": "Hi, I sent you a message",
              "score": 1,
              "created_utc": "2026-01-06 02:39:54",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nxxwd2g",
          "author": "OtherwiseTwo8053",
          "text": "Building SignalCast — turns 10 hours of podcasts into a 10-minute weekly digest. AI extracts key insights, delivered every Monday.\n\nFree tier available (3 shows), just launched the beta. Would love feedback from fellow builders.\n\n[https://www.signalcast.app](https://www.signalcast.app/)",
          "score": 1,
          "created_utc": "2026-01-06 03:06:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxyoa1i",
          "author": "Either-Lie-7519",
          "text": "[Readme Adsense](https://www.readme-adsense.com)\n\nIt’s a way for developers to generate revenue on their open source work or node packages",
          "score": 1,
          "created_utc": "2026-01-06 06:09:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxypijk",
              "author": "allen18walker",
              "text": "Hi, I sent you a message",
              "score": 1,
              "created_utc": "2026-01-06 06:19:52",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nxzhxac",
          "author": "mihaihov",
          "text": "Building a very simple time-tracking system based on QR scanning for small businesses.",
          "score": 1,
          "created_utc": "2026-01-06 10:40:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxzoyr0",
              "author": "allen18walker",
              "text": "Hi, I sent you a message",
              "score": 1,
              "created_utc": "2026-01-06 11:40:14",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nxzmxhl",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-06 11:23:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxzosoj",
              "author": "allen18walker",
              "text": "Hi, I sent you a message",
              "score": 1,
              "created_utc": "2026-01-06 11:38:54",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "ny0yr43",
          "author": "Saliqnaqash",
          "text": "Al-powered customer support. Handles customer chats + voice calls.",
          "score": 1,
          "created_utc": "2026-01-06 16:01:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "ny1s8bo",
          "author": "Candid-Reference1042",
          "text": "billyug.com is a free invoicing tool that supports GST and non-GST invoices.",
          "score": 1,
          "created_utc": "2026-01-06 18:14:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "ny55xb1",
          "author": "Far-Use-7622",
          "text": "Built ScorePaper, a lightweight scorekeeping app for card and board games.\nAlso building an AI-powered nutrition and calorie tracker with additional health features in progress.\nScorePaper is live; 2026 focus is steady growth and distribution.\n\nhttps://apps.apple.com/us/app/scorepaper-game-scoreboard/id6744260442",
          "score": 1,
          "created_utc": "2026-01-07 04:25:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "ny61cmw",
          "author": "oficeal",
          "text": "Spotlight - A skill discovery platform where you share your thinking, learning, and real work through short videos and audio - learn from others, get feedback, and stand out naturally.\n\n\nBuilding from Mumbai, currently in prototype stage using Replit for a quick MVP. And early validation.",
          "score": 1,
          "created_utc": "2026-01-07 08:33:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "ny83ejb",
          "author": "illseeutmrw",
          "text": "Currently building an AI compliance tool for smaller startups who have no clue what they’re doing and guiding them faster and cheaper than a human can.",
          "score": 1,
          "created_utc": "2026-01-07 16:31:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "ny9jti4",
              "author": "allen18walker",
              "text": "check DM",
              "score": 1,
              "created_utc": "2026-01-07 20:22:24",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "ny83f6t",
          "author": "Feathered-Beast",
          "text": "Building an open-source, local-first AI agent workflow automation platform that lets you design, connect, and run intelligent agents without relying on the cloud.\nProgress is sold from my point of view and as solo developer \n\nGithub:- https://github.com/vmDeshpande/ai-agent-automation\n\nWebsite:- https://vmdeshpande.github.io/ai-automation-platform-website/",
          "score": 1,
          "created_utc": "2026-01-07 16:31:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "ny9jt3s",
              "author": "allen18walker",
              "text": "check DM",
              "score": 1,
              "created_utc": "2026-01-07 20:22:21",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "ny8l80f",
          "author": "NcertInfamous3130",
          "text": "[Debriev](https://debriev.com.com) call quality monitoring software for call centers. I’m wondering where do you think finding first traction?",
          "score": 1,
          "created_utc": "2026-01-07 17:51:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "ny9jsk2",
              "author": "allen18walker",
              "text": "check DM",
              "score": 1,
              "created_utc": "2026-01-07 20:22:17",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nybambd",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-08 01:16:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "nyctjab",
              "author": "allen18walker",
              "text": "Hi, I sent you a message",
              "score": 1,
              "created_utc": "2026-01-08 06:48:32",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nyd83r7",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-08 08:56:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "nydg3dh",
              "author": "allen18walker",
              "text": "Hi, check DM.",
              "score": 1,
              "created_utc": "2026-01-08 10:09:24",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nydhuio",
          "author": "Confident-Mango-6414",
          "text": "[https://yippa.io/alias-bot/](https://yippa.io/alias-bot/)\n\nSimple Slack app to replace long mentions in channels with channel-specific aliases (!reviewers, !oncall).",
          "score": 1,
          "created_utc": "2026-01-08 10:24:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "nyeqnhr",
              "author": "allen18walker",
              "text": "Hi, I sent you a message",
              "score": 1,
              "created_utc": "2026-01-08 15:06:54",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nye1jaw",
          "author": "Master_Armadillo7872",
          "text": "I’m building [Taskosaur.com](http://Taskosaur.com) for the \"independent\" crowd who are tired of expensive per-seat SaaS fees. It’s a self-hosted PM tool that lets you bring your own LLM API keys (OpenAI, Anthropic, or even local models like Ollama) to keep your data private and costs low",
          "score": 1,
          "created_utc": "2026-01-08 12:53:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxldfg0",
          "author": "isaaclhy13",
          "text": "Which platforms are you prioritizing for funnel tests right now? I'm a founder too and ran into the same distribution fog where you know the idea but not where the users live. Try focusing on one platform with a tight playbook to reduce variables, that helps speed up learning, and run tiny weekly funnel experiments to get real signal fast so you can iterate. I built SignalScouter which finds Reddit keyword leads and drafts tailored replies to promote your app, it helps make distribution way clearer and got 89 signups in 2 days and 10k+ post views; would love feedback or to connect if you try it, could help you validate faster. Good luck.",
          "score": 1,
          "created_utc": "2026-01-04 08:21:10",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1q83853",
      "title": "What are you building this year 2026? Promote it here",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1q83853/what_are_you_building_this_year_2026_promote_it/",
      "author": "allen18walker",
      "created_utc": "2026-01-09 08:48:32",
      "score": 24,
      "num_comments": 94,
      "upvote_ratio": 0.93,
      "text": "We're offering one free viral TikTok for startups that want to test demand and get visibility.\n\nEvery startup can get 1 free viral TikTok video made by our editor team. It features your product or business and is posted to our socials. There's no cost, and it usually takes about 7 days to receive and approve the video. Limit is one free video per startup, and nothing goes live without your approval.\n\nYou can use it to promote waitlists, MVP apps, pre orders, mature products, discounts, coupons, or even follow for follow.\n\nAll you need to do is tell us about your startup. You'll get an email letting you know if you're approved. We approve 95% of applications that are completed from start to finish.\n\nHere's the link with full details and access:\nhttps://zoomgtm.fillout.com/catalog-free-tiktok?sid=Isiah\n\nInside the link, there are also short Playbook videos that break down how we think about traction and distribution, so even if you just want to learn, it's useful.",
      "is_original_content": false,
      "link_flair_text": "services",
      "permalink": "https://reddit.com/r/startup/comments/1q83853/what_are_you_building_this_year_2026_promote_it/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "nykinaq",
          "author": "amacg",
          "text": "Built a community where makers can share what they’re building and get fair visibility. Here's the link: [https://trylaunch.ai](https://trylaunch.ai/)",
          "score": 5,
          "created_utc": "2026-01-09 09:48:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nykeqal",
          "author": "Ecliphon",
          "text": "And by viral you mean, you’ll use bots to make thousands of fake views?\n\nThis is posted on your own account, right?",
          "score": 2,
          "created_utc": "2026-01-09 09:12:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nykkrh1",
          "author": "EndGroundbreaking763",
          "text": "Hey everyone,\n\nI built something and I'd love your honest take on it.\n\n[https://everyathlete.lovable.app](https://everyathlete.lovable.app)\n\nA platform that will push people to watch less pro and play more amateur sports.\n\nLet's be real - running a 1:59 marathon is impressive, but less so when you realize the guy doesn't have a job, doesn't go to school, doesn't take kids to practice, and has a full support team optimizing his every meal and nap. Same goes for that KOM on a Tour de France climb - those riders aren't juggling university exams, 9-to-5s, or family dinners.\n\nThat's not to say competing is useless - it's just important to know with whom you're competing. This platform should enable you to compete locally, with friends, or with yourself. As much or as little as you want - as long as you just go out and do some sport, any sport.\n\nI have a background in finance and this is just a side project, so sorry in advance if the demo isn't working perfectly - I just vibe coded it over the last couple of days. If you like this, please join the waitlist and share it with a friend. The number of signups will help me decide if this is worth building further.\n\nFeedback, ideas, brutal honesty - all welcome. Reach out anytime.\n\nP.S. Contrary to Strava, I will aim to make the vast majority (if not all) of features not hidden behind a paywall.",
          "score": 2,
          "created_utc": "2026-01-09 10:08:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "nykpond",
              "author": "n1cepat",
              "text": "Some quick feedback: \n„Results are Not Impressive“ doesn’t resonate with me, if so, then why should I submit my results on the page/product?\nThe „life circumstances factors“ seem arbitrary. A bit like „sugarcoating“ why my results are not comparable to professional athletes.\nWhat would be interesting: how do my results compare to the average X years old male/female in my country/worldwide? What are steps to improve myself, potentially taking into account my life circumstances? \n+ the scrolling effect (at least on mobile) is rather annoying",
              "score": 1,
              "created_utc": "2026-01-09 10:51:31",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nykpu4j",
                  "author": "EndGroundbreaking763",
                  "text": "Thank you for the feedback!",
                  "score": 3,
                  "created_utc": "2026-01-09 10:52:49",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nym7sat",
              "author": "No_Review1689",
              "text": "Love the website",
              "score": 1,
              "created_utc": "2026-01-09 16:04:21",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nymmvid",
                  "author": "EndGroundbreaking763",
                  "text": "Thanks :)",
                  "score": 2,
                  "created_utc": "2026-01-09 17:11:38",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nyuljbm",
              "author": "OwnMention7025",
              "text": "How do you plan to monetize?",
              "score": 1,
              "created_utc": "2026-01-10 20:43:49",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nykkx8w",
          "author": "zawrrrs",
          "text": "Planning on building a freelancing platform but exclusively only for college students",
          "score": 2,
          "created_utc": "2026-01-09 10:09:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nylap3i",
          "author": "MentalWorry69",
          "text": "Hi everyone\nI wanted to share something real\n\nA few months ago two of us started working on a small homegrown fragrance brand because we could not find skin friendly honest body mists that actually lasted Most options we tried were either too alcohol heavy or felt rushed\n\nSo we built House of TBH\n\nOur mists are aloe based use only the necessary 20 percent alcohol and are made to be used on both skin and hair They are soft not sharp and meant for everyday wear Longevity is around 2 to 3 hours and we are very transparent about that\n\nAll our mists come in glass bottles and our 100ml size is priced at just 399 because we wanted to keep it accessible without cutting corners on quality\n\nWe also create inspired perfume dupes with around 20 to 30 percent oil concentration for people who want stronger performance at reasonable prices\n\nOver the last month we have received more than 10 orders directly after posting on Reddit and that support genuinely meant a lot to us\n\nCurrent fragrances we have built\nDark Roast coffee and chocolate cozy and deep\nTender Vanilla vanilla and coconut soft and comforting\nBlue Meadows fresh airy everyday clean\nCoral Reefs citrusy and bright\nTropical Rush orange forward energetic\n\nWe are still learning improving and building slowly If you enjoy trying indie brands or simply want to share honest feedback I would genuinely love to hear your thoughts\n\nHappy to answer any questions\nThanks for reading",
          "score": 2,
          "created_utc": "2026-01-09 13:21:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "nyul7jy",
              "author": "OwnMention7025",
              "text": "can we have url?",
              "score": 1,
              "created_utc": "2026-01-10 20:42:11",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nyvo77q",
                  "author": "MentalWorry69",
                  "text": "https://houseoftbh.shop",
                  "score": 2,
                  "created_utc": "2026-01-11 00:00:27",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nyli5rs",
          "author": "Interesting-Dig-4033",
          "text": "To be quick it’s EdTech, check it out thanks [StandUp](https://standuplearn.com)",
          "score": 2,
          "created_utc": "2026-01-09 14:01:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "nyulnbw",
              "author": "OwnMention7025",
              "text": "How do you plan to monetize?",
              "score": 1,
              "created_utc": "2026-01-10 20:44:23",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nyumzq9",
                  "author": "Interesting-Dig-4033",
                  "text": "I have a subscription plan $12 month for teachers to be able to make more then one class and unlimited ai use. I created demo classes so you can get a feel for it",
                  "score": 2,
                  "created_utc": "2026-01-10 20:51:04",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nynwix2",
          "author": "thenuka_karindra",
          "text": "We are just build a AI POS SYSTEM , this system can work like a real person , if anyone is interested in this please let me know 😎",
          "score": 2,
          "created_utc": "2026-01-09 20:37:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "nypnm4l",
              "author": "Accomplished_Self890",
              "text": "Interesting, tell me more!",
              "score": 1,
              "created_utc": "2026-01-10 01:58:13",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nyrmcdy",
                  "author": "thenuka_karindra",
                  "text": "What kind of details do you wanna know ? 🤔",
                  "score": 1,
                  "created_utc": "2026-01-10 10:47:43",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nyula5n",
              "author": "OwnMention7025",
              "text": "can we have url?",
              "score": 1,
              "created_utc": "2026-01-10 20:42:32",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nyrh8hf",
          "author": "Hella789",
          "text": "me and my cofounder have been working on this for over a year now because we were just tired of the car repair industry being such a black box. we had zero software background and spent months debugging protocols in freezing cars to build skanyx (skan-Yx). unlike basic scanners that just give you a code you have to google, this actually explains what's wrong in plain english and gives you an estimate of what the fix should cost before you even talk to a mechanic. it analyzes live sensor data and vital signs while you drive to catch failures before they even trigger a warning light. the coolest part we built is the dynamic ppi which load-tests the engine during idle, cruise, and wide-open throttle to see if a seller is hiding something. it can even predict what's likely to fail soon based on your specific engine and mileage so you don't get stranded. launching the hardware in q2 2026 if you wanna check it out at https://skanyx.com",
          "score": 2,
          "created_utc": "2026-01-10 10:01:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nyt7wuh",
          "author": "Padmaraga",
          "text": "I'm building a firm to provide legal and paralegal services to ship owners and shipping companies.",
          "score": 2,
          "created_utc": "2026-01-10 16:45:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "nyuouwn",
              "author": "OwnMention7025",
              "text": "Nice! How is it going?",
              "score": 1,
              "created_utc": "2026-01-10 21:00:18",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nyvj0ei",
                  "author": "Padmaraga",
                  "text": "Targeting people in commercial maritime fraternity in the US who trade primarily with Asia atm.",
                  "score": 1,
                  "created_utc": "2026-01-10 23:33:01",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nytdz9c",
          "author": "No-Image-6827",
          "text": "I'm building an e-commerce for selling digital products created by content creators to their fans or anyone.  \nThe major difference is that I will be charging based on the content streamed by the user, not every time someone buys",
          "score": 2,
          "created_utc": "2026-01-10 17:14:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "nyuo3j2",
              "author": "OwnMention7025",
              "text": "Charging creators based on how much their content is actually streamed rather than per purchase is a concrete shift from the usual digital storefront model. The subtle risk is that usage-based pricing moves the anxiety from fans to creators, since heavy engagement can start to feel like a cost center instead of a win if the value narrative is not clear. It also creates an incentive tension where creators may optimize for shorter or gated content to control costs, which can affect fan trust over time. Metering and reporting accuracy becomes part of the core product, not just infrastructure, because disputes will surface fast. How are you thinking about explaining usage costs to creators so high engagement feels aligned with their upside rather than something to manage defensively?",
              "score": 1,
              "created_utc": "2026-01-10 20:56:32",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nyxexyr",
                  "author": "No-Image-6827",
                  "text": "I guess the streaming cost is not significant for high-value content, like if a 10gb material is sold at 100 dollars, then streaming cost is approximately 0.2 per gb max, so even if a user streams the whole content 10 times, it will be 20 dollars, and on an average, it is very unlikely that every user will stream the whole content. And we can flag some users if they are streaming too much or from different devices like that.\n\nMy main goal is too give creators complete control on pricing like subscriptions or one time and features like multi screen, and other features",
                  "score": 2,
                  "created_utc": "2026-01-11 06:01:02",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nyud1k9",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 2,
          "created_utc": "2026-01-10 20:00:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "nyupeq1",
              "author": "OwnMention7025",
              "text": "The BYOK model tied to SES, especially the one-click IAM role connection and automated warm-up, directly addresses the hidden complexity most teams underestimate when they outgrow SendGrid. One tradeoff I’ve seen with infrastructure-owned tooling is that buyers often split into two groups: teams who love control and predictability, and teams who still want someone else on the hook when deliverability dips, even if costs are higher. That usually turns positioning into a question of who you are explicitly not building for, rather than who you are. In practice, early adoption tends to hinge on whether the first failure is blamed on AWS, the tool, or the team. Who has been the strongest early signal so far: teams already on SES and frustrated, or teams migrating off a managed provider for cost reasons?",
              "score": 1,
              "created_utc": "2026-01-10 21:03:01",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nyl8kbt",
          "author": "yasirhussain90",
          "text": "This year will be building an eQ",
          "score": 1,
          "created_utc": "2026-01-09 13:08:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nylu9sd",
          "author": "adictonator",
          "text": "I'm building [mudo — micro mood journal](https://mudoapp.com?utm_source=reddit&utm_medium=comment) that helps you understand your mood patterns with powerful insights. It's free, anonymous and private, as it should be. :)",
          "score": 1,
          "created_utc": "2026-01-09 15:02:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "nyum91k",
              "author": "OwnMention7025",
              "text": "The six-core mood layout paired with a five-second check-in and home screen widget shows you are optimizing hard for capture before reflection fades. That constraint usually improves consistency, though it also shapes the data since users adapt their emotions to the available buckets over time. A subtle risk is that streaks can shift motivation from awareness to completion, which may skew honesty if someone logs just to keep the chain alive. Privacy-first local storage lowers trust friction, but it also limits cross-user learning that could strengthen insights later. How are you thinking about deepening insight quality over time without increasing logging effort or breaking the lightweight habit?",
              "score": 1,
              "created_utc": "2026-01-10 20:47:23",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nyluwvu",
          "author": "adamsanzar",
          "text": "I kept voice notes I never listened to again. This app turns **hands-free voice notes into usable text**. Ideal for capturing thoughts while walking or driving *without touching your phone*. [https://side-note.xyz/](https://side-note.xyz/)",
          "score": 1,
          "created_utc": "2026-01-09 15:05:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nym9b1x",
          "author": "missEves",
          "text": "[playmix.ai](https://playmix.ai/) \\- vibe create games 🎮",
          "score": 1,
          "created_utc": "2026-01-09 16:11:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nym9bzg",
          "author": "missEves",
          "text": "[playmix](https://playmix.ai/animate) \\- create animated game sprites for any asset w/ ai 🏃‍♀️\n\n([video demo](https://www.youtube.com/watch?v=gmnlHLmgO4U))",
          "score": 1,
          "created_utc": "2026-01-09 16:11:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nymjrnf",
          "author": "Kejbs",
          "text": "[Huddlekit](https://huddlekit.com) — Collect and act on visual feedback for websites and creative assets",
          "score": 1,
          "created_utc": "2026-01-09 16:57:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nymqcgr",
          "author": "th3phantom",
          "text": "I’m building https://kontenai.net, a platform that helps business owners scale their social media and ad content with realistic AI images/videos. \n\nThe best part? No subscription needed. \n\nYou only pay for what you use. Some of our users are already getting millions of TikTok views from it which helps their businesses.",
          "score": 1,
          "created_utc": "2026-01-09 17:27:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nymwy1r",
          "author": "dren46",
          "text": "Heavyivy.com",
          "score": 1,
          "created_utc": "2026-01-09 17:57:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nyn743c",
          "author": "rishabh9012",
          "text": "Fitness wearables track everything. No one tells you what to do. So I built Vetra: Your Wearable’s AI Brain  \nApp store link: [https://apps.apple.com/ae/app/vetra-ai-health-companion/id6754910101](https://apps.apple.com/ae/app/vetra-ai-health-companion/id6754910101)",
          "score": 1,
          "created_utc": "2026-01-09 18:42:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nynei1o",
          "author": "blazedpepperoni",
          "text": "BetaBridge – https://betabridge.club\nBuilding a way for founders to connect with the right early users (not random traffic) to get real feedback, test demand, and validate ideas before scaling in 2026.",
          "score": 1,
          "created_utc": "2026-01-09 19:14:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nynqmxy",
          "author": "mrsponkie84",
          "text": "Hi everyone 👋\n\nI recently launched **Cantera Football Manager** on Google Play Store (January 1st). It’s a **compact football academy management game** aimed at players who like the *idea* of Football Manager but don’t want spreadsheets, 3-hour sessions, or a PhD in tactics.\n\nThe goal was to create something you can enjoy in **short bursts (5–20 minutes),** during a commute, a flight, or… let’s be honest, a bathroom break.\n\n# What the game focuses on\n\n* Building and managing a **youth academy**, developing players from **U14 to U20**\n* Handling **staff, facilities, and finances** (coaches, scouts, upgrades, budget decisions)\n* Competing in **youth leagues across 32 different countries**\n* A real **risk–reward system** (poor results can actually get you fired)\n* **Arcade-style drills and tryouts** to break the menu-heavy flow\n* **2D match highlights**\n* Core sim features like **transfers, injuries, scouting, and national team call-ups**\n\n# Current situation\n\nI’m a **solo developer**, and this is my **first game published on Google Play**.  \nSo far it has reached around **300 downloads in the first 9 days**. No featuring, no algorithm love, basically invisible on the store, but the users who *do* find it seem to enjoy it, with **honest 4.2★ ratings** from management sim fans.\n\nIf management games are your thing, or if you’re curious about a different take on the genre, you can find it here:  \n👉 [https://play.google.com/store/apps/details?id=com.mrsponkie84.canteramanager](https://play.google.com/store/apps/details?id=com.mrsponkie84.canteramanager)\n\nAny thoughts, critiques, or brutal honesty are more than welcome. Thanks for reading! 🙌",
          "score": 1,
          "created_utc": "2026-01-09 20:10:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nyo1kmk",
          "author": "KanekiAyato",
          "text": "Building [Episto](https://episto.vercel.app/).\n\nBecause the best app idea is the one you actually yearn to exist. Social media became \"soulless\" when they stripped away customization, so I built a place where you can choose your fonts, themes, and link your Music (Spotify/Last.fm).\n\nIt's a global social retreat for genuine connections—travel, language exchange, or just escaping the void. Launched yesterday!",
          "score": 1,
          "created_utc": "2026-01-09 21:01:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nypb5as",
          "author": "FrostingAccurate",
          "text": "While everyone’s building AI-powered cloud apps that need constant internet and monthly subscriptions, I built the opposite:\n✅ 100% Offline - Works perfectly in airplane mode (because your passport shouldn’t need WiFi)\n✅ Completely FREE - No subscription, no freemium tricks, no “upgrade to access your docs”\n✅ Your Device Only - Stored locally on your iPhone, not our servers (because we don’t have servers)\n✅ Instant Access - Zero loading time, zero cloud delays\nWho needs this?\n\t∙\t✈️ Travelers scrambling for documents at immigration\n\t∙\t🌍 Digital nomads in remote areas with spotty WiFi\n\t∙\t💼 Professionals needing quick access to contracts, invoices, receipts\n\t∙\t📸 Content creators managing business docs on the go\n\t∙\t🚨 Anyone who’s panicked when important docs won’t load\nReal scenarios where docStash saves you:\n\t∙\tBorder crossings with no internet\n\t∙\tHotel check-ins in dead zones\n\t∙\tEmergency situations needing insurance info\n\t∙\tMountain hikes with medical documents\n\t∙\tAnywhere your cloud apps say “No connection”\nWhy offline-first?\n\t∙\tNo “please check your connection” errors\n\t∙\tNo privacy concerns (your data never leaves your phone)\n\t∙\tNo monthly fees eating your travel budget\n\t∙\tJust works. Every time.\nIt’s free. No catches. I built this because I needed it. Hopefully you do too.\n[www.docstash.org](https://www.docstash.org)\nWould love your feedback!",
          "score": 1,
          "created_utc": "2026-01-10 00:49:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nyrcluz",
          "author": "unalayta",
          "text": "callnfy.com AI receptionist for small businness",
          "score": 1,
          "created_utc": "2026-01-10 09:17:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nyrkd4g",
          "author": "Raghav_rathi_27",
          "text": "Building globalytc.in\n\nHere we provide services like Bookkeeping and accounting, payroll, taxes and audit services to CPAs and businesses across USA and Canada. \n\nRight now, we are growing as an outsourcing firm need some CPA partners so that we can build and grow it more.",
          "score": 1,
          "created_utc": "2026-01-10 10:29:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nyrknev",
          "author": "bitjoin",
          "text": "indikin.online a true creator economy for creators and filmmakers 🫡",
          "score": 1,
          "created_utc": "2026-01-10 10:32:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nyskpu3",
          "author": "VladLunachev",
          "text": "AI Secretary for your phone notifications - my first product release in 2026. Runs in browser, mirrors notifications from your phone, lets you build visual workflows to decide what breaks through. Node-based: \\[Phone\\] → \\[Time bucket: 1hr\\] → \\[AI: \"Summarize like a secretary\"\\] → \\[Voice-over\\]. Or: \\[Phone\\] → \\[AI filter: \"Is this urgent?\"\\] → \\[Push alert\\]. Filters can be apps, keywords, or AI prompts. You design the logic. [https://notifcoordinator.com/](https://notifcoordinator.com/)",
          "score": 1,
          "created_utc": "2026-01-10 14:49:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nytqvxx",
          "author": "Beneficial-Ad2908",
          "text": "[FakeOut](https://fakeout.dev/) — A game where you challenge your AI recognition skills. Spot the Veo 3 fake vs real video. How good are you? No sign-up!",
          "score": 1,
          "created_utc": "2026-01-10 18:15:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nyvo8xs",
          "author": "MentalWorry69",
          "text": "https://houseoftbh.shop",
          "score": 1,
          "created_utc": "2026-01-11 00:00:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nyzyqus",
          "author": "Reinstatement_Expert",
          "text": "So.. basically I ran out of budget and stopped building websites or landing pages anymore.\nWhat I have built and am trying to sell to people who want a side hustle or content Agency-\n- A personal decision taking agent who takes dicision on the person's behalf.\n- A research agent that conducts deep research on the person's need and leverage it. \n- Access to Google's Veo 3 and Nano Bana Pro for lifetime free through a fully legal 2step system.\n\n\nValue: $2000\nPrice: $49\n\nThen after the people now have a plan and bulletproof steps to take, I will build and sell them a landing page to bring their concept into reality and upsell it to them at $99",
          "score": 1,
          "created_utc": "2026-01-11 16:55:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz14ebd",
          "author": "python55",
          "text": "Tavlo is a tool I built to **unify all your saved posts and videos from across social platforms into one clean feed**. Most of us find something great on X, LinkedIn, Instagram, YouTube, TikTok, save it with the intention of coming back, then it gets trapped in a fragmented mess, buried inside each platform’s hard-to-find Saved/Bookmarks section. Those interfaces aren’t built for revisiting, they’re annoying to navigate, so the content just sits there until you forget it exists. **Tavlo pulls all those saves into a single, user-friendly library** that’s easy to browse, search, and actually use, and it still feels **doomscroll-friendly**, just without the chaos.\n\nUsing it is simple. Install the Chrome extension, and when you’re on a post or video you want to keep, click **Save to Tavlo**. It captures the content and drops it straight into your Tavlo feed, and it can add **AI summaries and enrichment** so you can skim fast and pick the good stuff to revisit later.\n\nAs an added bonus, if you save a youtube video, you can view it on Tavlo ads-free 😉\n\nLanding page: [https://www.tavlo.ca](https://www.tavlo.ca/)\n\nChrome extension: [https://chromewebstore.google.com/detail/tavlo-save-to-your-feed/enjgpnmebahcbmkgnndjbmgceocelgpa?authuser=2](https://chromewebstore.google.com/detail/tavlo-save-to-your-feed/enjgpnmebahcbmkgnndjbmgceocelgpa?authuser=2)",
          "score": 1,
          "created_utc": "2026-01-11 20:04:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz6qhnk",
          "author": "neurocharge-rezen8",
          "text": "\nBuilding Rezen8: necklace using Electrodermal activity (EDA) and heart rate variability (HRV) + vibrations to stop freeze states early. Combating nervous system shutdowns. rezen8.uk",
          "score": 1,
          "created_utc": "2026-01-12 16:34:21",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pxot1i",
      "title": "Setting up a small business website should not feel this complicated",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1pxot1i/setting_up_a_small_business_website_should_not/",
      "author": "redblddrp",
      "created_utc": "2025-12-28 11:03:49",
      "score": 22,
      "num_comments": 27,
      "upvote_ratio": 0.79,
      "text": "I recently helped a family member launch a website for their small business and it was eye opening how many hurdles there still are for beginners.  \nThings like connecting a domain, setting up email, installing WordPress, and enabling SSL sound simple on paper but can turn into hours of trial and error. Especially if the hosting dashboard is cluttered or unclear.  \nWhat made the biggest difference was using a setup that handled most of this in one place and offered clear guidance when something broke. It saved a lot of time and frustration.  \nFor those who build or manage small business sites, what tools or features have made your life easier?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1pxot1i/setting_up_a_small_business_website_should_not/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "nwck44d",
          "author": "pavanasur",
          "text": "One thing I have noticed while working for many of the small startups, is you buy all the things from a same website or platform like domain, hosting ssl etc.\nThe more you buy from different sources the more complex it gets.\nSo the best way to move ahead is with purchasing all the things from one provider only and if anything happens you can directly connect to customer support instead of going to different websites",
          "score": 5,
          "created_utc": "2025-12-28 11:27:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwk7qbk",
              "author": "SpaceForceAwakens",
              "text": "It’s easier but you compromise quite a bit on features. \n\nNamechap’s hosting, for example, is simple, but doesn’t allow for lots of modern feature some sites will need, like running node.js for example.",
              "score": 3,
              "created_utc": "2025-12-29 15:47:45",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nww04w8",
              "author": "TightNectarine6499",
              "text": "Complex for you or your client? Not sure what the complexity is. It’s more expensive and it creates a barrier to switch when service is poor. Plus when they move to different platform they need everything to get transferred or/and archived.",
              "score": 1,
              "created_utc": "2025-12-31 09:29:10",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nwcn2ks",
          "author": "Accomplished-Moose50",
          "text": "Hosting a website is not complicated if you buy SaS. \n\n\nOtherwise, well SSL is complicated, even a basic http server can be complicated + DB + cache, maybe memcache, then a cdn. Shit is complicated and forever will be",
          "score": 4,
          "created_utc": "2025-12-28 11:54:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwhl1fu",
          "author": "autocursor",
          "text": "I’ve built a couple of my own sites and had the same realization - I didn’t need WordPress at all.\n\nThought I “had to” use it because everyone says it’s the standard. Spent hours dealing with hosting, plugins, updates, security patches.\n\nSwitched to Lovable/Netlify, GoDaddy, and the whole thing took 2 hours instead of 2 days. Domain, SSL, hosting all handled. No maintenance headaches.\n\nFor small business sites that just need basic pages and a contact form, WordPress is like buying a semi-truck when you need a bicycle.\n\nBiggest lesson: Don’t use the “professional” tool if the simple tool solves your actual problem.",
          "score": 3,
          "created_utc": "2025-12-29 04:05:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwhn5i9",
              "author": "anonperson2021",
              "text": "Exactly this. I set up static websites using github pages, I get a clutter-free website with exactly the code I want on it and nothing more. Hook up a domain, and done. Granted I know HTML, CSS and JavaScript so this works for me. WordPress is overkill, and I hate all the bloat for a simple static site.\n\nI will also add though, go in this direction only if you are sure it's a static site. The moment you need even a simple contact form, it's not a static site anymore. Thats the other side to this.",
              "score": 3,
              "created_utc": "2025-12-29 04:18:19",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nwd58ng",
          "author": "ssc456",
          "text": "I actually made https://entrynets.com for this reason. There's still some improvement to be made such as custom domain names but it's about as \"1 click\" as you can get",
          "score": 2,
          "created_utc": "2025-12-28 14:08:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwebc7a",
          "author": "Fantst1k",
          "text": "Hello everyone, I wrote a post, but it wasn't published. Does anyone know what the reason might be? I haven't been on Reddit for very long, and that post was my first post in the group. Do I need permission from the moderators or something else?",
          "score": 2,
          "created_utc": "2025-12-28 17:51:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "nww0rsd",
              "author": "TightNectarine6499",
              "text": "Ehm don’t know. Check chatgpt",
              "score": 1,
              "created_utc": "2025-12-31 09:35:20",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nwewey5",
          "author": "No_Selection6049",
          "text": "I assume something like Wix or Square space would be a good fit for this user case. \n\nPersonally I’d be inclined to hand it off to a web designer who specialises in small business though.",
          "score": 2,
          "created_utc": "2025-12-28 19:29:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwgjykv",
          "author": "Wonderful_Ad_9951",
          "text": "Will for me too I don't have a website and I don't have the cash for subscription,  I research for free ways but no results hahaha",
          "score": 1,
          "created_utc": "2025-12-29 00:31:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxfe7du",
              "author": "Cool_Classroom9272",
              "text": "what do you need",
              "score": 1,
              "created_utc": "2026-01-03 12:18:18",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nwgs90n",
          "author": "Buckwheat469",
          "text": "I did Google Cloud Run with Porkbun DNS which automatically registers SSL and has email forwarding.\n\nGCR does Docker containers, so your development is simply a docker build.\n\nEverything except Porkbun is billed through Google as well, and you can scale the instances to 0 so that you're not billed when there's no traffic. \n\nYour database can be run through Google Cloud SQL, running a Postgres database, and you can log metrics to Google metrics. You can then use BigQuery for advanced querying.\n\nUnrelated to Wordpress, I found a unique issue with executing Vertex requests with Google Cloud Run, so I had to move my service to Amazon AWS in order to improve response speed with Vertex. AWS also handles Docker, so moving my services between Google and AWS was extremely easy.",
          "score": 1,
          "created_utc": "2025-12-29 01:17:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwhool8",
          "author": "Wufi",
          "text": "Wordpress? Wait til you build real web apps...",
          "score": 1,
          "created_utc": "2025-12-29 04:28:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwi5yhx",
          "author": "Other-Image-2074",
          "text": "You make a website only once. In my experience, it is better to get a professional to do it for you on a platform like wordpress so that after the launch, you can handle the website yourself.\n\nGet professional help for design, themes, seo setup etc. Then you can handle the site yourself like adding blogs etc.",
          "score": 1,
          "created_utc": "2025-12-29 06:34:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwjar6t",
          "author": "TheGCmind",
          "text": "Zoho sites is all in one package",
          "score": 1,
          "created_utc": "2025-12-29 12:37:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwmzfzo",
          "author": "Morphius007",
          "text": "Not trying to be a jerk, but maybe hire a professional will solve this problem? \nWhat you described is basic level setups. \nA true developer doesn’t even blink at this.",
          "score": 1,
          "created_utc": "2025-12-29 23:53:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwos77n",
          "author": "FudgeLucky8529",
          "text": "It really shouldn’t be, but it feels complicated because you’re forced to make too many decisions at once domain, hosting, content, SEO, tools  without clear priorities. The reality is you only need a simple, clear site at the start that explains what you do, who it’s for, and how to contact or buy. Everything else can come later.\n\nWhat helps is reducing search overload. I use Promti (promti . in) to quickly research website setups, compare tools and approaches, see what similar businesses are doing, and cut through conflicting advice. That way you spend less time researching and more time actually launching.",
          "score": 1,
          "created_utc": "2025-12-30 06:21:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx3ny9h",
          "author": "IncubationStudio",
          "text": "Register domains separately from hosting.\n\nIs website for validation, sales funnel, ecommerce, etc?\n\nThe answer to this question determines complexity.\n\nMost small business only need a brochure/validation site, coupled with social media presence, and Google listing.",
          "score": 1,
          "created_utc": "2026-01-01 16:46:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx7quqx",
          "author": "Willing-Training1020",
          "text": "this is so real. most “simple” website setups assume a baseline of context that beginners just don’t have, so every small thing is jusy frustrating. what’s helped me is anything that reduces surface area early on —> fewer dashboards, fewer decisions, more sensible defaults. all-in-one setups where domain, email, ssl, and basic site config are handled together save people *hours*. for small businesses especially, momentum matters more than flexibility at the start.",
          "score": 1,
          "created_utc": "2026-01-02 06:53:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nweqnov",
          "author": "PensionFinancial4866",
          "text": "USE 👉 https://www.encubatorr.com — An AI-powered, all in one startup incubator that helps anyone turn an idea into a real business from scratch, step by step.",
          "score": 1,
          "created_utc": "2025-12-28 19:02:56",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1q0rer3",
      "title": "Seeking cofounders in Seattle area",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1q0rer3/seeking_cofounders_in_seattle_area/",
      "author": "Sorry-Ad3369",
      "created_utc": "2026-01-01 00:28:27",
      "score": 16,
      "num_comments": 34,
      "upvote_ratio": 1.0,
      "text": "Hi all, first thanks for reading this post. I am looking for a serious cofounder to continue the startup adventure with me.\n\nA little about me: I am already full time. I quitted my job a little over year ago with another cofounder. But after one unsuccessful pivot, my cofounder decided to leave. But I still don't want to give up yet. So here I am looking for similar minded folks!\n\nWhat I can offer as a cofounder:\n\n1. Technical skills. I was a ML scientist for Amazon and have a PhD in computational math before starting the adventure. So I have a solid foundation for coding (mostly backend). In my previous startup, me and my cofounder created two AI-based softwares from ground up and get some sales.\n2. Customer development. I am also the one who is doing all the cold outreach, customer interviews and help refine the product vision and refine the ICP\n3. Persistence and commitment. I like to invest in relationship. So if I decide to work with you, you don't have to worry I give up easily.\n4. Domain expertise in some area. Especially in education, tech, and finance (passed CFA II). So we can discuss some startup ideas in this area if you are interested. But I am open to other ideas\n\nWhat I want my cofounders to bring to the table\n\n1. Must be in Seattle area and willing to meet 3-4 times in person a week. I want to build a real relationship with my cofounders\n2. Must be already full time. Not against who is doing side hustles. Just based on my personal experience. I had tried to start a business with some one who only did the startup as a side hustle. It was a terrible mistake and invited a lot of frustrations and grudge against each other which I want to avoid again\n3. No specific preference for technical or nontechnical. But if you are non-technical, hope you are domain expert in the area that you want to start a startup in. My past year told me that founder-market fit is crucial.\n\nAgain thanks for reading and please feel free to DM me if you are interested!",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1q0rer3/seeking_cofounders_in_seattle_area/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "nx0g2hk",
          "author": "No-Scientist2460",
          "text": "Not in Seattle though, currently in New York, but let’s get in touch to exchange some ideas \nAbout me: \nPhD in progress with focus on trustworthy Gen AI \n\nExperience of building and working for startups in Edtech, fintech, health tech and e-commerce domain",
          "score": 3,
          "created_utc": "2026-01-01 01:26:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx0m9om",
              "author": "Sorry-Ad3369",
              "text": "Yep, that works! Sent you a DM!",
              "score": 2,
              "created_utc": "2026-01-01 02:06:49",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nx0xp07",
          "author": "mkarki",
          "text": "I am across the Tacoma narrows. I am currently full time solo working on my own project. Would love to discuss.",
          "score": 3,
          "created_utc": "2026-01-01 03:23:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx35cd6",
              "author": "Sorry-Ad3369",
              "text": "Great! Just DMed you!",
              "score": 1,
              "created_utc": "2026-01-01 15:03:16",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nx14py1",
          "author": "Obnoxiogeek",
          "text": "I have tech and non tech background but if you say you can handle the tech side then I can vouch that I can handle the non tech and business side \nQualifications Electrical and electronics engineer with a MBA degree(2 more quarters)! \nWould love to discuss further if you are interested \nGive I am not a local, I am from Los Angeles and I do understand how the startup dynamics works and I can adapt to it. Further I would love to discuss this proposition with you.",
          "score": 3,
          "created_utc": "2026-01-01 04:11:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx35w2m",
              "author": "Sorry-Ad3369",
              "text": "Thanks for the clarification! Love to chat more! I just DMed you :)",
              "score": 1,
              "created_utc": "2026-01-01 15:06:41",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nx15gqb",
          "author": "Mindless_Software_99",
          "text": "I'm around the Seattle area and willing to travel. I have a startup I am working on and have gotten users, but I would definitely appreciate your insights as a cofounder and moving forward with a potential business partner. If you are still available, please let me know.",
          "score": 3,
          "created_utc": "2026-01-01 04:17:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx35sar",
              "author": "Sorry-Ad3369",
              "text": "Great! Just DMed you! Love to chat more for sure",
              "score": 1,
              "created_utc": "2026-01-01 15:06:02",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nx09jfi",
          "author": "hotspotpreferences",
          "text": "Hi OP, I'm local to you but not in a position to travel/join. It would be nice to meet up, though, if you're looking to meet someone in the community.",
          "score": 2,
          "created_utc": "2026-01-01 00:44:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx0m8oy",
              "author": "Sorry-Ad3369",
              "text": "Thanks! I sent you a DM. Love to chat more",
              "score": 2,
              "created_utc": "2026-01-01 02:06:37",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nx0n3fq",
          "author": "Diligent_Drink7198",
          "text": "I'm in Seattle area and hold a PhD degree in computer science, currently a senior engineer in tech.  I'm also actively looking for a co-founder. let's have a quick chat if you are interested",
          "score": 2,
          "created_utc": "2026-01-01 02:12:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx0ntqd",
              "author": "Sorry-Ad3369",
              "text": "Awesome! Really looking forward to connect with you! Sent you a DM :)",
              "score": 1,
              "created_utc": "2026-01-01 02:16:53",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nx1484l",
          "author": "MoveOverBieber",
          "text": "Do you mean working full time on the startup? Or having a(nother) full time position?",
          "score": 2,
          "created_utc": "2026-01-01 04:08:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx35kiq",
              "author": "Sorry-Ad3369",
              "text": "I want a cofounder who is serious enough that either quit their job to pursue startup or will quit their job immediately if we decide to form a team",
              "score": 3,
              "created_utc": "2026-01-01 15:04:41",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nx1ms2j",
          "author": "HalSde",
          "text": "Im on the eastside in Kirkland, full-time on a couple legaltech products.  Would love to connect",
          "score": 2,
          "created_utc": "2026-01-01 06:43:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx35lv7",
              "author": "Sorry-Ad3369",
              "text": "Sounds good! DMed you!",
              "score": 2,
              "created_utc": "2026-01-01 15:04:55",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nx1n8w3",
          "author": "Adamintown",
          "text": "In seattle. Working on high trust training models. Can’t seem to send you a message directly.",
          "score": 2,
          "created_utc": "2026-01-01 06:48:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx359oh",
              "author": "Sorry-Ad3369",
              "text": "Interesting. Let me DM you then!",
              "score": 1,
              "created_utc": "2026-01-01 15:02:49",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nx1p4iy",
          "author": "Scurredinvest",
          "text": "Hey man. Im in Seattle- i co founded / employee number one at 3 startups that one sold for 900m, another worth 20-30m, and another worth a cool b. I tried to dm you but couldn’t for some reason. I worked for 5 vc firms as an early stage exec for their startups. I can raise money, am technical. Lets chat",
          "score": 2,
          "created_utc": "2026-01-01 07:06:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx350ua",
              "author": "Sorry-Ad3369",
              "text": "I DMed you! Thanks for reply!",
              "score": 1,
              "created_utc": "2026-01-01 15:01:18",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nx7kcq1",
          "author": "statuscode9xx",
          "text": "I’m in Seattle. Also ex-Amazon and also running a startup after my cofounder decided to leave.",
          "score": 2,
          "created_utc": "2026-01-02 05:58:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxbkxol",
              "author": "Sorry-Ad3369",
              "text": "Love to connect more! Let me DM you!",
              "score": 1,
              "created_utc": "2026-01-02 21:05:12",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nx9ebm4",
          "author": "UplersSolutions",
          "text": "We are also a startup from India (Not Seattle), and we faced similar confusion early on. At Uplers we tried different markets and use cases before realizing that our real focus is startups looking to hire tech engineers from India. Once that became clear, things started moving much faster for us. We’ve been using AI mainly to remove friction, not add complexity. AI helps us filter resumes that best match the job role, we also use AI-based interviews to help recruiters evaluate candidates early.  That said, we don’t fully rely on AI. There is always human involvement to apply judgment, context, and experience. AI helps speed things up, but humans make the final calls.\n\nFor us, clarity of problem + simple use of AI (not over-engineering it) made the biggest difference. Sharing this in case it helps someone else who’s still experimenting and feeling stuck.",
          "score": 2,
          "created_utc": "2026-01-02 14:49:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx9flf0",
          "author": "SubhanAttempt1406",
          "text": "Appreciate the honesty and clarity in how you’ve framed this especially around commitment, founder-market fit, and learning from past pivots. That alone filters for the right people.\n\nMy work sits at the intersection of education, technology, and capital structure. In addition to institutional and leadership work, I also represent and collaborate with firms that deploy capital through structured lending for viable projects typically where there’s discipline, traction, and a clear execution plan.\n\nI tend to engage thoughtfully rather than rush into ideas, but I value exactly the kind of long-term founder relationships you’re describing. Happy to exchange perspectives and see if there’s any strategic overlap",
          "score": 2,
          "created_utc": "2026-01-02 14:56:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxbk1o6",
              "author": "Sorry-Ad3369",
              "text": "Great to know! Love to chat more! I sent you a DM",
              "score": 1,
              "created_utc": "2026-01-02 21:00:51",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nxa6zfl",
          "author": "daya_donn",
          "text": "Hey, this resonates.\n\n\n\nI’m also actively looking for the right cofounder and agree it’s the hardest part — trust, persistence, pressure handling, and alignment matter more than just skill sets.\n\nQuick background: I’ve previously built a startup that received a Government of India grant and raised external capital, and I’m still operating it. Currently, I’m preparing to launch a second startup in fintech infrastructure — working prototype already built, with a clear v1/v2 roadmap and monetization plan.\n\nMy strengths are on the non-technical side: fundraising, strategy, product thinking, validation, and pitching. If it makes sense, happy to exchange notes and see if there’s any alignment or mutual value.",
          "score": 2,
          "created_utc": "2026-01-02 17:08:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxbjump",
              "author": "Sorry-Ad3369",
              "text": "Yep it is pretty hard to have all the values/goals/skillset matched. Btw where are you baed at?",
              "score": 1,
              "created_utc": "2026-01-02 20:59:54",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nxblgdu",
                  "author": "daya_donn",
                  "text": "I am based at mumbai, india.\nWould love frequent meets and brainstorming over video calls, if things aligns.",
                  "score": 1,
                  "created_utc": "2026-01-02 21:07:44",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nxct44s",
          "author": "Stock-Location-3474",
          "text": "Interesting approach 🤗",
          "score": 2,
          "created_utc": "2026-01-03 00:56:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxdeft8",
              "author": "Sorry-Ad3369",
              "text": "😅",
              "score": 1,
              "created_utc": "2026-01-03 03:00:25",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nxlom3d",
          "author": "OkBluejay3743",
          "text": "Hey, I am up for this opportunity but I am not from america🥲, but we can connect, if I can help you at some point and everything is looks good for both of us we can take this ahead, I can come there but I have budget issue🙃",
          "score": 2,
          "created_utc": "2026-01-04 10:03:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx5wh88",
          "author": "isaaclhy13",
          "text": "How far along is your MVP and which cofounder skillset are you prioritizing? I'm a founder too and struggled to find early users while juggling full time work. Try going to local founder meetups to meet committed cofounders and do targeted outreach to people who’ve commented on similar threads to gauge real interest. I built SignalScouter, it finds Reddit posts where potential users ask for solutions and replies in a founder voice, and it helped me get 89 signups in 2 days and 10k+ post views, would love any feedback or love to connect if you try it, could help with early user validation, good luck",
          "score": 1,
          "created_utc": "2026-01-01 23:42:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "ny3hx5t",
          "author": "Naus-asaurus5",
          "text": "Jumping in since this thread has turned into a solid Seattle startup convo.\n\nI’m currently out of state but planning a move to Seattle and intentionally shifting into tech, especially AI infrastructure and more technical, early-stage companies. My background is in finance and client-facing, data-driven businesses. I’m not an engineer, but I’ve spent most of my career working closely with technical teams while staying very close to customers and real operating constraints.\n\nWhat I tend to be good at is:\n\t•\tTalking to customers early and pulling out what actually matters\n\t•\tTranslating technical or abstract ideas into something clients actually understand and engage with\n\t•\tHelping technical founders shape a clear, honest story around what they’re building and why it should exist\n\t•\tEarly go-to-market work, partnerships, and turning “interesting” into something people will actually use or pay for\n\t•\tSitting in uncertainty, learning fast, and connecting dots rather than forcing a playbook\n\nI don’t come in pretending to have all the answers. I’m curious, committed, and comfortable doing the unglamorous work that helps something real take shape. I’m also very open to learning the Seattle ecosystem and meeting founders, operators, and investors along the way.\n\nIf you’re building something early and serious and think a conversation could be useful, happy to connect. I’ll be spending more time in Seattle as plans firm up.",
          "score": 1,
          "created_utc": "2026-01-06 22:59:14",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pzclr8",
      "title": "Has AI really reduced startup costs, or just shifted them elsewhere?",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1pzclr8/has_ai_really_reduced_startup_costs_or_just/",
      "author": "Worldly-Bluejay2468",
      "created_utc": "2025-12-30 08:15:49",
      "score": 15,
      "num_comments": 31,
      "upvote_ratio": 0.9,
      "text": "I’ve been thinking a lot about how AI is changing the cost structure of starting a business. In areas like e-commerce, getting something off the ground feels significantly cheaper than it used to be. A basic product or store can now be launched much faster, with far less upfront effort and fewer people involved.\n\nWhat I’m unsure about is whether the cost actually disappeared or simply moved. If development and initial setup are no longer the main barriers, it feels like the real challenges now show up elsewhere. Traffic acquisition, distribution, branding, and supply chain decisions seem to matter more than ever, and they often end up costing far more than the product itself.\n\nOnly later did I start looking into AI-driven platforms that bundle a lot of this early work together, like Genstore and similar tools. They clearly lower the technical barrier, but they also make me wonder if the playing field is now flatter than before.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1pzclr8/has_ai_really_reduced_startup_costs_or_just/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "nwp7b8q",
          "author": "AnLe90",
          "text": "Easy to startup hard to rise above the noise and user acquisition",
          "score": 7,
          "created_utc": "2025-12-30 08:36:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwz49mq",
              "author": "Gloomy_Resist_19",
              "text": "How are startups attempting to navigate this ?",
              "score": 2,
              "created_utc": "2025-12-31 20:45:51",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nx6oovv",
                  "author": "DrKenMoy",
                  "text": "Product market fit has always made or breaked startups even before ai",
                  "score": 1,
                  "created_utc": "2026-01-02 02:28:30",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwqn9mw",
          "author": "who_am_i_to_say_so",
          "text": "Hell yeah it changed things: it raised the costs of being seen. Everyone and their grandmother has a SAAS.",
          "score": 5,
          "created_utc": "2025-12-30 15:03:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxoacr8",
              "author": "DontMakeAMonkey",
              "text": "Yep AI slops, you just dream and wake up to a fully functional app.",
              "score": 2,
              "created_utc": "2026-01-04 19:03:20",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nwt7x7o",
          "author": "One_Curious_Cats",
          "text": "The playing field is flatter. Most companies are still figuring this out.  \n  \nThis window won't last. Bigger companies will catch up on the AI tooling, customers will raise their expectations, and the technical moat comes back. The head start is real though. It's just not permanent. If you're going to move, move now. :)",
          "score": 3,
          "created_utc": "2025-12-30 22:21:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwrpsde",
          "author": "SirIzaanVBritainia",
          "text": "One thing is team size. For better or worse, now a company can move with less developers.  \ndid the cost disappeat? not exactly, it moved to tools like claude code, cursor etc.. but compated to paying 100 grand to a dev and 40 dollars a month to cursor is cheap. \n\nContent Creation is also one niche I see shining after development, research costs also gone down.",
          "score": 1,
          "created_utc": "2025-12-30 18:05:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwuf8un",
          "author": "rsimmonds",
          "text": "As a founder… yeah, it’s saving a time of cost that is compounding weekly into ROI. Sometimes it’s financial gains and sometimes it’s time efficiencies..",
          "score": 1,
          "created_utc": "2025-12-31 02:20:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwv0l19",
          "author": "Jay_Builds_AI",
          "text": "It’s mostly a shift, not a reduction.\n\nAI compressed build costs and time-to-first-version, but that just exposed the real bottlenecks earlier. Distribution, trust, and differentiation were always expensive-they were just hidden behind months of engineering before. Now everyone reaches “good enough” fast, so competition moves to attention, credibility, and consistency.\n\nAI made starting cheaper. It didn’t make winning cheaper.",
          "score": 1,
          "created_utc": "2025-12-31 04:32:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwvdjaw",
          "author": "gauri_insights",
          "text": "Yes, AI has reduced the start up costs, but it has become much harder for customer acquisition. Every start up has its own AI tool and customers have a lot of choices and many different solutions to choose from.   \nSo yes, the cost has shifted to customer acquisition and marketing it rightly.",
          "score": 1,
          "created_utc": "2025-12-31 06:05:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwve7rq",
          "author": "Alternative_Yard_170",
          "text": "I spend $20/month for ChatGPT Plus and $7/month for Canva, these 2 tools help me with: \n\n1. Create most graphics on my own, without a graphic designer\n2. Create content (blogs, social media posts, articles) without needing a content writer\n3. Brainstorm/research on topics related to my work, without needing an analyst or expensive reports\n4. Do way more work, on my own, without needing a specialist\n\nSo yes, it did reduce costs for my startup by a big margin.",
          "score": 1,
          "created_utc": "2025-12-31 06:10:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwxh4p6",
          "author": "Willing-Training1020",
          "text": "i think ai has absolutely reduced *some* startup costs, but it didn’t make starting a business cheaper in a total sense—it changed where the money and effort go. building the first version, setting up ops, even doing basic design or copy is dramatically cheaper and faster now, often by an order of magnitude. but because those barriers dropped, the real constraint shifted to things that ai can’t fully solve yet: distribution, trust, brand, and sustained attention. when everyone can ship fast, shipping fast stops being the advantage. the cost is now paid in experimentation, customer acquisition, and time spent finding signal in a very noisy market. in that sense the playing field is flatter technically, but steeper competitively. ai compresses the “build” phase and inflates the importance (and cost) of getting people to care.",
          "score": 1,
          "created_utc": "2025-12-31 15:44:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx01om9",
          "author": "Shichroron",
          "text": "It killed a lot of thin wrappers and 1-2 feature startups. The solve a problem (but barely) kind of model is dead. Because you can either do it with LLM subscription, it’s so cheap that it’s given for free or it’s now a feature on all larger products",
          "score": 1,
          "created_utc": "2025-12-31 23:56:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx2os5m",
          "author": "Powerful-Software850",
          "text": "Yes it has significantly! The problem is the barrier to entry. If everyone can do something affordably, imagine how crowded it gets. Everyone is creating software and apps now, so what makes you different and stand out? 99% of these new apps and startups cannot answer that and will not survive in this new crowded market.",
          "score": 1,
          "created_utc": "2026-01-01 13:07:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx7y4va",
          "author": "Business_Owl1022",
          "text": "Spot on. AI dropped the build cost, but distribution is the new bottleneck. Many founders I talk to are realizing the ‘cost shift’ means funding strategy also changes, instead of raising for product dev, early rounds now focus on growth capital.",
          "score": 1,
          "created_utc": "2026-01-02 07:59:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx95szq",
          "author": "isaaclhy13",
          "text": "How much cheaper in percent do you think launching is now compared to five years ago? I'm a founder too and hit the same shock at rediscovered low costs when validating ideas. Try cold outreach to niche communities to validate demand fast, which tightens your spend and focus, and run tiny paid ad tests to measure CAC quickly so you stop guessing. I built SignalScouter, a founder-led Reddit SaaS that finds active posts and generates founder-style replies to get responses fast and reduce outreach overhead, and it helped me get 89 signups and 10k+ post views in days; would love any feedback or love to connect if you try it out, good luck.",
          "score": 1,
          "created_utc": "2026-01-02 14:01:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxbz3at",
          "author": "Positive-Schedule901",
          "text": "We were 12 people on the verge of bankruptcy, now we are 5, better product, more revenue and finally making profit. Without AI, I would just call the investor and tell him to take his money back.",
          "score": 1,
          "created_utc": "2026-01-02 22:14:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxcjpv7",
          "author": "kubrador",
          "text": "you answered your own question. the cost moved to distribution.\n\nbuilding is basically free now. everyone and their dog can spin up a store in an afternoon. which means the moat is gone. when everyone can build, nobody cares that you built.\n\nso now you're competing purely on getting eyeballs, which is more expensive than ever because everyone who saved money on dev is spending it on ads instead. you're all bidding against each other for the same traffic.\n\nthe \"playing field is flatter\" thing is cope btw. it's not flatter, it's just crowded. a flat field with 10x more players isn't easier to win on.",
          "score": 1,
          "created_utc": "2026-01-03 00:05:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxexb3o",
          "author": "Old-Farmer-1029",
          "text": "I don’t think the cost disappeared, it just migrated.\nAI compressed build time, but it amplified the cost of attention, distribution, and decision quality. When everyone can ship fast, differentiation and demand creation become the real constraints. The playing field may be flatter technically, but it’s steeper strategically.",
          "score": 1,
          "created_utc": "2026-01-03 09:58:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxkd3d6",
          "author": "Kooky-Muffin-5569",
          "text": "Agree with the other comments, it shifted the costs to distribution. In my opinion, it's now even more difficult to differentiate because the startup market is overcrowded...",
          "score": 1,
          "created_utc": "2026-01-04 03:47:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxm19vp",
          "author": "bartrirel",
          "text": "AI speeds up the initial build, but maintenance is where it gets pricey. We handled some AI integration for startups via Litslink on a recent project. Having a good team meant we spent less on 'fixing' AI mistakes and more on actual features. It's definitely a shift in spend.",
          "score": 1,
          "created_utc": "2026-01-04 11:54:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxoaxpo",
          "author": "DontMakeAMonkey",
          "text": "It only increased the noise and fluff.",
          "score": 1,
          "created_utc": "2026-01-04 19:05:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwpgaiw",
          "author": "prodigy_ai",
          "text": "For our startup, we’ve massively cut costs on development and content creation. We’re also figuring out how to lower our user‑acquisition expenses, and we’re planning to set up AI‑powered customer support",
          "score": 1,
          "created_utc": "2025-12-30 10:00:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwq1wdd",
          "author": "SergeiSolod",
          "text": "Competition has increased 100 fold. Now, any teenager can create an amazon or booking clone (minimal functionality) in a few months. I can't imagine how these projects will compete with each other, rather, they already are. But I have one guess: whoever has the money to invest (as before and as always) will win. Advertising is crucial. For example, suppose 10 people created the same product, which is easy to do with AI, say, a booking clone. Who will be successful? Not the one who posts a lot on social media or does other things. Someone who bought a lot of advertising, drove 1,000,000 people to the site, and 1,000 remain, and this happens every day. I look at successful AI-powered projects, they generate 50 creative ads a month and spend a lot of money on advertising. And I see projects of the same quality or even better nearby, but which have no users because they advertise on social networks through posts (for free) or through dead SEO =)",
          "score": 0,
          "created_utc": "2025-12-30 12:59:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwq7dcv",
          "author": "AdministrativeArt621",
          "text": "Tech is no longer a barrier or a moat, it’s a commodity. With AI, the real edges are now in execution, design, and selling.",
          "score": 0,
          "created_utc": "2025-12-30 13:33:58",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pydbxv",
      "title": "anyone here still working full time but also trying to build a startup?",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1pydbxv/anyone_here_still_working_full_time_but_also/",
      "author": "FormalAd7367",
      "created_utc": "2025-12-29 05:06:07",
      "score": 13,
      "num_comments": 21,
      "upvote_ratio": 1.0,
      "text": "\ni’m a bit stuck with linkedin.  i already have a job, but i also want to start something on the side.\n\nproblem is…  \nmy potential customers are also my vendors. and some are even my colleagues.\n\nnot sure what people usually do.  \n\ndo you make a second linkedin account?  \nor just post quietly on your own profile and hope no one makes it awkward.\n\ni don’t want conflict or weird conversations at work.  \nbut also don’t want to hide forever.\n\nhow did you handle this when you were in between?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1pydbxv/anyone_here_still_working_full_time_but_also/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "nwhwmhq",
          "author": "JCardiff",
          "text": "It will inevitably and eventually get weird. I went through the same experience. You're going to need to decide what you want more. I chose the hard path and it's been over 10 years since. It was the right choice.",
          "score": 6,
          "created_utc": "2025-12-29 05:21:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwhz5bq",
              "author": "FormalAd7367",
              "text": "it’s fairly hard to find a job nowadays and I’m not young anymore.  You obviously had lots of confidence in your gig and i’m not sure about my project",
              "score": 1,
              "created_utc": "2025-12-29 05:39:57",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwi17lh",
                  "author": "JCardiff",
                  "text": "That's fair. I started in my 30s, now in my 50s. I don't know if I would call it confidence.\n\nLet me know how I can help.",
                  "score": 3,
                  "created_utc": "2025-12-29 05:56:05",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwinvml",
          "author": "jonathanbrnd",
          "text": "Build your startup in public on X. Great for B2B SaaS.",
          "score": 7,
          "created_utc": "2025-12-29 09:17:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwmyhrr",
              "author": "foldedlikeaasiansir",
              "text": "What does build in public actually mean?",
              "score": 1,
              "created_utc": "2025-12-29 23:48:31",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nwotb8g",
                  "author": "Hoe_plz",
                  "text": "Like those glass kitchens in restaurants, cooking in public",
                  "score": 1,
                  "created_utc": "2025-12-30 06:31:01",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwhvjst",
          "author": "fkih",
          "text": "After it involved from a side project to a business, I informed my employer I have a potential Conflict of Interest, filled out the necessary forms and disclosures, then started working on my project. Nothing to hide. ",
          "score": 3,
          "created_utc": "2025-12-29 05:13:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwhy260",
              "author": "FormalAd7367",
              "text": "My reporting manager is against any other jobs not related to my job.  I have been approached by a publisher to write a book on my subject but my boss “questioned” it.  Being very passive aggressive.",
              "score": 2,
              "created_utc": "2025-12-29 05:31:44",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "nwvl86a",
              "author": "nope_nop_nop_nop",
              "text": "How did that go busy with that process at the moment a bit of fear there to be honest. The tool im building is not conflict of interest. Been using chatGPT to draft the document fed it to gemini then the AI's went nuts and one told me Im going to get legal involved. Im so scared submitting this document. Omg worst thing ever as I need the full time job so I can build this tool. Is there a template or something somewhere I can use what is best practice here. I am building on my own time using my own personal hardware and tools for this. Still a raher large and daunting step.",
              "score": 1,
              "created_utc": "2025-12-31 07:09:21",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nwvre5a",
                  "author": "fkih",
                  "text": "1. Tell your manager you're working on a project on the side, and ask them if there's any action items needed from your end to make sure you're in compliance with company policy.\n2. Get further action items from manager.",
                  "score": 2,
                  "created_utc": "2025-12-31 08:05:59",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwhvsll",
          "author": "Human_Kitchen947",
          "text": "You do you have a wonderful challenge at hand. I don't think staying in the shadows through a 2nd linkedin account helps your own entrepreneurial ambitions. \n\nI would first vet out the product offering, before you start contemplating sales conversations. Talk to 15-20 people in industry casually and gauge their response. Better still talk to someone who is doing something similar and gauge their progress and numbers. \n\nNext step find 2 customers who are neither vendors not colleagues and start small. Finally set yourself a goal - at what number of customers would you move from the job to full time entrepreneurship. Let it be real yet audacious.",
          "score": 3,
          "created_utc": "2025-12-29 05:15:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwo96pb",
          "author": "Jay_Builds_AI",
          "text": "I’ve seen this a lot. The founders who avoid awkwardness don’t create second identities-they delay positioning.\n\nPost as a learner, not a builder-for-hire. Share insights and observations, not launches or asks. Most conflict comes from claiming a role too early, not from quietly building.",
          "score": 3,
          "created_utc": "2025-12-30 04:08:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwsk4ht",
          "author": "KwongJrnz",
          "text": "I've worked for my employer for 8 years so far.\n\nThey've watched me:\n- Launch a startup\n- Acquire a SaaS\n- Launch an Agency\n- Grow my agency to 15 clients\n- Launch another startup\n\nI was very upfront with them, and let them know this was not a conflict of interest - they get the 8 hours from me they paid for.\n\nI also let them know that with this exposure and experience, I'm growing faster as a technical professional than ever before- without them needing to spend on that growth.\n\nIts been a really fruitful relationship, despite the fact I work from 8am - 4am, 7 days a week (this is the reality after running a booming startup), to the degree where they've even asked if I'd be interested in solo tackling an ERP they have problems with, funding 50% of it, and using it before selling it to our competitors as well.\n\nI think so long as you're in a different target market than them, you're okay.  You want your LinkedIn to avoid looking like a gig profile though, so keep that in mind.",
          "score": 2,
          "created_utc": "2025-12-30 20:28:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwi59nn",
          "author": "Acceptable_Cell8776",
          "text": "A small incident taught me a big lesson: many people in this situation handle it by quietly testing ideas on their existing profile while keeping posts neutral and value-focused. Sharing insights without naming products or directly promoting can attract interest without causing awkwardness. Over time, you can engage selectively and build your network carefully while maintaining professional boundaries at work.",
          "score": 1,
          "created_utc": "2025-12-29 06:29:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwisg6d",
          "author": "Ok_Humor_596",
          "text": "Just create 2nd account",
          "score": 1,
          "created_utc": "2025-12-29 10:00:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwiw64j",
              "author": "FormalAd7367",
              "text": "that was actually my first thought too.  but then i get stuck on the details.\n\nif i make a new account, do i just start adding my existing vendors and customers there like nothing happened?  \n\nwon’t that look a bit strange if they see a “new” profile?\n\nalso not sure about the work history part.  \n\ndo i copy over my past jobs so it looks legit, or do i just list my new venture as the only role and keep it clean?\n\ncurious how others handled this without it feeling awkward or spammy.",
              "score": 1,
              "created_utc": "2025-12-29 10:35:24",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwjudnt",
          "author": "Enwy94",
          "text": "Thats me here. Haha.",
          "score": 1,
          "created_utc": "2025-12-29 14:39:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwmoe15",
          "author": "Accomplished-Cry3390",
          "text": "H",
          "score": 1,
          "created_utc": "2025-12-29 22:53:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwq2e3b",
          "author": "Organic-Author9297",
          "text": "I'm full time undergraduate and currently doing freelancing projects.",
          "score": 1,
          "created_utc": "2025-12-30 13:02:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwsamt6",
          "author": "hammerzzzzzz",
          "text": "Im 55 and in a full time job but also looking at unrelated startup/sidehustle",
          "score": 1,
          "created_utc": "2025-12-30 19:42:56",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qa10nu",
      "title": "I built a place to “drop your bag” at the end of the day",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1qa10nu/i_built_a_place_to_drop_your_bag_at_the_end_of/",
      "author": "lmntrixaceOG",
      "created_utc": "2026-01-11 14:42:46",
      "score": 11,
      "num_comments": 5,
      "upvote_ratio": 1.0,
      "text": "I’ve been thinking a lot about something simple I lost without realizing it.\n\nWhen I was younger, I’d come home from school, drop my bag on the floor and just talk. My mom would be there. Sometimes busy, sometimes distracted but she listened. And that was enough.\n\nAs life moved on, calls got shorter. I moved out. The silence changed.  \nI realized the relief never came from advice. It came from saying things out loud to someone who cared.\n\nSo I built **The Kitchen Table**.\n\nIt’s not a productivity app. It’s not therapy.  \nIt’s a quiet space where you sit down, pick how you’re feeling and respond to gentle prompts like someone asking you about your day without trying to fix you.\n\nNo feeds. No AI agents. No optimization.\n\nJust a place to drop your bag.\n\nIf that idea resonates with you, you can try it here:  \n[https://thekitchentable.site/](https://thekitchentable.site/?utm_source=chatgpt.com)\n\nI’d genuinely love to hear what it feels like to use.\n\n",
      "is_original_content": false,
      "link_flair_text": "services",
      "permalink": "https://reddit.com/r/startup/comments/1qa10nu/i_built_a_place_to_drop_your_bag_at_the_end_of/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "nz0urd2",
          "author": "CringeyFrog",
          "text": "Reading this I got quite excited, but using it I feel it’s not quite what I was hoping for. \nI feel the multiple choices before getting into it kind of ruin the whole point. They steer the ‘bag drop’ in a set direction. \n\nI wanted to just open up into a ramble about my day and go down different alleys depending on what came up. Your mum would ask ‘how was your day’, not give you multiple choices of how you’re feeling. I think the experience needs to be just as you described in this post. \n\nGreat idea tho, all the best with it I hope it goes well for you.",
          "score": 2,
          "created_utc": "2026-01-11 19:21:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "nz10zed",
              "author": "lmntrixaceOG",
              "text": "I really appreciate the feedback. To be honest, the 'mood menu' was a bit of a mental tug-of-war for me too.\n\nOn one hand, capturing that mood data allows the app to provide better prompts. A lot of people don’t know where to start their 'rambling,' so the prompts give them a nudge. Plus, it gives the system enough context to know which happy entries deserve to be pinned to the 'fridge.' On the other hand, as you pointed out, a real mom would never give you a multiple choice list of feelings.\n\nBut then I realized, moms don't have to ask how you're feeling, they know just by looking at your face. Their follow up questions i.e. the ones they ask after they’ve read your vibe are what these prompts are meant to simulate. Since the website can’t look you in the eye (yet), the mood menu acts as that initial connection. We even allowed for custom moods because emotions aren't always standard (one of our beta testers was feeling particularly 'cobra' one day).\n\nSo, while it’s a digital compromise, I think it actually helps the app deliver on its core mission. That’s just my two cents, though I know opinions on UX can vary.",
              "score": 1,
              "created_utc": "2026-01-11 19:49:08",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nz3usj3",
          "author": "Additional-Pizza-668",
          "text": "This us very helpful and thoughtful of you .......thanks",
          "score": 2,
          "created_utc": "2026-01-12 04:23:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "nz3x09f",
              "author": "lmntrixaceOG",
              "text": "Glad you liked it!",
              "score": 1,
              "created_utc": "2026-01-12 04:37:48",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nz2oxgb",
          "author": "prepend",
          "text": "I'm not sure what this is, but I'm not signing up to find out.\n\nIs there something that describes what your site does?",
          "score": 1,
          "created_utc": "2026-01-12 00:38:15",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1q0zioc",
      "title": "Is it a good idea to use the money you have accumulated in your investing account to start a business?",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1q0zioc/is_it_a_good_idea_to_use_the_money_you_have/",
      "author": "Classic-Smoke-9009",
      "created_utc": "2026-01-01 08:32:54",
      "score": 10,
      "num_comments": 25,
      "upvote_ratio": 0.82,
      "text": "I have a business idea for a long time. I am looking to save more money and use them in order the idea to become a reality.\n\nI am 18 and I have always wondered if it is better to work a job which pays a high salary every month and a percentage of the salary to be invested in ETFs and save up for retirement for example. Or working that high salary job and use the money you have saved up or invested over some time and leave your job and risk to reach your goal of building that business in mind.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1q0zioc/is_it_a_good_idea_to_use_the_money_you_have/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "nx1yrfu",
          "author": "jawanda",
          "text": "Starting a business has unlimited potential upside AND downside. You very well may lose everything you invest into it. But you also might create massive wealth beyond what you could ever earn with an etf or such. \n\nNo one can really say if it's a good idea ... Every situation is different!",
          "score": 9,
          "created_utc": "2026-01-01 08:45:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx3ae5d",
              "author": "die117",
              "text": "I can say! It's a bad idea, but sometimes bad ideas have extraordinary outcomes",
              "score": 3,
              "created_utc": "2026-01-01 15:33:06",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nx216cb",
          "author": "Naive-Camel5600",
          "text": "In your situation, take the risk",
          "score": 4,
          "created_utc": "2026-01-01 09:11:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx3m6o7",
          "author": "IncubationStudio",
          "text": "I’ve gone all-in more than once. Twice, I nearly lost everything.\nWhat I learned the hard way: going “all-in” too early doesn’t make you brave, it just removes your margin for error. Capital is oxygen. Time is leverage.\nAt 18, protect both. Build while employed. Invest steadily. Let the business earn the right to become your full-time focus.  Use money to test assumptions, not to prove belief. There’s nothing wrong with ambition. Just don’t confuse urgency with wisdom.",
          "score": 4,
          "created_utc": "2026-01-01 16:36:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx2qrm6",
          "author": "autocursor",
          "text": "At 18 in today’s world start with the business- it will give you hands on experience and if you need to get employed later you’ll have a different more laser focused skilled set compared to your peers ",
          "score": 3,
          "created_utc": "2026-01-01 13:23:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx4cl8r",
          "author": "Unlucky-Zombie607",
          "text": "Take the risk pal. You’re young, go broke if you have to. You can always make more money, time is something you’ll never get back",
          "score": 2,
          "created_utc": "2026-01-01 18:51:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx4jni6",
              "author": "Classic-Smoke-9009",
              "text": "Thanks buddy",
              "score": 1,
              "created_utc": "2026-01-01 19:26:04",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nx2si2w",
          "author": "ComputerThink8600",
          "text": "Make sure first that the idea is really good, meaning innovative, really better than everything else that already exists and it solves a real problem. These days you can, in many cases, make a MVP with AI on the cheap to test your idea and see if there is interest from potential customers.",
          "score": 1,
          "created_utc": "2026-01-01 13:36:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx30sv3",
          "author": "Odd-Relief-6190",
          "text": "At your age invest in yourself…education, skills, learning.  You can do that with school, corporate, business, trade etc.",
          "score": 1,
          "created_utc": "2026-01-01 14:34:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx4jvq8",
              "author": "Classic-Smoke-9009",
              "text": "thanks",
              "score": 1,
              "created_utc": "2026-01-01 19:27:12",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nx41qbn",
          "author": "LuisVillamil",
          "text": "Do you need to invest it all? maybe you can star with small ideas and learn from failures and success, and then go bigger over time",
          "score": 1,
          "created_utc": "2026-01-01 17:57:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx4juhi",
              "author": "Classic-Smoke-9009",
              "text": "I don’t have much money. I spent a large fortune a laptop for university.",
              "score": 1,
              "created_utc": "2026-01-01 19:27:02",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nx5kjrr",
          "author": "plsgivemecoffee",
          "text": "At 18, optionality matters more than optimizing returns. In most cases it’s safer to treat a business as an experiment you fund gradually while building skills and income, rather than an all-in bet with money meant for long-term investing. You can always take bigger risks later once you have leverage, experience, and a clearer signal that the idea actually works.",
          "score": 1,
          "created_utc": "2026-01-01 22:36:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx7uqbu",
          "author": "Even-Spread3761",
          "text": "At 18, it’s a good start to build a stable income, invest regularly, work on your business idea on the side, and use your savings when the idea starts showing real potential. Its a nice thought and you should go for it.",
          "score": 1,
          "created_utc": "2026-01-02 07:27:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx7x6hg",
          "author": "TormundTVUK",
          "text": "Going to chime in here, you don’t need to go all in. Start small and test your business, but really take the time to analyse your data, what works, what doesn’t. \n\nLuckily you’re 18, which means you have the time and resources to really research your business field, and the internet is abundant with resources to help that.",
          "score": 1,
          "created_utc": "2026-01-02 07:50:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx8prmf",
          "author": "Vaibhav_codes",
          "text": "At 18, don’t drain all investments. Start your business lean while keeping a financial safety net; balance risk with security.",
          "score": 1,
          "created_utc": "2026-01-02 12:12:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx9exo7",
          "author": "Designer_Clerk_6092",
          "text": "At 18, your biggest asset is not money — it’s time and adaptability.\nA job + saving gives you stability. A business gives you optionality.\n\nThe smartest path is not “all-in” or “safe forever”.\nIt’s: build your business in parallel while keeping income.\nWhen traction appears — then you switch.\n\nDon’t bet your entire future on savings.\nBuild leverage before you take risk",
          "score": 1,
          "created_utc": "2026-01-02 14:53:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxf76ej",
          "author": "MySocialUploader",
          "text": "It's never a mistake to start something new; we're also a startup/company just getting started with our idea, and investing money is never a mistake. You learn from mistakes, too.",
          "score": 1,
          "created_utc": "2026-01-03 11:21:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxgatqz",
          "author": "Difficult_Purpose242",
          "text": "Been there, felt that.",
          "score": 1,
          "created_utc": "2026-01-03 15:33:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxui2an",
          "author": "New-Month-8014",
          "text": "I wouldn’t suggest it but it varies depending on the business you’re starting also",
          "score": 1,
          "created_utc": "2026-01-05 17:06:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx1ys20",
          "author": "PatsyTheElder",
          "text": "You’re 18…build the business.",
          "score": 1,
          "created_utc": "2026-01-01 08:46:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxfut5c",
              "author": "Brendan991234",
              "text": "Completely agree here. I’m 29 and am just getting started on starting a business. \n\nMy advice work your 9-5 job. From 5-9 grow your business on the side. Use your job to learn as much as possible about business. Wait until your 5-9 put earns your 9-5",
              "score": 2,
              "created_utc": "2026-01-03 14:07:07",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1q4foi0",
      "title": "Ex-CTO/tech cofounder (0→7-fig) looking for next build: best places to find aligned teams?",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1q4foi0/exctotech_cofounder_07fig_looking_for_next_build/",
      "author": "leksofmi",
      "created_utc": "2026-01-05 07:48:44",
      "score": 7,
      "num_comments": 22,
      "upvote_ratio": 0.89,
      "text": "I’m Tokyo-based and have 10+ years in tech. I’ve taken a product/business from 0 to 7-figures, and I’m now looking for my next build.\n\nThe current project is stable, but between timezone friction and the maturity of the product, I’m exploring what’s next:\n\n* joining an early-stage AI startup as a technical cofounder, or\n* doing fractional CTO work to help founders ship and scale.\n\n**Question for the community:**  \nWhere are you finding serious cofounder matches in 2026, especially cross-border or Asia/US timezones? What signals do you use to filter out “idea people” and find teams with real execution?\n\nIf you’ve done this successfully, I’d love to hear what worked (communities, platforms, process, red flags, etc.).",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1q4foi0/exctotech_cofounder_07fig_looking_for_next_build/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "nxst65v",
          "author": "Money_Mind_3365",
          "text": "I would like to work with you on one of the AI ​​projects I am developing and would like to have someone to guide me, please.",
          "score": 1,
          "created_utc": "2026-01-05 11:20:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxt88v0",
              "author": "leksofmi",
              "text": "Please DM me and let's talk!",
              "score": 1,
              "created_utc": "2026-01-05 13:11:53",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nxt839w",
          "author": "ISupplyAI",
          "text": "Honestly, finding the right team feels a bit like dating, you know? Tech meetups and local startup events can be great spots to meet people who get what you're trying to do. Plus, Indie Hackers and Devpost are good for connecting with others who are just as excited about creating something new. If you’re more into online hangouts, you could also try joining some Slack or Discord communities all about startups. Who knows, you might just find your next co-founder there. Remember, it’s all about finding folks with similar vibes and goals!\n\nI am considering looking for a co founder, if you're interested let me know.",
          "score": 1,
          "created_utc": "2026-01-05 13:10:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxveiqv",
              "author": "Money_Mind_3365",
              "text": "Yes, I'd like to be a co-founder, what would you like us to work on?",
              "score": 1,
              "created_utc": "2026-01-05 19:33:44",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nxtir9k",
          "author": "DetectiveMindless652",
          "text": "any experience in deep tech?",
          "score": 1,
          "created_utc": "2026-01-05 14:13:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxtmcyi",
              "author": "leksofmi",
              "text": "Could you clarify what you mean? I can build apps and stuff and AI agents. I did it for my own company, and can probably do it again.",
              "score": 1,
              "created_utc": "2026-01-05 14:33:43",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nxuduww",
          "author": "oneemoviet",
          "text": "Hi, I would love to discuss more with you.",
          "score": 1,
          "created_utc": "2026-01-05 16:47:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxx549a",
              "author": "leksofmi",
              "text": "My DM are open and I can do a trial call to see if there's a fit for both of us!",
              "score": 1,
              "created_utc": "2026-01-06 00:38:42",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nxutdm0",
          "author": "Kooky-Muffin-5569",
          "text": "Hey I’m launching a tech startup related to sports & networking, would love to get some guidance!",
          "score": 1,
          "created_utc": "2026-01-05 17:58:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxveoxj",
              "author": "Money_Mind_3365",
              "text": "Wow, can you explain what this is all about, please?",
              "score": 1,
              "created_utc": "2026-01-05 19:34:32",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nxxx0tl",
                  "author": "Kooky-Muffin-5569",
                  "text": "It’s an app to help professionals (e.g., consultants, lawyers, accountants, salesman, etc) connect/network through sports matchmaking in their area (e.g., squash, tennis, panel, cycling). Think of it like a mix between LinkedIn and a sport matchmaking app.\n\nCurrently in the process of validating customer needs, but definitely let me know what you think!",
                  "score": 1,
                  "created_utc": "2026-01-06 03:09:46",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nxx4kga",
              "author": "leksofmi",
              "text": "Hey u/Kooky-Muffin-5569, I am all ears. Feel free to DM me with the info and we can proceed from there! See in the private DM box!",
              "score": 1,
              "created_utc": "2026-01-06 00:35:51",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nxwzuoh",
          "author": "RepresentativeBig401",
          "text": "I’m building Spark Fintech a small business credit platform in the US market. The focus is on designing a lending product that sits between traditional banks and MCA, but avoids destroying cash flow when revenue fluctuates. It’s very infrastructure-heavy: underwriting logic, real-time cash-flow signals, compliance, and integration with regulated partners. This is a deeply regulated and operationally complex space, not a “move fast and break things” product. Execution matters a lot more than ideas here. Still early and in validation, but if you’re interested in hard fintech problems rather than pure AI wrappers, happy to exchange notes.",
          "score": 1,
          "created_utc": "2026-01-06 00:11:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxx50c0",
              "author": "leksofmi",
              "text": "Hey u/RepresentativeBig401, I have actually worked on many AI wrappers in the past. They were fun, but yes I am looking for something more in-depth and have stronger initial regardless of the AI wave that's taking over the industry. \n\nPlease DM me! Looking forward to hearing more from you!",
              "score": 1,
              "created_utc": "2026-01-06 00:38:08",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "ny0ioz6",
          "author": "Sure_Celebration6452",
          "text": "Better to continue with fractional CTO role till your business is scaled.\n\nAlso, I have a tech team based in Nepal, can help with tech side.",
          "score": 1,
          "created_utc": "2026-01-06 14:44:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "ny0onjq",
          "author": "Particular_Pay1842",
          "text": "would love an internship if available",
          "score": 1,
          "created_utc": "2026-01-06 15:13:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "ny2hygh",
          "author": "Huge-Signature-7143",
          "text": "hopefully im not too late. Me and my cofounder have fully designed an AI fitness platform. Its much more convoluted than that but the industry is growing really fast, and we have a product that we think is really sick. Would love to talk to you if you havent found something already.",
          "score": 1,
          "created_utc": "2026-01-06 20:11:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "ny3ev3i",
              "author": "leksofmi",
              "text": "u/Huge-Signature-7143 Yes, would love to learn more as well. Feel free to send me a DM and we continue the convo from there?",
              "score": 1,
              "created_utc": "2026-01-06 22:44:07",
              "is_submitter": true,
              "replies": [
                {
                  "id": "ny7m3rg",
                  "author": "Huge-Signature-7143",
                  "text": "Sure!",
                  "score": 1,
                  "created_utc": "2026-01-07 15:11:48",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "ny7nh5a",
                  "author": "Huge-Signature-7143",
                  "text": "Messaged!",
                  "score": 1,
                  "created_utc": "2026-01-07 15:18:21",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1q3nt8s",
      "title": "What tech stack are you using?",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1q3nt8s/what_tech_stack_are_you_using/",
      "author": "amacg",
      "created_utc": "2026-01-04 11:34:43",
      "score": 7,
      "num_comments": 12,
      "upvote_ratio": 0.82,
      "text": "Hi everyone,\n\nI am curious to know what tech stack are you using for your side project?\n\nHere's mine:\n\n\\- Lovable (Front-end)  \n\\- Supabase (Database)  \n\\- Resend (Email)  \n\\- Stripe (Payments)  \n\\- Ahrefs (SEO)  \n\\- Google (Productivity)  \n\\- Mercury (Banking)  \n\\- Xero (Accounting)  \n\\- ChatGPT (AI)  \n\\- Beehiiv (Newsletters)  \n\\- Apify (Scraping)  \n\\- Make (Automation)  \n\\- Cal (Meetings)  \n\\- Hubspot (CRM)\n\n",
      "is_original_content": false,
      "link_flair_text": "knowledge",
      "permalink": "https://reddit.com/r/startup/comments/1q3nt8s/what_tech_stack_are_you_using/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "nxmj24i",
          "author": "TrueTeaToo",
          "text": "ChatGPT (general AI), Canva (marketing), Supabase (database), Google sheet (CRM, campaign), Saner (notes, todos management), Lemlist (outreach)",
          "score": 3,
          "created_utc": "2026-01-04 13:59:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxoh6gd",
          "author": "desianer",
          "text": "Why so many different products? Don't some of those cross over in functionality?",
          "score": 2,
          "created_utc": "2026-01-04 19:33:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxsceqn",
              "author": "amacg",
              "text": "Not really.",
              "score": 1,
              "created_utc": "2026-01-05 08:47:55",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nxz8px4",
          "author": "Anonymous03275",
          "text": "Great, how many are initially free tier among these? If they r not, are there any alternatives?",
          "score": 2,
          "created_utc": "2026-01-06 09:14:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxzazgk",
              "author": "amacg",
              "text": "Actually almost all have free tiers. The issue I found is that's fine for testing, but one you onboard users you quickly hit those limits.",
              "score": 1,
              "created_utc": "2026-01-06 09:36:57",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "ny9gavx",
          "author": "TheGrowthMentor",
          "text": "Nice stack! I work with a ton of side projects and startups on their tech stacks. Lovable for front-end is smart as it allows fast prototyping without getting bogged down in code. Supabase + Resend is a solid combo too. Your stack is pretty tool-heavy (14 tools). Not bad, but as you scale you might feel the \"too many logins\" pain. Some consolidation opportunities that I see are:\n\n* HubSpot can handle Cal (meetings) natively if you're already using it for CRM\n* Make is great, but depending on complexity, you might be able to do some of that automation with custom coded workflows or webhooks. I also use n8n instead of Make.\n* Beehiiv vs HubSpot for newsletters - might not need both depending on your use case\n\nCurious what you're building? B2B SaaS, consumer app, something else? Also, if it's helpful, I've got some resources on tech stacks for side projects and startups.",
          "score": 2,
          "created_utc": "2026-01-07 20:06:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "ny9pp3e",
              "author": "amacg",
              "text": "Thanks for the kind words! Built a B2B app called Media / trymedia.ai and a B2C launch platform called Launch / trylaunch.ai (among others).",
              "score": 1,
              "created_utc": "2026-01-07 20:48:05",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nxpvqzn",
          "author": "Connect-Subject188",
          "text": "Next.js + Supabase for the core, Stripe for payments, Postmark for emails.  \nEverything else I try to automate or glue together with n8n/Zapier instead of adding a tool",
          "score": 1,
          "created_utc": "2026-01-04 23:30:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxt0ytb",
          "author": "greenmor",
          "text": "Wordpress (self-hosted) - websites  \nGreenmor Mail - email  \nAhrefs - seo  \nX/Linkedin/Reddit - social outreach  \nChatGPT/Grok - AI",
          "score": 1,
          "created_utc": "2026-01-05 12:21:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxut633",
          "author": "Intrepid-Oil1447",
          "text": "Layer in automation early to cut manual tweaks. Use tools that sync data seamlessly to avoid silos. Prioritize ones with easy knowledge capture for scaling. Sensay often helps with that AI interview side, among options. What's your project focus?",
          "score": 1,
          "created_utc": "2026-01-05 17:57:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nyd0s5x",
          "author": "plsgivemecoffee",
          "text": "Brainfuck (database)\nBrainfuck (SEO)\n\nThat’s really all I need",
          "score": 1,
          "created_utc": "2026-01-08 07:50:12",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1q312wj",
      "title": "Start up Founders",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1q312wj/start_up_founders/",
      "author": "ARouterContinua",
      "created_utc": "2026-01-03 17:51:59",
      "score": 7,
      "num_comments": 7,
      "upvote_ratio": 0.82,
      "text": "Being a startup founder is tough but I have to keep pushing. Building a business is hard, but ain’t no way I’m letting another dude tell me when to take lunch, when to take a break or when to take a piss for a whole 40years.",
      "is_original_content": false,
      "link_flair_text": "knowledge",
      "permalink": "https://reddit.com/r/startup/comments/1q312wj/start_up_founders/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "nxkrcth",
          "author": "JCardiff",
          "text": "How long have you been on the startup rollercoaster?",
          "score": 1,
          "created_utc": "2026-01-04 05:20:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "ny1p2mk",
          "author": "DexDw67",
          "text": "Yes, I agree with you, for us founders the exhaustion is great and sometimes lonely, but keep your head up and move forward, in the end everything you went through to achieve success is rewarding.",
          "score": 1,
          "created_utc": "2026-01-06 18:00:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "ny6343h",
              "author": "ARouterContinua",
              "text": "True",
              "score": 1,
              "created_utc": "2026-01-07 08:50:21",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "ny62toc",
          "author": "windows-cli",
          "text": "How did you promote your products? paid advertising or community driven?",
          "score": 1,
          "created_utc": "2026-01-07 08:47:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "ny633a6",
              "author": "ARouterContinua",
              "text": "Both",
              "score": 1,
              "created_utc": "2026-01-07 08:50:09",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nyebddo",
          "author": "Designer_Clerk_6092",
          "text": "You are right ! Don’t work for another dude 10 year!",
          "score": 1,
          "created_utc": "2026-01-08 13:49:46",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1q5mxd0",
      "title": "2026 Builders Check In, How's Growth Going So Far?",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1q5mxd0/2026_builders_check_in_hows_growth_going_so_far/",
      "author": "allen18walker",
      "created_utc": "2026-01-06 16:16:16",
      "score": 7,
      "num_comments": 11,
      "upvote_ratio": 1.0,
      "text": "**2026** is moving fast and execution is everything. A lot of early stage builders are shipping solid products but getting stuck on growth, especially without a real marketing budget.\n\nOne approach more founders are using is revenue sharing for marketing. No big upfront costs, aligned incentives, and you stay focused on building while growth happens in parallel.\n\nIf you are building in 2026 and thinking about traction without burning cash, **Comment** or **DM** me and **I will share something useful.**",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1q5mxd0/2026_builders_check_in_hows_growth_going_so_far/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "ny12pl6",
          "author": "AirlineSmooth107",
          "text": "I'm interested.",
          "score": 1,
          "created_utc": "2026-01-06 16:19:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "ny130gy",
              "author": "allen18walker",
              "text": "check DM.",
              "score": 1,
              "created_utc": "2026-01-06 16:20:48",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "ny1lcwo",
          "author": "Leonard-21rag",
          "text": "Interesting approach. It can work in some cases, in some not.",
          "score": 1,
          "created_utc": "2026-01-06 17:44:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "ny1rqti",
          "author": "ambryio",
          "text": "I would like to know more🤝",
          "score": 1,
          "created_utc": "2026-01-06 18:12:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "ny45q7c",
              "author": "allen18walker",
              "text": "check DM.",
              "score": 1,
              "created_utc": "2026-01-07 01:02:27",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "ny340sw",
          "author": "Azby78",
          "text": "Hey DM me OP!",
          "score": 1,
          "created_utc": "2026-01-06 21:52:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "ny45qgm",
              "author": "allen18walker",
              "text": "check DM.",
              "score": 1,
              "created_utc": "2026-01-07 01:02:30",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "ny36s8f",
          "author": "Lip_Muse_Vip",
          "text": "Love this idea. Finding good marketing partners who actually care about the product is tough when you're just starting out. Revenue sharing sounds like a solid way to keep everyone motivated without draining the bank account early on. Def interested in seeing what you've got!",
          "score": 1,
          "created_utc": "2026-01-06 22:05:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "ny45qoq",
              "author": "allen18walker",
              "text": "check DM.",
              "score": 1,
              "created_utc": "2026-01-07 01:02:31",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "ny6n9i4",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-01-07 11:48:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "ny9f5wa",
              "author": "allen18walker",
              "text": "check DM.",
              "score": 1,
              "created_utc": "2026-01-07 20:01:50",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1pxz3ot",
      "title": "I built a small AI project that now has 300K users One year later here’s what I learned about growth",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1pxz3ot/i_built_a_small_ai_project_that_now_has_300k/",
      "author": "Luca-Roxas464",
      "created_utc": "2025-12-28 18:51:06",
      "score": 6,
      "num_comments": 10,
      "upvote_ratio": 0.8,
      "text": "A year ago I built ninjachat AI because I was spending $60 a month on ChatGPT, Midjourney, and Perplexity and kept hitting usage limits. Since I’m a developer, I made a simple interface combining AI chat and image generation.\n\nThe first version took less than two weeks. Over the last six months, we added chat with PDFs, mindmaps, video generation, and new AI models.\n\nWe sponsored 50 YouTube creators, including 10 Indian creators. In the last 3 months, we sponsored 5 Indian creators. Today the product has over 300K users.\n\nOne Indian YouTuber we paid $400 for a dedicated video got 43K views, 7K visits, 3K free signups, and only 1 paying user. This showed that not every audience converts, and Indian viewers in particular rarely become paying users.\n\nWestern creators and some from UAE and Spain convert much better. Now we focus on mid to big-tier influencers who can go viral and bring real engagement.\n\nNot all traffic is equal. Views feel good, but paying users keep the product alive. Investing in creators whose audiences genuinely care is far more valuable than chasing free signups.\n\nAsk me anything about how we grew it, what strategies worked, what failed, and how we decide which creators to sponsor next.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1pxz3ot/i_built_a_small_ai_project_that_now_has_300k/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "nwfvsaz",
          "author": "Tiny_Possibility2040",
          "text": "We had the same experience with Indians, they hardly converts into paying customers.",
          "score": 4,
          "created_utc": "2025-12-28 22:23:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwjbvhk",
              "author": "Luca-Roxas464",
              "text": "ya, you get free signups but no paying users also *churn is very high*",
              "score": 1,
              "created_utc": "2025-12-29 12:46:07",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwliz3p",
          "author": "Unhappy_Trainer8662",
          "text": "India is a price sensitive and usually not a consumer market you need to change approach for india where its customers should feel like free products but actually end up the real products itselfs",
          "score": 3,
          "created_utc": "2025-12-29 19:29:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwqgl2l",
              "author": "Luca-Roxas464",
              "text": "You are correct, that why Google Gemini, Perplexity, Chat GPT all are giving 1 year free access to pro plan in India.",
              "score": 1,
              "created_utc": "2025-12-30 14:27:09",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwps7tr",
          "author": "Pale-Requirement9041",
          "text": "I would suggest you to add smart ads placement into your app or website.",
          "score": 2,
          "created_utc": "2025-12-30 11:46:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwqgr1w",
              "author": "Luca-Roxas464",
              "text": "Thanks for your Suggestion,  let me see",
              "score": 1,
              "created_utc": "2025-12-30 14:28:05",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwqmvf1",
                  "author": "Pale-Requirement9041",
                  "text": "Even big companies like Citymapper are turning back into ads on their app, probably not having enough paid customers but huge traffic would increase revenue using ads.",
                  "score": 1,
                  "created_utc": "2025-12-30 15:01:05",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nx3hnxi",
          "author": "Abedalaziz_tawheed",
          "text": "Bro could you please explain how you found these creators? I run an influencer marketing agency and I’m trying to learn new tactics for finding influencers.",
          "score": 2,
          "created_utc": "2026-01-01 16:12:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxaw60q",
              "author": "Luca-Roxas464",
              "text": "We manually search for creators on YouTube, reach out via email, negotiate, and close deals ourselves. \n\nEarly on, we lost money because some larger influencers were buying views. Now we’re much more careful , we watch their recent videos, look closely at the comments, and only reach out if the engagement feels genuine.",
              "score": 1,
              "created_utc": "2026-01-02 19:05:05",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1pzoi0c",
      "title": "Why do people waste money on tech?",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1pzoi0c/why_do_people_waste_money_on_tech/",
      "author": "hatebacon",
      "created_utc": "2025-12-30 17:43:52",
      "score": 6,
      "num_comments": 16,
      "upvote_ratio": 0.72,
      "text": "Because they don't know what technology is for.\n\nTech exists for one purpose: to optimize a process. That is the case for both archaic tools like hammers, shovels and Excel to also all the modern AI software and smart devices we're seeing launching everyday.\n\nSo process is key. If you don't have clarity on your process, or if it is not good, than a specific tool will not solve any problem.\n\nOverlooking the process and focusing on the tools is the biggest mistake for both IT professionals and those who hire them.\n\nEvery tool has it's downsides and every software is flawed. But more often than not, when you fail at a project, the problem is not on the tool or the platform you're using, but on lack of planning and proper management.\n\n* Automating your sales process is useless without having a great offer\n* Launching a paid traffic campaign is a waste of money if you don't know where your potential clients are and how to talk to them\n* A fancy landingpage will not bring you any results without a clear communication and a great CTA\n* Implementing a CRM won't do anything for you if you don't know how to analyse data and get feedback on your clients in order to continuously improve your process at each new one\n\nAI is changing the game, lowering the barriers for people to start their businesses and giving eveyone who dominate and keep up with the changes an unfair advantage over those who don't. But just like any technology, you won't get anything out of it without a great offer, a solid plan and a well managed process.",
      "is_original_content": false,
      "link_flair_text": "knowledge",
      "permalink": "https://reddit.com/r/startup/comments/1pzoi0c/why_do_people_waste_money_on_tech/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "nwtb95j",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 2,
          "created_utc": "2025-12-30 22:38:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwtbmeo",
              "author": "hatebacon",
              "text": "And redditors are miserable people",
              "score": 2,
              "created_utc": "2025-12-30 22:40:34",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwv4ks8",
          "author": "demirb",
          "text": "This is a legit post why does it have downvotes? \nHere take my upvote.",
          "score": 2,
          "created_utc": "2025-12-31 04:59:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwwi2ug",
              "author": "hatebacon",
              "text": "Because redditors are miserable people. That's why I hangout more on Skool.",
              "score": 1,
              "created_utc": "2025-12-31 12:12:15",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwwlyso",
          "author": "No-Swimmer-2777",
          "text": "Exactly. Most founders buy tools to feel like they're progressing when they should be validating their core assumption first. Process clarity beats tooling every time.",
          "score": 2,
          "created_utc": "2025-12-31 12:42:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwwpdxs",
              "author": "hatebacon",
              "text": "exactly. That's a mistake I see both solopreneurs and big corporations doing. implementing a tool is easier than optimizing a processs and it creates a false ilusion of progress that in practice only results in extra expenses and unecesssary complexity.",
              "score": 1,
              "created_utc": "2025-12-31 13:06:48",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nx3ffbd",
                  "author": "Stunning_Stage_3608",
                  "text": "Lets meet Sometime In real to teach you while Having the Coffee",
                  "score": 1,
                  "created_utc": "2026-01-01 16:00:42",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwx7uha",
          "author": "Illustrious_Feed8289",
          "text": "that's the Great Post",
          "score": 2,
          "created_utc": "2025-12-31 14:56:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx3eii9",
              "author": "Stunning_Stage_3608",
              "text": "thats What You Beilive Bro ??",
              "score": 1,
              "created_utc": "2026-01-01 15:55:46",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nx3emzf",
                  "author": "Illustrious_Feed8289",
                  "text": "Yes that guys Is really Telling the truth",
                  "score": 1,
                  "created_utc": "2026-01-01 15:56:26",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nx3eypc",
              "author": "Royal_Extension_930",
              "text": "yay I also started to Agree with this Bro but that to Much Of Speech not Like That this is Trying to Share the Story",
              "score": 1,
              "created_utc": "2026-01-01 15:58:12",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nx3f4h5",
                  "author": "Illustrious_Feed8289",
                  "text": "na bro",
                  "score": 1,
                  "created_utc": "2026-01-01 15:59:04",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nx3f763",
              "author": "Royal_Extension_930",
              "text": "see you guys Tommorow",
              "score": 1,
              "created_utc": "2026-01-01 15:59:28",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nwykyq3",
          "author": "thinking_byte",
          "text": "I mostly agree, but I think the trap is tools feel like progress when the process work is uncomfortable. Buying software is concrete and fast, figuring out who your customer is and what actually converts is slow. I have seen teams add layers of tech just to avoid making hard decisions about scope or priorities. The best tools we adopted came after the process was already working in a scrappy way. Then the tech amplified it instead of masking the gaps.",
          "score": 2,
          "created_utc": "2025-12-31 19:02:47",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pzstyw",
      "title": "I built a baby tracking app with mental health breaks for dads. Looking for honest feedback.",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1pzstyw/i_built_a_baby_tracking_app_with_mental_health/",
      "author": "Emotional-Roof-7728",
      "created_utc": "2025-12-30 20:28:06",
      "score": 6,
      "num_comments": 6,
      "upvote_ratio": 1.0,
      "text": "4 months ago my daughter Emma was born. Like most of you, my wife and I couldn't remember anything through the sleep deprivation. Who fed her last? When was the last diaper? No idea.\n\nI tried Huckleberry, Baby Buddy, a few others. They're good apps. But I'm a developer, and I wanted something specific that I couldn't find:\n\n**An app that tells me \"you're doing fine\" instead of just showing me charts.**\n\n73% of millennial dads report parenting anxiety. I'm one of them. Every app showed me data but none of them helped with the \"am I screwing this up?\" feeling.\n\nSo I built Dad Co-Pilot. The main things that make it different:\n\n* \"Is this normal?\" insights based on CDC/AAP guidelines. Not just \"5 feeds today\" but \"5 feeds today—that's right on track for this age.\"\n* Mental health breaks built in. Breathing exercises, stretches for baby-carrying tension, and a daily dad joke because sometimes you just need to laugh.\n* Partner sync without leaderboards or competition. Just \"last feed was 2 hours ago.\"\n\nIt's free to download. There's a premium tier, but the core tracking is free.\n\nIf you try it, I'd genuinely love feedback. What's missing? What's annoying? What would make it actually useful for you?\n\nLet me know in comments, i'll send the link from app store, thank you.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1pzstyw/i_built_a_baby_tracking_app_with_mental_health/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "nwvgmah",
          "author": "LuisVillamil",
          "text": "I am interested, I have a baby 3 months old and a toddler, I have never tried any parenting apps so it would be interesting",
          "score": 2,
          "created_utc": "2025-12-31 06:30:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwwmeqd",
              "author": "Emotional-Roof-7728",
              "text": "feel free to download app [https://apps.apple.com/us/app/baby-tracker-for-dads/id6755366965?ppid=2da572e2-ea2a-4620-8e9a-289bbd674208](https://apps.apple.com/us/app/baby-tracker-for-dads/id6755366965?ppid=2da572e2-ea2a-4620-8e9a-289bbd674208) happy hear back from you, and Happy new year !",
              "score": 1,
              "created_utc": "2025-12-31 12:45:41",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwznk67",
                  "author": "LuisVillamil",
                  "text": "It looks nice, In my case the baby is breast feed so we don’t really track eating times but the dipper track is useful, In our monthly check up with my baby’s doctor they have a questionnaire for the baby like can she hold her head and so on, and at the end he gives us some exercises that we can do with her like tummy time and just talking to the baby, I know its not what the app its about right now but could be nice future features (sorry for my english) happy new year to you too!",
                  "score": 2,
                  "created_utc": "2025-12-31 22:32:37",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nww5mfl",
          "author": "rollingeyespigeon",
          "text": "Hi! I’m interested as a father of a 7 months old baby",
          "score": 2,
          "created_utc": "2025-12-31 10:21:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwwmc2y",
              "author": "Emotional-Roof-7728",
              "text": "feel free to download app [https://apps.apple.com/us/app/baby-tracker-for-dads/id6755366965?ppid=2da572e2-ea2a-4620-8e9a-289bbd674208](https://apps.apple.com/us/app/baby-tracker-for-dads/id6755366965?ppid=2da572e2-ea2a-4620-8e9a-289bbd674208) happy hear back from you, and Happy new year !",
              "score": 1,
              "created_utc": "2025-12-31 12:45:08",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwwlmqe",
          "author": "No-Swimmer-2777",
          "text": "Love this. The insight about anxiety-driven dads is spot on - most apps miss the emotional side. One founder thing I'd push on: you've got real users interested which is great, but before sinking more time into features, run a 20-minute validation call with 5 of them asking \"what's the single moment each day when you'd actually use this?\" You might find they're not checking an app but want Slack/SMS alerts instead. I use [IdeaProof.io](http://IdeaProof.io) for this validation step before building. Right now you're in the perfect window to pivot fast if needed.",
          "score": 2,
          "created_utc": "2025-12-31 12:39:55",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1q21wrj",
      "title": "Looking to start a small, in-person founder group in NYC",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1q21wrj/looking_to_start_a_small_inperson_founder_group/",
      "author": "OneAnd_",
      "created_utc": "2026-01-02 15:44:22",
      "score": 6,
      "num_comments": 2,
      "upvote_ratio": 1.0,
      "text": "Entrepreneurship can be lonely, especially if you’re building outside of a big co-founder or accelerator bubble. A lot of founders I know aren’t based in NYC, and I’ve personally found it hard to build real, in-person relationships with people who are dealing with the same day-to-day challenges.\n\nI know there are plenty of groups out there. I’ve tried a few. Most end up being networking-heavy, centered around talks, or have high barriers to entry. I like the concept of Hampton, but I’m interested in something similar for people who haven’t hit the $X+M/year revenue mark yet.\n\nI’m looking to start a small, in-person group in NYC that meets once a month for coffee or dinner. The goal is simple: a chill, intimate space to vent, sanity-check ideas, and talk honestly about what’s working and what isn’t. Very much like this subreddit, but in real life. No pitching. No selling to each other.\n\nRequirements are intentionally minimal:\n\n* You’re working on something full time\n* You’re based in NYC and can meet in person\n\nYou don’t need funding, a fancy background, or credentials. Just an understanding of the grind and a genuine interest in building real connections.\n\nI’m aiming to do the first meetup in the second half of this month. If you’re interested, DM me and think of at least one other person you’d want to bring along.",
      "is_original_content": false,
      "link_flair_text": "services",
      "permalink": "https://reddit.com/r/startup/comments/1q21wrj/looking_to_start_a_small_inperson_founder_group/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "nxgloos",
          "author": "sichuanbutton",
          "text": "Interested",
          "score": 1,
          "created_utc": "2026-01-03 16:25:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxl51jn",
          "author": "Nj1er",
          "text": "Hey, I’m interested to get into it",
          "score": 1,
          "created_utc": "2026-01-04 07:06:50",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1q94xkq",
      "title": "How did startup founders and/or other members who had to go a year or more without income cope?",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1q94xkq/how_did_startup_founders_andor_other_members_who/",
      "author": "emaxwell14141414",
      "created_utc": "2026-01-10 14:07:06",
      "score": 6,
      "num_comments": 12,
      "upvote_ratio": 0.79,
      "text": "This is for those in startups as founders and/or early members who have been in a situation where they had to go for a year or more without having an income of any kind; i could be you and/or anyone you know of who have had to go for a year or more without bringing in an income of any kind.  It could be for any situation related to early stages or other reasons.\n\nIf you and/or anyone you know of has been in this situation, what sort of strategies, mechanisms and support did you and/or those you know of who were in this situation have?  How important were their relationships with relatives, friends and communities at large during this time?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1q94xkq/how_did_startup_founders_andor_other_members_who/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "nysfc2u",
          "author": "StoneCypher",
          "text": "most of us just hold a job while we build our startup.  some of us have savings from prior jobs, or rely on our spouses or families.",
          "score": 1,
          "created_utc": "2026-01-10 14:19:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nysfjhc",
          "author": "Maleficent-Fact8963",
          "text": "Do a side job untill you fill you have made it",
          "score": 1,
          "created_utc": "2026-01-10 14:20:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nytg7yg",
          "author": "RepresentativeBig401",
          "text": "I went through a similar period. I didn’t rely on the startup to pay me early. I took regular side jobs that weren’t related to what I was building, just to cover basics. Combined with savings, that took the pressure off the startup decisions. Life was simpler and more modest, but knowing it was temporary helped a lot. For me, the biggest factor wasn’t motivation or hustle, it was reducing stress so I could keep going without burning out.",
          "score": 1,
          "created_utc": "2026-01-10 17:25:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nyvpa9k",
          "author": "Radiant-Design-1002",
          "text": "Saved accordingly and multiplied money with stocks.",
          "score": 1,
          "created_utc": "2026-01-11 00:06:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nyy3y5x",
          "author": "N-Innov8",
          "text": "Upskill, offer freelance and consulting services, make courses on Udemy, flip items on eBay and Facebook marketplace and bring costs of living to the bare minimum.",
          "score": 1,
          "created_utc": "2026-01-11 09:42:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nyyww2l",
          "author": "Gritbound",
          "text": "I used all my savings + my wife’s nurse salary. Done it for 4 years now without any income.",
          "score": 1,
          "created_utc": "2026-01-11 13:40:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nyz2gub",
          "author": "AureliaAI",
          "text": "The honest truth, it sucks. Try to find a consultant job has work really well for me",
          "score": 1,
          "created_utc": "2026-01-11 14:13:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz1vomc",
          "author": "Willing-Training1020",
          "text": "most people who go a year or more without income don’t survive on grit alone. a lot of the people i know cut costs aggressively, keep some side income, and set a clear runway so it doesn’t drag on endlessly. they also had partners, family, and founder communities that helped them thru emotional or practical support that makes it possible. the biggest risk isn’t lack of hustle, it’s isolation and letting the situation go undefined.",
          "score": 1,
          "created_utc": "2026-01-11 22:11:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz425zi",
          "author": "Lip_Muse_Vip",
          "text": "I went almost 18 months with zero pay while launching my startup. Lived super lean, roommates helped with rent, and I relied on food delivery apps with discounts. Relationships with family were crucial.",
          "score": 1,
          "created_utc": "2026-01-12 05:13:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz4llpa",
          "author": "amacg",
          "text": "I do consulting on the side while building my apps. Do-able.",
          "score": 1,
          "created_utc": "2026-01-12 07:55:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nz5cwj2",
          "author": "general-calorie0",
          "text": "What worked for me was sticking to my current job until we received funding.",
          "score": 1,
          "created_utc": "2026-01-12 12:03:26",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1q6c0vy",
      "title": "Pivoting away from founder to explore product role - lessons from failed startup attempts",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1q6c0vy/pivoting_away_from_founder_to_explore_product/",
      "author": "Mediocre-Wallaby4932",
      "created_utc": "2026-01-07 10:34:29",
      "score": 5,
      "num_comments": 4,
      "upvote_ratio": 1.0,
      "text": "Hey folks,\n\n\n\nAfter years of trying to build my own thing, I'm exploring a pivot into product management - and I'd love to hear from people who've made similar transitions.\n\n\n\nMy Journey (The Unfiltered Version):\n\n\n\nStarted in sales (3 months), then ops, then marketing over several years. Founded a consulting agency at one point which was enlightening - you learn a LOT about business operations when you're running a small team. Spent time as a team lead in logistics, then took another shot at building a tech startup and ran with it for 6-8 months.\n\n\n\nThe Reality Check:\n\n\n\nI realized something important: the only part of entrepreneurship that actually kept me engaged was the product thinking. Figuring out what customers need, building solutions to problems, analyzing what works and what doesn't - that's what lit me up.\n\n\n\nEverything else? Revenue targets, fundraising, managing payroll, scaling infrastructure - it all felt like noise. When I stripped it down, the core skill I kept leaning on was product thinking. So why not actually focus on that?\n\n\n\nWhat Interests Me About PM:\n\n\n\n\\- I get to solve complex user problems without the overhead of running a company\n\n\\- I can use my founder perspective (understanding business metrics, unit economics, growth loops)\n\n\\- It's intellectually challenging in a way that doesn't require me to be an expert in everything\n\n\n\nThe Questions I'm Mulling Over:\n\n\n\n1. Is my \"failed entrepreneur\" label going to be a problem for hiring managers, or can I frame it as a strength?\n\n\n\n2. Should I target startup/scale-up environments where my background resonates, or would big tech be better for learning fundamentals?\n\n\n\n3. Realistically, what should I prioritize learning in the next month to make this transition feel less risky?\n\n\n\n4. Are there any resources or communities for people making this founder-to-PM shift?\n\n\n\nI'm not looking for validation, just genuine takes from people who've navigated similar changes. Happy to hear about mistakes I'm probably about to make.\n\n\n\nThanks!",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1q6c0vy/pivoting_away_from_founder_to_explore_product/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "ny6wcke",
          "author": "IdeasInProcess",
          "text": "hi mate founder here, with previous failures haha (also was a head of product for many years)\n\n**Is the \"failed entrepreneur\" label a problem?** It’s a massive strength for competence (Understanding P&L and cash flow), but a red flag for retention (you might get bored and leave). You should say something along the lines of \"I realised I love the craft of product more than the administration of business\"\n\n**Startups vs. Big Tech?** **Series A/B Startups.** I've had contracts with big Big Tech and its 90% stakeholder management and politics, its shit and boring haha. Startups need smart generalists who can execute without a manual, which is your background\n\n**What to prioritise learning?** **SQL and Data Visualisation.** I became the go to person for mixpanel, big query and rudderstack queries and it made me indispensable. If you can query your own data without bugging an engineer, you instantly become top 1% value.\n\n**Resources?** Lean start up is always good for MVP understanding, hooked by nir eyal, The Mom Test, continuous discovery habits is very good.",
          "score": 1,
          "created_utc": "2026-01-07 12:51:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "ny6xdlj",
              "author": "Mediocre-Wallaby4932",
              "text": "Thank you so much man!",
              "score": 2,
              "created_utc": "2026-01-07 12:57:52",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "ny85o9u",
          "author": "DbG925",
          "text": "There are tons of different flavors of product management and roles get \"blurred\" in small orgs and \"walled\" in others.  I don't want to write a book here, but there's usually a different skillset of person who's good at the more \"product owner\" vs \"product strategist\" vs \"product marketer\" vs \"project manager\" type of roles that typically get shoved into the product management bucket.  Take a look at the \"Pragmatic Marketing Framework\".\n\n[https://www.johngibbon.com/uploads/1/3/0/5/1305170/published/product-management-triad.jpg?1555804015](https://www.johngibbon.com/uploads/1/3/0/5/1305170/published/product-management-triad.jpg?1555804015)\n\n[https://www.youtube.com/watch?v=DzI8UpGtIZ8](https://www.youtube.com/watch?v=DzI8UpGtIZ8)\n\nVery simply, the smaller the company you join, the more of the boxes you'll be responsible for (including stuff you'll hate).  The larger the company, the fewer boxes that you'll own.",
          "score": 1,
          "created_utc": "2026-01-07 16:41:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "ny95240",
          "author": "chillermane",
          "text": "Whether or not you should do big tech depends on which work environment you will like more. Big tech is slower, safer, but you don’t get to do as much. Stakes are lower and you don’t have as much opportunity to innovate.\n\nStartups are less secure, a lot more work, but you get to take a lot more ownership in the project and there is more opportunity to do more things. You can get promoted a lot faster at a startup.",
          "score": 1,
          "created_utc": "2026-01-07 19:17:54",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1q81pui",
      "title": "Solo builder here — what founders usually get wrong when building MVPs",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1q81pui/solo_builder_here_what_founders_usually_get_wrong/",
      "author": "Evening_Acadia_6021",
      "created_utc": "2026-01-09 07:15:15",
      "score": 5,
      "num_comments": 24,
      "upvote_ratio": 0.86,
      "text": "I’m a solo builder who’s built multiple MVPs end-to-end.\n\nI’ve noticed a pattern:\nMost founders either overbuild too early or get stuck in Figma and never ship.\n\nFrom my experience, a real MVP should:\n– Solve one painful problem\n– Be deployable\n– Be ugly but usable\n– Collect real user feedback fast\n\nI’m curious:\nIf you’re a founder, what’s stopping you from shipping your MVP right now?\nTech? Time? Cost? Confidence?\n\nHappy to share how I usually approach MVP scope and tradeoffs.\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1q81pui/solo_builder_here_what_founders_usually_get_wrong/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "nyk74so",
          "author": "Jegan__Selvaraj",
          "text": "Great points! In my experience, the hardest part for many founders is resisting the urge to perfect everything before shipping. Even a small rough MVP teaches you more than weeks of planning. Focus on solving the core problem and learning from real users as fast as possible.",
          "score": 3,
          "created_utc": "2026-01-09 08:03:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "nyk7i76",
              "author": "Evening_Acadia_6021",
              "text": "So true, and honestly the same happened with me. \n\nFor one of my projects I put around 7 months to make it perfect. Then also users had some complaints. And had to fix. \n\nSo, there I learned. It's better to ship a MVP then keep it upgrading and not to ship",
              "score": 1,
              "created_utc": "2026-01-09 08:06:50",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nyknvdt",
          "author": "domid",
          "text": "the idea",
          "score": 1,
          "created_utc": "2026-01-09 10:35:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "nyko1vw",
              "author": "Evening_Acadia_6021",
              "text": "Can you please elaborate a bit.",
              "score": 1,
              "created_utc": "2026-01-09 10:37:20",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nyl7rif",
          "author": "Calm_Ambassador9932",
          "text": "This matches what I’ve seen too- MVPs fail more from hesitation than from missing features. Shipping something imperfect but usable creates learning you can’t get in Figma or docs. Curious to see which blocker shows up most for people: confidence or context-switching more than tech, in my experience.",
          "score": 1,
          "created_utc": "2026-01-09 13:03:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "nyl89sk",
              "author": "Evening_Acadia_6021",
              "text": "True. A good MVP which is addressing a pain point can get users\n\nSure once the product is tested we can make it a proper business. But initial user feedback on that MVP is very important to know if that product has a market fit.",
              "score": 1,
              "created_utc": "2026-01-09 13:06:52",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nylcfyr",
          "author": "IdeasInProcess",
          "text": "The biggest blocker is fear of rejection disguised as perfectionism. Founders hide inside Figma files because an unlaunched product cannot fail. I tell my team that if you are not embarrassed by v1 then you launched too late. You need to validate the pain point before you write a single line of production code.",
          "score": 1,
          "created_utc": "2026-01-09 13:31:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "nylcwat",
              "author": "Evening_Acadia_6021",
              "text": "Very well said. If you compare my product Zolly.dev right now as it was 3 months back. You will say both are completely different product. \n\nI even keep a dummy domain to launch the MVPs and see the attraction. \n\nIf the attraction is Good I start building it. If it is not I scrap it. \n\nWith Zolly.dev the early attraction was good. Built the product and launched the V2. \n\nGot 200+ users in first 7 days. No marketing campaign nothing.",
              "score": 1,
              "created_utc": "2026-01-09 13:33:37",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nyljsi9",
          "author": "thatdude391",
          "text": "Perfectionism is a startup killer. The idea though of a single product or solution business is dying. Businesses don’t want a new product that can solve an old issue. There is almost guaranteed to be a solution out there already. They want one solution for multiple issues so they can stop having 5000 different solutions.",
          "score": 1,
          "created_utc": "2026-01-09 14:10:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "nylkjvb",
              "author": "Evening_Acadia_6021",
              "text": "Well theoretically I can agree with you but practically I am not seeing this happening. \n\nIf that was the case then the market leader would have penetrated every vertical market and would have gained success.",
              "score": 1,
              "created_utc": "2026-01-09 14:14:09",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nylmr20",
                  "author": "thatdude391",
                  "text": "Not necessarily. A lot of companies get stuck or complacent. A lot of times leadership was changed not to add more features but to optimize profit. People that optimize profit and people that scale and grow are almost always polar opposites in how they run companies. A great example of this is toast in the restaurant industry. Clearly the undisputed market leader of point of sales for restaurants. Their product is decent but every time they add a new product it absolutely sucks. It gets caught up in corporate bureaucracy, and it is very clear that top level leadership does not care about adding new great features or service but only maximizing profits on existing customers. This is super common for companies that have gone public.",
                  "score": 1,
                  "created_utc": "2026-01-09 14:25:22",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nymknq3",
          "author": "Prestigious_Tea6110",
          "text": "This is so true. The \"ugly but usable\" part is key.",
          "score": 1,
          "created_utc": "2026-01-09 17:01:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nynw8q6",
          "author": "zenbusinesscommunity",
          "text": "Fear of judgment stops most people from shipping. They want it \"good enough\" before anyone sees it. Reality is, feedback from 10 real users beats internal polish every time. Ship something ugly that works, learn fast, iterate. Perfection is procrastination in disguise. Done beats perfect.",
          "score": 1,
          "created_utc": "2026-01-09 20:36:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "nyo3brg",
              "author": "Evening_Acadia_6021",
              "text": "Very well said. I also believe in this now. If you start running behind that glossy finish before shipping. Trust me you will waste your time rubbing the design all day.",
              "score": 1,
              "created_utc": "2026-01-09 21:09:29",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nyo3bab",
          "author": "Available-Memory-234",
          "text": "One thing I see a lot is founders treating the MVP as a product test only, instead of a *clarity test*.\n\nMany MVPs fail not because the idea is wrong, but because the problem framing, target user, or narrative isn’t tight enough for an outsider to instantly understand.\n\nThat lack of clarity usually shows up later again during fundraising and user acquisition, so catching it at the MVP stage saves a lot of pain.",
          "score": 1,
          "created_utc": "2026-01-09 21:09:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "nyo3pbq",
              "author": "Evening_Acadia_6021",
              "text": "True, and I have seen this happening with many founders. Mostly in the tech industry. \n\nThey want there V1 to be the most fancy and up-to-date product ever existed.",
              "score": 1,
              "created_utc": "2026-01-09 21:11:14",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nyoa257",
          "author": "Professional-Fly9960",
          "text": "Too complex, forgetting customer discovery",
          "score": 1,
          "created_utc": "2026-01-09 21:40:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nyp3ypg",
          "author": "Shichroron",
          "text": "They start building before lining up potential customers",
          "score": 1,
          "created_utc": "2026-01-10 00:11:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nyqcr2h",
          "author": "Jay_Builds_AI",
          "text": "Biggest blocker I see isn’t tech or cost. It’s *identity*.\n\nFounders secretly want the MVP to prove they’re “good builders.” So they over-polish, add features, redesign-anything to avoid exposing it to reality. Shipping means risking being wrong.\n\nReal MVPs feel uncomfortable because they test the idea, not your skills.",
          "score": 1,
          "created_utc": "2026-01-10 04:25:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nyu42vw",
          "author": "GuidanceNew1176",
          "text": "I totally agree with u! SPEED is what is actually important.\nIts been about 3 weeks now that i started building my very first app completely alone without much tech knowledge.. not easy at all but feel like with the current AI tools u can make it 100x faster to actually ship an MVP. \nI think im gonna finish with it soon, ( only need to fix a few more things now ) and start focusing on marketing, only organic first.. \nIf you’d have any advice for me, would appreciate it!🤝",
          "score": 1,
          "created_utc": "2026-01-10 19:16:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "nyu4kh5",
              "author": "Evening_Acadia_6021",
              "text": "Well you can try building with Zolly.dev   It's visual editor makes work even faster. \n\nAnd also use the premium models like Claude Sonnet 4.5 to get better results. \n\nYou can build and ship even more faster.",
              "score": 1,
              "created_utc": "2026-01-10 19:19:19",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nyu4z1u",
                  "author": "GuidanceNew1176",
                  "text": "Thank you man, will check them out for sure!",
                  "score": 1,
                  "created_utc": "2026-01-10 19:21:17",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1q04kv7",
      "title": "How To Hire?",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1q04kv7/how_to_hire/",
      "author": "demirb",
      "created_utc": "2025-12-31 05:08:33",
      "score": 5,
      "num_comments": 10,
      "upvote_ratio": 0.86,
      "text": "Hey founders,\n\nI realized I’m missing so much fundamental when I recently talked with another founder where she mentioned she has a clear vision and repeats it constantly throughout the JD, hiring funnel and onboarding. Not just with words but actual stories of how their product is changing lives. Making sure everyone always knows why the company exists. And explained to me how this process has been helping her recruitment. \n\nOfc she is operating all of this at an expert level and it’ll take someone like me easily a year of work to reach her level after learning her process in detail. \n\nWhat are other fundamentals that you have “mastered”?\n\nI have a team of 20 people and haven’t mastered any fundamentals yet. Looking to learn from your expertise. ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1q04kv7/how_to_hire/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "nwx5eo7",
          "author": "Cute-Stick-7215",
          "text": "One thing I’ve noticed is that “fundamentals” usually get framed as skills (vision, hiring, communication), but the real gap tends to be decision clarity.\n\nFounders who look advanced aren’t doing everything better, they’re clearer on:\n\t•\twhich decisions actually matter\n\t•\twhich ones can be delegated or ignored\n\t•\tand what “good enough” looks like week to week\n\nWithout that, even strong vision gets lost in day-to-day noise, especially with a 20-person team.\n\nOut of curiosity - where do you feel the most uncertainty right now: hiring decisions, prioritization, or alignment across the team?",
          "score": 1,
          "created_utc": "2025-12-31 14:43:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx0o0dw",
              "author": "demirb",
              "text": "I would say finding talent. Or maybe our expectation is too much?",
              "score": 1,
              "created_utc": "2026-01-01 02:18:06",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nx3cuyu",
                  "author": "Pretend_One_3860",
                  "text": "Where are you looking? What are your expectations? What have been the results of applicants received and interviews?",
                  "score": 1,
                  "created_utc": "2026-01-01 15:46:50",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwxur5x",
          "author": "WrongMix882",
          "text": "I’ll point out a big iceberg you’re seemingly not acknowledging here: stop with the romanticizing other firms. All businesses are hard and it’s human nature to not want to be vulnerable with others we want to respect us. You’re not getting the entire truth from this person. \n\nIronically, your being here and asking the question is itself a positive sign that you’re leading a learning culture. You could do a lot worse than Traction as a breadcrumb for how to install a management framework that aligns with your business plan, but more important is the attitude of being open and a lifelong learner.",
          "score": 1,
          "created_utc": "2025-12-31 16:52:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwy8i2u",
          "author": "Willing-Training1020",
          "text": "one thing i’ve learned is that fundamentals don’t have to be expert-level to work, they just have to be consistent. beyond vision, role clarity is huge—being explicit about what success looks like in the first 30–60 days prevents so many downstream issues. hiring for slope over pedigree also matters more than people think, and regular feedback loops keep small misalignments from becoming big ones. i work with founders on these exact hiring and team-building gaps at pearl talent, and it’s always the basics done well that move the needle.",
          "score": 1,
          "created_utc": "2025-12-31 18:00:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx28w3u",
          "author": "Reinstatement_Expert",
          "text": "One thing I'm learning: speed kills in hiring. Best candidates have multiple offers within days. If your process drags, you lose them.\nAlso, having a clear scorecard for each role helps. Otherwise you're just going off vibes.\nSide note - if your website doesn't clearly show what your company does and why it matters, candidates bounce before applying. I build sites that actually explain your vision clearly for $79-$200 if that's holding you back.",
          "score": 1,
          "created_utc": "2026-01-01 10:34:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx7cekq",
              "author": "demirb",
              "text": "https://colonist.io/careers\nDo you think its holding us back? If so where?\n\nNoted for speed. I’ll put systems in place so our speed gets back to being fast",
              "score": 1,
              "created_utc": "2026-01-02 04:59:22",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1q1bj2s",
      "title": "How do you guys approach marketing / growth?",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1q1bj2s/how_do_you_guys_approach_marketing_growth/",
      "author": "palexeev",
      "created_utc": "2026-01-01 18:44:27",
      "score": 5,
      "num_comments": 12,
      "upvote_ratio": 1.0,
      "text": "Happy new year everyone! I’ve been thinking a lot about how the cost of building businesses has effectively gone to zero and the fact that distribution and marketing are the only real remaining moats.\n\nI’ve spent the last decade of my career running growth marketing teams, and have had four successful exits. In order to give back to the next generation of builders , I started a YouTube channel where I conduct weekly interviews with some of the most successful founders and marketers in my network to tease out the strategies, tactics, and tools that power the growth of their businesses.\n\nI want to make sure that I am focused on creating the most useful and actionable content for Folks who are actively working on building their companies, so if you have any questions you’ve been pondering with regards to marketing or growth, feel free to drop them in the comments, and I will make sure to incorporate them into my interviews in order to create the most actionable and useful content 🫡",
      "is_original_content": false,
      "link_flair_text": "knowledge",
      "permalink": "https://reddit.com/r/startup/comments/1q1bj2s/how_do_you_guys_approach_marketing_growth/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "nx5s5na",
          "author": "isaaclhy13",
          "text": "Which channel has given you the highest CAC so far? I'm a founder too and ran growth teams for years, so distribution being the real moat is something I’ve struggled with. Try doubling down on content-led partnerships to tap ready audiences, that helps scale awareness without blowing budget, and run fast A B tests on one paid channel to find a repeatable CAC. I built SignalScouter to find Reddit posts where potential users ask for solutions and generate founder-style replies in real time which helps the distribution problem you mentioned; we saw 89 signups in 2 days and 10k+ views on posts in a few days. Would love feedback or to connect if you try it out, good luck!",
          "score": 1,
          "created_utc": "2026-01-01 23:18:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx6hj8t",
              "author": "palexeev",
              "text": "Loving all the folks building their own tools and totally agree with content lead partnerships!",
              "score": 1,
              "created_utc": "2026-01-02 01:44:55",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nxed943",
          "author": "Old-Farmer-1029",
          "text": "One question I keep coming back to as a builder:  \n*At what stage does “growth tactics” stop working and “distribution design” start mattering more?*\n\nA lot of early teams copy channels and playbooks that worked for others, but the real unlock seems to be when distribution is baked into the product or workflow itself, not bolted on later.\n\nI’d be especially curious to hear founders talk about the moment they realized “this channel scales” vs “this channel just looks good on dashboards.”",
          "score": 1,
          "created_utc": "2026-01-03 07:04:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxg4fiz",
              "author": "palexeev",
              "text": "The transitional moment between tactics and tried and true motion is a great suggestion! Will absolutely incorporate moving forward!",
              "score": 1,
              "created_utc": "2026-01-03 15:00:36",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nxhij57",
          "author": "IncubationStudio",
          "text": "Growth starts with trust, and trust is expensive. Building is cheap now. Belief is not. Before channels or tactics, I try to get clear on who it is really for and what problem they would miss if it disappeared. Without that, marketing just amplifies noise. Early growth for me looks like conversations, small experiments, and showing up consistently. When trust forms, channels become obvious. If it does not, it is usually a product or positioning issue, not a growth one.",
          "score": 1,
          "created_utc": "2026-01-03 18:56:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxhjzs8",
              "author": "palexeev",
              "text": "Love the focus on fundamentals. Tactics and channels are definitely secondary to nailing down your ideal ICP and ensuring you’re building the perfect solution! Any questions that you would love to hear the answers to from the most successful founders and marketers that I interview on my channel?",
              "score": 1,
              "created_utc": "2026-01-03 19:02:53",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nxpjr4x",
          "author": "Lip_Muse_Vip",
          "text": "Pick one channel, one ICP, one conversion goal. Ship weekly experiments, keep what moves activation or revenue, cut everything else.",
          "score": 1,
          "created_utc": "2026-01-04 22:31:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxplzro",
              "author": "palexeev",
              "text": "Great focused strategy! Any questions you think I should be asking world-class founders and marketers on my YouTube interview channel that would be most useful to the next generation of founders and builders?",
              "score": 1,
              "created_utc": "2026-01-04 22:42:22",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "ny10fj2",
          "author": "just_keith_",
          "text": "The problem was clear that I struggled with finding clients and leads for my work in 2025\n\nSo this time I built the workflow that fetches prospects and leads all over the Internet, in one app. And also does deep research on every prospect and business.\n\nBasically the tool itself was used to find it's own users..lmao.\n\n I used it to find 370 prospects in a few minutes, and I sent out 30-40 Emails, and surprisingly, wokeup with 16 paying users $5640 in 2 days and 7 of which are lead generation agencies...lol.\n\nThe outreach email template:\n--------\nSubject: Do you need more clients?\nBody: Hey {name}\nImagine a platform for that finds you leads and prospect from Google Maps, LinkedIn, X, Facebook, Reddit, G2, Yelp, and Craigslist all in one platform, any niche worldwide. All prospect info and contacts are give to you on a silver platter, all you have to do the outreach.\n\nhttps://tryventra.com\n---------\n\nThat's the email that worked for me, simple and precise.\n\nKey take away: The problem that you're solving has to be as clear as possible.",
          "score": 1,
          "created_utc": "2026-01-06 16:08:59",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1q9epac",
      "title": "I built a database full of validated problems and success stories scraped from Reddit that allows you to spot profitable niches and validate ideas.",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1q9epac/i_built_a_database_full_of_validated_problems_and/",
      "author": "namidaxr",
      "created_utc": "2026-01-10 20:29:21",
      "score": 4,
      "num_comments": 1,
      "upvote_ratio": 0.84,
      "text": "Hey everyone! I'm a young coder and I've been growing this app called [BigIdeasDB](https://bigideasdb.com/) which is a database full of validated problems. These problems are \"validated\" because they are scraped off of Reddit posts/comments that relate to people who experience different issues that are unsolved.\n\nThe problems that are scraped are not just found from random comments and posts, I use an AI Agent that follows an algorithm to check if the content from the posts/comments are potential problems that users may be facing that haven't been solved yet, and if this problem can be turned into real applications. These problems are then added to the database as they are already \"validated\" and need to be solved, as said by others.\n\nYou can also build your own problems pipeline with the same AI agent where you can get as many validated problems as you want by specifying your own subreddit and keywords. The problems are scraped from Reddit Posts/Comments that are from your chosen subreddit and include the keywords that you have specified, and these problems are then analyzed by AI and put in a database. Each problem in the database is then generated an idea that solves the given problem.\n\nI have also added another feature that allows you to explore a database of over 1800+ scraped success stories from Reddit posts with specific keywords from a chosen subreddit. Each success story that showcases a successful product gets analyzed to give you improvements so that you can make modifications and build off of an existing product to make it better in a specific aspect.\n\nIf you are a coder looking for new ideas, I think this will be really helpful to give you validated product ideas that already have users waiting to use that can make you a lot of money.\n\nBut of course, I am seeking advice on this, as there is always ways to improve! What can I do to improve this application?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1q9epac/i_built_a_database_full_of_validated_problems_and/",
      "domain": "self.startup",
      "is_self": true,
      "comments": []
    },
    {
      "id": "1q97396",
      "title": "Looking for a Cofounder experienced in the OFM Industry",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1q97396/looking_for_a_cofounder_experienced_in_the_ofm/",
      "author": "Appropriate_Day9479",
      "created_utc": "2026-01-10 15:36:12",
      "score": 4,
      "num_comments": 3,
      "upvote_ratio": 0.84,
      "text": "Hey everyone\n\nI’ve spent 3+ years working in the OnlyFans Management (OFM) industry, and during that time I’ve identified several pain points that agencies, freelancers, and models deal with daily. I’ve designed a novel product idea that tackles these problems in a new way — this is not another Infloww / CRM clone.\n\nAbout me:\n\n* 3+ years in OFM (agency side)\n* Strong technical background\n* Experienced in full-stack development, automations, and AI tools\n* Actively building and shipping products\n\nWho I’m looking for:  \nSomeone who has real experience in the OFM industry, such as:\n\n* Agency owner / operator\n* Chatter\n* VA / manager\n* Freelancer working with OF agencies\n\nYou don’t need to be technical, industry insight and hands-on experience matter most.\n\nIf this sounds interesting, DM me and I’ll happily pitch the idea 1-on-1.\n\n  \n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1q97396/looking_for_a_cofounder_experienced_in_the_ofm/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "nytjhag",
          "author": "hristijank",
          "text": "I will contact you as a chatter, worked with good quality models and looking for something new.",
          "score": 1,
          "created_utc": "2026-01-10 17:40:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nyvvmpb",
          "author": "hristijank",
          "text": "can you check dms?",
          "score": 1,
          "created_utc": "2026-01-11 00:39:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nyxpf5q",
          "author": "Shinpei-Ashio",
          "text": "I sent a dm",
          "score": 1,
          "created_utc": "2026-01-11 07:28:29",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1q0m6mm",
      "title": "Budget for administrative overhead or you WILL get screwed",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1q0m6mm/budget_for_administrative_overhead_or_you_will/",
      "author": "Particular_Scar6269",
      "created_utc": "2025-12-31 20:07:50",
      "score": 4,
      "num_comments": 5,
      "upvote_ratio": 1.0,
      "text": "You know what almost tanked our seed round? Not our burn rate. Not our metrics. Not product-market fit.\n\nA missed compliance filing in Delaware that we didn't even know existed.\n\nWe incorporated as a C-Corp 14 months ago. Delaware because that's what everyone does, right? Hired a lawyer for formation, got our docs, moved on to building product.\n\nFast forward to due diligence with our lead investor. Their legal team comes back: \"Your franchise tax is overdue and your status shows issues in the state system.\"\n\nWe scrambled. Paid penalties. Overnighted documents. Lost two weeks of momentum during a critical fundraising window because nobody on our founding team knew Delaware has specific annual requirements beyond just federal taxes.\n\nI wish someone had told us that incorporating is the easy part. Maintaining corporate compliance while you're trying to scale is the hard part.\n\nAnnual reports. Franchise taxes. Registered agent requirements. BOI reporting. Foreign qualification if you're operating in multiple states. It's death by a thousand administrative cuts and none of it is in the \"how to start a startup\" playbooks.\n\nWe ended up hiring [InCorp](https://www.incorp.com) as a registered agent to handle ongoing compliance after that \"disaster\". Should've done it from day one. The cost is negligible compared to what we almost lost.\n\nBudget for this. Put it in your financial model. It's not sexy but neither is explaining to investors why your corporate status is flagged during DD.\n\nAnyone else learn this lesson the hard way or were we just uniquely clueless?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1q0m6mm/budget_for_administrative_overhead_or_you_will/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "nwz1kyq",
          "author": "NotATurntable",
          "text": "Send lawyers, guns, and money - Zevon, and growth stage startup founders",
          "score": 3,
          "created_utc": "2025-12-31 20:31:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxrzxer",
              "author": "Particular_Scar6269",
              "text": "That lyric hits way too close 😂  \nIt really does feel like that at growth stage, you think you’re fighting product, market, and hiring, and then compliance blindsides you. None of this stuff feels “founder-worthy” until it almost kills a deal. Learned the hard way that boring admin is just another form of risk management.",
              "score": 1,
              "created_utc": "2026-01-05 06:54:01",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nx23b5p",
          "author": "perspectiveiskey",
          "text": "I use a registered agent for this. $50 dollars is their yearly fee. And they have a first time fee for the setup. It is dwarfed by the franchise tax itself.",
          "score": 3,
          "created_utc": "2026-01-01 09:34:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxrzz65",
              "author": "Particular_Scar6269",
              "text": "Exactly. That’s what still blows my mind. The registered agent fee is basically noise compared to the franchise tax, penalties, or losing investor trust during DD. In hindsight, this was one of those “cheap insurance” decisions we should’ve made day one instead of learning under pressure.",
              "score": 1,
              "created_utc": "2026-01-05 06:54:25",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwzjvad",
          "author": "monkey6",
          "text": "It’ll probably surprise you next year",
          "score": 1,
          "created_utc": "2025-12-31 22:11:24",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1q60h9m",
      "title": "I noticed all innovative startups get negative feedback on Reddit until they post a demo for the same product on Reddit",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1q60h9m/i_noticed_all_innovative_startups_get_negative/",
      "author": "SuperSaiyan1010",
      "created_utc": "2026-01-07 00:36:21",
      "score": 4,
      "num_comments": 9,
      "upvote_ratio": 0.67,
      "text": "From Cursor to Manus to things I've built, people initially are so critical (why need this GPT wrapper? I can just use OpenAI), but when they experience it, they realize how forward it is and the company propels forward\n\nNow I don't know about the big startups now but for my personal experience, whenever I built something kind of revolutionary / different, ppl on Reddit always shat on my idea (breh pls don't shit on this post) but then when I uploaded a demo on reddit, ppl liked it.\n\nLike literally it's such a weird loop and I think the few people who actually still decide to build something and then get it in front of people realize this\n\nThe Spanx founder I also heard her story in *How I Built This podcast* that she wasn't getting any funding until she took a VC into the women's bathroom and made her try Spanx and then upon the fellow woman seeing how much better it was for her booty, she invested. So it just feels like once it's in people's hands, it pops for revolutionary products?\n\nNow of course for existing startups that do an existing thing 10x better, like for example, someone makes a Rippling that is actually easy to use and doesn't have 10x sales call + enterprise pricing, those are no dip sherlock, take my money. But you face intense competiton and its all about execution.\n\nFor revolutionary, it's all about execution without certainty and then the marketing to bring people from where they are -> going forward\n\n  \n",
      "is_original_content": false,
      "link_flair_text": "knowledge",
      "permalink": "https://reddit.com/r/startup/comments/1q60h9m/i_noticed_all_innovative_startups_get_negative/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "ny53qza",
          "author": "Jay_Builds_AI",
          "text": "This is a classic pattern.\n\nReddit is skeptical of *claims* but receptive to *experience*. Novel ideas sound unnecessary in abstract because people anchor to current tools. A demo collapses that gap instantly. Until someone feels the delta, they’ll defend the status quo.\n\nRevolutionary products don’t win debates-they win moments of use.",
          "score": 3,
          "created_utc": "2026-01-07 04:11:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "ny5qvqu",
          "author": "yasonkh",
          "text": "I've had this happen at work repeatedly.  \n  \n**The Pattern**  \nstep1: Try to convince managers that we are missing an internal tool.  \nstep2: Managers shut you down saying you can copy+paste some text and it's just a couple clicks.  \nstep3: You build the tool and everyone loves it(most of the time).\n\n**The lesson**  \nPeople who are content with the problem you are solving, ALWAYS underestimate the value of your product. Resourceful and resilient people are the worst, because they are willing to endure much suffering before they even consider trying something new. Looking at the demo helps them recognize the amount of suffering they have endured.",
          "score": 2,
          "created_utc": "2026-01-07 07:00:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "nyghm6o",
              "author": "SuperSaiyan1010",
              "text": "Hm so look for lazy people / get it out to the average person?",
              "score": 1,
              "created_utc": "2026-01-08 19:43:23",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nyhke3p",
                  "author": "yasonkh",
                  "text": "Haha. I wouldn't look for lazy people, but I would look for people who are restless, unafraid, and value results above everything else. Maybe they are collectively called early adaptors?",
                  "score": 1,
                  "created_utc": "2026-01-08 22:35:28",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "ny68mgm",
          "author": "Minus_Medley",
          "text": "Ask for advice or feedback as to why, and they shout or swear at you for \"trying to deceive them.\" \n\nCan't understand why they're lurking in funding/start-up related subreddits if their PTSD won't let them experience any emotion other than spite.",
          "score": 1,
          "created_utc": "2026-01-07 09:42:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "ny6wjl1",
              "author": "Br00dPlatypus",
              "text": "Crabs in a bucket",
              "score": 1,
              "created_utc": "2026-01-07 12:52:39",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "ny7s8xm",
          "author": "Radiant-Design-1002",
          "text": "Don’t let Reddit people validate your idea. Get your product or mvp out fast and let your target audience decide.",
          "score": 1,
          "created_utc": "2026-01-07 15:41:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nydhqw3",
          "author": "software_engineer_22",
          "text": "Totally get this. Reddit loves to tear things apart until they can actually try it. Demos = instant credibility. It’s like, people don’t hate your idea, they just hate imagining it.",
          "score": 1,
          "created_utc": "2026-01-08 10:24:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nypft7u",
          "author": "AaronYang_tech",
          "text": "Where do you post demos without getting blasted for self promotion?",
          "score": 1,
          "created_utc": "2026-01-10 01:15:03",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1q8wivc",
      "title": "What's a good book to read with some fundamentals about starting a tech/SaaS company?",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1q8wivc/whats_a_good_book_to_read_with_some_fundamentals/",
      "author": "thegandhimancan",
      "created_utc": "2026-01-10 06:10:47",
      "score": 4,
      "num_comments": 7,
      "upvote_ratio": 0.84,
      "text": "Something that is still relevant in the age of AI. \n\nI've started doing a bunch of reading and finding some good material in books which I clip and keep. Books include:\n\n- The Lean Start-up\n- The Mom Test\n\nWhat are some others that you walked away thinking \"damn, that was valuable for me to adopt/implement..\" ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1q8wivc/whats_a_good_book_to_read_with_some_fundamentals/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "nyrclg4",
          "author": "MostPossibility4162",
          "text": "If you are building a product where 'network effects' matter, I'd recommend Andrew Chen's (GP, a16z) \"The Cold Start Problem\". It can give you insight into what GTM teams at Airbnb, Uber, Tinder etc. did to break into their first markets, new geographies etc.",
          "score": 2,
          "created_utc": "2026-01-10 09:17:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nyw4pav",
          "author": "marmoldomexx332",
          "text": "zero to one by peter thiel, amazing book",
          "score": 1,
          "created_utc": "2026-01-11 01:27:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nywmbqc",
          "author": "managememoney",
          "text": "Minimal viable product.   \nCold start problem.   \nPsychology of money (very important you don't lose track of your personal finances while building your startup)",
          "score": 1,
          "created_utc": "2026-01-11 03:02:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nyxu4rt",
          "author": "AdministrativeArt621",
          "text": "Practical and concrete book: Million Dollar Weekend: The Surprisingly Simple Way to Launch a 7-Figure Business in 48 Hours, by Noah Kagan",
          "score": 1,
          "created_utc": "2026-01-11 08:11:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nyythte",
          "author": "senatmade",
          "text": "High Growth Handbook - Elad Gil",
          "score": 1,
          "created_utc": "2026-01-11 13:18:28",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1q8iibc",
      "title": "Stop trying to be everywhere at once",
      "subreddit": "startup",
      "url": "/r/EntrepreneurRideAlong/comments/1q8ifir/stop_trying_to_be_everywhere_at_once/",
      "author": "gallantfarhan",
      "created_utc": "2026-01-09 19:57:25",
      "score": 3,
      "num_comments": 0,
      "upvote_ratio": 1.0,
      "text": "[External Link]",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1q8iibc/stop_trying_to_be_everywhere_at_once/",
      "domain": "",
      "is_self": false,
      "comments": []
    },
    {
      "id": "1q7poy0",
      "title": "The unglamorous truth about starting a startup: reputation infrastructure comes before product launch",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1q7poy0/the_unglamorous_truth_about_starting_a_startup/",
      "author": "robyromana",
      "created_utc": "2026-01-08 22:07:55",
      "score": 3,
      "num_comments": 4,
      "upvote_ratio": 1.0,
      "text": "Everyone obsesses over MVP, product-market fit, and pitch decks. Nobody talks about the boring groundwork that determines if your startup even gets a chance to fail. And when you launch without reputation infrastructure this happens:\n\nScenario 1: Bootstrap route\n\nYou build something cool. Tell people about it. They Google you. Find... nothing. Or worse, find random Reddit comments from 2019 where you were promoting scam crypto. They bounce. No trust = no customers.\n\nWord-of-mouth is great, but it's 1998 strategy. In 2025, your first impression isn't a handshake-it's page 1 of Google. If that page is empty or messy, you're starting at -10 instead of 0.\n\nExpect to spend $2-3k on basic SEO and online presence before you even think about customer acquisition. This isn't the website build cost-this is making sure when someone Googles \"\\[your name\\] startup\" they find something credible.\n\nScenario 2: Fundraising route\n\nThis is where it gets brutal. If you're raising money, investors will Google you. Every. Single. One. I've seen this pattern repeatedly like founder gets warm intro to investor, initial call goes well, then... silence. Why? Investor Googled them, found something questionable (old blog post, controversial tweet, negative forum thread), decided it's not worth the reputational risk. VCs don't usually tell you this happened. They just ghost or send a polite \"not the right fit\" email. You never know your online baggage killed the deal.\n\nThe pre-launch checklist nobody tells you:\n\n1. Google yourself. Seriously. Right now. What's on page 1? If it's nothing, that's a problem. If it's something negative, that's a bigger problem.\n2. Clean up or bury the bad stuff. Negative content from your past doesn't just disappear. You either need to suppress it (push it to page 2+ where nobody looks) or outweigh it with positive content. Some founders handle this themselves; others work with specialists like [snow monkey reputation company](https://snow-monkey.com/) who actually do PR stories, Wikipedia edits, suppression campaigns, even legal takedowns when possible.\n3. Build a portfolio that's Googleable. Investors want proof you can execute. GitHub contributions, Medium articles, speaking gigs, previous exits-anything that shows \"this person ships things.\" If your Google results show zero professional footprint, that's a red flag.\n4. Budget for it upfront. Reputation work isn't cheap ($2-5k for initial setup, ongoing if you're serious), but it's cheaper than losing a $500k seed round because an investor found your edgy tweets from college.\n\nWhen you can skip this? If you're 5 friends building something nights/weekends with no outside capital, fine-focus on product. But the moment you need outside validation (customers who don't know you, investors, press, partnerships), your online reputation becomes infrastructure, not vanity.\n\nIn startup world, we glorify \"just build and ship.\" But your ability to build means nothing if nobody trusts you enough to use it or fund it. Reputation isn't a nice-to-have. It's the foundation everything else sits on. First fix what Google shows. Then build the startup.\n\nHow many of you have actually Googled yourselves recently? What did you find",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1q7poy0/the_unglamorous_truth_about_starting_a_startup/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "nyweuyl",
          "author": "jpam9521",
          "text": "Never thought about this before. I’ve been heads-down building MVP and totally ignored my online footprint. Now I’m wondering how many investors silently passed.",
          "score": 1,
          "created_utc": "2026-01-11 02:22:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "nywsep4",
              "author": "robyromana",
              "text": "One investor literally told me “your LinkedIn doesn’t match your pitch.” That was a wake-up call. Reputation isn’t vanity, it’s your silent pitch deck.",
              "score": 1,
              "created_utc": "2026-01-11 03:37:21",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1q4wbuw",
      "title": "Incase anyone needs a reminder, here is what honest design should look like in 2026",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1q4wbuw/incase_anyone_needs_a_reminder_here_is_what/",
      "author": "usmannaeem",
      "created_utc": "2026-01-05 20:01:45",
      "score": 2,
      "num_comments": 2,
      "upvote_ratio": 0.67,
      "text": "Lets be better at designing better digital products and more responsible SaaS products in 2026.\n\n1. Offering users a transparent and very easy offboarding process.\n2. Offering messaging that promotes a users right to ownership of their data.\n3. Offering users the option to have a perpetual lifetime license.\n4. Facilitating users the option to pay for one year, 2 years and three years in advance, a sort of perpetual license.\n5. Offering users the right and option to consent and agree to the changed and updated privacy policy every time it is updated.\n6. Encouraging users the option and right to consent and agree to the changed and updated terms and conditions every time it is updated without dark patterns of UX.\n7. Offering users the option to download their data right up front using a simple, easy UX without burring this feature deep.\n8. Offering users the option to 1 click delete their account easily in user profile settings.\n9. Presenting users the option to show feeds chronologically and set it as a default not enforcing popular as default.\n10. Realizing that by targeting elderly users first with accessible, descriptive and open design you automatically target younger users.\n11. Making users comfortable by offering an experience that deliberately offers cognitive unloading and reduces dopamine effect.\n12. Welcoming users starting in 2026 and forward by totally ditching FOMO completely and encouraging a relief of missing out mindset lift. - enforcing out learnings from the Pandemic times.",
      "is_original_content": false,
      "link_flair_text": "business acumen",
      "permalink": "https://reddit.com/r/startup/comments/1q4wbuw/incase_anyone_needs_a_reminder_here_is_what/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "nxzenmy",
          "author": "devhisaria",
          "text": "Many of these points are great for users but directly contradict how most companies make money.",
          "score": 1,
          "created_utc": "2026-01-06 10:11:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "ny9zfiu",
              "author": "atticus-redfinch",
              "text": "Maybe, but they’re certainly helpful if your goal is to build a good product first and foremost",
              "score": 1,
              "created_utc": "2026-01-07 21:29:11",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1pycsqu",
      "title": "Here's how i plan to get clients in 2026 without spending a penny on marketing",
      "subreddit": "startup",
      "url": "https://www.reddit.com/r/startup/comments/1pycsqu/heres_how_i_plan_to_get_clients_in_2026_without/",
      "author": "Good_Cobbler_8630",
      "created_utc": "2025-12-29 04:40:18",
      "score": 2,
      "num_comments": 5,
      "upvote_ratio": 0.56,
      "text": "so im a marketing assistant for a company and few months ago i read a post here on reddit saying how they get clients from facebook ads of competitors, and it caught my attention.\n\nI’ve been doing this for our company now and we are getting a ton of appointments, completely for free.\n\nWe are 3 months into this and our strategy has evolved a lot so i just wanted to post it to help you guys out a bit, if you’re struggling to grow keep reading.\n\nheres that we did:\n\n1.listed down all of our competitors, for us we had approximately 300 competitors that came up on google.\n\n2.after I listed all of our competitors, i went to their website and checked how many of them had facebook page, approximately 180 of them had a facebook page\n\n3.after that i went to meta ads library and checked how many of them were actively running ads, there were 40 companies actively running ads.\n\n4.We then listed all the ad posts these companies were running on a google sheet, we had approximately 200 different ads being run.\n\n5.We then hired a virtual assistant from [u/offshorewolf](https://www.reddit.com/user/offshorewolf/) for $99/week full time (their general va, yes not a typo full time 8 hours a day assistant for $99/week)\n\nSo what this VA does is, she goes to all the 200 ads every single day, and dms people who have liked, commented in competitors ads.\n\nThese users were already interested in our competitors service meaning our reply rate from these people was really really high.\n\nThen the virtual assistant sends a personalized message, being honest always worked for us.\n\nHere’s what we sent:\n\nHey name, I noticed that you were checking COMPETITOR PAGE , we actually do YOUR CORE OFFER, often at much better PRICE OR RESULTS, do you want me to send more info?\n\nSince these people were already interested in a similar service that we offered, we got insane reply rate, 30-40%.\n\nThe VA then tracks all the dms sent in a google sheet, who was messageed, when, whether they replied or not.\n\nWe use a tagging system:\n\ninterested, not interested, ghosted, follow up again\n\nOnce a lead replies positively, the VA either continues the convo or books a time on our calendar for a discovery call (depending on each circumstance).\n\nThis method alone has brought in dozens of warm leads weekly, all for just $99 a week our cost is only the VA that we pay to manually go through all the ads, all day.\n\nMy COO and marketing director now thank me, even after 3 months they still say they cant believe I’m bringing leads for free using our competitors ad spent.\n\nI just wanted to share, as it really worked well for us. Happy to answer any questions or confusions.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/startup/comments/1pycsqu/heres_how_i_plan_to_get_clients_in_2026_without/",
      "domain": "self.startup",
      "is_self": true,
      "comments": [
        {
          "id": "nwts7bm",
          "author": "wookeydookey",
          "text": "This is an ad for that offshorewolf guy",
          "score": 3,
          "created_utc": "2025-12-31 00:10:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwmz8l8",
          "author": "Big-Swan-8039",
          "text": "Hi good cobbler,  # 4 ae the ad post and is the meta ads library link I assume. This does not make sense how your VA can see the ad because it is in the library. Unless I misunderstand. I am experimenting with it.",
          "score": 1,
          "created_utc": "2025-12-29 23:52:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx5wh6c",
          "author": "isaaclhy13",
          "text": "Which customer profile are you targeting in 2026? I'm a founder too and spent months trying to get zero-cost traction before I knew where to focus. Try hunting active threads and answering with real value to build trust, that gets convo and leads fast; also launch tiny free offers or beta invites to convert those curious users into early customers. I built SignalScouter, a founder-led Reddit lead gen and post engagement service that finds posts where people ask for solutions and crafts personalized founder-style replies, it helped me get 89 signups in 2 days and 10k+ post views, would love any feedback or love to connect if you try it, good luck.",
          "score": 1,
          "created_utc": "2026-01-01 23:42:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwi7a72",
          "author": "wakinbakon93",
          "text": "This is pretty genius, I'm trying to think how this whole process can be automated (I'm a software Dev)",
          "score": -1,
          "created_utc": "2025-12-29 06:46:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwj7klx",
              "author": "Khaliq_Khaliq",
              "text": "Same here, probably with a Facebook ads api",
              "score": 0,
              "created_utc": "2025-12-29 12:13:22",
              "is_submitter": false,
              "replies": []
            }
          ]
        }
      ]
    }
  ]
}