{
  "metadata": {
    "last_updated": "2026-01-01 20:29:57",
    "time_filter": "week",
    "subreddit": "ycombinator",
    "total_items": 17,
    "total_comments": 213,
    "file_size_bytes": 208888
  },
  "items": [
    {
      "id": "1pu7r2j",
      "title": "A year in review applying to YC: rejected twice after interviewing",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1pu7r2j/a_year_in_review_applying_to_yc_rejected_twice/",
      "author": "Longjumping_Ant_6991",
      "created_utc": "2025-12-23 23:00:04",
      "score": 177,
      "num_comments": 77,
      "upvote_ratio": 0.97,
      "text": "As the year is wrapping up, I figured I’d share my thoughts from applying to YC twice this year and getting rejected after the interview stage. \n\nMy co-founder and I are 25 years old, both have M.S. degrees from Ivy League schools and have worked at Series A-C startups as team leads within SWE and Quant Research. I argue that we fit the stereotypical YC founder profile. \n\nWe started building on our idea in April, 2025, after identifying a problem that both of us faced. By September, we had a demo of the consumer app ready. We got around 25 of our friends to try it out over a month and give feedback. Based on the feedback, we iterated core features and derived our solution for the problem we identified. \n\nWe applied on the last day to the F25 batch, and 3 days later, we received an invitation to interview with YC in-person. As you can imagine, our adrenaline was pumping and we felt like we were on top of the world. Imagine having built a prototype in a few months as a first time entrepreneur and now the most prestigious incubator flies you out to San Francisco for a few days. When I got accepted to my M.S., it felt somewhat casual. But this? Completely different. Personally, this meant the world to me.\n\nFast forward to after the interview. We felt it went fantastic. However, 2 days later, we got an email from YCombinator.. I am not going to cover the feedback, but that was a reality check. Getting rejected sucks and it is not something I am used to. I lost a few nights of sleep over it.\n\nThis made me realize something. Being an entrepreneur, owning your own product and outcomes, despite the highs and the lows, beats working on someone else's company in exchange for a salary. I had one of the best few days of my life in SF, interviewing with YC. Therefore, I decided to quit my job the next week. I couldn’t continue working on something else. How could I ever justify giving away my time for a salary I don’t really need (I had saved enough to sustain for a couple of years, yes, I am very fortunate that way). \n\nWe took the feedback from YC, and decided that if we implement everything by W26, then they have to accept us. Right? Along the way, we even rejected offers with similar terms from other VCs because we were, and still are, set that YCombinator is the best path forward for us.\n\nFast forward three months, our app was not live yet, but it was up and running for 50 test users. A fully functioning MVP, and we thought we had nailed messaging and our initial market. But something felt off. At this stage, I knew a bit more about what it means to create a startup. Enough to realize that we had unproven gaps, and 3 months at YC might not be enough to fill them before raising another round. \n\nWe remained optimistic but on the last day, 30 min after the deadline (depends if you are east or west coast I guess), we got rejected. But for some reason that felt like the right decision. Don’t get me wrong, I would love to be part of YC. However, we shouldn’t partner with YC until we can extract the maximum amount of value from the program. Ask yourself: “Why are you applying to YC?”. If your goal is to be part of YCombinator, then I don’t think you’re dreaming big enough. The goal is not YCombinator, the goal is building a company around a product that you care about. \n\nLooking back at this year, I wanted to reflect on what I have learnt and how grateful I am for the feedback and reality checks that YCombinator gave us.\n\nBeing a founder is difficult, and it comes with a rollercoaster of emotions. One day you are on-top of the world, the other you can’t sleep trying to figure out what you did wrong. It is a constant push and pull. And given that I am only 8 months in, I can’t even imagine what is to come. And you know what? There is no reason for me to even think about it. \n\nI fully believe in our product, my co-founder, and myself. Rejection is part of life. All you can do is take the feedback, drop your ego, and continue pushing. This is not easy, but if I have realized anything, it is 100% worth it. \n\nTo everyone out there struggling, keep going. You have not failed until you give up, and sometimes, rejection can be a good thing.\n\nEDIT:\nLots of ppl asking what we are building. I am not looking to promote but this is prob easier than answering comments and DMs: [krona](https://mykrona.com)",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1pu7r2j/a_year_in_review_applying_to_yc_rejected_twice/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "nvmkbmk",
          "author": "kelvis4587",
          "text": "Thank you for the encouragement!!",
          "score": 13,
          "created_utc": "2025-12-23 23:04:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvmlm3r",
              "author": "Longjumping_Ant_6991",
              "text": "Thank you for reading :)",
              "score": 6,
              "created_utc": "2025-12-23 23:12:32",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nvp0sj4",
          "author": "[deleted]",
          "text": "[deleted]",
          "score": 11,
          "created_utc": "2025-12-24 09:54:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvtjg8k",
              "author": "OFFLINEwade",
              "text": "Half of the posts in this sub are the same tone. Somewhere along the line a chunk of the startup world became convinced that raising funds is more important than building a bad ass business",
              "score": 8,
              "created_utc": "2025-12-25 03:40:28",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nvpzl69",
              "author": "SnooCats876",
              "text": "You’re very misinformed.\n\nYC has never been about the money. The specific deal they give isn’t the best economically - lots of VCs offer way better terms than them. YC is about:\n\n- the speed (during the 3 months program almost everybody who has done it has said “I have unlocked a new level of productivity, I didn’t even know I had in me”). YC is like going to a gym where everybody is a pro power lifter, you become one by osmosis (or at least improve a lot)\n\n- economically! I’ll contradict what I said above with further details. Sure you dilute yourself a bit with the $500k deal, but at the demo day you’re able to raise a big seed at 2-4x the standard market rates; thus at the end diluting yourself less with more money in the bank. + you get to do YC - an amazing deal!\n\n- the people! With your batchmates and partners, a sort of brotherhood / family is formed and people are truly helpful and supportive in trying to achieve something extremely hard. Not to mention that nearly everyone from the batchmates, alumni’s and partners are amongst the best experts, PhDs, programmers, scientists there are. Many of them have founded and led massive companies and have significant insight and influence - not too bad if you ask me…\n\n- the brand - obvious but it does help a lot when you’re a small scrappy startup nobody believes in and such an important institution backs you.\n\nAlso I’m not sure where you got the “aristocratic society” thing from. I can assure you that are people from all walks of life (I myself come from a normal family in Europe).",
              "score": 4,
              "created_utc": "2025-12-24 14:29:08",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nvq2i51",
                  "author": "DeepExcuse6509",
                  "text": "lmao u get paid for defending them? xdd",
                  "score": 3,
                  "created_utc": "2025-12-24 14:46:25",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nw34ss4",
                  "author": "opbmedia",
                  "text": "I agree with these points, and these points carry value to me, someone who doesn't need the money and has a product and means to launch it independently. But these are great values, thus I applied (and did not get selected).",
                  "score": 1,
                  "created_utc": "2025-12-26 21:23:46",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nvxzv5p",
              "author": "[deleted]",
              "text": "[deleted]",
              "score": 1,
              "created_utc": "2025-12-25 23:49:29",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nw34hsj",
              "author": "opbmedia",
              "text": "I applied to and was rejected for W26. Some part of my situation reads similar to OP's: I don't need to raise the money to build the product, I can and do bootstrap my startup. I have extensive domain and business expertise. I did not apply to any other accelerators, only YC because YC offers quite a bit of reduction on search cost to VCs. It is not necessary for success, but I do appreciate the value. We are about to publicly launch, and I am about to get on a seed round raise independently. I am surprised I didn't get a serious look, with a product, early traction, and expertise, but I also know there are a lot of good teams out there. You don't open any door you don't try, so I try. Now that YC moved on, I will move on as well, but applying has definitely gave me additional motivation to work. Cheers!",
              "score": 1,
              "created_utc": "2025-12-26 21:22:08",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nvqwuic",
              "author": "agm_93",
              "text": "Thanks for sharing this. The 6 month customer milestone is real - I've seen it play out with other founders too. Getting those first customers is honestly one of the hardest parts, especially when you're trying to validate if you're even building something people want.\n\nThe waitlist thing is interesting though. I've noticed a lot of founders treat waitlists as validation, but YC seems to want actual paying customers or at least people actively using the product. Makes sense since a waitlist is just interest, not proof you've solved a real problem.\n\nWhat were the biggest lessons you took away from going through the process twice? Always curious what changes between attempts.",
              "score": 0,
              "created_utc": "2025-12-24 17:31:11",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nvnmkno",
          "author": "a21angelx",
          "text": "Love this, a great reminder to us all building hard shit!💪🏼",
          "score": 5,
          "created_utc": "2025-12-24 02:59:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvn398k",
          "author": "passionforana",
          "text": "I know someone that just got accepted after applying 8 times. Use this as the opportunity to bootstrap, and when you do get accepted into YC you will be top 10% of accepted companies. There are particular VCs that invest into top YC companies over others. Being denied from YC isn’t necessarily a bad thing. Cluely got denied even though they had just gotten $16 million.",
          "score": 7,
          "created_utc": "2025-12-24 00:58:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvn3ywz",
              "author": "Longjumping_Ant_6991",
              "text": "Absolutely, I agree with you. You haven’t failed until you give up!\n\nWe are very excited to continue bootstrapping and building. I am finally full-time on the startup since a month back and we are hoping to launch early in Q1 26! :)\n\nThanks for sharing!",
              "score": 4,
              "created_utc": "2025-12-24 01:03:08",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nvngrzx",
          "author": "sigma_crusader",
          "text": "Much needed one, kinda facing the similar situation! Anyways wishing you the best...",
          "score": 3,
          "created_utc": "2025-12-24 02:23:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvnivin",
              "author": "Longjumping_Ant_6991",
              "text": "Thank you, and happy holidays. Wishing you all the best for 2026",
              "score": 2,
              "created_utc": "2025-12-24 02:36:35",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nvnlug9",
          "author": "Playful_Use7108",
          "text": "Any interest to be my ceo cofounder for spring 26?",
          "score": 3,
          "created_utc": "2025-12-24 02:54:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvpu9gn",
          "author": "Botr0_Llama",
          "text": "Focus on the product and yc would feel only as much pain as a churned user.\n\nDon’t grind to get into YC.",
          "score": 3,
          "created_utc": "2025-12-24 13:56:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvq8d6q",
              "author": "Longjumping_Ant_6991",
              "text": "100% agree!",
              "score": 1,
              "created_utc": "2025-12-24 15:19:28",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nvo4gno",
          "author": "Worth-Relation72",
          "text": "Thanks for your post, was feeling down for a few weeks because I thought I wouldn't get accepted in YC as an Indian and that would put my idea on immense disadvantage, but your post led me to think different and that anything is possible... Thanks",
          "score": 2,
          "created_utc": "2025-12-24 05:00:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvp6lfk",
              "author": "Longjumping_Ant_6991",
              "text": "That’s very nice of you, thank you! Wishing you all the best in 2026!",
              "score": 2,
              "created_utc": "2025-12-24 10:51:10",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nvp9exr",
                  "author": "Worth-Relation72",
                  "text": "Thanks OP, wishing the best for you too 😄",
                  "score": 1,
                  "created_utc": "2025-12-24 11:18:05",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nvqwgr2",
          "author": "nicolascoding",
          "text": "I can’t count the number of times I’ve been rejected, I can’t count the number of times I’ve been rejected from accelerators\n\nBut I can count the number of signatures, revenue,  and signups we have 😊 keep pushing. The education online is free",
          "score": 2,
          "created_utc": "2025-12-24 17:29:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvr3rml",
              "author": "Longjumping_Ant_6991",
              "text": "Very true! Thank you :)",
              "score": 1,
              "created_utc": "2025-12-24 18:08:33",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nvnrb2b",
          "author": "LeiraGotSkills",
          "text": "Thanks for sharing. This is a good story and insights..",
          "score": 1,
          "created_utc": "2025-12-24 03:30:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvo2470",
          "author": "Busy-Escape-9977",
          "text": "Awesome story. Thanks for sharing. Persistence for the win. Onward! 👊🏾",
          "score": 1,
          "created_utc": "2025-12-24 04:43:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvp6jeu",
              "author": "Longjumping_Ant_6991",
              "text": "Thank you for reading :)",
              "score": 1,
              "created_utc": "2025-12-24 10:50:37",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nvogj8x",
          "author": "Separate_Bid_8352",
          "text": "That was very inspiring!\nWe got rejected as well for W26. At first I was very disappointed, since we made great progress in the past few months, and even got a major design partner that helps us shape our product. \nBut then I realized that we should be in a better place before we get in, and we should push ourselves to the maximum before we try again. \nThank you for that!",
          "score": 1,
          "created_utc": "2025-12-24 06:39:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvp6h1x",
              "author": "Longjumping_Ant_6991",
              "text": "It’s def disappointing at first, but sounds like you got the right mentally and you are on the right track! \n\nKeep pushing, wishing you the best for 2026! \n\nThanks for reading! :)",
              "score": 2,
              "created_utc": "2025-12-24 10:49:59",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nvp6q69",
                  "author": "Separate_Bid_8352",
                  "text": "Thanks!! Wishing you a beast of 2026 as well! 💪🏼",
                  "score": 1,
                  "created_utc": "2025-12-24 10:52:25",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nvpzz73",
          "author": "SnooCats876",
          "text": "I got into W26. You have the right mindset, keep going and applying.",
          "score": 1,
          "created_utc": "2025-12-24 14:31:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvq0icv",
              "author": "Longjumping_Ant_6991",
              "text": "Thank you and congratulations! Wishing you all the best! :)",
              "score": 1,
              "created_utc": "2025-12-24 14:34:40",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nvr0eca",
          "author": "Wacko_97",
          "text": "Why no other accelerator/incubator? There's so many out there if you do want VC funding",
          "score": 1,
          "created_utc": "2025-12-24 17:50:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvr4app",
              "author": "Longjumping_Ant_6991",
              "text": "We are considering it but we think YC network and experience fits what we are looking for to scale a consumer product. But I’m sure there are other good alternatives out there like Berkley Skydeck, A16Z, startX, etc",
              "score": 2,
              "created_utc": "2025-12-24 18:11:21",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nvroz1p",
          "author": "BusinessStrategist",
          "text": "The world is changing at an increasingly fast pace. When there is turmoil and chaos then « prudent captains » seek out the « nearest safe port » and wait out the storm.",
          "score": 1,
          "created_utc": "2025-12-24 20:06:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvs48qp",
          "author": "FuxGrind",
          "text": "Keep building!",
          "score": 1,
          "created_utc": "2025-12-24 21:37:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvs9f0h",
              "author": "Longjumping_Ant_6991",
              "text": "Will do!",
              "score": 1,
              "created_utc": "2025-12-24 22:08:37",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nvs89lm",
          "author": "KrugerDunn",
          "text": "Your grit is impressive for someone with such a privileged easy path (not your life, just education/work as you acknowledged. You made smart choices and worked hard not taking that away). \n\nHonestly, MS from Ivy League is a red flag for me. Usually comes with a very specific way of thinking that I could find 1000 other founders with.\n\nHowever, you seem to still keep your mind open and ready to innovate and grind. If I were an investor I’d bet on you for sure, not even knowing the product.\n\nKeep going and best of luck! Let us know where we can follow your product (Discord?) id love to see how your adventure turns out.",
          "score": 1,
          "created_utc": "2025-12-24 22:01:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvsb2sh",
              "author": "Longjumping_Ant_6991",
              "text": "I appreciate the kind words, thank you! :) \n\nYeah, the stereotype is real but I def don’t define myself based on my academic records. I shared it to paint a picture, but I really don’t put much value in it. I have attended everything from California community college to Ivy League, and I have learnt that the school on your diploma is not what defines someone. I would never judge anyone based on their education.\n\nI appreciate the interest, we don’t have a Discord, but we plan to setup a subreddit early Q1 next year along with opening up our waitlist. \n\nIf you are interested in updates, best is to sign up for the waitlist on [krona](https://mykrona.com)! :)",
              "score": 1,
              "created_utc": "2025-12-24 22:19:07",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nw355uj",
                  "author": "KrugerDunn",
                  "text": "Wow looks really cool! Can't wait to see where it goes",
                  "score": 1,
                  "created_utc": "2025-12-26 21:25:43",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nvsfzde",
          "author": "Stayquixotic",
          "text": "tell us about your product!",
          "score": 1,
          "created_utc": "2025-12-24 22:50:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvsj8m4",
              "author": "Longjumping_Ant_6991",
              "text": "Appreciate the interest! \n\nI don’t want to turn this to a promotional post, but you can check it out here: [krona](https://mykrona.com)\n\nAny feedback appreciated :)",
              "score": 1,
              "created_utc": "2025-12-24 23:13:01",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nvstg9a",
          "author": "sammybrr",
          "text": "Entrepreneurship is a 24/7 demanding grind from hell, but I wouldn’t trade it for anything 😅\n\nKeep going. Merry Xmas!",
          "score": 1,
          "created_utc": "2025-12-25 00:24:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvsu8d1",
              "author": "Longjumping_Ant_6991",
              "text": "I 100% agree with you! \n\nMerry Christmas my friend!",
              "score": 2,
              "created_utc": "2025-12-25 00:29:39",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nvsux7n",
          "author": "Freigeist30",
          "text": "Bullshit… why would yc fly you out to interview? Even people in sf do it remotely",
          "score": 1,
          "created_utc": "2025-12-25 00:34:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvsvf3b",
              "author": "Longjumping_Ant_6991",
              "text": "You gonna have to ask them. But no, it is not BS. A quick google search and you can find more information.",
              "score": 1,
              "created_utc": "2025-12-25 00:37:57",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nvswijo",
                  "author": "Freigeist30",
                  "text": "Yeah from 2012. Proof or it never happened",
                  "score": 1,
                  "created_utc": "2025-12-25 00:45:42",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nvt9qm3",
          "author": "jacobluanjohnston",
          "text": "21st century man experiences rejection for the first time",
          "score": 1,
          "created_utc": "2025-12-25 02:25:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvtnd1q",
          "author": "Suitable-Sink6672",
          "text": "Hey congrats on your success! May I ask how you were able to meet your cofounder and how you knew they would be the right one?",
          "score": 1,
          "created_utc": "2025-12-25 04:11:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvvsz2h",
              "author": "Longjumping_Ant_6991",
              "text": "Thank you!\n\nWe known each other since high school, which helps. But in general we have a lot of ideas in common, share similar values, similar outlook on life, and we complement each other well despite both being technical.",
              "score": 1,
              "created_utc": "2025-12-25 15:49:48",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nvvmga2",
          "author": "bgbgbg28",
          "text": "Thank you for this! Mostly best things are shaping its final version after the failures, and you are also on the right track. Good luck!",
          "score": 1,
          "created_utc": "2025-12-25 15:08:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvvoi83",
              "author": "Longjumping_Ant_6991",
              "text": "Thank you, and I def agree! \n\nBest of luck and merry Christmas :)",
              "score": 1,
              "created_utc": "2025-12-25 15:21:47",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nvx2uig",
          "author": "GoatedOnes",
          "text": "25? Over the hill. Might as well search for a retirement home",
          "score": 1,
          "created_utc": "2025-12-25 20:22:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvx4fca",
              "author": "Longjumping_Ant_6991",
              "text": "I know.. back is starting to hurt tbh not sure it is worth continuing",
              "score": 2,
              "created_utc": "2025-12-25 20:31:50",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nvxfs2m",
          "author": "timstathan",
          "text": "Looks like the actual lesson was in the application process…",
          "score": 1,
          "created_utc": "2025-12-25 21:42:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw103fv",
          "author": "Rude_Passage4205",
          "text": "Thanks for sharing!",
          "score": 1,
          "created_utc": "2025-12-26 14:26:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "nw10bof",
              "author": "Longjumping_Ant_6991",
              "text": "Thank you for reading!",
              "score": 1,
              "created_utc": "2025-12-26 14:28:26",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nw1eiwa",
          "author": "PhilosophyOdd3929",
          "text": "Honestly, you haven’t mentioned two important things in your post- what’s the product and what’s the feedback. This would have made your post a lot more meaningful and relevant.",
          "score": 1,
          "created_utc": "2025-12-26 15:51:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "nw1l2yx",
              "author": "Longjumping_Ant_6991",
              "text": "Yeah, I hear you. I am not looking to promote or get feedback. Just wanted to share. \n\nIf you are interested in the product, feel free to check it out [krona](https://mykrona.com)",
              "score": 1,
              "created_utc": "2025-12-26 16:26:40",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nw7d1m6",
          "author": "Simonexplorer",
          "text": "I thought YC accepted applicants that are just in the final stages of idea stage. At least that's what it sounds like in some of their YouTube videos. Good luck OP, you've got the right attitude. Let's do this!!",
          "score": 1,
          "created_utc": "2025-12-27 15:40:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "nw7du4q",
              "author": "Longjumping_Ant_6991",
              "text": "Thank you!\n\nI think they accept companies in any stage really from my understanding. If anything, we might be early compared to the competition.",
              "score": 1,
              "created_utc": "2025-12-27 15:44:06",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nw7v6sb",
          "author": "Fabulous-Reaction-43",
          "text": "I’ve applied two years in a row with no interview , You got an interview ! Apply again!! Keep going.",
          "score": 1,
          "created_utc": "2025-12-27 17:11:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "nw7w8jl",
              "author": "Longjumping_Ant_6991",
              "text": "Thank you! We will keep going for sure!\n\nBest of luck to you in 2026!",
              "score": 1,
              "created_utc": "2025-12-27 17:17:08",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nw7xzzk",
          "author": "stardex_sanket",
          "text": "It's not uncommon for founders to get in after multiple times. We did it on our third try, and I know plenty others who had to try multiple times. I always viewed the interviews as an opportunity to pressure test our thinking from legit entrepreneurs. Feedback from our first interview was actually very helpful to get us on the right path.",
          "score": 1,
          "created_utc": "2025-12-27 17:26:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "nw7ycrh",
              "author": "Longjumping_Ant_6991",
              "text": "Thanks for the input!\n\nAnd yes, the feedback felt increasingly genuine and has def helped us get on the right track. The 10min interview format was a lot of fun as well! Looking forward to doing it again if I get the opportunity :)",
              "score": 1,
              "created_utc": "2025-12-27 17:27:58",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwbtmqb",
          "author": "Great-Raspberry5468",
          "text": "Garry said in lightcone podcast that most Startup Founders try to please VCs, but instead they should please their Users.",
          "score": 1,
          "created_utc": "2025-12-28 07:13:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwcseo0",
          "author": "Stardust_Evi",
          "text": "Hey, I think your app is awesome. I was just asking my husband to find a similar app for our personal use. You just don’t have my bank listed, otherwise I would have given it a try (US based)",
          "score": 1,
          "created_utc": "2025-12-28 12:39:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwdabm4",
              "author": "Longjumping_Ant_6991",
              "text": "Thank you, that means a lot!\n\nWe support over 12,000 institutions in the U.S. and are planning to add more. Here is a link to see if your bank is supported: https://plaid.com/docs/institutions/ \n\nIf not supported let me know and I’ll add it to the roadmap!\n\nWe haven’t launched yet, but if you want to get early free access, please sign up on the waitlist at [krona](https://mykrona.com) :)\n\nWishing you two the best for 2026!",
              "score": 1,
              "created_utc": "2025-12-28 14:40:09",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwnihhk",
          "author": "ForcaBarca1899",
          "text": "Looks cool. Just requested access.",
          "score": 1,
          "created_utc": "2025-12-30 01:38:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwnjmbw",
              "author": "Longjumping_Ant_6991",
              "text": "Thank you, I appreciate it! Will do our best to get your access early Q1!",
              "score": 2,
              "created_utc": "2025-12-30 01:44:56",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwnl07x",
                  "author": "ForcaBarca1899",
                  "text": "Sent dm.",
                  "score": 1,
                  "created_utc": "2025-12-30 01:52:31",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwpd9rl",
          "author": "Forward_Job_2790",
          "text": "I'm inspired and at the same time inspired as a Founder,thank you!",
          "score": 1,
          "created_utc": "2025-12-30 09:32:18",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pzag2h",
      "title": "Andrej Karpathy's tweet... applied to founders",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1pzag2h/andrej_karpathys_tweet_applied_to_founders/",
      "author": "ImaginationInFocus",
      "created_utc": "2025-12-30 06:10:49",
      "score": 88,
      "num_comments": 30,
      "upvote_ratio": 0.93,
      "text": "Andrej Karpathy's [recent tweet](https://x.com/karpathy/status/2004607146781278521?s=20) got a lot of attention because he said that even he feels behind in terms of adopting AI. He suggest there is a 10x productivity gain he could obtain, by combining new AI capabilities in his coding process but points out the challenge in wiring the pieces together effectively.\n\n  \nDoes this concept resonate for other founders in this group?\n\n* What AI are you using to be more efficient?\n* What do you see as the barriers to perfecting your setup? ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1pzag2h/andrej_karpathys_tweet_applied_to_founders/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "nwovfvl",
          "author": "Different-Bridge5507",
          "text": "I feel a paralysis at times trying to figure out what the best way to tackle a problem is, and which AI tools should I be using. \n\nAdmittedly on occasion I will spend more time attempting to use AI to accomplish a problem than doing it manually, but that knowledge compounds and makes every future related task exponentially faster",
          "score": 33,
          "created_utc": "2025-12-30 06:48:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwr6mec",
              "author": "ImaginationInFocus",
              "text": "Relatable. I need to have a certain amount of activation energy to decide to apply AI to do some job for me. Then, I go in the automation process knowing that there's a chance I won't be happy with the final solution and will continue to need to do it manually. But I do enjoy the tinkering... and when it works, it's great just like writing code that works.",
              "score": 1,
              "created_utc": "2025-12-30 16:36:30",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwp2vjo",
          "author": "Bayka",
          "text": "Honestly, AI was a big unlock for me: I am a founder, used to be a developer a long time ago, but then transitioned to CEO/product mgmt role. I used to code a little, but nothing crazy.\n\nSo, LLMs really got me back into coding: the turnaround time from idea to a built prototype is astronomical, I build prototypes to close deals since showing how smth works is so much better than talking or waiting for your product designer to prepare a nice looking figma prototype.\n\nBUT in the last 2 months I started systematically automating every piece of my daily routine: content management, product analytics, customer interviews (well, some part of it tbh), looking for new UX ideas. And sales of course, every part of admin/research work\n\nSo really pumped and confident about my productivity and our chances of success (somehow unexpectedly)",
          "score": 24,
          "created_utc": "2025-12-30 07:55:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwpo6h5",
              "author": "Westernleaning",
              "text": "How did you automate things like content management, product analytics and sales? What are you using? And how did you go about learning/rolling out automations for all that?",
              "score": 5,
              "created_utc": "2025-12-30 11:11:59",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nwpqllw",
                  "author": "Bayka",
                  "text": "1) analytics - connected postgres and bigquery to claude code; asking it to fetch and interpret data, evaluate experiments; it then spits out a pdf report I share with the team before the call\n\n2) content management - this is multilayered, 4 layers:\n- inspiration: connected to reddit/x/LI, searching posts with specific keywords + built a simple “inbox” bot in Telegram for random ideas, links, etc.\n- writing: i am writing drafts (based on inbox items) and then discussing it with CC with an access to my zettelkasten\n- zettelkasten: recurring job of atomizing my content into idea notes with cross references.\n- engagement tracking and analytics: measuring key engagement metrics and suggesting what to write about\n\nI hope it helps",
                  "score": 15,
                  "created_utc": "2025-12-30 11:33:09",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nwru3e6",
              "author": "Silentreactor",
              "text": "Thanks for sharing. Where do you specialize in and how much experience do you have? Also, how much do you spend monthly on tools?\nThanks",
              "score": 1,
              "created_utc": "2025-12-30 18:25:23",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nwshqxr",
                  "author": "Bayka",
                  "text": "Why? I mean - please explain why is relevant? Trying to set up a frame",
                  "score": 1,
                  "created_utc": "2025-12-30 20:17:01",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nwsztlb",
              "author": "Glittering-Fig-9252",
              "text": "What part of your customer interviews have you automated",
              "score": 1,
              "created_utc": "2025-12-30 21:43:03",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nwttmv5",
                  "author": "Bayka",
                  "text": "built an interviewer bot (similar to what Anthropic did with their Interviewer) and surveyed 120 people for instance, processed results with LLM; now inviting some of them for a deeper human-2-human interview",
                  "score": 1,
                  "created_utc": "2025-12-31 00:18:05",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwp6og2",
          "author": "TinyDebate7541",
          "text": "Honestly I find AI stuff overwhelming. A few things come naturally (asking chatgpt) but now that everyone writes stuff like \"oh I build 100 AI agents and then they do replace my CMS for like 260 bucks\" wtf\n\nI mean seriously - which 100 ai agents and how the hell do I control this stuff. I can hardly control Ricardo who sits literally next to me in the office.\n\nSimilarly with coding. It´s all fancy words and I think some are just invented by a 5 year old (what is Kiro). But yes it's the future. Thiel said it. Masayoshi is betting on it. So I will shut up, fire Ricardo and continue building agents.",
          "score": 7,
          "created_utc": "2025-12-30 08:30:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwr1f8l",
          "author": "_dremnik",
          "text": "i think he's just drinking too much of the twitter koolaid personally. 10x is a big exaggeration unless you have a very parallellizable workflow (which perhaps he does, i mean you can do many training runs in parallel so maybe his work is an exception). \n\ni actually wrote a blog about this that was motivated by the tweet as an antidote to all the twitter hype which has gotten wildly out of hand imo:\n\n[https://dremnik.substack.com/p/you-cant-scale-clarity](https://dremnik.substack.com/p/you-cant-scale-clarity)",
          "score": 7,
          "created_utc": "2025-12-30 16:12:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwswmyp",
              "author": "Responsible-File-582",
              "text": "interesting read ill have to take a look later to gather my thoughts very positive",
              "score": 2,
              "created_utc": "2025-12-30 21:27:58",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nwosap1",
          "author": "aviboy2006",
          "text": "I can't say efficient but using AI tool research made easy to do market research or existing product analysis. Its fasten process of moving ahead. I used ChatGPT, Perpexity do research and UX pilot for UX prototype, Cursor and Kiro for Coding work, CodeRabbit for PR review with human intervention, Captions for video editing and grabbing shorts from long form video. NotebookLLM for summarised video.",
          "score": 7,
          "created_utc": "2025-12-30 06:22:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwq4d82",
          "author": "kd_stackstudio",
          "text": "I have > 10 yoe as a software engineer, modest B2B SaaS with 3 customers so far. \n\nI talk to ChatGPT about architecture, infrastructure and algorithms. I also talk to perplexity about different products/OSS solutions and market research tasks. \n\nCursor for coding. I use auto a lot but call in sonnet and opus for planning and tasks that auto spins out on.\n\nBecause my codebase is modular with clear separation of concerns there is very little that cannot be generated by AI and iterated on very quickly. \n\nThe major bottleneck is cost. Cursor’s auto has a habit of ignoring the rules I’ve set up and patterns that exist in the codebase. We often rewrite stuff a few times before it’s done.",
          "score": 2,
          "created_utc": "2025-12-30 13:15:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwtggm9",
          "author": "Available-Claim2445",
          "text": "I don't think anyone is actually sure how to leverage AI to its full capability. But my approach with productivity is to stick with tools that legitimately save me measurable time and automate or streamline long tasks.   \nA couple years back I was barely getting into programming just because I thought AI was cool. I wanted to learn more about it and I knew nothing. After completing Harvard's CS50, I looked at programming with AI as a managerial task rather than a \"do-it-all for me\". Rather than giving Claude or ChatGPT a basic task of \"build this app\", I say something like \"build me this feature for A, we are working on a B structure, for context we have C, and items-to-complete include X, Y, and Z\". When things go wrong, I know where to look and (usually) how because of the narrow scope I place. This saves me (personally) days worth of time as I'm not a great programmer but I understand how to manage work deeply.   \n  \nAs an automations specialist, I feel like I have some advantage because I have experience in automating tasks for my clients so I have more intuition to know when something is worth automating or building vs not. \n\nYou talk about perfecting your setup but in reality there is no \"perfect\" setup. There is no perfect automation or system. But as long as it streamlines the task at least 80% AND its repeatable, then its value can be compounded going into the future.   \n  \nAnd one hack I constantly remind myself to do: Create a literal to-do list every single day. When one task is completed move onto the next and don't stop until the list is finished, then rinse-and-repeat the next day/week. Personally I get distracted very easily and when I'm orchestrating several different tools and completing different tasks, I find that I can very easily become lost in my own work. Keeping a list of to-do's reminds me of where I am and what has been accomplished for the day or week, and more importantly what tools I used (this allows me to see which tools provide the most value to me).",
          "score": 2,
          "created_utc": "2025-12-30 23:05:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwqcpxz",
          "author": "kawasakikas",
          "text": "I honestly believe there is no technology moat anymore. I really built something special that could have become a 7- to 8-figure ARR company in the pre-AI era. I am building completely stealth and am thinking of never going public. Every “killer” feature that I have been building can be rebuilt and reverse-engineered lightning-fast with the use of AI.",
          "score": 2,
          "created_utc": "2025-12-30 14:05:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwq07k8",
          "author": "RockittHQ",
          "text": "I dont know about the others - but there is a point beyond which for my practical purposes i dont need to be up to speed to the latest second. Whereas I am, it is more a hobby and my personal interest and i am very clear as to when me \"staying updated\" is necessary vs. procrastination.\n\nBeyond a certain point - even a 3 month old LLM / approach etc works well for my needs and i don't need to be updating things within 5 mins of it releasing. \n\nI take the \"best ai\" discussions in these cases to be very much like a \"what is the best programming language\" - the right answer is whatever gets you deploying and getting revenue quickest. And if that means you're using PHP but making money - well done!",
          "score": 1,
          "created_utc": "2025-12-30 12:47:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwqqt8d",
          "author": "QuirkyTrust7174",
          "text": "I don’t think the challenge is wiring the pieces effectively. Andrej karpathy is brilliant and I follow his GitHub a lot. If anyone can do it it’s him and if he is struggling to the answer is that it’s kinda useless to try and spend time figuring out the right ai tool because they all suck in the same way.",
          "score": 1,
          "created_utc": "2025-12-30 15:21:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwrjw8p",
          "author": "darkprime140",
          "text": "It's surprising how most people I know use Claude code and other tools without looking into how to optimize them. This for example is a helpful article written by the founder of CC on best practices that I found super useful. Gave me lots of ideas on new things I didn't think were possible before. I'm sure there's similar stuff out there for Cursor/Antigravity/Codex/etc. \n\n[https://www.anthropic.com/engineering/claude-code-best-practices](https://www.anthropic.com/engineering/claude-code-best-practices)",
          "score": 1,
          "created_utc": "2025-12-30 17:38:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwu416d",
          "author": "SpecialSea2683",
          "text": "I used to do lots of coding through open source platforms for robotics engineering in grad school. Then started my own company and now use llms for not only robotics engineering but full-stack software development. I didn’t know much about frontend and backend programming. Now I prompt AI to help with that. I’m a solo-founder in SF working on an MVP.\n\ncopilot with Anthropic api calls and sometimes gemini 3 pro works out the best for me.\n\nThe barrier is that it still needs lots of supervision. So many of those api calls and generated codes go to trash (good for the api providers). Also as someone who hasn’t shipped production ready sw before, i find it very unsafe to ship. There are often security risks that you might bw unaware of.",
          "score": 1,
          "created_utc": "2025-12-31 01:15:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwvkc4v",
          "author": "BradleyX",
          "text": "Resonates. Doesn’t work in real businesses. Switching costs too high. Constantly repeating learning curve. Change management costs too high. People need consistency. You solve ten problems this month with AI, are you really going to retool constantly with every new innovation.",
          "score": 1,
          "created_utc": "2025-12-31 07:01:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx4ulu3",
          "author": "Disastrous-Target813",
          "text": "I use chatgpt often to brainstorm parts of my ideas, as well as check if there are alternatives to my proposed solutions for problems im trying to solve in my code. \nAs for using AI in my product, currently not planning to but have a future plan to add some features. \nIm kind of against the idea of shoving ai into everything. \n\nBut yeah with all the hype bs we here about ai , it does cause me to feel behind, but i try purge the fomo urges with learning. \n\nThe more we use ai to do tasks the less we actually learn. So my approach is use ai to explain or brainstorm approaches and just do the myself (at least for the first several attempts) after im able to do it confidently i start to slow speed up with ai usage most just copilot rather than agents.",
          "score": 1,
          "created_utc": "2026-01-01 20:20:59",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pzm3f6",
      "title": "Anyone else feel that the bar for MVP Quality is really high compared to before?",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1pzm3f6/anyone_else_feel_that_the_bar_for_mvp_quality_is/",
      "author": "foldedlikeaasiansir",
      "created_utc": "2025-12-30 16:12:27",
      "score": 56,
      "num_comments": 39,
      "upvote_ratio": 0.98,
      "text": "I always come across Airbnb or DoorDash MVPs on Reddit or Twitter but now it seems that all of start up MVPs are super polished with minimal gaps in the features.\n\nI guess majority of it is through Advancement of AI but at the same time seems daunting as an aspiring founder.\n\nEdit: Maybe Airbnb was a bad example 😅 but general premise still stand",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1pzm3f6/anyone_else_feel_that_the_bar_for_mvp_quality_is/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "nwr2iul",
          "author": "Golandia",
          "text": "Well you can create more with less effort now. That’s with AI and so many SaaS vendors targeting founders. So yes, mvps will look better and have more features for the same investment AirBnB made forever ago. ",
          "score": 30,
          "created_utc": "2025-12-30 16:17:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "nws1q00",
              "author": "Martin-Giorgetti",
              "text": "True! Another thing that happens is that since it's easier and cheaper to build an MVP, the MVP doesn't end up being so minimal... meaning, extra features are added... after all, it's \"free\" to write one more line in the prompt.\n\nThe key is WHAT to build in the MVP, and this depends on clearly understanding WHY we're building it, what the main pain point is, and what our MVP, with its single, minimal feature, should solve.",
              "score": 3,
              "created_utc": "2025-12-30 19:00:25",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nwrlai2",
          "author": "Martin-Giorgetti",
          "text": "Yes, AI has raised the bar for creating MVPs. But AI has only changed HOW we build MVPs, not WHY we build them. I think that's where you can make a difference.\n\nIf an MVP is flashier but doesn't solve the problem as well as a \"less attractive\" one, it won't win in the market.",
          "score": 13,
          "created_utc": "2025-12-30 17:45:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwrp6pa",
              "author": "foldedlikeaasiansir",
              "text": "That’s a great point. The Why will always be the differentiator\n\nEdit: also -> always",
              "score": 2,
              "created_utc": "2025-12-30 18:02:56",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwrxlha",
                  "author": "Martin-Giorgetti",
                  "text": "Exactly. The WHY is where we make the difference. \n\nAnd to find that WHY, there's nothing better than talking to real potential customers. \n\nNo AI, no \"synthetic personas.\" We'll just get more of the same results as others who use Chatgpt.",
                  "score": 2,
                  "created_utc": "2025-12-30 18:41:27",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwrzb5z",
          "author": "ramprass",
          "text": "Just because we can ship things quickly doesn’t mean we can build great products quickly. \n\nIt requires a deep understanding of the customer and a great product sense. \n\nUnless the founders are very good at both, no tool can magically solve this one. \n\nA customer has never cared about a MVP - they always want a reasonable level of polish to exist even pre-AI - for some apps like in finance it’s always important to build trust. \n\nWe are in a different game- The ones to win are the ones who can learn fast and then move fast.",
          "score": 5,
          "created_utc": "2025-12-30 18:49:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwrtudx",
          "author": "worldprowler",
          "text": "Yes. Not only is the bar higher, but all the startups I'm reviewing now have the same vibe-coded interface with no differentiation in engineering or product. This means I'm now prioritizing deep tech (biotech, energy, materials science) or super-deep domain expertise. Having a web app as a value prop is as differentiated as having a website, rare in 1994, a minimum requirement in 2004.\n\nSource: I'm a pre-seed investor",
          "score": 3,
          "created_utc": "2025-12-30 18:24:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwruzmh",
              "author": "garrettfiftysmith",
              "text": "Good analogy. The website became the place to market the value prop. Will the web app become marketing?",
              "score": 2,
              "created_utc": "2025-12-30 18:29:30",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nwry9a0",
              "author": "foldedlikeaasiansir",
              "text": "Would you know any good checklist for Start Ups or an entrepreneur? Where I have trouble is the sequence in which to carry out the tasks related to building a start up. \n\nObviously Market Fit and Customer Validation is first and foremost, then comes MVP and POC to test the idea. But after that it’s get murky - Do you get a LLC first, how do you set up the business for payment to charge customer, do you build out all of the plan (Free, Paid, Enterprise) from the beginning if it’s a freemium service. How do you work on implementing an enterprise plan or does that come later. It’s all very much overwhelming to have a methodical way to build a start up.\n\nDo you have any tips that you give founder to reign in the chaos a little bit?",
              "score": 1,
              "created_utc": "2025-12-30 18:44:29",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwu1avc",
                  "author": "Beneficial_Host4863",
                  "text": "Here is a sequential order that I follow:\n\n1. Am I thinking of solving a problem I or the people around me face?\n2. If yes, is the problem painful enough that people need a new solution for it?\n3. If yes, who's the niche segment of users in need of that new solution?\n4. What should be that bare-bones solution (MVP) that would resonate with that segment?\n5. Can I build that solution as a low code, non-scalable tool in a couple of weeks?\n6. If yes, start validating the problem, solution-fit and willingness pay with 5 to 10 potential early adopters.\n7. If validated, automate and scale up. Else move-on",
                  "score": 2,
                  "created_utc": "2025-12-31 01:00:09",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwrosi8",
          "author": "garrettfiftysmith",
          "text": "MVPs can be made with a sentence. AI has changed the limit for the operational triangle (faster, higher quality, and cheaper).",
          "score": 2,
          "created_utc": "2025-12-30 18:01:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx0bob8",
          "author": "Head_Car_2922",
          "text": "I feel your pain. I am a hardware founder. We built a coffee cup prototype, and we had to work like dogs to get enough funding to get our 10 ton pilot plant. We are raising again and this time people are saying, oh THIS is your MVP. Like what no....",
          "score": 2,
          "created_utc": "2026-01-01 00:58:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwrklcu",
          "author": "structured_obscurity",
          "text": "Effort is the same as before, the tools are just better",
          "score": 4,
          "created_utc": "2025-12-30 17:41:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwrpf5u",
              "author": "foldedlikeaasiansir",
              "text": "Another observation I guess is the evolutionary increase of skills due to the new tools as well",
              "score": 2,
              "created_utc": "2025-12-30 18:04:01",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwrqg9z",
                  "author": "sheriffly",
                  "text": "Mostly the UI has improved I believe. The infrastructure and UX still has to be appealing and solving a problem.",
                  "score": 2,
                  "created_utc": "2025-12-30 18:08:44",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwrkxmg",
          "author": "mu4farooqi",
          "text": "MVP is typically measured in terms of time, specifically the time it takes to build it, usually in X weeks. Over the past five years, everyone has gained more empowerment and access to a wider range of tools and SDKs (shadecn, tailwind, chakra), enabling them to create visually appealing user interfaces (UIs) and feature rich BEs in a shorter time frame. Consequently, the quality of MVPs has improved significantly, but the underlying time required to build them remains unchanged.\n\nFor instance, the example of Airbnb, which YC highly praised for its MVP, may not be applicable today. However, it is possible to build stunning MVPs in the same timeframe that Airbnb founders took.",
          "score": 2,
          "created_utc": "2025-12-30 17:43:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwrvyk4",
              "author": "realbrownsugar",
              "text": "MVP is measured in viability, not time. Define the problem you are trying to solve… build a product that actually solves a core component of that problem to test if your hypothesis is correct. If people actually find it useful, then you can figure out how to scale. Focus on the jazz as a last step.\n\nSometimes, especially when the solution is trivial, added jazz is important for your product to thrive vs. the next copycat. So, have a nice feel to it might be a requirement for MVP, but even then… minimal necessary to be viable is the key concept.\n\nReddit, right here is a great example of why all that jazz don’t matter. In case you don’t remember, Reddit was almost entirely text and had minimal css. When they tried to get “designers” to make it pretty and spacey, it actually fired back and they had to pull back to mostly text again. Focus on the substance… style is secondary.",
              "score": 5,
              "created_utc": "2025-12-30 18:33:59",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nwud0w2",
                  "author": "mu4farooqi",
                  "text": "The beautiful UI I mentioned was just an example. It doesn’t imply that we need Jazz. Today’s Airbnb MVP would be significantly more Jazz-inspired than the one from the 2010s.\n\nYes, MVP is primarily about viability, but I would still time-box it for a typical software product. This approach doesn’t make sense for hard technology. So, yes, it’s subjective.",
                  "score": 1,
                  "created_utc": "2025-12-31 02:07:55",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwr33k3",
          "author": "hau5keeping",
          "text": "AirBnB was founded in 2008, so yeah i would expect MVP requirements to have risen in nearly 20 years",
          "score": 1,
          "created_utc": "2025-12-30 16:20:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwrpa6q",
              "author": "foldedlikeaasiansir",
              "text": "Yeah Airbnb was a bad example 😅",
              "score": 1,
              "created_utc": "2025-12-30 18:03:22",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwszmzq",
          "author": "UnemployedAtype",
          "text": "Yes and a lot of people here are pointing out some things but not the big glaring ones.\n\nKickstarter has become saturated and big names use the platform to test and launch stuff. Backers now expect perfectly polished products instead is a first gen MVP, and it wasn't junk that people were posting before but it also wasn't as insanely high of a bar as it is now.\n\nMore people in tech and entrepreneurship and more widespread perceived appeal of being early adopters and open to tech, alongside people who really shouldn't be investing or starting up things, has led to a shifting of standards such that it's become a \"you need money to play\" game.\n\nTools have gotten better and platforms have gotten worse.\n\nWe see the same in gaming and a lot of the internet.\n\nAnyone can be an early adopter nowadays which means that early adopters don't really exist in the same way.\n\nInstead of a tech nerd or wealthy tech geek picking up and trying out some fringe, new thing, anyone can.",
          "score": 1,
          "created_utc": "2025-12-30 21:42:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwtjauh",
          "author": "admin_default",
          "text": "When the oil industry started, you could poke a hole in land and see if oil oozed out - no research, spray and pray.\n\nThe early days of the mobile internet were similar.\n\nWhen the oil industry matured, you had to dig deeper and deeper. As digging got costlier, geological research became more necessary- the companies that didn’t invest in research went bankrupt digging dry holes.\n\nThe future of tech is similar.",
          "score": 1,
          "created_utc": "2025-12-30 23:21:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwtv01u",
          "author": "No-Let-4732",
          "text": "Consumers have also risen the standards for the products they’ll use and spent money on. Getting someone to pay or use an mvp is hard",
          "score": 1,
          "created_utc": "2025-12-31 00:25:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwu1btq",
          "author": "Acesa",
          "text": "It's clearly a much more competitive market today and a much more mature space. There's infinitely more resources available to founders and many fewer unmet consumer needs.",
          "score": 1,
          "created_utc": "2025-12-31 01:00:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwuo6gm",
          "author": "Available-Claim2445",
          "text": "With a flood of new AI vibe-coded apps, differentiation is definitely harder even from just the basic interface and not including the app itself. Investors are expecting more and more and honestly that's kind of fair considering that there is even more competition than ever, especially now that the barrier to entry (because of AI) has lowered once again allowing more (and faster) competitors.",
          "score": 1,
          "created_utc": "2025-12-31 03:13:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwv4e4v",
          "author": "Westernleaning",
          "text": "It isn’t just that the bar is high today, the world is very different than 2009. Back then when a new app or site dropped we all shared it with each other. I remember my buddies always sharing memes and apps, “oh bro, download uber, oh bro, check out angry birds, yo, I’m playing candy crush, check out wish you can buy anything for $1”. There was more supply of mobile devices and computers than there were apps/websites/businesses to put on them. \n\nToday we are in the opposite world. There are way too many websites, apps, DTC online brands vying for the consumer. Unless the pain point is NEXT level for the user to use a bad product, then the real competition is doing nothing, so many people pitch me products, ideas, etc, I try to avoid them, whether online courses on Instagram, or DTC, or download my app. \n\nSo MVP expectation from the user today is VERY high. Rolling out AirBnB’s MVP, or Instacart’s today, no one would touch it.",
          "score": 1,
          "created_utc": "2025-12-31 04:57:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwv7yyc",
          "author": "Lazy_Mention3257",
          "text": "I have seen a recent YC company with unreadable texts (white text on white background) on their website from launch to demo day. a16z speedrun company with texts going outside of a card. And recently a 10M seed AI dating company (founded by random undergrads) with only a waiting list… \n\nI guess these are not even MVPs.",
          "score": 1,
          "created_utc": "2025-12-31 05:23:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nww2qc0",
          "author": "Crafty-Sea-134",
          "text": "No, the problem is not the bar of current mvp. It’s the pain point we need to solve for potential customers. Of course, in 2026, The pain point of doordash not being able to order delivery in those years is gone, but the reason why those founders are still successful is that they have been iterating products according to the pain points.",
          "score": 1,
          "created_utc": "2025-12-31 09:54:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwzya5e",
          "author": "AGCRACK",
          "text": "It absolutely is - this is why VCs are conflicted. Even a great product can be easily knocked off in weeks. You better have sales channels and unique distribution to win. If you can’t be at $2m in software revenue in 18 months, you’re probably a mom n pop software company.",
          "score": 1,
          "created_utc": "2025-12-31 23:36:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx2wxsc",
          "author": "FroyoConfident1367",
          "text": "Yes, a lot of people are able to build now. This would be going up obviously. But those apps are not production grade, they are not very usable.",
          "score": 1,
          "created_utc": "2026-01-01 14:08:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwu4l26",
          "author": "aviboy2006",
          "text": "Now MVP building doesn't require engineering efforts you can just thought process and plan out well what you want to showcase then you are done because Vibe coding or AI tool. Its creating flashy but again need to evaluate doesn't really solving problem showing MVP its not just working model its working business model or some idea. Thats time will decide.",
          "score": 0,
          "created_utc": "2025-12-31 01:19:12",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1q01ivi",
      "title": "2025 comes to an end today, what progress did you make in your Startup this year?",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1q01ivi/2025_comes_to_an_end_today_what_progress_did_you/",
      "author": "Shashwatcreates",
      "created_utc": "2025-12-31 02:39:27",
      "score": 43,
      "num_comments": 76,
      "upvote_ratio": 0.95,
      "text": "I will start , 2025 for me was an year full of distractions. I wouldn't call it a very productive year, although I still made some progress.\n\nI was building a solo project, and it's like 50% complete although I'm not happy with the development. But 50% is better than 0% I stand atleast somewhere.\n\nHow about you guys? How is the progress going?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1q01ivi/2025_comes_to_an_end_today_what_progress_did_you/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "nwveaoe",
          "author": "AdditionalWeb107",
          "text": "I signed my first 1M Fortune 500 deal. Means we are cash flow neutral - but still don't quite feel ready for our next round (surprisingly) Building in the infrastructure and tooling space for agents. The problem we are solving is application delivery for agents.",
          "score": 13,
          "created_utc": "2025-12-31 06:11:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwvmo9o",
              "author": "Direct-Arachnid7254",
              "text": "Hey, your company url in LinkedIn is outdated . Had to visit your site from GitHub . (Hiring for any interns btw ?) (I think you’re p*ano right ?)",
              "score": 3,
              "created_utc": "2025-12-31 07:22:19",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nwxw5rw",
                  "author": "AdditionalWeb107",
                  "text": "correct: https://github.com/katanemo/plano. building in the open",
                  "score": 2,
                  "created_utc": "2025-12-31 16:59:11",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nwvoqgt",
              "author": "johnmorris19",
              "text": "Lemme be your SDR",
              "score": 2,
              "created_utc": "2025-12-31 07:41:20",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nwxwanm",
                  "author": "AdditionalWeb107",
                  "text": "I like that: check out the OSS project that we upsell for license and support and let me know if you are still interested: https://github.com/katanemo/plano. It is developer-heavy",
                  "score": 2,
                  "created_utc": "2025-12-31 16:59:51",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nwvfa59",
              "author": "Shashwatcreates",
              "text": "Wow that's a big deal 1M! I think you are YC ready!",
              "score": 1,
              "created_utc": "2025-12-31 06:19:11",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwuohzn",
          "author": "SystemicCharles",
          "text": "It's taking longer than I would have liked, but I am not rushing a damn thing. I've been here before. Every time I rush something, I almost always regret it.\n\nSome people might \"advise\" me to just launch or just ship it, but I don't give AF. There are a lot of legal and marketing stuff I needed to take care of. Not to mention, some technical things I need to iron out as well.\n\nAs a mostly solo founder right now, I want to make sure when we launch, I spend \\~80% of my time on marketing and sales, instead of 80% on doing tech support and other things that don't move the needle.",
          "score": 13,
          "created_utc": "2025-12-31 03:15:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwutnur",
              "author": "ajcaca",
              "text": "I promise you that the right move is to launch right now.",
              "score": 3,
              "created_utc": "2025-12-31 03:47:20",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nwuwx7x",
                  "author": "SystemicCharles",
                  "text": "I promise, you don't know what you're talking about. You don't have full context, or know that I already did a private pre-launch and have an actual Commitment to Purchase list of buyers begging to hand me money.",
                  "score": 1,
                  "created_utc": "2025-12-31 04:08:10",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwurwoi",
          "author": "ConnectGeneral7216",
          "text": "I interviewed and got rejected from YC returned to full time school and kept building.\n\nBig things coming 2026 😤\n\nWhat are you building @shashwatcreates",
          "score": 7,
          "created_utc": "2025-12-31 03:36:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwuxqe2",
              "author": "Shashwatcreates",
              "text": "What did you build?\n\nI'm building a Google forms alternative! Simple yet much needed today.",
              "score": 1,
              "created_utc": "2025-12-31 04:13:23",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwv77e7",
                  "author": "puddle-shitter",
                  "text": "What’s different from Google forms and typeform?",
                  "score": 1,
                  "created_utc": "2025-12-31 05:17:42",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwvoblz",
          "author": "valaquer",
          "text": "I gave myself permission to start. Stopped looking for a co-founder. Chose an idea that I furiously love Instead of one that would sound good to others. . I'm doing all the work myself. No fear, no doubt, no second guessing. A clear path ahead. ",
          "score": 6,
          "created_utc": "2025-12-31 07:37:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwvaw7k",
          "author": "Dramatic-Session9934",
          "text": "Built a full mvp, have 500 users already, and 50 recurring users. launching first institutional pilot next month. And have a fully working team, went from one founder, to and amount, all in 3 months. ( built the mvp in October)",
          "score": 3,
          "created_utc": "2025-12-31 05:44:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwvbmis",
              "author": "Shashwatcreates",
              "text": "What have you built?",
              "score": 2,
              "created_utc": "2025-12-31 05:50:20",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwvx267",
                  "author": "Dramatic-Session9934",
                  "text": "And AI waste sorting engine",
                  "score": 1,
                  "created_utc": "2025-12-31 08:59:36",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwx2c1s",
          "author": "PapayaPokPok",
          "text": "My goal this year was to get the skills necessary to become a founding engineer in my next role. I feel I've accomplished that.\n\nCurrent role is early engineer at a YC company, but I still had several gaps in my technical knowledge. I have filled those.\n\nBut the majority of what I've learned has been non-technical; learning to draw out what stakeholders actually want, even if they can't verbalize it; learning to manage different working styles of key players; managing team members when their skills are misaligned with the task; etc.\n\nI'm excited for what 2026 brings!",
          "score": 3,
          "created_utc": "2025-12-31 14:26:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nww23cc",
          "author": "Crafty-Sea-134",
          "text": "Think about planting a tree in the first season: it spreads the root in a invisible way, In my first two years: self doubt, afraid blind efforts.. But in the second half of 2025, the water watered by the previous seeds saw progress like bamboo bursting, so keep going.",
          "score": 2,
          "created_utc": "2025-12-31 09:48:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwwa3qk",
          "author": "aliparpar",
          "text": "Since I left my job last month, I’ve been spending the last few weeks of the month trying to prioritise what I want to build next year. \n\nIt doesn’t feel like progress but the direction you choose is now is going to be much more impactful than the speed early on",
          "score": 2,
          "created_utc": "2025-12-31 11:02:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwyqq4t",
          "author": "No-Degree-1068",
          "text": "Have a patent in progress with a top law tech firm in Sillicon Valley & NYC, felt validating for them to take me on as a client",
          "score": 2,
          "created_utc": "2025-12-31 19:32:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx0qzjz",
              "author": "Shashwatcreates",
              "text": "What's the project about?",
              "score": 1,
              "created_utc": "2026-01-01 02:38:12",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwzhwdl",
          "author": "United-Obligation253",
          "text": "Started in September. Had the goal to close my first cold-approached client before EOY. Failed, learned a lot on b2b sales (something I knew nothing about). Will keep pushing in 2026, for now I've got only one client that gives me oxygen.",
          "score": 2,
          "created_utc": "2025-12-31 22:00:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx0r20j",
              "author": "Shashwatcreates",
              "text": "Well one is better than nothing! Happy New year! 🎊",
              "score": 1,
              "created_utc": "2026-01-01 02:38:41",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nx00voo",
          "author": "PrestigiousTip47",
          "text": "Went from a concept to a product now we are out to secure funding to continue the build - long road ahead",
          "score": 2,
          "created_utc": "2025-12-31 23:52:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx0r9db",
              "author": "Shashwatcreates",
              "text": "How is the hunt for funding going?",
              "score": 1,
              "created_utc": "2026-01-01 02:40:05",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nx0s6sy",
                  "author": "PrestigiousTip47",
                  "text": "Slowww, tough market mixed with pre revenue business is not the easiest for sure",
                  "score": 2,
                  "created_utc": "2026-01-01 02:46:16",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwvi399",
          "author": "SinghCoder",
          "text": "I left my job in September and went all in.  \nLaunched, applied and got rejected by YC 2x ([https://www.youtube.com/watch?v=sWTGwIThsaU](https://www.youtube.com/watch?v=sWTGwIThsaU))\n\nScaled [Qordinate](https://qordinate.ai/wa) to 1000+ users, bootstrapped rn, with early signs of virality (people inviting others automatically)",
          "score": 3,
          "created_utc": "2025-12-31 06:42:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwviyta",
              "author": "Shashwatcreates",
              "text": "Congratulations 👏",
              "score": 2,
              "created_utc": "2025-12-31 06:49:42",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwvlqc7",
                  "author": "SinghCoder",
                  "text": "Thanks Shashwat.",
                  "score": 1,
                  "created_utc": "2025-12-31 07:13:47",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwv0hd4",
          "author": "VoltageLearning",
          "text": "While I have no intentions of applying for funding, it’s difficult sometimes to get wrapped up in the pace of progress. A few days we are on board paid customers, and other days we are struggling to gain marketing traction. As a founder, the ups and downs are relentless.\n\n2025 is allowed us to reach triple digits in MRR but it’s been an absolute grind to get to that point. I’m going to continue to work on my marketing and outreach, which is nearly 80% of the task.",
          "score": 1,
          "created_utc": "2025-12-31 04:31:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwv3j60",
              "author": "Shashwatcreates",
              "text": "Essentially if the product is good it all boils down to marketing, what have you built?",
              "score": 1,
              "created_utc": "2025-12-31 04:52:02",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwx7asj",
                  "author": "VoltageLearning",
                  "text": "We built an interview prep service, specifically for hardware and electronics engineers. The business model essentially is copied from leetcode. You can check it out here [voltage learning](https://voltagelearning.com)",
                  "score": 1,
                  "created_utc": "2025-12-31 14:54:00",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwvscm1",
          "author": "CarpetNo5579",
          "text": "shut down my vc backed b2c startup, then started a b2b startup instead. did $0-$200k ARR in 6 weeks - fully bootstrapped, things have been progressing really well!",
          "score": 1,
          "created_utc": "2025-12-31 08:14:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwvwpzv",
              "author": "Shashwatcreates",
              "text": "6 works and 200k ARR that's impressive, what did you build?",
              "score": 1,
              "created_utc": "2025-12-31 08:56:21",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nww2wnq",
                  "author": "CarpetNo5579",
                  "text": "offered a service, then have my own software component that helps me do said service",
                  "score": 2,
                  "created_utc": "2025-12-31 09:55:43",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwvvbio",
          "author": "TinyDebate7541",
          "text": "Hired 3 sales guys and did the first steps. Let´s go 2026!!!",
          "score": 1,
          "created_utc": "2025-12-31 08:43:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwvwty4",
              "author": "Shashwatcreates",
              "text": "Yay 🙌 what did you build?",
              "score": 1,
              "created_utc": "2025-12-31 08:57:24",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwx1rdm",
          "author": "BSNL_mentor",
          "text": "Landed a few customers",
          "score": 1,
          "created_utc": "2025-12-31 14:23:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwx3b3w",
          "author": "RoutineNet4283",
          "text": "I started generating revenue on my project; I'm building it solo. \n\nBut the biggest worry is that my competitor raised millions.",
          "score": 1,
          "created_utc": "2025-12-31 14:31:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwxauam",
          "author": "Straight-Gazelle-597",
          "text": "Launched myself **Miya: The Paperwork Liberator** on the last day😊, a memorable way to say Bye to 2025 and Ciao to 2026. (Only in Italian now, other languages will come soon, stay tuned...) Happy New Year No Paperwork to you all!",
          "score": 1,
          "created_utc": "2025-12-31 15:12:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwxedf6",
              "author": "Shashwatcreates",
              "text": "Oh sounds interesting, can I have the link?",
              "score": 2,
              "created_utc": "2025-12-31 15:31:00",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwxej61",
                  "author": "Straight-Gazelle-597",
                  "text": "[https://miya.techengines.ai](https://miya.techengines.ai)",
                  "score": 1,
                  "created_utc": "2025-12-31 15:31:49",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwznufk",
          "author": "quattrocinco45",
          "text": "Got first 50 busineses to use yena.ai 💯",
          "score": 1,
          "created_utc": "2025-12-31 22:34:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx0r4ra",
              "author": "Shashwatcreates",
              "text": "That's a big achievement I would say!",
              "score": 1,
              "created_utc": "2026-01-01 02:39:12",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nx4vnh7",
          "author": "CarlSagans",
          "text": "I Built ddltodata.com, a test data generation tool for developers. \n\nThe product itself is basically done, free tier is live, API works, docs are written.\n\nBut honestly, I've been procrastinating on the marketing side. The code was the easy part. Now I have to actually put it in front of people and that's terrifying.\n\nPlanning to do a soft launch on Reddit and Hacker News in the next few weeks. Nervous as hell. Easier to just keep tweaking code than to face that.",
          "score": 1,
          "created_utc": "2026-01-01 20:26:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx0u393",
          "author": "abyssalvalue",
          "text": "Honestly had a relatively chill year.  Crossed $1M ARR and grew 150% yoy.  The goal is to do it again this year.",
          "score": 0,
          "created_utc": "2026-01-01 02:59:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx12h8g",
              "author": "Shashwatcreates",
              "text": "1M ARR is crazy AF what have you built?",
              "score": 1,
              "created_utc": "2026-01-01 03:55:50",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nx2fugg",
                  "author": "abyssalvalue",
                  "text": "Boring saas that solves a problem in a niche market.",
                  "score": 1,
                  "created_utc": "2026-01-01 11:46:47",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1puqd99",
      "title": "How is your Startup Doing, and what’s the big vision for 2026?",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1puqd99/how_is_your_startup_doing_and_whats_the_big/",
      "author": "ZidZidane",
      "created_utc": "2025-12-24 15:48:23",
      "score": 42,
      "num_comments": 59,
      "upvote_ratio": 0.97,
      "text": "",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1puqd99/how_is_your_startup_doing_and_whats_the_big/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "nvt8j3y",
          "author": "d8ul",
          "text": "Big vision for 2026? Don’t die 🚀",
          "score": 39,
          "created_utc": "2025-12-25 02:16:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwj22ut",
              "author": "sheriffly",
              "text": "Chatgpt make my startup profitable. Don't make any mistakes.",
              "score": 1,
              "created_utc": "2025-12-29 11:28:15",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nvsdc61",
          "author": "VoltageLearning",
          "text": "I launched roughly a month ago and are deep into the marketing world. As someone who has both technical and business/marketing experience, it's been extremely interesting a fun venture to continue to grow. Something that definitely helped us is to launch a V2 of our resource that was fully free. We spoke to and surveyed nearly 50 of our users and asked them what exactly they liked/didn't like. We then poured those insights into our V2. \n\nI personally think sustainable growth is something that I value, so adding only 1 user per week is and continues to be the goal through the future. So far we've blown that goal out of the water for a majority of weeks. \n\nI have no plans of raising seed funding, and frankly see bootstrapping as a more effective method of making decisions for myself.",
          "score": 6,
          "created_utc": "2025-12-24 22:33:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "nw0mrey",
              "author": "ZidZidane",
              "text": "This is a great example of intentional growth. Talking directly to users and letting that shape V2 is something a lot of teams skip, and it usually shows later.\n\nI also like the clarity around sustainable growth and bootstrapping, optimising for learning and control instead of speed-for-speed’s sake tends to lead to better decisions long term. Appreciate you sharing how you’re approaching it.",
              "score": 2,
              "created_utc": "2025-12-26 12:54:43",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "nw8apep",
              "author": "Mediocre_Leg_754",
              "text": "Are you active on X or share your journey in public? I would love to follow you and learn from you. I also run a bootstrapped product and I ramen profitable.",
              "score": 1,
              "created_utc": "2025-12-27 18:30:03",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nw8ep3d",
                  "author": "VoltageLearning",
                  "text": "I’m somewhat active on X, but I quickly realized that my target audience, early career hardware and electronics engineers, doesn’t really hang out there. Reddit is something that has been far more valuable. \n\nEspecially in communities like build in public, I find that it’s good for networking with other creators and founders, but not the best when it comes to find customers (depending on your target audience). \n\nIf you want some inspiration, check out our platform. It’s linked within my profile.",
                  "score": 1,
                  "created_utc": "2025-12-27 18:49:57",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nvs4et6",
          "author": "Significant-Level178",
          "text": "We are in good shape of closing Seed. By end of 2026 we need to finalize new product, and prepare for A and SOC2. \nOfc we have targets - for revenue and paid customers. \nTeam count grow, open office, and so much more.",
          "score": 4,
          "created_utc": "2025-12-24 21:38:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvu6vor",
              "author": "Minimum-Algae-4937",
              "text": "That home page of yours looks vibe coded af",
              "score": 9,
              "created_utc": "2025-12-25 07:03:09",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nvvlvqp",
                  "author": "jexpearce",
                  "text": "yeah bro you gotta change that asap. download maybe the ibm carbon package, theres a few other great b2b style ones on figma too. You can still vibe code it can just say stuff like \"make all the buttons square, with rectangular borders, etc.\". trust me 2026 is when your average non technical individual will be able to start spotting this vibe coded ui in seconds as well.",
                  "score": 5,
                  "created_utc": "2025-12-25 15:05:00",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nw0mgiw",
                  "author": "ZidZidane",
                  "text": "That’s a well‑structured and deliberate roadmap. Addressing Series A readiness and SOC 2 compliance this early may feel weighty, but it makes everything downstream far smoother.\n\nIt’s clear there are many moving pieces aligning at once, product, revenue, team, and process, and I really value how openly you’ve shared it.",
                  "score": 3,
                  "created_utc": "2025-12-26 12:52:17",
                  "is_submitter": true,
                  "replies": []
                },
                {
                  "id": "nw52sgq",
                  "author": "AsparagusCharacter49",
                  "text": "The lazy way :))",
                  "score": 2,
                  "created_utc": "2025-12-27 04:35:15",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nvrlq56",
          "author": "Proof-Term1950",
          "text": "I launched an app 2 weeks ago and it's already getting a good amount of initial users testing it out. I'm hoping that I'll see the first user convert to the paid plan pretty soon.\n\nFor my 2026 goal, I would love to try to get into YC.\n\nObviously, I'm realistic that it's about a 1% acceptance rate, but I'm still going to at least try. I've applied three times before with no luck, but each time I go through the process, I feel it sharpens my thinking and makes me better overall as a founder, so even though I get rejected, I still appreciate the process.",
          "score": 6,
          "created_utc": "2025-12-24 19:47:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "nw0ndks",
              "author": "ZidZidane",
              "text": "That’s a strong mindset. Landing early users this fast is already a meaningful signal, and zeroing in on the first paid conversion feels like the right next milestone.\n\nI also admire how you’re using YC as a catalyst for sharper thinking rather than simply chasing the outcome. That kind of persistence and reflection tends to compound over time. Thanks for sharing it so openly.",
              "score": 1,
              "created_utc": "2025-12-26 12:59:33",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nvtcnly",
          "author": "hellf1nger",
          "text": "Survive",
          "score": 2,
          "created_utc": "2025-12-25 02:47:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvvnw2j",
          "author": "bLeezy22",
          "text": "We’re cooking! 2026 should see 5x growth if all goes well. We’ve stabilized our system. It’s gotten exponentially more efficient. We’re launching 2 more biz lines. We’ve been approached for acquisition by ai companies and top businesses in our space. I think we’re really on to something. We’ll consider raising funding in June. We considered adding to the team but staying lean feels more efficient.\n\nLet’s go!!",
          "score": 2,
          "created_utc": "2025-12-25 15:17:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "nw0xd4r",
              "author": "ZidZidane",
              "text": "Love this energy. The mix of efficiency, multiple lines launching, and still choosing to stay lean is a strong signal of discipline.\n\nGetting acquisition interest while thinking intentionally about timing for funding usually means you’re building something real. Excited to see where 2026 takes you.",
              "score": 2,
              "created_utc": "2025-12-26 14:09:20",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nw1ntsw",
                  "author": "bLeezy22",
                  "text": "I appreciate you!! Let’s go!!",
                  "score": 1,
                  "created_utc": "2025-12-26 16:41:14",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nvsualo",
          "author": "airjb2317",
          "text": "Honestly, still very early, but feeling good about the direction.\n\nWe’re building a family product in a crowded space, so the last few months have been less about growth and more about proving the core loop actually works. A lot of time spent watching real users, cutting features, and fixing things that break motivation instead of adding shiny stuff.\n\nRight now the focus is:\n\t•\tTightening the experience so it’s genuinely useful and fun, not just “nice”\n\t•\tMaking onboarding and first success almost impossible to mess up\n\t•\tGetting to a small but real pilot where behavior actually changes, not just signups\n\nFor 2026, the vision is pretty simple:\nhave something that people would be upset to lose, with clear evidence of why it works and where it can go next.\n\nYC is on the list, but not as the goal by itself. The process is useful either way—it forces clarity, honesty, and momentum. If we earn it, great. If not, the work still compounds.\n\nMostly just trying to keep my head down, ship, and learn faster than the market moves.",
          "score": 1,
          "created_utc": "2025-12-25 00:30:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "nw0xqnq",
              "author": "ZidZidane",
              "text": "This is a really grounded way to build. Watching real users, cutting features, and obsessing over first success instead of growth metrics takes discipline, especially in a crowded space.\n\nI like how clearly you’ve articulated the goal for 2026, too. Something people would genuinely be upset to lose is a strong north star. Sounds like you’re doing the unglamorous work that actually compounds.",
              "score": 1,
              "created_utc": "2025-12-26 14:11:49",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nvt9la9",
          "author": "BookkeeperPractical4",
          "text": "I've already thought of two products in my mind that I hope to launch by 2026 and achieve 10k MRR.",
          "score": 1,
          "created_utc": "2025-12-25 02:24:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvxxveb",
              "author": "Popular-Stay-2637",
              "text": "what products?",
              "score": 1,
              "created_utc": "2025-12-25 23:36:29",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nw8dztk",
              "author": "Mediocre_Leg_754",
              "text": "I am bootstrapping as well, would love to exchange notes with you.",
              "score": 1,
              "created_utc": "2025-12-27 18:46:26",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nwbmp5x",
                  "author": "BookkeeperPractical4",
                  "text": "I can be quite erratic; in fact, I've created several products that never launched. For example, generating product documentation directly from e2e tests and AI vibe coding.",
                  "score": 1,
                  "created_utc": "2025-12-28 06:12:38",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nvtzdpl",
          "author": "aviboy2006",
          "text": "We launched recently first version. Now doing some pivot and adding feature which make user happy to come back. But still figuring out what make our paying customer to happy whereas other others user are getting sorted. That’s why not even idea liking by everyone but no one is coming on board as investor.",
          "score": 1,
          "created_utc": "2025-12-25 05:52:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "nw0lrd2",
              "author": "ZidZidane",
              "text": "This is a very honest place to be. A lot of teams get early usage signals before they get paying signals, and those two don’t always overlap.\n\nIt often comes down to narrowing in on the specific user who feels the pain strongly enough to pay, even if others like the product casually. Investors usually react once that story becomes clear.\n\nSounds like you’re doing the right work, even if it feels uncomfortable right now.",
              "score": 2,
              "created_utc": "2025-12-26 12:46:44",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "nvxxyqp",
              "author": "Popular-Stay-2637",
              "text": "whats the product",
              "score": 1,
              "created_utc": "2025-12-25 23:37:04",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nvu0cpr",
          "author": "attn-transformer",
          "text": "Im launching a system to replace an existing multi day workflow for fund managers. Currently when a fund manager evaluates a new trade analysts and data scientists evaluate collateral, generate scenarios, and run cashflows. \n\nMy system reads the prospectus, models the cashflow waterfall, analyzes the collateral,  builds sklearn models, runs the models and generates a report. \n\nBasically the entire front office structured finance workflow which takes days and people is now done in minutes with a prompt. \n\nLaunching January 9.",
          "score": 1,
          "created_utc": "2025-12-25 06:01:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "nw0z5ji",
              "author": "ZidZidane",
              "text": "This is impressive. Compressing a multi-day, multi-role front office workflow into minutes changes not just speed, but how decisions get made.\n\nThe fact that you’re going from prospectus ingestion all the way to modeled cashflows and reports shows real depth, not just surface-level automation. January 9 sounds exciting, curious to see how funds react once it’s in real use.",
              "score": 1,
              "created_utc": "2025-12-26 14:20:56",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nvu7mhg",
          "author": "[deleted]",
          "text": "[deleted]",
          "score": 1,
          "created_utc": "2025-12-25 07:10:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "nw0zges",
              "author": "ZidZidane",
              "text": "This resonates a lot. That phase where the raw pieces are all there, but the real work is distilling them into something coherent and sharp, is often the hardest and most interesting part.\n\nFinding the signal in the noise and turning it into something intentional feels like where real products are born. Sounds like you’re right in that creative tension.",
              "score": 1,
              "created_utc": "2025-12-26 14:22:52",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nvut63c",
          "author": "SinghCoder",
          "text": "building [qordinate.ai/whatsapp](https://qordinate.ai/whatsapp) \\- an AI sidekick in your existing chat apps that connects to 500+ apps, keeps personal-CRM style lists, pings you with smart nudges, follows up with others for you, auto-reminds you, and even drops memes while handling your boring chores.  \nIdea is to take it to 100k+ DAU in 2026.",
          "score": 1,
          "created_utc": "2025-12-25 11:03:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvwalaf",
              "author": "kennetheops",
              "text": "how do you plan to grow users?",
              "score": 1,
              "created_utc": "2025-12-25 17:35:46",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nvz15nt",
                  "author": "SinghCoder",
                  "text": "Organic + Inorganic",
                  "score": 1,
                  "created_utc": "2025-12-26 04:00:54",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nvut674",
          "author": "Gritbound",
          "text": "It’s moving forward, not in a straight line, but with momentum. After about 4 years of development and validation, we’re finally heading toward launch early 2026. I’m excited and honestly a bit scared of the outcome, but that feels like the right place to be. The \"vision\"/goal now is to deliver something that genuinely exceeds what people & market expect.",
          "score": 1,
          "created_utc": "2025-12-25 11:03:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvvlx73",
          "author": "bgbgbg28",
          "text": "building prodora and starting testing with some companies now. hoping to get good insight and move the company further. maybe y combinator?",
          "score": 1,
          "created_utc": "2025-12-25 15:05:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvvtwbm",
          "author": "Longjumping-Dream769",
          "text": "Get funding\nPay the landlord his dues",
          "score": 1,
          "created_utc": "2025-12-25 15:55:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvvz2cx",
          "author": "BakerTheOptionMaker",
          "text": "Our goal is onboard at least 1,000 active enterprise clients\n\nWe just crossed 60,000 users this morning & have around 3,200 paying at avg sub of $44 \n\nWe have seen a recent influx of @abc company emails & are in the midst of pivoting upmarket to sell to these folks more intently … so that’s our goal!",
          "score": 1,
          "created_utc": "2025-12-25 16:26:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvx00qc",
          "author": "raunakhajela",
          "text": "Got some churn issue right now but it can be fixed",
          "score": 1,
          "created_utc": "2025-12-25 20:04:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvxawo5",
          "author": "Timely-Landscape-760",
          "text": "I am rushing to build [nextgeo.fit](http://nextgeo.fit) (not launched yet). I have recently enabled the waitlist because launch is close and now very excited about how to handle all those signups! Let's see what the future brings. (2nd time founder here, first small exit)",
          "score": 1,
          "created_utc": "2025-12-25 21:12:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvxe7v7",
          "author": "startplaying_games",
          "text": "Profitable! Launching two new verticals in 2026!",
          "score": 1,
          "created_utc": "2025-12-25 21:32:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvy8cno",
          "author": "qmrelli",
          "text": "Today we made a launch on product hunt, so far we are number 4 in 267 applications, yet im aiming number 1 till the next day",
          "score": 1,
          "created_utc": "2025-12-26 00:42:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvynysx",
          "author": "No-Put450",
          "text": "We are struggling to get android app",
          "score": 1,
          "created_utc": "2025-12-26 02:29:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwj2nhw",
              "author": "ZidZidane",
              "text": "Struggling to get an Android app?",
              "score": 1,
              "created_utc": "2025-12-29 11:33:15",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nw13416",
          "author": "EchoingAngel",
          "text": "It's time I crack sales. \n\nAlmost three years in and after a handful of testers giving feedback, I am confident I have the best product in the space. I just have to start getting paid for it.\n\nIt has been very hard figuring out the messaging that clicks for people, but the existence of my competitors tells me there is a way.\n\nThis has been a rough road, being totally bootstrapped, solo, and with no sales experience, but I am going to give up gaming until I make $100k (games are my main distraction/from of entertainment)",
          "score": 1,
          "created_utc": "2025-12-26 14:45:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw1ra2h",
          "author": "BeneficialThanks3126",
          "text": "The vision to reach every potential user out there and a proper feedback",
          "score": 1,
          "created_utc": "2025-12-26 16:59:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwfahnm",
          "author": "NoJob8068",
          "text": "bootstrapped, launched 6 months ago, at a 6 figure run rate, generated over 60k in rev 95% profit margins, b2b aiming for 100 users",
          "score": 1,
          "created_utc": "2025-12-28 20:38:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwg1uoq",
          "author": "Business-Bathroom603",
          "text": "We launch our first two satellites next year! Exciting times after a long and painful road. We are still raising. https://wefunder.com/tropical.weather.analytics",
          "score": 1,
          "created_utc": "2025-12-28 22:54:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwh8ajj",
          "author": "ManagerMoist4305",
          "text": "1b arr is the vision",
          "score": 1,
          "created_utc": "2025-12-29 02:49:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwjor8f",
          "author": "No-Put450",
          "text": "There Auth issue with users that have multiple play store id in there phone \nThe app fails to authenticate them \nHappening for test users",
          "score": 1,
          "created_utc": "2025-12-29 14:07:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwjpve7",
          "author": "unknownstudentoflife",
          "text": "Focus mainly on creating distribution channels for the product",
          "score": 1,
          "created_utc": "2025-12-29 14:14:20",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pu8dj8",
      "title": "strategy for getting the early customers",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1pu8dj8/strategy_for_getting_the_early_customers/",
      "author": "overquantityi",
      "created_utc": "2025-12-23 23:28:11",
      "score": 36,
      "num_comments": 37,
      "upvote_ratio": 1.0,
      "text": "Hi guys,\n\nI hope you are doing well,\n\nI have a question for founders, how do you go about your strategy in getting your first customers, for my case they are ( well 2/3 of my target) only present on social media like FB, Instagram, tiktok, etc. I can also visit them IRL. I started reaching out to a bunch, i reached out to about 42 until now. With 11 replies, 5 of them interested and 2 demos planned.\n\nLet me know what you think and please give me any advices you think is gonna be helpful, \n\n\nThanks.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1pu8dj8/strategy_for_getting_the_early_customers/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "nvmr024",
          "author": "lukaszf",
          "text": "The hidden pattern here is doubling down on what's working. 42 outreaches for 2 demos is a grind. Can you hyper-focus on \\*why\\* those specific 5 were interested? What common thread connects them?",
          "score": 12,
          "created_utc": "2025-12-23 23:44:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvopns8",
              "author": "gkp95",
              "text": "Good suggestion- this is what another founder wrote in another thread which worked for him. Doubling down on who said yes and why and ask them to recommend to their network.",
              "score": 4,
              "created_utc": "2025-12-24 08:04:10",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nvpejct",
              "author": "overquantityi",
              "text": "That's very helpful, i will try to map what worked and theb try to replicate that behavior across the next batch of outreach, \n\nThanks",
              "score": 3,
              "created_utc": "2025-12-24 12:03:35",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nvmoti8",
          "author": "reddit_user_100",
          "text": "I think you're basically on the right track if you have some demos lined up. Early days is just gonna be hand to hand combat. Do whatever it takes to get people to talk to you. Beg your network, cold reach out, be that annoying guy at events, etc.",
          "score": 6,
          "created_utc": "2025-12-23 23:31:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvpene7",
              "author": "overquantityi",
              "text": "Yess, i will even go visit them in person, the conversion rate will be much much higher",
              "score": 1,
              "created_utc": "2025-12-24 12:04:33",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "nvpeq70",
              "author": "overquantityi",
              "text": "Because according to sam altman, from cold Outreach the conversion rate is about 2%",
              "score": 1,
              "created_utc": "2025-12-24 12:05:13",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nvpl2i3",
          "author": "Itchy-Development627",
          "text": "I was too lazy reading the other comments but that‘s more or lese what works:\n\n1. gain first users. Either via reddit or Linkedin dms - does not really matter how or if it scales\n2. figure our if you understand their problem\n3. show them the product you have\n4. iterate til they love it\n5. build sales by automated outreach and target customers you do manually\n6. hire another sales guy and show him what you did\n7. hire a bunch of sales guy and promote the first guy to lead them\n8. talk with customers and ask what exactly was the problem and why they are obsessed with your solition\n9. put this from 8 into ads\n10. start marketing yourself via 10 bucks a day til something works\n11. then hire someone by asking how they would do it. If they answer without information what worked for you it should be ok\n12. scale\n\nAlong the steps you might consider raising a round. After 12 you defenetely should.\n\nIf you have a product people care deeply and share with their friends faster than you can hire sales - hire engineers and one good marketing guy. Rest should be ok.\n\nIf someome disagrees or agrees let me know. My thumbs hurt feom typing this on the phone",
          "score": 5,
          "created_utc": "2025-12-24 12:55:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvpleyy",
              "author": "overquantityi",
              "text": "Oh my god, thank you so much. This is very helpful. I'm gonna dm you!",
              "score": 3,
              "created_utc": "2025-12-24 12:58:10",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nvzawpm",
                  "author": "Foreign_Tower_7735",
                  "text": "And I suggest for LinkedIn to also build an email list using simple strategies. In case you don't know I can send to you how.",
                  "score": 1,
                  "created_utc": "2025-12-26 05:15:57",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nvn6s7s",
          "author": "OldBat9817",
          "text": "Numbers game multiply that by 100",
          "score": 4,
          "created_utc": "2025-12-24 01:20:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvpernn",
              "author": "overquantityi",
              "text": "True",
              "score": 1,
              "created_utc": "2025-12-24 12:05:34",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nvmpei2",
          "author": "SlanderMans",
          "text": "I think you're doing it exactly right 👍 \n\n\nPeople that has a problem are usually vocal online. All my first users came from jumping in the socials and telling them how I can help or what my solution is. \n\n\nAlso has a tool I built to help automate parts of that process, DM me if you're interested ",
          "score": 3,
          "created_utc": "2025-12-23 23:35:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvpetsz",
              "author": "overquantityi",
              "text": "Okay thank you so much",
              "score": 1,
              "created_utc": "2025-12-24 12:06:04",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nvmxz96",
          "author": "Independent-Pen1250",
          "text": "you are perfectly on the right path. just prioritize having real conversations over selling - at first you main task is to have conversations, you don't have to do all the selling now. these interactions together with early validation like launch list, actual pre-payments turns into your first set of marketing material. basically your first 10 customers are the ones who validate your product and the currency here is not the payment but also the feedback. good luck",
          "score": 3,
          "created_utc": "2025-12-24 00:26:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvpeyx3",
              "author": "overquantityi",
              "text": "True,\n\nThank you a lot",
              "score": 1,
              "created_utc": "2025-12-24 12:07:16",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nvny5sb",
          "author": "[deleted]",
          "text": "[deleted]",
          "score": 2,
          "created_utc": "2025-12-24 04:15:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvpezup",
              "author": "overquantityi",
              "text": "Haha",
              "score": 1,
              "created_utc": "2025-12-24 12:07:29",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nvom0in",
          "author": "Temporary_Tune_6109",
          "text": "Your numbers are actually solid for early outreach — 11 replies out of 42 is a good signal, especially with 2 demos already planned.\n\nIn my case, I’m currently in the pre-Kickstarter phase, so my focus isn’t on selling yet, but on building a long waitlist. Instead of following standard marketing advice, I try to find niches everywhere — even in marketing itself (which isn’t my field).\n\nI built a list of around 10k potential personas and reached out with private, highly personalized messages, offering value without selling anything. For me, this worked well as a first step to validate interest and start conversations.\n\nIf your audience is already on social media and you can also reach them IRL, I’d double down on direct, personal outreach like you’re doing now — it clearly works.",
          "score": 2,
          "created_utc": "2025-12-24 07:29:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvpfbbd",
              "author": "overquantityi",
              "text": "True, i will do in person visits too. I'm just trying to do the cold Outreach via social media first to get an idea about most of them.\n\nI also want to mention that before this phase, i have done multiple in person interviews to validate the idea before building the mvp.",
              "score": 1,
              "created_utc": "2025-12-24 12:10:10",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nvopvq5",
          "author": "tushardey_",
          "text": "Those conversion rates are actually pretty solid for such a small sample size. 11 replies out of 42 is over 25%, so you're clearly hitting a pain point. Honestly, the biggest thing right now is just volume; 42 is tiny.\n\nKeep doing the \"unscalable\" stuff and definitely lean into those IRL visits if you can, because face-to-face trust is huge for closing early adopters. Just try to see if there's a pattern in those 5 interested leads so you can double down on that specific niche.",
          "score": 2,
          "created_utc": "2025-12-24 08:06:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvpfhzb",
              "author": "overquantityi",
              "text": "True IRL visits are gonna have more impact, i tried to do this first to gather more data about my segment behavior. So i can understand them more",
              "score": 1,
              "created_utc": "2025-12-24 12:11:44",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nvp7cj2",
          "author": "PixelGlowMagic",
          "text": "That's awesome you're already hitting those numbers with replies and demos from your outreach! For getting those initial customers, sometimes the biggest hurdle is just finding the right folks and then keeping all those conversations straight.. A simple tip is to focus on rly listening to their pain points in those early chats. What's been the trickiest part about turning those initial interested replies into actual conversions or clients?",
          "score": 2,
          "created_utc": "2025-12-24 10:58:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvpb869",
              "author": "Wide_Brief3025",
              "text": "One thing that made a difference for me was keeping notes after every conversation so I could tailor the follow up and address what actually mattered to each person. After a while, I started using ParseStream to help track those interactions and catch when key topics came up, which made managing and converting leads a lot smoother.",
              "score": 2,
              "created_utc": "2025-12-24 11:34:42",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nvpg0ur",
              "author": "overquantityi",
              "text": "I tried to send like 20 and only got 1 person interested out of 5 replies, then i changed my strategy based on the first outreach and i got 6 more replies with 4 more interested. So everytime, i keep adjusting the message i send, whether i ask them for a call or not, how much time i wait before i reach out to them again, etc. So it really depends.",
              "score": 1,
              "created_utc": "2025-12-24 12:16:05",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nvpa3or",
          "author": "Gerome24",
          "text": "The key is to create an open source version if you get users from the open source version then your idea is validated and then build your pro version for paid users",
          "score": 2,
          "created_utc": "2025-12-24 11:24:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "nvpediv",
              "author": "overquantityi",
              "text": "What i did first is launch it but give access only to users i contacted and are interested in using the product,\n\n\nThanks for the insight",
              "score": 1,
              "created_utc": "2025-12-24 12:02:13",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nvpheqw",
                  "author": "Gerome24",
                  "text": "I had 2800 monthly active users pre-launch with $0 on marketing and minimal social media posts i have never had to contact anyone because of the open source version then I just build better features and users are happy to pay because they know what there getting is worth paying for but good luck man wish the best for you :)",
                  "score": 2,
                  "created_utc": "2025-12-24 12:27:30",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nw04ebt",
          "author": "Ananyxgupta",
          "text": "Dude, this is reddit...\nYou wrote fuckin' email 😭",
          "score": 2,
          "created_utc": "2025-12-26 10:01:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvpa33x",
          "author": "Gerome24",
          "text": "The key is to create an open source version if you get users from the open source version then your idea is validated and then build your pro version for paid users",
          "score": 1,
          "created_utc": "2025-12-24 11:24:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nvxfj3x",
          "author": "Inquation",
          "text": "Good product.",
          "score": 1,
          "created_utc": "2025-12-25 21:40:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw64jy8",
          "author": "Silly-Chipmunk4861",
          "text": "invest in your distribution. everyone clowns the building in public until it works. emotional investment is key early on",
          "score": 1,
          "created_utc": "2025-12-27 10:11:32",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1py21eb",
      "title": "I’m replacing my music with podcasts, suggestions ?",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1py21eb/im_replacing_my_music_with_podcasts_suggestions/",
      "author": "Swimming_Tangelo8423",
      "created_utc": "2025-12-28 20:47:43",
      "score": 23,
      "num_comments": 25,
      "upvote_ratio": 0.85,
      "text": "I want to make use of my time and replace music with a bunch of useful podcasts on entrepreneurship, startups, tech and more.\n\nWhat are your top picks? Or do you know a place I can find such podcasts to choose from?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1py21eb/im_replacing_my_music_with_podcasts_suggestions/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "nwi4kf9",
          "author": "ergonet",
          "text": "My personal favorites\n  \n- __Bussines stories and lessons learned:__\n  - [How I built this](https://podcasts.apple.com/mx/podcast/how-i-built-this-with-guy-raz/id1150510297)\n  - [Business wars](https://podcasts.apple.com/mx/podcast/business-wars/id1335814741)\n- __Funding:__\n  - [The Pitch](https://podcasts.apple.com/mx/podcast/the-pitch/id1008577710)\n  - [Zero to IPO](https://podcasts.apple.com/mx/podcast/zero-to-ipo/id1449387146)\n- __Understanding everything money related and financial news:__\n  - [Planet Money](https://podcasts.apple.com/mx/podcast/planet-money/id290783428)\n  - [The indicator](https://podcasts.apple.com/mx/podcast/planet-money/id290783428)\n  \n.  \nEdit: fixed links",
          "score": 7,
          "created_utc": "2025-12-29 06:23:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwhcttx",
          "author": "No-Let-4732",
          "text": "I like my first million",
          "score": 3,
          "created_utc": "2025-12-29 03:15:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwipuns",
          "author": "PowerBoth8172",
          "text": "What do you guys think about interactive podcasts, where you can interrupt and ask questions and receive answers based on the corpus of the video and other scraped information? Would you use this?",
          "score": 3,
          "created_utc": "2025-12-29 09:36:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwjstxj",
              "author": "Knowledge_Seeker_001",
              "text": "I think I will, and people like Hormozi are already doing it. But It's not their main core, they create long and short forms (mostly long ones) and thus they get their followers to ask questions in the live. If live was their only thing, I really doubt that they would get this big following.",
              "score": 1,
              "created_utc": "2025-12-29 14:31:12",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nwk95rn",
          "author": "Trinty444",
          "text": "You should keep listening to music, just dedicate  separate times for podcasts and music. Not everything you do needs to feel like you are constantly hustling or “learning”…",
          "score": 3,
          "created_utc": "2025-12-29 15:54:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwkddtr",
          "author": "Vemly-AI",
          "text": "My first million/ YC combinator/ 20VC",
          "score": 3,
          "created_utc": "2025-12-29 16:14:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwigbws",
          "author": "ProfessorRagna",
          "text": "My First Million",
          "score": 2,
          "created_utc": "2025-12-29 08:06:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwlcelc",
          "author": "Livid-Savings-5152",
          "text": "Replace podcasts with cold calling. It’ll force you to build the only skill that matters in business: immunity to rejection and embarrassment.",
          "score": 2,
          "created_utc": "2025-12-29 18:58:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx33fu2",
              "author": "OrganizationCute6950",
              "text": "Needed to hear this haha",
              "score": 1,
              "created_utc": "2026-01-01 14:51:22",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nwrvxso",
          "author": "_dremnik",
          "text": "podcasts are great but i would consider that too much information consumption actually isn't a good thing. i've had arguments with friends about this and i always find that music is a great opportunity to let my mind wander / rest and digest some of the problems that i am actively working on. a low information diet is a good thing for productivity :)",
          "score": 2,
          "created_utc": "2025-12-30 18:33:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwwo2d2",
          "author": "SecureSlateHQ",
          "text": "1/ **How I Built This**  \nFounder stories done right. Not just wins, but mistakes, pivots, and near-failures. Easy listen, high signal.\n\n2/ **My First Million**  \nVery idea-driven. Great for spotting trends, business models, and “why didn’t I think of that?” moments.\n\n3/ **Acquired**  \nLong episodes, but worth it. Deep dives into how iconic companies actually got built. Best for walks or long drives.\n\n4/ **a16z Podcast**  \nGood mix of tech, AI, startups, and future thinking. Less hype, more context.\n\n5/ **The Tim Ferriss Show**  \nNot every episode hits, but when it does, it really does. Great for learning how top performers think.\n\n6/ **Lex Fridman Podcast**  \nLong, slow, thoughtful conversations. Not background noise — best when you can actually focus.",
          "score": 2,
          "created_utc": "2025-12-31 12:57:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwfior7",
          "author": "phatjimmyp",
          "text": "this episode is a cool cross between stem and magic. Loved Seth's approach to product with the emphasis on wonder at it's core.  \n[https://open.spotify.com/episode/4GceRiXYbAoWLsHAlRHX1v?si=wRiw0VWQQqOOBAWIdlMI-w](https://open.spotify.com/episode/4GceRiXYbAoWLsHAlRHX1v?si=wRiw0VWQQqOOBAWIdlMI-w)",
          "score": 1,
          "created_utc": "2025-12-28 21:18:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwftj3x",
          "author": "aggressive-figs",
          "text": "when I workout I listen to the daily TBPN. Also Acquired is good. ",
          "score": 1,
          "created_utc": "2025-12-28 22:12:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwgnnyk",
          "author": "Realclayman2",
          "text": "These are my favorite tech/startup podcasts: A16z, yc, startups for the rest of us, the next wave.",
          "score": 1,
          "created_utc": "2025-12-29 00:50:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwh88r8",
          "author": "shiwenbin",
          "text": "How I Built This is all time.  Episode w Ben and Jerry a personal favorite",
          "score": 1,
          "created_utc": "2025-12-29 02:48:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwhyise",
          "author": "julick",
          "text": "Lenny's Podcast",
          "score": 1,
          "created_utc": "2025-12-29 05:35:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwieo0v",
          "author": "Crafty-Sea-134",
          "text": "Also wanna ask: Is there any podcast help you acquire, expand, and keep healthy churn rate?",
          "score": 1,
          "created_utc": "2025-12-29 07:51:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwikmrm",
          "author": "chuyhouse2",
          "text": "Itnig - in Spanish",
          "score": 1,
          "created_utc": "2025-12-29 08:47:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwkjulv",
          "author": "Astraltraumagarden",
          "text": "If music makes you more productive, don’t switch it out during work time. During driving, walking, working out etc, sure. But make sure you don’t affect your motivation.",
          "score": 1,
          "created_utc": "2025-12-29 16:45:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwlw8ej",
          "author": "Auresma",
          "text": "Founders by David Senra",
          "score": 1,
          "created_utc": "2025-12-29 20:33:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwydyb7",
          "author": "android_69",
          "text": "Major downgrade going from music to biz podcast slop",
          "score": 1,
          "created_utc": "2025-12-31 18:27:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwhvesl",
          "author": "BusinessStrategist",
          "text": "You’re venturing into the « twilight zone » of creating a following. And a following is a cult.\n\nSo you tell us the profile of all those followers who are going to crave your every word!",
          "score": -4,
          "created_utc": "2025-12-29 05:12:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwi7fkl",
              "author": "ergonet",
              "text": "I understood that OP wants to listen to podcasts, and wants recommendations on what to listen, not to make them. \n\nUno of us got it wrong! 😅",
              "score": 2,
              "created_utc": "2025-12-29 06:47:29",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nwibeij",
                  "author": "BusinessStrategist",
                  "text": "Entrepreneurship is a journey.\n\nTo suggest a «route to take, » it helps to know where it is that you want to go.\n\n\n\nYes, you’re right. My assumption was that the question was about changing music to podcasts.\n\nThanks for pointing that out. \n\n\nSo, getting back to the « revised » question, what is the « desired destination? »",
                  "score": -3,
                  "created_utc": "2025-12-29 07:22:10",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1px4z1o",
      "title": "What are the creative ways you are using claude code?",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1px4z1o/what_are_the_creative_ways_you_are_using_claude/",
      "author": "Mediocre_Leg_754",
      "created_utc": "2025-12-27 18:34:25",
      "score": 21,
      "num_comments": 19,
      "upvote_ratio": 0.89,
      "text": "I have an email alias which convert the user mail threads to github issue when forwarded and claude raise a PR for it. Once the PR is merged and released, it notify the users that your issue is fixed.\n\nWondering how other people are using claude to be more productive.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1px4z1o/what_are_the_creative_ways_you_are_using_claude/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "nw8dgad",
          "author": "nicolascoding",
          "text": "Care to post your flow for this? I was using an api key for this, and that doesn’t use Claude code itself",
          "score": 3,
          "created_utc": "2025-12-27 18:43:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwbo0xq",
              "author": "Mediocre_Leg_754",
              "text": "Why use api key? Claude code allows you to install github actions.   \nWhy are you using API is it cheaper?",
              "score": 1,
              "created_utc": "2025-12-28 06:23:50",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwcou93",
                  "author": "nicolascoding",
                  "text": "No, I had issues getting Claude code proper into GitHub actions using the “/“ command in vscode",
                  "score": 1,
                  "created_utc": "2025-12-28 12:09:38",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwbhwtr",
          "author": "Patient-Bumblebee",
          "text": "I added my trading platform's MCP server to Claude. Now I can manage my portfolio while pretending to be working.",
          "score": 2,
          "created_utc": "2025-12-28 05:34:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwe4zmm",
              "author": "Mediocre_Leg_754",
              "text": "smart",
              "score": 1,
              "created_utc": "2025-12-28 17:20:08",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwbxybn",
          "author": "desparate_geek",
          "text": "I created auditors report in markdown and got it reviewed from the Company Secretary using Claude Code. The CS was surprised that I understand the terms like assets and liabilities as well.",
          "score": 2,
          "created_utc": "2025-12-28 07:54:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwe5255",
              "author": "Mediocre_Leg_754",
              "text": "I used it once to understand claims documents from insurance provider.",
              "score": 3,
              "created_utc": "2025-12-28 17:20:28",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nweur80",
                  "author": "desparate_geek",
                  "text": "Nice.",
                  "score": 1,
                  "created_utc": "2025-12-28 19:22:01",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nw93z5v",
          "author": "outceptionator",
          "text": "This isn't using subscription right?",
          "score": 1,
          "created_utc": "2025-12-27 21:04:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwbo2q8",
              "author": "Mediocre_Leg_754",
              "text": "I always keep claude code subscription and claude code allows you to install github actions",
              "score": 1,
              "created_utc": "2025-12-28 06:24:15",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwb0wcu",
          "author": "SuckWallStreetDry",
          "text": "I use it to do financial research on documents. It works great. Very expensive though which Im fine with as im investing lots of money. I gave it a whole workflow and it follows it very well.\n\nIf it fails somewhere, it just makes code to fix it. It's great!",
          "score": 1,
          "created_utc": "2025-12-28 03:38:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwbo4f1",
              "author": "Mediocre_Leg_754",
              "text": "What kind of financial research? Can you elaborate your workflows it seems interesting.",
              "score": 1,
              "created_utc": "2025-12-28 06:24:39",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwix2jq",
                  "author": "SuckWallStreetDry",
                  "text": "i let it consolidate investment reports and outlooks, and super compact the info to the most critical triggers in the macro world of finance. Think, \"AI-infra growing rapidly, clean energy and ESG becoming a metric for companies adopting AI. Lean towards renewables powering GPU datacentres.\".\n\nI than create a custom memo to the type of investor Im sending it to.I have a signup link to send these memos. its free.  \n[https://docs.google.com/forms/d/e/1FAIpQLSfxBrO2zAgNurneDw8YctsLTJpvdMRyWfp365MpxxPyiqN22Q/viewform?usp=dialog](https://docs.google.com/forms/d/e/1FAIpQLSfxBrO2zAgNurneDw8YctsLTJpvdMRyWfp365MpxxPyiqN22Q/viewform?usp=dialog)",
                  "score": 1,
                  "created_utc": "2025-12-29 10:43:35",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwclta3",
          "author": "Winter_Educator_2496",
          "text": "I needed to have a pretty comprehensive library for something. While it exists in another language in the way I need, it didn't exist in mine. I already attempted to create a simpler version of it on my own but ran into issues later down the line when I needed more complicated functionality with no clear way of implementing it.\n\n  \nSo I created the folder structure in my monorepo. Now, the repo is already big and the external library with all additions is even bigger. So I symlinked the folders out of my monorepo into a new workspace, submoduled the original library and vector indexed all the files.\n\n  \nI then created a local dependency graphs of the files and created a new task per file. Focusing on the ones that are easier to implement by lower number of local dependencies (that were yet unimplemented).\n\n  \nSo far so good. Claude Opus 4.5 was able to almost perfectly implement a large portion of functionality while preserving the original architecture of the original library. It was able to pass integration tests I wrote prior almost the first time.",
          "score": 1,
          "created_utc": "2025-12-28 11:42:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwe5ao0",
              "author": "Mediocre_Leg_754",
              "text": "This is actually a nice idea I am thinking porting a library to another language might be super easy now.",
              "score": 1,
              "created_utc": "2025-12-28 17:21:38",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwh93lq",
          "author": "JohnnyKonig",
          "text": "I was sick of seeing Claude recreate common features for each new app I work on, so I’ve been building a framework of app templates, feature modules, and UI component libraries - and cataloguing everything in a JSON file. Now I’m working on getting CC to use the catalogues to create or enhance apps instead of writing new code.\n\nIt’s pretty wild so far - I can spin up new marketing sites on node and deploy to vercel with a lot of consistency and very few hallucinations. I imagine this is how sites like Base44 work under the hood - but I plan on open sourcing everything and see if it takes.",
          "score": 1,
          "created_utc": "2025-12-29 02:53:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwie6ek",
          "author": "agilecreativity",
          "text": "Working on something like Claude Desktop but with build in MCP that I can customize. Been super fun learning how to minimize the token usages before sending in the request to different LLM not just Claude.",
          "score": 1,
          "created_utc": "2025-12-29 07:47:04",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1py19pt",
      "title": "As the year wraps up - what  books did you read this year that had the biggest impact on your entrepreneurial journey?",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1py19pt/as_the_year_wraps_up_what_books_did_you_read_this/",
      "author": "Electrical-Toe-7097",
      "created_utc": "2025-12-28 20:16:34",
      "score": 18,
      "num_comments": 12,
      "upvote_ratio": 0.96,
      "text": "As the title says.\n\nMy one has been The Mom Test! I learnt how to talk to people :)",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1py19pt/as_the_year_wraps_up_what_books_did_you_read_this/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "nwfbpxo",
          "author": "hellno-o",
          "text": "read some biographies that impacted me: Estee Lauder,Enzo Ferrari, Walt Disney, Akio Morita, Michael Dell\n\nmany inspired by founderspodcast.com",
          "score": 3,
          "created_utc": "2025-12-28 20:44:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwhl1ra",
          "author": "sheriffly",
          "text": "I'm yet to finish the mom test, it's half finished. Hope to complete it soon.",
          "score": 2,
          "created_utc": "2025-12-29 04:05:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwhvajw",
          "author": "No-Put450",
          "text": "Ai for engineering",
          "score": 2,
          "created_utc": "2025-12-29 05:11:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwm7phg",
          "author": "hellomrjorge",
          "text": "Zero to One and The Lean Startup",
          "score": 2,
          "created_utc": "2025-12-29 21:29:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwm93pf",
              "author": "m_yoda20",
              "text": "Read those books ages ago. I wonder if you still found them relevant today. Would you make a case that too much has changed for these to be relevant?",
              "score": 1,
              "created_utc": "2025-12-29 21:36:28",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nwmaiuj",
                  "author": "hellomrjorge",
                  "text": "Most definitely! It helped me narrow my focus on the product I am looking to build, understand if it's truly an iteration or zero to one type of product and to keep me from building a technical masterpiece that nobody actually wants to pay for.",
                  "score": 1,
                  "created_utc": "2025-12-29 21:43:24",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwntv2e",
          "author": "Critical-Pudding6740",
          "text": "The Mom Test as well! But what I realized that is I have to read it again and again. Read it the first time, go have some customer interviews, come back to analyze the call scripts to reflect if I'm asking good questions, read the book (parts of it) again, and keep doing so.\n\n  \nTruth seeking is so important in becoming an entrepreneur.",
          "score": 2,
          "created_utc": "2025-12-30 02:40:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwj33dd",
          "author": "PuddyComb",
          "text": "The Cosmic Serpent last month. It was a bit of a slog- but it showed me that there is no real money in chemistry and the 'bio-medical struggle'.  \nA scientist travels to the Amazon and tries Ayahuasca, and his DMT journey enlightens him on the formation of DNA and it is all loosely tied together. But \\[entrepreneurial journey\\]; it is anything but. Despite what lies Joe Rogan may spout at you. Genetics Research, and Pharmacokinetics is too broad a spectrum of realistic scientific study to be reduced to podcast material.",
          "score": 1,
          "created_utc": "2025-12-29 11:37:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwodi2f",
          "author": "ArgumentOk3359",
          "text": "\"Make Time\" is really really good!!",
          "score": 1,
          "created_utc": "2025-12-30 04:35:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwou1zc",
          "author": "aviboy2006",
          "text": "Steve Job biography.",
          "score": 1,
          "created_utc": "2025-12-30 06:37:13",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pxz3xa",
      "title": "Founders: if you found a problem to solve, how do you find potential customers to interview ?",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1pxz3xa/founders_if_you_found_a_problem_to_solve_how_do/",
      "author": "Electrical-Toe-7097",
      "created_utc": "2025-12-28 18:51:22",
      "score": 15,
      "num_comments": 24,
      "upvote_ratio": 0.79,
      "text": "Basically the title.\n\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1pxz3xa/founders_if_you_found_a_problem_to_solve_how_do/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "nwesy9n",
          "author": "outceptionator",
          "text": "How do you know it's a problem without knowing anyone in the space? \n\nWarm intros then cold outreach seems like your best options.",
          "score": 20,
          "created_utc": "2025-12-28 19:13:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwet58y",
              "author": "Electrical-Toe-7097",
              "text": "Maybe because I experience the problem myself but wanted to validate by finding users experiencing the same.\n\nLatter part makes sense!",
              "score": 3,
              "created_utc": "2025-12-28 19:14:24",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwq2nok",
                  "author": "Moist_Cardiologist83",
                  "text": "I think you got the first part: having a hypothesis about a problem. Now it’s time to make sure how massive the problem is, or in other words, how many people are suffering it and if/how many of them would be willing to pay for it.\n\nI’d recommend defining who your ideal customer is and then double down on who you think your early adopters could be. As the other response said, intros, could outreach could give you a head start. \n\nSometimes validating among friends or peers may not be the best, as you may find some biases.",
                  "score": 1,
                  "created_utc": "2025-12-30 13:04:37",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwevxme",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 8,
          "created_utc": "2025-12-28 19:27:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwew3n2",
              "author": "Electrical-Toe-7097",
              "text": "I like your marketing",
              "score": 4,
              "created_utc": "2025-12-28 19:28:26",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nweze8v",
          "author": "puddle-shitter",
          "text": "found someone complaining about the problem im solving on twitter. dm'd them, and realized most people with the same job as this person faced similar problems, and although this initial user churned away, it gave me the perspective for the kind of people I could reach out to for getting more users. Its a slow process, you'll reach many points where you might think no one wants to use your product, but you will find someone. And the easiest way to test whether or not this problem space will have users is if you're building for yourself.",
          "score": 6,
          "created_utc": "2025-12-28 19:44:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwh1ank",
          "author": "SystemicCharles",
          "text": "Honestly, I think it’s a bad idea to “find a problem”. There are so many nuances that go into solving a problem and providing a solution that people will want to pay for. You either have the problem yourself and understand it, have someone on your team that already understands the problem, or spend time living with and obsessing over the problem yourself before and during the time you’re conducting interviews.",
          "score": 2,
          "created_utc": "2025-12-29 02:09:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwiswp4",
              "author": "reddit_user_100",
              "text": "Lenny interviewed a bunch of B2B founders and found 60% of them did not solve their own problem: [https://www.lennysnewsletter.com/p/how-the-most-successful-b2b-startups](https://www.lennysnewsletter.com/p/how-the-most-successful-b2b-startups)",
              "score": 2,
              "created_utc": "2025-12-29 10:05:12",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nwj0lqg",
                  "author": "SystemicCharles",
                  "text": "Uhh. Yeah. Most people do not care about solving their own problems. What about the 40%?",
                  "score": 1,
                  "created_utc": "2025-12-29 11:15:13",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwgnn84",
          "author": "Content-Ebb-4761",
          "text": "Over LinkedIn",
          "score": 1,
          "created_utc": "2025-12-29 00:50:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwkqwp2",
          "author": "Glittering-Fig-9252",
          "text": "I just created this [GPT](https://chatgpt.com/g/g-69529a982258819188582ebcbf4aeea6-before-you-pitch) that’s meant to help find their target customers on and offline.",
          "score": 1,
          "created_utc": "2025-12-29 17:18:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwksiqv",
              "author": "Wide_Brief3025",
              "text": "I’ve found it super useful to hang out in relevant subreddits and read conversations to spot what people are actually struggling with. Joining the discussion often leads to great insights and sometimes even DM conversations. If you want to streamline finding these conversations and filter leads efficiently, ParseStream can help by alerting you to posts mentioning your keywords.",
              "score": 1,
              "created_utc": "2025-12-29 17:26:23",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nwktvd2",
                  "author": "Electrical-Toe-7097",
                  "text": "bro your marketing strategy needs to improve",
                  "score": 2,
                  "created_utc": "2025-12-29 17:32:50",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            },
            {
              "id": "nx3conf",
              "author": "ExcitingWear4813",
              "text": "Thanks man, this is helpful. Also does this gpt go away with an update.....I had a similar one for another purposes but it went away with an update. ",
              "score": 1,
              "created_utc": "2026-01-01 15:45:52",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nworu1f",
          "author": "aviboy2006",
          "text": "Keeping eye on where is problem exist and checking out way to connect with those users have casual chat. recently i did couple of chat with users ( future potential users ) while traveling back to India. This gave me interesting insights.",
          "score": 1,
          "created_utc": "2025-12-30 06:18:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwpf66b",
          "author": "BusinessStrategist",
          "text": "If you’re a practitioner of the « gemba walk, » your hearing is tuned to the low level moaning and groaning of chronic pain.",
          "score": 1,
          "created_utc": "2025-12-30 09:50:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwvu2vy",
          "author": "Ok_Face_2942",
          "text": "Wynter, sure there are also other”focus group” type platforms out there where u can directly chat with your ICP to validate pain points.",
          "score": 1,
          "created_utc": "2025-12-31 08:31:25",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pw2itj",
      "title": "What did yoy prioritise months before launching your product? (No promo please)",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1pw2itj/what_did_yoy_prioritise_months_before_launching/",
      "author": "LeftieLondoner",
      "created_utc": "2025-12-26 11:49:53",
      "score": 14,
      "num_comments": 6,
      "upvote_ratio": 1.0,
      "text": "We have spent last few months planning and building architecture, designing features based on use cases highlighted by ICP and ECP groups, built customer wait list, did customer discovery interviews to validate problem, and arranged demo with some of them (others have no responded and I need to chase). Did basic SEO work but not too much on SEO. our website appears as first one if you search name of company. No blogs or articles. I struggled to balance customer engagement and product development in terms of time spent. We are planning to launch pilot in next two months. What key tips and things should we prioritise? We have few demos booked in january. I am new to startup space. \n\nWe are market intelligence saas specifically for the pharma and biotech market. \n\nPlease do not advertise or market your products. We will block you. ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1pw2itj/what_did_yoy_prioritise_months_before_launching/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "nw0q58g",
          "author": "mhuzaifadev",
          "text": "Focus on being fast and execute what works. Scalability and code refactoring can be done with the revenue in bank. And it worked for us...\n\nSecond build a basic before going for a feedback, prioritize feedback if they pay. Most of them are just noise anyways.",
          "score": 4,
          "created_utc": "2025-12-26 13:20:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "nw1a9wu",
              "author": "SquareKaleidoscope49",
              "text": "This will lead you to be roasted by any friends you might hire though. So be prepared for that. Luckily I was. Our code was... doing it's best.",
              "score": 3,
              "created_utc": "2025-12-26 15:28:00",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nw1rqon",
                  "author": "mhuzaifadev",
                  "text": "Yupp, totally agreeable. Been there :)",
                  "score": 1,
                  "created_utc": "2025-12-26 17:01:55",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nw15vr9",
          "author": "vaibhavgeek",
          "text": "If you understand your ICP / ECP groups very well, then you can organise a fun banter on a topic they are really interested in (could be something as lame as pickleball), this will help you build relationships before you sell them anything.",
          "score": 3,
          "created_utc": "2025-12-26 15:02:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw1veax",
          "author": "VoltageLearning",
          "text": "So we actually ended up launching twice. We created a version one of our product that was fully free. Pretty barebones UI using WordPress, with the sole intent of getting sign ups and then survey users about their thoughts. \n\nAfter collecting roughly 40 pieces of survey information, we poured all of those data and insights into our version two, a platform with a far greater UI, snappier design, and larger number of features. \n\nCurrently, growth has been good and steady. Our goal is to add at least one paid user per week, and I’ve been able to hit that for a majority of weeks.",
          "score": 2,
          "created_utc": "2025-12-26 17:21:18",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pxr6rl",
      "title": "Founders - can I replace customer interview meetings with text based approaches like emailing and private messages?",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1pxr6rl/founders_can_i_replace_customer_interview/",
      "author": "Ok_Corgi8008",
      "created_utc": "2025-12-28 13:20:06",
      "score": 8,
      "num_comments": 27,
      "upvote_ratio": 0.83,
      "text": "I’ve read a few books and they’ve emphasised doing customer interviews via coffee chats, video calls, meetings but the books are quite old.\n\nBut can I still get the same results by emailing people, Reddit DMs, blog comments and avoiding the 1to1 meetings completely ? ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1pxr6rl/founders_can_i_replace_customer_interview/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "nwd0k1u",
          "author": "gruffbear212",
          "text": "Sort answer: no. \n\nReason is because you don’t know what you don’t know. So you don’t know what to ask them in a message, and you need to have a conversation to see where it goes and what it unfolds. \n\nRead Running Lean by Ash Mayura. \n\nThis is not the part to skip on or get wrong btw, because you probably won’t realise until you’re 18 months or a fair chunk of cash lighter that you’ve miss read the demand. There is no fix for there not being demand except starting again.",
          "score": 14,
          "created_utc": "2025-12-28 13:38:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwd1yq8",
          "author": "AbstractHikingTrail",
          "text": "No. I'm sure the books you read emphasize that the point of the in-person interviews and customer development are to identify unsolved pain. The way to do this is through open-ended questions. Normally when you send out text-based surveys you give multiple choice options. What this means is that this method would typically be used to validate or invalidate a hypothesis. This can be useful when focusing on questions that validate a direction like technical fit but not to validate whether your startup idea will be successful.",
          "score": 5,
          "created_utc": "2025-12-28 13:47:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwd6x69",
          "author": "WebImpressive3261",
          "text": "No. There’s no way to get into the depth you need over comments and emails.",
          "score": 4,
          "created_utc": "2025-12-28 14:19:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwd2sew",
          "author": "rrrx3",
          "text": "Lmao. No. Don’t be lazy.",
          "score": 6,
          "created_utc": "2025-12-28 13:53:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwdp5lh",
              "author": "kadam_ss",
              "text": "Exactly.\n\nIf you don’t get why “those books” recommend it and you are doing it because they tell you to, you are ngmi",
              "score": 1,
              "created_utc": "2025-12-28 16:01:00",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nwdkadb",
          "author": "Longjumping_Ant_6991",
          "text": "The approach we took is that we interviewed 100 ppl in-person first. This help us tremendously to iterate the product and figure out what problems we are solving. The benefit of doing this in-person is that you can read their body language and get much more information from the person you are interviewing. Helps you move a lot faster.\n\nNow that being said, this is not scalable. Eventually you gonna feel like you tap out on the information you are getting. At this point, targeted and shorter surveys or questions digitially works great. But without the in-person interviews, it would have been difficult to know what to really ask.",
          "score": 3,
          "created_utc": "2025-12-28 15:35:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwczju5",
          "author": "Uncle_Richard98",
          "text": "Try it and see how it goes. \n\nThere’s a reason “old school” methods still works. Humans are social animals. We trust much more in each other if we meet people in person or talk with them face to face (by video calls) than just emails or private messages which is very robotic. You’re trying to implement a tech solution for a thing that is a social / human feature.",
          "score": 2,
          "created_utc": "2025-12-28 13:31:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwczqdb",
              "author": "Ok_Corgi8008",
              "text": "Makes sense. \n\nAny tips on how to get more social, the idea of meeting people I never know and try sell them something seems too scary to me",
              "score": 1,
              "created_utc": "2025-12-28 13:33:09",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwd0aog",
                  "author": "Uncle_Richard98",
                  "text": "You don’t try to sell them things, you have to establish a connection first. Go to social events where you know this certain profile of people will be there and try to make connections or be part of online communities who organise online events. \n\nAnd when you make a connection avoid at all costs trying to “sell” something , don’t even mention you’re trying to build something. Make questions about a specific problem you’re trying to solve but without sounding you’re a scammer trying to sell a device. There’s a book called “The Mom Test” that explains exactly what founders should do when talking with possible new customers or try to validate the idea.",
                  "score": 3,
                  "created_utc": "2025-12-28 13:36:54",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nweqptm",
                  "author": "Electronic_Wear3103",
                  "text": "I can resonate with this feeling. While I know there is no equal alternative to meeting people personally and getting to know them & their pain points in a specific domain, leaning to know how they are solving that problem if at all they are solving it!   \n  \nHowever, since I am not a natural storyteller or a great speaker, I ended up with lot of awkward silences and whenever I was there with best of my energies, I realised that many times, people don't say exactly what they mean and often times they also don't know what they actually want. But over time I realised this is part of the process to go through, and I am trying to learn this and genuinely trying to connect with them without selling them anything. \n\nSince I was also serving other clients for their own products, I realised everyone needed a tool that can help them validate their idea / product. And what's even more exciting here is that you can do customer interview meetings and talk to your potential customers easily via AI customer persona. (Sorry to shamelessly plug this here, but this couldn't be more related than what I have gone through before). I still believe there is nothing better than talking to people personally and in real life but the next best things could be [launchcheck.me](http://launchcheck.me) \n\nThis is free to use and not only you can validate your idea in detail but also talk to you AI customer persona (which you will be amazed about as you won't be able to differentiate if its a human or an AI customer). It gives you a blunt truth about your idea and no biased thoughts. While this tool is still in progress but phase 1 is still meaningful and usable. \n\nLet me know if this helps you in some way and if you have any feedback for me.",
                  "score": 1,
                  "created_utc": "2025-12-28 19:03:12",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwdwkwv",
          "author": "Ahmad_Azari",
          "text": "No and Ill explain why.\n\nCustomers would typically do the survery if they have one of two\n1) loyalty to the company in service\n2) loyalty to sales rep/contact at the company in service.\n\n\nSince you are a start up founder, you probably (definitely) dont have that strong brand for loyalty customers. You need your customers to remember your face/name/voice/attitude as much as possible for them to help you on your journey. \n\nRight now, as a founder, honestly dont see your clients as clients but rather as partners in your success journey. The time you dedicate to them, is arguably more important than building because the last thing you want is to built the wrong thing.",
          "score": 2,
          "created_utc": "2025-12-28 16:38:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwditum",
          "author": "Tall-Log-1955",
          "text": "No",
          "score": 1,
          "created_utc": "2025-12-28 15:28:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwduvpk",
          "author": "ToddFromLeon",
          "text": "Hard no. Match the medium to the importance of the task. There’s nothing more important than talking to customers, so there’s no way you should leave it to a medium that is asynchronous, lacks tone, lacks non-verbal comms, etc.",
          "score": 1,
          "created_utc": "2025-12-28 16:29:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwe7gc5",
          "author": "Golandia",
          "text": "It depends on your ICP. You can get data from consumer level customers this way. Enterprise customers will even respond to these. Typically this is done survey style because people won’t write you an essay. E.g. you want to learn what beers people drink, how often, etc, within your ICP because you have an idea for a new beer. \n\nYou will also only learn what you ask about. When you interview people, you have the opportunity to shape the interview and learn new information faster. E.g. you can give people your beta beers to taste, learn more about when and why they drink beer, if they don’t, what do they drink and why, etc. It’s a lot more data from that specific potential customer. ",
          "score": 1,
          "created_utc": "2025-12-28 17:32:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nweq5dk",
          "author": "the_chan",
          "text": "Here’s YC’s playbook on talking to customers and why. https://youtu.be/z1iF1c8w5Lg",
          "score": 1,
          "created_utc": "2025-12-28 19:00:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwhu1mc",
          "author": "dipeshsukhani",
          "text": "Sadly No.  Doing user interviews is critical.  In fact, doing these interviews yourself (I am assuming you are the founder) is equally critical.  More so in 2025, it is your \"personal\" brand which has a major influence / impact.  In-fact there is a term: \"Founder Led Growth\", just to highlight how much critical it is for the \"Founders\" to have a personal relationship with users and that comes most effectively through in-person user-interviews (VoIPs / Online Meets are a good second position)",
          "score": 1,
          "created_utc": "2025-12-29 05:02:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwidvfp",
          "author": "Crafty-Sea-134",
          "text": "You can. The important thing is not the form, but the way. I have a customer who drinks cappuccino in the sf cafe and chats with him, and another one is completely typing because of the time difference.",
          "score": 1,
          "created_utc": "2025-12-29 07:44:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwkr5qf",
          "author": "Glittering-Fig-9252",
          "text": "You might find this [GPT](https://chatgpt.com/g/g-69529a982258819188582ebcbf4aeea6-before-you-pitch) helpful, it helps you find and prepare for IRL customer convos.",
          "score": 1,
          "created_utc": "2025-12-29 17:19:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwlg8il",
          "author": "Head_Car_2922",
          "text": "No, show up, make the cold calls, get rejected. Conversations generate 1000x more information than texting. I am not filling out a survey, I will have a cup of coffee.",
          "score": 1,
          "created_utc": "2025-12-29 19:16:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwp9oe6",
          "author": "ImprovementSad8560",
          "text": "you can´t dm people for stuff they don´t understand themselves. Unfortunately it´s really hard and you have to input the effort.",
          "score": 1,
          "created_utc": "2025-12-30 08:58:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwrw5xy",
          "author": "_dremnik",
          "text": "big no. you have to talk to people, there's just no substitute for seeing their live reaction and also establishing a bond with them.",
          "score": 1,
          "created_utc": "2025-12-30 18:34:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwvhhiy",
          "author": "VVVVV218-",
          "text": "do you need customer interview meetings when applying?",
          "score": 1,
          "created_utc": "2025-12-31 06:37:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwvjns5",
              "author": "FingerConfident1788",
              "text": "I agree",
              "score": 1,
              "created_utc": "2025-12-31 06:55:37",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nx1ly1n",
          "author": "drakondev",
          "text": "...the facial expression alone tells you alot of the pain point a customer has faced/is facing. You will never be able to experience & analyse this in an email/text message, especially with most people replying using AI.",
          "score": 1,
          "created_utc": "2026-01-01 06:35:55",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pybj02",
      "title": "Discipline when it comes to being a founder",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1pybj02/discipline_when_it_comes_to_being_a_founder/",
      "author": "overquantityi",
      "created_utc": "2025-12-29 03:38:09",
      "score": 8,
      "num_comments": 4,
      "upvote_ratio": 0.8,
      "text": "So I'm working on a saas and I'm also diagnosed with bipolar and bpd, for the last 4 days I've had a depressive episode and i couldn't work because I'm doing this full time. Because of that, i missed out on multiple potential clients, some who showed interest, some i had demos planned with. Does anyone have a similar experience, if so, how do you deal with it and staying on track even tho you feel like you can do anything about. Any advices are appreciated 🙏.\n\nI also wanted to mention that I'm a solo founder and only have another person working for me as an advisor. \n\nThanks",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1pybj02/discipline_when_it_comes_to_being_a_founder/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "nwhmlbl",
          "author": "NordicLard",
          "text": "Sounds like you need a cofounder so that if/when this happens again you have someone to cover for you. Your ailment seems like it would make it difficult to be a solo founder.",
          "score": 6,
          "created_utc": "2025-12-29 04:14:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwieicg",
          "author": "Crafty-Sea-134",
          "text": "I think you have to have a mindset, that is, your bipolar can be a talent to help you bring customers or it may be difficult as you describe. You have the right to decide. \nI have obsessive-compulsive disorder, which is always late than the delivery date. But when I fully opened my heart to talk to customers, I knew the difficulties that hindered me deeply. Later, I completed the task with this obsessive-compulsive disorder more perfectly than my competitors.",
          "score": 1,
          "created_utc": "2025-12-29 07:50:05",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pyj0uo",
      "title": "Anyone launch a business while being a new parent?",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1pyj0uo/anyone_launch_a_business_while_being_a_new_parent/",
      "author": "LeftieLondoner",
      "created_utc": "2025-12-29 10:32:21",
      "score": 8,
      "num_comments": 13,
      "upvote_ratio": 0.83,
      "text": "I'm planning to launch a business in few months while also managing a 1 year old with my partner. He goes to nursery during term times so only find weekends tough. Anyone else successfully running a business with young kids? Any tips on time management? Did it help to have co-founders? I am on non technical side and its a saas business.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1pyj0uo/anyone_launch_a_business_while_being_a_new_parent/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "nwo63tm",
          "author": "Consistent-Wafer7325",
          "text": "2 kids (4yo,4mo) here, we got the 2nd one as I’m building my new company since 18mo, we raised about 12m$ in pre-seed + seed. Things moving fast. \n\nIt’s clearly a challenge (sleep organization essentially and lack of free time), but nothing impossible. \n\nMy 2 cents : \n\n- make clear with your partner that you’re an early stage entrepreneur (you cannot just “stepback” for a few months in your 9to5 job) \n\n- You need help (partner, family,…) and take as maximum as you can. Budget babysitters if needed you’ll see quickly the payback \n\n- Make also clear to yourself that you need a bit of free time, like sports or whatever. Work + parenting is intense, you need cooloff time for you.",
          "score": 4,
          "created_utc": "2025-12-30 03:50:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwthunn",
              "author": "LeftieLondoner",
              "text": "First of all congrats on the kids and the funding. This is helpful. Its my first startup after holding down corporate job for 12 years. And I definitely don't have the luxury of funding so need to put the hours in so we can raise after launch. Will seek extra help with childcare. Currently i work 8am to 5pm, then 7pm to 10pm during the week. On weekends, i work most evenings. Hopefully i can squeeze in sports once things settle.",
              "score": 1,
              "created_utc": "2025-12-30 23:13:26",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwv28a2",
                  "author": "Consistent-Wafer7325",
                  "text": "Fundraising or not, things are the same, even more hustling planned after fundraising haha 🤣 \n\nGodspeed",
                  "score": 1,
                  "created_utc": "2025-12-31 04:43:13",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwqg6qz",
          "author": "DecadeJourneyLoL",
          "text": "No kids, but I may be able to help?  \nDon’t underestimate the power of **batching** tasks. I batch all my cooking, all my routine tasks and do them all during the weekend.  \nhaving a co-founder can really ease the burden. If you can share the workload, it makes all the difference.",
          "score": 2,
          "created_utc": "2025-12-30 14:24:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwti5zu",
              "author": "LeftieLondoner",
              "text": "Luckily i have cofounder. I need to get back to batch cooking.",
              "score": 2,
              "created_utc": "2025-12-30 23:15:07",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwukp8g",
                  "author": "Less-Opportunity-715",
                  "text": "DoorDash solves this",
                  "score": 0,
                  "created_utc": "2025-12-31 02:52:41",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwkscr0",
          "author": "RecognitionLivid6472",
          "text": "I had a lot of free time when my kid was born. I was lucky, she was a good sleeper and babies do sleep 16-12 hours at the beginning. It was way more challenging when she reached 2-3 years and dropped the midday nap. But depends on the baby, some are not so good sleepers, have tummy pain, up all night, etc. Also depends on your support system, if family members or others are available to babysit here and there. But I think it's much easier than managing a kid while having a 9-to-5 job.",
          "score": 2,
          "created_utc": "2025-12-29 17:25:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwt598q",
          "author": "realbrownsugar",
          "text": "I was working on my startup pre-revenue and pre-funding. 1 year in, we had a baby. The first 4 months were hell until you sleep train your baby. \nBased on the luck of your draw, your baby might give you all the free time albeit sharded , or require a lot of attention as in our case where she didn’t latch well and had to be tube fed.\n\nTwo months in, it was clear to me I had to let go of my business child and prioritize human child’s future. A month later I was working at another YC startup. It was pretty intense for the first 6 months burning out both at home and at work. Then I joined Meta for a slower pace in life (Meta is supposedly intense… BS). It’s been over a year at Meta and having no regrets except for the boring mundane corporate BS work.\n\nOTOH, one of my friends had a baby 2 years in post seed raise and pmf. He just had his second child and company has a 2B valuation.\n\nBasically, you will have to make a hard decision, but you can’t make it until you know your babies and personal financial needs. Take at least 4 weeks of paternity (even from your own startup) and reassess your situation honestly.",
          "score": 1,
          "created_utc": "2025-12-30 22:08:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx241ju",
          "author": "Four_sharks",
          "text": "Yep and I am not having a good time ",
          "score": 1,
          "created_utc": "2026-01-01 09:42:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx347va",
          "author": "somuchblood",
          "text": "I have 3 kids under 5yo and I’m the sole earner running a venture backed startup. \n\nMy wife stays home full time to take care of them. I work long hours, but I still make sure I eat dinner with them every day and be present when I’m with them. \n\nIn the end, there’s no avoiding the fact that you working long hours = your spouse also working long hours with the kid. \n\nEnsure you keep your spouse in a good mental space. Pay for a babysitter and get some 1:1 time together. Have fun with them (don’t be a zombie after a long work day). Bring the energy when you arrive at home and boost everyone’s spirits.",
          "score": 1,
          "created_utc": "2026-01-01 14:56:16",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pv31f5",
      "title": "Resources to Product Engineering skills for startup roles",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1pv31f5/resources_to_product_engineering_skills_for/",
      "author": "ArabSays",
      "created_utc": "2025-12-25 02:15:44",
      "score": 7,
      "num_comments": 1,
      "upvote_ratio": 0.9,
      "text": "I’m a DS at a FAANG. Been at a FAANG for a while (10+ years). Can develop strong models to solve problems but the chasm of taking a model and packaging it as a product is something I completely lack. I usually just hand it off to engineering and they do the job. Tried to shadow but management said not on their time.\n\nI’ve built solutions using Streamlit internally, but the process doesn’t expose me to backend framework as much as I’d like to work with. I now have more time than usual in learning new things and I’d like to develop the product engineering muscle: setting up infrastructure, spinning up hosts, building out an MVC site, the whole product engineering flow basically.\n\nWhat courses or literature you found helpful to help you bridge or close this gap? I can code fine but I honestly would like to develop that SWE muscle that I know I lack. I considered UPenns MCIT (basically a BS in CS wrapped up in MS but without all the electives and general Ed) but I felt that it’s too focused on theory.\n\nMy intention is to develop my own product. I’ve built few sites long time back when jQuery was cool but I need to definitely upgrade my knowledge with the latest stack and best practices of today.\n\nEDIT: Botched the title but basically looking for resources to develop product engineering skills so I can dive into the startup world",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1pv31f5/resources_to_product_engineering_skills_for/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "nvto7fx",
          "author": "redditterrrrrrrrrr",
          "text": "You can start off with supabase, and aws lambdas.\nBuild prototypes/websites starting off with supabase, and for any internal logic handling - aws lambdas.\n\nThis would also let you handle user auth flows and management. Allowing you to conveniently share prototypes with users.",
          "score": 3,
          "created_utc": "2025-12-25 04:17:56",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pwv99i",
      "title": "How has vibe coding changed your approach to customer discovery and validation?",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1pwv99i/how_has_vibe_coding_changed_your_approach_to/",
      "author": "WebImpressive3261",
      "created_utc": "2025-12-27 11:01:42",
      "score": 4,
      "num_comments": 4,
      "upvote_ratio": 0.83,
      "text": "I’m specifically curious about what you did before vs what you do now?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1pwv99i/how_has_vibe_coding_changed_your_approach_to/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "nw71iqu",
          "author": "RushElectronic8541",
          "text": "Vibe coding didn’t change it but I evaluate conclusions from transcripts using AI. Customer Discovery identifies workflows, pain points and the decision chain of who uses and who buys, I don’t see how vibe coding touches any of that.",
          "score": 3,
          "created_utc": "2025-12-27 14:34:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nw85eeh",
          "author": "caldazar24",
          "text": "In the very early days, I used to show people mock-ups or describe products and ask if they would use them, now it’s working prototypes. \n\nNot much else has changed",
          "score": 3,
          "created_utc": "2025-12-27 18:03:38",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1q0mqil",
      "title": "At a crossroads with my startup role. Looking for perspective.",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1q0mqil/at_a_crossroads_with_my_startup_role_looking_for/",
      "author": "Different-Bridge5507",
      "created_utc": "2025-12-31 20:33:30",
      "score": 3,
      "num_comments": 7,
      "upvote_ratio": 1.0,
      "text": "I joined a tech startup in my industry and was initially hired for a product-facing role. That’s since morphed into me basically running the entire commercial side of the business solo. The investor is pretty cheap, which is why I’m a one-man show. Tech is fully outsourced to India with no stateside CTO.\n\nThe good: I’ve always wanted to run my own thing someday, and I’ve basically been handed the reins here. My background wasn’t in sales, so this has been a crash course. I’m learning a ton, all skills I’d need if I ever go out on my own. From a personal development standpoint, being thrown into the fire has been valuable.\n\nThe problem: I’ve developed a new product idea that has solid validation. Through my industry connections, I have no shortage of potential customers willing to sign up. But executing on it requires some non-trivial technical integration work, and I’m not confident our outsourced dev team can pull it off without a strong technical leader stateside.\n\nOn top of that, I have zero equity. That conversation keeps getting punted. This idea is 100% mine, I’ve validated it, and I’ve gotten buy-in from major industry players. Yet I’m not sure we have the team or the capital to actually build it.\n\nMy dilemma:\n\t∙\tPart of me wants to take this idea somewhere else where I’d actually have ownership. But I’m pretty sure my employment contract would create legal issues.\n\t∙\tI also can’t afford to go without a salary to build something from scratch.\n\t∙\tMaybe I should just treat this as a low-risk learning ground? A proof point that I can take an idea from inception to revenue, which I can leverage later when I do go out on my own?\n\nWould love to hear from anyone who’s been in a similar spot. How do you weigh the learning opportunity against the lack of equity and resources?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1q0mqil/at_a_crossroads_with_my_startup_role_looking_for/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "nwzic6f",
          "author": "Sufficient_Ad_3495",
          "text": "So, no stateside CTO.  \nYou' re in sales and ops  \nY haven't been asked to develop this internally, but  i assume, this issue seems verified preliminarily and legit... so  \n Dont inform existing company yet, you have not been asked to.  \nSo next, why are you on this? What happened and how convinced are you of it?  \nYou' re running the office as basically sales VP it seems.  Where is the CEO?  \nAre you being renumerated to introduce new ideas? If not why not? leverage that issue and fight for higher status before introducing the new idea.  \nThe issue is this \" I also can’t afford to go without a salary to build something from scratch.\". Only you know the reasons why. so without that, your self development idea is dead in the water.  \n\n\nYou are very unlikely to take an idea to new company whether they then employ you. They will simply take your idea. Ask you to reveal it through interview and then adopt it if it’s valuable if it’s of use you have to run with it yourself or introduce it into your current role but there are questions here about your current role and whether or not you are empowered even to introduce ideas. You should be the CEO and if not, wh0 is?",
          "score": 3,
          "created_utc": "2025-12-31 22:02:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwzj3n7",
              "author": "Different-Bridge5507",
              "text": "There is no “CEO”, it’s just me and our offshore dev team.",
              "score": 1,
              "created_utc": "2025-12-31 22:07:02",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwzpv2y",
                  "author": "Sufficient_Ad_3495",
                  "text": "Then who is employing you? Where are they? Whom are you reporting to? why are they not present by title and role?  Something feels off here. What job role did they give you? and what of future prospects did they say?",
                  "score": 5,
                  "created_utc": "2025-12-31 22:45:41",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nx0tbtf",
          "author": "zenspirit20",
          "text": "I didn’t understand, what do you mean it’s your idea and you are leading all business execution but you have no equity?",
          "score": 3,
          "created_utc": "2026-01-01 02:54:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx1ozi3",
          "author": "Itchy-Development627",
          "text": "Sounds like you should found a company and join the ycombinator :D",
          "score": 1,
          "created_utc": "2026-01-01 07:04:43",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}