{
  "metadata": {
    "last_updated": "2026-02-20 17:10:01",
    "time_filter": "week",
    "subreddit": "ycombinator",
    "total_items": 14,
    "total_comments": 120,
    "file_size_bytes": 154553
  },
  "items": [
    {
      "id": "1r6yrrz",
      "title": "How are you guys doing marketing as a solo founder?",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1r6yrrz/how_are_you_guys_doing_marketing_as_a_solo_founder/",
      "author": "Delicious_Bed_4410",
      "created_utc": "2026-02-17 06:37:03",
      "score": 86,
      "num_comments": 58,
      "upvote_ratio": 0.96,
      "text": "I’m very strong technically. I can build fast, ship features, set up infra, automate workflows. I also run my own local service business, so I understand customer acquisition in a traditional sense.\nBut SaaS marketing feels like a different universe.\nThere’s so much noise:\n\n“Build in public”\n“Do SEO”\n“Post daily on LinkedIn”\n“Cold email at scale”\n“Run ads”\n“Start a community”\n“Hire influencers”\n\nAnd whenever I ask for advice, the default response is: “Get a cofounder.” “Hire a marketing person.”\n\nThat’s fine advice long-term. But I’m asking as a solo founder who wants to learn distribution properly not outsource the skill immediately.\n\nFor those who’ve grown a SaaS solo:\n\n1) What channel actually moved the needle ?\n2) How did you validate it before going all in?\n3) Did you focus on one channel aggressively or test multiple?\n4) Any specific tools or systems that helped you stay consistent?\n5) Im not afraid of hard work. I just don’t want to spray energy across 10 channels without a clear approach.\n\nIf anyone has a structured way of thinking about SaaS marketing as a technical founder, I’d genuinely appreciate it.\n\nFor context - we're building a B2C job platform focused on helping job seekers apply smarter and faster. It's not just a traditional job board; we're combining curated listings with automation tools that reduce friction in the application process and increase response rates.\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1r6yrrz/how_are_you_guys_doing_marketing_as_a_solo_founder/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o5trku3",
          "author": "narrow-adventure",
          "text": "I’m honestly just trying to get as much feedback as possible while learning more about what people like and dislike in my solution.\n\nI don’t think that there is a one size fits all, but my tool is an open source telemetry platform for engineers so having an open source community would be nice, I’ll definitely be working more on facilitating that. Maybe that wouldn’t apply to you as it’s a b2c.",
          "score": 13,
          "created_utc": "2026-02-17 07:00:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5x7hm7",
              "author": "eh-tk",
              "text": "As a product marketing consultant I agree with this! but with one small addition:\n\nRecord and write down as much feedback as possible. Every time someone tells you what they like about your product/feauture, you can use that to inform the words on your website.\n\nEvery time someone tells you about an issue with a competitor, same thing.\n\nThe best use of AI for marketing, is being able to transcribe every conversation and find trends and themes in them",
              "score": 6,
              "created_utc": "2026-02-17 19:51:20",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5xznfw",
                  "author": "narrow-adventure",
                  "text": "Oh wow that is really smart.\n\nI’ve realized that whenever I apply the feedback I also update the website but it never occurred to me to write all these progressions and original comments down to be able to both see the product evolution AND help focus on in the marketing materials in the future.",
                  "score": 2,
                  "created_utc": "2026-02-17 22:04:12",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o600vga",
              "author": "bersuku",
              "text": "hey! im actually bringing together 8 dev tool founders that are in similar stages for deep feedback. Lmk if youre interested! Secondly, for feedback in general im hosting an event right now (YC vs Indies) where users can choose a side, upload their product for the community to review:  [kaijubeam.com](http://kaijubeam.com) You're welcome to join this as well!",
              "score": 1,
              "created_utc": "2026-02-18 04:53:52",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5xd864",
          "author": "Livid-Savings-5152",
          "text": "Have a few solopreneur friends who sold their saas for millions.\n\nBefore building, they studied existing competitors marketing funnels and just copied them.\n\nFor example if you’re making a b2c app for college students, study succesful apps in that category to see what marketing channels are working.\n\nThe use those same chanels because they are already proven.",
          "score": 8,
          "created_utc": "2026-02-17 20:18:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5zwqng",
              "author": "diystateofmind",
              "text": "How? What did they do to study? ",
              "score": 1,
              "created_utc": "2026-02-18 04:25:25",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o603n9k",
                  "author": "Livid-Savings-5152",
                  "text": "Pick any company that’s already succeeding in your space. Then spy on their marketing funnels. For example, use the LinkedIn and Meta ads library to see if they are running ads.\n\nUse ahrefs to spy on their SEO strategy.\n\nKeep studying their funnels until you figure out what’s working for them.\n\nThen just copy it and put your own twist",
                  "score": 2,
                  "created_utc": "2026-02-18 05:13:33",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o6d4l0q",
              "author": "TheStackArchitect",
              "text": "It doesn't work that way buddy",
              "score": 1,
              "created_utc": "2026-02-20 03:56:28",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6dtem9",
                  "author": "Livid-Savings-5152",
                  "text": "I’ve been through 4 startup exits and achieved financial freedom a long time ago, so I know what works.\n\nYou are an engineering worker nerd who has no idea how business works. That’s why you’re not rich.\n\nGet back to work kid ❤️",
                  "score": 1,
                  "created_utc": "2026-02-20 07:15:07",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5tvw18",
          "author": "Aromatic-Trouble-580",
          "text": "You run into the problem of generic advice, mainly because most, if not all, the advice you are getting are from people who do not specialize in advice giving. Understanding a problem and being able to effectively help another solve it, is a skill, which is why consulting has been big business for so long. \nI have a question for you, have you tried taking the time to actually study marketing?",
          "score": 5,
          "created_utc": "2026-02-17 07:39:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5vwbsm",
          "author": "AnyExit8486",
          "text": "Pick one channel, not ten.\n\nGo where job seekers are already complaining (Reddit > LinkedIn > Discord).\n\nManually engage 20–30 people first. If they convert, double down. If not, fix the message.\n\nOptimize activation before traffic.\n\nOutcomes sell. Features don’t.",
          "score": 3,
          "created_utc": "2026-02-17 16:06:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5z0ql0",
          "author": "HominidSimilies",
          "text": "Spend one week building, one week marketing and selling. Let the feedback inform your build and adoption.",
          "score": 3,
          "created_utc": "2026-02-18 01:23:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5uuarh",
          "author": "Gold_Emphasis1325",
          "text": "I like these tips because I have the same problem. I've just quietly been focused on making it good and reducing surface area for what I think might be complaints. I twist friends arms to get them to give me feedback and have to push them for negative feedback. Also I ask AI assistants to be critical (albeit based on my description of how the product works) and ask it to think of possible complaints and improvements. I'm hoping for word of mouth growth, because many platforms are blocking what used to be easy marketing via social media... they either shut down your marketing or try to charge you unrealistic amounts of money. Once I am ready, I'll try to do a video demo and hope it gets lots of attention.",
          "score": 2,
          "created_utc": "2026-02-17 12:41:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5x3x3j",
          "author": "Popular-Penalty6719",
          "text": "Marketing for a SaaS product requires a focus on a few solid channels, not a dozen half-hearted attempts. Pick one or two channels where your target audience hangs out. Since your product targets job seekers, consider platforms like LinkedIn or Reddit.\n\nStart validating your ideas by talking directly to potential users. Get feedback on the concept and features before you sink time and resources into marketing. Early users can provide insights into what actually resonates.\n\nWhen it comes to consistency, create a content calendar. Regular, manageable posting beats occasional bursts of activity. Tools like Buffer or Hootsuite can help you schedule this without complicating your workflow. Automate only what needs automation, leaving room for direct engagement. \n\nSkip the push for “going viral” and focus on building genuine connections. Overcomplicating early marketing efforts often leads to frustration and wasted resources. Do less, but do it well.",
          "score": 2,
          "created_utc": "2026-02-17 19:34:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5zwnxz",
              "author": "diystateofmind",
              "text": "Your advice sounds good but in need of some gritty/granular details-ex: at what ratio? What is the conversion rate on LinkedIn? Is it better than 1%? 3%? What takes it up? Reddit? Are there other, more direct, options? What are your suggestions for identifying customers who will be more than 1% inclined to respond? Do you have metrics for posting? Methods/tactics/strategies? ",
              "score": 1,
              "created_utc": "2026-02-18 04:24:55",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o614lei",
                  "author": "Popular-Penalty6719",
                  "text": "The key sentence is this: \"Start validating your ideas by talking **directly** to potential users\".  \nIt's so important to have real contacts, not \"5000 LinkedIn contacts\", people you know, who know you well. Do you have 5 people you can share your product with? That's how it starts.  \nYeah, LinkedIn (or any other social media) conversion sucks when you start because nobody knows you there.\n\nIt compounds, it starts with a few, don't rush it, just learn from their feedback and make corrections, and that will attract more, not linearly but exponentially. Just don't expect thousands of people to throw money at you the first day.",
                  "score": 2,
                  "created_utc": "2026-02-18 10:38:48",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o5zznv5",
                  "author": "Wide_Brief3025",
                  "text": "Honestly LinkedIn conversion is usually under 3 percent unless you have a super targeted message and hit the right timing. Posting on Reddit can work but only if you find threads where people are already looking for solutions. Tracking conversations using keyword alerts across multiple platforms helps spot warm leads fast and saves a ton of manual searching. I use ParseStream for this and it surfaces really solid opportunities in real time.",
                  "score": 1,
                  "created_utc": "2026-02-18 04:45:25",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o65vuge",
          "author": "DylanFromCheers",
          "text": "Honestly the best thing I did was pick one channel, go deep, and ignore everything else for 90 days\n\nFor us it was cold outbound to a very specific ICP. Not \"spray 10,000 emails\" cold outbound. More like 20 hyper-researched emails a week where I actually looked at their business first. Closed our first 15 customers that way.\n\nThe \"post on LinkedIn / build in public / start a community\" stuff works for some people but it's a full time job on its own and the feedback loop is really slow. You post for 3 months and maybe get a few inbound leads. Versus 20 targeted cold emails where you know within a week if the messaging resonates.\n\nFor B2C though your channel mix is different than mine (we're B2B). Job seekers are high volume low intent so you probably want to think about where they already go when they're frustrated with job searching. Reddit would actually be a good one for you. r/jobs and r/careerguidance have people venting every day about application black holes. If your product actually reduces that friction you could answer those threads genuinely and build a reputation pretty fast.\n\nOne thing I wish someone told me earlier: the channel that works is usually the one that feels uncomfortable. If you're a builder you probably want to hide behind the product. The marketing that works for technical founders is usually the stuff that forces you to talk to people directly.",
          "score": 2,
          "created_utc": "2026-02-19 01:18:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o661ryd",
              "author": "Wide_Brief3025",
              "text": "Targeted cold outbound works so well for early traction especially if you personalize every message. If you ever decide to dip into conversation driven channels like Reddit or LinkedIn, using something like ParseStream can help track the right discussions so you only engage where it matters. That way you avoid spreading yourself thin and still catch leads in real time.",
              "score": 1,
              "created_utc": "2026-02-19 01:53:17",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o675d3m",
          "author": "Difficult-Gur-3222",
          "text": "I’ve been in that exact spot. Strong technically, shipping fast, but SaaS marketing feels like a completely different universe. The advice to “do everything” or “just get a cofounder” usually drains you before anything really works.\n\nThe biggest mistake I made was trying to be a generalist. Product, copy, design, distribution all at once. Burnout shows up quietly. What helped was realizing my real job wasn’t execution, it was direction. Being clear on the goal.\n\nI stopped trying to master Figma, ads, landing pages, and content systems. Instead, I leaned on an end-to-end AI setup to handle most of the design, dev iterations, and marketing grunt work. Not to think for me. Just to remove friction. Saves time. Keeps focus where it matters.\n\nFor channels, I didn’t spray everywhere. I stayed close to where users already talk, complain, and ask for help. Real conversations. Replies and DMs mattered more than reach. That’s how I knew it was working.\n\nBiggest takeaway as a solo founder: think like a visionary, not a department. Focus on the outcome. Let the machine handle execution.",
          "score": 2,
          "created_utc": "2026-02-19 06:13:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o679dqm",
              "author": "Wide_Brief3025",
              "text": "Sticking close to where your users actually talk is huge. I found that focusing on real conversations pays off way more than blasting generic content everywhere. If you want a shortcut to spot those active discussions, ParseStream has helped me pick up on actual lead opportunities across platforms without having to constantly check each one manually.",
              "score": 1,
              "created_utc": "2026-02-19 06:47:10",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o679htt",
              "author": "SeasonAlarming968",
              "text": "Totally feel this and honestly I think you nailed the real shift that’s happening. As technical solo founders, we used to think the answer was: Just work harder and learn every function.\n\nBut that model is quietly dying. The new edge isn’t being the best copywriter + designer + media buyer + SEO person all at once. That’s a burnout speedrun. The real leverage now is exactly what you said... direction over raw execution. AI (when used right) is basically becoming the solo founder’s force multiplier. Not a brain replacement, but a friction killer.\n\nWhat I’m seeing too: The winners aren’t the ones manually grinding every asset... They’re the ones setting tight feedback loops... Staying close to real user conversations And using AI to compress the execution time between idea - test - signal\n\nYour point about replies and DMs > vanity reach is especially underrated. For early-stage SaaS, distribution is way more about proximity than scale.,.. Honestly feels like we’re moving into an era where Small, sharp founders with good taste + AI leverage  \ncan compete with whole teams that are still operating 2019 playbooks.\n\nAppreciate you sharing this... more solo builders need to hear this perspective. 💯",
              "score": 1,
              "created_utc": "2026-02-19 06:48:08",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5uglki",
          "author": "Exciting-Living-8367",
          "text": "I think at the early days of a start up you should focus on doing \"things that don't scale\" and take care of your first users much as possible to know what they want. Try to contact them with personalised emails and build your image on X and LinkedIn (it prove you're not a scam). Like this you can validate product and if you're consistent have your first 100 users. Also open your DM on linkedIn and X and add a button in your app that link to it. When you see them using your app weekly you know you found your product market fit and can go forward on the platform where your users are (for job seeker linkedin I think) and post things that interest them. You can also continue emailing if it doesn't take to much time.\n\nAlso a tips I don't see often is to approach people in real life. Maybe go to your university and try to talk with seniors at the cafe shop. ",
          "score": 3,
          "created_utc": "2026-02-17 10:54:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5tst73",
          "author": "Automatic_Outcome832",
          "text": "In similar shoes rn, mainly focusing on LinkedIn customers that have shown the pain through comments or posts which linkedin will sorta recommend to you if you view that stuff or search for it. \n\nCreating content can help but it can be a vanity metric in starting, takes time and trust to really start paying off so a much more long term strategy. \n\nApart from this looking for signals in companies that trigger the pain point you are solving for and reaching out. I'm focusing on this right now\n\nYou also have cold mail and cold LinkedIn dms but they might not be the best fit when starting out, due to lack of market research and customer validation your positioning and ICP can be weak if not you can try that.",
          "score": 2,
          "created_utc": "2026-02-17 07:11:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5vi7qt",
          "author": "RealOrdinary1344",
          "text": "My solution was to build [a product ](https://tryrebelgrowth.com)that grows itself",
          "score": 2,
          "created_utc": "2026-02-17 14:56:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5vj596",
              "author": "AccordingWeird4596",
              "text": "yeah that's smart approach",
              "score": 0,
              "created_utc": "2026-02-17 15:01:17",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5v3uj9",
          "author": "Actual-Republic2219",
          "text": "I have worked for many SaaS companies ( based out of US and UK ) as a freelancer including YC backed startup. \n\nI can help you out with the same. Share your linkedin.",
          "score": 1,
          "created_utc": "2026-02-17 13:39:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5wahsd",
          "author": "Juanx68737",
          "text": "What im doing is meeting with people of my targeted audience and asking what kind of problems you would like to see if you hypothetically used my product (despite if they will use it or not). 1 suggestion from someone is a solution for like 100 people without realizing it. just keep getting feedback from your audience and reaching out ",
          "score": 1,
          "created_utc": "2026-02-17 17:17:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5yl2go",
          "author": "MundaneBase2915",
          "text": "The biggest trap when you’re a technical founder is treating marketing like a checklist instead of a system to observe. You try things, but you don’t really know if it’s improving or not, so you switch too fast or lose confidence haha\n\n\n\nThe channel that really moved things for me was Reddit and targeted content, not generic content. Just replying to posts where the problem already exists. It’s way more effective than posting into the void.\n\n\n\nThe key isn’t choosing the “right channel”, it’s choosing a channel where your ICP is already active, then observing if your actions actually improve results. For example you post 10 times. Do impressions increase. Do visits increase. Do conversions increase. If yes you continue. If not you adjust.\n\n\n\nMost founders don’t fail because they do the wrong marketing, but because they can’t read what’s happening. So they navigate on instinct.\n\n\n\nThat’s exactly why I built Decimly. It lets you clearly see if your marketing is improving or not, and which channel actually deserves your energy. Once you can visually see what works, marketing becomes much simpler man",
          "score": 1,
          "created_utc": "2026-02-17 23:57:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5ym8m1",
              "author": "Delicious_Bed_4410",
              "text": "Thank you this shares a lot of insights and i see what you did here 🫂 led by an example",
              "score": 1,
              "created_utc": "2026-02-18 00:04:15",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o614016",
              "author": "Outrageous_Knee5785",
              "text": "🤣omg good one",
              "score": 1,
              "created_utc": "2026-02-18 10:33:36",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o610vhz",
          "author": "quietoddsreader",
          "text": "solo, i’d pick one channel where your users already have intent and go deep.. for b2c job stuff that might mean niche communities or very specific seo around high intent queries, not generic “career advice” content.. test small with clear metrics, cost to acquire, activation, retention.. if a channel doesn’t move those, kill it fast.. distribution is just another system, but it needs tight feedback loops like code does..",
          "score": 1,
          "created_utc": "2026-02-18 10:05:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o61lsjf",
          "author": "Ash_Skiller",
          "text": "you're asking the right questions but here's what most people miss: as a solo technical founder, you don't need to master every marketing channel. You need to pick ONE channel where your ideal users are already actively searching for solutions, then show up consistently there. For B2C job platforms, Reddit is actually one of the best options because people constantly post in career subreddits asking for job search advice, complaining about application processes, looking for tools.\n\nThese are high-intent conversations where you can actually be helpful first and mention your product second. The trick is posting genuinely useful advice (templates, strategies, tips) and casually mentioning your tool when it's relevant. The reason most founders fail at Reddit isn't lack of time, it's that they don't understand the culture.\n\nYou get one slightly promotional comment wrong and you're shadowbanned from the subreddit. So validation becomes hard because you're risking your account every time you test. Here's the structured approach: spend 2 weeks just commenting helpful stuff in r/jobs, r/resumes, r/careerguidance without mentioning your product once.\n\nBuild some karma and learn what questions come up repeatedly. Then start occasionally mentioning your platform when it genuinely solves the exact problem someone posted about. Track clicks from your bio link or a simple tracking URL.\n\nIf you really don't want to do this yourself or already tried and got flagged, some B2B companies just use a done-for-you service that handles the research and posting without the spam risk. I've heard good things about Community Mentions for this kind of thing, they basically do Reddit engagement as a service so you don't have to worry about getting banned or spending hours finding the right threads. But even if you go solo on this, the key is committing to one channel for at least 90 days before judging results.\n\nReddit compounds over time becuase your old helpful comments keep getting found in search.",
          "score": 1,
          "created_utc": "2026-02-18 12:48:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o64oyjd",
          "author": "Proud-Macaroon-3667",
          "text": "Solo founder here - for me it was all about getting super skilled to where i knew the ins and outs of a certain channel. As a consumer app founder social media was something i dove head first into. i was trash at first but soon enough i was pulling in viral vids. as a result i got really skilled and started to bring in enough traffic where i could outsource it. But here is the key thing to note - i was constantly coaching up the person that i hired so that they could have the subject matter expertise and hit the mktg the right way. I think this is required for any hire tbh and had i not figured out how to handle that aspect of the business first i would have just been pouring away time and money",
          "score": 1,
          "created_utc": "2026-02-18 21:35:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o65u2ts",
          "author": "Flashy-Cat8050",
          "text": "We're actually using our own product to advertise and get customers. It's been pretty great so far [https://cambrian.ad/](https://cambrian.ad/) happy to chat more about it :) ",
          "score": 1,
          "created_utc": "2026-02-19 01:08:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o674psi",
          "author": "BusinessStrategist",
          "text": "Your obstacle is being very strong “technically.”\n\nIt usually means that your “people”skills are very poor and that you probably know very little about “business.”\n\nTech can be very challenging and can take up all of your valuable time.\n\nThe first question is so very simple.\n\nGoogle “Job To Be Done.”\n\nAsk AI to summarize the book.\n\nCan you put yourself in the shoes of YOUR “ideal” customer/client?\n\nWhat compelling “need or want” are you satisfying?\n\nBe VERY specific!",
          "score": 1,
          "created_utc": "2026-02-19 06:08:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6a98ss",
          "author": "Informal-Virus4452",
          "text": "solo founder here. the biggest trap I fell into was trying 4–5 channels at once and convincing myself I was “doing marketing.” zero depth anywhere.\n\nwhat actually worked was picking one place where my users already were and going all in there for a few weeks. conversations > content volume.\n\nfor job seekers, I’d probably start with niche reddit communities or smaller groups before touching ads. you’ll feel pretty quickly if the pain is real.\n\nI just track experiments in notion, give each channel a fixed window, and only double down if usage sticks — not just signups.\n\nwhere are your first 50 users coming from right now?",
          "score": 1,
          "created_utc": "2026-02-19 18:31:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6drjna",
          "author": "Background-Might3453",
          "text": "tbh SaaS marketing felt fake to me for a long time too. what finally helped was picking one channel that matched how users already behave and ignoring the rest.\n\nngl most advice is noise until you see even a tiny signal. i tested small, tracked one metric that mattered, then doubled down. everything else was a distraction.",
          "score": 1,
          "created_utc": "2026-02-20 06:58:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5txplq",
          "author": "ApprehensiveCry7955",
          "text": "Well Honestly as doing the marketing alone, we are doing some crazy ideas to just get to know about the product.\n\nEven one of the guy I'm talking to said, nice marketing tatic once he found out that this is marketing, but I would say 9/10 are not even able to find out whether this is marketing tactic and fall right under the crazy idea that we are doing & get to know about the product & even signup as well.",
          "score": 1,
          "created_utc": "2026-02-17 07:56:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5ubejv",
              "author": "Relevant-Scene6663",
              "text": "doing something crazy can give you some good results, as everyone knows even for reddit in the initial phase when it launched, the founders manually commented on real users post & comment from fake ones.\n\nso keep it up can you tell me what you are building, that you have to come up with crazy idea to market it ?\n\n",
              "score": 3,
              "created_utc": "2026-02-17 10:07:29",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5ublzw",
                  "author": "ApprehensiveCry7955",
                  "text": "yeh totally i heard about this & tbh this idea came from actually iterating a lot with my team and then we came up with this.",
                  "score": 2,
                  "created_utc": "2026-02-17 10:09:22",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o5uak3a",
              "author": "Wonderful_Joke_9953",
              "text": "Well This seems something interesting, I would like to know exactly what you are doing.",
              "score": 2,
              "created_utc": "2026-02-17 09:59:43",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5uapxn",
                  "author": "ApprehensiveCry7955",
                  "text": "Cool, let me know what are you working on & see you in chat",
                  "score": 1,
                  "created_utc": "2026-02-17 10:01:10",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o5uayji",
              "author": "Sweaty_Expert_9997",
              "text": "Well If 9/10 are not able to figure it out then this tactic must be good, curious to know how do you come up with it ?",
              "score": 2,
              "created_utc": "2026-02-17 10:03:23",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5ucw6e",
                  "author": "ApprehensiveCry7955",
                  "text": "Yup it's working fine for now, actually there is a little long story behind it, let's catchup in discussion will tell you there.",
                  "score": 2,
                  "created_utc": "2026-02-17 10:21:10",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1r8zaht",
      "title": "How did you make your first dollar as a Startup Owner?",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1r8zaht/how_did_you_make_your_first_dollar_as_a_startup/",
      "author": "ChallengeExcellent62",
      "created_utc": "2026-02-19 13:32:20",
      "score": 30,
      "num_comments": 31,
      "upvote_ratio": 0.85,
      "text": "It's brutal, I have lived in my own dreamy world where if you solved a problem people would happily buy it.\n\nIt's not that easy, getting even 100 signups to a product which is a new concept is hard af. To me selling always felt easy but after I have actually shipped something it feels the hardest.\n\nHow did you earn your first dollar as a Founder?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1r8zaht/how_did_you_make_your_first_dollar_as_a_startup/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o69n666",
          "author": "Logical-Reputation46",
          "text": "Get a part time job to extend your runway as much as possible. The longer you stay in the game, the more likely you are to achieve success in your startup.",
          "score": 7,
          "created_utc": "2026-02-19 16:46:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o69u8n8",
          "author": "AnyExit8486",
          "text": "first dollar usually comes from conversation, not conversion.\n\nmost people try to get 100 strangers to sign up.  \nthe founders who make their first dollar talk to 10 people directly.\n\nmy pattern has always been:\n\n– find 5–10 people with the problem  \n– don’t pitch the product  \n– ask how they’re solving it now  \n– offer to fix it manually\n\nsometimes that means doing it as a service first.  \nsometimes that means charging before the product is fully built.\n\nyour first dollar is rarely scalable.  \nit’s usually scrappy, manual, and slightly uncomfortable.\n\nalso new concepts are 10x harder. if you have to educate the market and sell at the same time, it’s brutal. positioning it as “this replaces x” instead of “this is a new thing” lowers friction a lot.\n\nwhat worked for you before when selling felt easy? was it because demand was already obvious?",
          "score": 6,
          "created_utc": "2026-02-19 17:20:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o69yp2j",
              "author": "ChallengeExcellent62",
              "text": "Selling felt easy in my mind.",
              "score": 1,
              "created_utc": "2026-02-19 17:41:43",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6e9w5u",
                  "author": "TheBlip1",
                  "text": "Depends on what you're selling. If people already want it then it's easy. If people can't see the value yet or it is a new thing then it is much harder.",
                  "score": 1,
                  "created_utc": "2026-02-20 09:50:10",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o69lj9r",
          "author": "ReporterCalm6238",
          "text": "we just closed our first b2b contract worth $1250. We found our lead going to conferences and talking to people irl. Everything else (emails, linkedin, reddit, ads) did not work for us. I think all these channels are just saturated. I remember cold emailing 10 years ago I was getting 30% response rate. Now nothing. Wake up people, it's a distribution game. Partner up with influencers, go meet people, organize events, grow a huge audience, get backed by a famous VC that give you visibility. These are the channels that work.",
          "score": 5,
          "created_utc": "2026-02-19 16:38:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o69ytwy",
              "author": "ChallengeExcellent62",
              "text": "Oh that's a cool insight, what have you built?",
              "score": 1,
              "created_utc": "2026-02-19 17:42:22",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o68mez9",
          "author": "No_Month8031",
          "text": "I am in the same situation . My product is more for buisnesses so I go talk to them , but ngl close them is very hard . \n\nTry to focus on one acquisition canal and try to crack it and crack what ur customers wants to hear and what they wait from a product like urs.\n\nGood luck !",
          "score": 5,
          "created_utc": "2026-02-19 13:37:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o68mor5",
              "author": "ChallengeExcellent62",
              "text": "Saas is like a deathbed for me, you have to build the perfect product before anyone uses it. \n\nThat's why I'm building D2C",
              "score": 2,
              "created_utc": "2026-02-19 13:39:26",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o68mpe2",
              "author": "ChallengeExcellent62",
              "text": "Saas is like a deathbed for me, you have to build the perfect product before anyone uses it. \n\nThat's why I'm building D2C",
              "score": 1,
              "created_utc": "2026-02-19 13:39:32",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o68tjvj",
                  "author": "Alternative-Radish-3",
                  "text": "You need eyeballs on your product then, social media in particular. It's full of scammers and bait and switch, so not easy either, but it's the way to get in front of your customers. They won't be able to find you otherwise",
                  "score": 3,
                  "created_utc": "2026-02-19 14:17:41",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o68s76i",
          "author": "No_Month8031",
          "text": "I dont really agree with you cuz if you have a SaaS that resolves a real pain point u just need that feature that solves it and after by talking to customers change it until you create the \"perfect\" product.\nBtw what u buildin?",
          "score": 6,
          "created_utc": "2026-02-19 14:10:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o695wn1",
          "author": "edkang99",
          "text": "I used to build then sell. Now for every startup I sell before I build. Thats how I make the first dollar. It may not hit my bank but it’s waiting. Or I sell the solution in another form like a book or manual consulting.",
          "score": 2,
          "created_utc": "2026-02-19 15:22:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ah6gj",
          "author": "CyberStartupGuy",
          "text": "Did you talk with prospective customers before you built whatever you shipped? Usually those design partners are the first to give you money after you build the thing they had a pain point for. ",
          "score": 2,
          "created_utc": "2026-02-19 19:08:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o68ybcq",
          "author": "andynadal_",
          "text": "My app Pausa is an App with in-app subscriptions, so my priority was to get an MVP done as fast as possible with monetization ready, so when launched my family and friends subscribed, so that's how I made my first dollar, now you might be interested in the first person I didn't know who pay for my product, that actually came from SEO, so building a strong landing page was also very important",
          "score": 2,
          "created_utc": "2026-02-19 14:43:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o68zdq9",
              "author": "No_Month8031",
              "text": "Yep that is tru SEO helps a lot if you know how it works",
              "score": 0,
              "created_utc": "2026-02-19 14:49:02",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6ahxvl",
          "author": "Costheparacetemol",
          "text": "Trade show exhibition w/ demo -> signups -> kept in contact and did more customer  development -> when had MVP, did online demo walkthroughs, about 10 months later on from trade show had fist paying customers.\nIn parallel we were cold calling and interview, doing research including customer onsite shadowing and even did a little work for some early pre-customers as we learned their workflows. \n\nBest of luck!",
          "score": 1,
          "created_utc": "2026-02-19 19:12:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6al8hd",
          "author": "Forsaken_Lie_8606",
          "text": "tbh yeah, thats a common pain in getting those initial signups, i remember when i first launched my startup, it took us like 3 months to get our first 100 paid customers, and it was a huge struggle, we%shad to manually reach out to people, attend conferences, and do a ton of customer development to get feedback and iterate on our product, but the key thing that worked for us was identifying a specific niche within our target market and focusing all our efforts on that, we found that by solving a very specific pain point for a small group of people, we were able to get traction and then expand from there, ngl its still hard but it gets easier once you find that initial momentum",
          "score": 1,
          "created_utc": "2026-02-19 19:27:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6clvu2",
          "author": "laron290",
          "text": "Yes",
          "score": 1,
          "created_utc": "2026-02-20 01:58:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6d3plg",
          "author": "swapnilmanex",
          "text": "We built Booklane app for second hand books and we got sponsored books from authors. We sponsored them and then we have added admob so we got some earning from there and recently we have added delivery system as well in particular cities. Where as a co founder we deliver the books. This is how we making money in dollars...",
          "score": 1,
          "created_utc": "2026-02-20 03:50:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6dua7o",
          "author": "SystemicCharles",
          "text": "I called 🤳🏽 the Federal Reserve and asked for instructions on how to make my first dollar at home\n\nOn a serious note, it's really not that hard. Get comfortable with shamelessly promoting your product or yourself. And get even more comfortable talking to strangers even if you get rejected a million times. Nobody is going to come to your house and make your dreams come true.",
          "score": 1,
          "created_utc": "2026-02-20 07:23:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6dx1hx",
          "author": "nriques",
          "text": "I start to realize one has to chase users. Build in Public is overused and viewers got desensitized.",
          "score": 1,
          "created_utc": "2026-02-20 07:48:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6dz2u4",
          "author": "Harris04251998",
          "text": "yeah i felt the same after shipping my first thing, 100 signups sounded doable until i realized most \"problem\" posts are just people venting, not buying\n\nmy first dollar came from manually scanning subreddits for 3 hours a day spotting real intent signals like \"looking for tool x\" or budget mentions, then jumping in those threads with genuine comments that built trust before mentioning anything\n\ntalk to 5-10 of those high-intent folks directly instead of chasing cold signups, it flips the script fast",
          "score": 1,
          "created_utc": "2026-02-20 08:07:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6e8jjt",
          "author": "ApprehensiveCry7955",
          "text": "This hits hard.\n\nI used to believe the same thing, build something genuinely useful and people will automatically show up. Shipping completely breaks that illusion.\n\nBuilding is logic. Distribution is psychology. And psychology is messy.\n\nGetting even the first 50–100 signups for a *new* concept feels harder than writing the product itself, especially when there’s no existing category or demand to ride on. Selling in theory feels easy; selling *your own thing* is emotionally brutal because every “no” feels personal.\n\nMy first dollar didn’t come from scaling or funnels, it came from manually talking to users, understanding why they *didn’t* care yet, and reshaping the story until one person finally did.\n\nCurious to hear others’ stories too, first dollar moments are wildly different, but they all seem to involve discomfort.",
          "score": 1,
          "created_utc": "2026-02-20 09:37:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6fmcgz",
          "author": "PowerDue2448",
          "text": "B2B SMB VSaaS here. \n\nGot my „first euro“ by being me and authentic. (Offer aside duh) \n\nI thought theres a magic bullet by reading Hormozi and alike and you know … just ABC and Hustling. 🙄\n\nTurns out its a great starting point and an Important mindset for yourself. \n\nHowever being a decent human being, engaging in real conversations where Im not pushing for a sale but to geniuenly trying to figure out through thoughtful questions, if I can be of help to the other person has increased my chances of success way more than any framework or toolkit. \n\nAuthenticity sells in the age of AI slop and Quota Driven Sales-Orgs. \n\nStill trying to figure out how to scale „being a decent human“. \n\nMy 2 cents.",
          "score": 1,
          "created_utc": "2026-02-20 15:10:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o696m8k",
          "author": "LunchZestyclose",
          "text": "Sending invoices.",
          "score": 0,
          "created_utc": "2026-02-19 15:26:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o69gz9v",
          "author": "Rishi_445",
          "text": "get your friends and family to actually pay for your product",
          "score": 0,
          "created_utc": "2026-02-19 16:16:40",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r4gytc",
      "title": "How Did You Find a Truly Committed Marketing/Growth CoFounder?",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1r4gytc/how_did_you_find_a_truly_committed/",
      "author": "Similar-Cry-9968",
      "created_utc": "2026-02-14 10:04:37",
      "score": 18,
      "num_comments": 23,
      "upvote_ratio": 1.0,
      "text": "Solo technical founder here. I’ve built and launched V1 of my startup. Early users find it valuable, and some are already onboarding their audiences, but I’m stuck on marketing and distribution.\n\nFor those who’ve been in this position, how did you find a truly committed marketing/growth cofounder? What signals showed they were actually serious and not just talking?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1r4gytc/how_did_you_find_a_truly_committed/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o5bid6j",
          "author": "Hecker8778",
          "text": "Dude, I'm talking generally, so don't judge, but finding a marketing cofounder is honestly a trap because 90 percent of them just want to draw funnels on a whiteboard or talk about brand awareness. The only signal that actually matters is if they can bring u a real user before u even sign any paperwork. If they complain about needing a massive budget or a perfect landing page to start they are just a consultant in disguise and will drain ur equity. Just tell them to get u 10 active signups using whatever scrappy method they want and u will know instantly if they are a builder or just a talker.",
          "score": 15,
          "created_utc": "2026-02-14 10:24:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5bju9x",
              "author": "askbrit",
              "text": "this is actually some solid advice! definitely gonna keep this in mind",
              "score": 3,
              "created_utc": "2026-02-14 10:39:17",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o5biut5",
              "author": "Similar-Cry-9968",
              "text": "how abt the idea of technical founder doing marketing ",
              "score": 2,
              "created_utc": "2026-02-14 10:29:40",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5bnfok",
                  "author": "HatchedLake721",
                  "text": "Marketing maybe. Sales yes.",
                  "score": 3,
                  "created_utc": "2026-02-14 11:13:48",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o5bra4q",
              "author": "Far-Opportunity-7228",
              "text": "To be honest - I'm not very deep in the start-up scene, but that sounds sad.  \nAs a \"business guy\", I've worked at scaleups as strategy consultant, at marketing consultancies, Startups and three of the big4.   \nWorked with people that sourced thousands of people, expanded into other countries with a strategy team of four and grew construction companies within revenues of >1mil after 9 months. \n\nWhen I read, that \"Marketing/Growth Co-Founders\" just use up the money and talk about generic \"awareness\"... That saddens me.   \n  \nIf you are a \"Co-Founder\", behave like it. ",
              "score": 2,
              "created_utc": "2026-02-14 11:49:02",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o5bp91j",
              "author": "Agreeable-Prune-9210",
              "text": "i’ll be using this , thank you",
              "score": 1,
              "created_utc": "2026-02-14 11:30:49",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o5c94h0",
              "author": "Simple-Optimist-93",
              "text": "Being a cofounder is not a job- it’s a responsibility. So you need to test for that.\n1-test for personal traits/qualities you’d look for in any tech cofounder. No one likes to work with smarts when they treat you like jerk!\n2- spend quality time to assess whether this skills are truly complementary to yours. \n3-Depending one stage of your businesses, what you need from your marketing cofounder is different. I assume you are in early stage. Here are some “projects” you can ask them to do to assess whether #1 and #2 holds up\n  a)if you have not engaged any customer yet, you might need a strategic leader who helps define ideal customer profile for your product by doing deep customer discovery work on who is willing to pay for solving the pain point that you think your product solves. \n   b)Doing thorough SWOT analysis of your competitors to come back a set of opportunities. You will know when someone is simply GPTing stuff vs knows what they are talking about when they share such analysis\n    c) for B2B products landing 5 business conversations to hear their feedback is a monumental task\n     d)driving awareness takes $$ but you can also do a lot of manual effort (e. Reddit, LinkedIn ) to drive specific outcomes like week over week increase in #trials.  Doing these grassroots non-scalable things will help you test where your customer is hanging out!\n      e) are they able to think through go to market strategy as a whole? What should we charge for our product? Where should we sell the product-why/why not? Should we have 3 package/offer or just one and why? How do we position the product so we are differentiated from the competition? What features should my tech cofounder build so we differentiate from competition? What is our value proposition?\n      f)brainstorm problems that are not related to their area to see how they respond…co founder mindset people will roll up the sleeves to brainstorm even when they don’t know the area!\n\nBy the time you do these small projects you will know whether they are someone you can bank on for the long term.",
              "score": 1,
              "created_utc": "2026-02-14 13:58:52",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o5crei1",
              "author": "eh-tk",
              "text": "As a product marketing consultant I’d agree with most of this. Generally at the early stages you want to throw everything at the wall and see what sticks. \n\nAnyone claiming to know the exact playbook is likely too reliant on a strategy that’s worked for them before. But it’s not guaranteed to work again. \n\nSide note, I’m redoing my website and I’d love some feedback on the messaging from any technical founders here. I want to make sure it resonates:  https://taylors-sublime-site-114973.webflow.io/",
              "score": 1,
              "created_utc": "2026-02-14 15:41:38",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5biez8",
          "author": "EdgeStartup",
          "text": "I've worked closely with a lot of technical founders on this exact issue.\n\nDon't search for a cofounder. Search for proof. Give someone a paid 2 week sprint on one specific channel. If they deliver, you'll both know the partnership makes sense. If they don't, you just saved yourself months and equity.\n\nSecond thing, do they ask about your users before they pitch you a strategy ? If they jump straight into \"we should do TikTok\" without understanding who's already onboarding, run.\n\nYour V1 is live and users are coming in. That's real leverage. Lead with the mission, not equity, and let the work reveal who's serious.",
          "score": 3,
          "created_utc": "2026-02-14 10:25:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5bitdx",
              "author": "Similar-Cry-9968",
              "text": "thanks .. this helps a lot ",
              "score": 1,
              "created_utc": "2026-02-14 10:29:16",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5bkxsh",
          "author": "bersuku",
          "text": "I'd at least look at two levels:\n\nThe first level is the most important and you'll be trying to sniff this throughout the relationship, and that's essentially whether the person is of good character. \n\nThe second thing you want to do is try to solve a problem together. It's less about the specific ideas that you'll end up trying and more about how this person approaches a problem, the frameworks this person relies on, and the level of ingenuity and experience you can glean from your discussions.  \n  \nAnd be sure you're being just as generous. A strong partner will be evaluating you as well. There are plenty of good ideas out there, many with traction and paying customers. Growth experts are highly sought after. \n\nHonestly, all you have to do is put your best foot forward, and see how this person resonates as you figure out your business together.",
          "score": 3,
          "created_utc": "2026-02-14 10:49:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5bp5i1",
              "author": "Agreeable-Prune-9210",
              "text": "I'm in a similar position to the OP, and honestly, this sounds like a disproportionate amount of time wasted",
              "score": 1,
              "created_utc": "2026-02-14 11:29:54",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5bqli8",
                  "author": "bersuku",
                  "text": "I hear you.   \n  \nBut i will say the \"disproportionate time\" spent vetting a cofounder upfront is nothing compared to the time wasted on a bad cofounder match down the line – misaligned incentives, expectations, or someone who flakes after three months.   \n  \nGood thing is, the approach i shared is not the only path.  \nBut the underlying points remain.",
                  "score": 1,
                  "created_utc": "2026-02-14 11:43:03",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5c6qhf",
          "author": "Able_Reply4260",
          "text": "You dont want a marketing guy who doesnt exaggerate...you have to learn to live with him. Share what you built and any marketing folks can respond here.",
          "score": 1,
          "created_utc": "2026-02-14 13:44:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5cnc12",
          "author": "quietoddsreader",
          "text": "in my experience, founders matter more than the title. look for someone already shipping or building in public, not just talking. if they can show traction or concrete ideas before joining, that’s usually the strongest signal they’ll stick.",
          "score": 1,
          "created_utc": "2026-02-14 15:20:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5cq5gi",
          "author": "canna_queen_1982",
          "text": "You should look into hiring fractionally. Instead of hiring someone on to be that specific position, you hire them on for an interim to get you moving. It's a lot cheaper. Good luck!",
          "score": 1,
          "created_utc": "2026-02-14 15:35:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5cy7fe",
          "author": "InspectionGreen6076",
          "text": "I looked at your post history and it seems like you lean towards consumer saas products\nThe number 1 thing in that field is a portfolio aka the marketing equivalent of github. They should’ve already spent ad money on proven they can do marketing already on other consumer products\n\nBut in general, cuz you look young enough to be in college, the number 2 thing I woukd screen for besides past experience is financial commitment. As in are they going to spend $100+ a month on a sales and marketing. When it becomes pay to play you’ll screen through a lot of tire kickers. In business you gotta spend money to make money",
          "score": 1,
          "created_utc": "2026-02-14 16:16:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5c06bo",
          "author": "tiguidoio",
          "text": "A lot of time and commitment",
          "score": 0,
          "created_utc": "2026-02-14 13:00:13",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r4mf1j",
      "title": "How does Yc ingest 40k+ applications in just a month?",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1r4mf1j/how_does_yc_ingest_40k_applications_in_just_a/",
      "author": "prc41",
      "created_utc": "2026-02-14 14:46:24",
      "score": 17,
      "num_comments": 7,
      "upvote_ratio": 0.96,
      "text": "I know they publicly say that partners do all the application reading. \n\nBut just rough numbers - each partner is still doing thousands of applications in about a month. I feel like they have to be filtering out noise, likely with ai or bots to crawl the applications, company sites, linkedin pages, and maybe even watching the application videos as well.\n\nNot upset by this thought at all, more just curious how it works. Anyone else have similar thoughts?\n\nI have my PostHog filters set up to try to catch if/when they actually visit my site haha.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1r4mf1j/how_does_yc_ingest_40k_applications_in_just_a/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o5clqsp",
          "author": "vikentii_krapka",
          "text": "To cover 1000 applications a month you need only 33 per day. And they are probably rejecting most within less than a minute as soon as they feel that it is not good from first couple of answers",
          "score": 3,
          "created_utc": "2026-02-14 15:11:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5cnneu",
              "author": "prc41",
              "text": "True. And I’m guessing if it’s 1000 they only watch maybe 200 founder intro videos, then maybe 50 of the product demos.. something like that, but who knows.",
              "score": 1,
              "created_utc": "2026-02-14 15:22:01",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5co09q",
                  "author": "vikentii_krapka",
                  "text": "If I were doing it, I would first skim through all applications 2 min max and reject everything that is bad right away and then start looking through shortlist",
                  "score": 2,
                  "created_utc": "2026-02-14 15:23:54",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5ctmx1",
          "author": "jdquey",
          "text": "I can't find the source, but I recall them sharing that they use tools based on what they found to work in the past to automate a lot. Also the pattern recognition improves the more you do it. I was shocked when I first heard they could evaluate someone in 10 minutes, but after hiring dozens of contractors (and \"hiring\" bankers, customer support reps, and others) in 15 years, I could see it being possible. Often I'll get a sense if someone is knowledgeable to help within the first 1-2 minutes. The same principle could apply to their application process too. I doubt they'd do it all by hand, but if they had to: 40,000 apps / 20 work days / 8 hours per day / 60 minutes per hour = 4.2 apps per minute. Screen some apps instantly, have a few on the team do it, and that's very reasonable to do manually without overtime. And I bet they would put in overtime.",
          "score": 3,
          "created_utc": "2026-02-14 15:53:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ctuy6",
          "author": "butterspecialist",
          "text": "https://www.reddit.com/r/ycombinator/s/AfZzYvGFXy",
          "score": 2,
          "created_utc": "2026-02-14 15:54:19",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r76190",
      "title": "I’m doing international sales from scratch and nothing is working. how do people actually get clients?",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1r76190/im_doing_international_sales_from_scratch_and/",
      "author": "Ok-University-2605",
      "created_utc": "2026-02-17 13:29:48",
      "score": 17,
      "num_comments": 41,
      "upvote_ratio": 0.95,
      "text": "Hi everyone,\n\nI’m honestly stuck and dont know what to do.\n\nI started working 4 moths ago for a company based in Turkey that produces multiple industrial products. My role is to find international customers and generate sales. The problem is… I’m basically starting from zero, with no previous experiences, no training, and no one to guide me.\n\nI’ve been tried everything I know and learned so far:\n\n\\- Sending cold emails after using AI to find my targeted markets\n\n\\- Searching participants in the fairs that are related to our companies producs and email them (almost no replies)  \n\\- Finding and connecting with people on LinkedIn ( they werent interested )\n\n\\- i even tried reaching on other social media platforms. and most importantly i tried to be presistant and sent follow up emails and messages multiple times.\n\nI really don’t know what I’m doing wrong. But it starting to feel like i keep using the wrong strategies over and over again..\n\nThe company started pushing me recently to do something about it, and they are right. but I’m still trying to figure out how to even get my first serious conversation.\n\nfor now I’m supposed to sell different product categories, I’m responsible for selling stainless steel food production machinery and their manufactured confectionery products, as well as industrial systems for gas generation, air treatment, lazer weding machines, and coating/paint application equipments... and in the future it am expected to sell other products too.\n\nHow do I break this cycle and move up to the point where I can actually call myself a salesperson? what am i doing wrong and what do i need to work on to be successful in the field and get past the phase where everything is ignored to finally closing deals?\n\nI really need guidance here.\n\nThank you",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1r76190/im_doing_international_sales_from_scratch_and/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o5vavj9",
          "author": "UpperIndependence609",
          "text": "The problem is that you sound like a typical salesperson. **Focus not on what you want, but what the opposite person – or company wants.** Instead of saying: hey I got this nice product, want to buy it? Write: Hi, I noticed you're still using those old and expensive machines from our competitor. I can offer you better, cheaper products with a discount.",
          "score": 9,
          "created_utc": "2026-02-17 14:17:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5vdvzh",
              "author": "Ok-University-2605",
              "text": "Ohhhh okeyyyy that’s smarter",
              "score": 2,
              "created_utc": "2026-02-17 14:34:16",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5vhuat",
                  "author": "UpperIndependence609",
                  "text": "I recommend you read \"How to Win Friends and Influence People\" by Dale Carnegie. You will be surprised. It's also never wrong to just ask colleagues who have many sales or have more experience. They will teach you some tips and tricks you didn't know.",
                  "score": 4,
                  "created_utc": "2026-02-17 14:54:44",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5vfhe5",
          "author": "Important_Winner_477",
          "text": "starting from zero is brutal. I do Penetration Testing so I also deal with high trust sales where cold emails usually just get marked as spam.\n\nWhat started working for me is a 4-7-8 strategy. It is a slow burn but it actually gets people on the phone.\n\nBasically:\n\n4 Platforms: My ICP has to see me on 4 different spots. If they see you on LinkedIn, then a technical forum, then maybe a video of your machinery... you look like an authority, not a rando.\n\n7 Hours: They need to consume about 7 hours of your content. Since you sell machinery, maybe post technical videos of the laser welding or gas systems in action. Let them see the quality before you ask for a check.\n\n8 Touches: Interact with them 8 times. Do not just pitch. Comment on their posts, share a solution to a problem they mentioned, or send them a manual they might actually need.\n\nI havent closed a lead yet, but I went from 0 calls to 7 discovery calls just by switching to this. It is way better to have 7 people who actually want to talk to you than 1000 people ignoring your cold emails.",
          "score": 3,
          "created_utc": "2026-02-17 14:42:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5vhga4",
              "author": "Ok-University-2605",
              "text": "Thank you \nI will try this 🙏 \nGood luck to you too 🤗",
              "score": 1,
              "created_utc": "2026-02-17 14:52:46",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5vjh8a",
                  "author": "Important_Winner_477",
                  "text": "let knew your result because I want to knew do this only work for or will work for you as well",
                  "score": 1,
                  "created_utc": "2026-02-17 15:02:58",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o5x1hwh",
              "author": "Resident_Cookie_7005",
              "text": "I like that approach, how do you keep up with so many platforms and producing so much content?",
              "score": 1,
              "created_utc": "2026-02-17 19:23:11",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5x8vva",
                  "author": "Important_Winner_477",
                  "text": "In the starting quality volume is key. currently in process of creating this into full actionnal framework for my company I will share that with if you want.",
                  "score": 1,
                  "created_utc": "2026-02-17 19:57:52",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o5vr9jj",
              "author": "Wide_Brief3025",
              "text": "The multi touch approach you use is spot on for building trust, especially in security sales. I found that staying consistent on platforms your clients actually use saves a ton of time. Having a tool like ParseStream to monitor conversations and get real time alerts when relevant topics come up let me jump into discussions I would have missed otherwise. It really helps with targeting those high trust opportunities without spamming people.",
              "score": 0,
              "created_utc": "2026-02-17 15:41:20",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5vb2vf",
          "author": "Fancy_Bake_4268",
          "text": "Hmm why should they buy?",
          "score": 2,
          "created_utc": "2026-02-17 14:19:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5vdnd8",
              "author": "Ok-University-2605",
              "text": "The food production machineries they sell come with competitive prices, and they’re installed in so many cities In turkey, they just want to make international. \nSame thing with the other product which works with gas systems, but it’s more innovative and has many more advantages to companies that uses them . \nReally these products are great, yet I fail to make one sale 🥲",
              "score": 0,
              "created_utc": "2026-02-17 14:32:58",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o63uj3d",
          "author": "Forsaken_Lie_8606",
          "text": "i was in a similar situation a few years ago, trying to get clients for my own startup, and i realized that the key is to focus on building relationships rather than just sending out cold emails or messages. i started attending industry events and conferences, and i made a point to actually talk to people and learn about their businesses, rather than just trying to pitch mine. its weird, but once you start to care about what theyre doing, they start to care about what youre doing too, lol. anyway, i think you might want to try to find some trade shows or conferences that are relevant to your industry and just go there to learn and meet people, its been a game changer for me good luck with it",
          "score": 2,
          "created_utc": "2026-02-18 19:13:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6976m4",
              "author": "Ok-University-2605",
              "text": "thank you so much",
              "score": 2,
              "created_utc": "2026-02-19 15:28:55",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5w0y3x",
          "author": "Luangprebang",
          "text": "Setup OpenClaw and tell it to book you calls with potential customers. ",
          "score": 1,
          "created_utc": "2026-02-17 16:29:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5xcl88",
          "author": "Livid-Savings-5152",
          "text": "Do you have any evidence that the people you’re contacting have a strong desire to buy your product?",
          "score": 1,
          "created_utc": "2026-02-17 20:15:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o696gsg",
              "author": "Ok-University-2605",
              "text": "unfortunately no",
              "score": 1,
              "created_utc": "2026-02-19 15:25:20",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6dtmjc",
                  "author": "Livid-Savings-5152",
                  "text": "Speaking from experience here, next time, sell before you build. Otherwise you end up building something you can’t sell.",
                  "score": 1,
                  "created_utc": "2026-02-20 07:17:12",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5ypit1",
          "author": "kubrador",
          "text": "you're selling five completely different product categories to international markets with zero experience and wondering why nobody's picking up. that's like asking why your shotgun approach isn't working when you're aiming at five different targets.\n\n\n\npick one thing, get obsessed with it, and actually learn who buys it and why. then maybe call people instead of just emailing into the void.",
          "score": 1,
          "created_utc": "2026-02-18 00:22:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6971mp",
              "author": "Ok-University-2605",
              "text": "i try to not do them all at the same time, for example i dedicate day 1 for product A and day 2 for product B and so on.. but still i dont know what else im doing wrong",
              "score": 1,
              "created_utc": "2026-02-19 15:28:14",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o64bp71",
          "author": "Healthy_Library1357",
          "text": "you’re not bad at sales. you’re selling way too many unrelated products at once. stainless steel food machinery, gas systems, laser welding, coatings… that’s like 4 different ICPs with 4 different pains. no wonder cold outreach isn’t landing. pick one category. one specific buyer. one problem. then go deep. also stop pitching features. industrial buyers care about cost savings, downtime reduction, compliance, and ROI. if your email doesn’t clearly say how you make them more money or save them money, it goes straight to trash. before sending another cold email, answer this clearly for one product: who exactly feels the pain, what does it cost them today, and why should they trust a Turkish supplier over their current one. if you can’t answer that in one tight paragraph, that’s the real gap.",
          "score": 1,
          "created_utc": "2026-02-18 20:33:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6986wk",
              "author": "Ok-University-2605",
              "text": "i try to make the emails genunie and i make sure to include all the benefits you mentioned ..\n\nand im sorry i coudnt find answers to your questions",
              "score": 1,
              "created_utc": "2026-02-19 15:34:00",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o66c8v2",
          "author": "Dickskingoalzz",
          "text": "You don’t have any marketing?",
          "score": 1,
          "created_utc": "2026-02-19 02:53:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o698gap",
              "author": "Ok-University-2605",
              "text": "we do. the company is doing fine and it has many salespersons too. im just struggling by my self and no one cares to help \n\n",
              "score": 2,
              "created_utc": "2026-02-19 15:35:17",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6a1dun",
                  "author": "Dickskingoalzz",
                  "text": "That’s because you’re doing all your own lead gen aka marketing with no training. I’d find a better job.",
                  "score": 2,
                  "created_utc": "2026-02-19 17:54:29",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o67cd02",
          "author": "Alphaa__777",
          "text": "Depends on the region but what worked for me and others in my org is content led lead gen and then sales.",
          "score": 1,
          "created_utc": "2026-02-19 07:12:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o698jhn",
              "author": "Ok-University-2605",
              "text": "and is a led lead gen ?",
              "score": 1,
              "created_utc": "2026-02-19 15:35:45",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o69xpal",
          "author": "Leading_Nothing_6532",
          "text": "Can you start within your network? Or find some affiliation between you and your potential customer (e.g. same university, same city). If there's no one within your network that'll hear you out then it's going to be a steep mountain to climb",
          "score": 1,
          "created_utc": "2026-02-19 17:36:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6aosmw",
          "author": "Fun_Dog_3346",
          "text": "What about their marketing strategy ? Do they actively using different channels ? Any ads ? Also have you studied the competitors deeply ?",
          "score": 1,
          "created_utc": "2026-02-19 19:44:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5v7ck0",
          "author": "RavinderOberoiReal",
          "text": "Try offline marketing..visit the office of your ICP and try to show your product to them",
          "score": 1,
          "created_utc": "2026-02-17 13:58:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5v9njj",
              "author": "Ok-University-2605",
              "text": "My job is to find international clients, I can’t just get on a plane and go 🥲",
              "score": 2,
              "created_utc": "2026-02-17 14:11:16",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5v9tpi",
                  "author": "RavinderOberoiReal",
                  "text": "You can hire someone local to do it for you",
                  "score": -1,
                  "created_utc": "2026-02-17 14:12:12",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1r5tu02",
      "title": "How to take angel investments?",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1r5tu02/how_to_take_angel_investments/",
      "author": "friedrizz",
      "created_utc": "2026-02-15 23:42:32",
      "score": 17,
      "num_comments": 16,
      "upvote_ratio": 1.0,
      "text": "Been speaking with a few people about angel investments. Typically they are executives of big companies.\n\nThey seem interested, and wanted to move forward. But my guess is they are inexperienced and don’t really want to admit that they don’t know how to do it logistically.\n\nSo they get sane valuation cap as other VCs for a 1-2 million pre seed round?\n\nHow do you strategically engage with them? Like push them to write checks? Or give them time?\n\nAlso do you put all these angels in a RUV or you take individual checks and sign SAFE with each of them?\n\nDo angels often write checks before VC leads a round or they tend to commit first but only wire when the round is closed and lead by a VC?\n\nThanks everyone for helping!",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1r5tu02/how_to_take_angel_investments/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o5luphd",
          "author": "HeyPashi",
          "text": "At some point you have to get one Business Angel to lead the round or pretend you have a Business Angel that leads the round. And then go to the other Angels and basically say:  \n\"So the premony Valuation is X and I like to close by Date Y. I would love to have you on board. Do you want to commit a ticket?\"\n\nBasically you first want to talk and give time to think. But once you annouce, that you will to close the round, you kinda have to follow through. Otherwise it will never close. There are of course exceptions and some people just raise money continuosly, but I dont know how realistic that would be for most founders.\n\nYou can also use a SAFE instead of a fixed premoney valuation and just include a cap. Ycombinator says, that this is the way to go and maybe it is in the US. I am from Europe and I think priced rounds are more common for Business Angels here.\n\nIn terms of when Business Angels like to participate:  \nA Business Angel usually likes to invest money 1 day before another VC would invest at a higher valuation.",
          "score": 6,
          "created_utc": "2026-02-16 01:11:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5lvo37",
              "author": "friedrizz",
              "text": "So like they don’t wire until a VC lead the round? Also do angels get the same valuation cap as other VCs?",
              "score": 1,
              "created_utc": "2026-02-16 01:17:37",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5lw4we",
                  "author": "HeyPashi",
                  "text": "I kinda meant it as kinda a joke. They like to invest as late as possible so that a lot of risk is gone, while still getting a low valuation that has a lot of risk priced in.\n\nBusiness Angels can invest with VCs and I heard, that they sometimes get better conditions. But this is a really complex topic and depends on many circumstances.\n\nMy understanding is, that you are currently in talks with Business Angels. And therefore I would not worry too much about, what a VC would to in the same round. ",
                  "score": 1,
                  "created_utc": "2026-02-16 01:20:36",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5m6xzm",
          "author": "Basic_Wind_8549",
          "text": "Don’t over complicate things. Grab the safe from the yc website, input the agreed upon valuation and amount they committed to. Send it to them with wire instructions. The whole point of a safe is it’s not a round where everyone needs to commit at once. \n\nRead about the safe, and handshake agreements.",
          "score": 2,
          "created_utc": "2026-02-16 02:30:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5m73zs",
              "author": "friedrizz",
              "text": "No I mean I get it. My question is literally about after.",
              "score": 1,
              "created_utc": "2026-02-16 02:31:07",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5o3rpl",
                  "author": "worldprowler",
                  "text": "After they get email investor updates, you’ll then may have a priced equity round months or years from now which converts them to preferred equity holders, at that point your law firm will handle everything related to paper work",
                  "score": 4,
                  "created_utc": "2026-02-16 11:58:42",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o5p0jrs",
                  "author": "Basic_Wind_8549",
                  "text": "That’s it’s… there’s nothing after. Once they sign you send them wire details.",
                  "score": 2,
                  "created_utc": "2026-02-16 15:14:13",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o5pmum8",
              "author": "HALtheWise",
              "text": "Adding onto this, if you don't yet know what valuation you'll be using, it sometimes makes sense to sign an uncapped MFN SAFE, which means they end up getting the same valuation as other investors.",
              "score": 1,
              "created_utc": "2026-02-16 16:58:47",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5mf7pg",
          "author": "Necessary_Spring_542",
          "text": "Any guidance on cap on a smaller angel/F&F round prior to a pre-seed round? Any best practices regarding how much to raise at this smaller cap? IE: If planning to do a million at 10 cap for pre-seed, should you not do more than \\~300k at 5-6M cap to get the angels in the door and fund experiments/further traction?  \n  \nObviously it's all rounding numbers at the end of the day, but more specific guidance/best practice would be appreciated.\n\nCurious how it differs for Consumer, B2B, Marketplace, etc. ",
          "score": 1,
          "created_utc": "2026-02-16 03:24:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5o3vl0",
              "author": "worldprowler",
              "text": "Lookup state of pre-seed report by Carta",
              "score": 1,
              "created_utc": "2026-02-16 11:59:34",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5ptz4w",
                  "author": "Necessary_Spring_542",
                  "text": "That answers total pre-seed but doesn't break out a smaller angel round prior, unless you think it's fair to just take the median amount from smaller raises (IE: 8M median cap here for <250k) then raise the rest of the pre-seed later at a higher cap...\n\nhttps://preview.redd.it/zkwptg1k6wjg1.png?width=1524&format=png&auto=webp&s=af1e93c96195f14c4272f680a1311f7606fea95b\n\n",
                  "score": 1,
                  "created_utc": "2026-02-16 17:31:58",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5p0xmo",
          "author": "quietoddsreader",
          "text": "angels mostly take cues from u.. if the terms and timeline feel fuzzy, they’ll wait forever.. i’d keep it simple with a standard safe and create real momentum around a close date, because most angels move when there’s a lead and a clear round forming.. pushing rarely works, but signal and urgency do.. without that, “interested” just means optional..",
          "score": 1,
          "created_utc": "2026-02-16 15:16:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5r0b6j",
              "author": "friedrizz",
              "text": "So no need to put them in a RUV?",
              "score": 1,
              "created_utc": "2026-02-16 20:52:52",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o649u0p",
          "author": "ArtLumpy4840",
          "text": "Totally up to your specific situation... but it seems that a SAFE is recommended if you want to reduce complexity / make everything simpler and faster. I agree with the saying that it's not a yes until you receive the money.",
          "score": 1,
          "created_utc": "2026-02-18 20:24:52",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r4d129",
      "title": "Your opinion on chat first interfaces",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1r4d129/your_opinion_on_chat_first_interfaces/",
      "author": "Sid_vj",
      "created_utc": "2026-02-14 06:08:48",
      "score": 15,
      "num_comments": 30,
      "upvote_ratio": 0.86,
      "text": "In recent days, I’ve across a lot of guys like Crow from YC who help build ai native chat first interfaces for B2B and legacy applications.\n\nI love chat first interfaces but I’m not sure how good the market for such adoption is.\n\nWhat’s your opinion? Is this smth that businesses will use-adopt-implement or is it another generic chatbot interface cuz at the end of the day it’s just another more smarter chatbot.\n\nFor context: crow helps navigate through applications using prompt instead learning the ui n etc",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1r4d129/your_opinion_on_chat_first_interfaces/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o5asi3j",
          "author": "Away-Abrocoma45",
          "text": "Lazy UI, in my opinion. Great for demos.",
          "score": 16,
          "created_utc": "2026-02-14 06:17:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5b7jk8",
              "author": "Sid_vj",
              "text": "Even if it help users have reduced friction to their outcome, do you have the same opinion?\n\nFor example: messy ui systems like CRMs and ERPa",
              "score": 2,
              "created_utc": "2026-02-14 08:38:12",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5bts2d",
                  "author": "ProvidenceXz",
                  "text": "Maybe ask why they are messy? What does each button do?",
                  "score": 6,
                  "created_utc": "2026-02-14 12:10:22",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5b2yim",
          "author": "bersuku",
          "text": "Def not a general solution. I mean, GUIs replaced command lines, right?",
          "score": 3,
          "created_utc": "2026-02-14 07:53:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5b7pfu",
              "author": "Sid_vj",
              "text": "Ahhh, that’s an interesting insight",
              "score": 2,
              "created_utc": "2026-02-14 08:39:47",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o5ozi38",
              "author": "ajcaca",
              "text": "I don't think this is a good analogy. A typical user can't type into your CLI, \"go find me all the bank statement files in this folder\".  \n  \nThe free-text prompt UI allows users to express semantic intent that gives them a lot of power over the computer that they wouldn't otherwise have.",
              "score": 1,
              "created_utc": "2026-02-16 15:08:57",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o63s29i",
              "author": "Complete-Poem578",
              "text": "chat-first interfaces are still used all the time. you use it every time on iMessage, WhatsApp, Telegram, Slack...heck even Expedia...to talk to real people.\n\nexcept this time you'd talk to an AI agent\n\n\"hey mom, what was that recipe you used to make when I was a kid\"\n\nis not too far off from\n\n\"OpenClaw, give me a recipe with X ingredients\"",
              "score": 1,
              "created_utc": "2026-02-18 19:02:33",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5dljv2",
          "author": "Forsaken_Lie_8606",
          "text": "fwiw ive been working on a project that involves integrating a chat first interface with a legacy system and imo its been a game changer for our users, they can just ask for what they need instead of navigating through a clunky ui. that being said, i do think theres a limit to how much businesses will adopt this tech, at least in the short term. weve seen about a 20% increase in user engagement since implementing the chat interface, but its still a pretty small sample size. ngl, im curious to see how crow and other similar startups will handle the complexity of larger, more entrenched systems.",
          "score": 3,
          "created_utc": "2026-02-14 18:13:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5jc501",
              "author": "Sid_vj",
              "text": "Damnn… insane figures!! We are building these interfaces with a mindset that it helps in product discovery and user dynamics insights. Even I’m curious to see where this takes us",
              "score": 1,
              "created_utc": "2026-02-15 17:12:59",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o5jph4t",
              "author": "BlackDorrito",
              "text": "hey, founder of Crow here! super cool to see you on a similar path. let’s chat if you feel there’s insights we could share - feel free to dm me",
              "score": 1,
              "created_utc": "2026-02-15 18:18:07",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5bmcwb",
          "author": "Hecker8778",
          "text": "Dude the whole chat first thing is tricky. Legacy B2B software like SAP or old CRMs have UI that looks like an airplane cockpit so being able to just type out a prompt instead of clicking through forty tabs is actual magic. But businesses will not adopt it if the AI just links them to a help article. It has to actually execute the task. It is the exact same reason I use runable for my workflow, I do not want to click through menus I just want the output immediately. If Crow actually executes the prompt by hitting the backend APIs like it claims then it is a massive winner. If it is just a glorified FAQ bot it will churn in a month. People just want to skip the learning curve and get the job done.",
          "score": 2,
          "created_utc": "2026-02-14 11:03:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5bxxjq",
              "author": "Sid_vj",
              "text": "Interesting insights man.. yeah they are headache to learn n use. Can you give a more under the hood idea on how u use runnable",
              "score": -1,
              "created_utc": "2026-02-14 12:43:41",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5c7ko7",
          "author": "the_corporate_slave",
          "text": "Once the models get better, ui will be generated on the fly to match the json payload. Any rigid typescript interfaces are obsolete",
          "score": 2,
          "created_utc": "2026-02-14 13:49:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5c7wln",
              "author": "Sid_vj",
              "text": "Ahh isn’t that like at least 2 years min down the line",
              "score": 1,
              "created_utc": "2026-02-14 13:51:27",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5c94xf",
                  "author": "the_corporate_slave",
                  "text": "No it works pretty well now if you build it right with reusable components",
                  "score": 1,
                  "created_utc": "2026-02-14 13:58:57",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o5jrien",
              "author": "ParkingNewspaper1921",
              "text": "vercel labs recently made a project exactly like you said called json-to-render it's on their public repo",
              "score": 1,
              "created_utc": "2026-02-15 18:27:57",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5mgt3s",
          "author": "candypants77",
          "text": "I thought chat-first was “lazy” at first, but natural language is the native interface for user intent. It’s much easier for users to “ask” what they want in plain English rather than trying to learn some custom interface. As you add more features it can also be a pain to maintain that interface and adapt it as you add more complexity.\n\nAnother thing is that, for some use cases, having a visualization can be very helpful and having inline ui within your chat is an easy thing to implement and add.",
          "score": 2,
          "created_utc": "2026-02-16 03:34:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5b0m11",
          "author": "llkjm",
          "text": "i don't think chat first interfaces are better across the board. i think humans are visual creatures, we have learnt to read and write and think visually and spatially. interfaces narrow down the important info much better than text can. ",
          "score": 2,
          "created_utc": "2026-02-14 07:31:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5b7nv0",
              "author": "Sid_vj",
              "text": "Even if the ui is messy or the learning curve of the software is high?",
              "score": 0,
              "created_utc": "2026-02-14 08:39:20",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5bsw6q",
                  "author": "llkjm",
                  "text": "thats the problem with the interface design.",
                  "score": 3,
                  "created_utc": "2026-02-14 12:02:50",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5azivb",
          "author": "quantumsequrity",
          "text": "Voice is also a  better option.",
          "score": 1,
          "created_utc": "2026-02-14 07:21:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5b7lmt",
              "author": "Sid_vj",
              "text": "Interesting, what if you can speak but it transcribes to text to execute?",
              "score": 1,
              "created_utc": "2026-02-14 08:38:44",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5b14hp",
          "author": "BiteyHorse",
          "text": "Nah these companies are not legit, just throwaway froth.",
          "score": 1,
          "created_utc": "2026-02-14 07:36:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5bn9j2",
          "author": "-night_knight_",
          "text": "idk man, maybe im too conservative, but it seems like a chat is a weird one, its not straightforward enough, no buttons that build the user flow, big mental load from having to think of messages. Good for some but not sure if it suits for mass market",
          "score": 1,
          "created_utc": "2026-02-14 11:12:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5byddp",
              "author": "Sid_vj",
              "text": "Ahh fair fair",
              "score": 2,
              "created_utc": "2026-02-14 12:47:04",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5g3sl8",
          "author": "BendEqualLock",
          "text": "Chat UI gives best accessibility, but workflow UI indicates stability that business wants to see.",
          "score": 1,
          "created_utc": "2026-02-15 02:57:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5jc6pz",
              "author": "Sid_vj",
              "text": "Interesting",
              "score": 1,
              "created_utc": "2026-02-15 17:13:14",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5ozood",
          "author": "quietoddsreader",
          "text": "chat first is compelling in demos, but in b2b it has to be the fastest path to a real outcome or people default back to the ui.. teams optimize for reliability and habit, not novelty.. if it just wraps existing flows, adoption fades.. it gets interesting when it replaces a painful workflow entirely, not when it’s a smarter help bar..",
          "score": 1,
          "created_utc": "2026-02-16 15:09:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ey30j",
          "author": "Hemant_93133",
          "text": "chat-first interfaces make sense when the underlying workflow is complex and repetitive. they’re not just “smarter chatbots” if they actually replace navigation and reduce cognitive load. adoption will depend on reliability, auditability, and clear time savings. for power users, chat can be faster than ui. for everyone else, it needs strong guardrails to avoid becoming another layer of friction.",
          "score": 1,
          "created_utc": "2026-02-20 13:00:29",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r6i2wh",
      "title": "Skills to work on to be a better founder? (Advice on how to be more entrepreneurial)",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1r6i2wh/skills_to_work_on_to_be_a_better_founder_advice/",
      "author": "DurvalM",
      "created_utc": "2026-02-16 18:45:09",
      "score": 13,
      "num_comments": 19,
      "upvote_ratio": 0.9,
      "text": "Hi, I'm a student, I have good internships, consider myself good in the technical side, and I can get good tech jobs.\n\nEveryone in my family is a business owner pretty much, and I grew up with that, both in the country I used to live and now in the US.\n\nI don't like corporate that much and I think there's more out there for me, I see people who are really bright, ship products, have connections, raise money, do extremely nice technical work, marketing, etc...\n\nI want to be like that, and I would like advice from you guys on how people become that cracked as founders.\n\nI go to college in the suburbs of Florida and there's not much going on here in terms of tech, I barely know anyone here who can code and wtv, all the technical people I know are in other states, some of them started full time jobs, and I feel really disconnected from the silicon valley innovations and etc, even though I lived in the Bay before. \n\nI worked in multiple projects before, I'm a coder ever since high school, I have projects that companies used for 2 years+, I'm currently working on another project that's gonna help a lot of people, and I keep on doing that because my dream is to be a founder and have my own products and control of my own life and what I do.\n\nWith that being said, I feel sooo far behind from all these people who do it so easily, if you guys could give me some advice on what to work on, what skills that help people be better founders and ship higher quality and importance products, and how to get there, I would be really thankful for that kind of advice.\n\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1r6i2wh/skills_to_work_on_to_be_a_better_founder_advice/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o5qbtfz",
          "author": "isitaboat",
          "text": "\"Make something people want\" - go do that, and charge for it. Don't sell your time - make something. You'll learn that way.",
          "score": 3,
          "created_utc": "2026-02-16 18:54:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5qcm5e",
              "author": "Eric_emoji",
              "text": "yea just keep building, and dont expect things to work out immediately. could be years before something takes off",
              "score": 1,
              "created_utc": "2026-02-16 18:57:46",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o5qoyr6",
              "author": "DurvalM",
              "text": "But aside from that, what are some of the skills and secrets to learn that helps becoming a better maker?",
              "score": -1,
              "created_utc": "2026-02-16 19:56:53",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5rnv8h",
                  "author": "isitaboat",
                  "text": "No aside, just go do it until you're not failing at it",
                  "score": 2,
                  "created_utc": "2026-02-16 22:49:53",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5ta3um",
          "author": "Superb_Cherry1498",
          "text": "You are honestly not behind. You are just early and self aware.\n\nFrom what you wrote, you already have a strong base. Solid technical skills, real projects in production, and business exposure from your family. That is more than most students.\n\nIf you want to level up as a founder, here is what I would focus on beyond coding:\n\n1. Learn to pick better problems. A lot of engineers focus on building. Strong founders focus on problem selection. Is the problem painful? Are people already paying to solve it? Are current solutions weak?\n2. Get good at talking to non technical people. Sales, clear communication, and asking the right questions matter a lot. If you cannot explain your product clearly to someone who does not code, it is not ready.\n3. Think about distribution early. Most products do not fail because of bad code. They fail because nobody sees them. Before building, ask yourself how users will find you.\n4. Build emotional durability. The feeling that everyone else is ahead is normal. You are comparing your daily work to someone else's highlight reel. Every strong founder has many failed attempts behind the scenes.\n\nAlso, being outside Silicon Valley is not a major disadvantage anymore. Most valuable conversations happen online now.\n\nYou do not need to be exceptional today.  \nYou need to keep building, keep talking to users, and stay in the game long enough to compound your skills.\n\nThe founders who win are not the ones who looked impressive at twenty one.  \nThey are the ones who did not quit.",
          "score": 2,
          "created_utc": "2026-02-17 04:40:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5qrh6o",
          "author": "Ok-Initiative-4009",
          "text": "i was in a similar spot a few years ago. good tech job at a big company, coding since high school, wanted to build my own thing. quit about 3 months ago to go full time on my startup. here's what i've learned so far, and i'm still very early so take this with a grain of salt. the \"these people do it so easily\" thing is a trap. nobody does it easily. you're comparing your behind the scenes to their highlight reel. i felt the same way reading founder stories and then i actually started and realized everyone is just figuring it out in real time.\n\n skills that have mattered way more than i expected:\n\n 1. talking to people who aren't engineers. selling, pitching, explaining your idea to someone who doesn't care about the tech. this was the hardest adjustment for me coming from pure engineering.\n\n 2. being okay with not knowing things. i had no idea how to do customer research, how to write a cold email that gets replies, how to think about pricing. you just learn it as you go. nobody has all the skills before they start.\n\n 3. saying no to building. this sounds weird but the urge to just code something is strong. learning to validate before building has saved me from wasting months on stuff nobody wants.\n\nthe florida isolation thing is real but honestly i'm in denver and the local scene doesn't matter as much as you'd think. most of my useful conversations happen online. reddit, twitter, discord communities. you don't need to be in SF. you're already ahead of most people because you're building things and thinking about this stuff as a student. don't compare yourself to people 10 years into their careers. just ship stuff and talk to users. that's literally 90% of it.",
          "score": 1,
          "created_utc": "2026-02-16 20:09:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5qt4i6",
              "author": "DurvalM",
              "text": "Hey man, I really appreciate it, that's the kind of advice I was hoping to hear man.\n\nAnd how do you deal with the feeling that anything you look into building already exists, or you have some idea you think would be great but no idea ppl would use, how you find feasible ideas to work on and stuff, any advice on that idea side of things?",
              "score": 2,
              "created_utc": "2026-02-16 20:17:13",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5qxlo3",
                  "author": "Ok-Initiative-4009",
                  "text": "honestly i deal with it badly lol. the \"everything already exists\" feeling is constant. but here's what helped me reframe it. everything existing doesn't mean everything is good. or that it works for everyone. the person who posted the one-trick pony saas in this sub earlier made sales specifically because the big tools overcomplicate things. the gap isn't \"nobody does this.\" the gap is \"nobody does this well for this specific type of person.\"\non the \"no idea if people would use it\" part, that's literally what i'm spending all my time on right now. customer interviews. i find people who might have the problem i'm thinking about and just ask them about their day, their workflow, what annoys them. not \"would you use my thing\" because everyone says yes to that and it means nothing. the book The Mom Test helped me a lot with this. the core idea is stop asking people if your idea is good and start asking about their actual behavior. what do they do today, what have they tried, what\ndid they pay for. the answers tell you way more than opinions. for finding ideas honestly i just pay attention to stuff that annoys me or people around me. my current thing came from a problem i kept seeing at my old job that nobody was solving well. not some big original insight, just a real pain point i experienced firsthand. the best advice i got was stop looking for a perfect idea and start looking for a real problem. ideas are cheap, problems that people will pay to solve are not.",
                  "score": 1,
                  "created_utc": "2026-02-16 20:39:32",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5qu5n2",
          "author": "nvn1202",
          "text": "Will you be interested to be part of an early stage startup? Currently we plan to launch only in India. And then consider going international.",
          "score": 1,
          "created_utc": "2026-02-16 20:22:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5qvu3b",
          "author": "pagenotdisplayed",
          "text": "Be good at solving problems. In my experience, being a Founder has involved solving new problems every day for years and years.\n\nAlso get good at getting good at things. Be able to pick up on new tools quickly.",
          "score": 1,
          "created_utc": "2026-02-16 20:30:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5srum1",
          "author": "DylanFromCheers",
          "text": "The disconnected feeling is super normal and honestly might be an advantage. When I was at BYU I felt the same way. What actually moved the needle for me wasn't networking with SV people, it was just finding one real problem I cared about and talking to people who had it. The skills come a lot faster than you think once you have something to you're actually building toward.",
          "score": 1,
          "created_utc": "2026-02-17 02:42:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5uas96",
          "author": "Forsaken_Lie_8606",
          "text": "ngl im in a similar situation, not a whole lot of tech stuff going on in my area either, but ive found that attending online conferences and meetups has been super helpful in getting connected with other%speople in the industry, ngl its not the same as being there in person but its better than nothing, ive also been trying to read as much as i can about startups and entrepreneurship, paul grahams essays have been really insightful for me, and ive been trying to build my own projects just to get a feel for what its like to be a founder, even if theyre not huge successes, just the process of building something from scratch has been really valuable imo curious what others think",
          "score": 1,
          "created_utc": "2026-02-17 10:01:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o62dasb",
          "author": "reddit_user_100",
          "text": "Figure out what people want. That’s the core of business and much easier said than done.",
          "score": 1,
          "created_utc": "2026-02-18 15:14:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o692vr8",
          "author": "PNW_Uncle_Iroh",
          "text": "Have you gone through the startup school curriculum? I’d start there to get the basics.",
          "score": 1,
          "created_utc": "2026-02-19 15:07:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6a7kqh",
          "author": "PrivilPrime",
          "text": "You may try YC Combinator",
          "score": 1,
          "created_utc": "2026-02-19 18:23:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6cs0lq",
          "author": "Rishi_445",
          "text": "As a student, surround yourself with new people and learn how to get along with everybody. Value your time as a student and take advantage of the fact you will meet incredible people. You never know, in a few years those contacts will be the ones to help you out. Don't network for the sake of it, create long-term friendships",
          "score": 1,
          "created_utc": "2026-02-20 02:36:22",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r5l2e9",
      "title": "Is OPT required immediately at the start of the batch cycle in April?",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1r5l2e9/is_opt_required_immediately_at_the_start_of_the/",
      "author": "LRB_",
      "created_utc": "2026-02-15 17:52:36",
      "score": 11,
      "num_comments": 5,
      "upvote_ratio": 0.93,
      "text": "Question for international students who have gone through the process.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1r5l2e9/is_opt_required_immediately_at_the_start_of_the/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o5jyida",
          "author": "Forsaken_Lie_8606",
          "text": "tbh i went through the yc process last year and im pretty sure opt isnt required immediately at the start of the batch cycle in april, at least it wasnt for me. i had to apply for it like 2 months in, when we were getting closer to launching our product and needed to sort out the legal stuff. ngl, the whole process was a bit of a pain, but yc was super helpful in guiding us through it. we had to%spay like 10k in legal fees to get everything sorted, but it was worth it in the end. imo, its worth reaching out to the yc team directly to get a clearer answer on this, theyre usually pretty responsive and can give you a better idea of what to expect curious what others think",
          "score": 2,
          "created_utc": "2026-02-15 19:01:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5kg4tv",
              "author": "LRB_",
              "text": "Do you mind if I DM you?",
              "score": 1,
              "created_utc": "2026-02-15 20:31:01",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5kwsu8",
          "author": "Personal-Inside346",
          "text": "It isn’t mandatory just to attend the batch, but it becomes necessary if you re actively working for your company. Technically, you re not allowed to work, even unpaid, before your OPT EAD start date. \n\nP.S - Not a lawyer but been thru the o1 & eb1a process to know this.",
          "score": 1,
          "created_utc": "2026-02-15 21:56:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5q6l8e",
              "author": "sucm_cIown",
              "text": "Yeah but you could build mvp which counts as ground work(allowed) or if you have patent you could say you were working on proof of concept(pocs) or just hire freelancer for cheap, Other way(mostly for senstive industry like defense) would be abit gray area you could hire someone from friends or family for minimum price who is allowed to work or is citizen then transfer all work credit to them since you hired everything checks out but it is matter of honesty and stuff so its at your own risk...even if you listen to my advice, you still have to decide for yourself",
              "score": 1,
              "created_utc": "2026-02-16 18:30:08",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5rq4pp",
                  "author": "Personal-Inside346",
                  "text": "Yeah and If you want to run a company successfully, you have to be willing to take risks. Consider this one of your first.",
                  "score": 1,
                  "created_utc": "2026-02-16 23:01:58",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1r7d88r",
      "title": "Confession to make. I have built products but not really shipped them!",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1r7d88r/confession_to_make_i_have_built_products_but_not/",
      "author": "desparate_geek",
      "created_utc": "2026-02-17 17:51:22",
      "score": 10,
      "num_comments": 8,
      "upvote_ratio": 0.92,
      "text": "I know the simple answer for this would be simply to say \"just ship it\". Even when I have ended up shipping up projects, I have not given them enough views to conclude failure / success. \n\n  \nHow do you determine?\n\n\\- when to stop working on a project?  \n\\- how do I avoid burnouts and ensure my projects get enough views before shutting the shop! \n\nFor folks in this loop / cycle, what practical advice really helped?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1r7d88r/confession_to_make_i_have_built_products_but_not/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o5y03l7",
          "author": "Ok-Initiative-4009",
          "text": "this is interesting because i have the opposite problem. i'm 3 months into validating and haven't written a line of product code. every day i want to just build something but i keep telling myself to finish the research first. so in a weird way i get it. the building part feels safe. you're making progress, you can see the code, it's tangible. shipping means people might look at it and say \"this sucks.\" that's terrifying. things that have helped me with the validation side that might apply to shipping too:\n\n1. set a hard deadline. i told myself \"by month 4 i'm building no matter what.\" maybe for you it's \"by friday this goes live no matter what.\" deadlines force decisions.\n\n2. define what \"enough views\" means before you launch. if you say \"i'll launch and see what happens\" you'll always find a reason to say it didn't get a fair shot. pick a number. 100 signups, 500 visitors, 10 conversations, whatever. hit that number then decide.\n\n3. ship ugly. the version in your head will always be better than what you can build right now. that gap is what keeps people from shipping. just accept that v1 will be embarrassing and put it out anyway.\n\nthe burnout thing is real though. i think it comes from working on stuff without getting any signal back. building in isolation is draining. shipping even something small and getting feedback, even negative feedback, is energizing in comparison.",
          "score": 3,
          "created_utc": "2026-02-17 22:06:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o60wax9",
              "author": "Coconutcornhuskey",
              "text": "Real",
              "score": 1,
              "created_utc": "2026-02-18 09:23:13",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5wioah",
          "author": "murzihk",
          "text": "Success for a product can be defined by change in behavior of end users, there can be ways to measure this dependent on your product. For e.g, if your product is a social media, you can track engagement metrics like Daus and Maus",
          "score": 2,
          "created_utc": "2026-02-17 17:56:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o606p3x",
          "author": "grewgrewgrewgrew",
          "text": "it's left foot, right foot. learn, build, learn, build.",
          "score": 2,
          "created_utc": "2026-02-18 05:36:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6107k7",
          "author": "quietoddsreader",
          "text": "not shipping is usually fear of clean feedback.. i set explicit kill criteria before starting, like “if no one uses this weekly after x weeks, i stop”.. without that, u’ll just keep polishing.. burnout often comes from building without users, so shorten the loop.. ship small, get signal, decide.. ambiguity drains more energy than failure..",
          "score": 1,
          "created_utc": "2026-02-18 09:59:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o615kn0",
          "author": "Popular-Penalty6719",
          "text": "The issue here boils down to the \"build it and they will come\" mentality. Without a clear understanding of your target audience and their needs, product development becomes a guessing game. \n\nConnect with users early on. Their feedback will help steer your efforts in a meaningful direction, rather than assuming you know what they want. This reduces wasted resources and time. Ensure there's a human connection involved; too much focus on automation can lead to losing sight of user needs.\n\nThink smaller and modular. Instead of trying to create an entire platform at once, launch iteratively. Test specific features or functionalities first, then expand based on real feedback. This pragmatic approach often leads to better outcomes with fewer headaches.",
          "score": 1,
          "created_utc": "2026-02-18 10:47:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o67ldu4",
          "author": "ApprehensiveCry7955",
          "text": "You’re not alone, this loop is super common. Building feels safe, shipping feels vulnerable.\n\nWhat helped me:\n\n* Decide *before building* what “success” and “failure” mean (e.g., 30 days live + real user feedback).\n* Separate building from distribution. If you don’t promote it, it didn’t really get a fair shot.\n* Ship ugly versions. Perfect is just procrastination in disguise.\n* Timebox projects so you don’t burn out (e.g., 2–4 weeks build, 2–4 weeks push).\n\nMost projects don’t fail because they’re bad, they fail because they never got enough real-world exposure.",
          "score": 1,
          "created_utc": "2026-02-19 08:37:18",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r5qkq6",
      "title": "YC founders ghosting candidates after interviews",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1r5qkq6/yc_founders_ghosting_candidates_after_interviews/",
      "author": "Funky_angel",
      "created_utc": "2026-02-15 21:26:48",
      "score": 9,
      "num_comments": 26,
      "upvote_ratio": 0.77,
      "text": "H’all, this might be a bit off topic, but I’ve had interviews with a couple of YC founders. Everything seemed to go well, and the next steps were supposed to be connecting with other employees, co-founders, and moving into a more formal recruitment cycle or a task.\n\nTo add to my point, the conversation wasn't, let's see, or we are in the process of interviewing and we'll let you know. The conversation was, this is great, I like your background and energy and I'll schedule another meeting with them, give you a task some time next week, etc. \n\nOver the past few weeks, I’ve sent follow-ups, thank you notes and a few emails asking for clarity on the process and timeline and haven’t heard back at all.\n\nGenuinely asking YC founders here: is it a common practice to just ghost people you’ve interviewed with or spoken to? It feels a bit rude, don’t you think?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1r5qkq6/yc_founders_ghosting_candidates_after_interviews/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o5l2u61",
          "author": "pinkythemagnificent",
          "text": "It's not isolated to YC founders.\n\nIt could be a supply and demand thing (ie they're more focused on other candidates in their pipeline), or they could have changed directions re the role. Or they could have just dropped off the face of the earth. \n\nIt's shitty, but 1) it's out of your control; 2) the ghosting is more of a reflection of them, especially after your proactive attempts\n\nBest channel the energy to a team worth your time.\n\nSource: am YC founder",
          "score": 6,
          "created_utc": "2026-02-15 22:28:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5lej3b",
              "author": "Funky_angel",
              "text": "Every single thing you’ve mentioned could be communicated. Unfortunately, the founders lose credibility with all this. I referred a potential client to one of them and they ghosted again. I mean, if you're prioritizing scaling, I'm helping you out, not begging for a job.\n\nI know I'm qualified, I get offers, interviews and have some final rounds with top-tier companies lined up, don’t have time to delve and waste on this. That said, ghosting seems to be a pattern for YC founders, so thought to ask if it's a thing or not.",
              "score": 1,
              "created_utc": "2026-02-15 23:34:33",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5litv9",
          "author": "vfrolov",
          "text": "A few times I had interviews scheduled with YC co-founders, they’d never shown up.",
          "score": 7,
          "created_utc": "2026-02-16 00:00:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5ljxag",
              "author": "Funky_angel",
              "text": "Any email? suggestion to reschedule or an excuse? ",
              "score": 2,
              "created_utc": "2026-02-16 00:06:47",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5locnx",
                  "author": "vfrolov",
                  "text": "Nothing.",
                  "score": 2,
                  "created_utc": "2026-02-16 00:32:43",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5lx6n7",
          "author": "Gold_Emphasis1325",
          "text": "Startup world is chaos I'm not surprised... founders are very raw, sometimes totally new to everything and are moving super fast and at times with minimal resources. The fact they're hiring means they're already engines running in the red since they need the help. When there's 1-2 people and a marathon of high RPM it's to be expected they're going to drop balls. There are so many candidates out of work and new graduates it's a mess hiring process and chaos in the economy and tech markets and businesses...",
          "score": 3,
          "created_utc": "2026-02-16 01:27:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5m91ed",
              "author": "Funky_angel",
              "text": "I'm from SF, tech space and have worked at startups before. It's not my first rodeo, but I don't think this is a good enough excuse. Candidates do put effort, energy and time into their application process and genuinely want to join these startups to create value. As I said earlier to someone else, as a startup founder, if you're creating economic value, you should also take accountability for your words and actions towards the candidates, not just towards the clients and investors who pay you. Many of these people are also struggling. ",
              "score": 2,
              "created_utc": "2026-02-16 02:43:35",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o5m4csq",
              "author": "heross28",
              "text": "This",
              "score": 1,
              "created_utc": "2026-02-16 02:13:19",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5kv2e8",
          "author": "heross28",
          "text": "I am sorry you have to go through this, as a YC founder who has been recruiting, I think this happens when you’re not a strong yes and founders want to get back to you in the future based on need.\n\nWhen I recruit, if a candidate is really strong I move them to the next step almost on the call. For others I prefer to keep the communication open just in case a future more fitting role opens.",
          "score": 3,
          "created_utc": "2026-02-15 21:47:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5kw5tp",
              "author": "Funky_angel",
              "text": "Well, they seemed excited talking to me and even mentioned that they are impressed, said I'm a strong fit. And this has happened to me several times, not just once. I even emailed one of the founders on an entirely different topic, a great business opportunity for them, but they've dismissed my emails on that, too. \n\nI just want to understand why this is happening?! Is this the culture? If they say they like you and want to chat with you further and then ghost you entirely lol   ",
              "score": 2,
              "created_utc": "2026-02-15 21:53:12",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5loazg",
                  "author": "BullBear9",
                  "text": "This is called being “SF nice”\n\nIt’s conflict avoidance via being fake nice and then ghosting.  Happens all the time in the city",
                  "score": 2,
                  "created_utc": "2026-02-16 00:32:26",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o5lm4fi",
                  "author": "heross28",
                  "text": "Idk about this because when I ghost people, I would give something like, “let me check if this is a fit with the team and get back.” Often times it’s a soft rejection.",
                  "score": 0,
                  "created_utc": "2026-02-16 00:19:31",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5le54r",
          "author": "EmergencySherbert247",
          "text": "Had gone through the same thing and had bad experiences only with YC founders ! Almost all other founders were respectful and sent a rejection mail. Mind you other companies are doing pretty well too. Edit: Sorry one YC company was super respectful, but majority of ghosting in my pipeline was by YC founders.",
          "score": 1,
          "created_utc": "2026-02-15 23:32:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5lpi7d",
              "author": "Funky_angel",
              "text": "That's really sad. ",
              "score": 1,
              "created_utc": "2026-02-16 00:39:40",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5m31nb",
          "author": "FalconRelevant",
          "text": "Not my experience at all?",
          "score": 1,
          "created_utc": "2026-02-16 02:04:59",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r79ngz",
      "title": "Is there a vc-backed founder shutdown guide anywhere because cap table liquidation is a nightmare",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1r79ngz/is_there_a_vcbacked_founder_shutdown_guide/",
      "author": "itragers",
      "created_utc": "2026-02-17 15:51:28",
      "score": 7,
      "num_comments": 1,
      "upvote_ratio": 1.0,
      "text": "Winding down a venture with multiple investor classes is significantly more complex than the standard \"\"startup advice\"\" ever admits. The cap table math quickly becomes a nightmare when figuring out who gets what from remaining assets, especially when stacked liquidation preferences (like 1x participating vs. 1.5x non-participating) collide with a small cash pile.\n\nThe board inevitably demands watertight documentation, meaning checks cannot just be mailed out; legal approval on the distribution waterfall and individual sign-offs are mandatory. This is where the process stalls, investors often \"\"ghost\"\" because they are disappointed and disengaged, making it excruciatingly difficult to get the required signatures for dissolution.\n\nAdding to the chaos is the friction with option holders who never exercised but emotionally feel entitled to a payout. Explaining that unexercised options do not participate in distributions is a brutal conversation that repeats endlessly. It feels like an \"\"unspoken failure tax\"\" where founders are forced to navigate intense legal and interpersonal hurdles without a roadmap, all while trying to close a painful chapter.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1r79ngz/is_there_a_vcbacked_founder_shutdown_guide/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o5vwdsh",
          "author": "hau5keeping",
          "text": "[https://starcycle.ai/](https://starcycle.ai/)",
          "score": 0,
          "created_utc": "2026-02-17 16:06:20",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r75yyx",
      "title": "Demand validation of a physical product, how?",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1r75yyx/demand_validation_of_a_physical_product_how/",
      "author": "Cortexial",
      "created_utc": "2026-02-17 13:27:00",
      "score": 6,
      "num_comments": 10,
      "upvote_ratio": 1.0,
      "text": "I've built a physical product we use in my family.\n\nIt works well, so I've thought about turning it into a business.\n\nBut YC-style, I obviously want to try to validate the demand before I start a production.\n\n**The Product**\n\nThe product is a tablet for speech-disabled, and it works well.\n\n*I know we have ourselves as proof, but I'd like some additional validation.*\n\n\n\nFor software, I can build an MVP within a few days, but for this, I'm not sure how I can cheap and fast validate the demand.\n\n1. Launch a discounted presale?\n2. E-mail waitlist and paid socials?\n3. Build a shitty off-the-shelf modified tablet, and sell it cheap on second hand sites?\n4. Other ideas?\n\nThanks a lot! :)",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1r75yyx/demand_validation_of_a_physical_product_how/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o60vb60",
          "author": "Coconutcornhuskey",
          "text": "Validate the demand by taking your device and doing a Study. Have speech impaired people use it, record their reaction. Do it with 100 people. Use that average and scale it up. \nIf it helps a high percentage of those people and they’re willing and able to pay for one, you can show a little more validation of the idea. \n\nStarting a waitlist helps too",
          "score": 2,
          "created_utc": "2026-02-18 09:13:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o611sa3",
          "author": "quietoddsreader",
          "text": "for hardware, i’d validate pain before product.. talk to 20 to 30 families dealing with speech disability and see if they’re hacking together alternatives.. if they’re already paying for workarounds, that’s signal.. a landing page with clear value and a real preorder, even refundable, can test willingness to pay.. presales hurt less than unsold inventory..",
          "score": 2,
          "created_utc": "2026-02-18 10:13:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5zecou",
          "author": "sailormars27x",
          "text": "For my product in the beginning just a list of people who think that they would actually use it is validation. X people said they would be interested or X people saw the demo and said it would be helpful. You can have an informal waitlist if you ask if they would want to use the first version. In your case probably seeing how much interest speech-disabled users have is the best validation. Try to get feedback like: this would help me do x better, this would make school easier for me, or learning x.  Try to ask other questions like what other products do you use that are like this/ to help with this. How do u solve the problem currently or navigate it( this will give valuable user input) how much would you pay for something like this etc and try to validate more than just demand like other parts of ur plan",
          "score": 1,
          "created_utc": "2026-02-18 02:33:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o64fyk1",
          "author": "VainVeinyVane",
          "text": "The same as how you validate any products\n\n1) find pain points, as another comment said. You need to prove it works as a business to yourself before it works to others, or you’re just wasting time.\n2) bootstrap a campaign. \n3) launch your campaign on kickstarter. The more money you get the more you know people want it. People speak with their dollars.\n\nAt this point on, you can possibly get funding. It’s up to you depending on how you want to scale and how much equity and oversight you’re willing to deal with.\n\n4) start selling prototypes, shipping out to beta users and influencers who can bring name to your product\n5) get feedback, iterate.\n\n6) if all of these cycles have gone well you should have the money to produce and meet your existing demand by now. If not then that means your business didn’t have the demand it needed, or you weren’t good enough at executing. Either way it means you wouldn’t have succeeded anyways so it’s time to give up and try again\n\n-> taken from the lean startup method\n\nThere really aren’t any shortcuts and there’s no quick way to validate the demand. That’s why being honest with yourself based on initial market feedback from raw interviews or surveys is so important. Also just so you know: circuit design and hardware takes a long time and a lot of money. I built hardware and exited last year and if you’re serious about this then you should be prepared for the launch cycle to take a year or two minimum before you even have a working MVP. \n\nEven the most basic designs have long wait times between finding a viable chip producer, finding viable PCB makers, waiting on fab times, finding manufacturers for your case/shell/glass or any materials you might have, and of course testing between each one to make sure they work.",
          "score": 1,
          "created_utc": "2026-02-18 20:53:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6f1y0n",
          "author": "CoolSnow01",
          "text": "In your case I can see 2 different things to validate:  \n\\- Demand (\"do people want this?\")  \n\\- Usability (\"does it work as they expect?\")\n\nDemand might be easier and cheaper. I.e.: Let's say you set up a landing page promoting the product, telling what it does, some pictures, maybe a video of someone using it. Share it with the customer segment you are targeting and see how many people reach out.  You dont need to get out of your house to do this, and avoids spending money in building any additional units.  \n  \nIt is just an example, there are other ways of doing this. But just to give you a quick idea of demand validation.  \n  \nThe other part is usability. Before launching to market it might be a good idea to test how it works with real users outside of your family. If you validate demand first, you probably will have a waiting list in place. You can build a few tablets, deliver them to people who showed interest, and see what feedback they have. Other option is asking them to record specific use cases, etc.\n\nHow does it sound when put this way?",
          "score": 1,
          "created_utc": "2026-02-20 13:23:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5v9umh",
          "author": "UpperIndependence609",
          "text": "So why not just make it an app? Apple and Samsung dominate the tablet market. You can't beat their scale – mind you, that an iPad is 319 $.  Your physical product will definitely be less quality or much higher in price, both cases would be devastating in terms of business aspects. \n\nFamilies don't want to buy a second tablet. They already own one. The value your device provided your family was not the vehicle (the tablet) but the value (the communication).\n\nBy insisting on building hardware, you are actively choosing a worse business model with less margins and a smaller total addressable market.",
          "score": 1,
          "created_utc": "2026-02-17 14:12:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5vd0tf",
              "author": "Cortexial",
              "text": "We're not exclusively building an app, because a key difference is that the tablet is purpose-built.\n\nIt's meant to be stationary, there are no apps, we have a bit of external hardware to control it, we need 100 % remote control of it (which general purpose tablets don't offer for good reasons) etc. etc.\n\nAnd, respectfully, I wasn't asking for advice on whether we should handle the hardware or not. I didn't build this myself as a SISP, I built it because there isn't any good options on the market at all, to cover our needs.\n\nWith the limited context, you also can't really determine whether it's a \"worse business model\". iPad or a Samsung tablets wouldn't be an alternative.\n\nWhat I'm asking is inputs on how to validate the demand, before I start a costly production. In our case, it's not an option to launch without a single piece of hardware. The hardware itself, the controls etc. is exactly our product.",
              "score": 1,
              "created_utc": "2026-02-17 14:29:22",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r8fe8m",
      "title": "What is the timeframe for the review on YC co-founder matching?\nIt's been almost a week, and I haven't heard back...",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1r8fe8m/what_is_the_timeframe_for_the_review_on_yc/",
      "author": "CrushTheDay",
      "created_utc": "2026-02-18 21:08:59",
      "score": 4,
      "num_comments": 4,
      "upvote_ratio": 1.0,
      "text": "",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1r8fe8m/what_is_the_timeframe_for_the_review_on_yc/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o6dc49m",
          "author": "susspectno1",
          "text": "they were pretty quick with mine. I think I got a response back in a couple days",
          "score": 1,
          "created_utc": "2026-02-20 04:50:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6dcupp",
          "author": "Great_Ad_3313",
          "text": "3 weeks no reply",
          "score": 1,
          "created_utc": "2026-02-20 04:55:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6edrvy",
          "author": "Forsaken_Lie_8606",
          "text": "yeah, thats a common pain in the co-founder matching process, the uncertainty can be kinda frustrating. i went through it last year and it took them around 10 days to get back to me, so youre still within a pretty normal timeframe imo. one thing that might be helpful is to make sure youve got a pretty solid idea of what youre looking for in a co-founder, that can make the matching process a lot smoother. i ended up getting matched with someone whos been an amazing partner, so its definitely worth the wait lol lol hope that helps",
          "score": 1,
          "created_utc": "2026-02-20 10:25:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6fh6rw",
          "author": "Suitable-Fudge4577",
          "text": "I think that means it's a no",
          "score": 1,
          "created_utc": "2026-02-20 14:44:33",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}