{
  "metadata": {
    "last_updated": "2026-01-06 02:36:07",
    "time_filter": "week",
    "subreddit": "ycombinator",
    "total_items": 20,
    "total_comments": 268,
    "file_size_bytes": 282765
  },
  "items": [
    {
      "id": "1q1eqzv",
      "title": "Solo founder, product is done, terrified of marketing. What actually worked for you?",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1q1eqzv/solo_founder_product_is_done_terrified_of/",
      "author": "CarlSagans",
      "created_utc": "2026-01-01 20:52:11",
      "score": 111,
      "num_comments": 141,
      "upvote_ratio": 0.97,
      "text": "Hey everyone,\n\nI'm a senior data engineer who built a small developer tool.\n\nThe product is done. Free tier is live. Docs are written.\n\nNow I'm staring at the part I have zero skills in: actually getting users.\n\nI've read all the \"just do content marketing and SEO\" advice but I'd love to hear from people who've actually been in the trenches:\n\n- What got you your first 10 users? First 100?\n- What did you try that completely flopped?\n- For developer tools specifically, where did you actually find your audience?\n- How do you know when to keep pushing vs when to call it quits?\n\nI can put money into marketing but I dont want to spend money on a product that isnt viable. I'm more comfortable writing code than writing tweets, but I know hiding behind the keyboard isn't a strategy.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1q1eqzv/solo_founder_product_is_done_terrified_of/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "nx52h6i",
          "author": "Tall-Log-1955",
          "text": "If you built it without talking to a bunch of potential customers first the whole thing is going to be very hard",
          "score": 79,
          "created_utc": "2026-01-01 21:02:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx53hwp",
              "author": "CarlSagans",
              "text": "I know there is a market for it because it has been a recurring pain point for multiple companies I've worked at. But I'm in a weird position where I don't want to market my SAAS to the company I currently work at.",
              "score": 14,
              "created_utc": "2026-01-01 21:07:55",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nx5iqnv",
                  "author": "CoolSnow01",
                  "text": "What other users are trying to say is that it is common practice to build your product based on the feedback of the first 5 beta users or so.\n\n\nOf course, you can skip that part and still have run a successful marketing campaign but it is always preferable to already have a handful of users already using the product before lunching to the general public.\n\n\nI'd start by having a clear definition of who's my target audience and where I can find them. Engage in conversations to find out how they see the pain point you are tackling, test your messaging, etc. Refine until having some first few users to get feedback, wouldn't focus on a big number yet.\n\n\nWhat do you think? Do you have a clear vision of how to achieve so?",
                  "score": 9,
                  "created_utc": "2026-01-01 22:26:54",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nxh8lbu",
                  "author": "Sad_Rub2074",
                  "text": "You shouldn't need to \"market\" it to your current company. Talk to the VP of Engineering or CTO/CIO. Have a normal conversation with them about it. Someone you know or is in your network is always the best first customer. Someone your network knows is second best.\n\nA lot of YC companies got off the ground even from the YC network. Though times have changed competitively and many have some customers before getting in.",
                  "score": 2,
                  "created_utc": "2026-01-03 18:11:22",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nx5ahbx",
                  "author": "mikefut",
                  "text": "You should have been validating your thesis by talking to customers all along. You’ve made the classic startup mistake by presuming you can represent your customer. Now you’re trying to jump into an expert level task by trying to get users to use your product. At this stage you should have a long list of customers begging you to try it. \n\nMy advice would be to go back to step one and try to get some feedback on your product from customers.",
                  "score": 4,
                  "created_utc": "2026-01-01 21:44:02",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nx66k0l",
              "author": "Assasin_ds",
              "text": "I hear this a lot and I understand it, but do you think one should market research even if they know that there is a market for it?",
              "score": 3,
              "created_utc": "2026-01-02 00:38:59",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nx6kvfp",
                  "author": "mattgwriter7",
                  "text": "It depends on what the product is and what the market is.\n\nFor my small apps, I make an MVP in 2 weeks and get it in front of users to see if it has potential. I don't need much research for that.",
                  "score": 0,
                  "created_utc": "2026-01-02 02:05:17",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nx6belr",
          "author": "QuantumSalon",
          "text": "This post mostly cured me of my reluctance to “sell” my services: https://open.substack.com/pub/howtogrow/p/there-is-no-such-thing-as-a-sales",
          "score": 14,
          "created_utc": "2026-01-02 01:07:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx8jp66",
              "author": "Straight-Gazelle-597",
              "text": "that's the spirit👍",
              "score": 1,
              "created_utc": "2026-01-02 11:21:51",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nx51uew",
          "author": "wetmedjooldates",
          "text": "Can you put the link up here? I want to try it",
          "score": 6,
          "created_utc": "2026-01-01 20:59:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx52ys5",
              "author": "CarlSagans",
              "text": "Its for getting fake data into databases by just posting the DDL. \n\nDdltodata.com",
              "score": 7,
              "created_utc": "2026-01-01 21:05:06",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nx5vz5k",
                  "author": "IVSimp",
                  "text": "Bro I know you used lovable for this landing page lol",
                  "score": 6,
                  "created_utc": "2026-01-01 23:40:08",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nxcbkop",
                  "author": "Neat_Confidence_4166",
                  "text": "I'm not gonna lie dude. I've done this with Claude and it worked perfectly fine. What sets this apart?  If anything Claude can tokenize more context aware knowledge when it does this...",
                  "score": 1,
                  "created_utc": "2026-01-02 23:19:57",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nx56y4i",
          "author": "LearntUpEveryday",
          "text": "To get your first few users you can also just DM people on LinkedIn. It's a grind but it will help you polish the product with their feedback. Other inbound marketing is better long term but it takes a while to get the ball rolling.\n\nI'm guessing this is used by certain software engineers as well as QA automation engineers? Search for em on LinkedIn and send them a connection request.",
          "score": 5,
          "created_utc": "2026-01-01 21:25:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx57k2w",
              "author": "CarlSagans",
              "text": "Good point, I'll try that. Personalized DMs feel less spammy too.\n\nAnd yeah, I intentionally made the free tier generous. My thinking is that solo devs try it for free, like it, and eventually bring it into their company. We'll see if that actually plays out.",
              "score": 3,
              "created_utc": "2026-01-01 21:29:01",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nx5bcr8",
                  "author": "LearntUpEveryday",
                  "text": "Yea maybe. Im not sure how much solo devs really give a shit about testing tho TBH 😂 \n\nEither way actually talking to folks gets you the most data to understand why people will or wont come use it. Anonymous users don't give you much data on their intentions and how they evaluate your product.",
                  "score": 1,
                  "created_utc": "2026-01-01 21:48:32",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nxwtaki",
              "author": "PlentyDiligent9193",
              "text": "You can also automate and personalize the message for the  people you want to reach out as potential users on LinkedIn. Great way to prospect. I’ve done it with Waalaxy ( it is free) .",
              "score": 1,
              "created_utc": "2026-01-05 23:37:00",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nx5tnx9",
          "author": "AnuragVybzHealth",
          "text": "I used a personal account, people would be more open to responding after they check your personal profile and can relate with you.\n\nAt least that was what worked in my case!",
          "score": 3,
          "created_utc": "2026-01-01 23:26:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx5u0ko",
              "author": "CarlSagans",
              "text": "That is what I was thinking, thanks for clarifying!",
              "score": 1,
              "created_utc": "2026-01-01 23:28:55",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nx5uk3b",
                  "author": "AnuragVybzHealth",
                  "text": "All the best with the outreach. It feels uncomfortable at first, but it genuinely gets easier once you get a few real conversations going.",
                  "score": 2,
                  "created_utc": "2026-01-01 23:32:01",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nx656hp",
          "author": "dimensionforge9856",
          "text": "I took a look at your website. \n\nSorry for sounding harsh but I’m ready to ask the tough questions.\n\nFrom my experience, using Cursor, I can simply prompt for data by saying, “look at my data schema, generate 1000 rows in json format of test data” \n\nWhy would I pay for your product in this scenario when Cursor already enables me to easily do this task?",
          "score": 3,
          "created_utc": "2026-01-02 00:31:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx66rl6",
              "author": "CarlSagans",
              "text": "Appreciate the tough question, this is exactly what I need to hear.  \nYou're right that Cursor can generate test data for a single table. Where it differs:\n\n* **Multiple tables with foreign keys** — You have to prompt carefully to get the insert order right and make sure parent records exist before children. Gets messy fast.\n* **Repeatability** — Every time you need fresh data, you're re-prompting and hoping it's consistent. My tool saves your schema so it's one click to regenerate.\n* **CI/CD pipelines** — You can't put \"ask Cursor\" in your build script. REST API call works anywhere.\n* **Pro tier** — Save your database connection locally and load directly. No copy-paste.\n\nFor a solo dev loading one table once? Yeah, Cursor is fine. For a team that needs consistent test data across multiple environments with relational integrity? That's where this saves time.\n\nIf Cursor works for your workflow, no reason to switch. I'm really building this for the scenarios where that approach starts to break down.",
              "score": 6,
              "created_utc": "2026-01-02 00:40:10",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nx6ypuk",
                  "author": "dimensionforge9856",
                  "text": "Thanks for your detailed clarification. Essentially I see that you have built some integrations that would take an internal team perhaps a few projects to accomplish themselves.\n\nIf you are selling to enterprise, one issue that may come up is data privacy.\n\nHow would you be able to keep their Data Schema's confidential, if this is a web based tool?\n\nCursor runs locally as an example, so the data should be remaining on the client's computer.",
                  "score": 1,
                  "created_utc": "2026-01-02 03:30:34",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nx8ll6u",
                  "author": "dsx460",
                  "text": "It looks like your tool is a simple type based test data generator based on rules/dictionary/type instead of an LLM wrapper, so it can't infer meaning based on column name unless it exists in your dictionary though..?\n\nOn your website you are marketing it as a \"realistic test data\" output based on schema column names, the main selling point? But that's not really the case? For example, since you are doing a dictionary based ruleset (with fallback to field type if it doesn't exist in your dictionary, then it generates unrealistic / nonsense test data, since it can't infer column name meanings with domain context like an LLM?\n\nFor example the DDL below shouldn't be generating these type of values for those column names Should be mutated / wildtype for brca\\_mut\\_status, but it gave me completed/rejected/cancelled.. or ecog\\_perf\\_status an INT within range of 0-5, but it gave me a  String which ignored even the type i requested which is a crucial bug (likely because of matching a column dictionary since it includes the word \"status\" in column name..?) The tumor grade is also not \"realistic test data\" as your website claimed either.\n\n    CREATE TABLE oncology_trials (\n      brca_mut_status VARCHAR(10),\n      tumor_grade INT,\n      ecog_perf_status INT,\n      pfs_months FLOAT,\n      os_event BOOLEAN\n    );\n\n  \nWhich generated the below:\n\n      {\n        \"brca_mut_status\": \"completed\",\n        \"tumor_grade\": 307894,\n        \"ecog_perf_status\": \"rejected\",\n        \"pfs_months\": 328.833842,\n        \"os_event\": false\n      },\n      {\n        \"brca_mut_status\": \"rejected\",\n        \"tumor_grade\": 211564,\n        \"ecog_perf_status\": \"active\",\n        \"pfs_months\": 700.87862,\n        \"os_event\": false\n      },\n      {\n        \"brca_mut_status\": \"cancelled\",\n        \"tumor_grade\": 295594,\n        \"ecog_perf_status\": \"cancelled\",\n        \"pfs_months\": 47.37311,\n        \"os_event\": true\n      },",
                  "score": 1,
                  "created_utc": "2026-01-02 11:38:25",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nx6ds71",
          "author": "goosetavo2013",
          "text": "The old YC “do things that don’t scale” can be very helpful. Don’t think about it like “marketing”, you just need to find your first few users that will actually use it. My suggestions:\n\n1) search for folks dealing with the problem or similar problems, search Reddit, forums, Facebook groups, X, etc. Tell them about this solution, DM them, follow up.\n\n2) id pick a couple channels like YouTube and Linkedik and post some content about your solution and the problem you solve. Describe the pain and how current solutions are inadequate. Do it from different angles and examples from real life. Post every day to both (text on LinkedIn, video on YouTube). This strategy takes a while but interested folks will start to reach out if your problem is a compelling one.\n\n3) where do developers like you congregate? Reddit? X? Somewhere else? Post there about your solution and ask for validation (like what you did here, great post), feedback, etc. DM and follow up to see how it went. If folks don’t bother to ask or even use it, that’s some great feedback right there.\n\nI would do these way before doing like paid ads or actual website SEO.",
          "score": 3,
          "created_utc": "2026-01-02 01:21:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx6g00t",
              "author": "CarlSagans",
              "text": "Thanks for the advice! Many others in this thread have suggested something very similar I think you guys are on to something.",
              "score": 3,
              "created_utc": "2026-01-02 01:35:26",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nx5sfnz",
          "author": "AnuragVybzHealth",
          "text": "Senior-ish builder, zero marketing instincts, shipped the product first, then stared into the void.\n\nSharing what worked **for me** building in mental healthcare. Started with literally **0 customer conversations**, course-corrected hard, now at \\~**$500 MRR** and growing slowly. \n\n**What actually got my first users**\n\n**1.  Obsess over the first 5 users, not 100 -** I reached out to **hundreds of people on LinkedIn**. Most ignored me, some were polite, and a handful genuinely cared about the problem. That handful is all that matters. Cold emails and LinkedIn DMs are your best tools early on. If your message clearly speaks to a real pain, the right people *will* reply. Use tools like Clay or HeyReach to find targeted prospects, but start with your existing network first. Those early conversations are faster, warmer, and often your first real believers. \n\n2. **Turn your early users into paid customers** \\- **Do this as soon as possible**. Free users are usually polite, vague, and disappear. The moment someone pays, their behavior changes. They care about getting real value, they give clearer feedback, and they stick around long enough for you to learn. You don’t need perfect pricing. Even a small charge tells you whether the problem is real or just “interesting.” **Make sure your free tier is not too generous!**\n\n3. **Turn happy users into distribution** \\- Ask for referrals, testimonials, and warm intros. If people genuinely like your product, they’re usually happy to help. This compounds faster than any growth hack.\n\n**One hard rule**  \nDo not spend money on marketing before you have meaningful usage. Until you’ve observed things like retention, frequency of use, and why people come back, paid marketing will mostly just help you lose money faster.",
          "score": 5,
          "created_utc": "2026-01-01 23:20:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx5t932",
              "author": "CarlSagans",
              "text": "Thanks for the feedback. Quick question on the LinkedIn outreach, did you use a personal account or create a business one? A lot of people in this thread have recommended LinkedIn but I wasn't sure which approach works better. I'm guessing personal feels more genuine and you already have connections there.",
              "score": 2,
              "created_utc": "2026-01-01 23:24:35",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nx6c677",
                  "author": "QuantumSalon",
                  "text": "Personal for sure. Company pages on LinkedIn get very little activity.",
                  "score": 3,
                  "created_utc": "2026-01-02 01:11:58",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nx5f8td",
          "author": "Longjumping_Ant_6991",
          "text": "Why are you terrified?",
          "score": 2,
          "created_utc": "2026-01-01 22:08:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx5gaem",
              "author": "CarlSagans",
              "text": "Honestly, Fear of putting something out there and hearing crickets. \nOr worse, people telling me the idea is stupid.\n\nBuilding the product was the safe part. I know how to code. I don't know how to sell, and rejection hits different when it's something you built yourself lol",
              "score": 5,
              "created_utc": "2026-01-01 22:13:54",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nx5ie8r",
                  "author": "Longjumping_Ant_6991",
                  "text": "I can 100% relate to that. It was incredibly scary to post on LinkedIn for the first time! And to be honest, we revised our website 5 times before anyone really started to understand what we do lol. Now I’m quite happy with the it, but I also know it could be 100x better ([krona](https://mykrona.com))\n\nWhat helped me was to start with close friends, my co-founder and I picked 5 ppl each that we had to interview and onboard. \n\nAfter that, we started selling the idea of the product to build a waitlist while iterating on feedback via Reddit. This is a great way to get exposure while staying somewhat ”anonymous”. \n\nWe opened the app up to 50 more on the waitlist. Iterated for a couple of months. Continued with Reddit and started SEO. This helped a lot with messaging and building confidence around how to sell the product. Still working on this everyday, but you gotta start somewhere.\n\nEventually we started getting more interest in the product. Reddit users where asking us for access. And at that point, we decided it was time to stand behind what we built and put it out there. If we get rejection, it is what it is you know?  \n\nWhat’s your product? If you have a website please link it. I can take a look and give you some feedback (I’m technical).\n\nEDIT:\nYou will get rejection and poor reviews early. That is part of it. Not everyone is gonna understand your product nor your vision. But ask yourself this: if you don’t stand behind your product publicly, why would anyone else?",
                  "score": 3,
                  "created_utc": "2026-01-01 22:25:04",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nxhoudh",
          "author": "Cozy_NightSky",
          "text": "The thing that actually worked wasn’t content or SEO it was forcing conversations early.\nMy first users came from:\nreplying to posts where people were already complaining about the problem\ncold but contextual outreach (referencing a repo, issue, or comment not generic blasts)\nshipping something ugly that solved one painful moment, not a full product\nWhat flopped:\n“launch posts” with no existing demand\nwaiting to feel confident before talking to users\nbuilding features before I knew why someone would feel irresponsible not using it\nFor dev tools specifically: users didn’t come from broad marketing they came from places where the pain was already visible (issues, threads, PR comments, Slack communities).\nThe decision to keep going vs stop wasn’t traffic-based. It was simple: Are people asking follow-up questions without being prompted?\nIf you’re hiding behind the keyboard, that’s normal but conversations beat code every time at this stage.",
          "score": 2,
          "created_utc": "2026-01-03 19:25:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxhpxwe",
              "author": "CarlSagans",
              "text": "I've been treating every skeptical comment as free consulting. One person pushed back hard on the value prop, and that conversation taught me more about positioning than weeks of building.\n\nThat makes sense. Gonna start looking for threads where people are already frustrated instead of trying to create demand from scratch. Appreciate the framing.",
              "score": 1,
              "created_utc": "2026-01-03 19:30:23",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nxhsa9d",
                  "author": "Cozy_NightSky",
                  "text": "Yes the key is forcing conversations around a specific painful moment, not broad outreach.",
                  "score": 2,
                  "created_utc": "2026-01-03 19:41:28",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nxhs72f",
              "author": "Wide_Brief3025",
              "text": "Targeting real conversations where your problem is already obvious is so much more effective than broad posts when starting out. I found replying to people with specific pain or feature requests led to more DMs and feedback. If keeping up with all those posts gets overwhelming, something like ParseStream can help track mentions and filter for actual leads, letting you focus your time where it matters.",
              "score": 1,
              "created_utc": "2026-01-03 19:41:04",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nx53af2",
          "author": "iloveresumes2much",
          "text": "Did you validate the idea at all with people before? If so why not go to them as first customers. If not.... then that's a whole different topic we should discuss before we even discuss marketing.",
          "score": 2,
          "created_utc": "2026-01-01 21:06:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx6opnn",
          "author": "Stubbby",
          "text": "Im sorry but your GPT wrapper doesnt strike me impressive. It seems like it can be vibe coded in one day and I would struggle to justify creating a CICD dependency on a 3rd party service that frankly isn't necessary. On top of that, you require a subscription while your users can just vibe it locally and have it for free. \n\nClaude CLI, Codex CLI, Kiro CLI, Gemini CLI can do this, if you want the same data every time then you tell it to save the data to a file, if you want to incorporate it into CI/CD, you tell it. You want any level of automation, just say. \n\nIf I were trying to sell it, I would be terrified as anybody competent would ask: \"But... why?\"",
          "score": 2,
          "created_utc": "2026-01-02 02:28:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx6qchc",
              "author": "CarlSagans",
              "text": "No LLM. No prompts. No token costs. No hallucinations. Just fast, deterministic test data from your schema. I'll paste this here for why this is better than prompting AI. If you are a solo dev this product may not make sense for you to use which is why there is a generous free tier. \n\n* **Multiple tables with foreign keys** — You have to prompt carefully to get the insert order right and make sure parent records exist before children. Gets messy fast.\n* **Repeatability** — Every time you need fresh data, you're re-prompting and hoping it's consistent. My tool saves your schema so it's one click to regenerate.\n* **CI/CD pipelines** — You can't put \"ask Cursor\" in your build script. REST API call works anywhere.\n* **Pro tier** — Save your database connection locally and load directly. No copy-paste.",
              "score": 1,
              "created_utc": "2026-01-02 02:38:31",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nx6sapx",
                  "author": "Stubbby",
                  "text": "I went to an LLM and said:\n\n\"can you generate a response JSON test data from this schema: <put the scheme from your website example>\"\n\nand it did exactly the same as in your example so I dont understand why I should use your wrapper when I already have access to an LLM. \n\nFor **repeatability** I can ask it to save it to file and append when needed.\n\n**CI/CD pipeline -** I absolutely don't want my CICD to depend on a random micro project and yes, I can ask Cursor to create a test script that acts exactly like your project.\n\nI am yet to see any upside. So far, its only a downside that I need to maintain a dependency in my CICD that I don't really trust.",
                  "score": 1,
                  "created_utc": "2026-01-02 02:50:04",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nx53ji7",
          "author": "Business-Bathroom603",
          "text": "SEO and content marketing aren’t a reliable return anymore. You have to write for AI. Face to face at conferences or meetings are an “old school” method that work best. I am successful on LinkedIn and social media marketing works pretty well but takes time. Buying social media ads isn’t a great investment until you can spend a lot. Social media runs on spitting up and chewing out small businesses.",
          "score": 1,
          "created_utc": "2026-01-01 21:08:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx5405x",
              "author": "CarlSagans",
              "text": "How did you get your linkedin popular? Is it a business linkedin account or your personal and did you achieve that by promoting it at conferences?",
              "score": 1,
              "created_utc": "2026-01-01 21:10:36",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nx560ru",
                  "author": "Business-Bathroom603",
                  "text": "My own LinkedIn only has ~30k followers, so it’s not huge. I don’t promote that at conferences, but I used to go to quite a few. For a while I could sell a lot from behind a keyboard but noticed the last two years the in person stuff is landing whereas as email and zooms don’t do what they used to do. I also used to run the socials and paid ads for a few companies. 2 years ago Google nuked search marketing and the ROI sank like a stone.",
                  "score": 5,
                  "created_utc": "2026-01-01 21:21:07",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nx546mh",
          "author": "andupotorac",
          "text": "You’ll now learn that actual work begins here. 👍",
          "score": 1,
          "created_utc": "2026-01-01 21:11:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx57fle",
          "author": "omniumoptimus",
          "text": "Weird no one actually answered your questions.\n\nYou need to talk to users. You know where they meet up—go meet them. Introduce yourself and tell them about what you built and ask them if they think it’ll solve their problems. \n\nListen more than talk.\n\nThis is what it means to “do things that don’t scale.” Start by finding one person who really likes it and make it even better for them. That will grow to two. Soon enough, ten. When that happens ten times, you’re at 100.",
          "score": 1,
          "created_utc": "2026-01-01 21:28:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx582m4",
              "author": "CarlSagans",
              "text": "I appreciate the advice, I will do some research, maybe there are meetups in my area that can help improve my product.",
              "score": 1,
              "created_utc": "2026-01-01 21:31:44",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nx5gy2v",
          "author": "AdministrativeArt621",
          "text": "Get out of your comfort zone and talk to customers: sell asap. The longer you wait, the more painful it’s going to be.   \n  \nThe way to reach your market will depend on the nature of your product (e.g. B2B or B2C).  \n  \nIn general at this early stage, look for customers who actually pay (important) and are willing to give feedback. A practical book I recommend is *Million Dollar Weekend* by Noah Kagan. A great article that can be helpful for you \"How to find and win your first 10 B2B customers\" from Lenny Rachitsky.\n\nGood luck, and have fun!",
          "score": 1,
          "created_utc": "2026-01-01 22:17:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx5hnu2",
              "author": "CarlSagans",
              "text": "Thanks for the  recommendations, I am reading the Lenny Rachitsky article now and added the Noah Kagan book to my list.\n\nYou're right about paying customers being the real validation. Someone pulling out their wallet is actual proof.\n\nTime to get uncomfortable I guess.",
              "score": 1,
              "created_utc": "2026-01-01 22:21:11",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nx5i348",
          "author": "loadabaalix",
          "text": "Persona + LinkedIn",
          "score": 1,
          "created_utc": "2026-01-01 22:23:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx5kxv6",
          "author": "VVVVV218-",
          "text": "talk to me",
          "score": 1,
          "created_utc": "2026-01-01 22:38:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx5mq3o",
              "author": "CarlSagans",
              "text": "Are you someone who would be interested in a product like this? I'll DM you lol",
              "score": 1,
              "created_utc": "2026-01-01 22:48:19",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nx5onvk",
          "author": "BusinessStrategist",
          "text": "So 1. Profile the « actual » users and 2. Profile the « actual » buyers (if separate from the users).",
          "score": 1,
          "created_utc": "2026-01-01 22:59:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx5zo63",
          "author": "lutian",
          "text": "reddit/x",
          "score": 1,
          "created_utc": "2026-01-02 00:00:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx6d04y",
          "author": "PartyParrotGames",
          "text": "\\> I'm more comfortable writing code than writing tweets\n\nWrite code to write your tweets for you.  Problem solved :P",
          "score": 1,
          "created_utc": "2026-01-02 01:17:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx6dowv",
              "author": "CarlSagans",
              "text": "lol I thought about that but I feel like it would be obvious it was written by AI and wouldn't be genuine.",
              "score": 2,
              "created_utc": "2026-01-02 01:21:16",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nx7r90c",
                  "author": "AlwaysCurious1993",
                  "text": "You can prepare a lot of social media posts in advance and then schedule them with free tools, there are some good ones and easy to use. Then engage in conversations and try to comment.\n\nCold outreach works. \n\nAI search optimization has still a lot to do with SEO, it’s not like two opposites. Creating useful content can still help.",
                  "score": 1,
                  "created_utc": "2026-01-02 06:56:26",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nx6f3kz",
          "author": "BluebirdPast8951",
          "text": "I have a guide for a simplified marketing plan it can help you message me if you are interested i would be happy to help",
          "score": 1,
          "created_utc": "2026-01-02 01:29:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx6h9uu",
          "author": "Silentreactor",
          "text": "Where is it? Maybe we can work together.",
          "score": 1,
          "created_utc": "2026-01-02 01:43:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx6lqpc",
              "author": "CarlSagans",
              "text": "The site is [https://ddltodata.com/](https://ddltodata.com/) unless you meant the physical location?",
              "score": 1,
              "created_utc": "2026-01-02 02:10:33",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nxajd4t",
                  "author": "Silentreactor",
                  "text": "Where are you based?",
                  "score": 1,
                  "created_utc": "2026-01-02 18:06:24",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nxjysro",
                  "author": "twisruptor",
                  "text": "Out of topic, your website scrolls horizontally in mobile viewport, fix the width of the DOM.\n\nNice business idea, good luck.",
                  "score": 1,
                  "created_utc": "2026-01-04 02:26:24",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nx6p6t7",
          "author": "AgencySaas",
          "text": "Shameless plug, I'm launching an elearning platform (OpMistro) for founders without a sales or marketing background. It helps people understand and implement from 22 different growth tactics.\n\nThe goal is empower self-sufficiency, find the growth tactic they enjoy doing, and generates desired results. Plenty of tactics require sweat equity vs paid distribution, which I recommend unless you have disposable money available. If you're interested, would love your feedback when it's live.",
          "score": 1,
          "created_utc": "2026-01-02 02:31:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx6y0ig",
          "author": "SystemicCharles",
          "text": "It means you’re not done yet. \n\nYou were supposed to have started marketing, doing outreach, educating your audience on the problems you solve, etc., BEFORE you launch.\n\nWhen people talk about “shipping fast”,  “launching fast”, and other lame cliché advice, they don’t talk about the marketing launch aspect (so that you don’t launch to crickets). \n\nThis is how big, funded teams that seem to “come out of nowhere” do it. They start SEO, content marketing, media runs, ads (to collect leads), and other marketing-related stuff WAY BEFORE the product is ready.\n\nIt’s not your fault, though. This is extremely hard for a solo-founder to do. Just put it in your mind right now that your product launch is not done yet until you get your first 10-100 users. The fastest way for you to get there right now is with paid ads, but you are going to have to accept that you might lose money to acquire your first customers.",
          "score": 1,
          "created_utc": "2026-01-02 03:26:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx7tglb",
          "author": "EfficiencyLoose3595",
          "text": "This is a tough one",
          "score": 1,
          "created_utc": "2026-01-02 07:16:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx8fwwj",
          "author": "OriginalPaz",
          "text": "Sharing some thoughts in this in case it's useful. I checked out your site - we are seeding data currently for testing, demo mode, etc right now. Tbh, your value prop did not resonate. We can mock the shell data and relationships easily - just prompt an AI coding assistant with good schemas, or spin up a Claude skill and your golden. \n\nGetting that data to be realistic, mimic not just use of a feature but a valuable real action/workflow our customers (or prospects) take, showcase uvp effectively, tell a story with the data, etc. This was a real pain/opportunity (for me at least). \n\nAnd as others say, marketing is 90% narrowing down and profiling your early adopters, and really getting to know them (absolutely critical to product development too). If you've nailed this, running campaigns is easy, and why in general it's best to do this alongside building first iteration.\n\nTo answer your specific question, the most valuable thing I've done was setting a goal to speak to say 15 people who I thought were our early adopters every 1-2 weeks. I'd try the channel/source I thought best at the time and blast it. See how that went and what I learned from the calls, iterate acquisition approach and product (this is never 'built' btw), repeat.",
          "score": 1,
          "created_utc": "2026-01-02 10:47:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx8tclt",
              "author": "CarlSagans",
              "text": "Thanks for this feedback, genuinely useful. The point about demo data telling a story rather than just filling fields really resonated. That's a direction I'm now exploring.",
              "score": 1,
              "created_utc": "2026-01-02 12:40:53",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nx8jmhq",
          "author": "Crafty-Sea-134",
          "text": "1. Find the most frequent places of your potential paid users, take the initiative to bring them unshakable value, find enough people, chat enough words, and record enough feedback.\n\n2. Analyze which of the smallest units of these feedbacks is the most popular.\n\n3. Don‘t change the existing products during this period. Also do not do marketing ads first.",
          "score": 1,
          "created_utc": "2026-01-02 11:21:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx8u8qj",
          "author": "WildSwing2649",
          "text": "I scrapped shit out of yc startups page now got around 950 companies in my list, going to cold dms soon.",
          "score": 1,
          "created_utc": "2026-01-02 12:47:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx96z5b",
          "author": "velvet-edge",
          "text": "don't spend money. Talk to people. Get their feedback on what you built. Treat it like a side project that you're excited about. Think about how you'd feel if another Data Engineer reached out to you about a sidfe project vs a founder trying to sell.\n\nimho you haven't built the product yet, you have a really solid prototype tho!",
          "score": 1,
          "created_utc": "2026-01-02 14:08:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxatxa6",
              "author": "CarlSagans",
              "text": "Curious what would move it from prototype to product in your eyes? More features, more polish, or just more evidence that people are actually using it?",
              "score": 1,
              "created_utc": "2026-01-02 18:54:38",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nxrl6g6",
                  "author": "velvet-edge",
                  "text": "you may already have a product but you won't know  until you talk to people",
                  "score": 1,
                  "created_utc": "2026-01-05 05:01:34",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nx9fy5g",
          "author": "Livid-Savings-5152",
          "text": "1) define your ICP. For example “senior software engineers at companies with over 1000 employees”\n\n2) Sign up for Apollo.io and export a list of emails that meet this ICP\n\n3) Import into Instanrly, enable the email verification feature, and blast them a simple cold email with this format\n\nSubject: help with (painpoint)\n\nBody: Hey (first name), do you ever feel frustrated with (painpoint)?\n\nI made a tool to make this easier.\n\nIt works by (one sentence description)\n\nTry it out here (link)\n\n\nThat’s it. Make sure to use spin tax or add some personalization so not every email is identical. \n\nGood luck",
          "score": 1,
          "created_utc": "2026-01-02 14:58:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx9pxft",
              "author": "CarlSagans",
              "text": "Thank you for the feedback! I will checkout apollo now",
              "score": 1,
              "created_utc": "2026-01-02 15:48:42",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nxanwm9",
          "author": "caldazar24",
          "text": "Your first ten users, you should do direct outreach via friends, former coworkers, or introductions from friends/coworkers.  You very hopefully know ten of your target users already!  Treat this as user research as much as user acquisition, you bring them in early, keep them in the loop with product updates, ignore bland encouraging words and iterate until they actually use the product without you bugging them to.   \n\nYou can slowly expand this circle and bring more people in, and add on reaching out to people at forums, networking events at conferences, cold emails...you can start by offering the product for free or even offering small compensation for feedback until you have something people are interacting with, then you transition to pitching people to pay for your product. E\n\nEven if you're at a price point that will definitely not support direct sales at scale, doing essentially direct sales in the very early days, until you have 100 regularly recurring users or so, is how you get user feedback on your product and your pitch.\n\nOnly \\*after\\* you have a product that at least a few people are sticking with and paying for should you even consider doing paid marketing. It takes often five-six figures of spend just to figure out the right marketing message, ad creative, bid strategy, landing page conversion funnel, and that's \\*after\\* you have a product that at least some people will stick with after all that. If you're trying to figure out the marketing at the same time as the basic product, you'll be lighting money on fire...",
          "score": 1,
          "created_utc": "2026-01-02 18:27:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxar5xj",
              "author": "CarlSagans",
              "text": "This is basically what's happened in this thread. Came here asking for help, ended up getting more value than any ad would've given me.\nIn the last 24 hours from this post alone:\n- A skeptic pushed back hard, helped me finally articulate my value prop clearly\n- Someone pointed out the real pain isn't test data, it's demo data that tells a story, now building that\n- Got a legit bug report, fixed it\n- Added a live demo after feedback here, got signups immediately\nThe skeptics have been free consultants. Definitely staying in this mode before even thinking about paid ads.",
              "score": 3,
              "created_utc": "2026-01-02 18:41:57",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nxayb7g",
          "author": "Creative_Walrus_5197",
          "text": "You should have started by figuring out who your customers are and talking to them",
          "score": 1,
          "created_utc": "2026-01-02 19:15:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxazfzt",
          "author": "evanskarangu",
          "text": "Always consider the customer before hand. Even before you start building the product, understand what the customer wants. There should be a problem that you are trying to solve. \n\nFeedback from potential customers is very important. It helps you adjust the product to address their needs and by the time you are completing the product, you will have a waitlist that is ready to use your product.\n\nThese early users then become your evangelicals by preaching your product to others and the chain continues..",
          "score": 1,
          "created_utc": "2026-01-02 19:20:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxbgb7o",
          "author": "Plenty_Object_4826",
          "text": "Don't market - sell. And you're not selling, you're fixing someone's problem. Show how it fixed your problem.",
          "score": 1,
          "created_utc": "2026-01-02 20:42:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxbhb1y",
              "author": "CarlSagans",
              "text": "You're right,  I've been explaining what it does, not why I built it.\n\nI built this for myself first. Got tired of writing fake emails, phone numbers, and timestamps every time I spun up a new project. Same tedious work, over and over. So I automated it.\n\nI should be leading with that story, not the feature list. Thanks for the reframe.",
              "score": 1,
              "created_utc": "2026-01-02 20:47:32",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nxbpwyd",
                  "author": "Plenty_Object_4826",
                  "text": "np! glad it was helpful. there's a lot of great youtube and book content on this - and trust me you're going to learn the patterns of early adopters and people who are later adopters. drop the late adopter types asap they will waste your time. and whatever starts defining a late adopter - ie \"ppl born after 2005\" just drop them, don't even try. just find your early adopter ICP and chase them, solve their problem and make them feel supported. then the early adopter ICP will split into two group, the group who uses the product silently b/c it solves their problem and the group that is insanely excited and giving you updates and ideas frequently, both groups are valuable.",
                  "score": 1,
                  "created_utc": "2026-01-02 21:29:12",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nxcbx0s",
          "author": "isaaclhy13",
          "text": "Who's your exact target subreddit or user persona? I'm a founder too and got stuck not wanting to do marketing, lowkey terrified of outreach. Try cold messaging helpful leads and sharing short case posts to build trust, both get responses and social proof fast. I built SignalScouter, it finds Reddit posts where potential users ask for solutions and generates founder‑style replies so marketing feels less scary, it drove 89 signups in 2 days and 10k+ views on posts; would love feedback or to connect if you try it, good luck.",
          "score": 1,
          "created_utc": "2026-01-02 23:21:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxcdij7",
              "author": "CarlSagans",
              "text": "I'll give it a spin",
              "score": 1,
              "created_utc": "2026-01-02 23:30:35",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nxciu1k",
                  "author": "CarlSagans",
                  "text": "So I tested out your app and its funny because now I see you are using it to promote. If you ever see this comment this is my feedback.\n\n\\-allow the keywords to be added by a list separated commas   \n\\-save changes is not obvious it is auto saving  \n\\-clear all keywords button  \n\\-post content only contains some of the post, it would nice to have the option to see all of it without going to the site  \n\\-I'm assuming you purposely don't post the link to your site because it looks like spam?",
                  "score": 1,
                  "created_utc": "2026-01-03 00:00:11",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nxf0qyb",
          "author": "fucknickle",
          "text": "offer a $15 gift card to devs on linkedin for their honest feedback of the tool. if you have $0, make short form videos, write linkedin posts, make X posts, just make a shitton of content. challenge yourself for 60 days to post 5 times a day, and you’ll get some traction - source: saas founder and social media marketing agency founder",
          "score": 1,
          "created_utc": "2026-01-03 10:27:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxf1btj",
          "author": "fucknickle",
          "text": "agree that i could just chatgpt and generate data. \n\nalso your hero page needs to call out the problem, like what problem is this solving for devs? “realistic test data out? “ \n\ntry something like “tired of doing xyz for no (dream outcome)? “ this “solves (xyz problem) in (time delay) compared to traditional tools",
          "score": 1,
          "created_utc": "2026-01-03 10:32:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxgps2n",
              "author": "CarlSagans",
              "text": "Thank you, I am changing it right now. It is terrible",
              "score": 1,
              "created_utc": "2026-01-03 16:44:56",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nxmt8mo",
          "author": "Strong-Badger-2681",
          "text": "I have no experience as such. But I do have a good deal of people who work in that domain and can provide assistance for money ofc.\n\n\nBut the thing is, it depends on the kind of product you have. Say you are launching a business solution then it's not wise to  make Instagram posts..rather grow your LinkedIn page, do lot of cold mailing, upwork etc...\nBut say it's more of a consumer product...  Targetted towards youngsters..focus on Insta...\nIf middle agers...focus on Facebook... \nPeople will give generic advice..  really depends on your niche",
          "score": 1,
          "created_utc": "2026-01-04 14:57:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxnt6ud",
              "author": "CarlSagans",
              "text": "Good point on matching channels to audience. For dev tools specifically, I've found Reddit and niche communities pretty effective so far. I haven't tried LinkedIn cold outreach yet but I plan too soon, my concern is that devs may be skeptical of anything that feels like sales. The stuff that's actually working is replying to threads where people are already complaining about the problem, not broadcasting. I am thinking that Instagram/Facebook are basically useless for this audience, but I still have a lot of research to do.",
              "score": 1,
              "created_utc": "2026-01-04 17:48:15",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nxo0k19",
                  "author": "Wide_Brief3025",
                  "text": "Replying to threads and joining genuine conversations works way better than cold outreach for dev tools, especially since devs can spot sales tactics a mile away. What really helped me was getting alerts for relevant Reddit threads so I could jump in early. ParseStream does that and filters out low quality posts so you only focus on solid leads. Made it less overwhelming for a solo founder.",
                  "score": 1,
                  "created_utc": "2026-01-04 18:20:52",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nxoe0sg",
          "author": "othertrey",
          "text": "Build a project with GPT 5.2, teach it privately about your project, then create a Chief Marketing Officer thread. Ask it to take you through every aspect of a go to market plan for your business. Tell it to ask a question of itself at the end of every thread, and then answer that question simply, giving me options to choose from where necessary. It should provide a concise 1-paragraph summary for its answer and then extended details to review if interested.\n\nThen, when you have the plan complete, take your plan to a vibe coding app and give it the entire thread as a word document. (They parse word better than pdf.) \n\nTell it to build a website (or an app) in a vibe project with an API call to your ChatGPT instance as the website chat bot to answer questions from visitors. You will be amazed how easy and powerful all of this is. You can even embed your app / product into your site for users to remain on one place. Unbelievable. You can even use the AI offered by the vibe tools within the app you build.\n\nIf you’re not vibe coding you’re missing a huge opportunity. In January 2025 I hadn’t coded before. I still haven’t, but as of January 2026 I’ve published 1.6 million lines of code and built a fully functional mvp currently in beta testing with users. We launch in February. It’s not scalable (yet) but as an mvp, it can get you to revenue and early PMF. And that gets you to VC investment. And then you build for scale.\n\nAt least that’s the plan…",
          "score": 1,
          "created_utc": "2026-01-04 19:19:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxtzxnj",
          "author": "Boring_Cod_3898",
          "text": "its the hardest part for the tech founders",
          "score": 1,
          "created_utc": "2026-01-05 15:42:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx5286l",
          "author": "nlinx",
          "text": "Go to meet ups and events where you'd meet people who would want what you made. Also reach out to whoever you've spoken to before that helped you develop the idea.",
          "score": 1,
          "created_utc": "2026-01-01 21:01:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx6nmv6",
          "author": "major_wins_only",
          "text": "😂😂😂 this post made me lol... i know that feeling. We all know the overwhelming feeling. YOU GOT THIS!!\n\nCongratulations on product completion.\n\nWhat have you already planned in terms of marketing?\n\nIf you have no idea...\nJust start small. One focus area. Or you will get overwhelmed. \n\nCan you afford to pay a marketing consultant to set you up a game plan? This will help with direction... ease off that overwhelmed feeling.",
          "score": 0,
          "created_utc": "2026-01-02 02:22:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx8j9iw",
          "author": "amacg",
          "text": "Built 8+ apps and no-one came. Realized distribution is key. Built my own launch platform called Launch where makers can share what they’re building and get fair visibility. Here's the link: [https://trylaunch.ai](https://trylaunch.ai/)",
          "score": -1,
          "created_utc": "2026-01-02 11:17:59",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pzag2h",
      "title": "Andrej Karpathy's tweet... applied to founders",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1pzag2h/andrej_karpathys_tweet_applied_to_founders/",
      "author": "ImaginationInFocus",
      "created_utc": "2025-12-30 06:10:49",
      "score": 90,
      "num_comments": 32,
      "upvote_ratio": 0.93,
      "text": "Andrej Karpathy's [recent tweet](https://x.com/karpathy/status/2004607146781278521?s=20) got a lot of attention because he said that even he feels behind in terms of adopting AI. He suggest there is a 10x productivity gain he could obtain, by combining new AI capabilities in his coding process but points out the challenge in wiring the pieces together effectively.\n\n  \nDoes this concept resonate for other founders in this group?\n\n* What AI are you using to be more efficient?\n* What do you see as the barriers to perfecting your setup? ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1pzag2h/andrej_karpathys_tweet_applied_to_founders/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "nwovfvl",
          "author": "Different-Bridge5507",
          "text": "I feel a paralysis at times trying to figure out what the best way to tackle a problem is, and which AI tools should I be using. \n\nAdmittedly on occasion I will spend more time attempting to use AI to accomplish a problem than doing it manually, but that knowledge compounds and makes every future related task exponentially faster",
          "score": 33,
          "created_utc": "2025-12-30 06:48:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwr6mec",
              "author": "ImaginationInFocus",
              "text": "Relatable. I need to have a certain amount of activation energy to decide to apply AI to do some job for me. Then, I go in the automation process knowing that there's a chance I won't be happy with the final solution and will continue to need to do it manually. But I do enjoy the tinkering... and when it works, it's great just like writing code that works.",
              "score": 1,
              "created_utc": "2025-12-30 16:36:30",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwp2vjo",
          "author": "Bayka",
          "text": "Honestly, AI was a big unlock for me: I am a founder, used to be a developer a long time ago, but then transitioned to CEO/product mgmt role. I used to code a little, but nothing crazy.\n\nSo, LLMs really got me back into coding: the turnaround time from idea to a built prototype is astronomical, I build prototypes to close deals since showing how smth works is so much better than talking or waiting for your product designer to prepare a nice looking figma prototype.\n\nBUT in the last 2 months I started systematically automating every piece of my daily routine: content management, product analytics, customer interviews (well, some part of it tbh), looking for new UX ideas. And sales of course, every part of admin/research work\n\nSo really pumped and confident about my productivity and our chances of success (somehow unexpectedly)",
          "score": 24,
          "created_utc": "2025-12-30 07:55:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwpo6h5",
              "author": "Westernleaning",
              "text": "How did you automate things like content management, product analytics and sales? What are you using? And how did you go about learning/rolling out automations for all that?",
              "score": 5,
              "created_utc": "2025-12-30 11:11:59",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nwpqllw",
                  "author": "Bayka",
                  "text": "1) analytics - connected postgres and bigquery to claude code; asking it to fetch and interpret data, evaluate experiments; it then spits out a pdf report I share with the team before the call\n\n2) content management - this is multilayered, 4 layers:\n- inspiration: connected to reddit/x/LI, searching posts with specific keywords + built a simple “inbox” bot in Telegram for random ideas, links, etc.\n- writing: i am writing drafts (based on inbox items) and then discussing it with CC with an access to my zettelkasten\n- zettelkasten: recurring job of atomizing my content into idea notes with cross references.\n- engagement tracking and analytics: measuring key engagement metrics and suggesting what to write about\n\nI hope it helps",
                  "score": 17,
                  "created_utc": "2025-12-30 11:33:09",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nwru3e6",
              "author": "Silentreactor",
              "text": "Thanks for sharing. Where do you specialize in and how much experience do you have? Also, how much do you spend monthly on tools?\nThanks",
              "score": 1,
              "created_utc": "2025-12-30 18:25:23",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nwshqxr",
                  "author": "Bayka",
                  "text": "Why? I mean - please explain why is relevant? Trying to set up a frame",
                  "score": 1,
                  "created_utc": "2025-12-30 20:17:01",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nwsztlb",
              "author": "Glittering-Fig-9252",
              "text": "What part of your customer interviews have you automated",
              "score": 1,
              "created_utc": "2025-12-30 21:43:03",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nwttmv5",
                  "author": "Bayka",
                  "text": "built an interviewer bot (similar to what Anthropic did with their Interviewer) and surveyed 120 people for instance, processed results with LLM; now inviting some of them for a deeper human-2-human interview",
                  "score": 1,
                  "created_utc": "2025-12-31 00:18:05",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwp6og2",
          "author": "TinyDebate7541",
          "text": "Honestly I find AI stuff overwhelming. A few things come naturally (asking chatgpt) but now that everyone writes stuff like \"oh I build 100 AI agents and then they do replace my CMS for like 260 bucks\" wtf\n\nI mean seriously - which 100 ai agents and how the hell do I control this stuff. I can hardly control Ricardo who sits literally next to me in the office.\n\nSimilarly with coding. It´s all fancy words and I think some are just invented by a 5 year old (what is Kiro). But yes it's the future. Thiel said it. Masayoshi is betting on it. So I will shut up, fire Ricardo and continue building agents.",
          "score": 10,
          "created_utc": "2025-12-30 08:30:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwr1f8l",
          "author": "_dremnik",
          "text": "i think he's just drinking too much of the twitter koolaid personally. 10x is a big exaggeration unless you have a very parallellizable workflow (which perhaps he does, i mean you can do many training runs in parallel so maybe his work is an exception). \n\ni actually wrote a blog about this that was motivated by the tweet as an antidote to all the twitter hype which has gotten wildly out of hand imo:\n\n[https://dremnik.substack.com/p/you-cant-scale-clarity](https://dremnik.substack.com/p/you-cant-scale-clarity)",
          "score": 6,
          "created_utc": "2025-12-30 16:12:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwswmyp",
              "author": "Responsible-File-582",
              "text": "interesting read ill have to take a look later to gather my thoughts very positive",
              "score": 2,
              "created_utc": "2025-12-30 21:27:58",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nxktbnl",
              "author": "SquareKaleidoscope49",
              "text": "Some things are a million times faster. But most things are still not possible. Opus 4.5 consistently produces straight brain damage when asked to actually make a decision on the architecture that needs deep insight into the existing project.\n\nIt literally cannot think well. It can only do something that has been explained well and only with constant supervision while it is working. And even then it goes awry often. Maybe it's due to context length but unless we can put the whole codebase in it at 95% needle search, it will keep making dumb decisions. We cannot keep conditioning the next token on every single previous one.\n\nCoding is not hard. Knowing what to code is. And there the LLM's are of no help at all. At this point, I can either do something, or let AI do it faster but much much worse.",
              "score": 2,
              "created_utc": "2026-01-04 05:34:28",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nwosap1",
          "author": "aviboy2006",
          "text": "I can't say efficient but using AI tool research made easy to do market research or existing product analysis. Its fasten process of moving ahead. I used ChatGPT, Perpexity do research and UX pilot for UX prototype, Cursor and Kiro for Coding work, CodeRabbit for PR review with human intervention, Captions for video editing and grabbing shorts from long form video. NotebookLLM for summarised video.",
          "score": 6,
          "created_utc": "2025-12-30 06:22:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwq4d82",
          "author": "kd_stackstudio",
          "text": "I have > 10 yoe as a software engineer, modest B2B SaaS with 3 customers so far. \n\nI talk to ChatGPT about architecture, infrastructure and algorithms. I also talk to perplexity about different products/OSS solutions and market research tasks. \n\nCursor for coding. I use auto a lot but call in sonnet and opus for planning and tasks that auto spins out on.\n\nBecause my codebase is modular with clear separation of concerns there is very little that cannot be generated by AI and iterated on very quickly. \n\nThe major bottleneck is cost. Cursor’s auto has a habit of ignoring the rules I’ve set up and patterns that exist in the codebase. We often rewrite stuff a few times before it’s done.",
          "score": 2,
          "created_utc": "2025-12-30 13:15:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwtggm9",
          "author": "Available-Claim2445",
          "text": "I don't think anyone is actually sure how to leverage AI to its full capability. But my approach with productivity is to stick with tools that legitimately save me measurable time and automate or streamline long tasks.   \nA couple years back I was barely getting into programming just because I thought AI was cool. I wanted to learn more about it and I knew nothing. After completing Harvard's CS50, I looked at programming with AI as a managerial task rather than a \"do-it-all for me\". Rather than giving Claude or ChatGPT a basic task of \"build this app\", I say something like \"build me this feature for A, we are working on a B structure, for context we have C, and items-to-complete include X, Y, and Z\". When things go wrong, I know where to look and (usually) how because of the narrow scope I place. This saves me (personally) days worth of time as I'm not a great programmer but I understand how to manage work deeply.   \n  \nAs an automations specialist, I feel like I have some advantage because I have experience in automating tasks for my clients so I have more intuition to know when something is worth automating or building vs not. \n\nYou talk about perfecting your setup but in reality there is no \"perfect\" setup. There is no perfect automation or system. But as long as it streamlines the task at least 80% AND its repeatable, then its value can be compounded going into the future.   \n  \nAnd one hack I constantly remind myself to do: Create a literal to-do list every single day. When one task is completed move onto the next and don't stop until the list is finished, then rinse-and-repeat the next day/week. Personally I get distracted very easily and when I'm orchestrating several different tools and completing different tasks, I find that I can very easily become lost in my own work. Keeping a list of to-do's reminds me of where I am and what has been accomplished for the day or week, and more importantly what tools I used (this allows me to see which tools provide the most value to me).",
          "score": 2,
          "created_utc": "2025-12-30 23:05:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwq07k8",
          "author": "RockittHQ",
          "text": "I dont know about the others - but there is a point beyond which for my practical purposes i dont need to be up to speed to the latest second. Whereas I am, it is more a hobby and my personal interest and i am very clear as to when me \"staying updated\" is necessary vs. procrastination.\n\nBeyond a certain point - even a 3 month old LLM / approach etc works well for my needs and i don't need to be updating things within 5 mins of it releasing. \n\nI take the \"best ai\" discussions in these cases to be very much like a \"what is the best programming language\" - the right answer is whatever gets you deploying and getting revenue quickest. And if that means you're using PHP but making money - well done!",
          "score": 1,
          "created_utc": "2025-12-30 12:47:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwqqt8d",
          "author": "QuirkyTrust7174",
          "text": "I don’t think the challenge is wiring the pieces effectively. Andrej karpathy is brilliant and I follow his GitHub a lot. If anyone can do it it’s him and if he is struggling to the answer is that it’s kinda useless to try and spend time figuring out the right ai tool because they all suck in the same way.",
          "score": 1,
          "created_utc": "2025-12-30 15:21:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwrjw8p",
          "author": "darkprime140",
          "text": "It's surprising how most people I know use Claude code and other tools without looking into how to optimize them. This for example is a helpful article written by the founder of CC on best practices that I found super useful. Gave me lots of ideas on new things I didn't think were possible before. I'm sure there's similar stuff out there for Cursor/Antigravity/Codex/etc. \n\n[https://www.anthropic.com/engineering/claude-code-best-practices](https://www.anthropic.com/engineering/claude-code-best-practices)",
          "score": 1,
          "created_utc": "2025-12-30 17:38:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwu416d",
          "author": "SpecialSea2683",
          "text": "I used to do lots of coding through open source platforms for robotics engineering in grad school. Then started my own company and now use llms for not only robotics engineering but full-stack software development. I didn’t know much about frontend and backend programming. Now I prompt AI to help with that. I’m a solo-founder in SF working on an MVP.\n\ncopilot with Anthropic api calls and sometimes gemini 3 pro works out the best for me.\n\nThe barrier is that it still needs lots of supervision. So many of those api calls and generated codes go to trash (good for the api providers). Also as someone who hasn’t shipped production ready sw before, i find it very unsafe to ship. There are often security risks that you might bw unaware of.",
          "score": 1,
          "created_utc": "2025-12-31 01:15:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwvkc4v",
          "author": "BradleyX",
          "text": "Resonates. Doesn’t work in real businesses. Switching costs too high. Constantly repeating learning curve. Change management costs too high. People need consistency. You solve ten problems this month with AI, are you really going to retool constantly with every new innovation.",
          "score": 1,
          "created_utc": "2025-12-31 07:01:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx4ulu3",
          "author": "Disastrous-Target813",
          "text": "I use chatgpt often to brainstorm parts of my ideas, as well as check if there are alternatives to my proposed solutions for problems im trying to solve in my code. \nAs for using AI in my product, currently not planning to but have a future plan to add some features. \nIm kind of against the idea of shoving ai into everything. \n\nBut yeah with all the hype bs we here about ai , it does cause me to feel behind, but i try purge the fomo urges with learning. \n\nThe more we use ai to do tasks the less we actually learn. So my approach is use ai to explain or brainstorm approaches and just do the myself (at least for the first several attempts) after im able to do it confidently i start to slow speed up with ai usage most just copilot rather than agents.",
          "score": 1,
          "created_utc": "2026-01-01 20:20:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxkpt2t",
          "author": "Obvious-Grape9012",
          "text": "I've gone from Principal Eng for an AIML research institute, to a solopreneur using AI Coding tools. I'm both catching-the-wave and using it to provide value via the likes of best-practices and reduce friction for developers getting into AI Coding. Over the past 12 months my processes have shifted from needing to use custom tools to populate contexts with succinct and focussed slices through codebases, to being able to \"trust\" the AI to take longer strides. It's a constant challenge to pivot and both leverage tooling effectively and snapshot processes clearly, let alone  benchmark and compare them with the alternatives. What's working best for me right now? [https://www.mlad.ai/articles/the-proposal-driven-cycle](https://www.mlad.ai/articles/the-proposal-driven-cycle)  \nTo directly answer your Qs:   \nTo be more efficient: Build an intuition for complexity and how large a stride to take in each cycle, and learn how to spot (and course-correct/rollback) when things go wrong.  \nBarriers to perfecting: Knowing enough to choose the right stride. Being able to spot when things are/have gone wrong. Knowing when to use One-Prompt-Hero approach vs Agent-Army vs HITL",
          "score": 1,
          "created_utc": "2026-01-04 05:09:30",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pzm3f6",
      "title": "Anyone else feel that the bar for MVP Quality is really high compared to before?",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1pzm3f6/anyone_else_feel_that_the_bar_for_mvp_quality_is/",
      "author": "foldedlikeaasiansir",
      "created_utc": "2025-12-30 16:12:27",
      "score": 65,
      "num_comments": 42,
      "upvote_ratio": 0.98,
      "text": "I always come across Airbnb or DoorDash MVPs on Reddit or Twitter but now it seems that all of start up MVPs are super polished with minimal gaps in the features.\n\nI guess majority of it is through Advancement of AI but at the same time seems daunting as an aspiring founder.\n\nEdit: Maybe Airbnb was a bad example 😅 but general premise still stand",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1pzm3f6/anyone_else_feel_that_the_bar_for_mvp_quality_is/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "nwr2iul",
          "author": "Golandia",
          "text": "Well you can create more with less effort now. That’s with AI and so many SaaS vendors targeting founders. So yes, mvps will look better and have more features for the same investment AirBnB made forever ago. ",
          "score": 30,
          "created_utc": "2025-12-30 16:17:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "nws1q00",
              "author": "Martin-Giorgetti",
              "text": "True! Another thing that happens is that since it's easier and cheaper to build an MVP, the MVP doesn't end up being so minimal... meaning, extra features are added... after all, it's \"free\" to write one more line in the prompt.\n\nThe key is WHAT to build in the MVP, and this depends on clearly understanding WHY we're building it, what the main pain point is, and what our MVP, with its single, minimal feature, should solve.",
              "score": 5,
              "created_utc": "2025-12-30 19:00:25",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nwrlai2",
          "author": "Martin-Giorgetti",
          "text": "Yes, AI has raised the bar for creating MVPs. But AI has only changed HOW we build MVPs, not WHY we build them. I think that's where you can make a difference.\n\nIf an MVP is flashier but doesn't solve the problem as well as a \"less attractive\" one, it won't win in the market.",
          "score": 13,
          "created_utc": "2025-12-30 17:45:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwrp6pa",
              "author": "foldedlikeaasiansir",
              "text": "That’s a great point. The Why will always be the differentiator\n\nEdit: also -> always",
              "score": 2,
              "created_utc": "2025-12-30 18:02:56",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwrxlha",
                  "author": "Martin-Giorgetti",
                  "text": "Exactly. The WHY is where we make the difference. \n\nAnd to find that WHY, there's nothing better than talking to real potential customers. \n\nNo AI, no \"synthetic personas.\" We'll just get more of the same results as others who use Chatgpt.",
                  "score": 2,
                  "created_utc": "2025-12-30 18:41:27",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nxmmjz1",
              "author": "ThreePedalsRequired",
              "text": "It's not even AI, the bar pre- November 30 2022 (first public release of ChatGPT) was higher than early days like AirBnB and Doordash (2009 and 2013 respectively) because of much higher visibility into the startup and seed round funding stage. Essentially more people knew what it took to get funded, so they got more competitive to get funded.",
              "score": 1,
              "created_utc": "2026-01-04 14:20:01",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nwrtudx",
          "author": "worldprowler",
          "text": "Yes. Not only is the bar higher, but all the startups I'm reviewing now have the same vibe-coded interface with no differentiation in engineering or product. This means I'm now prioritizing deep tech (biotech, energy, materials science) or super-deep domain expertise. Having a web app as a value prop is as differentiated as having a website, rare in 1994, a minimum requirement in 2004.\n\nSource: I'm a pre-seed investor",
          "score": 6,
          "created_utc": "2025-12-30 18:24:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwruzmh",
              "author": "garrettfiftysmith",
              "text": "Good analogy. The website became the place to market the value prop. Will the web app become marketing?",
              "score": 2,
              "created_utc": "2025-12-30 18:29:30",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nwry9a0",
              "author": "foldedlikeaasiansir",
              "text": "Would you know any good checklist for Start Ups or an entrepreneur? Where I have trouble is the sequence in which to carry out the tasks related to building a start up. \n\nObviously Market Fit and Customer Validation is first and foremost, then comes MVP and POC to test the idea. But after that it’s get murky - Do you get a LLC first, how do you set up the business for payment to charge customer, do you build out all of the plan (Free, Paid, Enterprise) from the beginning if it’s a freemium service. How do you work on implementing an enterprise plan or does that come later. It’s all very much overwhelming to have a methodical way to build a start up.\n\nDo you have any tips that you give founder to reign in the chaos a little bit?",
              "score": 1,
              "created_utc": "2025-12-30 18:44:29",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwu1avc",
                  "author": "Beneficial_Host4863",
                  "text": "Here is a sequential order that I follow:\n\n1. Am I thinking of solving a problem I or the people around me face?\n2. If yes, is the problem painful enough that people need a new solution for it?\n3. If yes, who's the niche segment of users in need of that new solution?\n4. What should be that bare-bones solution (MVP) that would resonate with that segment?\n5. Can I build that solution as a low code, non-scalable tool in a couple of weeks?\n6. If yes, start validating the problem, solution-fit and willingness pay with 5 to 10 potential early adopters.\n7. If validated, automate and scale up. Else move-on",
                  "score": 3,
                  "created_utc": "2025-12-31 01:00:09",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwrzb5z",
          "author": "ramprass",
          "text": "Just because we can ship things quickly doesn’t mean we can build great products quickly. \n\nIt requires a deep understanding of the customer and a great product sense. \n\nUnless the founders are very good at both, no tool can magically solve this one. \n\nA customer has never cared about a MVP - they always want a reasonable level of polish to exist even pre-AI - for some apps like in finance it’s always important to build trust. \n\nWe are in a different game- The ones to win are the ones who can learn fast and then move fast.",
          "score": 6,
          "created_utc": "2025-12-30 18:49:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwrosi8",
          "author": "garrettfiftysmith",
          "text": "MVPs can be made with a sentence. AI has changed the limit for the operational triangle (faster, higher quality, and cheaper).",
          "score": 3,
          "created_utc": "2025-12-30 18:01:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwtjauh",
          "author": "admin_default",
          "text": "When the oil industry started, you could poke a hole in land and see if oil oozed out - no research, spray and pray.\n\nThe early days of the mobile internet were similar.\n\nWhen the oil industry matured, you had to dig deeper and deeper. As digging got costlier, geological research became more necessary- the companies that didn’t invest in research went bankrupt digging dry holes.\n\nThe future of tech is similar.",
          "score": 2,
          "created_utc": "2025-12-30 23:21:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwu1btq",
          "author": "Acesa",
          "text": "It's clearly a much more competitive market today and a much more mature space. There's infinitely more resources available to founders and many fewer unmet consumer needs.",
          "score": 2,
          "created_utc": "2025-12-31 01:00:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwv4e4v",
          "author": "Westernleaning",
          "text": "It isn’t just that the bar is high today, the world is very different than 2009. Back then when a new app or site dropped we all shared it with each other. I remember my buddies always sharing memes and apps, “oh bro, download uber, oh bro, check out angry birds, yo, I’m playing candy crush, check out wish you can buy anything for $1”. There was more supply of mobile devices and computers than there were apps/websites/businesses to put on them. \n\nToday we are in the opposite world. There are way too many websites, apps, DTC online brands vying for the consumer. Unless the pain point is NEXT level for the user to use a bad product, then the real competition is doing nothing, so many people pitch me products, ideas, etc, I try to avoid them, whether online courses on Instagram, or DTC, or download my app. \n\nSo MVP expectation from the user today is VERY high. Rolling out AirBnB’s MVP, or Instacart’s today, no one would touch it.",
          "score": 2,
          "created_utc": "2025-12-31 04:57:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx0bob8",
          "author": "Head_Car_2922",
          "text": "I feel your pain. I am a hardware founder. We built a coffee cup prototype, and we had to work like dogs to get enough funding to get our 10 ton pilot plant. We are raising again and this time people are saying, oh THIS is your MVP. Like what no....",
          "score": 2,
          "created_utc": "2026-01-01 00:58:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwrklcu",
          "author": "structured_obscurity",
          "text": "Effort is the same as before, the tools are just better",
          "score": 5,
          "created_utc": "2025-12-30 17:41:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwrpf5u",
              "author": "foldedlikeaasiansir",
              "text": "Another observation I guess is the evolutionary increase of skills due to the new tools as well",
              "score": 2,
              "created_utc": "2025-12-30 18:04:01",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwrqg9z",
                  "author": "sheriffly",
                  "text": "Mostly the UI has improved I believe. The infrastructure and UX still has to be appealing and solving a problem.",
                  "score": 2,
                  "created_utc": "2025-12-30 18:08:44",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwrkxmg",
          "author": "mu4farooqi",
          "text": "MVP is typically measured in terms of time, specifically the time it takes to build it, usually in X weeks. Over the past five years, everyone has gained more empowerment and access to a wider range of tools and SDKs (shadecn, tailwind, chakra), enabling them to create visually appealing user interfaces (UIs) and feature rich BEs in a shorter time frame. Consequently, the quality of MVPs has improved significantly, but the underlying time required to build them remains unchanged.\n\nFor instance, the example of Airbnb, which YC highly praised for its MVP, may not be applicable today. However, it is possible to build stunning MVPs in the same timeframe that Airbnb founders took.",
          "score": 2,
          "created_utc": "2025-12-30 17:43:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwrvyk4",
              "author": "realbrownsugar",
              "text": "MVP is measured in viability, not time. Define the problem you are trying to solve… build a product that actually solves a core component of that problem to test if your hypothesis is correct. If people actually find it useful, then you can figure out how to scale. Focus on the jazz as a last step.\n\nSometimes, especially when the solution is trivial, added jazz is important for your product to thrive vs. the next copycat. So, have a nice feel to it might be a requirement for MVP, but even then… minimal necessary to be viable is the key concept.\n\nReddit, right here is a great example of why all that jazz don’t matter. In case you don’t remember, Reddit was almost entirely text and had minimal css. When they tried to get “designers” to make it pretty and spacey, it actually fired back and they had to pull back to mostly text again. Focus on the substance… style is secondary.",
              "score": 4,
              "created_utc": "2025-12-30 18:33:59",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nwud0w2",
                  "author": "mu4farooqi",
                  "text": "The beautiful UI I mentioned was just an example. It doesn’t imply that we need Jazz. Today’s Airbnb MVP would be significantly more Jazz-inspired than the one from the 2010s.\n\nYes, MVP is primarily about viability, but I would still time-box it for a typical software product. This approach doesn’t make sense for hard technology. So, yes, it’s subjective.",
                  "score": 1,
                  "created_utc": "2025-12-31 02:07:55",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwr33k3",
          "author": "hau5keeping",
          "text": "AirBnB was founded in 2008, so yeah i would expect MVP requirements to have risen in nearly 20 years",
          "score": 1,
          "created_utc": "2025-12-30 16:20:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwrpa6q",
              "author": "foldedlikeaasiansir",
              "text": "Yeah Airbnb was a bad example 😅",
              "score": 1,
              "created_utc": "2025-12-30 18:03:22",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwszmzq",
          "author": "UnemployedAtype",
          "text": "Yes and a lot of people here are pointing out some things but not the big glaring ones.\n\nKickstarter has become saturated and big names use the platform to test and launch stuff. Backers now expect perfectly polished products instead is a first gen MVP, and it wasn't junk that people were posting before but it also wasn't as insanely high of a bar as it is now.\n\nMore people in tech and entrepreneurship and more widespread perceived appeal of being early adopters and open to tech, alongside people who really shouldn't be investing or starting up things, has led to a shifting of standards such that it's become a \"you need money to play\" game.\n\nTools have gotten better and platforms have gotten worse.\n\nWe see the same in gaming and a lot of the internet.\n\nAnyone can be an early adopter nowadays which means that early adopters don't really exist in the same way.\n\nInstead of a tech nerd or wealthy tech geek picking up and trying out some fringe, new thing, anyone can.",
          "score": 1,
          "created_utc": "2025-12-30 21:42:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwtv01u",
          "author": "No-Let-4732",
          "text": "Consumers have also risen the standards for the products they’ll use and spent money on. Getting someone to pay or use an mvp is hard",
          "score": 1,
          "created_utc": "2025-12-31 00:25:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwuo6gm",
          "author": "Available-Claim2445",
          "text": "With a flood of new AI vibe-coded apps, differentiation is definitely harder even from just the basic interface and not including the app itself. Investors are expecting more and more and honestly that's kind of fair considering that there is even more competition than ever, especially now that the barrier to entry (because of AI) has lowered once again allowing more (and faster) competitors.",
          "score": 1,
          "created_utc": "2025-12-31 03:13:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwv7yyc",
          "author": "Lazy_Mention3257",
          "text": "I have seen a recent YC company with unreadable texts (white text on white background) on their website from launch to demo day. a16z speedrun company with texts going outside of a card. And recently a 10M seed AI dating company (founded by random undergrads) with only a waiting list… \n\nI guess these are not even MVPs.",
          "score": 1,
          "created_utc": "2025-12-31 05:23:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxs4ars",
              "author": "kelvis4587",
              "text": "It’s all about story telling",
              "score": 1,
              "created_utc": "2026-01-05 07:32:22",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nww2qc0",
          "author": "Crafty-Sea-134",
          "text": "No, the problem is not the bar of current mvp. It’s the pain point we need to solve for potential customers. Of course, in 2026, The pain point of doordash not being able to order delivery in those years is gone, but the reason why those founders are still successful is that they have been iterating products according to the pain points.",
          "score": 1,
          "created_utc": "2025-12-31 09:54:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwzya5e",
          "author": "AGCRACK",
          "text": "It absolutely is - this is why VCs are conflicted. Even a great product can be easily knocked off in weeks. You better have sales channels and unique distribution to win. If you can’t be at $2m in software revenue in 18 months, you’re probably a mom n pop software company.",
          "score": 1,
          "created_utc": "2025-12-31 23:36:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx2wxsc",
          "author": "FroyoConfident1367",
          "text": "Yes, a lot of people are able to build now. This would be going up obviously. But those apps are not production grade, they are not very usable.",
          "score": 1,
          "created_utc": "2026-01-01 14:08:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxo2vff",
          "author": "Vivid_Ad2724",
          "text": "Yeah. Thanks to AI, a prototype with no traction doesn’t mean much today.",
          "score": 1,
          "created_utc": "2026-01-04 18:30:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwu4l26",
          "author": "aviboy2006",
          "text": "Now MVP building doesn't require engineering efforts you can just thought process and plan out well what you want to showcase then you are done because Vibe coding or AI tool. Its creating flashy but again need to evaluate doesn't really solving problem showing MVP its not just working model its working business model or some idea. Thats time will decide.",
          "score": 0,
          "created_utc": "2025-12-31 01:19:12",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1q4bwde",
      "title": "Founders, did you all take a time off?",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1q4bwde/founders_did_you_all_take_a_time_off/",
      "author": "AnalysisObvious6946",
      "created_utc": "2026-01-05 04:24:20",
      "score": 57,
      "num_comments": 27,
      "upvote_ratio": 0.92,
      "text": "I had an excellent 2025 building my AI startup from scratch to 1000+ B2C customers. I call it “The year of building”. Towards the end of the year, I literally felt burned out coping up with a full time job and the start up. So, I decided to take a two weeks time away from building to relax and chill with my family. Now that the two week vacation time is over and 2026 has begun, I am rejuvenated and can see the decision to take time off worked well for me. Today I start my 2026 in full force and I call it “The year of selling”. Plan is to fully focus on selling what I have already built in 2025.\n\nI am curious how you all spend your vacation season and have any interesting looking forward for 2026.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1q4bwde/founders_did_you_all_take_a_time_off/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "nxs2ji5",
          "author": "justanotherbuilderr",
          "text": "Felt like I was reading a post written by me. In the exact same boat over here. Just had 3 weeks off (spent mostly on building and relaxing) but now I’m back at my full time job feeling a little less burned out. We’ll see if I feel the same in a couple weeks but hey, I chose this path",
          "score": 10,
          "created_utc": "2026-01-05 07:16:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxs86ti",
              "author": "AnalysisObvious6946",
              "text": "Glad you could take some time off.\n\nI know it's really hard to manage a startup with full-time job. I would be cautious of burn outs gone unrecognized. That can happen and it can turn into anger, restlessness etc. So, I will try to integrate some biweekly leisure activities to my lifestyle this year.",
              "score": 2,
              "created_utc": "2026-01-05 08:07:54",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nxs6x7l",
          "author": "vonirox566",
          "text": "I decided not to take any time off and fully dedicate myself to assisting AI in generating slop. Worked out super well.",
          "score": 5,
          "created_utc": "2026-01-05 07:56:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxtsgtg",
          "author": "gokulsiva",
          "text": "I was working throughout the last 20 days building and reached the state where I wanted it to be. \n\nWould take a day off and plan to reach out, sell and collect feedback and improvise.\n\nSetting my first milestone to be hundred users.",
          "score": 2,
          "created_utc": "2026-01-05 15:05:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxtvtf8",
          "author": "SinghCoder",
          "text": "https://preview.redd.it/c2iux0ussjbg1.jpeg?width=1184&format=pjpg&auto=webp&s=2a563ce78192ed65a949eb49c4e6ff98ee16527c\n\nI actually got this feedback mail from a customer day before new year, and that day we had 52 sign-ups in a day and 9 of them invited others from within the Qordinate chat. This motivated me to push, and since we are still early, so I was working on my thing. Though yesterday I took a day beak, went out at a good place to eat, and visited a palace here which is supposedly famous.",
          "score": 2,
          "created_utc": "2026-01-05 15:22:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxtxlwh",
          "author": "EasyTangent",
          "text": "Took a couple days off and then everything went to hell in my personal life. Planning to take a couple days off this week to just recharge.",
          "score": 2,
          "created_utc": "2026-01-05 15:31:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxutglf",
          "author": "unfamiliarjoe",
          "text": "Yes. I took all of December off.",
          "score": 2,
          "created_utc": "2026-01-05 17:59:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxv27oj",
          "author": "maxim_karki",
          "text": "Yeah two weeks off to catch up on reading! And some time with family. And finally started and platinum'ed expedition 33. ",
          "score": 2,
          "created_utc": "2026-01-05 18:38:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxv6hvz",
          "author": "kietay_",
          "text": "Yes absolutely. There's very few things in life that would stop me spending time dedicated to my family at Christmas.",
          "score": 2,
          "created_utc": "2026-01-05 18:57:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxwywe4",
          "author": "chris_ck",
          "text": "Did the same thing :) \n\nWe need to normalize taking time off. \n\nI never thought I'd be the one saying this.",
          "score": 2,
          "created_utc": "2026-01-06 00:06:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxx8jnv",
              "author": "AnalysisObvious6946",
              "text": "Very true!. A great founder should build a great product and a healthy well being.",
              "score": 2,
              "created_utc": "2026-01-06 00:56:47",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nxrvswx",
          "author": "Similar_Past8486",
          "text": "9-9-7 lol it was amazing! Wouldn’t have it any other way, velocity is my first love",
          "score": 4,
          "created_utc": "2026-01-05 06:19:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxrkwpt",
          "author": "Sufficient_Ad_3495",
          "text": "Congratulations on 1000 b2c customers. I hope that's paying.   \n  \nAs for me?  What Xmas?  Head down here. All or nothing. We are going to get hit hard by a flurry of incumbents, more apps than ever I'm sure... the old physics however is out, its going to be a flood of competition. Everyone else is empowered... This thought meant one thing to me.... Keep pushing. There was no Xmas there was only some food breaks and concern about 2026 landscape     :-O",
          "score": 2,
          "created_utc": "2026-01-05 04:59:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxrm59j",
              "author": "AnalysisObvious6946",
              "text": "Hope the 2026 pays back well for your hard work.!",
              "score": 2,
              "created_utc": "2026-01-05 05:07:57",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nxrqykj",
                  "author": "Sufficient_Ad_3495",
                  "text": "Thank you, Likewise... buckle-up its going to be ride.",
                  "score": 2,
                  "created_utc": "2026-01-05 05:42:01",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nxs2hnn",
          "author": "SystemicCharles",
          "text": "Vacation?\n\nWhat's that?\n\n![gif](giphy|NSGe6AHr2epCLQJMRL)",
          "score": 2,
          "created_utc": "2026-01-05 07:16:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxs3f2f",
              "author": "AnalysisObvious6946",
              "text": "😂",
              "score": 1,
              "created_utc": "2026-01-05 07:24:21",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nxscj9e",
          "author": "Lupexlol",
          "text": "no, holidays and weekends are the only time when I can focus 100% on my startup, never take them off.",
          "score": 3,
          "created_utc": "2026-01-05 08:49:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxsczgb",
          "author": "kazuya57",
          "text": "Vacation? You mean that time I slept 8 hours instead of 4?\n\nJokes aside 2025 was the best year of my life professionally. Sold a Saas for 6 figures to start it off and spent the rest of time building and marketing a B2B, currently at 13454 MRR. Now working on a true B2C, something that's been kind of a dream idea for me for some time, expecting a launch by March. Just hope everything works out well",
          "score": 1,
          "created_utc": "2026-01-05 08:53:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxwl3g4",
              "author": "Busy_Weather_7064",
              "text": "Interested to know about your b2b, how did you gain your first 5 customers ?",
              "score": 1,
              "created_utc": "2026-01-05 22:54:24",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nxwr12r",
                  "author": "Wide_Brief3025",
                  "text": "Talking directly to people in relevant online communities helped me a ton when I started out. Listening to what they were asking for made it much easier to connect with my first customers. If you want to scale that process, ParseStream is useful for catching those key conversations as they happen, so you do not miss out on good leads.",
                  "score": 1,
                  "created_utc": "2026-01-05 23:24:57",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nxtse0q",
          "author": "PlentyDiligent9193",
          "text": "I understand this might not be ideal but I haven’t taken such long vacation in 30 years.",
          "score": 1,
          "created_utc": "2026-01-05 15:05:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxtsgb6",
          "author": "unknown4544",
          "text": "How did you manage to get the 1k B2B customers? While not even focusing on selling?",
          "score": 1,
          "created_utc": "2026-01-05 15:05:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxx977g",
              "author": "AnalysisObvious6946",
              "text": "I said B2C and plan is to find B2B sales opportunities in this year.",
              "score": 1,
              "created_utc": "2026-01-06 01:00:18",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nxwlhj2",
          "author": "Busy_Weather_7064",
          "text": "Soldiers are never off duty. ",
          "score": 1,
          "created_utc": "2026-01-05 22:56:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxx8qki",
              "author": "AnalysisObvious6946",
              "text": "Sounds good. But that’s not true 😝",
              "score": 1,
              "created_utc": "2026-01-06 00:57:49",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1q01ivi",
      "title": "2025 comes to an end today, what progress did you make in your Startup this year?",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1q01ivi/2025_comes_to_an_end_today_what_progress_did_you/",
      "author": "Shashwatcreates",
      "created_utc": "2025-12-31 02:39:27",
      "score": 54,
      "num_comments": 91,
      "upvote_ratio": 0.98,
      "text": "I will start , 2025 for me was an year full of distractions. I wouldn't call it a very productive year, although I still made some progress.\n\nI was building a solo project, and it's like 50% complete although I'm not happy with the development. But 50% is better than 0% I stand atleast somewhere.\n\nHow about you guys? How is the progress going?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1q01ivi/2025_comes_to_an_end_today_what_progress_did_you/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "nwveaoe",
          "author": "AdditionalWeb107",
          "text": "I signed my first 1M Fortune 500 deal. Means we are cash flow neutral - but still don't quite feel ready for our next round (surprisingly) Building in the infrastructure and tooling space for agents. The problem we are solving is application delivery for agents.",
          "score": 20,
          "created_utc": "2025-12-31 06:11:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwvmo9o",
              "author": "Direct-Arachnid7254",
              "text": "Hey, your company url in LinkedIn is outdated . Had to visit your site from GitHub . (Hiring for any interns btw ?) (I think you’re p*ano right ?)",
              "score": 3,
              "created_utc": "2025-12-31 07:22:19",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nwxw5rw",
                  "author": "AdditionalWeb107",
                  "text": "correct: https://github.com/katanemo/plano. building in the open",
                  "score": 2,
                  "created_utc": "2025-12-31 16:59:11",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nwvoqgt",
              "author": "johnmorris19",
              "text": "Lemme be your SDR",
              "score": 2,
              "created_utc": "2025-12-31 07:41:20",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nwxwanm",
                  "author": "AdditionalWeb107",
                  "text": "I like that: check out the OSS project that we upsell for license and support and let me know if you are still interested: https://github.com/katanemo/plano. It is developer-heavy",
                  "score": 2,
                  "created_utc": "2025-12-31 16:59:51",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nxlzws6",
                  "author": "gregb_parkingaccess",
                  "text": "can you sell voice AI?",
                  "score": 1,
                  "created_utc": "2026-01-04 11:42:43",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nxkzewg",
              "author": "Responsible-Pin-4029",
              "text": "Congrats! Was this from founder-led outbound sales, or a warm network intro?",
              "score": 1,
              "created_utc": "2026-01-04 06:20:31",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nxkztgp",
                  "author": "AdditionalWeb107",
                  "text": "warm network intro",
                  "score": 1,
                  "created_utc": "2026-01-04 06:23:42",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nwvfa59",
              "author": "Shashwatcreates",
              "text": "Wow that's a big deal 1M! I think you are YC ready!",
              "score": 1,
              "created_utc": "2025-12-31 06:19:11",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwvoblz",
          "author": "valaquer",
          "text": "I gave myself permission to start. Stopped looking for a co-founder. Chose an idea that I furiously love Instead of one that would sound good to others. . I'm doing all the work myself. No fear, no doubt, no second guessing. A clear path ahead. ",
          "score": 8,
          "created_utc": "2025-12-31 07:37:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwuohzn",
          "author": "SystemicCharles",
          "text": "It's taking longer than I would have liked, but I am not rushing a damn thing. I've been here before. Every time I rush something, I almost always regret it.\n\nSome people might \"advise\" me to just launch or just ship it, but I don't give AF. There are a lot of legal and marketing stuff I needed to take care of. Not to mention, some technical things I need to iron out as well.\n\nAs a mostly solo founder right now, I want to make sure when we launch, I spend \\~80% of my time on marketing and sales, instead of 80% on doing tech support and other things that don't move the needle.",
          "score": 15,
          "created_utc": "2025-12-31 03:15:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwutnur",
              "author": "ajcaca",
              "text": "I promise you that the right move is to launch right now.",
              "score": 2,
              "created_utc": "2025-12-31 03:47:20",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nwuwx7x",
                  "author": "SystemicCharles",
                  "text": "I promise, you don't know what you're talking about. You don't have full context, or know that I already did a private pre-launch and have an actual Commitment to Purchase list of buyers begging to hand me money.",
                  "score": 1,
                  "created_utc": "2025-12-31 04:08:10",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwurwoi",
          "author": "ConnectGeneral7216",
          "text": "I interviewed and got rejected from YC returned to full time school and kept building.\n\nBig things coming 2026 😤\n\nWhat are you building @shashwatcreates",
          "score": 7,
          "created_utc": "2025-12-31 03:36:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwuxqe2",
              "author": "Shashwatcreates",
              "text": "What did you build?\n\nI'm building a Google forms alternative! Simple yet much needed today.",
              "score": 1,
              "created_utc": "2025-12-31 04:13:23",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwv77e7",
                  "author": "puddle-shitter",
                  "text": "What’s different from Google forms and typeform?",
                  "score": 1,
                  "created_utc": "2025-12-31 05:17:42",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwvaw7k",
          "author": "Dramatic-Session9934",
          "text": "Built a full mvp, have 500 users already, and 50 recurring users. launching first institutional pilot next month. And have a fully working team, went from one founder, to and amount, all in 3 months. ( built the mvp in October)",
          "score": 3,
          "created_utc": "2025-12-31 05:44:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwvbmis",
              "author": "Shashwatcreates",
              "text": "What have you built?",
              "score": 2,
              "created_utc": "2025-12-31 05:50:20",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwvx267",
                  "author": "Dramatic-Session9934",
                  "text": "And AI waste sorting engine",
                  "score": 1,
                  "created_utc": "2025-12-31 08:59:36",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nww23cc",
          "author": "Crafty-Sea-134",
          "text": "Think about planting a tree in the first season: it spreads the root in a invisible way, In my first two years: self doubt, afraid blind efforts.. But in the second half of 2025, the water watered by the previous seeds saw progress like bamboo bursting, so keep going.",
          "score": 3,
          "created_utc": "2025-12-31 09:48:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwx2c1s",
          "author": "PapayaPokPok",
          "text": "My goal this year was to get the skills necessary to become a founding engineer in my next role. I feel I've accomplished that.\n\nCurrent role is early engineer at a YC company, but I still had several gaps in my technical knowledge. I have filled those.\n\nBut the majority of what I've learned has been non-technical; learning to draw out what stakeholders actually want, even if they can't verbalize it; learning to manage different working styles of key players; managing team members when their skills are misaligned with the task; etc.\n\nI'm excited for what 2026 brings!",
          "score": 3,
          "created_utc": "2025-12-31 14:26:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwwa3qk",
          "author": "aliparpar",
          "text": "Since I left my job last month, I’ve been spending the last few weeks of the month trying to prioritise what I want to build next year. \n\nIt doesn’t feel like progress but the direction you choose is now is going to be much more impactful than the speed early on",
          "score": 2,
          "created_utc": "2025-12-31 11:02:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwyqq4t",
          "author": "No-Degree-1068",
          "text": "Have a patent in progress with a top law tech firm in Sillicon Valley & NYC, felt validating for them to take me on as a client",
          "score": 2,
          "created_utc": "2025-12-31 19:32:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx0qzjz",
              "author": "Shashwatcreates",
              "text": "What's the project about?",
              "score": 1,
              "created_utc": "2026-01-01 02:38:12",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwzhwdl",
          "author": "United-Obligation253",
          "text": "Started in September. Had the goal to close my first cold-approached client before EOY. Failed, learned a lot on b2b sales (something I knew nothing about). Will keep pushing in 2026, for now I've got only one client that gives me oxygen.",
          "score": 2,
          "created_utc": "2025-12-31 22:00:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx0r20j",
              "author": "Shashwatcreates",
              "text": "Well one is better than nothing! Happy New year! 🎊",
              "score": 1,
              "created_utc": "2026-01-01 02:38:41",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nx00voo",
          "author": "PrestigiousTip47",
          "text": "Went from a concept to a product now we are out to secure funding to continue the build - long road ahead",
          "score": 2,
          "created_utc": "2025-12-31 23:52:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx0r9db",
              "author": "Shashwatcreates",
              "text": "How is the hunt for funding going?",
              "score": 1,
              "created_utc": "2026-01-01 02:40:05",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nx0s6sy",
                  "author": "PrestigiousTip47",
                  "text": "Slowww, tough market mixed with pre revenue business is not the easiest for sure",
                  "score": 2,
                  "created_utc": "2026-01-01 02:46:16",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nx4vnh7",
          "author": "CarlSagans",
          "text": "I Built ddltodata.com, a test data generation tool for developers. \n\nThe product itself is basically done, free tier is live, API works, docs are written.\n\nBut honestly, I've been procrastinating on the marketing side. The code was the easy part. Now I have to actually put it in front of people and that's terrifying.\n\nPlanning to do a soft launch on Reddit and Hacker News in the next few weeks. Nervous as hell. Easier to just keep tweaking code than to face that.",
          "score": 2,
          "created_utc": "2026-01-01 20:26:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxba4m0",
              "author": "nirvana6789",
              "text": "Nice site man 👍",
              "score": 1,
              "created_utc": "2026-01-02 20:12:06",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nxbghcr",
                  "author": "CarlSagans",
                  "text": "thank you, I appreciate it!",
                  "score": 1,
                  "created_utc": "2026-01-02 20:43:30",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwvi399",
          "author": "SinghCoder",
          "text": "I left my job in September and went all in.  \nLaunched, applied and got rejected by YC 2x ([https://www.youtube.com/watch?v=sWTGwIThsaU](https://www.youtube.com/watch?v=sWTGwIThsaU))\n\nScaled [Qordinate](https://qordinate.ai/wa) to 1000+ users, bootstrapped rn, with early signs of virality (people inviting others automatically)",
          "score": 3,
          "created_utc": "2025-12-31 06:42:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwviyta",
              "author": "Shashwatcreates",
              "text": "Congratulations 👏",
              "score": 2,
              "created_utc": "2025-12-31 06:49:42",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwvlqc7",
                  "author": "SinghCoder",
                  "text": "Thanks Shashwat.",
                  "score": 1,
                  "created_utc": "2025-12-31 07:13:47",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwv0hd4",
          "author": "VoltageLearning",
          "text": "While I have no intentions of applying for funding, it’s difficult sometimes to get wrapped up in the pace of progress. A few days we are on board paid customers, and other days we are struggling to gain marketing traction. As a founder, the ups and downs are relentless.\n\n2025 is allowed us to reach triple digits in MRR but it’s been an absolute grind to get to that point. I’m going to continue to work on my marketing and outreach, which is nearly 80% of the task.",
          "score": 1,
          "created_utc": "2025-12-31 04:31:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwv3j60",
              "author": "Shashwatcreates",
              "text": "Essentially if the product is good it all boils down to marketing, what have you built?",
              "score": 1,
              "created_utc": "2025-12-31 04:52:02",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwx7asj",
                  "author": "VoltageLearning",
                  "text": "We built an interview prep service, specifically for hardware and electronics engineers. The business model essentially is copied from leetcode. You can check it out here [voltage learning](https://voltagelearning.com)",
                  "score": 1,
                  "created_utc": "2025-12-31 14:54:00",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwvscm1",
          "author": "CarpetNo5579",
          "text": "shut down my vc backed b2c startup, then started a b2b startup instead. did $0-$200k ARR in 6 weeks - fully bootstrapped, things have been progressing really well!",
          "score": 1,
          "created_utc": "2025-12-31 08:14:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwvwpzv",
              "author": "Shashwatcreates",
              "text": "6 works and 200k ARR that's impressive, what did you build?",
              "score": 1,
              "created_utc": "2025-12-31 08:56:21",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nww2wnq",
                  "author": "CarpetNo5579",
                  "text": "offered a service, then have my own software component that helps me do said service",
                  "score": 2,
                  "created_utc": "2025-12-31 09:55:43",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwvvbio",
          "author": "TinyDebate7541",
          "text": "Hired 3 sales guys and did the first steps. Let´s go 2026!!!",
          "score": 1,
          "created_utc": "2025-12-31 08:43:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwvwty4",
              "author": "Shashwatcreates",
              "text": "Yay 🙌 what did you build?",
              "score": 1,
              "created_utc": "2025-12-31 08:57:24",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nwx1rdm",
          "author": "BSNL_mentor",
          "text": "Landed a few customers",
          "score": 1,
          "created_utc": "2025-12-31 14:23:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwx3b3w",
          "author": "RoutineNet4283",
          "text": "I started generating revenue on my project; I'm building it solo. \n\nBut the biggest worry is that my competitor raised millions.",
          "score": 1,
          "created_utc": "2025-12-31 14:31:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwxauam",
          "author": "Straight-Gazelle-597",
          "text": "Launched myself **Miya: The Paperwork Liberator** on the last day😊, a memorable way to say Bye to 2025 and Ciao to 2026. (Only in Italian now, other languages will come soon, stay tuned...) Happy New Year No Paperwork to you all!",
          "score": 1,
          "created_utc": "2025-12-31 15:12:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwxedf6",
              "author": "Shashwatcreates",
              "text": "Oh sounds interesting, can I have the link?",
              "score": 2,
              "created_utc": "2025-12-31 15:31:00",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwxej61",
                  "author": "Straight-Gazelle-597",
                  "text": "[https://miya.techengines.ai](https://miya.techengines.ai)",
                  "score": 1,
                  "created_utc": "2025-12-31 15:31:49",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwznufk",
          "author": "quattrocinco45",
          "text": "Got first 50 busineses to use yena.ai 💯",
          "score": 1,
          "created_utc": "2025-12-31 22:34:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx0r4ra",
              "author": "Shashwatcreates",
              "text": "That's a big achievement I would say!",
              "score": 1,
              "created_utc": "2026-01-01 02:39:12",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nx4xxrb",
          "author": "raunakhajela",
          "text": "Crossed $5k MRR",
          "score": 1,
          "created_utc": "2026-01-01 20:38:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx72iq7",
              "author": "Shashwatcreates",
              "text": "That's a massive achievement congratulations!",
              "score": 1,
              "created_utc": "2026-01-02 03:55:06",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nxd8i96",
          "author": "sigma_crusader",
          "text": "Last year was a rollercoaster. I dropped out of my master’s to pursue my startup, won several B-model competitions, and even convinced some of the best people in the field to join me. Built a team and had two major VCs reach out inbound. We pivoted multiple times, built a PoC, tested it with real users, and eventually realized it wasn’t right. I went through three co-founder breakups, which was tough. The bottom line is that we didn’t have product clarity.\n\nNow I’m back to basics, building frugally, not from scratch, but with a ton of lessons learned from last year. I’m starting this year with much more clarity and a far stronger foundation.",
          "score": 1,
          "created_utc": "2026-01-03 02:25:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxdaw7s",
              "author": "Shashwatcreates",
              "text": "Now that's the definition of a rollercoaster ride. What are you building? \n\nEven I believe that nothing teaches you more than failures.",
              "score": 1,
              "created_utc": "2026-01-03 02:39:43",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nxdd5br",
          "author": "Dumb-ppl",
          "text": "Currently working in sales in a b2b SaaS scale up to support cost of living and pay for developments, dedicating 70+ hours per week in our own company.\n\nWe own a booking website which is operating in a specific area of Europe, which has already some traction (about €100k in sales last year).\nWe are still working on this website as, considering the little traction and the niche it operates in, we want to test some functionalities that are going to be the core of our soon to be consumer product, with the MVP to be released by end of March.\n\nWe’ll continue applying for YC.",
          "score": 1,
          "created_utc": "2026-01-03 02:52:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxdjn7b",
              "author": "Shashwatcreates",
              "text": "100k€ is a big deal! 🤝 Congratulations 🎉",
              "score": 1,
              "created_utc": "2026-01-03 03:32:15",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nxdlbjj",
                  "author": "Dumb-ppl",
                  "text": "Thank you for the support!\n\nUnfortunately, by knowing the market we operate in, the margins, and the average return per unit, the number itself is pretty low and it doesn’t even come from a revolutionary service, is something that already exist so I am pretty negative about this result, however I think we are gaining the huge benefit of experimenting, which is great!",
                  "score": 2,
                  "created_utc": "2026-01-03 03:42:41",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nxlzywp",
          "author": "gregb_parkingaccess",
          "text": "u/AdditionalWeb107  Are you guys looking into native \"Human-in-the-Loop\" (HITL) support?\n\nWe are building an interjection/alert layer that lets humans \"pause and fix\" agent tool calls at the proxy level before they execute. I think it bridges the trust gap for enterprises who aren't ready for 100% autonomy yet. Would love to see if this fits your roadmap for Plano.",
          "score": 1,
          "created_utc": "2026-01-04 11:43:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx0u393",
          "author": "abyssalvalue",
          "text": "Honestly had a relatively chill year.  Crossed $1M ARR and grew 150% yoy.  The goal is to do it again this year.",
          "score": 0,
          "created_utc": "2026-01-01 02:59:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx12h8g",
              "author": "Shashwatcreates",
              "text": "1M ARR is crazy AF what have you built?",
              "score": 1,
              "created_utc": "2026-01-01 03:55:50",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nx2fugg",
                  "author": "abyssalvalue",
                  "text": "Boring saas that solves a problem in a niche market.",
                  "score": 1,
                  "created_utc": "2026-01-01 11:46:47",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1q28i3y",
      "title": "How do I get people to provide feedback about my product",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1q28i3y/how_do_i_get_people_to_provide_feedback_about_my/",
      "author": "evanskarangu",
      "created_utc": "2026-01-02 19:45:17",
      "score": 29,
      "num_comments": 66,
      "upvote_ratio": 0.95,
      "text": "I am really stuck at where and how to get people to try out my product and provide feedback. \n\nI have tried running ads with the hope that people will install and try out my app, but all I am getting is impressions and not installs. I really want to validate whether my idea is right.\n\nWhat's your experience as a founder?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1q28i3y/how_do_i_get_people_to_provide_feedback_about_my/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "nxb6d3l",
          "author": "Main-Heat-6240",
          "text": "It is getting harder and harder. People barely respond to linkedin messages and social channels/communities are often non-responsive as well.\n\nMy hypothesis:  Quality of content and comms on social channels is dropping increasingly fast due to automated reach out (think linkedin and IG) and other influences. \nSo free test users now is a lot harder than a few years ago.\n\nThis should not affect your paid ads significantly. So there might be something wrong there.\n\nWhat works for me so far: get people close to you to test, friends and ex colleagues. From that widen the circle.",
          "score": 11,
          "created_utc": "2026-01-02 19:53:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxb7def",
              "author": "evanskarangu",
              "text": "You are absolutely right. The majority of people nowadays don't care about what the product is about. Social channels aren't working as expected. I have tried getting a group of people and giving them some tips to test it out. I wasn't as satisfied with the feedback they gave. Now I want to widen the circle",
              "score": 2,
              "created_utc": "2026-01-02 19:58:43",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "nxfqgfq",
              "author": "Martin-Giorgetti",
              "text": "That works for me too. Leverage your network of friends (who qualify) to test your product. Then ask them for referrals. \n\nIn my previous startup, the referral chain went up to the fifth degree. That's enough to test and fine-tune things before investing in advertising.",
              "score": 1,
              "created_utc": "2026-01-03 13:41:32",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nxbkt3a",
          "author": "Longjumping_Ant_6991",
          "text": "For our consumer product (personal finance), we did the following:\n1. Ask friends and family to try it (10 ppl)\n2. Expand to your network by personally reaching out. In order to make this stick and get quality feedback, we onboarded these users in-person (50 ppl)\n3. SEO and Reddit. Engage in communities relevant to your product. Find ppl that would genuinely get value from using your product, and get your website in-front of them.\n\nWe are currently on step 3, building a waitlist and validating the messaging with potential customers while reviving daily feedback from our 50 test users in a controlled environment.\n\nNext step, once messaging is validated and we found potential PMF, we will raise money to run ads and have the capital to get the operational and compliance hurdles done. \n\nI am no expert, but step 1-3 has worked well for us. We have a 10% conversation rate to the waitlist from website visitors. And we invite up more ppl from the waitlist every week. \n\nHappy to give feedback if you share your website.",
          "score": 3,
          "created_utc": "2026-01-02 21:04:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxbn8xe",
              "author": "evanskarangu",
              "text": "I would want to know more about Reddit and SEO.\n\nMy website is https://www.pacaya.com\n\nFeel free to check it out.",
              "score": 1,
              "created_utc": "2026-01-02 21:16:26",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nxewhp1",
                  "author": "TightNectarine6499",
                  "text": "Hi, your copy is unclear. Your header and hero section is vague.",
                  "score": 2,
                  "created_utc": "2026-01-03 09:51:31",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nxbx5go",
                  "author": "Longjumping_Ant_6991",
                  "text": "What do you want to know?",
                  "score": 1,
                  "created_utc": "2026-01-02 22:04:34",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nxbo78q",
              "author": "schelskedevco",
              "text": "Your site Krona looks really cool. I'm also building in the AI personal finance space, but more on the projections / long-term side, as opposed to the budgeting side which seems like it's more of your focus. Site is in my profile, not sure if I can link it here. Mind if I DM? Would love to connect and help each other out, if you're interested.",
              "score": 1,
              "created_utc": "2026-01-02 21:20:59",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nxbwzb9",
                  "author": "Longjumping_Ant_6991",
                  "text": "100%, send a DM!",
                  "score": 1,
                  "created_utc": "2026-01-02 22:03:44",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nxbo7tq",
              "author": "Wide_Brief3025",
              "text": "Crowdsourcing feedback in relevant subreddits is a great strategy. To make it even more efficient, I started using tools to track when potential users mention keywords related to my product. ParseStream helps a lot with this since it filters for quality leads and sends instant alerts so you can join the conversation right away. It saves time and makes it easier to engage with the right crowd.",
              "score": 1,
              "created_utc": "2026-01-02 21:21:04",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nxfgylv",
                  "author": "Longjumping_Ant_6991",
                  "text": "This is a perfect example on how to not engage genuinely and instead focus on just promoting. This is self promotion which you can quickly get banned for",
                  "score": 1,
                  "created_utc": "2026-01-03 12:39:23",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nxcjsm5",
          "author": "Frequent_Heat_9759",
          "text": "B2B? It’s important not to conflate “not solving a problem” with early adoption risk aversion \n\nPeople say get your first pilots/customers via non scalable means (major cliché). I think that’s good advice but not as good as this:\n\n“Your first customers need to be people who like you and are routing for your success”\n\nI think it’s tough to sell early on value prop alone",
          "score": 3,
          "created_utc": "2026-01-03 00:05:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxclw17",
              "author": "evanskarangu",
              "text": "This is very true. My first customers will be my evangelicals. They need to believe in the product and spread the gospel to others.",
              "score": 0,
              "created_utc": "2026-01-03 00:16:58",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nxcxear",
          "author": "unknown4544",
          "text": "I spent 6 months of my life building a coaching platform to help coaches manage their time and clients better because “they spent hours every single week on unnecessary admin work that can be automated”. When launch came around, I started DM’ing literally hundreds of coaches a day (instagram, LinkedIn) seeing if they’d like to use it and give me feedback on it. And guess what, after literally tens of thousands of DM’s, and many convos that went like “Nice cool idea, maybe I’ll check it out later” I realized that it wasn’t a big enough pain point for them\n\nPoint is, If what you’re solving is a real painful problem, you wouldn’t find it difficult to get users and especially feedback.",
          "score": 3,
          "created_utc": "2026-01-03 01:21:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxdtmd2",
              "author": "evanskarangu",
              "text": "Very true 💯. That's an amazing experience you've shared. Sometimes you may be thinking that you have a brilliant idea only for you to realize it's a tarpit idea 💡",
              "score": 2,
              "created_utc": "2026-01-03 04:36:00",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nxb5e61",
          "author": "ExplorerTop881",
          "text": "Is it a b2b product?",
          "score": 2,
          "created_utc": "2026-01-02 19:49:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxb5vje",
              "author": "evanskarangu",
              "text": "It's both B2B and B2C",
              "score": 1,
              "created_utc": "2026-01-02 19:51:29",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nxblrmz",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 2,
          "created_utc": "2026-01-02 21:09:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxbm3r1",
              "author": "evanskarangu",
              "text": "Wow, this sounds like a brilliant idea. I had not thought of it from that angle",
              "score": 2,
              "created_utc": "2026-01-02 21:10:54",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nxbtjlg",
                  "author": "Martin-Giorgetti",
                  "text": "Another approach, instead of focusing on hobbies or sports, would be to focus on physical proximity. \n\nThat is, go to a company owned by a friend or a gated community where a friend lives. Offer that company or community free use of the app in exchange for feedback. \n\nThis option works if you have an influential friend or someone who manages that company or community. But keep in mind that you need a minimum number of people to ensure there are shared hobbies and sports.",
                  "score": 2,
                  "created_utc": "2026-01-02 21:46:50",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nxbojn3",
          "author": "Practical_Surround_8",
          "text": "Saw in the comments you're both B2B and B2C. Can't speak much on the B2C side. \n\n  \nFor B2B it is getting harder. VPs and C suite get like 30 emails/dms a day with pitches. If you're not getting much traction from emails or DMs its a pretty solid signal you're not solving a problem on top of their minds.\n\n  \nMake sure to track open rates and everything as well so you know exactly whats happening. If no one is opening your emails or seeing them at all. Then its probably something wrong with your outbound.",
          "score": 2,
          "created_utc": "2026-01-02 21:22:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxbt2n3",
              "author": "evanskarangu",
              "text": "I had tried sending a bunch of outreach emails a while ago. They were being opened but no response was made by the VPs and C suite. Maybe the problem is not clear enough.\n\nHowever, the B2B is supposed to come later after B2C. We want to attract them based on the numbers i.e.Daily Active users and Monthly active users",
              "score": 2,
              "created_utc": "2026-01-02 21:44:32",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nxbx93d",
                  "author": "Practical_Surround_8",
                  "text": "Yea makes sense. I've never built a B2C company so not super sure. I have some close friends that are building B2C companies though. It's completely a marketing game. \n\n  \nAlthough I was just looking at your website, and it kind of looks like a tarpit idea, but if you can market like crazy and get enough users props to you!",
                  "score": 2,
                  "created_utc": "2026-01-02 22:05:04",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nxcgrkm",
          "author": "tdaawg",
          "text": "I’d probably start by testing different marketing messages. Meaning, how you talk about the product on the home page and App Store pages. \n\nThere are online survey platforms for user testing different ideas and getting feedback. \n\nAnd also perhaps focus on a niche activity you care about and understand to get started. And try and build that audience first.",
          "score": 2,
          "created_utc": "2026-01-02 23:48:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxcijgq",
              "author": "evanskarangu",
              "text": "This makes sense for sure. I will try the online survey platforms. I have never done this for sure. Also the focus on a niche will be crucial.\n\nMany thanks for the feedback. I am humbled 🙏",
              "score": 2,
              "created_utc": "2026-01-02 23:58:34",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nxcjigb",
                  "author": "tdaawg",
                  "text": "You’re welcome! My company has 3 startups on the go and I know how hard this stuff can be. You need people to have strong “intent” to get into your app, understanding the value and engaging with it. And that intent starts with the initial “promise” the product is making and how that resonates with their need. Be cool to hear how you get on,.",
                  "score": 2,
                  "created_utc": "2026-01-03 00:03:58",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nxcz9y3",
          "author": "PerformanceFine1228",
          "text": "i think the question itself is wrong  \n\\- IMO validating your problem should involve 0% of your product (refer to the Mom Test)  \n\\- post validation, generating leads and qualification is pure grind (target N outreaches, expect 1% reply rate. bonus - haters!  \n  \ngot in YC last year + worked at YC W21, S18 startups previously",
          "score": 2,
          "created_utc": "2026-01-03 01:32:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxdvo36",
              "author": "evanskarangu",
              "text": "That’s a good point. I may be jumping into the product too early.\n\nInstead of showing what I am building, I should be spending more time understanding whether the problem actually hurts people without pitching anything.\n\nOnce that’s clear, getting users or leads will only involve reaching out to a lot of people, expecting most to ignore you, and learning from the few who respond (even the negative ones).\n\nAppreciate you sharing this, especially coming from someone with YC experience.",
              "score": 2,
              "created_utc": "2026-01-03 04:49:44",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nxdcf04",
          "author": "Gerome24",
          "text": "One perfect answer = OpenSource",
          "score": 2,
          "created_utc": "2026-01-03 02:48:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxdw5wq",
              "author": "evanskarangu",
              "text": "The product is free to use, I haven't started to add payment features. Waiting for people to see value first and then monetization will follow.",
              "score": 1,
              "created_utc": "2026-01-03 04:53:03",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nxdlpr2",
          "author": "JohnnyKonig",
          "text": "I didn't see a comment where you explained your product and your website is currently down, so this advice is general - but I give this pitch A LOT to new founders:  \n  \nHow many of your potential customers live in a 30 minute drive from your home? While you are checking your click-through rates in line at the supermarket or Starbucks, how many potential customers are standing around you?\n\nI co-founded a marketplace app a while back that serviced businesses and consumers. The only online marketing we did to get going (online ads came at scale) was posting in local Facebook groups. Everything else relied on finding our potential users in person and talking to them. Businesses are easier if they have a storefront because you can just walk in. Consumers require a bit more creativity. Again - we used Facebook groups, we also went to local colleges and job fairs, bars, etc... Get your users one at a time face-to-face... Uber did this to get drivers early on.   \n  \nI also worked on a financial investing app and once posted on Reddit about creating a local investor group in my area to chat about investing. I had a decent response just never followed through due to a business shift - but if I wanted to get 10 investors on my app today I'd be using social media not to \"get signups\" but to get in-person meetings.\n\nA long time ago my wife was into door-to-door vacuum cleaner sales. I hated her business and their sales tactics, but damn did they know their stuff. Get your first 10 users in your backyard. Buy them coffee, lunch, beer... you'll get the most honest feedback and build relationships not just users.",
          "score": 2,
          "created_utc": "2026-01-03 03:45:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxdubad",
              "author": "evanskarangu",
              "text": "That's for sure. It's amazing to get feedback from someone with the experience you have. I think it's the high time I do person to person interactions.",
              "score": 1,
              "created_utc": "2026-01-03 04:40:39",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nxf2ube",
          "author": "themonsterofchilika",
          "text": "Just get hold of your end users. Reward them for using your product. Do it in-person.",
          "score": 2,
          "created_utc": "2026-01-03 10:45:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxf7u26",
              "author": "evanskarangu",
              "text": "Yeah, I have decided I will have to get the end users physically",
              "score": 1,
              "created_utc": "2026-01-03 11:27:13",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nxgnh22",
          "author": "greyzor7",
          "text": "Try launching your app a combo of social media: X/Twitter, Reddit + launch platforms: Product Hunt, BetaList.\n\nTiktok for consumer apps is a must. Micro influencers only, CPA-based.\n\nI'm btw running a [platform](https://microlaunch.net/premium) that gets 30k+ makers each month. Helpful when you're starting to acquire users & convert first customers.\n\nYou measure all ROIs, then simply double down on what worked. Then keep doing it.\n\nYou got this!",
          "score": 2,
          "created_utc": "2026-01-03 16:34:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxhnfce",
              "author": "evanskarangu",
              "text": "I have launched it on Product Hunt, run TikTok ads. Thanks for mentioning I use micro influencers. I think this will be much better and bring better results unlike the normal ads I was running.\n\nI will also take a look at your platform as soon as I start acquiring users.\n\nThanks 🙏 for the feedback.",
              "score": 1,
              "created_utc": "2026-01-03 19:18:40",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nxhpfmn",
          "author": "Objective_Cancel_337",
          "text": "Here’s my advice, with an important caveat:\nThis approach only works if your user persona is generic, meaning the product does not require specialized knowledge, domain expertise, or complex usage patterns. If you’re building a general consumer app, this can be effective.\n\nGo to a Starbucks or another public place. Open your laptop and place a small sign that says something like “Free coffee for your feedback.” Invite people to try your demo or prototype.\n\nImportant: do not ask questions like “Do you like it?” or “What should I change?”\nInstead, give them a specific task and observe how they try to complete it using your product.\n\nYou only need 5–7 people to start seeing clear patterns. This should not blow your budget.\n\nWatch closely:\n\t•\tWhere do they hesitate?\n\t•\tWhat do they misunderstand?\n\t•\tWhat do they try that doesn’t work?\n\nAfterward, ask reflective questions such as:\n\t•\t“How did that work for you?”\n\t•\t“What made this difficult?”\n\t•\t“What would make this easier?”\n\nAvoid asking for feature ideas. You’re not looking for what to build next.\nYou’re looking for what’s blocking successful use and what would reduce friction.\n\nThe goal is to understand:\n\t•\tWhy they struggle\n\t•\tWhere the product fails to support their intent\n\t•\tWhat currently prevents them from using it successfully\n\nThis is far more valuable than asking whether they like it.",
          "score": 2,
          "created_utc": "2026-01-03 19:28:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxhqb3z",
              "author": "evanskarangu",
              "text": "Thanks a lot for this feedback. I am really humbled. \n\nI see the distinction now. Instead of asking users what they think, I should give them a concrete task and watch how they actually use the product. \n\nThe real signal is where they hesitate, get confused, or fail. It's not about whether they say they like it.",
              "score": 1,
              "created_utc": "2026-01-03 19:32:07",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nxb71ci",
          "author": "Individual-Artist223",
          "text": "1. Tell us the idea,\n\n2. Ask for feedback,\n\n3. Problem solved.",
          "score": 1,
          "created_utc": "2026-01-02 19:57:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxb8b7p",
              "author": "evanskarangu",
              "text": "The idea is about connecting people locally to try out activities in their neighborhood for example playing badminton. Most people in the US don't have a way of being socially active. I am thinking of helping people interact based on their hobbies. This should be within walking radius. You get to interact with people within your place of work, where you live, play and eat",
              "score": 2,
              "created_utc": "2026-01-02 20:03:15",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nxbzgq2",
                  "author": "iloveresumes2much",
                  "text": "Just responding here because I saw you are developing a social discovery app, I was at this for over a year and put this on pause to focus on something else instead. \n\nI'll say this is going to be extremely hard for you to do, you're going to be really enamored by the idea and think you have the solution that meetup and facebook groups or partiful just can't do well at all, but I realized this is something that takes an enormous amount of capital and time to execute, and it's very difficult to execute this well.\n\nHave you considered maybe exploring another problem for a week or so to just give yourself a fresh perspective from this idea? I found by doing this I was solving for a problem much closer to me that I am having a lot more traction with.",
                  "score": 3,
                  "created_utc": "2026-01-02 22:16:16",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nxca0l4",
                  "author": "dharamlokhandwala",
                  "text": "A few ways I can think of if you haven’t already tried:  \n\n1) Maybe start small by asking your friends/colleagues/neighbourhood social circle/etc who are actively looking for events nearby to use your product? Or maybe create an event for your neighbourhood and gave them use your product to discover. \n\n2) It’s a huge space what you are building in, so try to niche down and find a market and its problem? For example, Partner with some activity centers or gyms or MMA classes to see if people want to find other people or partners going to these classes. Win win for both you and your partner.",
                  "score": 2,
                  "created_utc": "2026-01-02 23:11:30",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nxb9nx9",
                  "author": "Individual-Artist223",
                  "text": "Feels like a variant of meetup, thursday, reddit et al., what's different, what's your niche, why will people engage?",
                  "score": 2,
                  "created_utc": "2026-01-02 20:09:52",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nxc9wqo",
          "author": "scifisquirrel",
          "text": "This might sound crazy---but you should actually not talk to users. \n\nYou should go out and get a ping-pong table (or something like it). Paint it with your logo. Set it up in different parts of NYC. See who comes to play. These people are your customer base---people who would be willing to chat with strangers and try out a new activity. Tell them you have an app coming in 3 months and they can sign up for your waitlist. \n\nThe other tactic, if you want to be more B2B (and I think this has the sounder model). Go to activity places--bowling alleys, skate rinks, badminton, etc. Say you're building an app where people get discounts for going to places that aren't busy. \"Matinee for Everywhere\". When there they get paired with the two or three other people that also got the discount. The businesses get more revenue from people coming on off hours, and I think if you spend the day interviewing business owners, compiling a list of 10 that would be interested then you have a real shot at building something people will pay for. \n\nBy day I'm a business consultant for Series A companies and building a \"Duolingo for Founders\" --- happy to chat further!",
          "score": 1,
          "created_utc": "2026-01-02 23:10:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxce969",
              "author": "evanskarangu",
              "text": "This doesn’t sound crazy at all. It’s actually one of the more concrete suggestions I’ve heard.\n\nThe ping-pong table idea is a sharp way to identify people who already have the social activation energy the product would depend on.\n\nThe B2B angle also resonates. Pairing people during discounted windows is especially interesting as a structured way to lower the awkwardness barrier.\n\nSpending a full day talking to operators(businesses) and walking away with a short list of “yes, I’d try this” feels like a much stronger signal than abstract user feedback.\n\nI really appreciate you taking the time to provide feedback.\nYour Duolingo-for-Founders project also sounds intriguing.",
              "score": 2,
              "created_utc": "2026-01-02 23:34:40",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nxhm85q",
          "author": "hellf1nger",
          "text": "Dude runs an AI bot to respond to reddit and wonders why no testers",
          "score": 0,
          "created_utc": "2026-01-03 19:13:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxho4j2",
              "author": "evanskarangu",
              "text": "Kindly, I am not using any bot here. It's just me, genuinely trying to figure this out and learn from the feedback.",
              "score": -1,
              "created_utc": "2026-01-03 19:21:55",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1py21eb",
      "title": "I’m replacing my music with podcasts, suggestions ?",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1py21eb/im_replacing_my_music_with_podcasts_suggestions/",
      "author": "Swimming_Tangelo8423",
      "created_utc": "2025-12-28 20:47:43",
      "score": 24,
      "num_comments": 27,
      "upvote_ratio": 0.86,
      "text": "I want to make use of my time and replace music with a bunch of useful podcasts on entrepreneurship, startups, tech and more.\n\nWhat are your top picks? Or do you know a place I can find such podcasts to choose from?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1py21eb/im_replacing_my_music_with_podcasts_suggestions/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "nwi4kf9",
          "author": "ergonet",
          "text": "My personal favorites\n  \n- __Bussines stories and lessons learned:__\n  - [How I built this](https://podcasts.apple.com/mx/podcast/how-i-built-this-with-guy-raz/id1150510297)\n  - [Business wars](https://podcasts.apple.com/mx/podcast/business-wars/id1335814741)\n- __Funding:__\n  - [The Pitch](https://podcasts.apple.com/mx/podcast/the-pitch/id1008577710)\n  - [Zero to IPO](https://podcasts.apple.com/mx/podcast/zero-to-ipo/id1449387146)\n- __Understanding everything money related and financial news:__\n  - [Planet Money](https://podcasts.apple.com/mx/podcast/planet-money/id290783428)\n  - [The indicator](https://podcasts.apple.com/mx/podcast/planet-money/id290783428)\n  \n.  \nEdit: fixed links",
          "score": 7,
          "created_utc": "2025-12-29 06:23:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwk95rn",
          "author": "Trinty444",
          "text": "You should keep listening to music, just dedicate  separate times for podcasts and music. Not everything you do needs to feel like you are constantly hustling or “learning”…",
          "score": 4,
          "created_utc": "2025-12-29 15:54:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwhcttx",
          "author": "No-Let-4732",
          "text": "I like my first million",
          "score": 3,
          "created_utc": "2025-12-29 03:15:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwipuns",
          "author": "PowerBoth8172",
          "text": "What do you guys think about interactive podcasts, where you can interrupt and ask questions and receive answers based on the corpus of the video and other scraped information? Would you use this?",
          "score": 3,
          "created_utc": "2025-12-29 09:36:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwjstxj",
              "author": "Knowledge_Seeker_001",
              "text": "I think I will, and people like Hormozi are already doing it. But It's not their main core, they create long and short forms (mostly long ones) and thus they get their followers to ask questions in the live. If live was their only thing, I really doubt that they would get this big following.",
              "score": 1,
              "created_utc": "2025-12-29 14:31:12",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nwkddtr",
          "author": "Vemly-AI",
          "text": "My first million/ YC combinator/ 20VC",
          "score": 3,
          "created_utc": "2025-12-29 16:14:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwigbws",
          "author": "ProfessorRagna",
          "text": "My First Million",
          "score": 2,
          "created_utc": "2025-12-29 08:06:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwlcelc",
          "author": "Livid-Savings-5152",
          "text": "Replace podcasts with cold calling. It’ll force you to build the only skill that matters in business: immunity to rejection and embarrassment.",
          "score": 2,
          "created_utc": "2025-12-29 18:58:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "nx33fu2",
              "author": "OrganizationCute6950",
              "text": "Needed to hear this haha",
              "score": 1,
              "created_utc": "2026-01-01 14:51:22",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nx991ud",
                  "author": "Livid-Savings-5152",
                  "text": "Selling and getting money is the only skill that matters. That why most smart people fail in tech industry. Being good at coding doesn’t translate into getting money. Usually it’s the dumb people who succeed and hire the smart people to work as employees. The dumb person is good at selling",
                  "score": 1,
                  "created_utc": "2026-01-02 14:20:14",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwrvxso",
          "author": "_dremnik",
          "text": "podcasts are great but i would consider that too much information consumption actually isn't a good thing. i've had arguments with friends about this and i always find that music is a great opportunity to let my mind wander / rest and digest some of the problems that i am actively working on. a low information diet is a good thing for productivity :)",
          "score": 2,
          "created_utc": "2025-12-30 18:33:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwfior7",
          "author": "phatjimmyp",
          "text": "this episode is a cool cross between stem and magic. Loved Seth's approach to product with the emphasis on wonder at it's core.  \n[https://open.spotify.com/episode/4GceRiXYbAoWLsHAlRHX1v?si=wRiw0VWQQqOOBAWIdlMI-w](https://open.spotify.com/episode/4GceRiXYbAoWLsHAlRHX1v?si=wRiw0VWQQqOOBAWIdlMI-w)",
          "score": 1,
          "created_utc": "2025-12-28 21:18:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwftj3x",
          "author": "aggressive-figs",
          "text": "when I workout I listen to the daily TBPN. Also Acquired is good. ",
          "score": 1,
          "created_utc": "2025-12-28 22:12:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwgnnyk",
          "author": "Realclayman2",
          "text": "These are my favorite tech/startup podcasts: A16z, yc, startups for the rest of us, the next wave.",
          "score": 1,
          "created_utc": "2025-12-29 00:50:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwh88r8",
          "author": "shiwenbin",
          "text": "How I Built This is all time.  Episode w Ben and Jerry a personal favorite",
          "score": 1,
          "created_utc": "2025-12-29 02:48:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwhyise",
          "author": "julick",
          "text": "Lenny's Podcast",
          "score": 1,
          "created_utc": "2025-12-29 05:35:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwieo0v",
          "author": "Crafty-Sea-134",
          "text": "Also wanna ask: Is there any podcast help you acquire, expand, and keep healthy churn rate?",
          "score": 1,
          "created_utc": "2025-12-29 07:51:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwikmrm",
          "author": "chuyhouse2",
          "text": "Itnig - in Spanish",
          "score": 1,
          "created_utc": "2025-12-29 08:47:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwkjulv",
          "author": "Astraltraumagarden",
          "text": "If music makes you more productive, don’t switch it out during work time. During driving, walking, working out etc, sure. But make sure you don’t affect your motivation.",
          "score": 1,
          "created_utc": "2025-12-29 16:45:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwlw8ej",
          "author": "Auresma",
          "text": "Founders by David Senra",
          "score": 1,
          "created_utc": "2025-12-29 20:33:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx8hicf",
          "author": "Full_Connection_2240",
          "text": "Founders by David Senra.",
          "score": 1,
          "created_utc": "2026-01-02 11:02:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxmmuvo",
          "author": "ThreePedalsRequired",
          "text": "Too much noise. Just listen to your music.",
          "score": 1,
          "created_utc": "2026-01-04 14:21:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwwo2d2",
          "author": "SecureSlateHQ",
          "text": "1/ **How I Built This**  \nFounder stories done right. Not just wins, but mistakes, pivots, and near-failures. Easy listen, high signal.\n\n2/ **My First Million**  \nVery idea-driven. Great for spotting trends, business models, and “why didn’t I think of that?” moments.\n\n3/ **Acquired**  \nLong episodes, but worth it. Deep dives into how iconic companies actually got built. Best for walks or long drives.\n\n4/ **a16z Podcast**  \nGood mix of tech, AI, startups, and future thinking. Less hype, more context.\n\n5/ **The Tim Ferriss Show**  \nNot every episode hits, but when it does, it really does. Great for learning how top performers think.\n\n6/ **Lex Fridman Podcast**  \nLong, slow, thoughtful conversations. Not background noise — best when you can actually focus.",
          "score": 1,
          "created_utc": "2025-12-31 12:57:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwhvesl",
          "author": "BusinessStrategist",
          "text": "You’re venturing into the « twilight zone » of creating a following. And a following is a cult.\n\nSo you tell us the profile of all those followers who are going to crave your every word!",
          "score": -3,
          "created_utc": "2025-12-29 05:12:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwi7fkl",
              "author": "ergonet",
              "text": "I understood that OP wants to listen to podcasts, and wants recommendations on what to listen, not to make them. \n\nUno of us got it wrong! 😅",
              "score": 2,
              "created_utc": "2025-12-29 06:47:29",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nwibeij",
                  "author": "BusinessStrategist",
                  "text": "Entrepreneurship is a journey.\n\nTo suggest a «route to take, » it helps to know where it is that you want to go.\n\n\n\nYes, you’re right. My assumption was that the question was about changing music to podcasts.\n\nThanks for pointing that out. \n\n\nSo, getting back to the « revised » question, what is the « desired destination? »",
                  "score": -3,
                  "created_utc": "2025-12-29 07:22:10",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1q11x40",
      "title": "What did 2025 teach you that will change how you build in 2026?",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1q11x40/what_did_2025_teach_you_that_will_change_how_you/",
      "author": "Willing-Training1020",
      "created_utc": "2026-01-01 11:12:47",
      "score": 22,
      "num_comments": 8,
      "upvote_ratio": 0.97,
      "text": "Looking back, a lot of lessons don’t show up in metrics but in decisions — what you chased, what you ignored, and where time went that didn’t pay off.\n\nInterested to hear from other founders: what’s one lesson from 2025 that’s shaping how you plan to execute, prioritize, or scale in 2026?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1q11x40/what_did_2025_teach_you_that_will_change_how_you/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "nx71a4i",
          "author": "Stubbby",
          "text": "LLM proficiency is an enormous part of the value a software engineer brings. For any prospective hire I will ask to showcase the LLM abilities rather than leetcode.",
          "score": 4,
          "created_utc": "2026-01-02 03:47:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx7ravk",
          "author": "Sketaverse",
          "text": "My workflow is entirely different from Jan 2025, it is absolutely insane the tools we now have available",
          "score": 6,
          "created_utc": "2026-01-02 06:56:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx3wfc7",
          "author": "die117",
          "text": "Don't tell your romantic partner that you want a partner that is more athletic at your NYeve dinner.   \nNot a great way to start the year.",
          "score": 5,
          "created_utc": "2026-01-01 17:30:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxb3pj5",
          "author": "evanskarangu",
          "text": "I have learnt the hard way. Ship first, scale later is the way to go. Always consider the customer in mind as you adjust the product to suit their needs. Feedback is very crucial. \n\nIf you build as if you are doing it for yourself, it will be a hustle for you. I have really spent a lot of money pivoting just to ensure the product is 💯 perfect. This is the worst decision you could ever make. Customer first !",
          "score": 1,
          "created_utc": "2026-01-02 19:41:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxe6ys1",
          "author": "buildwithkarl",
          "text": "Here are my 2025 lessons (For context, I’m the CEO of a B2B startup):\n\n\n1. There are no overnight successes. Real businesses take time to build. Even technology based ones.\n\n2. Never make business decisions based on promises made by customers.\n\n3. Diversify customer base ASAP. When you are too reliant on a single customer, the fate of your company is too closely tied to them and thus not as resilient.\n\n4. Distribution is more important than the tech itself in the age of AI. Business and sales side is vastly undervalued in the tech startup space.\n\n5. Building is cheaper than ever in the age of AI and so delay selling equity to VC as long as you can. Before VC was seen as the necessary evil to build your business. Now I see it as the necessary evil to scale your business.",
          "score": 1,
          "created_utc": "2026-01-03 06:13:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxkk3x1",
          "author": "Obvious-Grape9012",
          "text": "Stay Agile. Throwing out things for a clean start is always ok, as long as you're improving the way you create your v1.0; Improving your approach and docs so that each wave of AI Coding magic creates a better new release. Focus on repeatability and pipelines rather than fiddling through minor fixes or tweaks. Think in terms of systems. Keep your head up and an eye out for paradigm shifts and major swings. Use resources like [www.mlad.ai/prompts](http://www.mlad.ai/prompts) to explore",
          "score": 1,
          "created_utc": "2026-01-04 04:31:21",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1q23dwy",
      "title": "What's the actual funding process after investors verbally commit?",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1q23dwy/whats_the_actual_funding_process_after_investors/",
      "author": "AnalyticsDepot--CEO",
      "created_utc": "2026-01-02 16:39:07",
      "score": 19,
      "num_comments": 17,
      "upvote_ratio": 0.95,
      "text": "Got a couple of investment demos scheduled for Monday. We have a seed round for $300k-$600k at $10m valuation and already have 2 investors who both want to take the round exclusively. One is a good friend (extremely connected in the Arab world and can help with fundraising), the other is a good client from another business (extremely connected in the influencer world and can help with distribution). \n\nHow do I handle that? Additionally, what is the actual process to formally assign equity etc? Should I look for a fractional CFO? Also is it common to hire people to \"negotiate\" for you? Like I plan to look around for people who have worked similar big deals in the past, and have them negotiate everything.\n\nI've not really told anyone else the product is live. Should I, if it means more valuation? Kinda want to avoid time performing for investors if I can spend it capturing the industry.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1q23dwy/whats_the_actual_funding_process_after_investors/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "nxa4xej",
          "author": "luckytechnique",
          "text": "Nothing is done until money is in the bank. SAFEs the simplest and easiest way for a seed (in my opinion) a formal round is going to cost you $30k-50k depending on the deal. Also a SAFE allows you to handle each investor individually, sign it, collect it and keep grinding. You don’t need a CFO, YC publishes their template you can just use.",
          "score": 14,
          "created_utc": "2026-01-02 16:59:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxa59wp",
              "author": "luckytechnique",
              "text": "Also, don’t push for more valuation if you don’t need it. Each round you’re expected to grow by a lot and it’s a double edge sword. Focus on what dilution you would be okay with and work your way from there.",
              "score": 5,
              "created_utc": "2026-01-02 17:00:37",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nxct230",
                  "author": "Vested_Disinterest",
                  "text": "What they said.\n\nMy only addition is to find a venture law firm that can help you. They know what they are doing (if they are venture-specific), Safe rounds are generally inexpensive, and they can help you navigate securities regulations and any pitfalls you are unaware of. \n\nSource - am a venture attorney",
                  "score": 3,
                  "created_utc": "2026-01-03 00:56:18",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nxdl63d",
          "author": "Stubbby",
          "text": "If you have a seed round for 300k - 600k ask both for 300k, one (or both) will bail. \n\nAlso, \"extremely well connected in the Arab world\" in 99% of cases is total bullshit - I met so many of them and none of them was ever capable of raising a dollar or selling a pen. When I look back at them a few years later they remain \"extremely well connected\" with nothing to show.",
          "score": 7,
          "created_utc": "2026-01-03 03:41:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxa9huc",
          "author": "OldBat9817",
          "text": "Are you a Delaware c-corp?\n\nIf yes go to Carta and from there create a SAFE note and send to them, pretty straightforward. \n\nElse you would do a similar document usually titled investment contract in MENA it's commo if you have a local entity.",
          "score": 3,
          "created_utc": "2026-01-02 17:20:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxbiyzf",
          "author": "Legal_Mango_4736",
          "text": "To me your next move is not to decide what comes next, but to step back and clarify exactly what you want to have happen and exactly what you will and will not agree to. \nThe following notion page is from a system I’m developing that can help. Check it out and ask yourself the questions to get clarity and establish exactly what you want. Let me know if it helps. \n\nhttps://www.notion.so/Theme-Walk-What-Do-I-Want-Beyond-Money-2dcffb34f19a80a6ae0bd3ae160b99ff?source=copy_link",
          "score": 2,
          "created_utc": "2026-01-02 20:55:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxm10pg",
          "author": "Azndomme4subs",
          "text": "Send docs for signing and wire info",
          "score": 1,
          "created_utc": "2026-01-04 11:52:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxo2797",
          "author": "Vivid_Ad2724",
          "text": "Wait for the term sheet. No need for a CFO, carta suffice. \n\nAlso on valuation: A higher valuation isn’t always better, it can make future fundraising harder. That’s because most investors work within a target ownership level and fixed ticket size, which could limit your pool of potential backers.",
          "score": 1,
          "created_utc": "2026-01-04 18:28:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxqkzb2",
          "author": "EasyTangent",
          "text": "YC Safe. Then due diligence (data room, etc.). Then hopefully money in your bank. Nothing is done until money is in your bank. Verbal agreements are broken all the time. Don't play negotiation games AFTER accepting the deal signed.",
          "score": 1,
          "created_utc": "2026-01-05 01:39:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxxeids",
          "author": "simplearms",
          "text": "At this size you don’t need to do much. I’d send them a SAFE.",
          "score": 1,
          "created_utc": "2026-01-06 01:28:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxa5pye",
          "author": "rsandstrom",
          "text": "LOI -> Term sheet -> Offering documents (stock purchase agreement if equity) -> Closing/Funding\n\nYou should have minimal binding terms until definitive agreements. Any investor that tries to jam you with a “binding” LOI, get you to pay for their diligence or getting to a term sheet is a shitty person and you don’t want them in your deal. \n\nIf you want to shop valuation given your fact pattern and identified interest now is the time to do it.  Get a sense of typical ranges of pre and post money valuations from your network to understand how much equity you should be negotiating to give up BUT…\n\nYou need to maximize credibility of investors, support and expertise of the investor eco system over shopping a valuation at a seed stage.\n\nEdit: at this stage you’re probably strapped for cash so paying consultants is most likely not a viable path to getting a deal done. If I recall correctly YC has a form term sheet you can use as a starting point for discussions. You don’t need a CFO to assign equity at this stage unless they are a cofounder that has some skill set important to what you’re building.  \n\nSeed and Series A companies typically are valued on a forward multiple of revenue as you aren’t generating meaningful free cash flows or revenues yet. You should do some homework on valuation methodology and value ranges for your company and that will be a good basis to then seek guidance from a mentor or advisor and allow you to negotiate a deal. \n\nYou should consider having some level of review from a lawyer that has both industry knowledge and expertise in doing early stage deals. This will be a cost worth paying for.",
          "score": 1,
          "created_utc": "2026-01-02 17:02:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxli7r5",
          "author": "Horror-Sundae-9820",
          "text": "I'm 100% sure that neither deal will go through.\n\nPlease update us OP.",
          "score": -1,
          "created_utc": "2026-01-04 09:04:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxltf2p",
              "author": "AnalyticsDepot--CEO",
              "text": "On a scale of 1-10 how miserable are you?\n\nMy biggest skill as a boss, is spotting people with a chip on their shoulder, so their past trauma, doesnt end up costing my teams progress.\n\nI could be wrong, but you sound like you would destroy any team with that lame assessment and are filled with shortcomings.\n\ngl",
              "score": 3,
              "created_utc": "2026-01-04 10:46:11",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1q35ycl",
      "title": "Being technical",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1q35ycl/being_technical/",
      "author": "PsychologicalCry7840",
      "created_utc": "2026-01-03 20:58:54",
      "score": 19,
      "num_comments": 34,
      "upvote_ratio": 0.72,
      "text": "What does it mean to be technical nowadays?\n\nDoes it mean you write your code on your own and rely on ai from time to time when you struggle?\n\nOr is it just prompting ai and reviewing its code and repeating?\n\nIm working on a project right now, and my primary goal is to learn but also be able to ship out a product that people use. \n\nI’m struggling finding that balance between writing the code myself and letting ai handle it for me. How have you guys handled it? ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1q35ycl/being_technical/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "nxid00u",
          "author": "Less-Opportunity-715",
          "text": "I’d say it’s if you take the AI away you can still do the thing",
          "score": 27,
          "created_utc": "2026-01-03 21:23:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxs9zrg",
              "author": "Motor_Ad_1090",
              "text": "This is it. Very simple explanation.",
              "score": 1,
              "created_utc": "2026-01-05 08:25:02",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nxqlwd6",
              "author": "V4UncleRicosVan",
              "text": "Okay. Fast forward 10 years, what do you think the definition will be then? The same? Will anyone fit that definition?",
              "score": 0,
              "created_utc": "2026-01-05 01:44:02",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nxr2nh0",
                  "author": "Academic-Associate91",
                  "text": "If you take away a calculator I can still do math. It’s just more of the same",
                  "score": 6,
                  "created_utc": "2026-01-05 03:13:46",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nxiwetn",
          "author": "maujood",
          "text": "I'll draw an analogy to writing an English novel.\n\nWith AI, a non-English speaker can now write an English novel. However, the novel will be shitty AI slop, and the person doesn't even know it's shitty slop.\n\nA regular English speaker like me can also write a novel with AI. Much faster than I could otherwise. However, it will be full of inconsistencies, plot holes, and the writing will be a dead giveaway that it's AI slop.\n\nA skilled English novelist who's already written novels? They can probably now write 2x faster by using AI as an assistant. Maybe use it to get ideas, suggest alternate composition, help get out of writer's block, etc.\n\nSo to answer your question: the definition of a \"technical\" person hasn't changed, just like the definition of \"novelist\" hasn't changed.",
          "score": 25,
          "created_utc": "2026-01-03 23:00:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxp2akg",
              "author": "Superb_Sea_559",
              "text": "As a software engineer, I fully agree. It works the same way in the software development world too.",
              "score": 4,
              "created_utc": "2026-01-04 21:10:33",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nxrx5lj",
              "author": "stardex_sanket",
              "text": "Love this analogy!",
              "score": 1,
              "created_utc": "2026-01-05 06:30:50",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nxi8xqr",
          "author": "Lupexlol",
          "text": "we're doomed",
          "score": 26,
          "created_utc": "2026-01-03 21:03:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxizxv9",
              "author": "Longjumping_Bid_7463",
              "text": "Halfway thru OPs post I thought the same thing",
              "score": 6,
              "created_utc": "2026-01-03 23:18:43",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nxs28sj",
                  "author": "vespanewbie",
                  "text": "Same here. I'm like oh crap they think vibe coding is actual being \"technical\".",
                  "score": 1,
                  "created_utc": "2026-01-05 07:13:51",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nxqm8ot",
              "author": "V4UncleRicosVan",
              "text": "Since this comment is going unchallenged, I’m going to point out that the root word of technical is techne, which means art, skill, craft, or method.",
              "score": 2,
              "created_utc": "2026-01-05 01:45:47",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nxkz472",
          "author": "AcrobaticSize4714",
          "text": "Being technical now means owning decisions, not keystrokes.  \nAI can write code. Only you can decide architecture, constraints, and correctness.",
          "score": 6,
          "created_utc": "2026-01-04 06:18:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxqmk0j",
              "author": "V4UncleRicosVan",
              "text": "This is the best comment here.",
              "score": 2,
              "created_utc": "2026-01-05 01:47:27",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nxjqtqz",
          "author": "ZemoMemo",
          "text": "you should know how to code.\n\nyou should only use AI to help you code faster. If you're using AI to code something you cannot see yourself doing by yourself, then that isn't being technical",
          "score": 5,
          "created_utc": "2026-01-04 01:42:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxj356m",
          "author": "Choice-Resolution-92",
          "text": "Same definition as always: are you able to build the product of acceptable quality end-to-end yourself without any (human) help",
          "score": 5,
          "created_utc": "2026-01-03 23:35:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxl2xui",
              "author": "SquareKaleidoscope49",
              "text": "I feel like you're needlessly expanding your definitions to time dimension. In which case you can say that everyone is technical because given enough time even a person with no coding background can build something themselves even without AI.\n\nTo me, being technical means being presented with an idea and responding back instantly with a clear high level way on how to build it. This is similar to how a lot of handymen work. After years and years of experience they can come up with a plan on how to build any idea instantly even if they have never done it. Essentially it's being aware of all the little things that go into building something and relating those little things to the bigger concept that you're actually trying to build.",
              "score": 2,
              "created_utc": "2026-01-04 06:49:04",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nxrqpe8",
                  "author": "random_protocol",
                  "text": "It’s this. An unexpectedly well-articulated response.",
                  "score": 1,
                  "created_utc": "2026-01-05 05:40:07",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nxk8f3g",
          "author": "Worth-Mountain4404",
          "text": "I somewhat disagree with this these posts. I learned to code only a couple years before these CLI coding tools - so I don’t have much of my identify wrapped up in it. In general, we are moving higher in abstraction layers. There is very little value in learning syntax and writing detailed code manually. There is a LOT of value in learning best practices in how to create code that is simple, testable and scalable. If you want to see examples on what this means - ask AI! There’s also a lot of value in learning architecture so you can actually ship a product. But don’t waste 2-3 months writing detailed syntax without AI - those days are over and you’ll fall behind.",
          "score": 5,
          "created_utc": "2026-01-04 03:20:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxkqdj6",
              "author": "Lazy-Candidate-5643",
              "text": "AI can't code shit in languages that aren't python from my experience, e.g. MATLAB or even Rust, there are a lot of edge cases AI wasn't explicitly trained to solve, a lot of these are hosting machine specific or application specific that AI will just shit the bed with, not to mention the context window can't handle long on-going projects, no matter how you portion your code and prompts, the results will exponentially get worse as you prompt more and more",
              "score": 0,
              "created_utc": "2026-01-04 05:13:25",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "nxmm54o",
              "author": "ThreePedalsRequired",
              "text": "Try that in C/C++ for edge devices while not violating any OWASP top 10. Good luck!",
              "score": 0,
              "created_utc": "2026-01-04 14:17:34",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nxr5eld",
          "author": "vaanam-dev",
          "text": "Writing code with AI doesn’t make you less technical.\n\nAny moderately complex project will eventually hit bugs that drive you crazy if you can’t trace execution and understand what’s actually happening. AI, at least today, will happily put you into an endless loop of random fixes if you don’t know how to debug.\n\nAlso, coding is only one part of being “technical.” Designing systems, making architectural trade-offs, setting up infrastructure, operating it, and scaling it are massive technical challenges.\n\nYou need to be technical enough to make decisions, understand and debug AI-generated code, and own the system end-to-end. AI is a tool, not a replacement for that responsibility.",
          "score": 2,
          "created_utc": "2026-01-05 03:29:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxv1p4p",
          "author": "Available_Doughnut71",
          "text": "Writing code using syntax is really not technical.\nBut if you can design systems, schemas, workflow, architectures and use AI as a junior developer to write syntax. I would argue you are more technical than a coder.\n\nAI has changed the programming language to English, which I guess is not something many coders want to accept.\n\nBy 2027, if you think writing syntax is technical you will be in for a rude shock.\n\nAbout me: I learnt coding in C++. I don't like to write code in the current or any syntax for that matter. But I can design systems. Does that make my non-technical simply because I hate syntax?\n\nSkills you need are problem solving, creative thinking,  systems thinking to be technical. Not be a machine which converts logic into syntax.",
          "score": 2,
          "created_utc": "2026-01-05 18:35:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxluoh4",
          "author": "Donut-Disastrous",
          "text": "It means having knowledge of systems, data structures and being able to pick the correct components/technologies for your application through experience/education/knowledge. As well as having a view on where the field is and where it is going. This may sound trivial: \"I need a database for my webapp to track signups\", but very quickly becomes non-trivial when your application needs to \"store relationships between users and their post interactions\" and then deliver them to customers in a fast way that optimizes users see relevant content.  \n  \nIts OK to use AI, in fact I encourage it. But the reality is without the fundamental understanding, you don't know if your answer is correct, optimal or pure AI slop.",
          "score": 1,
          "created_utc": "2026-01-04 10:57:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxlv2sd",
          "author": "jasfi",
          "text": "Can you take on responsibility for the technical side of things? You're going to struggle, or just not make it, if you're nearly fully reliant on AI.",
          "score": 1,
          "created_utc": "2026-01-04 11:00:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxpuhda",
          "author": "Just_JC",
          "text": "Being technical means having a lot of intuition (or specific knowledge like Naval would say) in a technical domain, or around a specific technology.  \n  \nThese domains usually need a lot of sunken cost to master (e.g. the endless resources spent on writing and debugging hardware or software).  \n  \nHowever it's harder to sell if AI can do it better without you. If it can't then your skill is valuable enough to get hard things done, which is all you need to worry about. Of course, you can always use AI to scale your technical output.",
          "score": 1,
          "created_utc": "2026-01-04 23:24:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxqqpdv",
          "author": "KevinPamplona",
          "text": "I think the definition, at least today, is that you know how to code and you understand what’s actually happening - how systems work in production, debugging, architecture tradeoffs, etc. AI becomes a multiplier on that foundation, not a replacement for it. If you can’t evaluate whether the code AI generates is good, you’re just accumulating tech debt faster.\n\n🤖 Generated with Claude Code /s",
          "score": 1,
          "created_utc": "2026-01-05 02:09:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxru5iw",
          "author": "Itchy-Development627",
          "text": "technical means you are capable of running tech. Can you prompt and run a business? Then you are technical. But you can‘t (yet). Everything else is splitting hair :)",
          "score": 1,
          "created_utc": "2026-01-05 06:06:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxrxfgm",
          "author": "stardex_sanket",
          "text": "With the current AI capabilities, being technical to me is about having the patience to review the work deeply across different parts of the stack. More importantly knowing when to review the work, and when to trust AI would have it better than you.",
          "score": 1,
          "created_utc": "2026-01-05 06:33:08",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pxz3xa",
      "title": "Founders: if you found a problem to solve, how do you find potential customers to interview ?",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1pxz3xa/founders_if_you_found_a_problem_to_solve_how_do/",
      "author": "Electrical-Toe-7097",
      "created_utc": "2025-12-28 18:51:22",
      "score": 17,
      "num_comments": 24,
      "upvote_ratio": 0.84,
      "text": "Basically the title.\n\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1pxz3xa/founders_if_you_found_a_problem_to_solve_how_do/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "nwesy9n",
          "author": "outceptionator",
          "text": "How do you know it's a problem without knowing anyone in the space? \n\nWarm intros then cold outreach seems like your best options.",
          "score": 24,
          "created_utc": "2025-12-28 19:13:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwet58y",
              "author": "Electrical-Toe-7097",
              "text": "Maybe because I experience the problem myself but wanted to validate by finding users experiencing the same.\n\nLatter part makes sense!",
              "score": 5,
              "created_utc": "2025-12-28 19:14:24",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwq2nok",
                  "author": "Moist_Cardiologist83",
                  "text": "I think you got the first part: having a hypothesis about a problem. Now it’s time to make sure how massive the problem is, or in other words, how many people are suffering it and if/how many of them would be willing to pay for it.\n\nI’d recommend defining who your ideal customer is and then double down on who you think your early adopters could be. As the other response said, intros, could outreach could give you a head start. \n\nSometimes validating among friends or peers may not be the best, as you may find some biases.",
                  "score": 1,
                  "created_utc": "2025-12-30 13:04:37",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwevxme",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 7,
          "created_utc": "2025-12-28 19:27:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwew3n2",
              "author": "Electrical-Toe-7097",
              "text": "I like your marketing",
              "score": 4,
              "created_utc": "2025-12-28 19:28:26",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nweze8v",
          "author": "puddle-shitter",
          "text": "found someone complaining about the problem im solving on twitter. dm'd them, and realized most people with the same job as this person faced similar problems, and although this initial user churned away, it gave me the perspective for the kind of people I could reach out to for getting more users. Its a slow process, you'll reach many points where you might think no one wants to use your product, but you will find someone. And the easiest way to test whether or not this problem space will have users is if you're building for yourself.",
          "score": 6,
          "created_utc": "2025-12-28 19:44:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwh1ank",
          "author": "SystemicCharles",
          "text": "Honestly, I think it’s a bad idea to “find a problem”. There are so many nuances that go into solving a problem and providing a solution that people will want to pay for. You either have the problem yourself and understand it, have someone on your team that already understands the problem, or spend time living with and obsessing over the problem yourself before and during the time you’re conducting interviews.",
          "score": 2,
          "created_utc": "2025-12-29 02:09:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwiswp4",
              "author": "reddit_user_100",
              "text": "Lenny interviewed a bunch of B2B founders and found 60% of them did not solve their own problem: [https://www.lennysnewsletter.com/p/how-the-most-successful-b2b-startups](https://www.lennysnewsletter.com/p/how-the-most-successful-b2b-startups)",
              "score": 2,
              "created_utc": "2025-12-29 10:05:12",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nwj0lqg",
                  "author": "SystemicCharles",
                  "text": "Uhh. Yeah. Most people do not care about solving their own problems. What about the 40%?",
                  "score": 1,
                  "created_utc": "2025-12-29 11:15:13",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwgnn84",
          "author": "Content-Ebb-4761",
          "text": "Over LinkedIn",
          "score": 1,
          "created_utc": "2025-12-29 00:50:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwkqwp2",
          "author": "Glittering-Fig-9252",
          "text": "I just created this [GPT](https://chatgpt.com/g/g-69529a982258819188582ebcbf4aeea6-before-you-pitch) that’s meant to help find their target customers on and offline.",
          "score": 1,
          "created_utc": "2025-12-29 17:18:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwksiqv",
              "author": "Wide_Brief3025",
              "text": "I’ve found it super useful to hang out in relevant subreddits and read conversations to spot what people are actually struggling with. Joining the discussion often leads to great insights and sometimes even DM conversations. If you want to streamline finding these conversations and filter leads efficiently, ParseStream can help by alerting you to posts mentioning your keywords.",
              "score": 1,
              "created_utc": "2025-12-29 17:26:23",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nwktvd2",
                  "author": "Electrical-Toe-7097",
                  "text": "bro your marketing strategy needs to improve",
                  "score": 3,
                  "created_utc": "2025-12-29 17:32:50",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            },
            {
              "id": "nx3conf",
              "author": "ExcitingWear4813",
              "text": "Thanks man, this is helpful. Also does this gpt go away with an update.....I had a similar one for another purposes but it went away with an update. ",
              "score": 1,
              "created_utc": "2026-01-01 15:45:52",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nworu1f",
          "author": "aviboy2006",
          "text": "Keeping eye on where is problem exist and checking out way to connect with those users have casual chat. recently i did couple of chat with users ( future potential users ) while traveling back to India. This gave me interesting insights.",
          "score": 1,
          "created_utc": "2025-12-30 06:18:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwpf66b",
          "author": "BusinessStrategist",
          "text": "If you’re a practitioner of the « gemba walk, » your hearing is tuned to the low level moaning and groaning of chronic pain.",
          "score": 1,
          "created_utc": "2025-12-30 09:50:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwvu2vy",
          "author": "Ok_Face_2942",
          "text": "Wynter, sure there are also other”focus group” type platforms out there where u can directly chat with your ICP to validate pain points.",
          "score": 1,
          "created_utc": "2025-12-31 08:31:25",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1py19pt",
      "title": "As the year wraps up - what  books did you read this year that had the biggest impact on your entrepreneurial journey?",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1py19pt/as_the_year_wraps_up_what_books_did_you_read_this/",
      "author": "Electrical-Toe-7097",
      "created_utc": "2025-12-28 20:16:34",
      "score": 15,
      "num_comments": 13,
      "upvote_ratio": 0.91,
      "text": "As the title says.\n\nMy one has been The Mom Test! I learnt how to talk to people :)",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1py19pt/as_the_year_wraps_up_what_books_did_you_read_this/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "nwfbpxo",
          "author": "hellno-o",
          "text": "read some biographies that impacted me: Estee Lauder,Enzo Ferrari, Walt Disney, Akio Morita, Michael Dell\n\nmany inspired by founderspodcast.com",
          "score": 6,
          "created_utc": "2025-12-28 20:44:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwhl1ra",
          "author": "sheriffly",
          "text": "I'm yet to finish the mom test, it's half finished. Hope to complete it soon.",
          "score": 3,
          "created_utc": "2025-12-29 04:05:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwhvajw",
          "author": "No-Put450",
          "text": "Ai for engineering",
          "score": 2,
          "created_utc": "2025-12-29 05:11:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwm7phg",
          "author": "hellomrjorge",
          "text": "Zero to One and The Lean Startup",
          "score": 2,
          "created_utc": "2025-12-29 21:29:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwm93pf",
              "author": "m_yoda20",
              "text": "Read those books ages ago. I wonder if you still found them relevant today. Would you make a case that too much has changed for these to be relevant?",
              "score": 1,
              "created_utc": "2025-12-29 21:36:28",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nwmaiuj",
                  "author": "hellomrjorge",
                  "text": "Most definitely! It helped me narrow my focus on the product I am looking to build, understand if it's truly an iteration or zero to one type of product and to keep me from building a technical masterpiece that nobody actually wants to pay for.",
                  "score": 1,
                  "created_utc": "2025-12-29 21:43:24",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwntv2e",
          "author": "Critical-Pudding6740",
          "text": "The Mom Test as well! But what I realized that is I have to read it again and again. Read it the first time, go have some customer interviews, come back to analyze the call scripts to reflect if I'm asking good questions, read the book (parts of it) again, and keep doing so.\n\n  \nTruth seeking is so important in becoming an entrepreneur.",
          "score": 2,
          "created_utc": "2025-12-30 02:40:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwodi2f",
          "author": "ArgumentOk3359",
          "text": "\"Make Time\" is really really good!!",
          "score": 2,
          "created_utc": "2025-12-30 04:35:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwj33dd",
          "author": "PuddyComb",
          "text": "The Cosmic Serpent last month. It was a bit of a slog- but it showed me that there is no real money in chemistry and the 'bio-medical struggle'.  \nA scientist travels to the Amazon and tries Ayahuasca, and his DMT journey enlightens him on the formation of DNA and it is all loosely tied together. But \\[entrepreneurial journey\\]; it is anything but. Despite what lies Joe Rogan may spout at you. Genetics Research, and Pharmacokinetics is too broad a spectrum of realistic scientific study to be reduced to podcast material.",
          "score": 1,
          "created_utc": "2025-12-29 11:37:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwou1zc",
          "author": "aviboy2006",
          "text": "Steve Job biography.",
          "score": 1,
          "created_utc": "2025-12-30 06:37:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx8rl1g",
          "author": "AdministrativeArt621",
          "text": "A practical digest book that summarizes dozens of books about entrepreneurship: \n\nMillion Dollar Weekend: The Surprisingly Simple Way to Launch a 7-Figure Business in 48 Hours\nBook by Noah Kagan",
          "score": 1,
          "created_utc": "2026-01-02 12:27:12",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1q4gok7",
      "title": "Is this a startup?",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1q4gok7/is_this_a_startup/",
      "author": "More-Occasion824",
      "created_utc": "2026-01-05 08:51:57",
      "score": 12,
      "num_comments": 12,
      "upvote_ratio": 0.94,
      "text": "I’m automating tasks in the construction industry. Right now, we’re about 1% into the journey, starting with my own construction business and 10 others.\nOur North Star is to automate 100% of the business. Today, humans handle the remaining 99%, but our goal is to reach 50% automation within six months.\nHere’s the part that made me pause:\nanother successful founder I respect asked me, “Is this even a startup, or just a business idea?”\nSo I’m genuinely curious what others think.\nDoes a startup have to be software-first from day one?\nOr can it start with humans + ops, then automate aggressively over time?\nAt what point does something cross the line from “business” to “startup”?\nKeen to hear honest takes.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1q4gok7/is_this_a_startup/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "nxsfwy4",
          "author": "realbrownsugar",
          "text": "When you say \"we are about 1% into the journey\", who is we and what is the commitment level of the 10 or so construction folks, and what have you collectively achieved so far?\n\nI don't think you cross from a \"business\" to a \"startup\" as startups are just baby businesses with presumably huge potential for growth. But if you are wondering \"business idea\" vs. \"startup\", then the question becomes much simpler.\n\nAre you still talking about it, or are you executing on it?",
          "score": 5,
          "created_utc": "2026-01-05 09:21:26",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxsg91q",
              "author": "More-Occasion824",
              "text": "“We” is me and my technical co-founder, we just shut down our last idea we were working on after 5 years to pivot to this. The other company’s are already paying us to do the work and as we automate the human output will be replaced by AI.",
              "score": 3,
              "created_utc": "2026-01-05 09:24:40",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nxsddjp",
          "author": "Purple-Hat-8753",
          "text": "Depends on you, If you are making something new which doesn't exists then it's called startups and if the things already exists and you just using them to automate the construction industry then it is called business.\nThis is what I think, If I'm wrong please share your thoughts.",
          "score": 2,
          "created_utc": "2026-01-05 08:57:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxsfizo",
              "author": "Turbulent-Leg3774",
              "text": "To me startup is a larger scale than business and can scale quick. \n\nTo me a startup is something investors would be interested in equity in because the startup could potentially 100x the capital in a few years. Business growth is slower while startups can grow incredibly quick is my definition",
              "score": 3,
              "created_utc": "2026-01-05 09:17:42",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nxswsb5",
          "author": "CoolSnow01",
          "text": "- Business idea: It's just an idea, self explanatory.\n- Startup: You gather with others to try to 1) find a gap in the market and 2) come up with a way to fulfill it that is profitable in the long term.\n\n\nIn a way, startups are basically a group of people who say \"we are gonna try to find a business case that works for us in the next X months\". But it lives in the execution world, not in the ideas one.",
          "score": 1,
          "created_utc": "2026-01-05 11:49:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxtsooo",
          "author": "Sketaverse",
          "text": "Job loss, what job loss?! 🤣",
          "score": 1,
          "created_utc": "2026-01-05 15:06:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxtys3z",
          "author": "Tall-Log-1955",
          "text": "Ignore people who gatekeep the word \"startup\".  Yes its a startup.",
          "score": 1,
          "created_utc": "2026-01-05 15:36:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxwc87c",
              "author": "More-Occasion824",
              "text": "Needed this!!!! 😉",
              "score": 1,
              "created_utc": "2026-01-05 22:10:30",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nxvics8",
          "author": "WiseHalmon",
          "text": "A startup is people working on an idea.",
          "score": 1,
          "created_utc": "2026-01-05 19:51:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxwc9k1",
              "author": "More-Occasion824",
              "text": "Thank you!!!!",
              "score": 1,
              "created_utc": "2026-01-05 22:10:41",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nxwcxvf",
          "author": "Koguruy",
          "text": "A startup is a “business idea” that you are trying to innovate with a product that nobody has ever tried (that’s why usually you have to raise money, because you are trying to change the world)\n\nA Bussines idea is when based on something that already exists, you work your way out of it",
          "score": 1,
          "created_utc": "2026-01-05 22:13:58",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1q50ko5",
      "title": "How to create luck?",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1q50ko5/how_to_create_luck/",
      "author": "Miyamoto_Musashi_x",
      "created_utc": "2026-01-05 22:38:56",
      "score": 10,
      "num_comments": 11,
      "upvote_ratio": 0.82,
      "text": "A few days ago, I asked in a post about the most important lessons people learned during 2025, and one of the answers was “manufacturing luck.” I’ve been thinking a lot about that idea, because luck is one of the most critical, and at the same time most “mystical”, variables in business. Why do some people manage to generate massive results while others never do, even when the effort seems to be the same?\n\nI’d like to go deeper into this and understand what perspectives or frameworks exist around this idea.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1q50ko5/how_to_create_luck/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "nxwklbi",
          "author": "canadianseaman",
          "text": "Shots * skill * luck = goals\n\nIncrease one to increase goals. Luck just seems like one of those things you can't change.",
          "score": 6,
          "created_utc": "2026-01-05 22:51:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxwtd7g",
              "author": "realbrownsugar",
              "text": "Another way of framing luck is \"probability of successful outcomes\". Shots and skill are deterministic. Luck is probabilistic... but its not a uniform probability distribution function.\n\nFor example, there is a reason why they require YC class to move to SF Bay Area. You increase your probability of finding your next idea, next round of funding, next customer, etc. It's still not a guarantee, but you can manufacture your luck.\n\nOf course, you can counteract a shitty luck situation by increasing the number of shots you take and improving your understanding of the market.",
              "score": 3,
              "created_utc": "2026-01-05 23:37:23",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nxxiwra",
                  "author": "ArgumentOk3359",
                  "text": "yeah, the usual way to manufacture luck is to just do more things, in visibility of those that can help you.\n\ncan be going out to events, posting more, etc.\n\nthat's why SF is golden - more often than not the people that will understand you the most and most likely to help you are in the area. easier said than done though.",
                  "score": 1,
                  "created_utc": "2026-01-06 01:52:31",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nxwn8f2",
          "author": "Just_Oil_2162",
          "text": "I think to manufacture luck, you want to create a large surface area for luck to happen. If you get lucky 5 percent of the time and u take 20 shots, u get lucky once. However if you try 100 times, you’ll get it 5 times. \n\nSo volume correlates with luck.\n\nHappy new year, go create luck for yourself :)",
          "score": 5,
          "created_utc": "2026-01-05 23:05:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxwut7w",
          "author": "Uncle_Richard98",
          "text": "The more you expose yourself to different people, situations, specific events or locations the bigger is the chance of you getting lucky. \n\nThat’s why you should never only stay at your house / room all the time, cause luck will unlikely to be produced like that. Go outside, go to that event you hate, go put yourself in so many different situations and scenarios and  meet so many people increasing your chances of getting lucky",
          "score": 4,
          "created_utc": "2026-01-05 23:45:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxwxiyp",
          "author": "Merriweather94",
          "text": "Post about your work, DM people you admire, reply to their posts, ask for referrals, host dinners, go to parties, check up on people, etc.",
          "score": 3,
          "created_utc": "2026-01-05 23:59:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxxd973",
          "author": "Verusauxilium",
          "text": "Opportunities are luck based, but you need to be skilled and experienced to spot them and take advantage.",
          "score": 3,
          "created_utc": "2026-01-06 01:22:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxx5hm3",
          "author": "Less-Opportunity-715",
          "text": "You’re already lucky to be thinking of founding right now.  Those in 2050 will call all of us lucky.",
          "score": 1,
          "created_utc": "2026-01-06 00:40:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxx7bjk",
          "author": "Walt925837",
          "text": "You don't know the destiny of your own idea.",
          "score": 1,
          "created_utc": "2026-01-06 00:50:15",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pxr6rl",
      "title": "Founders - can I replace customer interview meetings with text based approaches like emailing and private messages?",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1pxr6rl/founders_can_i_replace_customer_interview/",
      "author": "Ok_Corgi8008",
      "created_utc": "2025-12-28 13:20:06",
      "score": 9,
      "num_comments": 28,
      "upvote_ratio": 0.85,
      "text": "I’ve read a few books and they’ve emphasised doing customer interviews via coffee chats, video calls, meetings but the books are quite old.\n\nBut can I still get the same results by emailing people, Reddit DMs, blog comments and avoiding the 1to1 meetings completely ? ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1pxr6rl/founders_can_i_replace_customer_interview/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "nwd0k1u",
          "author": "gruffbear212",
          "text": "Sort answer: no. \n\nReason is because you don’t know what you don’t know. So you don’t know what to ask them in a message, and you need to have a conversation to see where it goes and what it unfolds. \n\nRead Running Lean by Ash Mayura. \n\nThis is not the part to skip on or get wrong btw, because you probably won’t realise until you’re 18 months or a fair chunk of cash lighter that you’ve miss read the demand. There is no fix for there not being demand except starting again.",
          "score": 17,
          "created_utc": "2025-12-28 13:38:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwd1yq8",
          "author": "AbstractHikingTrail",
          "text": "No. I'm sure the books you read emphasize that the point of the in-person interviews and customer development are to identify unsolved pain. The way to do this is through open-ended questions. Normally when you send out text-based surveys you give multiple choice options. What this means is that this method would typically be used to validate or invalidate a hypothesis. This can be useful when focusing on questions that validate a direction like technical fit but not to validate whether your startup idea will be successful.",
          "score": 6,
          "created_utc": "2025-12-28 13:47:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwd6x69",
          "author": "WebImpressive3261",
          "text": "No. There’s no way to get into the depth you need over comments and emails.",
          "score": 5,
          "created_utc": "2025-12-28 14:19:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwd2sew",
          "author": "rrrx3",
          "text": "Lmao. No. Don’t be lazy.",
          "score": 7,
          "created_utc": "2025-12-28 13:53:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwdp5lh",
              "author": "kadam_ss",
              "text": "Exactly.\n\nIf you don’t get why “those books” recommend it and you are doing it because they tell you to, you are ngmi",
              "score": 1,
              "created_utc": "2025-12-28 16:01:00",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nwdkadb",
          "author": "Longjumping_Ant_6991",
          "text": "The approach we took is that we interviewed 100 ppl in-person first. This help us tremendously to iterate the product and figure out what problems we are solving. The benefit of doing this in-person is that you can read their body language and get much more information from the person you are interviewing. Helps you move a lot faster.\n\nNow that being said, this is not scalable. Eventually you gonna feel like you tap out on the information you are getting. At this point, targeted and shorter surveys or questions digitially works great. But without the in-person interviews, it would have been difficult to know what to really ask.",
          "score": 3,
          "created_utc": "2025-12-28 15:35:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwczju5",
          "author": "Uncle_Richard98",
          "text": "Try it and see how it goes. \n\nThere’s a reason “old school” methods still works. Humans are social animals. We trust much more in each other if we meet people in person or talk with them face to face (by video calls) than just emails or private messages which is very robotic. You’re trying to implement a tech solution for a thing that is a social / human feature.",
          "score": 2,
          "created_utc": "2025-12-28 13:31:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwczqdb",
              "author": "Ok_Corgi8008",
              "text": "Makes sense. \n\nAny tips on how to get more social, the idea of meeting people I never know and try sell them something seems too scary to me",
              "score": 1,
              "created_utc": "2025-12-28 13:33:09",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwd0aog",
                  "author": "Uncle_Richard98",
                  "text": "You don’t try to sell them things, you have to establish a connection first. Go to social events where you know this certain profile of people will be there and try to make connections or be part of online communities who organise online events. \n\nAnd when you make a connection avoid at all costs trying to “sell” something , don’t even mention you’re trying to build something. Make questions about a specific problem you’re trying to solve but without sounding you’re a scammer trying to sell a device. There’s a book called “The Mom Test” that explains exactly what founders should do when talking with possible new customers or try to validate the idea.",
                  "score": 3,
                  "created_utc": "2025-12-28 13:36:54",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "nweqptm",
                  "author": "Electronic_Wear3103",
                  "text": "I can resonate with this feeling. While I know there is no equal alternative to meeting people personally and getting to know them & their pain points in a specific domain, leaning to know how they are solving that problem if at all they are solving it!   \n  \nHowever, since I am not a natural storyteller or a great speaker, I ended up with lot of awkward silences and whenever I was there with best of my energies, I realised that many times, people don't say exactly what they mean and often times they also don't know what they actually want. But over time I realised this is part of the process to go through, and I am trying to learn this and genuinely trying to connect with them without selling them anything. \n\nSince I was also serving other clients for their own products, I realised everyone needed a tool that can help them validate their idea / product. And what's even more exciting here is that you can do customer interview meetings and talk to your potential customers easily via AI customer persona. (Sorry to shamelessly plug this here, but this couldn't be more related than what I have gone through before). I still believe there is nothing better than talking to people personally and in real life but the next best things could be [launchcheck.me](http://launchcheck.me) \n\nThis is free to use and not only you can validate your idea in detail but also talk to you AI customer persona (which you will be amazed about as you won't be able to differentiate if its a human or an AI customer). It gives you a blunt truth about your idea and no biased thoughts. While this tool is still in progress but phase 1 is still meaningful and usable. \n\nLet me know if this helps you in some way and if you have any feedback for me.",
                  "score": 1,
                  "created_utc": "2025-12-28 19:03:12",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwdwkwv",
          "author": "Ahmad_Azari",
          "text": "No and Ill explain why.\n\nCustomers would typically do the survery if they have one of two\n1) loyalty to the company in service\n2) loyalty to sales rep/contact at the company in service.\n\n\nSince you are a start up founder, you probably (definitely) dont have that strong brand for loyalty customers. You need your customers to remember your face/name/voice/attitude as much as possible for them to help you on your journey. \n\nRight now, as a founder, honestly dont see your clients as clients but rather as partners in your success journey. The time you dedicate to them, is arguably more important than building because the last thing you want is to built the wrong thing.",
          "score": 2,
          "created_utc": "2025-12-28 16:38:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwditum",
          "author": "Tall-Log-1955",
          "text": "No",
          "score": 1,
          "created_utc": "2025-12-28 15:28:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwduvpk",
          "author": "ToddFromLeon",
          "text": "Hard no. Match the medium to the importance of the task. There’s nothing more important than talking to customers, so there’s no way you should leave it to a medium that is asynchronous, lacks tone, lacks non-verbal comms, etc.",
          "score": 1,
          "created_utc": "2025-12-28 16:29:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwe7gc5",
          "author": "Golandia",
          "text": "It depends on your ICP. You can get data from consumer level customers this way. Enterprise customers will even respond to these. Typically this is done survey style because people won’t write you an essay. E.g. you want to learn what beers people drink, how often, etc, within your ICP because you have an idea for a new beer. \n\nYou will also only learn what you ask about. When you interview people, you have the opportunity to shape the interview and learn new information faster. E.g. you can give people your beta beers to taste, learn more about when and why they drink beer, if they don’t, what do they drink and why, etc. It’s a lot more data from that specific potential customer. ",
          "score": 1,
          "created_utc": "2025-12-28 17:32:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nweq5dk",
          "author": "the_chan",
          "text": "Here’s YC’s playbook on talking to customers and why. https://youtu.be/z1iF1c8w5Lg",
          "score": 1,
          "created_utc": "2025-12-28 19:00:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwhu1mc",
          "author": "dipeshsukhani",
          "text": "Sadly No.  Doing user interviews is critical.  In fact, doing these interviews yourself (I am assuming you are the founder) is equally critical.  More so in 2025, it is your \"personal\" brand which has a major influence / impact.  In-fact there is a term: \"Founder Led Growth\", just to highlight how much critical it is for the \"Founders\" to have a personal relationship with users and that comes most effectively through in-person user-interviews (VoIPs / Online Meets are a good second position)",
          "score": 1,
          "created_utc": "2025-12-29 05:02:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwidvfp",
          "author": "Crafty-Sea-134",
          "text": "You can. The important thing is not the form, but the way. I have a customer who drinks cappuccino in the sf cafe and chats with him, and another one is completely typing because of the time difference.",
          "score": 1,
          "created_utc": "2025-12-29 07:44:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwkr5qf",
          "author": "Glittering-Fig-9252",
          "text": "You might find this [GPT](https://chatgpt.com/g/g-69529a982258819188582ebcbf4aeea6-before-you-pitch) helpful, it helps you find and prepare for IRL customer convos.",
          "score": 1,
          "created_utc": "2025-12-29 17:19:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwlg8il",
          "author": "Head_Car_2922",
          "text": "No, show up, make the cold calls, get rejected. Conversations generate 1000x more information than texting. I am not filling out a survey, I will have a cup of coffee.",
          "score": 1,
          "created_utc": "2025-12-29 19:16:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwp9oe6",
          "author": "ImprovementSad8560",
          "text": "you can´t dm people for stuff they don´t understand themselves. Unfortunately it´s really hard and you have to input the effort.",
          "score": 1,
          "created_utc": "2025-12-30 08:58:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwrw5xy",
          "author": "_dremnik",
          "text": "big no. you have to talk to people, there's just no substitute for seeing their live reaction and also establishing a bond with them.",
          "score": 1,
          "created_utc": "2025-12-30 18:34:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwvhhiy",
          "author": "VVVVV218-",
          "text": "do you need customer interview meetings when applying?",
          "score": 1,
          "created_utc": "2025-12-31 06:37:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwvjns5",
              "author": "FingerConfident1788",
              "text": "I agree",
              "score": 1,
              "created_utc": "2025-12-31 06:55:37",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nx1ly1n",
          "author": "drakondev",
          "text": "...the facial expression alone tells you alot of the pain point a customer has faced/is facing. You will never be able to experience & analyse this in an email/text message, especially with most people replying using AI.",
          "score": 1,
          "created_utc": "2026-01-01 06:35:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxbr4kv",
          "author": "Plenty_Object_4826",
          "text": "if you are a founder, there is no way around it, your entire job is always going to be talking to customers... for years. you will not close 7-8 figure contracts via email only comms. and you will not find your first customer via email only comms. email only comms is transactional and you will not get the feedback that you need to succeed. prioritize 8am-5pm for things that can only happen between 8am-5pm which in my mind is external facing calls. Take internal calls with executives and freelancers on the evenings and weekends. focus.",
          "score": 1,
          "created_utc": "2026-01-02 21:35:04",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pyj0uo",
      "title": "Anyone launch a business while being a new parent?",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1pyj0uo/anyone_launch_a_business_while_being_a_new_parent/",
      "author": "LeftieLondoner",
      "created_utc": "2025-12-29 10:32:21",
      "score": 9,
      "num_comments": 14,
      "upvote_ratio": 0.84,
      "text": "I'm planning to launch a business in few months while also managing a 1 year old with my partner. He goes to nursery during term times so only find weekends tough. Anyone else successfully running a business with young kids? Any tips on time management? Did it help to have co-founders? I am on non technical side and its a saas business.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1pyj0uo/anyone_launch_a_business_while_being_a_new_parent/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "nwo63tm",
          "author": "Consistent-Wafer7325",
          "text": "2 kids (4yo,4mo) here, we got the 2nd one as I’m building my new company since 18mo, we raised about 12m$ in pre-seed + seed. Things moving fast. \n\nIt’s clearly a challenge (sleep organization essentially and lack of free time), but nothing impossible. \n\nMy 2 cents : \n\n- make clear with your partner that you’re an early stage entrepreneur (you cannot just “stepback” for a few months in your 9to5 job) \n\n- You need help (partner, family,…) and take as maximum as you can. Budget babysitters if needed you’ll see quickly the payback \n\n- Make also clear to yourself that you need a bit of free time, like sports or whatever. Work + parenting is intense, you need cooloff time for you.",
          "score": 4,
          "created_utc": "2025-12-30 03:50:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwthunn",
              "author": "LeftieLondoner",
              "text": "First of all congrats on the kids and the funding. This is helpful. Its my first startup after holding down corporate job for 12 years. And I definitely don't have the luxury of funding so need to put the hours in so we can raise after launch. Will seek extra help with childcare. Currently i work 8am to 5pm, then 7pm to 10pm during the week. On weekends, i work most evenings. Hopefully i can squeeze in sports once things settle.",
              "score": 1,
              "created_utc": "2025-12-30 23:13:26",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwv28a2",
                  "author": "Consistent-Wafer7325",
                  "text": "Fundraising or not, things are the same, even more hustling planned after fundraising haha 🤣 \n\nGodspeed",
                  "score": 1,
                  "created_utc": "2025-12-31 04:43:13",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwqg6qz",
          "author": "DecadeJourneyLoL",
          "text": "No kids, but I may be able to help?  \nDon’t underestimate the power of **batching** tasks. I batch all my cooking, all my routine tasks and do them all during the weekend.  \nhaving a co-founder can really ease the burden. If you can share the workload, it makes all the difference.",
          "score": 2,
          "created_utc": "2025-12-30 14:24:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "nwti5zu",
              "author": "LeftieLondoner",
              "text": "Luckily i have cofounder. I need to get back to batch cooking.",
              "score": 2,
              "created_utc": "2025-12-30 23:15:07",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nwukp8g",
                  "author": "Less-Opportunity-715",
                  "text": "DoorDash solves this",
                  "score": 0,
                  "created_utc": "2025-12-31 02:52:41",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nwt598q",
          "author": "realbrownsugar",
          "text": "I was working on my startup pre-revenue and pre-funding. 1 year in, we had a baby. The first 4 months were hell until you sleep train your baby. \nBased on the luck of your draw, your baby might give you all the free time albeit sharded , or require a lot of attention as in our case where she didn’t latch well and had to be tube fed.\n\nTwo months in, it was clear to me I had to let go of my business child and prioritize human child’s future. A month later I was working at another YC startup. It was pretty intense for the first 6 months burning out both at home and at work. Then I joined Meta for a slower pace in life (Meta is supposedly intense… BS). It’s been over a year at Meta and having no regrets except for the boring mundane corporate BS work.\n\nOTOH, one of my friends had a baby 2 years in post seed raise and pmf. He just had his second child and company has a 2B valuation.\n\nBasically, you will have to make a hard decision, but you can’t make it until you know your babies and personal financial needs. Take at least 4 weeks of paternity (even from your own startup) and reassess your situation honestly.",
          "score": 2,
          "created_utc": "2025-12-30 22:08:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx241ju",
          "author": "Four_sharks",
          "text": "Yep and I am not having a good time ",
          "score": 2,
          "created_utc": "2026-01-01 09:42:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nx347va",
          "author": "somuchblood",
          "text": "I have 3 kids under 5yo and I’m the sole earner running a venture backed startup. \n\nMy wife stays home full time to take care of them. I work long hours, but I still make sure I eat dinner with them every day and be present when I’m with them. \n\nIn the end, there’s no avoiding the fact that you working long hours = your spouse also working long hours with the kid. \n\nEnsure you keep your spouse in a good mental space. Pay for a babysitter and get some 1:1 time together. Have fun with them (don’t be a zombie after a long work day). Bring the energy when you arrive at home and boost everyone’s spirits.",
          "score": 2,
          "created_utc": "2026-01-01 14:56:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwkscr0",
          "author": "RecognitionLivid6472",
          "text": "I had a lot of free time when my kid was born. I was lucky, she was a good sleeper and babies do sleep 16-12 hours at the beginning. It was way more challenging when she reached 2-3 years and dropped the midday nap. But depends on the baby, some are not so good sleepers, have tummy pain, up all night, etc. Also depends on your support system, if family members or others are available to babysit here and there. But I think it's much easier than managing a kid while having a 9-to-5 job.",
          "score": 2,
          "created_utc": "2025-12-29 17:25:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxkd1u5",
          "author": "bldrPR",
          "text": "I'm non technical as well. I launched a venture-backed startup pregnant w/ my 3rd child, as 1st child was going through recovery from chemo/bone marrow transplant. Also did AWS Accelerator and Techstars when baby #3 was under 1yo while pumping. It was tough, but it was also temporary. Having reliable childcare is a must, as is a predicatable schedule b/c you'll need to get what you can get done in the time you're given. One of my closest founder friends who did Techstars with me was also nursing/pumping and it was amazing to have someone in the same stage as me. We'd both get up at 4am to get 2 hours in, get the kids off to school, be back online by 9am, then offline by 4:30pm for dinner/bedtime, then back online at 9pm. As a working parent (and even more as a working mom), you become hyper focused on what's most important, work efficiently and just do your best.",
          "score": 1,
          "created_utc": "2026-01-04 03:47:16",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1q4mxve",
      "title": "Founders: What was the first role you outsourced, and why?",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1q4mxve/founders_what_was_the_first_role_you_outsourced/",
      "author": "Willing-Training1020",
      "created_utc": "2026-01-05 14:22:18",
      "score": 9,
      "num_comments": 4,
      "upvote_ratio": 1.0,
      "text": "curious which role founders delegate first when scaling remotely, and what finally pushed you to do it.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1q4mxve/founders_what_was_the_first_role_you_outsourced/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "nxtri71",
          "author": "JohnnyKonig",
          "text": "As a tech founder, I built a gig economy marketplace. One side of our marketplace was served by a web app the other mobile. I chose to build the backend and web app myself, but contract out the mobile app (which used my backend apis). After that I hired an offshore dev to maintain and continue building out mobile. This worked out great.",
          "score": 3,
          "created_utc": "2026-01-05 15:00:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxwruxa",
          "author": "cowbeau42",
          "text": "First was finding a tech co founder , so my vibe coding ass could focus on the paper work etc. the real outsourcing is having a social media person ",
          "score": 1,
          "created_utc": "2026-01-05 23:29:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxww13j",
          "author": "highsignalhiring",
          "text": "If your long-term strategy is to be \"remote-first\" with a fully distributed team then you need to remove the \"when scaling remotely\" line from your question as it's largely irrelevant. i.e The answer would be the same if you were scaling locally or remotely.",
          "score": 1,
          "created_utc": "2026-01-05 23:51:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxxmef6",
          "author": "RoughCrab749",
          "text": "What I usually advise to founders is to refer to Porter's Value Chain where it splits a business's activities into two buckets: primary (core) and support (non-core) activities.\n\nPrimary activities include your product, service delivery, and anything that requires deep context, judgment, or domain expertise. ***You don't want to outsource this early.***\n\nSupport activities are everything else. Admin, coordination, scheduling, accounting and finance, IT tasks, procurement-type work. These functions exist in almost every business and tend to follow repeatable patterns regardless of industry. ***Roles in these functions are what you want to outsource first*** as there is plenty of talent available with varying levels of experience.\n\nHope this helps.",
          "score": 1,
          "created_utc": "2026-01-06 02:11:22",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1pybj02",
      "title": "Discipline when it comes to being a founder",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1pybj02/discipline_when_it_comes_to_being_a_founder/",
      "author": "overquantityi",
      "created_utc": "2025-12-29 03:38:09",
      "score": 6,
      "num_comments": 5,
      "upvote_ratio": 0.76,
      "text": "So I'm working on a saas and I'm also diagnosed with bipolar and bpd, for the last 4 days I've had a depressive episode and i couldn't work because I'm doing this full time. Because of that, i missed out on multiple potential clients, some who showed interest, some i had demos planned with. Does anyone have a similar experience, if so, how do you deal with it and staying on track even tho you feel like you can do anything about. Any advices are appreciated 🙏.\n\nI also wanted to mention that I'm a solo founder and only have another person working for me as an advisor. \n\nThanks",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1pybj02/discipline_when_it_comes_to_being_a_founder/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "nwhmlbl",
          "author": "NordicLard",
          "text": "Sounds like you need a cofounder so that if/when this happens again you have someone to cover for you. Your ailment seems like it would make it difficult to be a solo founder.",
          "score": 4,
          "created_utc": "2025-12-29 04:14:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nwieicg",
          "author": "Crafty-Sea-134",
          "text": "I think you have to have a mindset, that is, your bipolar can be a talent to help you bring customers or it may be difficult as you describe. You have the right to decide. \nI have obsessive-compulsive disorder, which is always late than the delivery date. But when I fully opened my heart to talk to customers, I knew the difficulties that hindered me deeply. Later, I completed the task with this obsessive-compulsive disorder more perfectly than my competitors.",
          "score": 1,
          "created_utc": "2025-12-29 07:50:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxhr1hk",
          "author": "major_wins_only",
          "text": "Health before wealth!!!\n\nCo founder idea is great but sometimes not viable. \n\nMayb you need a virual assistant to help reschedule when your episodes hit. Goodluck!",
          "score": 1,
          "created_utc": "2026-01-03 19:35:34",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1q4syqg",
      "title": "Has anyone built an Open Source Project Business? If yes how do you get funding/monetise ?",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1q4syqg/has_anyone_built_an_open_source_project_business/",
      "author": "Shashwatcreates",
      "created_utc": "2026-01-05 18:02:43",
      "score": 6,
      "num_comments": 19,
      "upvote_ratio": 1.0,
      "text": "I agree that when building something open source, monetization shouldn’t be the main focus. The priority should be creating real value for the community.\n\nStill, monetization does add value when done right. So how should open-source projects approach monetization without going against their core principles?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1q4syqg/has_anyone_built_an_open_source_project_business/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "nxuz9an",
          "author": "FT05-biggoye",
          "text": "I think your translating app messed this up but if I understand correctly you are asking how to monetize an open source project?   \nCode is pretty trivial these days so at blue magma we build open source but we monetize the service. I can't link it here but you can look at our website to get an idea of how we monetize our open source platform (try blue magma dot com). You need to make sure your moat is not code, but the service and trust you provide. If that's the case, you should have no issue raising funds.",
          "score": 2,
          "created_utc": "2026-01-05 18:24:58",
          "is_submitter": false,
          "replies": [
            {
              "id": "nxv1co4",
              "author": "Shashwatcreates",
              "text": "Lol I'm good at English idk why I messed it up in the post. I will rewrite it.\n\nHow is your company doing then?",
              "score": 1,
              "created_utc": "2026-01-05 18:34:21",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nxv1x5o",
                  "author": "FT05-biggoye",
                  "text": "We are still very early but we got paying customers and interest from a few VCs they are just waiting for us to prove we got PMF before investing serious cash. Being open source is pretty beneficial for us.",
                  "score": 1,
                  "created_utc": "2026-01-05 18:36:54",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nxv3wg4",
          "author": "schelskedevco",
          "text": "It will of course depend on the type of product, and disclaimer that I have never done this successfully (am going to try), but: sell a hosted version of your product. If it requires non-trivial amounts of setup, maintenance, etc. many people won’t want to do that, but will still appreciate the open source nature of the product.\n\nYou can also do something that’s open core, but has additional closed source features for enterprise customers.\n\nYou can charge for hands-on support for anyone who self-hosts.\n\nLook into examples of companies that have successfully monetized an open source project like PostHog. They’ve written blog posts on the subject.",
          "score": 1,
          "created_utc": "2026-01-05 18:45:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxv7vj8",
          "author": "realbrownsugar",
          "text": "Are you more interested in building a business with a useful product wherein you charge a fee for the value it unlocks, or in building a useful project that you wish to give away for free?\n\nBoth are noble efforts and both can involve open source, but the later goal doesn’t lend well to monetization.\n\nA lot of companies open source in service of the business… but the motivation to open source comes from business needs. If the primary goal is to open source, it’s always gonna be at odds with effectively making money.\n\nFor example, “I have created a highly scalable MySQL engine and have built a cluster + service to host it. But nobody knows about it or trusts it… so to enable adoption I’m gonna open source the project! Voila, you get Clickhouse + Vites”\n\nOn the opposite end, you have Bazel.build which came out of Google as a means to attract developer interest in their build system and use as a peacock feather for hiring. The OG author set up his own consulting firm around the open sourced Bazel. Yeah, you can make some money, but it’s not a great monetization scheme. ",
          "score": 1,
          "created_utc": "2026-01-05 19:03:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxw0l81",
          "author": "status-code-200",
          "text": "I wrote open source code to make working with a specific type of financial data easy. I then built a cloud in AWS using the open source code as its core, selling access to the cloud for a convenience fee.\n\nWorks pretty well for monetization and funding.",
          "score": 1,
          "created_utc": "2026-01-05 21:16:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxw8sur",
          "author": "susimposter6969",
          "text": "Mongo DB did it",
          "score": 1,
          "created_utc": "2026-01-05 21:54:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxw9oq5",
          "author": "vijay40",
          "text": "Open source doesn't mean free of cost, but instead free as in freedom, right? A few ways to monetize might be monetizing add-ons or plugins that enhance the base project or offering consulting services for implementations. Open source projects like LangChain show us that just having the code isn't everything—distribution and network effects are the real moats, so consider strategies that leverage those strengths.",
          "score": 0,
          "created_utc": "2026-01-05 21:58:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxwr4lx",
          "author": "cowbeau42",
          "text": "I only know of Odoo and they needed to get away from open sourcing ",
          "score": 0,
          "created_utc": "2026-01-05 23:25:28",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1q4fca2",
      "title": "Meeting w/ big potential client",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1q4fca2/meeting_w_big_potential_client/",
      "author": "nice1fam",
      "created_utc": "2026-01-05 07:27:56",
      "score": 6,
      "num_comments": 6,
      "upvote_ratio": 1.0,
      "text": "I just got my first meeting booked with a Fortune 500 company for a demo- thing is I’m not 100% sure what they want lmaooo. I did a presentation internally at their company and the person reached out following it\n\nWhat should be my main takeaways for this meeting?? Of the top of my head:\n\n\\- schedule another meeting after he messes with my app for a little\n\n\\- get him to run a pilot w/ me and decide on pricing after\n\n\\- ????\n\n\\-",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1q4fca2/meeting_w_big_potential_client/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "nxsgupa",
          "author": "BenJJsu",
          "text": "Discover what they’re interested in specifically and why. Don’t make it an interrogation, just a casual conversation - remember, they reached out to you!\n\nKeep this one short, 15-30 mins. If there’s interest and you think you can help them, push for another meeting.\n\nThe next meeting will be outlining more of a specific proposal - pricing, the officer etc.\n\nGood luck",
          "score": 4,
          "created_utc": "2026-01-05 09:30:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxtq7oy",
          "author": "Dumb-ppl",
          "text": "I ran several discovery calls (I work in sales in a B2B SaaS company valued around $10bn) and the best thing you can do is to be honest and start the call with the right tone by saying: “this call will be divided in two parts, the first one is to better understand your current state of X (whatever you solve) and your goals, and see if we can be a good fit for your vision at Y (their company), in the second part we’ll delve deeper in what we do and how we do it, if there’s time, we can then delve into the demo, otherwise we’ll go through it in our next call”.\n\nIn this way you:\n- Transmit reliability;\n- Respect their time by looking for the full understanding;\n- Show self confidence in your service by wanting the full picture, not the full pitch;\n- Acquire golden information;\n\nDon’t be scared of him expecting an actual demo, this happens often in sales especially when information are not fully acquired prior to the demo, and don’t be scared to not being able to show the solution right away as he wanted, hurrying that up won’t assure your solution will fit their purposes (actually it would do the opposite in this case).\n\nEarly replies such as “I was just curious about what you do” shouldn’t be seen as roadblocks but as ways to understand better your leads and possible customers, the main goal before any kind of demo is acquiring all the information needed on your side.\n\nIf you need any assistance on listing the qualification info needed just let me know, happy to help!",
          "score": 3,
          "created_utc": "2026-01-05 14:54:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxsc82z",
          "author": "ashishhuddar",
          "text": "Can you give me a brief about the app?",
          "score": 1,
          "created_utc": "2026-01-05 08:46:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxsycz5",
          "author": "CoolSnow01",
          "text": "What role has the person who reach out to you?\n\n\nMost of the time there was some situation they saw internally that made them realize there's an issue of some sort (time wasted in repetitive tasks, customer support that realizes churn too late, etc).\n\n\nSuch issue has a direct impact in some metric. You wanna find out what that metric is, so both sides can come out of the meeting with a clear understanding of what value would the product bring into the company.\n\n\n\nIs there someone in your organization who works on sales/discovery?",
          "score": 1,
          "created_utc": "2026-01-05 12:02:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nxto3xq",
          "author": "Alarmed-End8826",
          "text": "I agree with CoolSnow. I recommend MEDDPICC sales methodology before diving into a demo - more qualification and the methodology eliminates “happy ears”. The methodology keeps both buyer / seller grounded and validates the process.",
          "score": 1,
          "created_utc": "2026-01-05 14:43:11",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}