{
  "metadata": {
    "last_updated": "2026-02-08 03:39:57",
    "time_filter": "week",
    "subreddit": "ycombinator",
    "total_items": 17,
    "total_comments": 212,
    "file_size_bytes": 194836
  },
  "items": [
    {
      "id": "1qwinp5",
      "title": "Built the product. Now stuck on distribution as an introverted founder",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1qwinp5/built_the_product_now_stuck_on_distribution_as_an/",
      "author": "SOLIDSNAKE1000",
      "created_utc": "2026-02-05 11:18:52",
      "score": 78,
      "num_comments": 87,
      "upvote_ratio": 0.96,
      "text": "I’m highly introverted. I’ve spent months building something technically complex and stressful to execute, and we’re now near launch.\n\nHere’s the honest problem: I understand marketing conceptually, but I don’t execute distribution well. I’m not good on camera. I stutter. I don’t naturally push myself into visibility.\n\nI can build systems. I can ship. I can handle product depth. Growth and narrative are not my strengths.\n\nIf anyone here has taken this path successfully, I’d appreciate your insight — and I’m open to conversations.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1qwinp5/built_the_product_now_stuck_on_distribution_as_an/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o3ppp8n",
          "author": "reddit_user_100",
          "text": "There’s not really a solution here than to get over it I’m afraid. If you want to be a founder you’re gonna have to interact with the world somehow.",
          "score": 35,
          "created_utc": "2026-02-05 13:34:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3q4pp7",
          "author": "Crafty-Pool7864",
          "text": "I have a CS degree, love programming but still learned to put myself out there. I’ve started multiple companies, the most recent of which I exited to PE for life changing money.\n\nI’m happy to connect and offer you some advice but please know that the advice is going to take the form “get good”. I’ll happily share how to do that but if you’re hoping for some magical answer where you don’t have to face your demons and the product magically sells itself, maybe message someone else :)",
          "score": 12,
          "created_utc": "2026-02-05 14:56:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3zv5ob",
              "author": "Popular-Poet-7052",
              "text": "Hey, not OP but open to hearing some valuable advice from your experience. Is it okay if i DM you?",
              "score": 2,
              "created_utc": "2026-02-07 00:04:29",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o4188iq",
                  "author": "Crafty-Pool7864",
                  "text": "Please do. A bunch of people have.",
                  "score": 2,
                  "created_utc": "2026-02-07 05:20:09",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o43xage",
                  "author": "Main_Act5918",
                  "text": "Just share it here in the comments. Would love to hear it too. I am the same as the OP. Could never do marketing. Ended up burying 3 full stack products",
                  "score": 2,
                  "created_utc": "2026-02-07 17:08:27",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3qck67",
          "author": "hduynam99",
          "text": "I was in your shoes, but as a founder you will doing alot of thing that not in your comfort zone. You are not employee",
          "score": 5,
          "created_utc": "2026-02-05 15:34:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3puoaz",
          "author": "Willing-Training1020",
          "text": "Honestly a lot of great founders are terrible at distribution, it's way more common than people admit. What I've seen work is hiring someone whose entire job is the stuff you're bad at... content, outreach, social. Doesn't need to be a full time local hire either, remote marketing people through firms or even Upwork can own that whole side for way less. Also being introverted doesn't mean you can't distribute, written content, SEO, and community engagement don't require being on camera at all :)",
          "score": 13,
          "created_utc": "2026-02-05 14:02:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3usurh",
              "author": "HistoricalStart610",
              "text": "Terrible advice, the founder should be directly playing with the copy, positioning, and sales scripts, and only bring folks on once they've executed each of these operations with some success. \n\nYou could also bring on another founder to help bring your vision to life.",
              "score": 7,
              "created_utc": "2026-02-06 05:48:11",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3v664e",
                  "author": "TheEssentialDev",
                  "text": "You're right! You need to be in the driver seat.",
                  "score": 3,
                  "created_utc": "2026-02-06 07:42:19",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3s11ke",
          "author": "Comprehensive-Bar888",
          "text": "Binge watch Silicon Valley.",
          "score": 3,
          "created_utc": "2026-02-05 20:15:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3qnrcv",
          "author": "_DBA_",
          "text": "Then sadly it wont work, you can build and build and polish as long as you want, if you dont have sales or marketing in yourself then you hire it or find someone who does. \n\nOtherwise stop wasting your time. If you just want to build then be a contractor. \n\nAnd you dont even know your product is actually any good, if you dont have actual customers, you can as an engineer think its good, but reality can be very different.",
          "score": 3,
          "created_utc": "2026-02-05 16:26:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3rprh3",
          "author": "meoww_00",
          "text": "As a founder, you can always try content writing, SEO, posting on reddits & discord communities! you can hire a well based content creator as well\n\nThen starting an unpaid internship (after building up a bit of brand aura) works fine!",
          "score": 3,
          "created_utc": "2026-02-05 19:21:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3so6xo",
          "author": "attn-transformer",
          "text": "You need to be 100% committed if you want to be a successful founder. \n\nI’m also highly technical and have been called socially awkward more than once, and had the same problem as you. \n\nTreat it as an engineering problem. What message do I need to convey? Given whom I’m meeting with how to convey that message? Etc.\n\nAnd remember NO ONE gives a shit about your technical implementation. Don’t mention agent frameworks or deep technical details. Focus on what problem you can solve for your customer and what your product enables them to do. \n\nEveryone wants to work less and make more, including your customers. Explain how you can help them do that.\n\nTreat it as an engineering problem not some emotional bullshit that doesn’t have an easy solution.",
          "score": 3,
          "created_utc": "2026-02-05 22:06:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3z0q7e",
              "author": "joanpolcg",
              "text": "I like your advise ",
              "score": 1,
              "created_utc": "2026-02-06 21:21:29",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3z02o8",
          "author": "Tulsy-it",
          "text": "I'm doing the opposite. I don't know how to program anything, but I have a wealth of knowledge and I know how to sell. I paid a company to develop my tool incubator, and now I'm offering it to companies. I compensate for what I don't know by buying expertise.",
          "score": 3,
          "created_utc": "2026-02-06 21:18:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3pxnrm",
          "author": "Acceptable_Sort8745",
          "text": "hey, I've been in the same shoes. Let's chat!",
          "score": 2,
          "created_utc": "2026-02-05 14:19:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3rdmrd",
          "author": "ivalm",
          "text": "Is it b2b? B2c? In the world of coding agents the main thing for startups is distribution, not building (and I say this as a builder). The good news is that distribution can be learned and there are specific playbooks for specific ICPs. You will need to leave your comfort zone.",
          "score": 2,
          "created_utc": "2026-02-05 18:26:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3re9rq",
              "author": "SOLIDSNAKE1000",
              "text": "It’s multi-agent trading infra with real execution, logs, and model competition. Distribution scales signal and more —- https://liteverse.com 👍🏻",
              "score": 1,
              "created_utc": "2026-02-05 18:29:18",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3rg3nm",
                  "author": "ivalm",
                  "text": "“Powered by” as way to insert logos for facsimile of social proof is really cute. I’ve not seen this before.\n\nIt seems b2c so unless you have large social following you prob need to do guerrilla marketing (so posts/etc that tangentially promote your thing, like the comment you just made that made me click on the site). Probably in discords/telegram channels where your customers live.\n\nFor CTA I feel it’s more “what it is” but not clearly “why I want it.” Something like “automatically blah blah to blah blah” might be better h1 than “ai agent swarms”, or at least a/b test with click throughs. \n\nYou can also get some initial traffic to help with h1 selection by paying for Google AdWords but you do need organic growth for the actual growth part rather than than relying on ads.",
                  "score": 3,
                  "created_utc": "2026-02-05 18:37:42",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o3ujs6u",
                  "author": "afactory",
                  "text": "How did you build your website? It looks awesome.",
                  "score": 2,
                  "created_utc": "2026-02-06 04:41:21",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o3zipah",
                  "author": "Patient-Bumblebee",
                  "text": "This is already supported by many crypto exchanges natively.\n\nFor example [Everstrike](https://everstrike.io).\n\nKraken and Coinbase will also offer it soon.\n\nSo I don't see why anyone would risk giving away their API keys to some solo dev who doesn't even reveal their identity and have a generic company website with no real info.\n\nMaybe try contacting some crypto exchange who doesn't have it already and offer them to buy it. I think you will have better luck with that.",
                  "score": 0,
                  "created_utc": "2026-02-06 22:53:20",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o40lw3x",
          "author": "jamesintech",
          "text": "I'm in the same boat. I love building and hated distribution and talking to people. However, I've slowly worked on it over the years. One thing that helped was creating a YouTube channel. You get comfortable talking to a camera and talking to other people in video chats/voice calls. Keep at it. You'll slowly get better at speaking in front of others and putting yourself and your product out there.\n\nNext steps:  \n1. Start making videos, maybe even a youtube channel for practice  \n2. Start a social media account on X or LinkedIn and regularly post and comment. \n\n  \nYou got this!",
          "score": 2,
          "created_utc": "2026-02-07 02:46:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o4583l6",
          "author": "Johnmark-unplugged",
          "text": "All i can say is be honest. I am sailing in the same boat, and i get it, its really tough to get out there and strike a conversation with a random person. Here is what helped me. \n\n1. Understand the ‘why’ behind the fear: For me it was the thought of being judged. And what i realized is Great, people are great (Ignore what you see in Insta). They are supportive and willing to have a meaningful conversation. There is a lot of support we can get if we just ask. \nAnd that brings me to the second point\n\n2. Be part of community: there are a lot of people in the same phase. You are not alone, and as you need support they need it too. Do not connect with them with an idea of selling or receiving something, rather have a giving mindset. Contribute to a conversation, with no hidden agenda. \n\n3. Relationships over transactions: it takes aprox 3 connect moments for a person to remember you. Build relationships, sales will happen eventually. \n\nDont wanna sound to preachy, but i know its tough as an introvert to go and connect. Something you can try is go to an event this week, even if you go and not meet anyone, its still better than not going :)",
          "score": 2,
          "created_utc": "2026-02-07 21:08:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o45yuqx",
          "author": "Superjonico",
          "text": "Remember why are you doing it, forget comfort, ride the wave, take action.",
          "score": 2,
          "created_utc": "2026-02-07 23:40:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3pe8he",
          "author": "Aromatic-Trouble-580",
          "text": "Have you considered hiring someone to be in charge of distribution?",
          "score": 2,
          "created_utc": "2026-02-05 12:22:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3pek0m",
              "author": "SOLIDSNAKE1000",
              "text": "Not at this stage, we’re pre-revenue and bootstrapped, so there’s no budget for a salaried distribution lead yet.",
              "score": 2,
              "created_utc": "2026-02-05 12:24:38",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3pu6zi",
                  "author": "AllTemperature",
                  "text": "Or offer equity to someone who believes in the vision and is in alignment with the company's direction to be the face of the company.",
                  "score": 2,
                  "created_utc": "2026-02-05 14:00:05",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o3u5rqt",
                  "author": "Aromatic-Trouble-580",
                  "text": "And have you considered bringing on a marketing founder and offering an equity split?",
                  "score": 1,
                  "created_utc": "2026-02-06 03:10:06",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3r2c76",
          "author": "bohlenlabs",
          "text": "You might use a marketing tool designed for introverts. Example: 2quiet2market.com\n\nFull disclosure: I built it.",
          "score": 2,
          "created_utc": "2026-02-05 17:34:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3qhmhy",
          "author": "rizwanrko",
          "text": "I'm also wearing the same shoe",
          "score": 1,
          "created_utc": "2026-02-05 15:58:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3quunk",
          "author": "bob-a-fett",
          "text": "The problem you have is you don't know if you built something customers will pay money for. Doing that requires a lot of iteration with customers in a continuous discovery and iteration loop. If you can't facilitate that then you need someone who can. It's not just build then market then profit.",
          "score": 1,
          "created_utc": "2026-02-05 16:59:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3qxevy",
          "author": "Crafty-Sea-134",
          "text": "b2b or b2c？",
          "score": 1,
          "created_utc": "2026-02-05 17:11:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3rg8cj",
          "author": "mickayee",
          "text": "Find a cofounder who’s extroverted and nontechnical. Don’t be afraid just match the mentality",
          "score": 1,
          "created_utc": "2026-02-05 18:38:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3sihub",
          "author": "greyzor7",
          "text": "Distribution is the hardest part. Start organically, get traction, then think about Ads.\n\nTry launching your app on a combo of social media: X/Twitter, Reddit + launch platforms: Product Hunt, Microlaunch.\n\nAnd any channel relevant to your ICP.\n\nRun campaigns, measure all ROIs, then simply double down on what worked.\n\nThen keep doing this until you get users & customers.\n\nFix conversions, channel selection, targeting when necessary.",
          "score": 1,
          "created_utc": "2026-02-05 21:39:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3snfop",
          "author": "ciretose81",
          "text": "The website looks great, if the product works as well this might be very promising. Happy to give some feedback and thoughts on distribution if you'd like - lmk",
          "score": 1,
          "created_utc": "2026-02-05 22:02:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3sojpy",
          "author": "marsjackremous",
          "text": "I feel this. I’m technical and can ship all day but cold outreach makes me want to hide under my desk.\n\nOne thing that helped me - I automated the parts I hate. There are AI tools now that will make phone calls for you (yes really). I’m literally testing one called pixelmoney.co for B2B lead qualification. Still early but anything that lets me avoid being on camera or cold calling feels like a win.\n\nAlso for content, try recording voice notes and having AI turn them into posts. Way easier than sitting in front of a camera.",
          "score": 1,
          "created_utc": "2026-02-05 22:08:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3t1t2j",
          "author": "Nilsdog",
          "text": "Built, scaled & raised for 2 startups to date, on my third currently. Happy to have a chat",
          "score": 1,
          "created_utc": "2026-02-05 23:16:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3tvflz",
          "author": "notidlyby",
          "text": "If you are scared get a dog. If you believe in what you built you will spread the word.",
          "score": 1,
          "created_utc": "2026-02-06 02:08:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3u2bwi",
          "author": "reducedoxide",
          "text": "To start with you're incredible, it takes a lot of courage to share your problem with reddit.   \n  \nCongratulations, you're near launch, most of us don't even have the chops to get there.   \n  \nYour wesbite looks good, you must have put a lot of effort to make this. \n\nHere's what I am thinking as a marketer who's trying to learn how to program - you're giving way too much importance to your problems around marketing instead of focusing on the problem you're solving for your customer. \n\nIf you have this mindset \"How is my customer surviving everyday with their problem & why the hell aren't they using my solution\", you wouldn't stop yourself from reaching out to them.\n\nMy suggestion - have a goal of reaching out to 8 to 10 people everyday on LinkedIn/ X (folks who are most vocal about trading) - ask them for advice/feedback (genuinely) on what you're building and see where it goes from there. \n\nThere is some good advice on this thread - SEO, Content Writing etc. \n\nPS : I think your website copy can be dramatically improved, go for the outcomes, not the features. \n\n",
          "score": 1,
          "created_utc": "2026-02-06 02:49:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ub52g",
          "author": "sailormish980",
          "text": "I think this is very common problem cuz i m facing the same problem lol",
          "score": 1,
          "created_utc": "2026-02-06 03:43:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3uoeeb",
          "author": "Janci_K",
          "text": "Steve jobs said that good products need no marketing 🫣",
          "score": 1,
          "created_utc": "2026-02-06 05:14:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3uuhxo",
          "author": "KrismerOfEarth",
          "text": "It amazes me how many technical founders there are that are weak in distribution, while there are also just as many business founder that don’t know how to make the technical stuff. \n\nI think it’s just a matter of everyone wanting to work on their own idea",
          "score": 1,
          "created_utc": "2026-02-06 06:01:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3uv4na",
          "author": "Dangerous_Session612",
          "text": "Hey Pal, I’m not sure what the question or request is.\n\nSounds like just run of the mill anxiety (join the club😂), and rumination. \n\nGet out of your head, go for a walk / go to the gym - go laugh - maybe a beer and a comedy show.\n\n\nPoint I’m trying to make is - we are social creatures - and isolation and smashing around in your head is unhealthy. \n\nGood luck",
          "score": 1,
          "created_utc": "2026-02-06 06:06:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3vbguj",
          "author": "iam-samzz",
          "text": "Can anyone say how we can overcome this?",
          "score": 1,
          "created_utc": "2026-02-06 08:31:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3vf2ta",
              "author": "Hot-Spicy-Potato",
              "text": "Copying here my answer because likely will bury in the flood of comments: No need to overcome this. It needs to be outsourced. It simply not your job. Forcing yourself to do the circus monkey as an introvert is the same as forcing the circus monkey to do the accounting. Nothing good comes from that. Outsource what you were not built to do well.",
              "score": 2,
              "created_utc": "2026-02-06 09:06:43",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3vr2r2",
                  "author": "iam-samzz",
                  "text": "Yeahh .. unexpected answer.. thanks",
                  "score": 2,
                  "created_utc": "2026-02-06 10:58:37",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3vexib",
          "author": "Hot-Spicy-Potato",
          "text": "No need to overcome this. It needs to be outsourced. It simply not your job. Forcing yourself to do the circus monkey as an introvert is the same as forcing the circus monkey to do the accounting. Nothing good comes from that. Outsource what you were not built to do well.",
          "score": 1,
          "created_utc": "2026-02-06 09:05:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3vl6xr",
          "author": "TechtoneOfficial",
          "text": "Find someone who can sell/market to join you, a great product that no one knows about is a hobby.\n\nI would get bored of building, coding, iterating and making the small tweaks that make our app perform, efficient and accurate, my technical co-founder loves it, when we catch up nearly everyday he gets so excited about the updates he's working on or shipped, I get excited about how I can tell the world about them.\n\nI like selling, marketing and talking to people about the amazing product we built my co-founder doesn't.\n\nCheck us out to see what we're building [techtone AI](http://www.techtone.ai)\n\nhttps://preview.redd.it/5spd8ntuluhg1.jpeg?width=1600&format=pjpg&auto=webp&s=a57de61fd0831edf57d8386688d35cb1ed9ac32a",
          "score": 1,
          "created_utc": "2026-02-06 10:05:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3vpitm",
              "author": "Wide_Brief3025",
              "text": "Connecting with potential users where they already hang out makes a huge difference, especially if you are not into cold outreach or self promotion. Tools that monitor conversations on platforms like Reddit and LinkedIn to surface relevant chat threads can give you a head start. ParseStream is pretty handy for this since it finds and alerts you to discussions where you can naturally talk about your product.",
              "score": 2,
              "created_utc": "2026-02-06 10:45:01",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o3vlebd",
              "author": "TechtoneOfficial",
              "text": "Ps. Just finding someone to do it isn't enough, they need to have that shared vision, drive and sense of responsibility",
              "score": 1,
              "created_utc": "2026-02-06 10:07:19",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3vmf7f",
          "author": "Comfortable_Pin_1397",
          "text": "Same boat. Built an SEO tool, hit this exact wall.\n\nWhat's working for me: I stopped treating distribution as \"marketing\" and started treating it like a product problem. Write content that genuinely helps people, not to sell, but because it's what I'd want to read. Engage in communities like this one. No videos, no face required.\n\nMy test: 6 months of consistent, helpful content. If I can't grow organically without performing, then I'm not solving a painful enough problem. That's the real signal.",
          "score": 1,
          "created_utc": "2026-02-06 10:16:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3vwrrx",
          "author": "startupCMO",
          "text": "Hiring marketing leader can be an overkill. What you need is a strategic help on creating a GTM plan, defining value prop, product positioning and content strategy to make your product visible. Fractional CMOs is a concept which works for stages like yours where it can be short term engagement of 3 to 6 months and help in distribution. There are many fractional cmo networks you can reach out to.",
          "score": 1,
          "created_utc": "2026-02-06 11:45:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3vxqy4",
          "author": "Substantial-North137",
          "text": "Building a startup here and also struggling with this, it's common! \n\nWhat I am building might help with your confidence. You can generate synthetic personas from your product URL that are your target customers. You can chat with them to test messaging, copy, social posts, etc. It is all done with public data, so it is statistically representative of the population, with no PII. \n\nFeel free to comment for the link or DM me. ",
          "score": 1,
          "created_utc": "2026-02-06 11:53:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3x1uq3",
          "author": "AnyLie2121",
          "text": "I can help you. DM me what you are doing and what specifically you need help with.\n\n",
          "score": 1,
          "created_utc": "2026-02-06 15:40:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o41m5m8",
          "author": "WerewolfForsaken5708",
          "text": "I’m engineer pursuing part-time mba now, and looking for ideas and technical cofounder, I’d happy to take sales/marketing initiatives role , plz feel free to reach out to me",
          "score": 1,
          "created_utc": "2026-02-07 07:19:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o41y0i5",
          "author": "Previous-Drummer-837",
          "text": "It depends on the product and target customers, but you can promote your product using faceless videos. Or, you can approach someone with marketing and sales experience to promote it for you, with a comission per sale.",
          "score": 1,
          "created_utc": "2026-02-07 09:13:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o425hau",
          "author": "Webuildtech",
          "text": "Follow a playbook, almost like a framework of steps so nothing feels completely unknown, this worked for me\n\nCold outreach -> signal -> discussion -> interest -> demo -> close\n\nCold outreach -> short, relevant message -> start conversation -> get reply\n\nSignal -> ask 1–2 questions -> confirm pain exists -> hear it in their words\n\nDiscussion -> dig into impact -> understand cost and consequences -> no pitching\n\nInterest -> introduce possible solution at high level -> gauge curiosity -> get pull\n\nDemo -> show their problem being solved -> one core workflow -> validate fit\n\nClose -> agree on next step -> trial / pilot / payment / clear no\n\n  \nYou find the parts where you think you are not strong in yet, and educate yourself as much as possible, LennysPodcast a freaking gold mine. \n\nJust need practice, most people aren't good on the first try and even more fail to attempt. \n\n",
          "score": 1,
          "created_utc": "2026-02-07 10:27:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o445kgp",
          "author": "Time_Pattern_8501",
          "text": "you are my ideal customer. it’s become so easy to have an idea and ship an app or a product in today’s age and the bottleneck has become marketing. vibe coding has taken over but the market is in need of a “vibe marketing“ tool as well. check out my website cofndrly.com and if you’re interested send me an email snyderblake3@gmail.com",
          "score": 1,
          "created_utc": "2026-02-07 17:49:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o44ew0p",
              "author": "Wide_Brief3025",
              "text": "I totally get how tough distribution can be, especially when you're more into building than promoting. One thing that really helped me was setting up alerts for relevant conversations across forums and social platforms so I could jump in at the right time. ParseStream makes this pretty easy since it tracks keywords and sends alerts for discussions you should join.",
              "score": 1,
              "created_utc": "2026-02-07 18:35:19",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o44totb",
          "author": "Commercial_Detail156",
          "text": "Happy to connect, I’ve scaled a few startups and live the go to market/marketing aspect but never have been technical myself to launch something",
          "score": 1,
          "created_utc": "2026-02-07 19:50:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o46gfnt",
          "author": "Kitchen-Quality-3357",
          "text": "I'd love to chat. Private message me please.",
          "score": 1,
          "created_utc": "2026-02-08 01:26:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o46xj4u",
          "author": "rocketfuelinabubble",
          "text": "Marketer turned founder here! I recently built something, laid the foundational work, and snoozed for a while. Less than a month later, I woke up to 50+ users on my platform!\n\nHappy to help if you’d like",
          "score": 1,
          "created_utc": "2026-02-08 03:14:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3p6qf1",
          "author": "[deleted]",
          "text": "[removed]",
          "score": -1,
          "created_utc": "2026-02-05 11:24:30",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qus5t9",
      "title": "I’ve hired over 1,000 influencers and spent millions. Here is the no-bs playbook.",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1qus5t9/ive_hired_over_1000_influencers_and_spent/",
      "author": "borjafat",
      "created_utc": "2026-02-03 13:38:57",
      "score": 73,
      "num_comments": 35,
      "upvote_ratio": 0.88,
      "text": "If you want to scale your marketing with influencers but dont want to burn cash on bad deals, get scammed by fake bot views, or waste months listening to \"gurus\" who have never actually booked a sponsorship... then you might enjoy this.\n\nI work as a Marketing Director for a pretty big brand and I also run my own SaaS on the side. \n\nBetween the two, I've hired over a thousand influencers and spent millions in partnership dollars.\n\nHere is the brain dump on what actually works:  \n  \n\\-YouTube longform first until you max out on youtube longform, dont do any other format. Nothing beats the power of the attention spam and the direct CTA with link in description as longform does. Ignore all the gurus telling you to hire one million micro influencers on TikTok, even if you’re target audience is on TikTok/Reels, I guarantee there are also channels on youtube with longform videos for that same audience, dont waste your time don’t lose your sanity, do longform until there’s noone else to partner with on that format.  \n  \nYou need to have a solid proven offer before you try influencers. Have scarcity in the CTA, like “First 1,000 people to click the link get this special offer”  \n  \nTest 60 second integrations vs fully dedicated videos (more expensive). Have them put the 60 second promo in the first 5 minutes of the video to maximize eyeballs on your offer.\n\nBeware of scammers, several channels inflate their views and engagement with bots, look for suspiciously consistent high views across all videos, look for repeated and sometimes identical comments praising the influencer, too many emojis, and celebrities in the profile pictures even.\n\nIf you’re a startup strap for cash, you will want to push for commission only deals, for my startup Rebelgrowth, that’s 30% on every generated subscription for life, but in my experience most influencers don’t like performance deals even when they would be making more money in the long term, they dont know this so its your job to explain the math on why this is the case, make a simple spreadsheet, make a loom video, praise their last video, explain why you think your startup would be a great fit and explain why the commission offer is better than flat rate.  \n  \nHowever, if you’re an established startup/company with a budget, you’ll want to do flat rate deals because YOU will make more money in the long term as opposed to having to pay 30% of your revenue forever.  \n  \n30% of deals will succeed, those are the channels you will want to nurture and repeat and that will carry the whole effort, another reason why you need to stay away from flat rate as a bootstrapped startup, you can’ afford to have your first 10 deals fail looking for the 3 that will work. This is a numbers game.\n\nWhat I look for in a channel (this is less important when doing performance deals): Audience affinity; how relevant is the topic to your business, what are audience demographics (age, location, genre), how consistent are views across the last 12 videos, how often does the channel publish, what’s the engagement rate (high engagement = high conversions), I can afford more on a channel with 7,000 views but 15% engagement rate than a channel with 10,000 views but 5% engagement rate. Engagement is comments to subs (or views) rate.\n\nOn flat rates, always negotiate down aggressively, argue why with the channels using your analysis from the above paragraph. I personally look for sub $50 CPMs when doing flat rate (irrelevant when doing commission deals).  \n  \nTo find channels, ask your favorite AI chat to do “Deep Research” and find the top 100 channels that meet your preferred criteria. If doing commissions, aim for small channels to improve your chances of getting a “yes”, so channels with under 10k subs. You can also simply search youtube, or one of the millions of apps out there that have a youtubers database. Gather the list and then it's time to find the emails. I pay a guy on upwork $50 per 100 researched channels because youtube only lets you unlock 5 emails per day. This guy has a bunch of accounts he uses to unlock emails quicker.  \n  \nOnce you have the emails, use your favorite outreach tool to schedule 4 - 7 emails (the money is in the followups). Keep it simple, lead with “Paid sponsorhip?...” in the subject and first line of email copy so the influencer knows you’re down to business.   \n  \nHave dedicated landing pages per influencer or dedicated coupon codes or if you’re doing affiliate commissions it doesn’t really matter since they will have their affiliate link to your product anyways.   \n  \nYou’ll want to stay compliant if you’re a big company, which means making sure the influencer clearly discloses its a sponsorship when the Ad begins, have them put your logo as soon as they say the video is sponsored by your company.\n\nCheers,  \nBorja\n\np.s. this post was edited to share the unfiltered, non-AI version of my draft, with wrongful grammar, etc.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1qus5t9/ive_hired_over_1000_influencers_and_spent/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o3c992w",
          "author": "bubbascrub9793",
          "text": "Fascinating let's connect",
          "score": 10,
          "created_utc": "2026-02-03 13:43:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3c9czx",
              "author": "borjafat",
              "text": "Sure [x.com/borja\\_obeso](http://x.com/borja_obeso) works best for me",
              "score": 0,
              "created_utc": "2026-02-03 13:44:08",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3c9hcx",
          "author": "SignificantDuty5976",
          "text": "Sharp claim without proof?",
          "score": 3,
          "created_utc": "2026-02-03 13:44:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3c9vif",
              "author": "borjafat",
              "text": "Understandable. Search youtube for influencers promoting Craftsy (the company i work for) and do the math, you will find thousands of videos, im the guy negotiating them.",
              "score": 2,
              "created_utc": "2026-02-03 13:46:59",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3caesw",
          "author": "SignificantDuty5976",
          "text": "\"Influencers hate this.\" <-- You can say that again lol.",
          "score": 3,
          "created_utc": "2026-02-03 13:49:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3cgvg3",
          "author": "pbalIII",
          "text": "30% lifetime rev share for YouTube creators is interesting math. But I'd push back on the idea that commission-only is a realistic path for pre-revenue startups... creators have seen too many affiliate programs flame out, so the upfront cash is really insurance against your company not existing in 6 months.\n\nThe hybrid model (small flat fee + rev share) seems to thread the needle. You're signaling you have budget and believe in your product, while still aligning incentives long term. I've seen that land better than pure commission pitches, especially with mid-tier creators who have more options.",
          "score": 3,
          "created_utc": "2026-02-03 14:25:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3ck4fg",
              "author": "borjafat",
              "text": "That's a very fair point. The thing is, if you don't have cash, your only other option is to offer equity, which is trending. And if you're targeting small channels that are not getting any offers from anyone anyways, it doesn't matter, you're both taking a gamble on your projects (they on their channel, you on your startup), I could also argue youtube could shut down a channel after you paid a flat rate and you're in the same position the influencer would be in your described scenario.",
              "score": 2,
              "created_utc": "2026-02-03 14:42:17",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3c9ei4",
          "author": "IamGambas",
          "text": "Wonderful ressources man, thanks a lot !",
          "score": 1,
          "created_utc": "2026-02-03 13:44:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3caiiu",
              "author": "Comfortable-Tell-192",
              "text": "Agreed",
              "score": 1,
              "created_utc": "2026-02-03 13:50:29",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o3ccoic",
              "author": "borjafat",
              "text": "You're welcome, have you been considering influencer marketing?",
              "score": -2,
              "created_utc": "2026-02-03 14:02:27",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3cumk6",
                  "author": "IamGambas",
                  "text": "Yes I do !",
                  "score": 1,
                  "created_utc": "2026-02-03 15:34:17",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3cajd5",
          "author": "Comfortable-Tell-192",
          "text": "100% on the longform vs shorts debate. Everyone is obsessed with Reels right now but the churn is insane. A 20 min YouTube video lives forever. People underestimate the SEO value of those longform vids too.",
          "score": 1,
          "created_utc": "2026-02-03 13:50:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3cay1u",
              "author": "borjafat",
              "text": "yea, longform for the win",
              "score": 1,
              "created_utc": "2026-02-03 13:52:54",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3cdhdv",
          "author": "DisastrousOstrich562",
          "text": "Hey, first off - thank you so much for the post! There's a ton of great info in it.. \n\nI'm curious about whether this form of advertising works when you are more B2B? We are in legaltech but our product applies to a few different avenues - startups, big law, SMEs, in-house counsels, etc. I'm curious if you think YouTube influencer advertising would make sense for us and, if so, would following this playbook yield similar results?",
          "score": 1,
          "created_utc": "2026-02-03 14:06:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3cfbzz",
              "author": "borjafat",
              "text": "Yeah of course, businesses are ran by people...who watch youtube too.",
              "score": 1,
              "created_utc": "2026-02-03 14:16:49",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3cl571",
          "author": "BaseRevolutionary365",
          "text": "This is gold",
          "score": 1,
          "created_utc": "2026-02-03 14:47:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3cmjt5",
              "author": "borjafat",
              "text": "Thank you. Have you been thinking about trying something like this?",
              "score": 1,
              "created_utc": "2026-02-03 14:54:46",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3ctefp",
          "author": "Classic_Chemical_237",
          "text": "Great post!\n\nWhat’s your thought on producing the long form video yourself? Worth the effort?",
          "score": 1,
          "created_utc": "2026-02-03 15:28:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3cuqtt",
              "author": "borjafat",
              "text": "You mean to post it in my own channel or to give to the influencer to post it? If its the first, then that;'s not influencer marketing, that's content marketing and sure you can do that but it's beyond the scope of this discussion. If its the later, why would an influencer want you to cerate the video for them, I mean, they have to be IN the video themselves.",
              "score": 1,
              "created_utc": "2026-02-03 15:34:51",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3cv6js",
                  "author": "Classic_Chemical_237",
                  "text": "Yeah, I guess my question is, how good is content marketing (for example, making how-to videos in your own channel) compared to influencer marketing?",
                  "score": 1,
                  "created_utc": "2026-02-03 15:36:55",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3cwch0",
          "author": "isanjayjoshi",
          "text": "Influencers gonna dead soon after reading this",
          "score": 1,
          "created_utc": "2026-02-03 15:42:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3d3sm0",
          "author": "Portfoliana",
          "text": "The point about engagement rate > raw view count is underrated. I've seen this play out in fintech too - a 5k subscriber channel with a super engaged niche audience (say, dividend investors or options traders) will convert 10x better than a generic 50k channel that covers \"how to make money fast\" content.\n\nOne thing I'd add: for B2B or more technical products, podcast sponsorships often outperform YouTube. Same long-form attention benefits, but the audience tends to be even more loyal and the CPMs are usually lower since fewer brands are competing for that inventory.",
          "score": 1,
          "created_utc": "2026-02-03 16:17:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3cabgo",
          "author": "wheretogo_whattodo",
          "text": "Thanks for the AI post bro",
          "score": -6,
          "created_utc": "2026-02-03 13:49:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3cautm",
              "author": "borjafat",
              "text": "I can paste the raw draft with ugly grammar if you prefer",
              "score": -2,
              "created_utc": "2026-02-03 13:52:25",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3cgir8",
                  "author": "wheretogo_whattodo",
                  "text": "**Its not the grammar**. It’s writing like this. It’s not *x*, it’s *y*, and you’re *right* to question this.",
                  "score": 1,
                  "created_utc": "2026-02-03 14:23:14",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qvia1b",
      "title": "Startup has no technical cofounder",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1qvia1b/startup_has_no_technical_cofounder/",
      "author": "happyfce",
      "created_utc": "2026-02-04 07:36:46",
      "score": 49,
      "num_comments": 52,
      "upvote_ratio": 0.93,
      "text": "I'm interviewing for a founding engineer role at a startup and there's no technical cofounder. It seems like there's great founder market fit but it looks like I will be building everything alongside other founding engineers but I will be the first.\n\nIs this a red flag? They're serial founders and have already raised a sizeable seed (>5m) without a technical founder.\n\nAlso, any ideas of how much equity to ask for?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1qvia1b/startup_has_no_technical_cofounder/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o3mkcbd",
          "author": "rarehugs",
          "text": "It's a green flag if they have previous experience and have already raised capital.\n\nThe reality is most startups don't have any use for an actual CTO until they scale, and they likely intend to reserve that position for when hiring someone experienced makes sense. Founding engineers are a sensible move for the development work needed now.\n\nFounding engineer is a salaried position with between 0.5% to 2.5% equity depending on the engineer's background, specialization, experience, and the startup's need. Hope that helps, good luck!",
          "score": 11,
          "created_utc": "2026-02-04 23:57:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3pwa7z",
              "author": "dodgery1",
              "text": "^ 100%. This should be stickied to the top of the comments.",
              "score": 2,
              "created_utc": "2026-02-05 14:11:38",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3hs4xc",
          "author": "luew2",
          "text": "Non technical founder is fine if it isn't a tech focused company? Otherwise run",
          "score": 22,
          "created_utc": "2026-02-04 07:40:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3htu8j",
              "author": "happyfce",
              "text": "It's tech focused\nBut it seems like the founders have all the puzzle pieces together (LOIs signed, seed funded, industry experience)\n\nIt's 3 of them\n1 was a cofounder of an \"almost\" unicorn\n1 was a PM at the same company\nThe last is a VC but they're minority stake + non operational",
              "score": 10,
              "created_utc": "2026-02-04 07:55:58",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3hwycr",
                  "author": "luew2",
                  "text": "LOIs are worthless, ask me how I know. Money in the bank and signed legally binding contracts are all that matter.\n\nSeed funding is easy to come by if you know the right people, also shouldn't count for much. Industry experience matters except for the fact that they don't have someone with tech building industry experience and they started a tech company. This reeks of bad decision.",
                  "score": 23,
                  "created_utc": "2026-02-04 08:24:45",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o3kxqps",
                  "author": "7HawksAnd",
                  "text": "Are you sure it’s tech focused and not just tech enabled? Lots of companies and startups think they’re a tech company but they’re closer to mechanics than auto engineers. That’s not a slight to mechanics, just a pragmatic parallel.",
                  "score": 6,
                  "created_utc": "2026-02-04 19:07:17",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o3hslw0",
              "author": "Comfortable_West_758",
              "text": "Well the sizable seed changes things fs",
              "score": 2,
              "created_utc": "2026-02-04 07:44:52",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3hwrfr",
                  "author": "luew2",
                  "text": "Not imo. 5 mil isn't a crazy seed and doesn't inspire confidence of success if they are building without an experienced tech lead.\n\nHalf my batch raised that amount with barely a demo so I don't think that should dictate a decision here.",
                  "score": 8,
                  "created_utc": "2026-02-04 08:22:54",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3i0n61",
          "author": "ExtensionSuch5946",
          "text": "Offer to join as a cofounder if you really believe in it. I'd never join a tech startup as their first and only engineer.",
          "score": 19,
          "created_utc": "2026-02-04 08:59:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3jpvdc",
              "author": "happyfce",
              "text": "There are 3 others joining but I'll be the first by a month or two",
              "score": 5,
              "created_utc": "2026-02-04 15:47:12",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3ny3zv",
                  "author": "gottamove_d",
                  "text": "If startup is building tech product, without having a tech founder, who has skin in the game,  you are going to be run around by the non-technical founder who will treat you as workers without no understanding of what’s feasible what’s not. \nAlso, your founder is being stingy by not sharing equity with you, and not making you CTO, while expecting CTO like work from you.",
                  "score": 3,
                  "created_utc": "2026-02-05 04:50:51",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o3pc2og",
                  "author": "ThreePedalsRequired",
                  "text": "They have nobody technical. Demand to be a co-founder and CTO. \n\nThis is relevant here than you're posting in the Y Combinator community. There's a reason why YC really, really, wants at least one technical founder. Who is actually going to build it? \"Idea guys\" are abundant and you can find 50 in any bar you go to in SF. The people building the product are the actual valuable ones. In this case, you're the valuable one.",
                  "score": 3,
                  "created_utc": "2026-02-05 12:06:42",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o40e8gy",
                  "author": "Important_Pause_7995",
                  "text": "If that's the case, congrats - you are the de facto CTO. ",
                  "score": 1,
                  "created_utc": "2026-02-07 01:58:32",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3kidr8",
          "author": "secondkongee",
          "text": "It’s a red flag. Technical cofounder sets the technical vision for the company. Don’t expect they could come up with any AI native products. And if it’s a SaaS. Run. Pure SaaS products are getting slaughtered by AI.",
          "score": 8,
          "created_utc": "2026-02-04 17:58:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3io35w",
          "author": "ruibranco",
          "text": "Not a red flag by itself if the founders have strong domain expertise and have proven they can sell (LOIs + seed raised are good signals). The real question: what happens when you need to make hard technical tradeoffs? Will they understand when you say \"we can ship X in 2 weeks or Y in 6 months, pick one\"? Or will you constantly be fighting scope creep because \"it can't be that hard\"? On equity: founding engineer at seed stage, especially being the only technical person, should be 1-3% vesting over 4 years with 1 year cliff. Less than 1% and you're basically being hired as an employee with startup risk and no startup upside. More important than the number: get proper acceleration on change of control and make sure your equity is real (no repurchase rights at original price).",
          "score": 2,
          "created_utc": "2026-02-04 12:22:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3k01v7",
          "author": "FounderBrettAI",
          "text": "not necessarily a red flag if they raised that much without a technical cofounder. It means they probably have strong market validation and investor confidence, but you need to make sure they actually respect engineering as a core function and aren't just treating you as \"the person who builds what we tell them to.\" for equity, first engineer should be looking at 1-3% depending on the stage, but honestly if they don't have technical leadership and you're building everything, push for the higher end or a cofounder title",
          "score": 2,
          "created_utc": "2026-02-04 16:34:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3l5nbq",
          "author": "Popular-Role-6218",
          "text": "They bring the money. But they should give you 5%+ equity if you will be the head of Engineering and kind of tech co-founder for them.",
          "score": 2,
          "created_utc": "2026-02-04 19:44:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3i9ypg",
          "author": "Competitive_Buyer264",
          "text": "Which industry experience you are looking for?\nLike finance, blockchain, ecommerce, Ai, trading?",
          "score": 1,
          "created_utc": "2026-02-04 10:27:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ikdcy",
          "author": "bdavis829",
          "text": "It is not a red flag for me but it will be difficult being the first engineer. Ask them about their previous experience working with engineers in previous companies and see what they say. \n\nI don't know what kind of equity to ask for but if things work out and you find yourself in a CTO role you will renegotiate equity anyways. Also, the equity is not worth a lot if the company runs out of money or you leave.",
          "score": 1,
          "created_utc": "2026-02-04 11:55:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3jv0oo",
          "author": "Available_Ad_5508",
          "text": "The norms have shifted a lot. Many, many Tier 1 Series As have happened in the past year without a true CTO on the founding team. Of course, the founders still need to be able to set a technical direction (e.g. former product leaders who were very hands on) and need to be able to hire engineers. \n\nAgentic coding has really moved the goal post on what you need to find early PMF. Business execution is more important than ever - you no longer need a founding CTO to spend the first 9 months setting up a bunch of CRUD, SSO, integrations, etc that used to be the barrier to any forward progress.",
          "score": 1,
          "created_utc": "2026-02-04 16:10:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3jztxo",
              "author": "happyfce",
              "text": "do you have any examples?",
              "score": 1,
              "created_utc": "2026-02-04 16:33:03",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3kc4lt",
          "author": "moonerior",
          "text": "Are they hiring a CTO as well or does the person think he can manage engineers himself? If the latter, run.",
          "score": 1,
          "created_utc": "2026-02-04 17:29:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3lble7",
          "author": "tony4bocce",
          "text": "I wouldn’t accept technical cofounder position without technical cofounder equity. It’s a very heavy grind and I came to the realization I’d only do that level of commitment in a founder role with equity compensation to match, not a meaningless title",
          "score": 1,
          "created_utc": "2026-02-04 20:12:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3mcpvm",
          "author": "salespire",
          "text": "Not a red flag by default - but it raises the bar for equity and influence",
          "score": 1,
          "created_utc": "2026-02-04 23:14:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3nta2o",
          "author": "sailormish980",
          "text": "If one of the founders have technical background then other founder should be the marketing person or the one who totally focus on distribution",
          "score": 1,
          "created_utc": "2026-02-05 04:18:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ru3g4",
          "author": "PM_ME_DIRTY_MSGS",
          "text": "If you told me they're serial founders, building a tech company, don't have a technical founder, but they know some good ones and are actively working to bring one onboard, I'd maybe give them the benefit of the doubt for a short while. But that's not what you're saying.\n\nI think the problem I foresee here is: when there's a leadership meeting, who can speak credibly to the tech side of the business to the other leaders? who is advocating for the technical organization?\n\nWithout that, the **absolute best case scenario** is that decision making is slowed because every meeting they have to leave the meeting to gather input from the tech side. And as we all know, startups thrive on slow decision making.\n\nThe more *likely* scenario is that...well, the tech side of the organization gets hosed. They will made decisions without any technical expertise providing input, those decisions will suck, and then there will be no one to explain to them why their decisions suck. Then they will throw you guys under the bus, first just in their own heads, but then eventually in reality when they act on what's *in* their heads'.\n\nIf the company is a tech company, you need someone who knows tech in those leadership meetings -- and not just present, but someone with the clout to go toe-to-toe with the rest of the leadership. So they have to be at least on somewhat equal footing with the founders in influence somehow.\n\nAt the very least, ask them these questions, and see what they have to say. I suspect they're going weasel a bit and say \"well, we know a thing or two about what we're trying to build, Q founder will be responsible for you in addition to X, Y, Z responsibilities.\". And then I would be unpersuaded and would run. Whatever they say needs to be DAMN convincing to persuade me to stay.",
          "score": 1,
          "created_utc": "2026-02-05 19:42:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3td7s8",
          "author": "Crafty_Swordfish2534",
          "text": "What will the rest of the three founders do?\n\nSometimes, too many cooks spoil the broth.",
          "score": 1,
          "created_utc": "2026-02-06 00:21:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3tsin4",
          "author": "keepap1",
          "text": "If you want to do startup greenfield fun and are excited by the problem space.  What have you got to lose?",
          "score": 1,
          "created_utc": "2026-02-06 01:51:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3unq39",
          "author": "FalconRelevant",
          "text": "10% equity minimum or bounce.\n\n(Unless it's a non-tech startup, then the usual 1% to 2% is reasonable)",
          "score": 1,
          "created_utc": "2026-02-06 05:09:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3vtr77",
          "author": "novychok",
          "text": "VC funded a semi technical startup with no tech lead? Sounds like a huge red flag, is the co-founder an engineer? If not, I’d expect a huge mess 🚩the othey way round with ONLY the engineering founder would make sense but since when tech bros at VCs care about common sense? I worked at a startup that sold a LLM based product that didn’t existed, we started building the UX months after they sold it to clients 🤡 If they’re hiring you, did they present the whole product? What’s the current technical setup? ",
          "score": 1,
          "created_utc": "2026-02-06 11:21:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3w9vku",
          "author": "Odd-Time-7967",
          "text": "This will get downvoted because technical people are horribly insecure and social morons, but thats fine.\n\nI work in VC, have founded a company, and over time, I have been amazed at 2 things:\n\n1) most non-technical founders/ idea guys are not actually non-technical founders they are posers. I really hate the phrase “non-technical founder” for this reason because there is a radical difference between some mba who is going to run “business” or “marketing” and someone who doesn’t code, but has a very unique insight to a specific market and can raise capital. There are a ton of people who can say they “have an idea” HOWEVER, a good non-technical founder is way way way more important than a technical hire and it isn’t close. There is a reason zuck and Elon aren’t coding or in the cto role. The #1 reason startups fail isn’t “shipping speed” it’s they build something people don’t actually want or solve a problem that isn’t actually acute enough, or they mismanage cash. YC optimizes for someone technical because otherwise you aren’t going to be able to build something. But don’t get it twisted—knowing what to build is actually the hard part and that’s so overwhelmingly obvious to anyone that has invested. The whole point of a seed round is to find product market fit.\n\n2) technical people are some of the most arrogant antisocial, naive people I have ever met. They could win an award for most wasted talent due to being a social moron. I say this due to watching sometimes brilliant people overplay their hand, set hard rules, not understand fundraising/capital markets and just be so flipping arrogant about their value as “builders”. A great example of this is thinking all equity grants can be compared across companies. Thinking 2% for a founding engineer role for a SaaS company with customers and a previously existed CEO should be compared to a 5% grant at an AI company with a 24 year old ceo is the sort of dumb math technical people do. Ultimately, it tends to be more about their egos and insecurity than rational business decisions. I would avoid this if I were you.\n\nNow, for this situation, it seems like the non-technical person is legit with a prior huge exit, market validation, and they can fundraise. This massively derisks the venture and they are way further along than would justify you being a cofounder.\n\nYou need to make a calculated bet on 2 things:\n1) how big could the company be?\n2) how much do they respect technical people or have quasi understanding?\n\nIf the equity offer is very low, that says something. Likewise, I’d just ask what their plans are for a CTO and how your role could grow and change. You should also be able to ask questions about the vision, your role, and what they find important in their product to reveal technical attitude. \n\nIt is possible for someone to be a subject matter expert and brilliant manager who doesn’t code, but is able to learn and heed the advice of technical people around them. It’s only a red flag if the non-technical people show a complete lack of competence or interest in understanding technical limitations and don’t value technical product constraints at all.\n\nSo, in other words, there are no rules, with startups everything is highly specific to the company. Don’t be the classic technical moron trope, but make sure the non-technical people are more like Sam A, zuck or Elon with a decent understanding and aptitude to talk with you about technical challenges otherwise you will have a bad time.",
          "score": 1,
          "created_utc": "2026-02-06 13:14:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3x2e2j",
          "author": "quietoddsreader",
          "text": "not necessarily a red flag if the founders are sharp, but it usually means you’ll have a lot of ownership and also a lot of chaos. at seed without a technical founder, equity needs to reflect both risk and how much you’re shaping the core product... something north of normal early-engineer levels.",
          "score": 1,
          "created_utc": "2026-02-06 15:42:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o40dx4q",
          "author": "Important_Pause_7995",
          "text": "They may just want to see who rises to the top. Sounds good in theory, and could be great in theory. Could also be terrible. If they're serial founders, and you have confirmed their previous work and success, I wouldn't worry too much. It could also be that no one who worked with them on previous projects wants to work with them again. HAHA. So, hard to know.",
          "score": 1,
          "created_utc": "2026-02-07 01:56:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3htsoz",
          "author": "IHaveNeverEatenACat",
          "text": "Industry average is around 2% for first 5 engineers. ",
          "score": 1,
          "created_utc": "2026-02-04 07:55:35",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qv5t15",
      "title": "Could OpenAI be the main competitor of most AI-based startups?",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1qv5t15/could_openai_be_the_main_competitor_of_most/",
      "author": "Miyamoto_Musashi_x",
      "created_utc": "2026-02-03 22:04:05",
      "score": 44,
      "num_comments": 40,
      "upvote_ratio": 0.94,
      "text": "Recently, I heard someone say that OpenAI could become the biggest competitor to many AI-based startups, since it can integrate solutions natively into its own products.\n\nI’d like to know what others think about this. Do you agree, or do you see it differently?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1qv5t15/could_openai_be_the_main_competitor_of_most/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o3f88d0",
          "author": "DankKid2410",
          "text": "Why do you think most startups that are chatgpt wrappers called useless? Because for openai/Google/msft it is way easier to get a distribution network than it is for a new startup today",
          "score": 25,
          "created_utc": "2026-02-03 22:10:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3febty",
          "author": "sssanguine",
          "text": "How was this not self evident from day 1? Who didn’t think the model companies wouldn’t package **their** product to solve the most rote business cases?",
          "score": 10,
          "created_utc": "2026-02-03 22:40:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o42z1e2",
              "author": "impioushubris",
              "text": "[ Removed by Reddit ]",
              "score": 1,
              "created_utc": "2026-02-07 14:13:22",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3ghjtr",
          "author": "hrishikamath",
          "text": "Right Microsoft was supposed to build all the apps because it built the OS too. Or same goes for Google which should have been $META because they could just do whatever meta did. Think deeper about this topic. YouTube music/Apple Music should have clearly won but Spotify still exists. So many such examples. It’s all about focus and lethargy of big tech. I am still waiting for Microsoft copilot beating cursor, it’s been 4 years.",
          "score": 15,
          "created_utc": "2026-02-04 02:16:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3kzrop",
              "author": "Available-Progress17",
              "text": "Microsoft’s internal models are shi* . We were part of an adversarial evaluation commissioned by MS. In 17 categories it ranked last . The simple fact they have GitHub may be the only hope. Or for practical matters they have lost the bus!",
              "score": 2,
              "created_utc": "2026-02-04 19:16:33",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3fme5j",
          "author": "random-trader",
          "text": "Look at all coding agents. They are billions dollar companies and you guys are still in wrapper talk.",
          "score": 14,
          "created_utc": "2026-02-03 23:23:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3fgbmo",
          "author": "BASSAM_MEJ",
          "text": "It's a good thing btw, it validates your solution + bringing more value",
          "score": 3,
          "created_utc": "2026-02-03 22:51:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3fvtjn",
              "author": "Miyamoto_Musashi_x",
              "text": "It's an interesting approach.",
              "score": 1,
              "created_utc": "2026-02-04 00:14:52",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3i0mvq",
          "author": "aggressive-figs",
          "text": "This is why VCs will ask you “if your TSM is x billion, what stops OAI from doing it?”\n \nThat’s probably why deep tech businesses right now look so resilient.",
          "score": 3,
          "created_utc": "2026-02-04 08:59:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3grf6f",
          "author": "YS_askOdin",
          "text": "This is effectively the \"Killer Question\" in almost every VC (not just YC) interview: \"Why won't Google/OpenAI kill you?\"\n\nI am building right now, but having sat on both sides of the table (Builder and Investor), the answer usually comes down to incentive structures, not just code.\n\n**1. The Horizontal vs. Vertical Paradox**  \nOpenAI and Anthropic are fighting a war for horizontal dominance. They need to build a model that works \"pretty well\" for 1 billion people.\n\nIf they stop to build a deep, perfect workflow for just Tax Accountants or just Supply Chain Managers, they lose the wider war. That is our gap.\n\n**2. The 'Liability Shield' (The Real Moat)**  \nThis is the strongest defense for startups like us. OpenAI provides intelligence, but they cannot provide liability.\n\nIf ChatGPT gives bad legal advice, OpenAI says \"Check our TOS, it's an AI.\"  \nIf a vertical SaaS gives bad legal advice, they lose the client.\n\nThe next wave of startups isn't just selling text generation; we are selling the verification and safety rails that allow enterprises to actually use that text. OpenAI avoids this layer because it carries too much regulatory risk for a general platform.\n\n**3. Data Gravity**  \nIf you are just a UI wrapper, you are dead.\n\nBut if you build a layer above and make OpenAI a utility (like AWS), you change the framing and narrative. OpenAI is a tool supporting you, not a competitor.\n\nDifferent talents and market opportunities compete differently. The game isn't to beat OpenAI at being \"smart\"; the game is to segment the market and own the niche where specific context matters more than general intelligence.",
          "score": 8,
          "created_utc": "2026-02-04 03:12:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3y4udh",
              "author": "Boring_Cartoonist952",
              "text": "This sounds AI generated.",
              "score": 3,
              "created_utc": "2026-02-06 18:44:24",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o40iqqm",
                  "author": "Adventurous_Tank8261",
                  "text": "It is a good summerization and it covers most of the responses",
                  "score": 1,
                  "created_utc": "2026-02-07 02:26:10",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3fjrx3",
          "author": "Asleep-Eggplant-6337",
          "text": "No. Just like Apple doesn’t build all these apps.",
          "score": 5,
          "created_utc": "2026-02-03 23:09:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3g3qkw",
          "author": "hello5346",
          "text": "Google is eating OpenAI's lunch right now.",
          "score": 4,
          "created_utc": "2026-02-04 00:58:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3hfepe",
          "author": "dip_ak",
          "text": "Yes, they are building all sort of things with massive value. But they won't build niche products and specific use cases like AI CRM, support desk, b2b marketing, etc",
          "score": 2,
          "created_utc": "2026-02-04 05:52:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3gle32",
          "author": "attn-transformer",
          "text": "If your startup is to build excel sheets and put stuff on calendars then yeah, most users will get that for $20/month ChatGPT subscription. \n\n\nYou need to figure out what your moat will be.  Data no one else has is the obvious moat but there are others, such as a specialization in a specific subject or process.",
          "score": 1,
          "created_utc": "2026-02-04 02:37:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3gn4wz",
          "author": "wasabimaxxer",
          "text": "This a primary question, whether specific apps or models are really useful or if ChatGPT can be just used for everything",
          "score": 1,
          "created_utc": "2026-02-04 02:47:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3gvb51",
          "author": "abhyudaya8",
          "text": "Yeeh it is what it is. But still packaging and delivery 🚚 matters branding and focusing on nich problem and segment would still make sense. ",
          "score": 1,
          "created_utc": "2026-02-04 03:35:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3hppcm",
          "author": "Status-Corner-5947",
          "text": "Hmm honestly I think it depends on how niche your product is... OpenAI is really good at building general-purpose tools but they can't go deep into every industry or workflow. The startups that are most at risk are the ones just wrapping GPT with a thin layer on top - yeah those are probably in trouble. But if you're solving a very specific problem for a very specific audience with proprietary data or deep domain expertise, OpenAI isn't as threatening. It's kind of like how AWS didn't kill every SaaS company even though they could technically build anything... distribution and specialization still matter a lot 🙂",
          "score": 1,
          "created_utc": "2026-02-04 07:18:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3hzsui",
          "author": "hulk-konen",
          "text": "They just don't have the resources to focus on every vertical. And even if they did pick your niche, historically MSFT, Google etc haven't always won. We have, for example Salesforce, Slack, Figma still around, although platform players have tried to win those battles. ",
          "score": 1,
          "created_utc": "2026-02-04 08:51:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3ib0ah",
          "author": "zdzarsky",
          "text": "I think they will on their road to AGI, but with few caveats:  \n\\- we are in a beautiful bubble that can write useful prompts for their businesses, majority of people can't  \n\\- unicorn model in agent space is still -  do a wrapper, get more data, build your better model for a vertical tasks (i.e. Cursor)  \n\\- with distribution for 1B users, $10-$100M markets become irrelevant, and they are still a space where you can do better, or give user more comfort. Just as an example (on some bigger numbers than what I brought) - AWS will never outcompete Vercel, because it's too niche to dig into, and not worth competing (acquisition is a natural scenario)",
          "score": 1,
          "created_utc": "2026-02-04 10:36:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3idfeb",
          "author": "Straight-Gazelle-597",
          "text": "No doubt.",
          "score": 1,
          "created_utc": "2026-02-04 10:58:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3iwdqa",
          "author": "AdResident780",
          "text": "it was the same rumor we heard time and again.   \n\"OpenAI's Agent Builder just killed N8N!\"  \n\"OpenAI's Shopify integration just killed E-commerce!\"  \n\"OpenAI's CODEX just killed Cursor and Windsurf!\"\n\nit's just a hype cycle...",
          "score": 1,
          "created_utc": "2026-02-04 13:15:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3izoih",
          "author": "fequalsqe",
          "text": "Yes, they will try to fuck you at every opportunity. It happens so quickly.",
          "score": 1,
          "created_utc": "2026-02-04 13:34:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3j3fjs",
          "author": "Portfoliana",
          "text": "Platform risk is real, but \"OpenAI will do everything\" is the new \"Google will do everything\" from 2010. Google launched countless products that competed with startups - and category leaders like Slack, Zoom, Shopify still won their markets. The companies that survived weren't just \"better at one thing\" - they owned proprietary data, built workflow integrations their users couldn't leave, or went vertical in ways a platform player couldn't.\n\nThe startups in danger are the thin wrappers - \"ChatGPT but for X\" where X requires no special data or workflow. The ones that survive will have distribution OpenAI can't easily replicate, proprietary training data, or deep integration into customer systems. If your entire moat is \"we have a nice UI on GPT-4,\" yes, you should be worried.",
          "score": 1,
          "created_utc": "2026-02-04 13:54:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3j449e",
          "author": "Vymir_IT",
          "text": "Yes.",
          "score": 1,
          "created_utc": "2026-02-04 13:58:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3j8sxs",
          "author": "In_Or_Out_Of_Scope",
          "text": "AGI will be like the introduction of firearms to Karate.",
          "score": 1,
          "created_utc": "2026-02-04 14:23:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3km65d",
          "author": "secondtalent",
          "text": "I run a talent platform and we see hiring shifted from \"build AI models\" to \"use AI in workflows.\" The model layer is becoming infrastructure. I guess GPT wrappers won't survive like this, Startups with proprietary data or deep vertical expertise can tho.",
          "score": 1,
          "created_utc": "2026-02-04 18:15:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3lhthw",
          "author": "Money-but-Vanilla",
          "text": "Nope, depends on how niche vs generic your product is",
          "score": 1,
          "created_utc": "2026-02-04 20:42:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3lkfpz",
          "author": "rosstafarien",
          "text": "You have to have a moat distinct from your proprietary prompts. Maybe yours is privacy. Maybe you get latency way down by running fine tuned models on edge hardware. Maybe you run even when the network sucks or disappears. Maybe your evaluation and improvement feedback loop is built on data OpenAI doesn't have access to. There are sooo many ways to have a moat. Come up with your moat early, otherwise yeah, Anthropic or OpenAI is just going to incorporate your service into theirs.",
          "score": 1,
          "created_utc": "2026-02-04 20:54:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3myknj",
          "author": "brads0077",
          "text": "Bill Gates, Mark Zuckenberg, Jeff Bezos, and Sam Altman are all really smart thieves who monitor what people do on heir sites and then steal the ideas. A business model that has been around a long time.",
          "score": 1,
          "created_utc": "2026-02-05 01:16:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3owe0t",
          "author": "Astraltraumagarden",
          "text": "I imagine consolidation of markets will begin. Reducto, Vapi, etc will start getting bought out. But like, are you building dumb shit (not that those are but unless you’re really innovating why build another Reducto). Are you building calorie tracker app? Or some other bits of BS? Then yes, because GPT chat interface could do it. But generally? No. \n\nIt can’t do AI marketing copilot, building nothing in healthcare admin, IT or others. Like it’s a long shot. Stop asking these questions, build and validate.",
          "score": 1,
          "created_utc": "2026-02-05 09:50:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3s8h3a",
          "author": "FalconRelevant",
          "text": "Why didn't banks just make Stripe?",
          "score": 1,
          "created_utc": "2026-02-05 20:50:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3x28wa",
          "author": "Cultural-Cod5301",
          "text": "Open AI was the first once to come in the market but it's not the best. Many ai in the market has taken over my personal favourite is gemini it has better integration",
          "score": 1,
          "created_utc": "2026-02-06 15:41:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o45d6xy",
          "author": "TenZenToken",
          "text": "No. Successful startups usually have that narrow focus that solves those tight, specific problems better than the big boys. It’s why they usually get acquired later and the product and attention to detail to that specific user type ends up going to shit.",
          "score": 1,
          "created_utc": "2026-02-07 21:35:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3fa4b5",
          "author": "hello5346",
          "text": "Why do you think we use other models. Openai will never go there.",
          "score": 1,
          "created_utc": "2026-02-03 22:19:47",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qxv3ts",
      "title": "S26 Application closes in 3 days",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1qxv3ts/s26_application_closes_in_3_days/",
      "author": "hduynam99",
      "created_utc": "2026-02-06 21:51:55",
      "score": 38,
      "num_comments": 19,
      "upvote_ratio": 0.91,
      "text": "My team about to hit submit on our YC application after two months of steady work. Surprising part: the more we wrestled with the questions, the more clearly we understood the product, the users, and ourselves. We trimmed jargon, tightened the problem, and built tiny proofs instead of big promises. A few lessons we’re taking with us:\n\n* YC questions are a mirror. If an answer is fuzzy, the product is probably fuzzy.\n* “Why now?” forced us to look beyond hype and pinpoint a real shift.\n* User conversations beat deck polishing every time.\n* Cutting scope isn’t defeat; it’s speed.\n* Numbers calm nerves. Rough unit economics exposed weak assumptions.\n* Write -> sleep -> rewrite. Clarity compounds.\n\nWe also came away more honest about risk: what must be true, what could kill us, and what we’ll do next week to reduce uncertainty. Regardless of the outcome, the process itself created momentum and better habits: shorter cycles, crisper metrics, and less ego in the roadmap.\n\nTo everyone applying this batch: you've got this. Good luck, back to the grind.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1qxv3ts/s26_application_closes_in_3_days/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o3zpvz1",
          "author": "puddle-shitter",
          "text": "isnt it x26",
          "score": 7,
          "created_utc": "2026-02-06 23:33:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3zq9oj",
              "author": "hduynam99",
              "text": "It is Spring 26",
              "score": 0,
              "created_utc": "2026-02-06 23:36:07",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o412ozx",
                  "author": "ivalm",
                  "text": "spring 26 = x26",
                  "score": 3,
                  "created_utc": "2026-02-07 04:38:46",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o415nih",
                  "author": "BASSAM_MEJ",
                  "text": "S = Summer\nX = Spring",
                  "score": 2,
                  "created_utc": "2026-02-07 05:00:30",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o41d1o3",
          "author": "quantumsequrity",
          "text": "Dou have traction?",
          "score": 2,
          "created_utc": "2026-02-07 05:59:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o41saqp",
              "author": "hduynam99",
              "text": "Yes i do have some, my sub reddit growth 30% MoM. And i got 147 free sign up & 3 paid with early deal.",
              "score": 2,
              "created_utc": "2026-02-07 08:18:05",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o42ppd0",
                  "author": "cranlcom",
                  "text": "I also applied to YC, we have a lot of traction I HOPE they accept us really",
                  "score": 1,
                  "created_utc": "2026-02-07 13:17:13",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o42r64q",
          "author": "prc41",
          "text": "Best of luck I’m putting my name in the hat as well. I’m pre revenue but been a project I wanted to do for the last 8 years and ai finally made it possible. \n\nProbably a ton of that type of competition now though with agentic coding becoming so powerful. Normal industry peeps like me can much more easily launch a startup on their own.",
          "score": 2,
          "created_utc": "2026-02-07 13:26:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o43l2sg",
              "author": "hduynam99",
              "text": "Yes, AI just give me a freaking super power. I can build anything",
              "score": 1,
              "created_utc": "2026-02-07 16:08:31",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o44lnog",
          "author": "vikentii_krapka",
          "text": "Just sent my application. But my chances are rather slim. I have deployed production app but it is still not publicly launched",
          "score": 2,
          "created_utc": "2026-02-07 19:08:57",
          "is_submitter": false,
          "replies": [
            {
              "id": "o44ozda",
              "author": "hduynam99",
              "text": "keep building, never under estimate your potential.",
              "score": 1,
              "created_utc": "2026-02-07 19:25:51",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1quxmyi",
      "title": "Enroll in YC Startup School before posting questions here.",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1quxmyi/enroll_in_yc_startup_school_before_posting/",
      "author": "ConcernedOnly",
      "created_utc": "2026-02-03 17:07:15",
      "score": 31,
      "num_comments": 8,
      "upvote_ratio": 0.89,
      "text": "Hey wannabe startup founders. Before asking \"How do I validate my startup idea?\" or \"How do I find users for my minimum viable product?\", enroll in the free YC Startup School. It covers all that and more in their curriculum.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1quxmyi/enroll_in_yc_startup_school_before_posting/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o3f55du",
          "author": "ruibranco",
          "text": "Honestly the best part of Startup School isn't even the curriculum - it's the weekly group sessions where you have to report what you actually did. Forces you to stop overthinking and start shipping. Most people asking \"how do I validate my idea\" don't need another framework, they need accountability to go talk to 10 potential customers this week.",
          "score": 7,
          "created_utc": "2026-02-03 21:56:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3oxv7q",
          "author": "s43stha",
          "text": "this is a good advice.",
          "score": 2,
          "created_utc": "2026-02-05 10:04:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3dgsa2",
          "author": "Gagan_deep8",
          "text": "Second YC start-up school!, great content there",
          "score": 1,
          "created_utc": "2026-02-03 17:17:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3e3xz9",
          "author": "Sea-Comfortable-2278",
          "text": "Let's talk 😆",
          "score": 1,
          "created_utc": "2026-02-03 19:02:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3j7cu8",
          "author": "alphaomegax12",
          "text": "thanks a lot for the heads aup",
          "score": 1,
          "created_utc": "2026-02-04 14:15:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3jml29",
              "author": "ConcernedOnly",
              "text": "You're welcome.",
              "score": 1,
              "created_utc": "2026-02-04 15:31:53",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3q6pzv",
          "author": "kewkartik",
          "text": "YC Startup School is great. Their Root Access channel is pretty sweet too.\n\nAlso, while ur at it, check out Cheeky Pint from Stripe.",
          "score": 1,
          "created_utc": "2026-02-05 15:06:25",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qu5xjr",
      "title": "I could use all the advice I could get.",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1qu5xjr/i_could_use_all_the_advice_i_could_get/",
      "author": "grazmakes",
      "created_utc": "2026-02-02 20:03:28",
      "score": 15,
      "num_comments": 40,
      "upvote_ratio": 0.8,
      "text": "Hey everyone,\n\nNew to this subreddit but I am looking for all the advice I can get. About 20 years ago, I had an idea for a social media website (sorry don’t want to give too much info away) while I was college and tried to learn as much web development as I could (design and database) and after awhile I just gave up as I had no connections to anyone in the development world and just gave up. Fast forward to today, with the help of Claude and Codex and about 6 months of time, I have the site just about fully working beyond just a proof of concept (beyond just an mvp I think). I know people always feel confident about their ideas and whatnot, but I feel this site has potential to make money from day one and the more people use it, the more money it could generate. I’m about as new to the startup world as you can get and looking for any advice I can to see how I can either find funding from investors, to perhaps try to keep going and get this idea off the ground myself? As I'm the only one navigating this path, I have so many questions but I’m finding it tough to find a course that will educate me to even ask the questions I need if that makes sense. Again my apologies for the lack of details as far as the site goes, but I'm just trying not to get burned. thank you in advance. I'm located in Boston if that help :-)",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1qu5xjr/i_could_use_all_the_advice_i_could_get/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o37tnp0",
          "author": "justgord",
          "text": "\nshow traction .. its really the thing investors care about, and will get you a better deal.\n\nie.  growth in views, signups, monthly subs.\n\nI wasted too much time talking to VCs pre-traction - plus you only get good terms when you are ramen-profitable and dont need them :]",
          "score": 10,
          "created_utc": "2026-02-02 20:14:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o37vc3p",
              "author": "grazmakes",
              "text": "I guess this is where im at a crossroad, right now it seems to be just about a working site, as I'm one person use AI with not a ton of knowledge about developing, I feel like that's not good enough/secure to open it to the public yet? Im about to send beta invites to friends to have them use and give me feedback on the site but beyond that is where i get a little gun-shy. For instance, having one or two people i can show and have them really give quality feedback/advice would help immensely",
              "score": 2,
              "created_utc": "2026-02-02 20:22:41",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3d8zyv",
                  "author": "Sea_Surprise716",
                  "text": "Why are you gun shy about having users, for a social media site? If it can make money from day 1, why not get to day 1 as fast as possible?\n\nIf it’s easy enough to copy that someone can “steal” it with just the idea before you launch, it is definitely easy enough for them to copy it after you launch. Especially since they’ll have development talent that you don’t.\n\nAnd if you’re not a developer, and using just Claude or lovable or something to code, the site is definitely not secure or stable enough to scale with actual users and their personal data. \n\nThat is not an investable picture. Either launch and prove traction, particularly prove that it can make money from day 1, or move on.\n\nThis all might come across as harsh, but it’s meant to encourage you to avoid over investing, so you can free yourself up to be successful. I really love entrepreneurial energy and dedication, but it always bothers me to see people get so in love with a particular idea that they waste months or years on building in private, instead of testing ideas actively until one genuinely solves a problem and resonates with actual customers.",
                  "score": 3,
                  "created_utc": "2026-02-03 16:41:52",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o385sk5",
          "author": "AnonymousCrayonEater",
          "text": "We’ve all been there so I’m not trying to be judgmental or anything, but the idea is worth absolutely nothing. It’s mostly about distribution and execution.",
          "score": 7,
          "created_utc": "2026-02-02 21:12:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o38668u",
              "author": "grazmakes",
              "text": "thanks for the input!",
              "score": 1,
              "created_utc": "2026-02-02 21:13:49",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3j185o",
                  "author": "livingbyvow2",
                  "text": "FYI OP this applies especially for a consumer business.\n\nYou need to get some positive noise around you platform to get it to start getting traction, which is antithetical with staying in stealth mode.\n\nHow you grab people's attention at a time where attention has been so overstimulated (from click baiting to rage baiting and back) that we all suffer from \"attention fatigue\" is your main challenge...",
                  "score": 2,
                  "created_utc": "2026-02-04 13:42:52",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3887k9",
          "author": "galvinw",
          "text": "Any network effect business is pitched based on the perceived benefit to the user of the business + the virality quotient. As such the best way to raise money is raise users",
          "score": 6,
          "created_utc": "2026-02-02 21:23:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o38h5qz",
              "author": "RoleHot6498",
              "text": "Music to my ears...on repeat",
              "score": 1,
              "created_utc": "2026-02-02 22:05:54",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o39pvdn",
          "author": "NoFun6873",
          "text": "Sadly, this is a mature market with channel control by the majors. They invest so much it would be hard for you to launch a site. Now having said that, the majors need to compete and the bigger they get the less innovative they are. This means that you maybe able to sell your engine to them. I company I worked with several years ago sold their engine for $8 million. Now to investors that is small but if it were in your pocket, it would be life changing.",
          "score": 5,
          "created_utc": "2026-02-03 02:08:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3a3iai",
          "author": "floppybunny26",
          "text": "Go through YC Startup school. It's free and about 20 hours of content. Once you've gone through that you'll have 90% of your questions answered and you can come back here with a better foundation. https://www.startupschool.org/",
          "score": 5,
          "created_utc": "2026-02-03 03:27:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3dvx5t",
              "author": "grazmakes",
              "text": "awesome! thank you so much for the input!!! i know what im starting tonight!",
              "score": 2,
              "created_utc": "2026-02-03 18:26:26",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o38h0sp",
          "author": "RoleHot6498",
          "text": "Asking as someone who raises Capital for startups- Can you at least talk about the unique problem being solved or the common problem being uniquely solved? ",
          "score": 3,
          "created_utc": "2026-02-02 22:05:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3asiwl",
          "author": "IfBobHadAnUncle",
          "text": "“About 20 years ago” you had an idea? \nWhich is a “social media website”?\nThat you won’t share, and have not even let your friends try? \n\nAnd you are asking Reddit for advice, because you are so new to startups that you are struggling to find a course to educate you to even ask the right questions?\n\nStep 1: Move out of the cave you have been living in the last 20 years. \nStep 2: Ask your technical co-founder Claude, “what are the right questions to ask as a startup founder with a 20-year-old idea for a social media website with no experience and a phobia of sharing me idea who is seeking advice on Reddit about my startup idea?” \nStep 3: ask yourself if actually, living in that cave with an unfulfilled dream was a better existence than the harsh light of reality.",
          "score": 3,
          "created_utc": "2026-02-03 06:25:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3cl61p",
              "author": "grazmakes",
              "text": "um ok. first off, thanks for the input? secondly, yeah had an idea, didn't have the skills to fully develop it, life then gets in the way. fast forward 20 years, we live in a crazy time where certain AI's are actually helpful in realizing an idea, so i went for it. working on it for the last 6 months and try to debug and improve as much as i could, I surpassed the basic idea into something i feel might be pretty cool for people to use and to socialize on. while I've been working on it, I've been trying to do as much research as I can. that being said, there's a lot out there and, I dont know, I feel like asking people still yield the best results (sometimes). the idea doesn't really matter. what i was asking is more general advice about if someone has an idea and is very new in a scene that has changed significantly in the last 5 years, let alone 20. I have let me friends try, the problem with friends are they are usually going to be bias no matter if you say \"give me your honest opinion\". if I were to go by their feedback alone, Im sitting on the next instagram which i know is probably not correct.  the problem I'm currently encountering is that middle growth. beyond friends, but don't think its quite ready for a public beta. this is why I'm asking the questions from my original post. and yeah, Im currently a little gunshy at showing the site off as of now. I've yet to find a site that executes the idea the same way as the site and for the time being am holding it a little close to the chest.",
              "score": 1,
              "created_utc": "2026-02-03 14:47:43",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3eariy",
                  "author": "IfBobHadAnUncle",
                  "text": "Ok\nMarketplaces, platforms, and networks (like social media sites) are the most expensive and hardest startups. \nExperience beats ideas \nExecution beats experience. \nAll. Day. Long. \nBest advice anyone could give you, if they can’t dissuade you from trying, is just start. There are 7B+ people in the world. Give 100 of them “early access”, if you can even get 100 people to click on the button to sign-up you are a massive winner. Then write down everything they hate. Fix that. Find another hundred. Rinse repeat. Charge money for the 100 after that. \nThen. Only then. Will any investor care. \nBest of luck.",
                  "score": 1,
                  "created_utc": "2026-02-03 19:34:34",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o37tfle",
          "author": "quantumsequrity",
          "text": "Not to demotivate you but in YC interview I've seen this as a bad idea as we don't need another social media, and they said it's too broad like there are already too many startuo tried it so..",
          "score": 5,
          "created_utc": "2026-02-02 20:13:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o37u86x",
              "author": "grazmakes",
              "text": "I appricaite the input! i totally get the \"not another social media site\" but I do feel this is an idea that hasn't been properly done in the way this site works. again its tough to describe without giving too much away.",
              "score": 0,
              "created_utc": "2026-02-02 20:17:21",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o37uv02",
                  "author": "quantumsequrity",
                  "text": "TBH noone's gonna steal your idea cause people in here are busy with things they're building. Also you've to share it don't be afraid what ur building on. the idea will not be unique many would've thought about it before you and even after you, just share it Noone gonna judge or steal ur idea in here.",
                  "score": 12,
                  "created_utc": "2026-02-02 20:20:23",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o37yr3u",
          "author": "Content_Produce8783",
          "text": "Having a technical co founder will help a lot. Try reaching out on LinkedIn or even social media and try to find one. If a technical person is willing to develop your idea then your idea is def good.",
          "score": 2,
          "created_utc": "2026-02-02 20:38:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3801ub",
              "author": "grazmakes",
              "text": "thanks for the input!",
              "score": 1,
              "created_utc": "2026-02-02 20:45:05",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o39u885",
          "author": "stellarknight_",
          "text": "Yc requires you to solve a problem that people really hate. also social media is a rly hard platform to Crack, u need ppl to make content for people to stay and for new people to come u need existing content. unless you make something very addictive like tiktok its not that easy to get people on the platform",
          "score": 2,
          "created_utc": "2026-02-03 02:33:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3dent4",
              "author": "grazmakes",
              "text": "thanks for the input! totally understand finding people to crowd source content for a socal media page but i feel like sitting on the idea for years has only made it more viable (it makes sense in the context of the idea of the site) I feel like it does scratch a little of the tiktok doom scrolling a bit as well.",
              "score": 1,
              "created_utc": "2026-02-03 17:08:05",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3dfvye",
                  "author": "stellarknight_",
                  "text": "im not saying its bad but there's alr a ton lot of social media sites out there. if you really think what you have in mind is worth it, ask random people on the street if theyd use it, the main concern is if I join and my friends r not there, would I care to ask them to join and if yes would they be convinced with one look at ur social media. ive always wanted to make one but ive never gotten an idea that would answer this, if you think its worth it give it a shot, regret hurts more, gl!",
                  "score": 1,
                  "created_utc": "2026-02-03 17:13:45",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3a69i4",
          "author": "Electrical-Space-398",
          "text": "You’re being entirely too secretive and the fact of the matter is you’ll launch and no one will care.\n\nYou’ll end up needing to scream this idea from the rooftops to get people to use it. Especially a social media.",
          "score": 2,
          "created_utc": "2026-02-03 03:44:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3a9zq7",
              "author": "speckiedee",
              "text": "I Agree with you",
              "score": 2,
              "created_utc": "2026-02-03 04:08:10",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3c1yw4",
          "author": "TheIndieBuilder",
          "text": "The most important thing you need to know is this: \n\nThe value of a social media website is not in the code that runs the website, it is in how many people are using it. \n\nA functional social media platform with 100 users is worth basically nothing to anybody (except maybe those 100 users). A shoddy, crappy looking platform with 100,000 users is a viable business. Just look at how crappy craiglist and eBay are. But they are both valuable platforms.\n\nSo if you want to succeed with it, forget coding and work out how to get 100,000 people to use it.",
          "score": 2,
          "created_utc": "2026-02-03 13:00:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3e2549",
              "author": "grazmakes",
              "text": "excellent advice! I definitely have a plan for that. I am lucky and have. network of people who have a pretty substantial following online I plan on asking to share and hope that would be enough of a push to grow organically at first.",
              "score": 1,
              "created_utc": "2026-02-03 18:54:21",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3d2iw0",
          "author": "Mountain-Host409",
          "text": "Why not say the idea if ur already done? If ur worried about cloning, if it’s a good idea people should think it’s dumb. Thsts beside the point. The cold start problem is what your dealing with and if you have built this entire platform but have no users then no one will use it.",
          "score": 2,
          "created_utc": "2026-02-03 16:11:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3mdbbz",
          "author": "Majestic-Pop859",
          "text": "To echo others comments:\n1. Being “ready” is a really vague term. If the product isn’t 100% polished, get as many users and feedback as possible and keep iterating. If it’s unsafe (users data) or will immediately break as traction happens then yes you need to keep working on it. \n\n2. If it is the layer, build a landing page explaining what the app does and see if any users sign up for the waitlist, this is a great indication of early traction and now you have a built in early adopter list. \n\n3. While ai is great for putting out MVPs, the likelihood is it won’t scale very well. As others have said I would try to get a technical confounder to join. This is a tricky one. If you can show early interest (by using option 2) this could get more quality devs interested. \n\nLastly you should definitely show your friends and family, but remember they aren’t the best base of people to provide critical and constructive criticism. As my professor said ideas are like opinions, everyone has them. It’s hard but as someone who spent a lot of time developing an actual functioning and polished website for it to flop it’s better to get genuine feedback before pursuing this idea further and wasting any more time. \n\nIn terms of being worried about people stealing the idea, I understand the anxiety but the harsh truth is that if you release and it really is a credible idea people will copycat it, it’s just part of the game. The fear of people imitating you is holding you back from understanding if there is real flesh to this. Wishing you the best of luck, I myself have just built a product and I can tell you, no matter how much you think people may want something like what ur building, it’s hard as hell to get them to come (especially in the categories people have mentioned). In all honesty the build is the easier part, the hard stuff come after.",
          "score": 2,
          "created_utc": "2026-02-04 23:18:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o45hkh9",
          "author": "CK_LouPai",
          "text": "Your VC firms will be in New York.  \n\nThey are harsh out west so you are \n\nnot missing much.",
          "score": 2,
          "created_utc": "2026-02-07 21:58:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o38e5so",
          "author": "Voyager_Interceptor",
          "text": "Marketfit , we all been into locked up stage where speaking up freely about your idea = scary and fear of losing it .   \nTry to not get attached to the idea .\n\nThink about it this way, what if already you have competition and how you differentiate .   \nCan you onboard potential customers without telling them the key futures of your product ?? \n\nBy the way here you also can find your potential customers, and good feedback we are here for helping each other.\n\nThe best proven point ,if an idea has demand is people being ready for paying for it as you already read in the comments above.   \nBuilding something without  the market fit research is a high risk . I will not suggest that. \n\nWish you the best ! \n\n  \n",
          "score": 1,
          "created_utc": "2026-02-02 21:51:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o39jb64",
              "author": "Wide_Brief3025",
              "text": "Finding market fit is all about listening to real conversations and seeing where people actually have pain points. One thing that really helped me was tracking specific discussions on platforms like Reddit and Quora to spot recurring needs. If you want to get super targeted, using something like ParseStream makes it a lot easier to surface those relevant conversations, so you can join in at just the right time.",
              "score": 1,
              "created_utc": "2026-02-03 01:31:15",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3hqn97",
          "author": "Forsaken_Lie_8606",
          "text": " piece of advice i can give is stop worrying about funding and start worrying about users. if you have a working site that you built in 6 months then put it in front of real people today. not tomorrow not after you get funding today. the feedback you get from 10 real users will teach you more than any course or investor meeting. also don t be too secretive about the idea. execution matters way more than the",
          "score": 1,
          "created_utc": "2026-02-04 07:27:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3igp57",
          "author": "Morning_Kaizen_AI",
          "text": "I like AI, I also created an antigravity website without any programming knowledge.",
          "score": 1,
          "created_utc": "2026-02-04 11:26:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3cvc2a",
          "author": "itchyouch",
          "text": "The tried and true advice is that it's not the idea, it's the implementation and execution.\n\nSince we have neither idea nor MVP, there's nothing productive we can contribute.\n\nYour next biggest problem after building and MVP is gonna be shouting from the rooftops till you lose your voice for any sliver of attention you can try to get.  It's gonna basically be shouting into the void and developing marketing chops, a personal brand or something that enables you or your site to gain any traction.\n\nYou're in a tough spot. Not saying give up, but you need a technical dev to execute beyond what AI can do. AI basically breaks after 5k lines of code.  So then you need to segment the architecture to scale features beyond what you have.\n\nProblem is, it'll be hard to find a technical co-founder that wants to bet on your business skills.\n\nFrom what I can tell, the only way out is a lot of insane hours to become skilled at everything from marketing, sales, HR, seo, dev, etc etc etc etc etc etc etc etc etc etc etc.  Then executing on everything.  See Alex Hormozi's story.\n\nBut to start, you need to come up with targets you're trying to hit, whether it's dev goals, usage goals, finding funding, finding partnership, figuring out the next thing to learn.\n\nThis is basically the lonely and tough grind portion you're entering.  You have something, now you want to sell it (to users, investors, employees, partners) So go on and start selling or figure out how to sell your vision.",
          "score": 1,
          "created_utc": "2026-02-03 15:37:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3c5iyg",
          "author": "attn-transformer",
          "text": "Try to get one random person to give a shit about your social media app. It will be difficult. \n\nI recommend you read zero to one by theil",
          "score": 0,
          "created_utc": "2026-02-03 13:22:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3voc60",
          "author": "Ok-Refrigerator9506",
          "text": "Sounds like u have a huge technical debt, good luck with vulnerabilities. Don't handle high risk info u could get in trouble",
          "score": 0,
          "created_utc": "2026-02-06 10:34:22",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qxrul0",
      "title": "What's up with the coding agent question?",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1qxrul0/whats_up_with_the_coding_agent_question/",
      "author": "spastor89",
      "created_utc": "2026-02-06 19:47:54",
      "score": 15,
      "num_comments": 10,
      "upvote_ratio": 1.0,
      "text": "Filling out my application and came across this new \"optional\" question.\n\nHow are people approaching it? I honestly, don't really understand what they're getting at. My biggest win was probably implementing a design system across the whole code base file by file but that doesn't seem super exciting!\n\nMaybe this is geared towards folks with super technical products?  \n\\---\n\nThe Question:\n\nOptional: attach a coding agent session you're particularly proud of.\n\nThis is an experimental question for the Spring 2026 batch to give people a chance to show off their skills with AI coding tools.\n\nMany coding agents (i.e. Claude Code, Cursor, etc) have a \\`/export\\` command, or otherwise include a button allowing you to export a transcript. Can be text or markdown.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1qxrul0/whats_up_with_the_coding_agent_question/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o3yqh2e",
          "author": "dragrimmar",
          "text": "> I honestly, don't really understand what they're getting at.\n\ni think it's a good question. it'll clearly separate vibe coders from engineers.",
          "score": 5,
          "created_utc": "2026-02-06 20:30:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3zsmrz",
          "author": "Kooky_Awareness_5333",
          "text": "Easy one for people who play with ai id probably put something like a agent system I made to fine tune models I open sourced it makes grounded synthetic data so give it a document like a manual it makes question and answer pairs to train a model.\n\nIt’s just to showcase in this day and age what problems have you solved what’s your in depth skills with the technology.",
          "score": 3,
          "created_utc": "2026-02-06 23:49:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3yimna",
          "author": "rosstafarien",
          "text": "What was the question?.",
          "score": 1,
          "created_utc": "2026-02-06 19:51:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3yjfxx",
              "author": "spastor89",
              "text": "Optional: attach a coding agent session you're particularly proud of.",
              "score": 1,
              "created_utc": "2026-02-06 19:55:09",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3zcg12",
          "author": "InspectionGreen6076",
          "text": "I think it’s a curious question on how founders are using ai to code so I’m ignoring. I’m highlighting product traction instead as that’s our stronger part",
          "score": 1,
          "created_utc": "2026-02-06 22:20:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o436s86",
          "author": "hiaryanm",
          "text": "Because the founders getting accepted are later dying out in maintain because earlier they somehow just wrapped up everything & reached into the market & now dying scaling.",
          "score": 1,
          "created_utc": "2026-02-07 14:56:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o436x9i",
              "author": "hiaryanm",
              "text": "It sounds optional but it's going to be one of the biggest differentiator overtime.",
              "score": 1,
              "created_utc": "2026-02-07 14:57:14",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o45eun2",
          "author": "spritejuice",
          "text": "Not an answer to your question but I actually came up with some heavy design work and broke the prompt down step by step. The prompt ended up being 2 pages worth of Google docs but it wasn't a particularly long session so idk how that'll do. \n\nBut I think I used the agent right in that I didn't shoot into the  abyss with a vague prompt but instead at a bullseye",
          "score": 1,
          "created_utc": "2026-02-07 21:44:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o45z46b",
          "author": "the_corporate_slave",
          "text": "If you can’t use ai, forget starting a company",
          "score": 1,
          "created_utc": "2026-02-07 23:41:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o40yvv5",
          "author": "Ecaglar",
          "text": "makes sense that they added this. if youre building a tech product in 2026 and not using ai tools effectively thats a red flag. shows how you think about leverage and whether you can keep up with the pace of change. skipping it is fine if you have strong traction to show instead",
          "score": 0,
          "created_utc": "2026-02-07 04:11:20",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qu7a87",
      "title": "You don't sell in Silicon Valley, are you?",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1qu7a87/you_dont_sell_in_silicon_valley_are_you/",
      "author": "Illustrious_Slip331",
      "created_utc": "2026-02-02 20:51:52",
      "score": 14,
      "num_comments": 28,
      "upvote_ratio": 0.7,
      "text": "New to this sub, new to San Francisco.\n\nSo, half a year ago I moved to SF and became a founder. For me it was easier to start, because I had an experienced founder as a mentor and a couple teammates with whom we started this new, crazy journey. \n\nAt the beginning it was fun trying tons of ideas, examining them, trying to build MVPs without prior experience, searching for PMF and attending every event on Luma, trying to reach out to cool guys. It was literally like in Silicon Valley and I thought I would become Richard Hendricks.\n\nBut time goes by, I am trying to mature and find myself in a paradox:\n\nHow to show traction (sales, customers, leads and custdev) in a palace where everything is built on contributing value? \n\nEvery time I try to reach out to someone, even to ICPs, I get the feeling that I'm being annoying and intrusive. But without real feedback it’s nearly impossible to build anything really valuable. \n\nSo that’s really it. Just curious how you overcome this and deal with moving from -1 to 1. Are there any secrets or is it all about the number of attempts?\n\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1qu7a87/you_dont_sell_in_silicon_valley_are_you/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o390cah",
          "author": "Tall-Log-1955",
          "text": "If you’re having trouble selling, pivot until you don’t.  The best way to fix sales challenges isn’t to be a better salesman.  The best way is to be solving a problem so painful, that a bad salesman can sell it",
          "score": 3,
          "created_utc": "2026-02-02 23:46:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3gay01",
          "author": "Similar_Past8486",
          "text": "First time founder standard. By the second time you’ll know to not even touch product until you have distribution locked in.",
          "score": 3,
          "created_utc": "2026-02-04 01:38:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3ojl56",
              "author": "anteup",
              "text": "this is great advice",
              "score": 1,
              "created_utc": "2026-02-05 07:47:06",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o387efg",
          "author": "p1zzuh",
          "text": "If something isn't working, you have some signal there. You have to make a change and see what changes. If you've been doing the same thing every day and not getting to where you want to go, you have to change something if you want a different outcome.\n\n  \nEasier said than done. I'm in the same loop you're in now, and continuing to iterate daily.",
          "score": 3,
          "created_utc": "2026-02-02 21:19:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o38c8ow",
              "author": "stevengineer",
              "text": "This - feedback is often nuanced and hidden because nobody wants to say 'I don't get it\" \"why would I use that?\" \"Horrible idea!\" \n\nI log it all and keep it in a file for Claude to review. Sure helps find the connections - which can help kill or pivot the idea.",
              "score": 2,
              "created_utc": "2026-02-02 21:42:24",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o38dk48",
                  "author": "p1zzuh",
                  "text": "I'm also looking for people to get excited at an idea. If they aren't visibly excited, I move on",
                  "score": 2,
                  "created_utc": "2026-02-02 21:48:41",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o38t3y1",
                  "author": "Illustrious_Slip331",
                  "text": "That’s true, but sometimes it hard to get any feedback",
                  "score": 1,
                  "created_utc": "2026-02-02 23:06:32",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            },
            {
              "id": "o38swf6",
              "author": "Illustrious_Slip331",
              "text": "I totally understand you. I am always trying something new, looking further than obvious ideas, learning from others. Right now I just came to the point where I question myself: am I doing right? Is my previous experience enough to solve this puzzle? \n\nBasically that’s why I am here.",
              "score": 2,
              "created_utc": "2026-02-02 23:05:25",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o38u026",
                  "author": "p1zzuh",
                  "text": "im right there with you :) let me know if you figure it out!",
                  "score": 1,
                  "created_utc": "2026-02-02 23:11:17",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o3nc1fe",
              "author": "Ok-Yesterday-2194",
              "text": "Bro - you didn’t say anything here: I know I’m hating, but there has to be something deeper here.\n\nI would love to hear more",
              "score": 1,
              "created_utc": "2026-02-05 02:33:45",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o3nvq7q",
                  "author": "p1zzuh",
                  "text": "i didn't give examples because it's pretty dependent on the person. If you go in and code everyday and aren't getting customers, you have to do something different so the outcome changes (you get customers)!",
                  "score": 1,
                  "created_utc": "2026-02-05 04:34:35",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o38m9pm",
          "author": "RoleHot6498",
          "text": "The secret is \"warmth\" Either spend half your day immersed in the right network, asking for nothing or connect with someone who already is immersed ",
          "score": 2,
          "created_utc": "2026-02-02 22:31:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o38eih2",
          "author": "ruibranco",
          "text": "The feeling of being intrusive is the number one thing that kills early-stage sales. Here's the reframe that helped me: you're not selling, you're testing a hypothesis. When you reach out to an ICP, you're not asking them to buy - you're asking if the problem you think exists actually exists for them. That framing makes the conversation way more natural because you're genuinely curious instead of pitching. Also, most people in SV are used to getting cold outreach. The ones who respond are self-selecting into your target audience. It's a numbers game but the numbers are smaller than you think - 10 real conversations with ICPs will teach you more than 6 months of building in isolation.",
          "score": 3,
          "created_utc": "2026-02-02 21:53:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o38unxn",
              "author": "Illustrious_Slip331",
              "text": "Agree with you. I’ve tried this on events and conversation really became way more natural. And yet at the end I often hear just: great idea, you really should build this, push forward, SF is the best place for that, etc. I appreciate their support, but rarely see reasonable, grounded feedback. \n\nMaybe you are right about outreaching and I really try to win in this numbers game, but right now I am losing. Although you are right, even 10 real conversations will be tremendously helpful.",
              "score": 1,
              "created_utc": "2026-02-02 23:14:51",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3coy2t",
                  "author": "Sea_Surprise716",
                  "text": "There’s a difference between “great idea” and “I need that, what are you charging and when are you launching?” The latter is a positive signal. The former is a false positive.",
                  "score": 4,
                  "created_utc": "2026-02-03 15:06:46",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3cmjyh",
          "author": "onahorsewithnoname",
          "text": "This is the work of finding pmf. At the same time many startups will leverage a vc to introduce them to portfolio companies or networks to help accelerate this process. After that many have significant ad spend with google/meta to get word out. Its a grind but if you find you hate the work then look to hire someone to help get those meetings. There are companies that specialize in setting up meetings with your icp.",
          "score": 2,
          "created_utc": "2026-02-03 14:54:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o38fxif",
          "author": "ivalm",
          "text": "Your ICPs should feel that your product is contributing value. if your ICPs don't want to use your product then you need to do something else.",
          "score": 1,
          "created_utc": "2026-02-02 21:59:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o38ii7p",
          "author": "reddit_user_100",
          "text": "Sales is just the binding agent that links people who have problems to solutions. If your product truly helps your ICP, your customers should be glad you told them about it.",
          "score": 1,
          "created_utc": "2026-02-02 22:12:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o38uwoy",
              "author": "Illustrious_Slip331",
              "text": "I am aiming to have such confidence in the product. But sometimes it's hard to push idea when you just started",
              "score": 1,
              "created_utc": "2026-02-02 23:16:10",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o38wglo",
          "author": "random-trader",
          "text": "They are hard but find teaching customers. You learn from them by doing shits for free. While doing shits ask yourself is this going to make a big company? Are others have the exact same problem. If not then stop doing anymore of that shits and ask for some other shits. You will end up in a place where there are tons of similar looking shit that needs to be cleaned up and done. That's when you find your PMF.",
          "score": 1,
          "created_utc": "2026-02-02 23:24:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o391i6y",
          "author": "Mompreneur1987",
          "text": "Marketing is key. Understand your audience, and solve their problem. Show them your product is the solution.",
          "score": 1,
          "created_utc": "2026-02-02 23:52:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o39crh6",
          "author": "baradas",
          "text": "Have you ever thought - all your MVP's are a prompt away?",
          "score": 1,
          "created_utc": "2026-02-03 00:53:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3a00rt",
          "author": "quietoddsreader",
          "text": "traction isn’t about convincing everyone, it’s about finding the few people who actually care and listening hard. cold outreach isn’t intrusive if it’s framed around understanding their pain, not selling. most learning comes from repeated, thoughtful conversations rather than “volume” alone. focus on real curiosity, documenting what u hear, and iterating ur product or approach based on that feedback.. numbers follow once the problem is sharp and the solution clicks.",
          "score": 1,
          "created_utc": "2026-02-03 03:06:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3dxjww",
          "author": "Low_Organization9985",
          "text": "When I get the feeling of being intrusive I always go one step further in how can I provide them value, at the end people are very nice if you help them first they will take time to give you feedback. \n\n  \nFor example I am building an AI Career agent for top talents and when I want more feedback from a specific type of talent I just provide manual value. Helping them personally with their career, then they are more than happy to try my product and give valuable feedback as the product also helps them with their goal.",
          "score": 1,
          "created_utc": "2026-02-03 18:33:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3g9d6h",
          "author": "Costheparacetemol",
          "text": "Sounds like you need to work on the research convos. Have you read The Mom Test? It’s a very short read full of actionable tips for getting genuine answers",
          "score": 1,
          "created_utc": "2026-02-04 01:29:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3hgzrz",
          "author": "Crafty-Sea-134",
          "text": "I’m sorry, but I want to say that the icp is not accurate and deep enough. Aha moment doesn‘t have to be perceived after use. The time and money you save for them are the so-called traction. I think some articles in my LinkedIn can help you. I wish you all the best.",
          "score": 1,
          "created_utc": "2026-02-04 06:05:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3hprnz",
          "author": "kat233x",
          "text": "Hey I feel you. Except I’m building an social venture/ nonprofit .\n\nI felt like I always have to provide value to these convos and that has been the biggest friction in me sending out outreach. I overthink the importance of these initial interactions and afraid to mess it up.\n\nAnd I think that’s okay. It’s okay to have insecurities. I can sit with it AND still do it anyway. Its okay to mess up. It’s better to learn what doesn’t work. And work on it later ",
          "score": 1,
          "created_utc": "2026-02-04 07:19:27",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qxwtas",
      "title": "YC X26 - Good product bad video",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1qxwtas/yc_x26_good_product_bad_video/",
      "author": "masterluke19",
      "created_utc": "2026-02-06 22:59:27",
      "score": 13,
      "num_comments": 20,
      "upvote_ratio": 0.93,
      "text": "Hey I applied for the spring batch - I am confident with my application and have early adopters but I am still really bad at YC application video. Any advice on that.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1qxwtas/yc_x26_good_product_bad_video/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o3zpl9b",
          "author": "Signal-Image-900",
          "text": "chatgpt it bro\n\n",
          "score": 4,
          "created_utc": "2026-02-06 23:32:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3zppf6",
              "author": "die117",
              "text": "No, Gemini it",
              "score": 1,
              "created_utc": "2026-02-06 23:32:50",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o403yuc",
                  "author": "masterluke19",
                  "text": "Every LLM asked to post in Reddit. lol",
                  "score": 2,
                  "created_utc": "2026-02-07 00:55:28",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o405r65",
          "author": "Elegant_Mail",
          "text": "It's part of being a good founder to know how to sell your product and sell yourself. I don't know what other people recommend but I would recommend against using ai. You want to be able to communicate what you're doing not just to yc but to investors, customers, employees, etc. Are you gonna use chatgpt to sell the vision to your employees? Will they believe you?",
          "score": 5,
          "created_utc": "2026-02-07 01:06:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o4077vl",
              "author": "masterluke19",
              "text": "Thanks for the advice",
              "score": 2,
              "created_utc": "2026-02-07 01:15:13",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o40a3df",
          "author": "Important_Pause_7995",
          "text": "How many times did you record? I bet if you recorded 1000 videos, you'd have one that was at least decent.  I probably did 100 takes over the course of an hour - 4 of which I felt pretty good about. I did it on my phone. If I messed up at any point during a take I immediately stopped the recording and deleted it and was up and recording the next one in 10 seconds. Don't even practice - record every time.   \n  \nFor me, I know there's very little chance my video is going to be what get's me in - but I also know that there's very little chance my video is what will keep me out.",
          "score": 2,
          "created_utc": "2026-02-07 01:32:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o41iqdl",
              "author": "DanongKruga",
              "text": "Idk about the last part. From watching the YC material it seems like if they like the idea enough, they watch your video. If they like you and your credentials it can go a long way. Your app has to match 'you'",
              "score": 2,
              "created_utc": "2026-02-07 06:48:47",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o45hqxj",
                  "author": "Important_Pause_7995",
                  "text": "That's kind of my point. They see my credentials in the application before the video. I have none. Two music degrees from a regional university. I learned to code from a 12-week bootcamp. 4 years of software engineering experience at a Fortune 50 company, but nothing impressive. No co-founder. If they get to my video, and that's a BIG if, they clearly like my idea and my progress enough to click the video. From there, they will see someone who can communicate effectively and clearly has a deep connection to their product. The product and the current traction is what will get me the video watch - but I'd argue that my product isn't what they're looking for. Not enough potential to become a billion dollar company. The video is highly unlikely to disqualify in any way that I hadn't already been disqualified.",
                  "score": 1,
                  "created_utc": "2026-02-07 21:59:52",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o44a524",
              "author": "ApprehensiveCry7955",
              "text": "Absolutely true me & my founder did around 100 takes then we found only 2 with which we were pretty sure to move forward with",
              "score": 1,
              "created_utc": "2026-02-07 18:12:04",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o40kzvs",
          "author": "jamesintech",
          "text": "I struggled with this too. I watched tons of other founder videos from other YC applications to get a feel for how the successful ones go. It's essentially being yourself, talking confidently of your product and market knowledge. It takes a lot of practice to talk into a camera in general. Took me a long time personally. \n\nGood luck! ",
          "score": 2,
          "created_utc": "2026-02-07 02:40:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o417uqq",
              "author": "masterluke19",
              "text": "Thanks for your input",
              "score": 2,
              "created_utc": "2026-02-07 05:17:12",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o427hk5",
          "author": "Webuildtech",
          "text": "Same, my thoughts and words doesn't always align. I built an internal tool to help me practice and articulate my thoughts better.",
          "score": 2,
          "created_utc": "2026-02-07 10:47:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o40gcua",
          "author": "hduynam99",
          "text": "be yourself, like you talking to your self in the mirror. the trick is putting the mirror behind the camera.",
          "score": 1,
          "created_utc": "2026-02-07 02:11:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o41pn1f",
          "author": "vonirox566",
          "text": "what you say doesn't matter. what matters is if you're under 22 and preferably Indian. YC is a child labor camp",
          "score": 1,
          "created_utc": "2026-02-07 07:52:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o44zkcb",
          "author": "_Spartan119_",
          "text": "I think part of being a great founder is to be able to sell it in your own words. Don't worry about trying to impress anyone including YC. If it helps add, subtitle to your video. That helps",
          "score": 1,
          "created_utc": "2026-02-07 20:21:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o46xz60",
          "author": "Zestyclose_Team_3176",
          "text": "I still haven’t cracked it, but this is what im using. \n\n60sec\n10- sec intro\n15- sec problem space\n15 - sec your solution \n15 - market opportunity \n5 - current MVP state/sales \n\nRemember this can be a edited version. It doesn’t need to be one full min video.",
          "score": 1,
          "created_utc": "2026-02-08 03:17:50",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qwxicv",
      "title": "Are landing page tests dead?",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1qwxicv/are_landing_page_tests_dead/",
      "author": "orthogonal-ghost",
      "created_utc": "2026-02-05 21:01:39",
      "score": 12,
      "num_comments": 13,
      "upvote_ratio": 0.83,
      "text": "Several months ago (when we were in the earliest stages of the “idea maze”), we launched a landing page test. Many well-recommended books (e.g., The Lean Startup) recommended running landing page tests as an efficient way to validate if potential users/customers were interested in the solution you have to offer. \n\n\n\nThe idea is to (1) build a landing page describing the problem you aim to solve and how your solution will address it, (2) drive traffic to your landing page, and (3) consider your idea validated if enough people engage with your landing page (e.g., sign up, attempt to pay, etc.).\n\n\n\nFor us, this didn’t work. \n\n\n\nFirst, (1) was non-trivial. We used Framer for the landing page, but (since I’m not a web designer), it took some time to become familiar with all the bells and whistles of their app (in fact, I still don't fully know the difference between ‘stacks’, ‘frames’, ‘containers’....). \n\n\n\nSecond (and more importantly), (2) IS NOT EASY. We ran ads on X, and generated a bunch of traffic. The issue though was that nearly all of that traffic (>98%?) seemed to be from bots. Of course, it’s hard to say for sure if they were bots or just people who came, saw our message and weren’t interested, but given that the vast majority stayed on the page for significantly less than 1 sec (which is incredibly hard / unlikely for an actual person), it’s safe to say they were likely bots. \n\n\n\nUltimately, we stopped the landing page test and chose to focus on talking to more (actual) people. This was incredibly valuable, helped shape our MVP, and actually got us to our first few customers.\n\n\n\nIt’s obviously no surprise that talking to users works. But I would’ve thought landing page tests would’ve been a bit more insightful (though, again, maybe it’s just us).",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1qwxicv/are_landing_page_tests_dead/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o3t2s6d",
          "author": "hulk-konen",
          "text": "I would say it was already dead  by 2014, at least for me.. \n\nIn the early stage A/B testing, tuning your CTA, hero etc is slow compared to just talking to a bunch of people. There are so many variables that you need a considerable amount of traffic to deduce anything. \n\n",
          "score": 9,
          "created_utc": "2026-02-05 23:22:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3vrfo0",
          "author": "Putrid-Lettuce5204",
          "text": "It is dead. Paid Ads also seem to be dead. Im not a marketer bit it seems the only way to get credible customers and conversion is to be ACTIVELY on social media or on forums.\n\nIf your product is consumer focused, people just dont have the extra liquidity to buy things therefore you have a steeper challenge.",
          "score": 5,
          "created_utc": "2026-02-06 11:01:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3sdlv1",
          "author": "teatopmeoff",
          "text": "This is one of those examples of trying to do things at scale before you’ve figured anything out. When they say you should talk to users - you should be doing it directly, not on a mass marketing campaign. These are untargeted and the feedback that you get (if any) will be all over the place. You’re just spending money for no reason at all.",
          "score": 2,
          "created_utc": "2026-02-05 21:15:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3vrlxk",
          "author": "SergiePoe",
          "text": "I believe landing page tests only make sense when you have scale:\n\n* You know exactly who your target audience is\n* That audience is large enough to generate statistically significant results\n* They're already buying your product\n* You have reliable channels to drive traffic to your landing page\n* You're collecting meaningful data\n\nWhen all these conditions are met, you can systematically test variations - different screens, copy, buttons - to optimize conversion.\n\nBut if you're still figuring out your ICP and how to convert prospects into users, testing your landing page is a waste of time.",
          "score": 2,
          "created_utc": "2026-02-06 11:03:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o40yu53",
          "author": "Ecaglar",
          "text": "landing page tests work better when you already have a channel. running ads to a landing page before you know who your actual users are is basically just paying to learn that ad platforms have bots. the people who say talk to users first are right - landing page tests are for validating messaging once you know who youre talking to",
          "score": 2,
          "created_utc": "2026-02-07 04:10:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o41xyoi",
          "author": "iceman123454576",
          "text": "Talk to potential customers",
          "score": 1,
          "created_utc": "2026-02-07 09:13:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o44jcko",
          "author": "PolyReekau",
          "text": "2 important things : a) the Basic : when you Launch a new product or new concept of goods or services, it's better to invest your time, energy or money... On a PRECISE niche of prospective consumers ( whose PROFILE, betobe or betoce you have to know ! ! B) AFTER the basic : b1) Determine where ON SOCIAL MEDIA you will find this betobe or betoce PROFILE b2 ) finally you can launch ads whose purpose will be to re-direct them on your landing page.",
          "score": 1,
          "created_utc": "2026-02-07 18:57:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3scgzi",
          "author": "Golandia",
          "text": "Framer kinda sucks. Lovable is significantly better. Also get Posthog set up to record sessions and collect analytics. Most visits from ads will be very short because people misclick ads. \n\nDriving traffic is very doable but it costs money and you need to understand good ad targeting, messaging, etc. \n\nInterviewing people is the gold standard (Mom Test) but it's the most time consuming option by far. You can do landing page tests, in parallel, as long as you are ok with ad spend and validate significantly faster. You can even take it a step further with waitlisting, paid signups (like pre-purchases) or list your idea on crowdfunding sites.",
          "score": 1,
          "created_utc": "2026-02-05 21:10:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3se42b",
              "author": "orthogonal-ghost",
              "text": "Interesting — I’ve tried v0 and Replit for web design but not Lovable. I’ll give it a try. \n\n\n\nRe: Framer, I honestly think the designs are pretty nice, but my main issue with it is the learning curve required to benefit from everything is a bit too steep. I’ve played around with integrating it with Claude Code but even that requires more work than I’d like to devote to it. \n\n\n\nRe: driving traffic via ads, do you have any quick tips on ad targeting? We played around with different messaging to see which ones resonate the most. We saw differences in engagement, but again, given that most traffic seemed to be bot driven it’s hard to say if there was a significant difference in human-traffic across our messaging.",
              "score": 2,
              "created_utc": "2026-02-05 21:17:58",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o412b27",
                  "author": "AV_SG",
                  "text": "Totally agree with you on two points - 1. steep learning curve if you are not into SW tech and got to build your own landing page 2. most of the traffic is bot driven . But I must say , lots can be explained through a landing page and is a good medium to showcase during your customer discovery phase . Refining the page as your startup grows is an activity to be accounted for.",
                  "score": 2,
                  "created_utc": "2026-02-07 04:35:56",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3sdahc",
          "author": "keyUsers",
          "text": "> The issue though was that nearly all of that traffic (>98%?) seemed to be from bots. Of course, it’s hard to say for sure if they were bots or just people who came, saw our message and weren’t interested, but given that the vast majority stayed on the page for significantly less than 1 sec (which is incredibly hard / unlikely for an actual person), it’s safe to say they were likely bots. \n\nI bet that they’re not bots, they are real people. It happens a lot to me when I scroll on Reddit or Insta and I accidentally hit on the ad to scroll up, but the ad opens in the browser. I close the tab immediately and go back to Reddit / Insta. It’s annoying. \n\nThe problem is that Meta or Google get payed when the user clicks on the ad. So they’re incentivized to open the ad the on the “click down” rather than “click up”. It means that they open the ad as soon as the finger is there, even if the intention of the user was to scroll.",
          "score": 1,
          "created_utc": "2026-02-05 21:14:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3x6bhz",
              "author": "ProgrammerPoe",
              "text": "nah they are bots.  I ran tests like this from meta ads, x and tik tok and I used fullstory to watch the user sessions.  I would get tons of them doing the exact behavior of scrolling to the bottom, scrolling back up half way and then leaving.  Doing all of this in a couple of seconds tops.  1k, 10k etc users it didn't matter most of them were this.\n\nDoesn't mean that ads are dead, they are not, but you do have to use techniques to say when a CTA is actually clicked and optimize for that",
              "score": 2,
              "created_utc": "2026-02-06 16:01:06",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o3sl8ks",
              "author": "orthogonal-ghost",
              "text": "Ah.. that's a good point. I've actually done that quite a bit myself",
              "score": 1,
              "created_utc": "2026-02-05 21:52:20",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qx1nbq",
      "title": "How can I get real feedback from mobile customers?",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1qx1nbq/how_can_i_get_real_feedback_from_mobile_customers/",
      "author": "LGCP",
      "created_utc": "2026-02-05 23:43:28",
      "score": 8,
      "num_comments": 8,
      "upvote_ratio": 0.91,
      "text": "I have 150 customers for my iOS app right now, and I'm struggling to get real feedback.\n\nThings I have tried:  \n\\-Small exit survey (data is not too helpful - open ended questions left blank)  \n\\-Cold email offering $15 gift card (0% response rate)  \n\\-Reaching out to users that have reported bugs/requested features (works but I rarely get users reaching out)\n\nIdeally I'd like to be able to get users on a call and ask them a few open-ended questions.\n\nAnyone have any experiences with this?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1qx1nbq/how_can_i_get_real_feedback_from_mobile_customers/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o3twaff",
          "author": "DueDelay8285",
          "text": "you’re gonna have to offer more the 15 dollars my friend. can’t get 30 minutes of my time for less that $50",
          "score": 2,
          "created_utc": "2026-02-06 02:13:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3ub0tz",
              "author": "LGCP",
              "text": "Okay I'll try upping the amount. I'm asking for a 10 minute chat and the current users are mostly college students.",
              "score": 1,
              "created_utc": "2026-02-06 03:42:52",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3ub8vu",
          "author": "DueDelay8285",
          "text": "you could also try a starbucks gift card instead of cash",
          "score": 2,
          "created_utc": "2026-02-06 03:44:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3utf07",
          "author": "Good_Accountant_3404",
          "text": "what is your product",
          "score": 1,
          "created_utc": "2026-02-06 05:52:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3v3b2o",
          "author": "theawkwardyeehaw",
          "text": "Ask people on Reddit to give you a feedback for your app. Maybe offer a gift card/ lottery situation.",
          "score": 1,
          "created_utc": "2026-02-06 07:16:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3v60gg",
          "author": "sk1427",
          "text": "What’s the name of your iOS app I’ll review it and provide feedback.",
          "score": 1,
          "created_utc": "2026-02-06 07:40:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3vpr0n",
          "author": "DistrictBurgs",
          "text": "As others said, up your gift card value for a 15-minute chat. Seems like the easiest solution.  \n  \nHave you got any analytics set up? This might show you wider problems, such as where people are spending time, success rates of certain key tasks, etc. This doesn't tell you the why, but it can tell you where to zoom in and start investigating.\n\nAlso it might be worth doing moderated user testing to take new people through the app. Ensure you are recruiting people in your target demographic (use the screener survey to filter others out). Use something like [usertesting.com](http://usertesting.com) or reddit or even your network (if you know people in your target demographic).  \n  \nThe only problem with usertesting is it's about $70-80 per session... just a heads up!   \n  \nOnce you have the people booked in, jump on a video call and record it. Speak to them about their general problems in the space where your business operates before showing them your app. Then get them to share their screen and go through the entire onboarding and key tasks. Observe and ask them to explain any frustrations you see along the way.   \n  \n  ",
          "score": 1,
          "created_utc": "2026-02-06 10:47:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o40yxsl",
          "author": "Ecaglar",
          "text": "$15 is too low for anyones time tbh. but also cold emails to users who havent reached out first rarely work. the users who report bugs are your best source because theyve already shown they care enough to engage. maybe try catching them right after a support interaction when theyre warm",
          "score": 1,
          "created_utc": "2026-02-07 04:11:42",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qtgw10",
      "title": "Coding Agent Session: that’s such great question!",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1qtgw10/coding_agent_session_thats_such_great_question/",
      "author": "aspiringtroublemaker",
      "created_utc": "2026-02-02 01:12:32",
      "score": 8,
      "num_comments": 7,
      "upvote_ratio": 0.75,
      "text": "Optional: attach a coding agent session you're particularly proud of.\n\nThis is an experimental question for the Spring 2026 batch to give people a chance to show off their skills with Al coding tools.\n\nMany coding agents (i.e. Claude Code, Cursor, etc) have a /export command, or otherwise include a button allowing you to export a transcript. Can be text or markdown.\n\nI wonder what people came up with for this question?\n\n& whether you think that’s what we should be looking at when hiring new engineers ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1qtgw10/coding_agent_session_thats_such_great_question/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o32w2bv",
          "author": "SlowPotential6082",
          "text": "love this question. i think it reveals something more interesting than just coding ability.\n\nthe best sessions i've seen (and done myself) show how someone breaks down a problem, handles ambiguity, and course-corrects when the AI goes off track. it's less about the code quality and more about the \"conversation\" with the agent.\n\nfor hiring, i'd look for:\n- how clearly they spec out what they want before prompting\n- whether they catch hallucinations or just blindly accept output\n- how they recover when something breaks\n- whether they understand the code the agent wrote, or just copy paste and pray\n\nthe skill gap between people who use these tools well vs poorly is massive. someone who knows how to guide an agent effectively can build in hours what would take weeks to spec out and outsource.\n\nSource: non-technical founder who built an entire SaaS frontend in v0/Cursor",
          "score": 4,
          "created_utc": "2026-02-02 01:45:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3brrab",
          "author": "ruibranco",
          "text": "This is basically YC asking \"show me how you think\" instead of \"show me what you built.\" A coding agent session reveals so much - how you decompose problems, whether you verify output or blindly accept it, how you recover when the agent goes sideways. It's closer to evaluating judgment than technical skill, which makes sense because that's what actually matters at the founder level. The best engineers I've worked with aren't the ones who write the cleanest code, they're the ones who know when to push back on the tool.",
          "score": 2,
          "created_utc": "2026-02-03 11:49:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o33e1qv",
          "author": "puddle-shitter",
          "text": "didnt give it much thought, I just exported a claude code session from like a few days ago where I was bullying opus into fixing something, and kept telling it where things are and what to touch and what not to do specifically. I think this question is great because its fairly easy to estimate your technical abilities from your prompts and your iterations to those outputs. definitely the most interesting thing to be looking for in engineers because its just the new reality of coding abstraction.",
          "score": 1,
          "created_utc": "2026-02-02 03:28:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o33jvvm",
          "author": "quietoddsreader",
          "text": "i’m a bit skeptical of raw transcripts as a hiring signal. a polished agent session can hide whether the engineer actually understands the tradeoffs or just knows how to prompt well. what i care more about is how someone frames the problem, decides what not to ask the agent to do, and catches subtle mistakes. coding agents are table stakes now, but judgment under pressure is still the scarce skill. if this question surfaces that, it’s useful. if it rewards theater, less so.",
          "score": 1,
          "created_utc": "2026-02-02 04:04:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o34feki",
          "author": "Forsaken_Lie_8606",
          "text": "ive been on the other side of the table, hiring engineers for my startup, and tbh, i dont think a coding agent session is the best way to gauge someones skills, at least not as a standalone metric. weve had candidates who aced these kinds of tests but struggled with the nuances of our codebase, and others who didnt do as well on the tests but were total rockstars when it came to collaborating with the team and writing clean, maintainable code. imo, its all about finding a balance between technical chops and soft skills, and thats something you cant always get from a coding agent session. ngl, id rather see a candidates github repo or a personal project theyre passionate about, that gives me way more insight into how they think and code hope that helps",
          "score": 1,
          "created_utc": "2026-02-02 08:15:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3g0f6t",
          "author": "andrewthecoder",
          "text": "What format are y'all attaching your transcripts in? I'm liking the output format from this tool (thanks Simon) but wonder if anyone else has a better suggestion: [https://simonwillison.net/2025/Dec/25/claude-code-transcripts/](https://simonwillison.net/2025/Dec/25/claude-code-transcripts/)",
          "score": 1,
          "created_utc": "2026-02-04 00:39:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3vobqb",
          "author": "StomachWonderful615",
          "text": "Most of my coding sessions got summarized in claude code. And full conversation isn’t really available for sharing",
          "score": 1,
          "created_utc": "2026-02-06 10:34:15",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qut4in",
      "title": "pitch decks",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1qut4in/pitch_decks/",
      "author": "ZealousidealRide7425",
      "created_utc": "2026-02-03 14:18:34",
      "score": 5,
      "num_comments": 5,
      "upvote_ratio": 0.86,
      "text": "I Reviewed Many pitch decks .\n\nHere’s the no-BS pitch deck playbook most founders get wrong.\n\nIf you’re raising capital and your deck isn’t landing…\nIf investors say “interesting” but never follow up…\nOr if you’re copying templates from Google and hoping for the best…\n\nThis might save you months.\n\n\nWe run a fractional CFO agency. Between our clients and my own deals, I’ve sat on both sides of the table — pitching investors and evaluating decks for funds.\n\nHere’s a straight brain dump on what actually works.\n\n1. Your deck is not a presentation. It’s a decision document.\nMost founders design decks like TED talks. Big mistake.\nInvestors skim. Fast. Your deck should make sense without you talking. If someone forwards it internally and it doesn’t hold up on its own, you’re done.\n\n2. The problem slide matters more than your product\nNobody invests because your product is “cool.”\nThey invest because the problem is painful, urgent, and expensive.\nIf your problem slide doesn’t make an investor slightly uncomfortable, it’s too weak.\n\n3. Your solution should feel obvious (in hindsight)\nIf you need 5 slides to explain what you do, that’s a red flag.\nGreat decks make investors think:\n“Why didn’t this exist already?”\n\n4. Traction beats storytelling. Every time.\nYou can have the prettiest narrative in the world — traction still wins.\nRevenue, growth rate, retention, pipeline, pilots.\nEven early signals beat vague vision.\n\nNo traction yet?\nShow momentum, not excuses.\n\n5. Your financials are silently killing deals\nThis is where most decks fall apart.\nUnrealistic hockey sticks.\nNo understanding of cash burn.\nNo link between growth and spend.\n\nInvestors don’t expect perfection — they expect financial literacy.\n\n6. Your “Ask” slide should be painfully clear\nHow much are you raising?\nWhat does it unlock?\nHow long does it last?\n\nIf an investor has to guess any of that, they usually just pass.\n\n7. Less slides. More clarity.\nMost winning decks are 10–14 slides.\nNot 25.\nNot 40.\n\nIf everything feels “important,” nothing is.\n\n8. Design won’t save bad logic\nClean design helps.\nBut no amount of visuals will fix a broken story or weak numbers.\n\nStrategy first. Slides second.\n\n9. Every deck should be built for its stage\nPre-seed decks shouldn’t look like Series B decks.\nYet founders copy whatever raised last on Twitter.\n\nContext matters. Stage matters. Investor mindset matters.\n\n10. The best decks don’t try to convince — they invite\nYour goal isn’t to “sell.”\nIt’s to make the investor want the next conversation.\n\nThat’s it.\n\nThis is exactly how we think about pitch decks inside our fractional CFO practice — combining strategy, numbers, and investor psychology, We create investor ready pitch deck for startups not just slides.\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1qut4in/pitch_decks/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o3cnbhg",
          "author": "MagicianMany1814",
          "text": "So great to see posts with real value, and not someone just trying to promote their SaaS!",
          "score": 1,
          "created_utc": "2026-02-03 14:58:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3cunuu",
          "author": "quantumsequrity",
          "text": "Hey introduce yourself, how will we know this advice is from a real experienced person.. it could be some nobody with AI written post or even a Bot",
          "score": 1,
          "created_utc": "2026-02-03 15:34:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3d5sln",
          "author": "BernoulliCat",
          "text": "AI slop!",
          "score": 1,
          "created_utc": "2026-02-03 16:26:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3dduid",
          "author": "Empty_Fig_8619",
          "text": "In venture, opinions tend to scale faster than experience, which is why your deck must be clear, concrete, and self-explanatory",
          "score": 1,
          "created_utc": "2026-02-03 17:04:19",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qxiuja",
      "title": "Jumping into red ocean",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1qxiuja/jumping_into_red_ocean/",
      "author": "Yersyas",
      "created_utc": "2026-02-06 14:19:19",
      "score": 4,
      "num_comments": 10,
      "upvote_ratio": 0.75,
      "text": "After learning there’s no pure blue ocean in the market, I’ve decided to start a SaaS business in an area with big enterprise players and a startup with big investment but somehow hasn’t launch in 3 years. Like Posthog, we will be taking different approaches to distribution with open source strategy and focusing on selling to startup customers. So we open source, sell to developers, and grow with startups\n\nHas anyone been in this situation before? What was your competitive strategy?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1qxiuja/jumping_into_red_ocean/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o3x15v5",
          "author": "quietoddsreader",
          "text": "red oceans are normal at seed. the mistake is thinking distribution alone saves you. open source plus dev-first only works if it creates real lock-in around workflows or data, otherwise enterprises will copy the motion once it shows traction. i’ve seen teams win by narrowing the first wedge way more than they expected, one painful use case, one persona, then expanding sideways. the three year unlaunched competitor is more interesting than the big players, that often signals unclear ownership or founder indecision. i’d pressure test how fast you can ship and learn versus how fast they can even decide. speed only matters if you know exactly what you are racing toward.",
          "score": 2,
          "created_utc": "2026-02-06 15:36:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3wndwr",
          "author": "kennetheops",
          "text": "relationships matter a lot. More specially you need to show you care to your users and listen. I promise you that the big players are riding off of momentum and are leaving gaps, just use banks. Why would a credit union matter if jpm was around. Why would large regional banks matter if bank of america was around. It’s because that listen and actually solve peoples problems",
          "score": 1,
          "created_utc": "2026-02-06 14:27:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3wp761",
          "author": "[deleted]",
          "text": "[removed]",
          "score": 1,
          "created_utc": "2026-02-06 14:36:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3ww35j",
              "author": "Yersyas",
              "text": "Thanks for the comment. We're not vs PostHog. We just use PostHog's product-led growth strategy.",
              "score": 1,
              "created_utc": "2026-02-06 15:11:56",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3x865h",
          "author": "Postmortal_Pop",
          "text": "A red ocean also means it’s a heavily validated market. The right angle can actually be easier in some instances.",
          "score": 1,
          "created_utc": "2026-02-06 16:09:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3y4fi7",
          "author": "-night_knight_",
          "text": "You always have (should have) some differentiation tho, you can't just be a copy another successful saas and expect something, just double down on it, otherwise i dont think it makes any sense for a customer to use you over the big established players (except for lower prices, which isn't a good game to partake in)",
          "score": 1,
          "created_utc": "2026-02-06 18:42:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3zhdh2",
          "author": "Tall-Log-1955",
          "text": "Pick a niche that the incumbents are underserving and grow outward from there",
          "score": 1,
          "created_utc": "2026-02-06 22:46:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o42hl83",
          "author": "Fun_Ostrich_5521",
          "text": "This setup is common and the failure modes are repeatable. I’ve seen both outcomes.\n\n  \nYou’re not competing with enterprise players. You’re competing with inertia and switching fear.\n\nA few hard-earned lessons:\n\n**Open source isn’t a strategy by itself.**  \nPostHog used OSS as a distribution wedge, not the moat. The moat came from opinionated defaults, fast dev-driven iteration, and product choices enterprise vendors couldn’t make without breaking contracts. If OSS doesn’t materially reduce time-to-first-value, it won’t save you.\n\n**A 3-year unlaunched startup is a warning.**  \nUsually signals unclear ICP, too many personas, or architecture optimized before demand. Your advantage isn’t speed it’s clarity. Be brutally narrow early.\n\n**Selling to startups only works if you design for growth, not MVPs.**  \nStartups churn when tools don’t evolve with them. If there’s no clear path from 5 → 50 → 500 users, you’ll cap out.\n\n**Win on decisions, not features.**  \nMake one high-frequency decision dramatically easier or safer than anyone else. That’s how you lock in before enterprises notice.\n\nRed oceans are fine. Unclear positioning kills companies",
          "score": 1,
          "created_utc": "2026-02-07 12:18:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3wrx0y",
          "author": "Longjumping-Ad8775",
          "text": "Can you get customers?",
          "score": 0,
          "created_utc": "2026-02-06 14:50:54",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1quqtb4",
      "title": "How do you demo an AI product whose value is emotional, not transactional?",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1quqtb4/how_do_you_demo_an_ai_product_whose_value_is/",
      "author": "Lisa_Create2030",
      "created_utc": "2026-02-03 12:37:21",
      "score": 3,
      "num_comments": 2,
      "upvote_ratio": 1.0,
      "text": "I’m applying to YC with a startup that uses AI agents to turn global issues (climate, migration, inequality) into human-centered stories for organizations, communications teams, and creators ... things like spoken-word poems, short films, and advocacy campaigns.\n\nThe problem I’m running into is that our strongest demos aren’t “look how fast it generates text,” but “look how it makes people *feel*.”\n\nIn live sessions, youth, artists and NGOs have used it to turn things like water scarcity data into spoken-word poetry and short film scripts that move people in ways dashboards never do.  but that doesn’t fit neatly into a 30-second YC demo.\n\nFor people who’ve built non-obvious, creative, or impact-driven products: How did you show traction and product-market fit when what you were building wasn’t easily measured by clicks or conversions?\n\nWould love advice from anyone who’s been there.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1quqtb4/how_do_you_demo_an_ai_product_whose_value_is/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o3d0s4w",
          "author": "ruibranco",
          "text": "don't try to explain the emotion - just trigger it live. in your demo, take a real headline (something dry, like a UN water report) and show the output poem or film script in real time. let the room feel the difference between the raw data and what your tool creates from it. YC partners have seen a thousand dashboards. they haven't seen someone get goosebumps from a demo. your metric isn't clicks - it's the number of orgs that came back after the first session and asked for more. retention in creative tools IS the product-market fit signal.",
          "score": 1,
          "created_utc": "2026-02-03 16:03:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3d3w0x",
              "author": "Lisa_Create2030",
              "text": "This is a great answer. This is the response were getting from users who take real big topics and find really beautiful and moving stories. This is perfect, THANK YOU!",
              "score": 1,
              "created_utc": "2026-02-03 16:18:12",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qxaeoq",
      "title": "Consumer",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1qxaeoq/consumer/",
      "author": "Content_Produce8783",
      "created_utc": "2026-02-06 06:42:01",
      "score": 3,
      "num_comments": 1,
      "upvote_ratio": 1.0,
      "text": "How do you guys feel about consumer products? Do you guys feel like there is any space for them right now? I feel like b2b isn’t giving consumer any space to live. \n\nCan anyone recommend any good podcasts or quotes on anyone tech speaking about ai consumer products? ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1qxaeoq/consumer/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o3vdl9z",
          "author": "Entire-Branch7007",
          "text": "\"Consumer\" is incredibly broad",
          "score": 1,
          "created_utc": "2026-02-06 08:52:26",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}