{
  "metadata": {
    "last_updated": "2026-01-20 08:59:58",
    "time_filter": "week",
    "subreddit": "ycombinator",
    "total_items": 10,
    "total_comments": 197,
    "file_size_bytes": 163755
  },
  "items": [
    {
      "id": "1qgi7gl",
      "title": "Is it still smart to pursue tech startups with how competitive everything is now?",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1qgi7gl/is_it_still_smart_to_pursue_tech_startups_with/",
      "author": "ashishxo",
      "created_utc": "2026-01-18 19:42:13",
      "score": 64,
      "num_comments": 52,
      "upvote_ratio": 0.91,
      "text": "This is a genuine question, not trying to be negative.\n\nI’m not a tech engineer myself, but I do have a basic understanding of how tech startups work\n\nTech startups are obviously still being created, but it feels like the bar has gotten insanely high. Almost every strong engineer I see now wants to build a startup, and many of them already have great skills, networks, and access to capital.\n\nAs someone without elite technical skills or a strong startup network, it makes me wonder if this is still a smart path—or if the odds are now heavily skewed toward people who are already well-positioned.\n\nIs it still realistic to pursue tech startups today if you’re not coming from FAANG, YC, or VC circles?  \nIf yes, where do people actually compete without getting crushed?\n\nWould love to hear honest takes, especially from people who’ve tried this.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1qgi7gl/is_it_still_smart_to_pursue_tech_startups_with/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o0ck41i",
          "author": "NWA55",
          "text": "The risk you pointed out is real, and you will face fierce competition from people who know better and are better funded. If you try to play their game by building generic tech, you will likely get crushed. The way you survive is by finding a specific problem where your unique insight allows you to deliver a solution better than a generalist engineer could. If you focus on delivering that unique value, you can absolutely compete.",
          "score": 54,
          "created_utc": "2026-01-18 20:03:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0fydwq",
              "author": "Taroo9",
              "text": "Exactly, I am seeing that unravel daily in B2B. Domain experts with zero tech background are building solutions to their own problems. Some are just prototypes, but it's like they've tasted blood.. they now know what's possible with a bit more iteration and dev support. \n\nThis makes GTM trickier for startups. But I think startups can still move faster and think broader. Instead of point solutions, think vertical integration...maybe own the workflow end-to-end, not just one node. Or go horizontal, be quick to take that same capability across industries before incumbents connect the dots.",
              "score": 7,
              "created_utc": "2026-01-19 08:07:27",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0g1rkd",
                  "author": "NWA55",
                  "text": "i super agree on this",
                  "score": 1,
                  "created_utc": "2026-01-19 08:38:51",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0cigtc",
          "author": "metalvendetta",
          "text": "Startups are still the best way to learn and move fast with the wind. Sure, AI takes away a lot of coding and other bottlenecks, but it also means new problems emerge and you don't need to wait for several rounds of approval before you can work on a project, if you're working with startups. \n\nAlso, now is the best time for non-tech folks to actually use their domain knowledge more than ever. I am a tech founder myself, I work with a client who worked in supply chain, and they're running a startup and I am amazed by their clarity in the product direction, primarily coming from domain expertise, and then combining it with continuously chatting his ideas into ChatGPT and Claude. His customers in non-tech loves the product,  and the entire thing was shipped in the span of one month.\n\n  \nThese are exciting times, and I have a strong feeling more fun is yet to come.",
          "score": 18,
          "created_utc": "2026-01-18 19:55:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0f9z91",
              "author": "Practical_Brick_5476",
              "text": "Agree. Many top engineers or builders don’t know the existence of some vertical problems. People who suffer from that might not have the knowledge to build that.",
              "score": 3,
              "created_utc": "2026-01-19 04:50:12",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0g4g8l",
          "author": "jonathanbrnd",
          "text": "Yes. Start side projects and ship products fast with Cursor or Claude Code. Build everything in public on X, create an audience, stay bootstrapped and keep shipping new products until one product starts making money.",
          "score": 9,
          "created_utc": "2026-01-19 09:04:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0cjq00",
          "author": "futurethonk",
          "text": "If you have the itch, you have the itch.",
          "score": 16,
          "created_utc": "2026-01-18 20:01:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ciz05",
          "author": "SpiritualWindow3855",
          "text": "NGMI if you type stuff like this and hit send.\n\nSome doubt is fine, but this is right up there with Linkedin slop and Techstars in terms of NGMI indicators.",
          "score": 7,
          "created_utc": "2026-01-18 19:57:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0cgnyh",
          "author": "Ok_Okra4730",
          "text": "I am so put off with how fast ai is progressing - I just assume anything I build is going to be replaced within years. Definitely not a good headspace to be in for motivation ",
          "score": 16,
          "created_utc": "2026-01-18 19:46:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0cly3c",
              "author": "LowFruit25",
              "text": "I honestly don’t remember what it was like before 2022. Were you thinking differently?",
              "score": 3,
              "created_utc": "2026-01-18 20:12:23",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0cuf0i",
                  "author": "Ok_Okra4730",
                  "text": "I was building things with the view that they could be still relevant in 5 years. I’m thinking now that tech could be vastly different in 18 months and it puts me off taking risks. My main skill for last 15~ years has been seo and that has changed dramatically in last few years, shattering everything I have built ",
                  "score": 1,
                  "created_utc": "2026-01-18 20:54:15",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0csxkh",
          "author": "opbmedia",
          "text": "The bar was always high. It's insanely hard to match a product to a market and catch on better than everyone else. Google was a blank landing page with one single text box and a search button that conquered tech. It is more than \"great skills, networks, and access to capital.\"",
          "score": 4,
          "created_utc": "2026-01-18 20:46:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0mt5tr",
              "author": "Spirited_Wish11",
              "text": "You don't think that it was less competitive maybe 10 - 20 years ago?",
              "score": 1,
              "created_utc": "2026-01-20 08:15:02",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0cizn0",
          "author": "Relevant-Flatworm926",
          "text": "huh? its the easiest time if anything. funds throwing money left and right at anything AI related. feels almost like ZIRP era.",
          "score": 3,
          "created_utc": "2026-01-18 19:58:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0d73ds",
          "author": "Proof_Sense8189",
          "text": "To me I see it the opposite way.\nLike right now you don’t need to ask for permission to build things (ie get money from VC), you can just build things super quick for free without much credentials, vs before when you needed contacts or a super good resume to raise. The main goal now is to figure out a real pain to work on, and distribute smartly. But anyway, that has always been the end game.\nSure, things go by fast, and you need to be more adaptable, but there are so many things yet to build, and you can do it with a very small team.",
          "score": 3,
          "created_utc": "2026-01-18 22:02:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0cjpr5",
          "author": "budding-founder",
          "text": "The odds of success are very very low if you’re non technical.",
          "score": 5,
          "created_utc": "2026-01-18 20:01:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0clmdf",
              "author": "Straight-Gazelle-597",
              "text": "The odds of success are very very low if you ARE technical😭 Life is tough for everybody, bro...",
              "score": 10,
              "created_utc": "2026-01-18 20:10:47",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0dolsc",
          "author": "RoleHot6498",
          "text": "VC here (full disclosure)- you're right that the bar is insanely high. Buy you're wrong in thinking there was EVER a time when the bar wasn't insanely high and the risk of being outdated in 5 minutes didn't exist. Go back to Henry Ford and the creation of the first moving assembly line in 1911, or Tesla, Edison and Einstein and you will find this same narrative of insanely high bars and the constant risk of outdated ideas. \n\nWhen I write a check, it's because the Founder gets this. They  see through the noise. They get crystal clear on what is really moving the needle (it's always 1 of 3 things). And they dig in, throw  the dice, kick down the door, and do it. \n\nDon't try and build the next big thing. Solve the big problem (there's lots of them). Consider the massive bottlenecks that the growth of AI is creating, and don't be afraid to venture into robotics. Hope this helps.",
          "score": 2,
          "created_utc": "2026-01-18 23:26:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0f8lta",
              "author": "spritejuice",
              "text": "What are the 1 of 3 things moving the needle?",
              "score": 2,
              "created_utc": "2026-01-19 04:40:54",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0ko3q9",
                  "author": "RoleHot6498",
                  "text": "it depends on what you're building. What  are you working on?",
                  "score": 1,
                  "created_utc": "2026-01-20 00:01:06",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o0g1wts",
              "author": "who_opsie",
              "text": "This is the dumbest thing.\n\n« Henry Ford » -> you are talking about a time where capital was only in the hands of some, and everything obvious was yet to be built. A lot of massive companies operate in obvious Maslow Pyramid. Housing, Food, Transportation.\nNow that all the roads are built, what is left is mostly B2B services based on knowledge of something probably irrelevant but just used to increase the productivity of a system that eats itself.\n\n« Go into Ai or robotics » -> yes let’s go find the exo world so we can create this dystopia nobody wanted for our kids.\n\nSo tired of most VC people. Betting on entrepreneurs like horses on a race only to make money from people who are already loaded, with no knowledge of entrepreneurship whatsoever or impact on the real world",
              "score": 2,
              "created_utc": "2026-01-19 08:40:13",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0ko7pq",
                  "author": "RoleHot6498",
                  "text": "And how much capital have you raised in your illustrious career??...",
                  "score": 1,
                  "created_utc": "2026-01-20 00:01:42",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0cntb0",
          "author": "Historical_Fox_5219",
          "text": "Yes. If you can fix something that’s broken, or less good than it could be - there’s never not a time to do that.",
          "score": 1,
          "created_utc": "2026-01-18 20:21:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0d4rpz",
          "author": "gui_stetelle",
          "text": "the bar is definitely higher now, but that doesn't mean you can't succeed.  \nDon't worry too much about fitting in with the usual circles; your unique perspective might be your strongest asset. Just my two cents from running my lead gen agency.",
          "score": 1,
          "created_utc": "2026-01-18 21:51:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0d76ne",
          "author": "Current-Gene6403",
          "text": "Starting a startup is never smart. Conversely, people with this view point will be discouraged, meaning more opportunity for others. Zuckerberg, Altman, Gates, these kinds of people will always try a startup in any era and eventually succeed. \n\nEverything's hard in one way or another.",
          "score": 1,
          "created_utc": "2026-01-18 22:02:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0d9gs3",
              "author": "Traditional_Tank_109",
              "text": "It's smarter if you're from a wealthy background because taking a job doesn't make much sense.",
              "score": 2,
              "created_utc": "2026-01-18 22:13:33",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0dnjzi",
                  "author": "Current-Gene6403",
                  "text": "Sure thats true, but everything is easier for wealthy people, whats the point?\n\nStartups are an experiment, no shame in failing and getting a job. But if you want to do it, run the experiment.",
                  "score": 1,
                  "created_utc": "2026-01-18 23:21:22",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0ddzkw",
          "author": "FudgeCool8107",
          "text": "We’re living in an era that it’s the easiest to create  new business. Opportunities are everywhere you just have to look and identify them. Processes taking too long, clients not happy all those  are signs that you need to observe. All you need to care about is to serve a certain niche by solving a REAL problem and the rest will come",
          "score": 1,
          "created_utc": "2026-01-18 22:34:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0dguex",
          "author": "brianlynn",
          "text": "It’s always been one of the most competitive game when you have people from all ages and backgrounds vying for the dream. And it’s always been heavily skewed to those with capital/skills/both.\n\nAnyone can get into the game but they should only do it if they truly see a problem they want to solve, and believe they know their users so well and have some advantage to solve it 10x better than someone else.",
          "score": 1,
          "created_utc": "2026-01-18 22:48:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0dibly",
          "author": "Acesa",
          "text": "There's more people trying than ever but there's probably more opportunity than we've had since the early internet years. I think it's a much better time to build than 6 years ago",
          "score": 1,
          "created_utc": "2026-01-18 22:55:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0e5vg1",
          "author": "Cold_Floor_8136",
          "text": "Just do it. ",
          "score": 1,
          "created_utc": "2026-01-19 00:58:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ejjoz",
          "author": "Mean_Acanthisitta264",
          "text": "Because I have similar experience so I really relate to this. I think it is true that startups are becoming increasingly competitive. But the real challenge in my eye is whether they can produce a truly good product rather than good storytellings.",
          "score": 1,
          "created_utc": "2026-01-19 02:14:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0ejt72",
              "author": "Mean_Acanthisitta264",
              "text": "The risk is getting into a new field just because it is seen as a blue sea or it is competitive.",
              "score": 1,
              "created_utc": "2026-01-19 02:15:46",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0f22rn",
          "author": "Adventurous_Heat_964",
          "text": "That mean I'm wasting my time and money..",
          "score": 1,
          "created_utc": "2026-01-19 03:57:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0fgba3",
          "author": "glowandgo_",
          "text": "depends what you mean by compete. the bar is higher for hype driven startups, sure, but there’s still room if you’re solving something boring and specific that real people pay for. what i’ve seen is most founders lose not because they lack pedigree, but because they chase crowded ideas with no edge. context and problem selection matter way more than faang logos.,,.",
          "score": 1,
          "created_utc": "2026-01-19 05:36:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0fmpvr",
          "author": "ExcitingWear4813",
          "text": "\"The things that matter to you, you wouldn’t need to know anything to pursue them if they matter to you.\"",
          "score": 1,
          "created_utc": "2026-01-19 06:26:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0fxn4e",
          "author": "dash_bro",
          "text": "There is fierce competition for sure, and I think it's a dead-end especially for first time founders who haven't been around FAANG/YC.\n\nThe benefit of FAANG in tech isn't just credibility, you also learn how to think at scale without creating a liability. You learn structure. There's no guarantee you'll learn that ofcourse, but they'd be your best chances.\n\nIf you're not well versed in it, technical founders will undersell planning/designing and get straight to vibe coding; and non technical founders will ovepromise functionality and underestimate how hard the tech can be to build.",
          "score": 1,
          "created_utc": "2026-01-19 08:00:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0g0uw6",
          "author": "who_opsie",
          "text": "You can also launch a startup without funding if you make something people want. I don’t know why we all want so much to raise funds when it only means you are going to be slave to hyper growth because growth is not enough for VCs….\n\nThe moment you raise anything apart from F&F it basically needs you will have to work your a** off to aim for IPO (or acquisition before but that’s not the preferred exit for investors I guess).\nAlso means you mostly have to conquer the world.\n\nMaybe having a nice company, creating jobs, and making nice money should be enough for some founders. But some will throw that away for the sake of what ? \n\nI don’t understand that.\nObviously some tech needs serious funding to even be made possible but what for in the end…",
          "score": 1,
          "created_utc": "2026-01-19 08:30:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0g3ez3",
          "author": "Expert-Complex43",
          "text": "I think the trick is to build something that will likely get acquired by google / meta. At the end you will be on the leadership team at facebook and maybe replace alexandr wang lmao",
          "score": 1,
          "created_utc": "2026-01-19 08:54:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0g6ixy",
          "author": "udoy1234",
          "text": "If we listen to Peter Theil, maybe not???",
          "score": 1,
          "created_utc": "2026-01-19 09:23:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0h9gsa",
          "author": "quietoddsreader",
          "text": "I think it’s still realistic, but the game changed. Competing head on in obvious spaces with generic ideas is brutal now, especially if you don’t have deep tech or distribution. Where people still win is by starting from a specific problem they know well and building something boring but useful. A lot of successful founders didn’t come from elite circles, they just had unfair insight into a niche and stayed focused longer than everyone else. The bar is higher for polish, but the bar for originality in small markets is still pretty low. It’s less about being the smartest engineer and more about picking a fight you can actually win.",
          "score": 1,
          "created_utc": "2026-01-19 14:18:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0hju8b",
          "author": "Competitive-Yam-1384",
          "text": "I'm an engineer who just left Amazon a few months ago after 5 years.\n\nEngineering skills are essential but you know what's even more valuable? Product\n\nIf you know your customer well, you'll beat out the talented engineer who doesn't. You'll just need some support on the engineering side",
          "score": 1,
          "created_utc": "2026-01-19 15:11:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0kip0t",
          "author": "StillInevitable1511",
          "text": "Honestly, no. Go for a secured career. Sure the potential payout is great, but it’s a potential. And the stress of trying to find jobs is stupid. Do something like a doctor or lawyer and make your life simple",
          "score": 1,
          "created_utc": "2026-01-19 23:31:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0mkkan",
          "author": "Used_Injury_9782",
          "text": "I’m in the process right now trying to build a startup as solo founder. Some background; I was previously the lead designer for a YC company that has been relatively successful the past year, growing from 10k to over 1M+ ARR and before that at large consulting firm as senior software engineer. I’m dual skilled and gives me some leverage, but not as much as it once did now with AI. \n\nBeing non-technical is something you should lean into and find someone who lacks the skills you possess to hunker down with or learn how to become technical but that will take time. \n\nPick a problem you are passionate about actually solving, talk with people in that domain, understand their pains, prove its something real, and speak to it authentically. Then you’ll have traction to make real connections that will then lead to bigger doors opening and more ideas. Networking is my secret weapon, whenever I feel stuck. Reach out to someone you trust to give you feedback or point you in the right direction.",
          "score": 1,
          "created_utc": "2026-01-20 06:58:29",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qfs599",
      "title": "Professor wants to use my product for free with promise of future university contract - am I being naive?",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1qfs599/professor_wants_to_use_my_product_for_free_with/",
      "author": "Ghost-Rider_117",
      "created_utc": "2026-01-17 23:21:26",
      "score": 41,
      "num_comments": 62,
      "upvote_ratio": 0.87,
      "text": "Building an AI-powered B2B SaaS tool. A professor at a state university has been testing it and wants to use it in his class this semester (about 30 students, 6-8 weeks).\n\nThe catch: they can't pay anything now. His pitch is that if the pilot goes well, he'll push for department adoption, then university-wide, then potentially the entire state university system. Says they could set up a lab fee to cover costs by 2027.\n\nMy hesitation:\n\n\\- He's already using the product and clearly sees value, but won't find even a few hundred dollars to cover compute costs\n\n\\- The timeline to any actual revenue is 2+ years of \"maybes\"\n\n\\- He wants me to prioritize building a specific feature for his use case by end of February\n\n\\- I'm currently in active conversations with paying customers in my actual target market\n\nPart of me thinks there's long-term strategic value here. Part of me thinks this is a classic trap where I subsidize someone's usage forever while chasing a contract that never materializes.\n\nMy gut says: if they saw real value, they'd find the money. The elaborate vision for the future feels like a substitute for present commitment.\n\nAm I being short-sighted? Or is this just a distraction from closing real customers?\n\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1qfs599/professor_wants_to_use_my_product_for_free_with/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o070ebq",
          "author": "boat_in_the_sky",
          "text": "offer him a free trial for a month or two maybe",
          "score": 55,
          "created_utc": "2026-01-17 23:25:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o07avq0",
          "author": "Tall-Log-1955",
          "text": "Depends on the stage you are at.  If you are early and have no customers, then real world customer usage and feedback is super valuable, so it’s probably worth it.\n\nIf you have other paying customers already, then it’s less valuable and I would just pass and focus on the customers who are paying",
          "score": 44,
          "created_utc": "2026-01-18 00:21:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o070dfu",
          "author": "SpiritualWindow3855",
          "text": "Having 30 people use your thing risk-free: should be a win if it has near 0 marginal cost to you.\n\nBut if you're counting on the money, or his feature has non-zero marginal cost, then you should move on.",
          "score": 40,
          "created_utc": "2026-01-17 23:25:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o07fxwg",
              "author": "Ghost-Rider_117",
              "text": "Love this answer, if cost were fixed then I agree 100 percent. Problem is we incur usage based cost.",
              "score": 10,
              "created_utc": "2026-01-18 00:48:08",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o07qguv",
                  "author": "SpiritualWindow3855",
                  "text": "My answer covers that: say no. \n\nExplain it costs you money up front, end of discussion.",
                  "score": 14,
                  "created_utc": "2026-01-18 01:42:55",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o0bwzw9",
                  "author": "No_Newspaper_1040",
                  "text": "Look at it as a business expense and cost of marketing. You need early user feedback",
                  "score": 1,
                  "created_utc": "2026-01-18 18:14:55",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o0endp4",
                  "author": "innersloth987",
                  "text": "Also do not build any new features for free.",
                  "score": 1,
                  "created_utc": "2026-01-19 02:35:14",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o0m24f9",
                  "author": "Chun",
                  "text": "What's the expected cost for the entire semester?",
                  "score": 1,
                  "created_utc": "2026-01-20 04:39:51",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o07i6l3",
          "author": "Sufficient_Ad_3495",
          "text": "Dude… you do it all… he’s a demo in academia and an evangelist. What you do here is you rinse the testimonials and you plaster those everywhere in your documentation website et cetera.\n\nLet him know your cost constraints which means development in his direction may be hampered just be truthful but you’ll do what you can don’t burn this bridge meanwhile pursue the money elsewhere.\n\nPlot twist, if he’s interested, what’s to say other people and departments aren’t? What’s to say central administration won’t take up your product campuswide? Get busy put them in your CRM work it. With B2B. \n\nThe sales approach is largely the same ie multiple sponsors internally and here with finance you can’t leave it with one person you have to play them off against each other.",
          "score": 14,
          "created_utc": "2026-01-18 01:00:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0g9lom",
              "author": "smoke4sanity",
              "text": "Also, why would a professor pay for something out of his own pocket? He’s likely not able to get approval for it by the department to get it funded in such a short period of time.\n\nIve seen this with enterprises, A champion having to go thru procedure for an unproven product is much harder than him saying “were already using this,, and its critical we pay so i can keep it”",
              "score": 2,
              "created_utc": "2026-01-19 09:53:26",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o077125",
          "author": "zenspirit20",
          "text": "There has to be a take for this give. Could be a \n- case study\n- referrals\n- revenue\n\nYou could also have a milestone based trigger for fees.\n\nRemember there is a tangible cost for compute etc but also an opportunity cost. Definitely don’t give it away for free.",
          "score": 13,
          "created_utc": "2026-01-18 00:00:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0bexb2",
              "author": "Karma_Connosseur",
              "text": "Hot take. Or even a letter of interest",
              "score": 2,
              "created_utc": "2026-01-18 16:49:47",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o07j06r",
          "author": "dmart89",
          "text": "Getting 30 people to test your product is a pretty sweet deal. Plus you can use the University as your first official logo. Only thing I'd agree is that in exchange they you should get extended access to people to collect feedback.",
          "score": 9,
          "created_utc": "2026-01-18 01:04:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o084c09",
          "author": "Significant-Level178",
          "text": "I work with universities, they have solid budgets. \n\nWould not do it for free, unless it costs you nothing and you want a case study or logo badly.",
          "score": 7,
          "created_utc": "2026-01-18 02:58:18",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0f6y1p",
              "author": "CaspianXI",
              "text": "And feature requests from a non-payer? Red flag.\n\nI've had potential clients who had the money to pay, but specifically requested ways that would help them circumvent the product altogether and get something else. In OP's case, I'd be concerned the professor is trying to get free AI credits.",
              "score": 2,
              "created_utc": "2026-01-19 04:29:41",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o078qm3",
          "author": "CyberStartupGuy",
          "text": "Free pilot's are pretty common. But just make sure your team has the bandwidth to support and run the business still",
          "score": 7,
          "created_utc": "2026-01-18 00:09:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o07ld6q",
          "author": "DemolitionCowboyX",
          "text": "Does this professor have the clout to make that kind of thing happen? Further, are you at the enterprise scale that a university system would want to work with you? A small startup is too risky for a university to reasonably adopt unless there was over 10x increase in value.\n\nMore likely, the professor will try to sell his pet rock good idea to the university (your product) then be shut out.\n\nThat said, how much are you willing to pay for user feedback that can make your product better?\n\nEveryone needs to start somewhere so this could be your somewhere, but understand your risks.",
          "score": 3,
          "created_utc": "2026-01-18 01:16:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o07mdg0",
          "author": "kassandrrra",
          "text": "If you can handle those usage costs, surely do it. If you cannot once have a chat with him.",
          "score": 3,
          "created_utc": "2026-01-18 01:21:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o079hv4",
          "author": "rt2828",
          "text": "Agree specific terms and get it all in writing. If he wants to use something which cost you, the university or him should pay. Alternatively this can be a marketing cost so that’s up to you if you want to give it away. For any free use, make sure the duration is not open ended.\n\nGood luck!",
          "score": 2,
          "created_utc": "2026-01-18 00:13:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o07fatf",
          "author": "macromind",
          "text": "Not short-sighted at all. Universities can be great logos, but they are also masters of \"maybe later\" timelines. If you do this, make it a real pilot with boundaries: fixed duration (6-8 weeks), fixed compute budget, and clear success criteria plus a decision meeting at the end.\n\nAlso, I would not build a bespoke feature on a promise. Put it behind a paid engagement (or only do it if it fits your roadmap anyway). Otherwise you are funding their class.\n\nIf you want more SaaS marketing/sales war stories (pilots, pricing, conversion), r/Promarkia is a decent rabbit hole: https://www.reddit.com/r/Promarkia/",
          "score": 2,
          "created_utc": "2026-01-18 00:44:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o09mdtu",
              "author": "FerencS",
              "text": "Make sure to have your script only post one comment under a post… but also nice prompting. Couldn’t tell it was AI.",
              "score": 2,
              "created_utc": "2026-01-18 09:53:29",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o098pkp",
          "author": "fakeguruception",
          "text": "Depends on the stage as u/Tall-Log-1955 mentioned. If you're early, the feedback might be useful.\n\nI had a similar situation with a local university. Teachers were super interested and recommending it to each other. But when it came time to actually sign a contract? The university kept asking for extensions to \"review the idea.\" Dragged it out for a whole year before finally making a decision (which resulted in a negative response). Thankfully didn't had any usage-based fees to cover as AI didn't even exist then.\n\nI'd say offer a free trial or student/teacher discount for the first 3 months or something. Then use that as a case study to contact other universities. Might open doors.",
          "score": 2,
          "created_utc": "2026-01-18 07:47:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0eqb9q",
          "author": "Optimal_Mammoth1830",
          "text": "PLEASE READ THIS. I’m 10 years in on a career in higher ed SaaS as a CTO/CPO. Also worked very closely with the executive team with sales and marketing counterparts. Here’s the cold hard truth: higher ed is incredibly siloed down to the lowest level. Every professor is a silo. Every department is a silo. Every school is a silo. Every university is a silo. Nobody has authority or even sway outside of their silo. Nobody colors outside of the lines. Cross-silo sales and upsells NEVER happen. We tried, tried, and tried a million more times, then tried, and tried again. It just doesn’t happen. Every single silo is individually hard won as if nothing else exists. \n\nI’m not telling you not to do the free deal, I’m just telling you to think of it as exclusively scoped to his immediate realm.",
          "score": 2,
          "created_utc": "2026-01-19 02:50:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0eqypy",
              "author": "Optimal_Mammoth1830",
              "text": "Additional context: this experience is for United States, Canada, UK, Australia, New Zealand. Can’t say for sure or not if this behavior holds in other countries because our main business has been in these countries.",
              "score": 2,
              "created_utc": "2026-01-19 02:53:43",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o075a6l",
          "author": "macromind",
          "text": "Not naive at all to hesitate. Universities are notorious for long timelines, and \"maybe in 2027\" is basically infinity in SaaS years.\n\nIf you do it, Id make it a strict, low-lift pilot:\n- Limit seats/time (eg 30 seats, 6-8 weeks, no renew without payment)\n- No custom feature work unless theres a paid SOW\n- Get a written letter of intent + intro to whoever owns budget/procurement now, not later\n- Ask for something to cover costs (even a small lab fee via department now)\n\nOtherwise, staying focused on paying ICP convos is usually the right call. Youll find a lot of good B2B pricing/pilot boundary setting discussions in https://www.reddit.com/r/Promarkia/ too.",
          "score": 2,
          "created_utc": "2026-01-17 23:51:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o074q2n",
          "author": "_DarthBob_",
          "text": "Would a case study from him help sales? Does the logo help sales? Do you have other actual users? Because if not having real users, shows you what the real issues are and you can get feedback about what features they like / want.\n\nIf you already have a ton of customers and this feels like a distraction drop it but if you don't, I'd think about trying to make it work",
          "score": 1,
          "created_utc": "2026-01-17 23:48:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o07yd5b",
          "author": "coolcloud",
          "text": "Let's assume probably won't get you a contract or even you do, it will take a long time. Even so, getting users, tracking usage, finding bugs, and building a product people love, is much more important than making money if you haven't built something to production before. \n\nThe above is worth a lot. And if you can figure out how to do it, you can go pitch it to other universities.",
          "score": 1,
          "created_utc": "2026-01-18 02:25:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o084uxx",
          "author": "kubrador",
          "text": "you're not being short-sighted, you're being rational. if there's a 2027 payday, there's a 2025 pivot where he stops returning your emails.\n\nthe \"we can't pay but we will later\" pitch is just delayed rejection with extra steps. close your paying customers instead.",
          "score": 1,
          "created_utc": "2026-01-18 03:01:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o08jod9",
          "author": "recmend",
          "text": "You are confusing the user with the buyer. In higher ed, the professor is just the user. The actual buyer is a procurement officer or an IT director. These sales cycles are notoriously painful, often dragging on for 12 to 24 months.\n\nWhen he says he will push for adoption, that doesn't mean much. He doesn't control the budget and he doesn't sign the checks. He is an internal champion with zero purchasing power.\n\nEven worse is the promise of the state system. Large state contracts usually trigger mandatory public tenders and vendor vetting processes. You are effectively locking up your resources for a sales negotiation that won't even start until 2027.\n\nDisclaimer: coming from someone who has sold to Higher-ed",
          "score": 1,
          "created_utc": "2026-01-18 04:29:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o08nq0u",
          "author": "tranz",
          "text": "I take it that you’re incurring inference costs. The more they use the higher the cost. What you could do is give them a bucket of tokens to use that’s manageable for you. This limits your exposure to the cost overruns risk. Also bake into the agreement that you can use the logo of the university and create a case study. He won’t have the power to approve this. It will have to go to legal. \n\nI would also highly suggest you just get a provisional patent. Universities are big generators of patents. It wouldn’t take much for him to send his 30 students reverse engineering your solution, creating a patent for it that the university owns and then you’re out.",
          "score": 1,
          "created_utc": "2026-01-18 04:56:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o08om5k",
          "author": "sectoroverload",
          "text": "Don't do it. Most legal contracts between students and schools will have a clause where you cannot benefit from them. There may be tons of other options where an attorney or other people or the teacher may tell you that we can do this or we can do that and it's okay, but in the end the attorneys will tell you that the university claims all rights because you are a student there and they will take over ownership of your intellectual property, especially if they can prove that you used any of their computers even for 5 minutes to check an email related to the project. I cannot express enough... Do not do it!",
          "score": 1,
          "created_utc": "2026-01-18 05:02:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o08t54g",
          "author": "Careful_AI",
          "text": "Is this your first “customer”? If ‘yes’ go for it. You can use this as a reference. In my experience, I had a similar request from a university for my HR software. Nothing came out of it, but it helped in having an anchor. Best of luck.",
          "score": 1,
          "created_utc": "2026-01-18 05:35:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o092022",
          "author": "seekingnames",
          "text": "What does the tool do?",
          "score": 1,
          "created_utc": "2026-01-18 06:47:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o098ix8",
          "author": "Portfoliana",
          "text": "Your gut is right that “future contract” promises from universities are basicaly worthless. The procurement process takes forever and professors have zero purchasing power.\n\nBut I’d still do it - just reframe it in your head. This isnt a sales opportunity, its a free case study with real users. Build maximal logging, watch how 30 students actualy use your product, and fix every bug that comes up. After 6 weeks you’ll have way better software.\n\nJust dont build custom features for him. If he needs something specific say “great idea, its on the roadmap” and only build it if your paying customers also want it.​​​​​​​​​​​​​​​​",
          "score": 1,
          "created_utc": "2026-01-18 07:45:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o09btqm",
          "author": "Expert-Birthday7928",
          "text": "You can ask for public testimonial with video. It’s great to have your university logo on website as first client.",
          "score": 1,
          "created_utc": "2026-01-18 08:15:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o09ds2v",
          "author": "Old_Flounder_8640",
          "text": "![gif](giphy|fXnRObM8Q0RkOmR5nf)",
          "score": 1,
          "created_utc": "2026-01-18 08:33:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o09eznw",
          "author": "Entreprenewbeur",
          "text": "This sounds great, someone willing to test your product. What you learn is going to be much more valuable than what you spend.",
          "score": 1,
          "created_utc": "2026-01-18 08:44:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o09gohj",
          "author": "potatodioxide",
          "text": "this could actually be vendor lock-in in disguise 🙃\n\n\nwe delivered internship related software for ‘free’ in 2021 to a major university and now the administration is literally dependent on us because it only takes a few cycles for an institution to forget practical knowledge. \n\nimo the key is to spoon feed them during that phase and treat the real admins of the system (in our case the faculty secretary) as the client since the real purchase pressure will come from them\n\nin my experience with big institutions the academic-admin relationship is pretty similar to dr.cox and carla hehe (from scrubs) \n\nacademics might be higher up but key administrative personnel are the ones who get tasks done for them",
          "score": 1,
          "created_utc": "2026-01-18 09:00:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o09i8zu",
          "author": "Wonderful-Grape1542",
          "text": "absolute distraction",
          "score": 1,
          "created_utc": "2026-01-18 09:14:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o09w1ma",
          "author": "core-Build",
          "text": "Take it as an advantage and deploy the v1 of your saas for him... On his account with zero service fees and use his credits and api and add an add-on to test the features and usage glitches to collect the feedback",
          "score": 1,
          "created_utc": "2026-01-18 11:21:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o09xq15",
          "author": "Willing-Training1020",
          "text": "your gut is doing its job. free pilots with vague future procurement promises are almost always asymmetric risk, especially when they come with feature work and real compute costs. universities move slowly, incentives are misaligned, and “department → system-wide” stories rarely survive budget reality unless there’s already a paid foothold. a clean way to test strategic value is to set hard boundaries: time-box the pilot, no custom features, or require even a nominal paid commitment to signal intent. we see founders run into this exact trap when scaling early b2b teams — focus on customers who feel the pain *now*, and revisit institutional deals once you have leverage and capacity.",
          "score": 1,
          "created_utc": "2026-01-18 11:36:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o09zvbu",
          "author": "quietoddsreader",
          "text": "Your gut is right. This is a classic academic slow lane. Universities are great logos and terrible early customers. Free pilots with vague future contracts almost never convert on founder timelines. The biggest red flag is the custom feature ask while you have real paying conversations elsewhere. If you do this at all, timebox it hard, no roadmap changes, no compute subsidy you cannot afford. Otherwise it is a distraction disguised as validation. Focus on customers who can say yes without a committee.",
          "score": 1,
          "created_utc": "2026-01-18 11:55:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0a6idq",
          "author": "HelpfulSource7871",
          "text": "Depends on the total costs. If it's affordable, better do it. If it's too costly, just be honest with him and try to work out something in the middle.",
          "score": 1,
          "created_utc": "2026-01-18 12:48:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0a8xst",
          "author": "Round-West-6898",
          "text": "Payment doesn't have to be money.   \nAsk/insist that you can send a crew to shoot videos, testimonials, take photos, etc in the class. That \"payment\" is due now (since they have been using it). The content can be used for your social media, launch videos, etc. That is the payment. If they can't \"afford\" that, then walk away.",
          "score": 1,
          "created_utc": "2026-01-18 13:05:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0aj2ad",
          "author": "Mompreneur1987",
          "text": "I would build the feature, and let him use it for free for sure. What do you have to lose besides operation costs? Slow and steady wins the game! Go for it! Eat the operational costs for now. Definitely turn it into a  a case study, review, etc",
          "score": 1,
          "created_utc": "2026-01-18 14:09:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0bf6qw",
          "author": "h_leve",
          "text": "Absolutely give it to him for free. University sales cycles are long, but they are profitable. What would it cost you overall? You can even generate case studies to walk around with backed by real expertise.",
          "score": 1,
          "created_utc": "2026-01-18 16:51:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0bi5z4",
          "author": "Upbeat-Cloud1714",
          "text": "Absolutely! I am the creator of the HighNoon Language Framework, I do a ton of deep tech R&D. Even though we're not a fortune level enterprise in the media, still proud I founded the company I did and we're doing the deep work like we do. \n\nI have vast business experience starting over 11 years ago. I would say you're right, if this had the value they needed or he wanted specific features, he'd be willing to put up something even if it was personal money, a grant, etc. Sounds like he wants you to build it and he intends to sell it the way he tells you he's going to. It's all verbage in business. \n\n  \nContact some other universities and put together a small demo or trial for it. That will actually give you a good idea of the market. We took HSMN, our architecture, and split it off into computational chemistry sim and ran into the same issues. Everyone in that market wants to use it for free effectively, and always with the promise of being paid. There's even a whole platform dedicated to those types of contracts, and it always reminds me of the Tesla and Edison with the promise of $50k to Tesla if he completed a project, of which he was never paid. Those contracts all feel eerily similar to that, they attempt to put your work beneath what they're doing in order to control it. \n\n  \nIf you're self funding, just build the features out yourself. Show a demo, and lock it behind a paywall lol. Reach out if you want to discuss this out.",
          "score": 1,
          "created_utc": "2026-01-18 17:05:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0btd19",
          "author": "fryan4",
          "text": "Professors can make students buy whatever software they want. I remember paying $60 for a semester for a pol sci class that was essentially Kahoot. Professor used it for all for 5 mins.",
          "score": 1,
          "created_utc": "2026-01-18 17:58:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0bxtlm",
          "author": "Winter-Initiative-86",
          "text": "offer him a free trial for 14 days and discounted rate to consume for the remaining weeks(maybe a special promo code). Compute the cost that is enough to cover your expenses and dont assume any profit yet. Just enough to breakeven so you dont have to bleed while getting feedback.",
          "score": 1,
          "created_utc": "2026-01-18 18:18:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0bysix",
          "author": "Fluffy_Service8052",
          "text": "What are u building?",
          "score": 1,
          "created_utc": "2026-01-18 18:23:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0c54mk",
          "author": "Longjumping_Bid_7463",
          "text": "If you can get him to pay that’s ideal, since only when ppl are actually invested and annoyed at you since they aren’t getting what they expected do you really start to get real feedback",
          "score": 1,
          "created_utc": "2026-01-18 18:51:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0dmsia",
          "author": "microlatency",
          "text": "Let him pay with feedback. Set up monthly calls. If you have no traction this is ok since you are in B2B.",
          "score": 1,
          "created_utc": "2026-01-18 23:17:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0dwj1f",
          "author": "codepapi",
          "text": "What is the computer cost for 1 person? \n\nCan’t he add it to the syllabus cost as if it was a book to break even? Have the cost placed on the students?",
          "score": 1,
          "created_utc": "2026-01-19 00:08:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0e2i8l",
          "author": "Deep_Lifeguard_5039",
          "text": "agree with your view, if they are unwilling to pay, it's either because they are not your ICP, or it is not a real enough pain point\n\nYou can DM me if you'd like specific advice on your situation, can help you define your ICP, market, GTM approaches",
          "score": 1,
          "created_utc": "2026-01-19 00:40:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0e8ael",
          "author": "Ashamed-Pen-8723",
          "text": "Avoid like the plague. Getting a university contract takes years. Source: me who wasted my time doing that. They will lead you on forever.",
          "score": 1,
          "created_utc": "2026-01-19 01:11:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0efl6q",
          "author": "stewartjarod",
          "text": "Get a letter of intent?",
          "score": 1,
          "created_utc": "2026-01-19 01:52:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0g7xmo",
          "author": "Scary_Panic3165",
          "text": "Let him use. Most companies offer something free for universities. It is good opportunity to test your product free. I can ensure that they would pay you 0 money. Process the raw material or abandon it.\n\nIf he wants features, do it, focus on feedbacks. He unconsciously helping you.",
          "score": 1,
          "created_utc": "2026-01-19 09:37:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0mf7y5",
          "author": "gameofloans24",
          "text": "Have him use it for free and reach out to other customers in the space that are similar to his type. Cold outreach to them and use professor as a case study \n\nYou show real results",
          "score": 1,
          "created_utc": "2026-01-20 06:14:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0moovc",
          "author": "kimsart",
          "text": "Maybe you can find a grant to cover use fees until he has funding?",
          "score": 1,
          "created_utc": "2026-01-20 07:34:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o082h7q",
          "author": "macromind",
          "text": "Not short-sighted at all. Universities are notorious for long timelines and \"maybe\" budgets.\n\nIf you want to pursue it for strategic reasons, Id only do it with guardrails:\n- timeboxed (like 4 to 6 weeks)\n- no custom feature work unless paid\n- get a champion plus the budget owner in the loop now\n- require a clear next step (paid department pilot, paid onboarding, or written intent with timeline)\n\nOtherwise it turns into free support plus roadmap derailment. Your paying ICP convos are probably the higher ROI right now.\n\nAlso from a SaaS marketing perspective, if you do run the class pilot, make sure you can turn it into a case study or testimonial, that can actually be valuable.\n\nSide note, Ive seen similar discussions in https://www.reddit.com/r/Promarkia/ if you want more opinions.",
          "score": 0,
          "created_utc": "2026-01-18 02:48:05",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qdlb3d",
      "title": "Pre-seed dilemma: Angel Investors vs. Incubators for a first-time founder with zero capital?",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1qdlb3d/preseed_dilemma_angel_investors_vs_incubators_for/",
      "author": "AsesinoYT",
      "created_utc": "2026-01-15 14:41:41",
      "score": 36,
      "num_comments": 30,
      "upvote_ratio": 0.92,
      "text": "Hey everyone,\nI’m at the classic \"chicken and egg\" stage. I’ve got a validated idea and a functional no-code MVP, but I’ve hit the limit of what I can do without capital. Since I can’t bootstrap this any further, I’m trying to decide between the Angel route and the Incubator route.\nI’ve done some research, but I’m seeing a lot of conflicting advice.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1qdlb3d/preseed_dilemma_angel_investors_vs_incubators_for/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "nzqho5g",
          "author": "Pitiful_Table_1870",
          "text": "just apply to both.",
          "score": 13,
          "created_utc": "2026-01-15 14:45:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzqqbde",
          "author": "caldazar24",
          "text": "Don't think of incubators as a group.   Both will take more equity at a lower valuation than you can raise from angels yourself, but a top incubator will open a lot of doors, give you a powerful network, and give you better advice.  A mediocre incubator will waste your time, not have as many top investors at their demo day, and might even be a yellow flag for some firms.",
          "score": 5,
          "created_utc": "2026-01-15 15:27:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzqhwr3",
          "author": "Individual-Artist223",
          "text": "Do neither - sell product.",
          "score": 29,
          "created_utc": "2026-01-15 14:46:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzqn7zf",
              "author": "SlowBusinessLife",
              "text": "correct. \"a validated idea and a functional no-code MVP\" should have the potential to make money otherwise one or both of these assertions is false.",
              "score": 9,
              "created_utc": "2026-01-15 15:12:39",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzqra5v",
                  "author": "caldazar24",
                  "text": "This is a big oversimplification that assumes high margins and a quick customer payback timeframe.  We don't know what OP's space is, if he's doing pure B2B SaaS then sure I agree, if he's doing eg an ad-supported consumer play, or something that involves a lot of offline logistics, good luck bootstrapping...",
                  "score": 10,
                  "created_utc": "2026-01-15 15:31:38",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzqiezi",
          "author": "Tall-Log-1955",
          "text": "Why do you need funding?  If youve got a validated product and a working MVP, just sell the product and use the revenue to scale it.",
          "score": 9,
          "created_utc": "2026-01-15 14:49:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzqt9p1",
          "author": "Rockpilotyear2000",
          "text": "Sometimes you need that money to make that money.",
          "score": 3,
          "created_utc": "2026-01-15 15:40:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzvk3m9",
          "author": "arpansac",
          "text": "Try getting people who pay for your product before you get others to invest money into it. This will give you a lot more confidence, and you'll be diluting much less if you have regular paid users and MVP is good enough to convince people to pay. Unless it's a research product like openAI or a social engagement application, where in money comes later, initially you are building traction.",
          "score": 2,
          "created_utc": "2026-01-16 06:26:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzqkh0g",
          "author": "Disastrous-Key-8726",
          "text": "Getting incubation is better. I just got into STPI ( Software Technology Park of India ).\n\nThe reason I can give is that you will meet a lot of people with a lot of opportunities during your stay and meetings at the incubation. \n\nWhereas going for angel investors , you have to go around and make intros and a lot of talking and then maybe get capital.\n\nI would give a better way to this ( and this is the way I am currently using myself ) - find one angel investor who can either be your advisor or just invest any amount; small cheques, etc and get incubated at any incubation centre. This covers both. \n\nHope I can explain my pov.",
          "score": 2,
          "created_utc": "2026-01-15 14:59:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzrlk7m",
              "author": "vishforluckk",
              "text": "Hi, thanks for sharing. Since you're already out there plz can you advise on few things. You said find one angel investor and get incubated, so you mean a strategic investor who'll back us up always in our initial days even if small cheques while we complete our incubtion right? This might sound silly but should we really risk revealing our idea, plan, and pitch deck to an angel who will get to see the problem statement and solution that we want to develop. How do we mitigate this, we will learn about IP and idea protection, pitch deck preparation and tips on what not to reveal only during our incubation. \n\nAlso, do you recommend joining an incubator is better than a VC accelerator program that are meant for idea stage startups (Example Accel -Atom , Peak XV -Surge, 100X VC - HomeRun Masterclass Series), because  incubator may take only 3-5% equity but it's followed by Angel or VC pre-seed round of 9-15% equity, so total between 12-20% equity for 1Cr-10Cr. \n\nWe may save 3-5% equity, by directly heading to an accelerator insted of incubator. \n\nWill appreciate your response and opinion.",
              "score": 1,
              "created_utc": "2026-01-15 17:48:08",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzrnysw",
                  "author": "Disastrous-Key-8726",
                  "text": "By incubation, I meant all the government startup incubators + accelerator programs. ( Any one , I meant these 2 as togather )\n\nAnd as for sharing with angels, I mean no one would even care about stealing anything, because it's still an idea. So yeah , even with small cheques , they are totally valuable and you can share everything with them. It's not a risk. \n\nWhat can be of risk is that if you can trust that human or not. It's not about trusting angels and sharing your research with them, it's about if that humans can be trusted or not. That you need to judge yourself by talking to them. That is what I am saying - judge it yourself like can this person actually help me throughout the process of not. ( Do your due diligence on them too )",
                  "score": 1,
                  "created_utc": "2026-01-15 17:58:49",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzqhuid",
          "author": "Gam_Fella",
          "text": "Incubator route can end up as the conduit to raising from Angels as a lot of incubators have angel investors in their network. Also being part of a reputable incubator lends credibility which will be handy towards angels.\n\nI hope this helps.",
          "score": 1,
          "created_utc": "2026-01-15 14:46:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzqhv68",
          "author": "mbatt2",
          "text": "Wait until you have multiple options.",
          "score": 1,
          "created_utc": "2026-01-15 14:46:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzqiifr",
          "author": "kelvis4587",
          "text": "What’s a no code mvp? Like how good is it. \n\nAre you solo entrepreneur or non technical?\n\nI’d say incubator because of how hard it is to get angel investors or any investors. \n\nMust have a compelling story. (College, idea, previous work exp, warm intro)",
          "score": 1,
          "created_utc": "2026-01-15 14:49:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzqj14x",
          "author": "Godfatherrr6",
          "text": "Keep selling and getting users. Look for grants first. Then both routes. Incubator if you have options.",
          "score": 1,
          "created_utc": "2026-01-15 14:52:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzqqmfi",
          "author": "renjupb",
          "text": "If you can start sale it at this stage, that would be best. Else build a list of customers ready to buy your product. Then approach angels or incubators ( ideally reputable ones ). In startup world there are no right or wrong answers, survival and growth of the startup is the only thing that matters. Ask the right questions, how is the incubator or angel investment helping you get to your milestones faster. That will guide you in the right direction.",
          "score": 1,
          "created_utc": "2026-01-15 15:28:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzsz0dr",
          "author": "HeadAd615",
          "text": "I am in same boat with basically an ecosystem in the regtech and compliance market which should be good with a viable differentiator from what is currently in market. However funding pre seed is difficult to impossible because people want to fund a proven revenue generating business.",
          "score": 1,
          "created_utc": "2026-01-15 21:33:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nztj8mf",
          "author": "Hot-Spicy-Potato",
          "text": "Both Angels and incubators take a lot of equity at pre-revenue stage using the high-risk card. You can get much better deals with much less effort (basically gat into a better negotiation position) if you can push it further towards revenue. If pre-sale is an option, I would go with that. If not, I would go with personal loan. If that is not an option, I would go with credit card fraud. If that doesn't work, I would rob a bank. If that plan fails, too, I might would consider an Angel round. If that fails, I would still rather go back to the bank robbery idea than give 20%-50% plus IP plus board seat and exit rights to an incubator. You get my point haha",
          "score": 1,
          "created_utc": "2026-01-15 23:11:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzv16o3",
          "author": "glowandgo_",
          "text": "in my own personal experience this depends less on the label and more on what you actually get day to day. ... angels vary wildly, some bring real context and access, others are just capital with opinions. incubators can help if you need structure and fast feedback, but the trade off people don’t mention is dilution plus a lot of generic advice. pre seed is mostly about learning speed and decision quality. i’d optimize for who helps you make fewer bad calls in the next 6 months, not just who writes the first check. also worth pressure testing how involved they expect to be, that’s where things usually break...",
          "score": 1,
          "created_utc": "2026-01-16 04:13:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzwth09",
          "author": "quietoddsreader",
          "text": "At pre seed, the real question is not angels versus incubators, it is leverage. Capital alone rarely unlocks the next step at this stage. What you usually need is credibility, feedback, and distribution. Angels can work if they are hands on and actually open doors, not just wire money. Incubators help when they force focus and speed, not when they just add a logo. I would choose based on who gets you closer to real users and better decisions in the next three months. If neither does that, keep pushing traction before taking dilution.",
          "score": 1,
          "created_utc": "2026-01-16 12:48:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzzrjgr",
          "author": "howell4change",
          "text": "Do both and then decide if you get in. If you get in to  spc or YC go for it.",
          "score": 1,
          "created_utc": "2026-01-16 21:07:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o00xb37",
          "author": "ivalm",
          "text": "You should sell your product, reach out to angels, and apply to incubators. This is not an \"or\" it's an \"and.\"",
          "score": 1,
          "created_utc": "2026-01-17 00:45:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o01f48a",
          "author": "Apprehensive-Log-928",
          "text": "What no-code platform did you use to create your MVP?",
          "score": 1,
          "created_utc": "2026-01-17 02:38:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o04suqm",
          "author": "Cipamanz",
          "text": "Im at a similar boat. Ive built the full on product and its live but lacking Marketing funds. Its validated and delivers great value. any advice?",
          "score": 1,
          "created_utc": "2026-01-17 16:57:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o06gqpp",
          "author": "learningtoexcel",
          "text": "Is your product making money?",
          "score": 1,
          "created_utc": "2026-01-17 21:47:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o06xbab",
          "author": "AnyLie2121",
          "text": "Get users. Thats all that matters.",
          "score": 1,
          "created_utc": "2026-01-17 23:09:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o06xhv0",
          "author": "AnyLie2121",
          "text": "I can give you small cheques and advise if I like your idea. DM me your deck",
          "score": 1,
          "created_utc": "2026-01-17 23:10:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0fo9fm",
          "author": "flauzelle",
          "text": "Send it to me. I’m an ex YC founder turned VC.",
          "score": 1,
          "created_utc": "2026-01-19 06:39:16",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qd786h",
      "title": "Is obsession necessary to build ambitious companies, or is it overrated?",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1qd786h/is_obsession_necessary_to_build_ambitious/",
      "author": "Miyamoto_Musashi_x",
      "created_utc": "2026-01-15 02:26:40",
      "score": 35,
      "num_comments": 33,
      "upvote_ratio": 0.96,
      "text": "Obsession is often cited as a key driver behind ambitious startups. But is it a causal factor, or simply a byproduct of strong conviction, asymmetric information, and sustained focus over time? How much does obsession actually contribute relative to execution quality, feedback loops, and long-term incentives?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1qd786h/is_obsession_necessary_to_build_ambitious/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "nzo03hc",
          "author": "arpansac",
          "text": "I think that obsession can be called as consistency. As long as you are consistently putting in those efforts and learning more and more about your domain and your target user or customer, you can start building a great product. As for a great company, it depends on what kind of culture you want to build. Execution quality doesn't come overnight, it should grow as the team grows, and not the other way around.",
          "score": 16,
          "created_utc": "2026-01-15 03:29:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nznqt77",
          "author": "Pitiful_Table_1870",
          "text": "lol. you will be outworked otherwise. If you aren't starving to succeed in a startup as the CEO or CTO, you will not be successful, as others will just outwork you.",
          "score": 11,
          "created_utc": "2026-01-15 02:34:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzrs7d0",
              "author": "Little_Discount4093",
              "text": "I swear nobody has heard of the concept of diminishing returns before. Outcomes are not directly correlated with the number of hours put in, past a certain point of course. Research has shown that 55 hour weeks are roughly as productive as 70 hour weeks. People in the SF/startup ecosystem just love jerking themselves off about how hard they work.",
              "score": 5,
              "created_utc": "2026-01-15 18:17:46",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzo0z3e",
          "author": "Silentreactor",
          "text": "Suffer too long being stagnant or pursue what you are good at?\n\nSuffer with No job and be like a zombie or risk your life? \n\nPick your poison.",
          "score": 5,
          "created_utc": "2026-01-15 03:34:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzoo4km",
          "author": "Ok-Ingenuity-2908",
          "text": "I’m not there yet, still in the building process, but yeah I believe so. You almost need to constantly be at it, even if you’re not actually working on it. And you give up a lot of your time pursuing it. I haven’t had a free weekend for over a year now, and if I’m forced to go on a holiday, i bring my work along. Most people advise me to slow it down, but you literally can’t stop lol. The break will come in time, I think. And I can now see the efforts of my “obsession”, which i measure as the distance between me against others in the space. \n\nBut don’t forget the sacrifices you have to make along the way, and they are real sacrifices, non recoverable. So you better do it well, do it fast, and make sure the rewards makes sense. Otherwise, you’ll regret",
          "score": 5,
          "created_utc": "2026-01-15 06:20:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nznqgfp",
          "author": "Aethetico",
          "text": "According to good to great, Jim Collins says you build a great company you need all 3 things:\n- you can be the best in the world at it\n- you are deeply passionate about it\n- it makes economical sense",
          "score": 6,
          "created_utc": "2026-01-15 02:32:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzoj6nh",
              "author": "Astraltraumagarden",
              "text": "Jim Collins has also never built a company. Stop taking non sense advice from either people in this sub who also haven’t built a company, or from career consultants like Collins",
              "score": 14,
              "created_utc": "2026-01-15 05:40:35",
              "is_submitter": false,
              "replies": [
                {
                  "id": "nzpuaf7",
                  "author": "Aethetico",
                  "text": "Ok thanks I'll take advice from you instead of Jeff Bezos and Reed Hastings who recommended to read it",
                  "score": 3,
                  "created_utc": "2026-01-15 12:33:17",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "nzv59gh",
              "author": "jabberw0ckee",
              "text": "Deeply passionate is the obsessive part. If you're deeply passionate about something, you obsess over it. You live it, you think it, you do it. \n\nObsession is key, but it stems from passion.",
              "score": 1,
              "created_utc": "2026-01-16 04:39:41",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzoxce2",
          "author": "luketron",
          "text": "On the one hand, obsession can be the difference between something existing or not existing at all. You could say OpenAI's founding in 2015 was a product of that.\n\nOn the other hand, YC founder @shiftj posted on X yesterday about two friends who built billion-dollar businesses, writing \"They're smart, committed, and work hard. But they're not geniuses. They just figured it out as they went. [...] In reality, they struck on something and held on for dear life as it started to get its own legs. \"\n\nThat is, they tapped a well of pent-up demand. I think latent demand is one of the more poorly understood aspect of startups, given most people focus on the product and then figure out the market side of PMF later. But if you can tap that well of demand, the market will pull the product out of you. \n\nSome folks manage do that out of obsession; some just happen to be there. There are no rules :)",
          "score": 2,
          "created_utc": "2026-01-15 07:40:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzp1gl5",
          "author": "MORPHOICES",
          "text": "Previously, I believed that obsession makes conditions. \\~\n\nWhat was my hard lesson was that obsession helped early. Obsession hurt later. I paid no heed to weak signals as they didn’t fit in my story.\n\nWhat sustained curiosity long-term made better driver. Obsession limits. It pushes you for update.",
          "score": 2,
          "created_utc": "2026-01-15 08:18:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzp38dk",
          "author": "Equivalent_Crow_9009",
          "text": "I see obsession less as a cause and more as a byproduct of conviction and focus. What really matters is execution quality, tight feedback loops, and incentives that reward long-term learning. Obsession helps with endurance, but without those fundamentals it doesn’t create outcomes.",
          "score": 2,
          "created_utc": "2026-01-15 08:35:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzq2fdd",
          "author": "quietoddsreader",
          "text": "I think obsession is usually the output, not the input. When founders have real signal, early traction, or insight others do not see, obsession shows up naturally because the work keeps paying back. Forced obsession without feedback just turns into burnout and stubbornness. What matters more is sustained focus paired with fast correction. Plenty of companies die with obsessed founders who were just obsessed with the wrong thing. Execution quality and feedback loops decide if obsession compounds or traps you.",
          "score": 2,
          "created_utc": "2026-01-15 13:24:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzv5ozs",
          "author": "jabberw0ckee",
          "text": "My opinion is, it's the most important. \n\nIt stems from passion. \n\nGrit is natural because of your passion.",
          "score": 2,
          "created_utc": "2026-01-16 04:42:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzw4dps",
          "author": "CrazyEnvironmental47",
          "text": "Obsession is mostly a retrospective story we tell after something works. It sounds clean and heroic, but it confuses cause with consequence. What actually builds ambitious companies is not obsession. It is clarity plus incentives plus feedback that compound over time. Obsession often shows up later as a visible symptom, not as the engine.\n\nIn the early stages, what looks like obsession is usually asymmetric information. Founders know something others don’t yet. That creates conviction. Conviction creates focus. From the outside, that focus gets labeled obsession. But the underlying driver is not emotional intensity. It is informational advantage combined with belief that the advantage can be converted into outcomes.\n\nObsession without execution quality is useless. Many obsessed founders ship nothing meaningful. They romanticise the problem, over-identify with the idea, and become blind to signals. Obsession actually becomes dangerous when it overrides feedback loops. You stop listening. You start defending. You confuse persistence with progress. That is how companies burn years on the wrong thing.\n\nWhat matters far more is the structure around the founder. Tight feedback loops. Clear metrics. Skin in the game that rewards long-term value, not short-term validation. The ability to revise beliefs without losing identity. None of these require obsession. They require discipline.\n\nThe best ambitious companies are not built by founders who are constantly emotionally charged. They are built by founders who can sustain focus for a long time without burning out, who can make boring decisions repeatedly, and who can delay gratification while staying rational. That looks unsexy. So we call it obsession instead.\n\nObsession is overrated because it is easy to mythologise and hard to replicate. Execution quality is boring but transferable. Incentive design is boring but powerful. Feedback loops are boring but decisive. These are the real multipliers.\n\nIn practice, obsession helps at the margins. It can push someone through temporary uncertainty or social resistance. But it is not the core driver. The core driver is sustained alignment between belief, evidence, and reward.",
          "score": 2,
          "created_utc": "2026-01-16 09:25:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzxop7c",
          "author": "scran-jonny",
          "text": "Obsession over solving the problems your customers have - yes! \n\nObsession over the solution you're offering - no!",
          "score": 2,
          "created_utc": "2026-01-16 15:30:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzoa8g4",
          "author": "oscarnyc1",
          "text": "It makes it easier to continue moving forward when things are hard.",
          "score": 1,
          "created_utc": "2026-01-15 04:35:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzoc2du",
          "author": "cosmicloafer",
          "text": "Yeah you have to be obsessed, it’s not just something that’s going to happen by itself.",
          "score": 1,
          "created_utc": "2026-01-15 04:48:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzolkc4",
          "author": "getluvsum",
          "text": "i’d say “grit” is a way better way to achieve anything in the startup world than just being ambitious. worked for my friends so i’ve seen it firsthand. ",
          "score": 1,
          "created_utc": "2026-01-15 05:59:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzoug7a",
          "author": "Individual-Artist223",
          "text": "Obsession is commitment,\n\nCommitment is obsession,\n\nSo, yes, you need obsession.\n\nHow else are you going to solve the problem?\n\nYou've got to be committed, obsessed, relentless.",
          "score": 1,
          "created_utc": "2026-01-15 07:14:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzq33dp",
          "author": "BirthdayAlarming5266",
          "text": "even if the ans is YES how would u try to obsess over something, u can fake it for couple of days or may be 2-3 months but soon u will look at urself and think ur a fool who is trying to artificially give out an emotion, \n\ni don't know yet, maybe by the end of this year I would have an ans, am building one right now, soo...",
          "score": 1,
          "created_utc": "2026-01-15 13:28:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzqvvtf",
          "author": "emster549",
          "text": "Obsession to me was the deep belief that there was nothing else I’d rather do in this world and if I wasn’t able to do it then I didn’t want to live but dying wasn’t an option. It’s a calling that takes over your entire identity and nothing and nobody can convince you otherwise. You need this obsession when building an ambitious company because there will be a million things that challenge you along the way, and the people that don’t have that would give up. \n\nThe financial struggles, giving up conventional paths, arguing with family, having to explain your decision to everyone, all of the people who tell you to just get a real job, the people who don’t get your idea, the people who tell you to “just bring it to your competitor”, the people who say it’ll take too much time and money. Without obsession, all of those will crush you. \n\nDoing the company is the only thing. The only choice. Thats the obsession. \n\nIt’s not consistency, motivation, determination, discipline, being type A. If you have those but don’t have obsession, there’s nothing to stop you from giving up and putting in that work for someone else. If you have none of those, but have obsession, you’ll never give up.\n\nEdit: @zachpogrob on Instagram discusses obsession regularly and how crucial it was in building his business. Worth checking out and has always deeply resonated with how I feel about my own.",
          "score": 1,
          "created_utc": "2026-01-15 15:52:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzrcp08",
          "author": "Ok_Rough5794",
          "text": "I don't know about \"obsession\". I think there's a lot of baggage with that word.\n\nBut here's what I know: being disciplined and productive when all your employment concerns are taken care of, and when your task/mandate has been handed down by a manager or management in general.. is different than having that focus and determination for something you've conjured up yourself. Being accountable to yourself, and not letting things like procrastination, doubt, fatigue, and even minor bouts of emotional ill-equilibrium derail you... requires that *extra thing*.\n\nThat *extra thing* manifests for each person as a subset (or, maybe, a superset) of their own personality and mental/emotional capabilities. For some it's obsession, for others it's a profound lack of limiting beliefs, at least operationally. For others it's all of the above problems but strong resiliency anyway.\n\nThere isn't a single universal *thing*. It's the best of your individual potential. You can't be someone else, but you can be the optimal you. Figure that out and nurture it and act from it. Seeing the truth of your efforts, and what keeps you from doing something every day, is also a superpower. Lots of people tell stories of their efforts... but they faff about a lot and count their consternation about it as part of their labor investment.\n\nFaff about when you faff about, but work when you work.",
          "score": 1,
          "created_utc": "2026-01-15 17:08:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzrwldb",
          "author": "SoulSpaceFounder",
          "text": "Obsession isn’t the driver — it’s the symptom.\nClear insight + ownership + fast feedback makes people look obsessive.Execution quality and learning rate matter more than raw intensity.",
          "score": 1,
          "created_utc": "2026-01-15 18:37:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nztxaiu",
          "author": "kubrador",
          "text": "obsession gets mythologized because founders who succeed were obsessed, so survivorship bias makes it look causal when really they were just obsessed \\*and\\* got lucky with timing/market/execution. you can be incredibly focused and driven without being the \"sleep at desk, forgot to shower\" type and still build something massive.\n\n the real requirement is probably sustained attention and willingness to change your mind, which obsession sometimes actively prevents you from doing.",
          "score": 1,
          "created_utc": "2026-01-16 00:27:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzzb8mt",
          "author": "Lucas_hussle",
          "text": "Think I have the same obsession",
          "score": 1,
          "created_utc": "2026-01-16 19:51:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzzkjaa",
          "author": "FounderBrettAI",
          "text": "\"Obsession\" sounds romantic but in practice it usually just means you're willing to do the boring, unsexy work consistently for years while everyone else gets distracted. The most successful founders aren't obsessed with their vision, they're just really stubborn about solving one specific problem and refuse to quit when it gets hard.",
          "score": 1,
          "created_utc": "2026-01-16 20:34:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o00djwk",
          "author": "Own_Bench_3961",
          "text": "Obsession is only 'one' of the many, many things necessary to build ambitious companies!",
          "score": 1,
          "created_utc": "2026-01-16 22:54:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o02un9l",
          "author": "moghrua",
          "text": "Among my friends who've built successful businesses, obsession is universal. It is hard and takes a long time, you need that fanatical drive.",
          "score": 1,
          "created_utc": "2026-01-17 09:23:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzo5rc8",
          "author": "7HawksAnd",
          "text": "Yes. Full stop.",
          "score": 0,
          "created_utc": "2026-01-15 04:05:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzojtrw",
          "author": "Astraltraumagarden",
          "text": "By ambitious do you mean billion dollar valuations? Yes. Otherwise it gets tiring. Currently I am uninsured because the HR I hired missed some deadlines, making minimum wage in TN while my company’s bank account is looking good while I am 30, wanting to marry my long term girlfriend but having no money, struggling with health etc. cancelled all plans, thousands of mile from home in a shitty little town because I can’t afford rent where my company is actually based. My girlfriend and all my friends are in NYC. I can’t do this without being obsessed. My only passion is going to the gym, and then going to Reddit. I am somehow extremely happy. You know the funniest part? I have a friend who I share with doing the exact same thing, in the exact same position. I would kill myself if I was running his startup.",
          "score": 0,
          "created_utc": "2026-01-15 05:45:31",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qc6wix",
      "title": "Any advice for landing an enterprise customer? (B2B SaaS)",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1qc6wix/any_advice_for_landing_an_enterprise_customer_b2b/",
      "author": "deskslayer_",
      "created_utc": "2026-01-13 23:22:11",
      "score": 27,
      "num_comments": 34,
      "upvote_ratio": 1.0,
      "text": "Product: Data Management SaaS, with target customer being large institutions dealing with sensitive data (Financial Services, Healthcare, Telecoms, etc)\n\nBasically, I’ve built an MVP for a B2B SaaS in a Data Management space (the cliche B2B SaaS guy). I’ve got decent experience in DM and was part of 5 SaaS deals at my 9-5 job as a customer, so I have a good understanding of the process, but it’s actually getting my foot in the door with those big companies that seems a bit impossible given that my SaaS is very niche.\n\nIs there anyone here who could share their experience of landing an enterprise customer or at least generating some decent leads?\n\nMy current instinct is to get a LinkedIn premium and give a bunch of demos to people in the space.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1qc6wix/any_advice_for_landing_an_enterprise_customer_b2b/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "nzg79iy",
          "author": "AgntCooper",
          "text": "Your ICP is way too broad. You need to be able to talk about a problem so specifically and in such a relatable way that your buyer is nodding along the whole time thinking, “this guy GETS it. This problem drives me nuts and this is the guy who will solve it.”\n\nYou need to know the specific relevant regulations you’re helping them with as well as (or better) than their lawyers if that’s your angle. Go to the places these buyers hang out, but when you have this fluency with your problem space, cold outreach has a way of working better because you’ll better cut through the noise.",
          "score": 14,
          "created_utc": "2026-01-14 00:08:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzgezzl",
              "author": "deskslayer_",
              "text": "Valid mate, I have my ICP really narrowed down, I guess I should’ve mentioned that properly.\n\nAny tips with cold outreach? Have you had any success doing it via email? To be honest I get loads of emails like that in my day job, ironically, I ignore most of them",
              "score": 2,
              "created_utc": "2026-01-14 00:50:31",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzguql6",
                  "author": "Vaughnatri",
                  "text": "Everyone ignores them, that's why you're hosed.  Instead, build something they are actively searching for and they will magically find you.",
                  "score": 3,
                  "created_utc": "2026-01-14 02:19:49",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzg0ca5",
          "author": "Wide_Brief3025",
          "text": "Getting in with enterprise clients can be tough since most ignore cold outreach. Try joining discussions where their decision makers hang out and offer insights or answer questions without pitching. It worked for me when I landed my first big client. Tools like ParseStream can help you spot those conversations and reach out when leads are already warmed up by the topic.",
          "score": 6,
          "created_utc": "2026-01-13 23:31:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzg0kt0",
              "author": "deskslayer_",
              "text": "Thank you, that’s good advice",
              "score": 1,
              "created_utc": "2026-01-13 23:32:37",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzgajs5",
          "author": "Dizzy-Criticism-7836",
          "text": "Your main edge is going to be proof, not pitch. Before chasing random demos, pick one tight wedge: a specific painful workflow (e.g., PHI access reviews, data lineage for audits, vendor risk reporting) and make your product solve that better than anything.\n\n\n\nWhat’s worked for me in enterprise:\n\n\n\n\\- Warm intros > cold anything. Ask ex-colleagues, old vendors, consultants, and auditors for intros to data governance / security / platform heads. Offer a 20–30 min call framed as “sanity check this thing I’m building,” not a sales demo.\n\n\\- Start with smaller “enterprise adjacent” orgs (regional banks, specialty hospitals, SaaS handling sensitive data) to get your first logo and a real case study.\n\n\\- Join niche Slack/Discord/communities (data engineering, compliance, dbt, Snowflake, etc.) and give away useful stuff (templates, checklists, queries) to pull people in.\n\n\\- For outbound, I’ve used Apollo and Clay plus Pulse alongside LinkedIn Sales Navigator to test very specific personas and messages, then doubled down where replies actually turn into calls.\n\n\n\nYour main goal right now is: 1–2 credible logos and sharp positioning, not “a bunch of demos.",
          "score": 3,
          "created_utc": "2026-01-14 00:26:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzgeghy",
              "author": "deskslayer_",
              "text": "Great advice, I really appreciate that 🙏",
              "score": 2,
              "created_utc": "2026-01-14 00:47:32",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzi5wzt",
          "author": "luketron",
          "text": "There's a dance to early enterprise sales that's pretty opaque to outsiders. It sounds like you've been buyer-side several times so maybe you're already familiar with it, but fwiw...\n\n1. The classic advice (per _Crossing the Chasm_) is to find a genuine early adopter who likes trying out new stuff. They will understand your tech is early, but the tradeoff is the 10x gain they get despite the pain (bugs, support, etc). Think about someone who speaks at (or attends) meetups for e.g., and wants something cool to show their peers. You can also just ask them if they're an early adopter!\n2. That 10x benefit might help the enterprise in some broader way, but in sales (per Gartner) business value is table stakes and personal value is king. So think about how your product can help them directly and/or make them look better on their next performance review, or on LI, or at the next meetup for e.g., and roll that into your hook if you can. \n3. Obviously, almost no enterprise gets a pitch for an MVP product and takes it as is. But that doesn't mean they're uninterested in early tech. This is where the enterprise sales dance really starts, and the magic term here is \"design partner.\" I.e., you're not looking for a sale, you're looking for a design partner to help you build towards true PMF. This needs to be handled carefully so you protect your IP (if you product is compelling but simple, it can be cloned), but there's a playbook for it, and the right buyers understand how it works.\n\nDM me and I'll send you a playbook from another founder if you like (can't link to it directly because it's from a closed community), but either way, all the best with it :)",
          "score": 3,
          "created_utc": "2026-01-14 07:56:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzi83e1",
              "author": "deskslayer_",
              "text": "Thanks a lot for all this info, much appreciated",
              "score": 3,
              "created_utc": "2026-01-14 08:16:51",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "nzp8i5s",
              "author": "Rtzon",
              "text": "DMed you!",
              "score": 2,
              "created_utc": "2026-01-15 09:27:27",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "nzi90lc",
          "author": "Willing-Training1020",
          "text": "enterprise buyers don’t buy “mvp saas,” they buy risk reduction. the fastest way in is anchoring to a real problem they already feel. pick one narrow use case (one regulation, one workflow, one department) and position yourself as *the* solution for that slice. warm intros beat cold every time, so leverage former colleagues, vendors, consultants, or compliance folks who already sell into these accounts. don't hesitate to use the people you already know. it build credibility, and credibility compounds magnificently. don't get me wrong though,  linkedin can help, but it’s usually the follow-up channel, not the wedge.",
          "score": 3,
          "created_utc": "2026-01-14 08:25:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzolf3m",
          "author": "Deep_Lifeguard_5039",
          "text": "Stop thinking “mass outreach” first—enterprise sales is all about trust and relevance. Your MVP doesn’t need to impress the IT team; it needs to solve a **real pain someone with budget already feels today**. Find the single person who suffers the most from the problem your tool solves, and tailor your outreach to *them*, not a generic LinkedIn blast. Even one warm intro through a mutual connection can be worth more than 50 cold demos.",
          "score": 3,
          "created_utc": "2026-01-15 05:58:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzfznzj",
          "author": "Odd_Pop3299",
          "text": "does it have to be enterprise at first? can you aim for smaller series A/series B companies?",
          "score": 2,
          "created_utc": "2026-01-13 23:27:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzfzwo3",
              "author": "deskslayer_",
              "text": "I’ve considered this, but I know for a fact small organisations won’t find my product relevant, as there’s not enough regulatory incentive to use it.\n\nedit: of course smaller fintechs for example still go under a lot of scrutiny, but it’s easier to manage compared to large organisations. That’s the problem I’m solving",
              "score": 1,
              "created_utc": "2026-01-13 23:28:59",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzilx77",
          "author": "HelpfulSource7871",
          "text": "Why do you think Financial Services, Healthcare, Telecoms can trust their data to an entity with 1 person?",
          "score": 2,
          "created_utc": "2026-01-14 10:30:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "nziujv7",
              "author": "deskslayer_",
              "text": "There are loads of guardrails every organisation has (activity monitoring, service acc permissions, etc).\n\nIf I get the needed security certificates as part of the onboarding, why wouldn’t they buy into it?",
              "score": 1,
              "created_utc": "2026-01-14 11:43:29",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzj2pt1",
                  "author": "HelpfulSource7871",
                  "text": "simply becoz we were coldwalled before many times even with track records of enterprise clients in the other sectors😭. But anything can happen, good luck...",
                  "score": 1,
                  "created_utc": "2026-01-14 12:42:35",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzlxqz3",
          "author": "goosetavo2013",
          "text": "A good buddy of mine works in B2B SAAS focusing on finance and family office compliance. He says in person conferences are his best lead source. Not as a sponsor or booth, just literally as an attendee and just talks to people nonstop during the event and networks like a madman.",
          "score": 2,
          "created_utc": "2026-01-14 20:56:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzq2pan",
          "author": "quietoddsreader",
          "text": "Enterprise rarely starts as “let me sell you my platform.” It usually starts as solving one painfully specific problem for one team that already trusts you. Cold LinkedIn demos are a low hit rate unless you are targeting a narrow role with a concrete trigger like an audit, migration, or incident. What works better early is finding a design partner inside a smaller division, even if procurement comes later. Security, compliance, and credibility matter more than features at this stage, so case studies and references beat polish. If you cannot name the exact buyer and the exact moment they feel the pain, lead gen will feel impossible no matter the channel.",
          "score": 2,
          "created_utc": "2026-01-15 13:26:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzhc9hn",
          "author": "AV_SG",
          "text": "Reach out to your known network first and then the next immediate circle . On your approach, you need to be a bit persistent on \"what\" problem you are solving and \"how\", once you know their problems .",
          "score": 1,
          "created_utc": "2026-01-14 04:02:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzi5o2c",
          "author": "Electrical-Isopod975",
          "text": "If you're in the MVP stage, landing an enterprise client is nearly impossible.   \nLinkedin premium (+ salesnavigator) is a good starting point, but I'd probably try to reach people from smaller companies first. And they don't have to be C-level executives (they are usually ignoring cold outreach), but maybe actual relevant team members/leads who are actually gonna use the product.",
          "score": 1,
          "created_utc": "2026-01-14 07:54:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzohrjn",
          "author": "New_Resolve_6067",
          "text": "What’s your current stage ?\nIt’s just an MVP or something else ? I ddn;t get",
          "score": 1,
          "created_utc": "2026-01-15 05:29:42",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzp2lwx",
              "author": "deskslayer_",
              "text": "My MVP is 90% there. Well I call it MVP, but it is fully functional, looks fine visually, properly tested. Does what it says on the tin.",
              "score": 1,
              "created_utc": "2026-01-15 08:29:49",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzpsla7",
          "author": "ChiefEvrythgOffcr",
          "text": "Apollo + Clay makes lead gen + enrichment easy. Then you’d want to find some high intent buyers, write some customized outbound messages, book demos, and push for pilots.",
          "score": 1,
          "created_utc": "2026-01-15 12:21:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzsullj",
          "author": "Significant-Level178",
          "text": "I worked at enterprises decision level positions and I consult many of them for infra and cybersec. \n\nNow going with my startup I don’t position our product to enterprise first, they do not buy it from startup at seed stage. \n\nWhatever product you have, it’s almost impossible to sell it to enterprise. \nThe risks are too high. The benefits are too low.",
          "score": 1,
          "created_utc": "2026-01-15 21:12:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzsvvdt",
              "author": "deskslayer_",
              "text": "Fair enough. Would you say landing an enterprise pilot or a design partnership isn’t realistic either?",
              "score": 1,
              "created_utc": "2026-01-15 21:18:47",
              "is_submitter": true,
              "replies": [
                {
                  "id": "nzsxkxa",
                  "author": "Significant-Level178",
                  "text": "Chances are slim. Especially if you go from the street and don’t know or didn’t work with decision makers. \n\nAlso, you need to know that any enterprise has partners, connections and companies who are doing their job to keep relations and sell something. Not even startups. Vendors, resellers, consulting. \n\nAs an example solid size company with 40k people is trusting me. On top of that our AM has weekly calls with CIO to keep relations and I pickup the phone anytime the decision makers are calling me to answer any questions and provide professional advice about anything they want. \nEven with such level of communication, I would not position myself to pitch 1 person startup to them, this would risk my reputation and trust that I have established for years. \n\nYou might have a small theoretical chance if your startup is so unique and solves a huge pain and someone will listen.",
                  "score": 1,
                  "created_utc": "2026-01-15 21:26:39",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "nzsx6u2",
          "author": "Commercial-Tutor-238",
          "text": "One thing that really matters with enterprise buyers is being able to talk plainly about the **cost of inaction**. Big companies rarely move because something is exciting or clever — they move when doing nothing starts to feel risky. As long as the current setup is uncomfortable but familiar, it’s easier for them to live with it than to introduce something new.\n\nSo the conversation isn’t really “here’s my product,” it’s “what’s actually happening if you leave this as-is?” Where are teams burning time working around data issues, where do audits get messy, what risks are being quietly accepted because fixing them feels harder than tolerating them. When you help them see that the status quo has a real, ongoing cost, the dynamic changes. Suddenly an MVP doesn’t feel like a gamble — it feels like a way to stop the bleeding.\n\nThat’s usually the shift that unlocks enterprise momentum. Once inaction has a name and a price, buying stops being about curiosity and starts being about self-preservation.",
          "score": 1,
          "created_utc": "2026-01-15 21:24:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzt4k8w",
          "author": "Crafty-Sea-134",
          "text": "It’s not a lead gen problem, it’s a growth verification and trust barrier issue (or you wouldn't find LinkedIn so impossible). Having helped 50+ founders scale niche SaaS, If you’re serious DM me to see how I can help you.",
          "score": 1,
          "created_utc": "2026-01-15 21:58:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzjcs8u",
          "author": "SilverPlankton2949",
          "text": "Where are you at with compliance?  \n  \nAgreed your product is very niche and your ICP is too broad. Once you refine that you can do more targeted ads and marketing etc... inbound is very powerful.\n\n\nI ask about compliance because honestly that was when everything changed for us. I guess it's just showing you take yourself seriously and aren't fuck⁤ing around.\n\n\nWe used Scyt⁤ale as a startup for SOC 2 specifically and it really opened a lot of doors for us.",
          "score": 0,
          "created_utc": "2026-01-14 13:43:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzje1kc",
              "author": "deskslayer_",
              "text": "With compliance, I had some input from a person who’s a specialist in SaaS compliance. We went through my software to make sure that I could pass an audit fast and added some security features. As mentioned in the post, I’m involved in SaaS procurement at my 9-5 so I know what financial services clients will ask for.\n\nSome advice I got from a mega successful SaaS cofounder is to negotiate a deal with an enterprise client, factor in the costs of getting any cert they want, extend the timeline accordingly and then deploy once everything is in place. This will only work if your SaaS is already compliant in theory.",
              "score": 1,
              "created_utc": "2026-01-14 13:50:20",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nzsjy5c",
          "author": "ZorroGlitchero",
          "text": "You will need cold emails and linkedin dm. And a lot of experiments and high intent leads. If you need help seeting up this tools, let me know. I do not charge for that , i mean for the setup and explain how to do it.",
          "score": 0,
          "created_utc": "2026-01-15 20:23:23",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qgxzko",
      "title": "Is it true you need a unique startup idea solving a big gap in the market to build a billion dollar firm?",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1qgxzko/is_it_true_you_need_a_unique_startup_idea_solving/",
      "author": "Grozfroz",
      "created_utc": "2026-01-19 07:44:31",
      "score": 18,
      "num_comments": 20,
      "upvote_ratio": 0.82,
      "text": "i really need to be educated in this matter\n\ni actually worked on many ideas and discussed it with a LLm i now hate because it glazes your idea a lot\n\nand yes its chatgpt\n\nwell back to the point,so my main question is\n\ndoes the startup idea to be fully unique really matter to make a multi billion $$ firm\n\nor you can get into a competitive market and just have a angle or uniqueness in execution and outperform them?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1qgxzko/is_it_true_you_need_a_unique_startup_idea_solving/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o0gekqd",
          "author": "Portfoliana",
          "text": "Uniqueness is overrated honestly. Most billion dollar companies werent first or even unique - they just executed better.\n\nGoogle wasnt the first search engine. Facebook wasnt the first social network. Dropbox wasnt the first cloud storage. They all entered crowded markets and won through better execution, distribution, or timing.\n\nThe “unique idea” myth is mostly pushed by people who never built anything. In reality customers dont care if your the 50th tool in a space - they care if you solve their problem better than whats out there.",
          "score": 38,
          "created_utc": "2026-01-19 10:39:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0lx1j7",
              "author": "Boring-Fuel6714",
              "text": "‘Execute well’ is a very broad definition. I think this sentence also contains many concepts that people could easily misunderstand, and a few that are genuinely key / critical.",
              "score": 1,
              "created_utc": "2026-01-20 04:08:54",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0fxezr",
          "author": "FidgetyHerbalism",
          "text": "I think most people are generally too reductionist about this idea\n\n\nLike if you look at Uber, what made Uber valuable?\n\n\nThey had a fairly unique idea, sure.\n\n\nBut they also actually did the shitload of engineering and algorithmic testing to make it work. They actually figured out pricing strategies, refund strategies, driver comp, incentives. They actually went through all the effort of finding drivers and figuring out the right HR system to manage them. They actually had to work on safety for all involved. They actually fought legal battles against miffed taxi companies and cautious states. Etc.\n\n\nThere were millions of hours of work and detail that were put into making it work and if they hadn't gotten it largely right, perhaps Uber just dies off as a fad or gets swept by some competitor that becomes the billion dollar company in its place (think early search companies vs Google).\n\n\nLike no matter whether you have a unique idea meeting a gap or you just think you can execute better, there is still going to be such an enormous amount of execution and ordinary business operations required that it's not entirely clear how much the idea mattered in proportion. It can certainly buy some attention and early clients and breathing room, okay, but maybe the exact same team would've killed it just as well running a conventional oil & gas exploration firm, you know? \n\n\nAnd on top of that, the good idea is so often a *function* of the other stuff. If you go out and talk to users and build a few products and then figure out what you should actually be doing and pivot, well, you kind of already *had* the good company in place. You just found a better product for that company to make. So did you need the good idea, or did you make the good idea by virtue of having a company that was already good for other reasons, and just early in its lifecycle? \n\n\nTrying to reduce it to \"which is more important, X or Y or Z?\" style questions is often just not very useful. If the billion dollar companies have all these things, they're all important, so go get all of them. The discussion is mostly about what the most efficient order of operations to get them in is and which feedback loops come online fastest IMO ",
          "score": 11,
          "created_utc": "2026-01-19 07:58:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0id4jn",
              "author": "Shot_Hall_3569",
              "text": "There is a lot of gray area hustle they did, which makes much more sense why they succeeded. In most cases tech giants became market leaders through abusing the system and ethics.\n\nBut yeah, it's still execution.",
              "score": 1,
              "created_utc": "2026-01-19 17:24:53",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0h17py",
          "author": "Fun_Ostrich_5521",
          "text": "Short answer: no, the idea doesn’t need to be unique but the insight usually does.\n\nMost billion-dollar companies didn’t start with a brand-new category. They entered crowded markets and saw something others missed.\n\nA few patterns that actually show up in YC-scale outcomes:\n\n1. Non-obvious wedge in a known market Stripe didn’t invent payments. They realized developers were the buyer and made integration radically simpler. Same market, different entry point.\n2. Timing + execution beats novelty Airbnb wasn’t the first marketplace for stays. Smartphones, payments, and trust systems finally made it work at scale.\n3. Unique problem framing, not unique product The best startups reframe who the product is for or what job it really does. That reframing drives distribution and adoption.\n4. Competitive markets are often a good sign Competition means money and demand exist. The risk is not competition it’s entering without a sharp reason you’ll win.\n\nWhat doesn’t work:\n\nSlightly better products with no clear wedge\n\nCopying features without changing distribution, buyer, or economics\n\nBelieving praise from LLMs instead of real users (your instinct there is correct)\n\nA useful test isn’t is this idea unique?  \nIt’s: Why will this work now, and why us?\n\nIf you can answer that clearly, uniqueness usually follows as a result not a prerequisite.\n\nIf you can’t, novelty won’t save it.",
          "score": 5,
          "created_utc": "2026-01-19 13:32:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0fwj07",
          "author": "Knowledge_Seeker_001",
          "text": "Almost no market is a winner takes all market anymore, there are so many competitors on any sector you look into. \n\nBut obviously, if you choose a traditional crowded space, and still underperform, you will deservingly die. So if you have the oppurutnities, choose those special, complex and newer spaces, where you have much more chance of survival. \n\nThe recent AI Startup hype says most about it. As most of the sectors are newly adapting AI, so even the mediocre tech or company have a large chance of success here. Whether they would be around after 10-15 years is another debate, but at least for now, they are gonna set the course of it.",
          "score": 4,
          "created_utc": "2026-01-19 07:50:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0g50ur",
          "author": "HelpfulSource7871",
          "text": "Work out a MVP with minimum costs possible (time and money) and test it. No LLM can tell you how your clients would react for real before you get the true feedback.",
          "score": 2,
          "created_utc": "2026-01-19 09:09:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0i4x3t",
          "author": "attn-transformer",
          "text": "If you’re gonna make something someone already makes understand they have gained expertise as they communicate with customers. \n\nYou need to be 10x better than them. \n\nI’d suggest you read Peter Thiels 0 to 1.",
          "score": 2,
          "created_utc": "2026-01-19 16:47:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0gt8k0",
          "author": "Desperate_Quit_5433",
          "text": "Not at all. There are many unicorns that  entered crowded markets and just executed better.\nTony Xu, founder of DoorDash, has said this explicitly that  they entered an already crowded market [Uber  eats]  and outperformed everyone through execution.",
          "score": 1,
          "created_utc": "2026-01-19 12:40:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0h5jsi",
          "author": "rco8786",
          "text": "No.",
          "score": 1,
          "created_utc": "2026-01-19 13:57:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0jbpr6",
          "author": "-night_knight_",
          "text": "no. it needs to solve a problem enough people are ready to pay to get solved",
          "score": 1,
          "created_utc": "2026-01-19 20:00:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0jqj84",
          "author": "Drumroll-PH",
          "text": "You don’t need a completely unique idea to build a billion dollar company. Most massive startups didn’t invent a new category, they just executed better, faster, or differently. Execution, timing, team, and understanding your customers usually matter far more than originality. The angle you bring can be enough to outperform incumbents.",
          "score": 1,
          "created_utc": "2026-01-19 21:09:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0knp7k",
          "author": "glowandgo_",
          "text": "full uniqueness is overrated. most big outcomes come from crowded markets where someone executed better or saw a constraint others ignored. the trade off people don’t mention is distribution and timing matter as much as the idea itself. execution is where the real differentiation usually shows up.,,",
          "score": 1,
          "created_utc": "2026-01-19 23:58:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0l6zkj",
          "author": "BusinessStrategist",
          "text": "It’s really very simple.\n\nYou need to be in the “right” place, at the “right” time, with the “right” product/service when the herd stampedes in your direction.\n\nLook at the history of the Xerox photocopier.\n\nOr the inventions of the Xerox lab.\n\n“Virtual Reality” is too soon, “Crypto” is dominated by scams and money launderers, and “AI” is too immature to find its place.\n\nPeople are naturally opposed to change. So only time will tell when change will happen.\n\nMany countries have very low birth rates. So the evolution of the “generational cohorts” may take time to sort themselves out.",
          "score": 1,
          "created_utc": "2026-01-20 01:43:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ly9el",
          "author": "Beginning-Bit-484",
          "text": "Multi-billion means world wide use case and the current billionaires are actively working to make it REALLY hard for you to get there. Money comes from somewhere, it’s what makes it meaningful. \n\nThey want the AI boom because they control and own the majority of that domain. If you’re not technical or worse, a lazy dev, the AI code you generate will never “take you to the moon” because they own all of it and legislated to make it essentially worthless. \n\n\nhttps://www.mbhb.com/intelligence/snippets/navigating-the-legal-landscape-of-ai-generated-code-ownership-and-liability-challenges/\n\nEdited.",
          "score": 1,
          "created_utc": "2026-01-20 04:16:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0m0l0f",
          "author": "Deep_Lifeguard_5039",
          "text": "No, it needs to solve a real pain point - this is the ONLY thing that matters!\n\nIf anyone is having trouble with B2B GTM, DM me",
          "score": 1,
          "created_utc": "2026-01-20 04:30:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0h473d",
          "author": "muntaxitome",
          "text": "no. also setting out to create a billion dollar firm if you are on your first time startup and not very wealthy already is like setting out to win the lottery",
          "score": 1,
          "created_utc": "2026-01-19 13:49:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0j7woy",
          "author": "iLikeE",
          "text": "The trick is having a rich family with equally rich friends and have your parents’ friends give you seed money. Doesn’t really matter if your product is unique, revolutionary or a pile of dogshit. You will be able to build a billion dollar firm",
          "score": 0,
          "created_utc": "2026-01-19 19:42:41",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qcelte",
      "title": "How to get first customer",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1qcelte/how_to_get_first_customer/",
      "author": "North_Aardvark2953",
      "created_utc": "2026-01-14 05:11:12",
      "score": 16,
      "num_comments": 16,
      "upvote_ratio": 0.94,
      "text": "Hi everyone, I am working on a service based app and I just created a landing page so I'm curious on how I can get the word out to build my email list. I plan on speaking to my target market in next few weeks, but I'm curious to hear about everyone's journey to see if can learn from you all.\n\n  \nThank you",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1qcelte/how_to_get_first_customer/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "nzht7lz",
          "author": "CarpetNo5579",
          "text": "forget a wait list, just go talk to people and try to sell whatever it is you’re doing as a service first.\n\nthen iterate from their",
          "score": 9,
          "created_utc": "2026-01-14 06:04:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzhttvt",
              "author": "North_Aardvark2953",
              "text": "thanks! ill keep that in mind and go talk to whoever I can in my network",
              "score": 1,
              "created_utc": "2026-01-14 06:09:42",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "nziu7yq",
          "author": "gui_stetelle",
          "text": "you're kinda missing a trick here. talk to your target audience now, before you launch. \n\nfind people who might benefit from your app and engage them directly.\n\nTip: reaching out to prospects who have recently interacted with related topics on LinkedIn can create warm leads. They’ve shown interest so its going to be easier for you",
          "score": 5,
          "created_utc": "2026-01-14 11:40:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzjbjg3",
          "author": "SilverPlankton2949",
          "text": "talk to your target market firstt",
          "score": 4,
          "created_utc": "2026-01-14 13:36:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzm23tv",
          "author": "Desperate_Quit_5433",
          "text": "As someone who did close to 200k in sales in the  past half a year with a service base app, its just literally getting out there and talking to your potential customers all day every day.",
          "score": 4,
          "created_utc": "2026-01-14 21:16:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzkvvfv",
          "author": "-night_knight_",
          "text": "i think you should talk to your target audience as much as you can, and if they seem interested in what you're building, you will both validate it and build up your waitlist, maybe ask them for a few contacts in the same industry (they surely know someone) and set up a coffee chat with them as well (which should be super easy as you'll be sort of \"referred\" to them). then you can also try launching your waitlist on platforms like producthunt if that's something where your icp hangs out, but that's more like a side quest, the main thing i believe you should focus on is talking to your icp",
          "score": 3,
          "created_utc": "2026-01-14 18:05:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzin8w4",
          "author": "Difficult-Catch9885",
          "text": "I don't know anything about startups and stuff, BUT Ben Silbermann, co-founder and former CEO of Pinterest \"would go to local coffee shops, buy people coffee, and ask them to use the product\" (https://davidsenra.substack.com/p/pinterest-ceo-and-co-founder-ben)\n\nAlso: [https://www.ycombinator.com/blog/ben-silbermann-at-startup-school](https://www.ycombinator.com/blog/ben-silbermann-at-startup-school)",
          "score": 2,
          "created_utc": "2026-01-14 10:42:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzpsbju",
          "author": "ChiefEvrythgOffcr",
          "text": "Get a list of potential customers and reach out on LinkedIn",
          "score": 2,
          "created_utc": "2026-01-15 12:19:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzwsg08",
          "author": "Busy_Swing_4473",
          "text": "I think you should get your first customer before building the product. Meaning you should find at least 5-10 people that are willing to pay for the product even before you start building it :)",
          "score": 2,
          "created_utc": "2026-01-16 12:41:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzw5nb4",
          "author": "N_Karthik_23",
          "text": "PlainBuild lets solo founders describe an internal tool (CRM, lead tracker, ops workflow) and get a usable app instantly. I’ve recently added basic automation too (status-based actions, simple triggers, workflow steps).  \n  \nRight now I’m mainly waiting for honest feedback and guidance — especially on:  \n• how to make the launch smoother  \n• what would help attract real users after launch  \n• which automations actually matter  \n  \nYour input would genuinely help shape the product.  \n  \nIf you want to try it:  \n👉 Alpha access: [https://plainbuild-instant-tools.lovable.app](https://plainbuild-instant-tools.lovable.app/)  \n  \nAlso, I’m most active on Twitter if that’s easier to connect:  \n👉 [https://x.com/karthik23n](https://x.com/karthik23n)  \n  \nReally appreciate any help or advice 🙏",
          "score": 1,
          "created_utc": "2026-01-16 09:37:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o05bgbe",
          "author": "Foreign_Tower_7735",
          "text": "LinkedIn is helpful and you can give a lead magnets for them to sign up too. If you want I can send to you more info to do this.",
          "score": 1,
          "created_utc": "2026-01-17 18:23:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0d4yi2",
          "author": "moghrua",
          "text": "Don't underestimate how much you learn talking to customers.  Even if your solution is perfect, you'll get so much better at explaining & selling it.",
          "score": 1,
          "created_utc": "2026-01-18 21:52:03",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qg2kbe",
      "title": "have you switched to credits based pricing from usage based billing for your ai startup? how did you model it ?",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1qg2kbe/have_you_switched_to_credits_based_pricing_from/",
      "author": "vnwarrior",
      "created_utc": "2026-01-18 07:49:28",
      "score": 15,
      "num_comments": 20,
      "upvote_ratio": 0.94,
      "text": "hi,\n\nif you are building an ai startup....did you struggle with billing and pricing ?\n\njust like lovable, did anyone here switch from usage based billing to credits based billing ? was it easy (did customers get angry, etc) ? did your margins improve ?\n\nmy customers are migrating to credit based billing... and want to learn what were the gotchas here.\n\none of the gotcha i have heard frequently is pre-paid vs post-paid credits.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1qg2kbe/have_you_switched_to_credits_based_pricing_from/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o0a0snk",
          "author": "glowandgo_",
          "text": "seen this a few times. the trade off people don’t mention is credits mostly simplify *your* mental model, not the customer’s. customers tend to be fine if credits map cleanly to something they already understand, but get annoyed fast if it feels like obfuscation of usage.\n\nin my experience margins don’t magically improve, what improves is predictability. prepaid credits help cash flow but raise trust issues early, postpaid credits feel safer but you’re back to chasing overruns. the gotcha is edge cases, retries, partial failures, background jobs, those are where credit math gets weird.\n\nif you switch, overcommunicate how credits burn and why. most anger comes from surprises, not the model itself......",
          "score": 7,
          "created_utc": "2026-01-18 12:02:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0az9jr",
              "author": "vnwarrior",
              "text": "thats a fair reply - and i think its a tradeoff. Im wondering why everyone is moving to this.\n\nLovable has been infamous right ? and it is pretty much the fastest growing ai company in history",
              "score": 1,
              "created_utc": "2026-01-18 15:35:08",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o09ug09",
          "author": "SpiritualWindow3855",
          "text": "Do not do post-paid unless you have a good reason (selling a big corp or something)\n\nI'm in consumer but I had to ship credit-based usage after a user bought the $100 a month tier and racked up $100 of usage in  a few days (without abuse: user was gushing on Reddit about the product, genuinely thought $100 a month meant I was making bank off them... but just had way too much fucking time on their hands)\n\nUsers were understanding enough, and pricing the cheapest credit refill lower than the lowest previous subscription helped soften the blow... but yeah give people a ton of LLM usage below cost and they will take it, and they will be unhappy when you're forced to end it.",
          "score": 4,
          "created_utc": "2026-01-18 11:07:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0azn3x",
              "author": "vnwarrior",
              "text": "thanks so much for writing here ! \n\nhow did you price ? you said this \"Users were understanding enough, and pricing the cheapest credit refill lower than the lowest previous subscription helped soften the blow\"\n\nwhat worked ? what was the way you estimated conversion between credit and dollar value here ?",
              "score": 1,
              "created_utc": "2026-01-18 15:36:59",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0cmvqm",
                  "author": "SpiritualWindow3855",
                  "text": "I aimed for a 30% margin on AI features then rounded to whole numbers.\n\nOn some features I get a better margin on because of LLM implementation details: like prompt caching. \n\nMy product is input token heavy, so prompt caching means I'm paying maybe 10% of the normal per-request cost if there's a full cache hit. \n\nSo I give the user a 50% discount on retrying a LLM request with a new output, now they feel like they're getting a bargain, and I make more profit off their retry than a fresh request \n\n\n\nAlso I'd have to do analytics homework to find the conversion, but this was week 3 of something that ended up growing pretty fast so I took my licks and upset Discord messages and moved on: anyone who churned over it was a bad customer anyways.",
                  "score": 1,
                  "created_utc": "2026-01-18 20:16:56",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o09sz77",
          "author": "wtf_rainbows",
          "text": "Doing the same math and considerations right now. For us it’s the model that makes the most sense - seat based don’t work well with our product",
          "score": 3,
          "created_utc": "2026-01-18 10:54:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0azf2j",
              "author": "vnwarrior",
              "text": "hey thanks for your reply. any insights on what kind of credits model works ? what didnt work ? what pisses off customers less ?",
              "score": 2,
              "created_utc": "2026-01-18 15:35:53",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o09b9lu",
          "author": "kubrador",
          "text": "customers hate prepaid credits because they feel like they're gambling with their money. post-paid is basically just usage-based with extra steps and a worse UX. the real gotcha is people will hoard credits like they're actual currency and then get mad when they expire.",
          "score": 2,
          "created_utc": "2026-01-18 08:10:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o09e93c",
              "author": "vnwarrior",
              "text": "hey thanks for replying.\n\neveryone has switched to credits based billing - look at lovable or gamma for e.g. [https://lovable.dev/pricing](https://lovable.dev/pricing) , [https://gamma.app/pricing](https://gamma.app/pricing) , [https://www.stringcost.com/outcome-credits](https://www.stringcost.com/outcome-credits)\n\n  \nlovable got a lot of flak for it. but thats the only way its able to make this work. you disagree ?",
              "score": 1,
              "created_utc": "2026-01-18 08:37:48",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o09ip04",
          "author": "Wonderful-Grape1542",
          "text": "same question",
          "score": 1,
          "created_utc": "2026-01-18 09:19:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o09zist",
          "author": "quietoddsreader",
          "text": "Pricing was harder than the tech for us. Credits help abstract away model volatility, but they also hide cost, which can backfire if users feel surprised later. The cleanest transitions I have seen were framed around predictability, not margin improvement. People get upset when credits feel like funny money. Prepaid works better for controlling burn, postpaid feels better for trust early. The real gotcha is mapping credits to real world usage in a way that stays stable as models and costs change. If you change that mapping too often, you lose credibility fast.",
          "score": 1,
          "created_utc": "2026-01-18 11:52:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0aztmc",
              "author": "vnwarrior",
              "text": "\\>The real gotcha is mapping credits to real world usage in a way that stays stable as models and costs change.\n\noh damn - this is exactly what i was worried about. how did you solve this ? is there any stability given that models change. model costs change. would you pass on a drop in model costs ?",
              "score": 2,
              "created_utc": "2026-01-18 15:37:53",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0cfcnj",
                  "author": "Repulsive_Bus5846",
                  "text": "Yes. This is the real dilemma. Experiment with worst case scenarions and use that as your benchmark. This will also give you clarity on which tasks provide the most value.",
                  "score": 2,
                  "created_utc": "2026-01-18 19:40:27",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0cdp1j",
          "author": "Repulsive_Bus5846",
          "text": "Haha, this is insane. My product has been live for months, and I still haven't implemented pricing, despite people pushing for it. The problem with our model is that it is completely new; we can't just do what others are doing. Everything came to me last night, validating that delaying pricing was the right call.\n\n**1) Understand what exactly the problem you are solving for them is, and your pricing should quantify it.** If you are just a \"middleman,\" usage-based fees make sense. But if you are \"infrastructure,\" a subscription for the platform + credits for the AI labor is the move.\n\n**2) Don't tax success.** The biggest \"gotcha\" with usage-based billing is that it eventually feels like a penalty. If your customer grows, their bill explodes, and they start looking for ways to bypass your platform. You want a model where they are happy to grow because the \"core\" cost stays predictable.\n\n**3) Monetize the complexity, not the volume.** Instead of charging per user or per \"action,\" charge for the organization of it all. People will pay you to solve their \"mess.\" When the UI gets cluttered because they are doing so much work, that’s your signal to upsell them on a higher-tier organizational structure.\n\n**4) Credits should be \"Agentic Fuel.\"** We went with pre-paid credits because it shifts the mindset from \"I’m paying for a feature\" to \"I’m buying units of labor.\" Pre-paid avoids the \"bill shock\" of usage-based models. It's much easier for a company to approve a $50 credit top-up than to see a surprise $500 bill at the end of the month.\n\nWe literally followed the cursors model, but without the seat-based model because it does not provide any value, and it benefits us if they have many team members cause this will exhaust their credit and will either have to top up or upgrade their plan.",
          "score": 1,
          "created_utc": "2026-01-18 19:32:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0cekmk",
              "author": "vnwarrior",
              "text": "thank you so much for sharing this !  \n\\>It's much easier for a company to approve a $50 credit top-up than to see a surprise $500 bill at the end of the month. \n\nthis is a very deep insight. There are comments here that oppose this and i wonder what you feel about this.\n\nHow do you calculate a credit ? for your own internal purpose - how do you price it ? do you average out the tokens for a normal usecase and apply that ? what about when models change - do you plan to pass on the cost advantage to users in their credits ?",
              "score": 1,
              "created_utc": "2026-01-18 19:36:40",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0cgw69",
                  "author": "Repulsive_Bus5846",
                  "text": "We are solving a niche problem, so we know and define everything(tools, agents, etc) available to our customers. \n\n\"Do you average out the tokens for a normal usecase and apply that?\" - yes(for now).\n\n\"What about when models change - do you plan to pass on the cost advantage to users in their credits?\"  - Yes. \n\nOur goal is to eventually fine-tune our custom model so that it will be more predictable.",
                  "score": 1,
                  "created_utc": "2026-01-18 19:47:54",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0frbo0",
          "author": "TrackOurHealth",
          "text": "I’m working on https://imagibooks.com (not launched yet) and I’m planning credits only, usage based credits. Costs are quite high in fact everytime people generative AI, there is no choice. I’m worried I’m too expensive for the market but I’m trying. A flat fee unfortunately wouldn’t work for this.",
          "score": 1,
          "created_utc": "2026-01-19 07:04:51",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qgmfg8",
      "title": "any recommendations for logo design?",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1qgmfg8/any_recommendations_for_logo_design/",
      "author": "spastor89",
      "created_utc": "2026-01-18 22:32:54",
      "score": 7,
      "num_comments": 6,
      "upvote_ratio": 1.0,
      "text": "hey y'all\n\n  \nWe are in need of a new logo with a proper font integrated into the design with our name\n\n  \nI'm wondering if any of you have advice about where we can get one made that has professional quality for about $200-$500 USD?\n\n  \nI know there are lots of people on upworkfivr who offer these services but it's hard to know who is actually good.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1qgmfg8/any_recommendations_for_logo_design/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o0dls8f",
          "author": "microlatency",
          "text": "Nano Banana, move fast and focus more on things what really matter in the beginning.",
          "score": 4,
          "created_utc": "2026-01-18 23:12:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0gdkvb",
          "author": "tinavons",
          "text": "DM me, I can share a portfolio and we can chat 😊",
          "score": 1,
          "created_utc": "2026-01-19 10:30:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0gjxaq",
          "author": "HumbleReflection1126",
          "text": "Dm, I am designer. I will give you some ideation according to the idea then you can decide further to move along with that.",
          "score": 1,
          "created_utc": "2026-01-19 11:27:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0gnsrx",
          "author": "HelpfulSource7871",
          "text": "plenty of tools now, lovart, ai video players like Kling, Hailuo, can do images as well.",
          "score": 1,
          "created_utc": "2026-01-19 11:59:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0fc25k",
          "author": "SleepExpensive6983",
          "text": "Looka.com with some tweaks might be the option for any founder at pre-stage.",
          "score": 0,
          "created_utc": "2026-01-19 05:04:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0g23e2",
          "author": "unclekarl_",
          "text": "Used Looka for mine and we love it",
          "score": 0,
          "created_utc": "2026-01-19 08:41:56",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qemqv8",
      "title": "Tech Undergrad in Developing Country - Should I Avoid Startup Risks Until I Move Abroad?",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1qemqv8/tech_undergrad_in_developing_country_should_i/",
      "author": "BasilPuzzleheaded298",
      "created_utc": "2026-01-16 17:43:47",
      "score": 6,
      "num_comments": 11,
      "upvote_ratio": 0.71,
      "text": "I'm an undergrad tech student in Pakistan, aiming to relocate abroad right after graduation via scholarships or work opportunities. My dream is to start a tech startup eventually, but relocating is my first priority due to limited opportunities here.\n\nShould I play it super safe and avoid any risks until I'm settled overseas? Or should I dip my toes in online startup stuff which might delay my move if I won't achieve success?\n\nRight now, time is extremely scarce for me. I could use it to maximize my GPA or spend some time on side startup experiments.\n\nAny advice from folks who've been in similar shoes? Thanks!",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1qemqv8/tech_undergrad_in_developing_country_should_i/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "nzyotgs",
          "author": "differentdima",
          "text": "This is a very wise question. \n\nDon't think of startups yet, but DO think of \"building something\". Think of a problem YOU have that's bothering you, perhaps something related to your studies or personal life. Something small and isolated that doesn't need months of development to solve. \n\nSolve it. Don't spend more than a month or two on it. It shouldn't be \"clean\" or \"well-architected\", but it should WORK.  It should solve a problem. Then find another few things and solve those, learning from past mistakes. \n\nDon't make it a priority, but focus on your studies - you will need them. \n\nBut you need to learn how to solve real problems and complete real projects - studies aren't the best at it.\n\nYou have plenty of time. Don't rush.",
          "score": 6,
          "created_utc": "2026-01-16 18:10:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "nzyth3y",
              "author": "BasilPuzzleheaded298",
              "text": "Thanks for your advice!",
              "score": 1,
              "created_utc": "2026-01-16 18:31:09",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "nzzdw9a",
              "author": "Xinurval",
              "text": "This is good advice. Also make sure you are financially fine, so if you did fail a tech startup (very likely) are you going to be okay for the next 2 years.",
              "score": 1,
              "created_utc": "2026-01-16 20:03:30",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0289fe",
          "author": "rivereto",
          "text": "I’m from a developing country as well and since I was a teen, I had the idea of moving abroad and creating a startup. When I was 23, I managed to move abroad and worked pretty hard for 7 years. Now I’m 30, I’m trying to build my startup. It is easier when you don’t have visa problems (already a resident) and have a cushion (meanwhile I also got married and having the right partner also makes things easier, before that I felt much more worried about finances that made me to not try to build a startup). No wonder why the average age of startup founders is actually in the 30’s.\n\nThat being said, the reality for tech was quite different 7 years ago, and it was easier than today to find a job overseas. So maybe you should have a plan B in case the plan A doesn’t work.",
          "score": 2,
          "created_utc": "2026-01-17 06:00:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "nzzrnjs",
          "author": "howell4change",
          "text": "You can build cheap. Do one in your free time to learn.",
          "score": 1,
          "created_utc": "2026-01-16 21:08:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o01ewnp",
          "author": "luketron",
          "text": "Haven't been in your shoes, but IMO 100% focus on building your own solid foundation first. That's the strategic thing to do long term. Get the grades, make the move, get the job, get established, and then in whatever community you land in start thinking about what startups opportunities look like. That solid foundation will give you far more flexibility to experiment with side projects or startups in the long run, with plenty of opportunity to fall back on if it doesn't work out. But you do you :)",
          "score": 1,
          "created_utc": "2026-01-17 02:36:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o09zpbe",
          "author": "quietoddsreader",
          "text": "I would separate irreversible risk from reversible learning. You do not need to start a company now to become startup capable later. What matters is building skills, taste, and proof of execution that travels with you. Side projects that teach you how to ship, work with users, or earn a dollar online are low risk and high leverage. Betting your relocation on a startup working out is a very different risk profile. Optimize for optionality first. Once you are in a stronger position geographically and financially, startup risk becomes a choice instead of a constraint.",
          "score": 1,
          "created_utc": "2026-01-18 11:53:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0awn9z",
              "author": "BasilPuzzleheaded298",
              "text": "Thanks for sharing your perspective! In addition to building those skills, I strongly believe that maintaining a strong GPA now will open more doors for me in the future.",
              "score": 2,
              "created_utc": "2026-01-18 15:22:13",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0kn94z",
          "author": "zerospyAi",
          "text": "build something people really want, forget about relocation or other things.",
          "score": 1,
          "created_utc": "2026-01-19 23:56:29",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}