{
  "metadata": {
    "last_updated": "2026-02-03 17:18:13",
    "time_filter": "week",
    "subreddit": "ycombinator",
    "total_items": 14,
    "total_comments": 170,
    "file_size_bytes": 164301
  },
  "items": [
    {
      "id": "1qus5t9",
      "title": "I’ve hired over 1,000 influencers and spent millions. Here is the no-bs playbook.",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1qus5t9/ive_hired_over_1000_influencers_and_spent/",
      "author": "borjafat",
      "created_utc": "2026-02-03 13:38:57",
      "score": 73,
      "num_comments": 35,
      "upvote_ratio": 0.88,
      "text": "If you want to scale your marketing with influencers but dont want to burn cash on bad deals, get scammed by fake bot views, or waste months listening to \"gurus\" who have never actually booked a sponsorship... then you might enjoy this.\n\nI work as a Marketing Director for a pretty big brand and I also run my own SaaS on the side. \n\nBetween the two, I've hired over a thousand influencers and spent millions in partnership dollars.\n\nHere is the brain dump on what actually works:  \n  \n\\-YouTube longform first until you max out on youtube longform, dont do any other format. Nothing beats the power of the attention spam and the direct CTA with link in description as longform does. Ignore all the gurus telling you to hire one million micro influencers on TikTok, even if you’re target audience is on TikTok/Reels, I guarantee there are also channels on youtube with longform videos for that same audience, dont waste your time don’t lose your sanity, do longform until there’s noone else to partner with on that format.  \n  \nYou need to have a solid proven offer before you try influencers. Have scarcity in the CTA, like “First 1,000 people to click the link get this special offer”  \n  \nTest 60 second integrations vs fully dedicated videos (more expensive). Have them put the 60 second promo in the first 5 minutes of the video to maximize eyeballs on your offer.\n\nBeware of scammers, several channels inflate their views and engagement with bots, look for suspiciously consistent high views across all videos, look for repeated and sometimes identical comments praising the influencer, too many emojis, and celebrities in the profile pictures even.\n\nIf you’re a startup strap for cash, you will want to push for commission only deals, for my startup Rebelgrowth, that’s 30% on every generated subscription for life, but in my experience most influencers don’t like performance deals even when they would be making more money in the long term, they dont know this so its your job to explain the math on why this is the case, make a simple spreadsheet, make a loom video, praise their last video, explain why you think your startup would be a great fit and explain why the commission offer is better than flat rate.  \n  \nHowever, if you’re an established startup/company with a budget, you’ll want to do flat rate deals because YOU will make more money in the long term as opposed to having to pay 30% of your revenue forever.  \n  \n30% of deals will succeed, those are the channels you will want to nurture and repeat and that will carry the whole effort, another reason why you need to stay away from flat rate as a bootstrapped startup, you can’ afford to have your first 10 deals fail looking for the 3 that will work. This is a numbers game.\n\nWhat I look for in a channel (this is less important when doing performance deals): Audience affinity; how relevant is the topic to your business, what are audience demographics (age, location, genre), how consistent are views across the last 12 videos, how often does the channel publish, what’s the engagement rate (high engagement = high conversions), I can afford more on a channel with 7,000 views but 15% engagement rate than a channel with 10,000 views but 5% engagement rate. Engagement is comments to subs (or views) rate.\n\nOn flat rates, always negotiate down aggressively, argue why with the channels using your analysis from the above paragraph. I personally look for sub $50 CPMs when doing flat rate (irrelevant when doing commission deals).  \n  \nTo find channels, ask your favorite AI chat to do “Deep Research” and find the top 100 channels that meet your preferred criteria. If doing commissions, aim for small channels to improve your chances of getting a “yes”, so channels with under 10k subs. You can also simply search youtube, or one of the millions of apps out there that have a youtubers database. Gather the list and then it's time to find the emails. I pay a guy on upwork $50 per 100 researched channels because youtube only lets you unlock 5 emails per day. This guy has a bunch of accounts he uses to unlock emails quicker.  \n  \nOnce you have the emails, use your favorite outreach tool to schedule 4 - 7 emails (the money is in the followups). Keep it simple, lead with “Paid sponsorhip?...” in the subject and first line of email copy so the influencer knows you’re down to business.   \n  \nHave dedicated landing pages per influencer or dedicated coupon codes or if you’re doing affiliate commissions it doesn’t really matter since they will have their affiliate link to your product anyways.   \n  \nYou’ll want to stay compliant if you’re a big company, which means making sure the influencer clearly discloses its a sponsorship when the Ad begins, have them put your logo as soon as they say the video is sponsored by your company.\n\nCheers,  \nBorja\n\np.s. this post was edited to share the unfiltered, non-AI version of my draft, with wrongful grammar, etc.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1qus5t9/ive_hired_over_1000_influencers_and_spent/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o3c992w",
          "author": "bubbascrub9793",
          "text": "Fascinating let's connect",
          "score": 10,
          "created_utc": "2026-02-03 13:43:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3c9czx",
              "author": "borjafat",
              "text": "Sure [x.com/borja\\_obeso](http://x.com/borja_obeso) works best for me",
              "score": 0,
              "created_utc": "2026-02-03 13:44:08",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3c9hcx",
          "author": "SignificantDuty5976",
          "text": "Sharp claim without proof?",
          "score": 3,
          "created_utc": "2026-02-03 13:44:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3c9vif",
              "author": "borjafat",
              "text": "Understandable. Search youtube for influencers promoting Craftsy (the company i work for) and do the math, you will find thousands of videos, im the guy negotiating them.",
              "score": 2,
              "created_utc": "2026-02-03 13:46:59",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3caesw",
          "author": "SignificantDuty5976",
          "text": "\"Influencers hate this.\" <-- You can say that again lol.",
          "score": 3,
          "created_utc": "2026-02-03 13:49:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3cgvg3",
          "author": "pbalIII",
          "text": "30% lifetime rev share for YouTube creators is interesting math. But I'd push back on the idea that commission-only is a realistic path for pre-revenue startups... creators have seen too many affiliate programs flame out, so the upfront cash is really insurance against your company not existing in 6 months.\n\nThe hybrid model (small flat fee + rev share) seems to thread the needle. You're signaling you have budget and believe in your product, while still aligning incentives long term. I've seen that land better than pure commission pitches, especially with mid-tier creators who have more options.",
          "score": 3,
          "created_utc": "2026-02-03 14:25:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3ck4fg",
              "author": "borjafat",
              "text": "That's a very fair point. The thing is, if you don't have cash, your only other option is to offer equity, which is trending. And if you're targeting small channels that are not getting any offers from anyone anyways, it doesn't matter, you're both taking a gamble on your projects (they on their channel, you on your startup), I could also argue youtube could shut down a channel after you paid a flat rate and you're in the same position the influencer would be in your described scenario.",
              "score": 2,
              "created_utc": "2026-02-03 14:42:17",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3c9ei4",
          "author": "IamGambas",
          "text": "Wonderful ressources man, thanks a lot !",
          "score": 1,
          "created_utc": "2026-02-03 13:44:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3caiiu",
              "author": "Comfortable-Tell-192",
              "text": "Agreed",
              "score": 1,
              "created_utc": "2026-02-03 13:50:29",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o3ccoic",
              "author": "borjafat",
              "text": "You're welcome, have you been considering influencer marketing?",
              "score": -2,
              "created_utc": "2026-02-03 14:02:27",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3cumk6",
                  "author": "IamGambas",
                  "text": "Yes I do !",
                  "score": 1,
                  "created_utc": "2026-02-03 15:34:17",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3cajd5",
          "author": "Comfortable-Tell-192",
          "text": "100% on the longform vs shorts debate. Everyone is obsessed with Reels right now but the churn is insane. A 20 min YouTube video lives forever. People underestimate the SEO value of those longform vids too.",
          "score": 1,
          "created_utc": "2026-02-03 13:50:37",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3cay1u",
              "author": "borjafat",
              "text": "yea, longform for the win",
              "score": 1,
              "created_utc": "2026-02-03 13:52:54",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3cdhdv",
          "author": "DisastrousOstrich562",
          "text": "Hey, first off - thank you so much for the post! There's a ton of great info in it.. \n\nI'm curious about whether this form of advertising works when you are more B2B? We are in legaltech but our product applies to a few different avenues - startups, big law, SMEs, in-house counsels, etc. I'm curious if you think YouTube influencer advertising would make sense for us and, if so, would following this playbook yield similar results?",
          "score": 1,
          "created_utc": "2026-02-03 14:06:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3cfbzz",
              "author": "borjafat",
              "text": "Yeah of course, businesses are ran by people...who watch youtube too.",
              "score": 1,
              "created_utc": "2026-02-03 14:16:49",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3cl571",
          "author": "BaseRevolutionary365",
          "text": "This is gold",
          "score": 1,
          "created_utc": "2026-02-03 14:47:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3cmjt5",
              "author": "borjafat",
              "text": "Thank you. Have you been thinking about trying something like this?",
              "score": 1,
              "created_utc": "2026-02-03 14:54:46",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3ctefp",
          "author": "Classic_Chemical_237",
          "text": "Great post!\n\nWhat’s your thought on producing the long form video yourself? Worth the effort?",
          "score": 1,
          "created_utc": "2026-02-03 15:28:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3cuqtt",
              "author": "borjafat",
              "text": "You mean to post it in my own channel or to give to the influencer to post it? If its the first, then that;'s not influencer marketing, that's content marketing and sure you can do that but it's beyond the scope of this discussion. If its the later, why would an influencer want you to cerate the video for them, I mean, they have to be IN the video themselves.",
              "score": 1,
              "created_utc": "2026-02-03 15:34:51",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3cv6js",
                  "author": "Classic_Chemical_237",
                  "text": "Yeah, I guess my question is, how good is content marketing (for example, making how-to videos in your own channel) compared to influencer marketing?",
                  "score": 1,
                  "created_utc": "2026-02-03 15:36:55",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3cwch0",
          "author": "isanjayjoshi",
          "text": "Influencers gonna dead soon after reading this",
          "score": 1,
          "created_utc": "2026-02-03 15:42:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3d3sm0",
          "author": "Portfoliana",
          "text": "The point about engagement rate > raw view count is underrated. I've seen this play out in fintech too - a 5k subscriber channel with a super engaged niche audience (say, dividend investors or options traders) will convert 10x better than a generic 50k channel that covers \"how to make money fast\" content.\n\nOne thing I'd add: for B2B or more technical products, podcast sponsorships often outperform YouTube. Same long-form attention benefits, but the audience tends to be even more loyal and the CPMs are usually lower since fewer brands are competing for that inventory.",
          "score": 1,
          "created_utc": "2026-02-03 16:17:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3cabgo",
          "author": "wheretogo_whattodo",
          "text": "Thanks for the AI post bro",
          "score": -6,
          "created_utc": "2026-02-03 13:49:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3cautm",
              "author": "borjafat",
              "text": "I can paste the raw draft with ugly grammar if you prefer",
              "score": -2,
              "created_utc": "2026-02-03 13:52:25",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3cgir8",
                  "author": "wheretogo_whattodo",
                  "text": "**Its not the grammar**. It’s writing like this. It’s not *x*, it’s *y*, and you’re *right* to question this.",
                  "score": 1,
                  "created_utc": "2026-02-03 14:23:14",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qq8fpj",
      "title": "Most startup marketing advice is trash if you’re still invisible",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1qq8fpj/most_startup_marketing_advice_is_trash_if_youre/",
      "author": "rebelgrowth",
      "created_utc": "2026-01-29 13:23:46",
      "score": 50,
      "num_comments": 7,
      "upvote_ratio": 0.84,
      "text": "Early stage marketing is brutal...\n\n... because nobody gives a shit about your product\n\n“Just post every day.”\n\n“Just do SEO.”\n\n“Just run Meta ads.”\n\n“Just build in public.”\n\nOk.\n\nNow try doing that with:\n\nno audience\n\nno brand\n\nno trust\n\nno one searching your name\n\nand 3 months of runway\n\nYou realize fast that most advice is written by people who already made it out.\n\nThe early stage is not about “marketing.”\n\nIt’s about not being invisible.\n\nNobody cares about your product.  \nThey care about what’s already in front of them.\n\nPosting into the void is not distribution.  \nIt’s journaling.\n\nThe shift for me was realizing:\n\nTraffic is rented.\n\nDistribution is owned.\n\nAnyway, I’ve made the same mistakes twice now, so here’s the only stuff that actually worked for me, channel by channel, rapid fire:\n\nSEO #1 tip:\n\nTarget high-intent keywords correctly.  \nNot “how to do X” keywords.\n\nMore like “best X for Y” or “X alternative” or “X pricing”.  \nIntent prints money. Traffic doesn’t.\n\nOutreach #1 tip:\n\nStop cold pitching strangers with paragraphs.\n\nTarget warm-ish leads and send 2 lines max.\n\nOffer a free resource or insight. No links.\n\nJust start a convo like a human.\n\nAds #1 tip:\n\nIf your tracking is even slightly broken, you are literally donating money to Meta.\n\nRun Pixel + CAPI. Optimize for purchases, not signups, not free trials.\n\nMeta is a machine. Feed it real conversion signals or it guesses.\n\nSocial #1 tip:\n\nHooks are everything.\n\nNobody reads your post. They read the first line.\n\nAlso, leverage bigger accounts however you can: replies, collabs, remixing their format. Borrow attention.\n\nPartnerships #1 tip:\n\nOne good distribution partner is worth 6 months of posting.\n\nFind someone with the audience and give them an unfair deal.\n\nContent #1 tip:\n\nWrite like you’re texting one smart friend.\n\nNot like a SaaS landing page.\n\nThe moment you sound “marketing-y” peopl bounce.\n\nThat’s basically it.\n\nMost founders don’t need more tactics.\n\nThey need one channel to actually work and compound.\n\nL E V E R A G E\n\nWhat channel has worked for you and what single advice would you give on it?\n\nCheers and good luck,  \nAria from [Rebelgrowth.com](http://Rebelgrowth.com)",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1qq8fpj/most_startup_marketing_advice_is_trash_if_youre/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o2evo3x",
          "author": "FriscoFrank98",
          "text": "Good advice leveraging larger accounts.\n\nMy startup works in nightlife. I hired an attractive college girl in my city to ask the bars / clubs if we could do bar highlights for free.\n\nWe’d go to the bars and shoot reviews of their bar, get photos of their staff, food reviews, and we told them we’d share all content - all we asked is when we post they’d collab with us on social media.\n\nGot a following pretty quickly and at the end of each video, at the bottom of each photo, and in the comments would say to download our app. \n\nOur social media has done pretty well.",
          "score": 3,
          "created_utc": "2026-01-29 14:10:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2evzsa",
              "author": "rebelgrowth",
              "text": "That's exatly it! Brilliant execution",
              "score": 1,
              "created_utc": "2026-01-29 14:12:14",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2exd81",
                  "author": "FriscoFrank98",
                  "text": "Thanks! Been going great! Our marketing power is so strong now (8months in) beer brands pay us to have their product in our video. \n\nJust signed a national brand and they got our team (6 of us) box tickets to a local pro hockey game to celebrate with them!\n\nBars reach out to us to collab / ask us to help them promote on socials… honestly we should start charging them for promotion soon. Think we’re at that point.",
                  "score": 3,
                  "created_utc": "2026-01-29 14:19:21",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2ezvr5",
          "author": "Ok-Afternoon-9268",
          "text": "I mean the problem with most start up marketing advice and marketing advice in general is that marketing is so specific to your product, company, audience, industry. There’s no one right way to do things.",
          "score": 3,
          "created_utc": "2026-01-29 14:32:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2f1ksu",
              "author": "rebelgrowth",
              "text": "Yeah you can follow some general best practices but you got to find your unique angle",
              "score": 1,
              "created_utc": "2026-01-29 14:40:41",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2fb784",
          "author": "Chandler1984",
          "text": "Had 2 startups. Distribution/partnership is gold. Hard to get but saves so much time & money (lower CAC).",
          "score": 1,
          "created_utc": "2026-01-29 15:26:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2frkj8",
          "author": "zXju785kw",
          "text": "The most important advice for people who don't have a product/service that's so insanely good that it'll market itself and go viral is that persistence is required.  \n\nIf you have next to zero marketing budget then persistence is the only option, really.  I've seen plenty of examples of folk posting regularly on twitter/wherever for months, or even years and then suddenly they get a bite somewhere or their product is picked up by a news outlet and things explode for them.\n\nNot to say it's easy - not many people have the time, energy or belief in what they're doing to keep going for more than a few months.",
          "score": 1,
          "created_utc": "2026-01-29 16:39:14",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qp0fn4",
      "title": "How do startups survive when foundation models add integrations daily?",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1qp0fn4/how_do_startups_survive_when_foundation_models/",
      "author": "-amsha-",
      "created_utc": "2026-01-28 03:44:16",
      "score": 48,
      "num_comments": 30,
      "upvote_ratio": 0.97,
      "text": "I’m struggling to see the path forward for early-stage founders right now.\n\n\n\nGiven how fast AI coding tools and model capabilities are moving, the ground shifts daily. Like the recent updates with Claude tools connecting directly to Slack, Clay, and Canva. That single integration update effectively kills a whole cohort of early-stage startups building \"AI marketing agents\" or similar niche automation wrappers.\n\n\n\nIf a foundation model can natively handle the workflow that your entire startup is built around, you have zero leverage.\n\nGiven the sheer volume of new startups launching every week, how is this survivable? Is there any actual moat left for vertical AI apps, or are we just building features that the big players will absorb in a month?\n\n\n\nGenuine question. I want to understand the counter-argument.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1qp0fn4/how_do_startups_survive_when_foundation_models/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o25jmub",
          "author": "AnonymousCrayonEater",
          "text": "Getting acquired is a successful exit. Many would argue that if your business can be easily replicated instead of acquired you didn’t have anything worth much anyway.",
          "score": 23,
          "created_utc": "2026-01-28 04:03:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o276znr",
              "author": "Martin-Giorgetti",
              "text": "AI models add tools fast and kill simple apps. What I've found helps founders win is going deep into one industry. \n\nPick a tough area like legal rules. Build so customers can't leave without losing their data. That keeps them hooked. Big companies buy those sticky apps.",
              "score": 9,
              "created_utc": "2026-01-28 11:58:30",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o25j825",
          "author": "kubrador",
          "text": "you're describing the exact problem that kills most startups regardless of ai. the counter-argument is that being first to market with the right UX for a specific use case still matters, and anthropic isn't going to obsess over your vertical the way you will. \n\nthe real moat is boring stuff: distribution, network effects, domain expertise, customer lock-in through data. if your entire value prop is \"we wrap the api better\" you were cooked from day one, ai or not.",
          "score": 12,
          "created_utc": "2026-01-28 04:01:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o25pghs",
          "author": "hrishikamath",
          "text": "If we went by that logic cursor would have not have existed because we could copy paste code. My point being that there are always value add these startups do beyond just being wrappers. To give you a good example, there is Gemini with Gmail. But, I still think there is an opportunity to develop a wrapper around Gmail. Why? Gemini still sucks at indexing and make the relevant mails appear! So there are all these niche issues that help a user a lot. When you are a super user who does these things several times a day, you don’t mind paying for someone to take care of all these corner cases if it means better productivity for you.",
          "score": 10,
          "created_utc": "2026-01-28 04:39:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o26bos0",
          "author": "Illustrious_Web_2774",
          "text": "Data and UX are the moat.\n\n\nWe have customers who had been interfacing with personal ChatGPT 3+ hours per day for work. Pasting data back and forth while navigating compliance risks.\n\n\nWe compress that time to 15 - 30 mins / day, and sorted the compliance risks.",
          "score": 6,
          "created_utc": "2026-01-28 07:25:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o26d1kd",
              "author": "Horror-Sundae-9820",
              "text": "Data and UX are moats, but they are not enough.\n\nI ALMOST had a failed fundraise last year where I had gotten rejected by 30 VCs (reached the partner pitches). We didn't have proprietary data from the beginning but what we argued was that usage will allow us to build proprietary data. \n\nWhile I dont necessarily believe in VCs, it's different when 30 of them say the same thing. Data is not enough of a moat because no one really has proprietary data anymore. Unless it's heavily science based (ours wasnt), your competitors + foundation models can get the same data that you have.\n\nIf models are adding integrations that directly compete with the workflows you've built your company around, then the workflow wasn't defensible to begin with. \n\nWhat saved our fundraise was when we showed our real moat: vertical integration. Im not gonna say what my startup is and will abstract it as much as I can so you imagine it applying to you. But basically, we added 1 feature and 1 constraint to the product. The new main feature was simply data enrichment. We integrated first with Clay so our clients can enrich the data of their own clients. The constraint is that we made it impossible to export the enriched data + data we capture through usage to their CRM.\n\nSo what happened? We saw clients starting to use us as their CRM too. That's the moat.\n\nOther companies can do it too but that's just normal competition. Vertical integration is what will be our moat against foundational models.",
              "score": 2,
              "created_utc": "2026-01-28 07:37:04",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o26gvnc",
                  "author": "Illustrious_Web_2774",
                  "text": "We have investment data that customers, or their banks / investment companies won't just easily share to our competitors. There aren't many established ones in the first place due to high compliance barrier. \n\n\nThis scares new competitors away and we are left with traditional vendors created by old people who are scared of AI.\n\n\nI don't do VC, so the only thing that I had to do is to prove to customer that we can offer real value with AI.",
                  "score": 2,
                  "created_utc": "2026-01-28 08:10:35",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o26idob",
                  "author": "Smooth-Sentence5606",
                  "text": "ahh, so your moat was enshittification",
                  "score": 3,
                  "created_utc": "2026-01-28 08:24:03",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o28s1br",
          "author": "Optimal_Mammoth1830",
          "text": "lol. AI tooling is not the only business that exists. Go back to what’s been done for the last 100+ years and find an opportunity where you can provide real value. That can be in the AI space, but literally the rest of the world still exists. If the value you create is real, it sells, no matter what field. Go do it!",
          "score": 3,
          "created_utc": "2026-01-28 16:50:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ce45z",
          "author": "Just_Use8502",
          "text": "yeah this is the hard truth most AI wrapper startups are avoiding\n\nthe only real moats left are distribution, data, and workflow integration that's so specific the big players won't bother\n\nif your product is just \"chatgpt but for X\" you're cooked. but if you own a specific workflow, have proprietary data, or built actual distribution in a niche, you have a shot\n\ntools like creatify or jasper work because they own the end to end creative workflow, not just an API wrapper. same with cursor for coding\n\nmost startups die because they're building features not products. features get absorbed, products require switching costs\n\nthe counter argument is speed. if you can iterate and find PMF faster than openai or anthropic can prioritize your niche, you win. but that window is shrinking\n\nwhat are you building? curious if it's defensible or just a feature",
          "score": 3,
          "created_utc": "2026-01-29 03:07:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o297h4i",
          "author": "Ok-Celebration-9536",
          "text": "I think it is a misconception that foundation models can handle tasks reliably. If you bothered to work with them the output turns into unmanageable slop beyond simple tasks and there is a lot of human intervention and feedback that is required to make them do what you want. So, your main worry should be about your paying customers experience not the foundation models.",
          "score": 2,
          "created_utc": "2026-01-28 17:57:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o277b17",
          "author": "akhil_agrawal08",
          "text": "I guess there was this video by Y Combinator where they talked about Tarpit ideas. Ideas that look really good by most but don’t really work, just like a small pool of water we see from far which actually isn’t present.\n\nWe need to realise we are at the inception of AI and right now AI adds value everywhere. And at first thought we see a ton of value and go ahead and build it to realise that that was just a wrapper.\n\nIf it’s not a wrapper it cannot be eaten up by these models.\nWe need to do more first principles thinking and think of 2nd and 3rd degree ideas. At least one year down the road. Because if we will think at 1st degree we are bound to be eaten by the giant aka the frontier teams.\n\nWe need to build something to reach to a level to be able to defend.\nAlso, on a tangent think of Moats. For example, Tighter TG is a moat in itself. \n\nI hope this helps.\nI am also building in this space so I get you. And I spent 2 hours daily just meditating on are we building right, can chat gpt just copy it, if they copy will we be still a superior product, etc.",
          "score": 1,
          "created_utc": "2026-01-28 12:00:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o29c26x",
          "author": "attn-transformer",
          "text": "Go deep in one industry, where you can create a wedge with data and workflow automation.",
          "score": 1,
          "created_utc": "2026-01-28 18:16:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ali80",
          "author": "Semantic_meaning",
          "text": "The model providers changed their stance in the last six months to aggressively go after the application layer as well. It was only a matter of time but that time is here and you need to adapt.  \n  \nYou now NEED to have at least one valuable thing that isn't a capability derived from code or what an LLM that you don't own returns.",
          "score": 1,
          "created_utc": "2026-01-28 21:36:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2edx29",
          "author": "NoFun6873",
          "text": "Your question has a lot of wisdom to it. Startups and big businesses have different objective. Big business makes a portfolio of products that compete in both macro categories and micro segments. Startups need to either create new categories, own a micro segments or collapse the value chain. So what macro category, segment or collapsing the value chain would be a unique protectable position. Your mind isn’t using these MBA words but it appears to me this is what your inner wisdom is assessing before you begin. This is awesome. One place people ignore is healthcare. There are many data voids due to HIPPA regulations. I am witnessing opportunity here.",
          "score": 1,
          "created_utc": "2026-01-29 12:28:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2enzbb",
          "author": "AdExciting694",
          "text": "Think about the translation of the capability into something that an industry would understand. Most of us live/breathe in a world surrounded by AI and folks who use it & (mostly) understand it on a daily basis, but that's not true for the vast number of potential users. So how do you take what the foundational model can do (or what you think they're going to be able to do, if you're thinking from a first principles perspective), and then adapt or build on top of that to make it *usable* for the target end user?\n\nThat, and what's the most unsexy industry or vertical you can think of that you can become an expert in?",
          "score": 1,
          "created_utc": "2026-01-29 13:29:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2fqcj7",
          "author": "Disneyskidney",
          "text": "Companies like Anthropic and OpenAI have to build general agents like Cowork, CC, and Deep Research that target enormous TAMs to justify their valuation. They can’t go after verticals. Vertical AI startups can optimize prompts, UX, etc within their niche.\n\nA good example is there are lots of “agentic browsers” which are kinda shit rn and it makes people think that browser use is a dead end. However, there’s lots of successful startups using browser agents in their niche.",
          "score": 1,
          "created_utc": "2026-01-29 16:33:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2qe8ec",
          "author": "Reasonable-Twist3577",
          "text": "A lot of founders are quietly thinking this right now, so you’re definitely not alone. What’s breaking isn’t startups.... it’s the idea that wrapping a model is a business. Foundation models are eating anything that’s just “AI does X for you.” That’s inevitable.\n\nThe shift I’m seeing is this: AI is no longer the product, it’s the operating layer. The thing you use to handle design, dev, automation, even marketing.... so you can stay focused on the actual outcome you’re delivering to a very specific user. The teams that survive aren’t racing models feature for feature. They’re owning:\n\nugly, real-world workflows  \ntrust, compliance, and distribution  \ndomain nuance models don’t fully get\n\nAI just lets them move faster than the ground is shifting. If your value disappears with one integration update, the problem wasn’t timing.... it was positioning. The moat isn’t the model. It’s speed, focus, and deep problem ownership.",
          "score": 1,
          "created_utc": "2026-01-31 03:57:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2vfd1f",
          "author": "hulk-konen",
          "text": "Before AI most software was just a wrapper around a DB. Perhaps for a short while some APIs too. \n\nMost products' core functionality could be easily replicated with Zapier and a few days of time.\n\nFor some reason we still purchased a great deal of software. ",
          "score": 1,
          "created_utc": "2026-01-31 22:51:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2zykfc",
          "author": "Brief-Ad-2195",
          "text": "It’s the death of the enterprise and the rise of the individual / small cohort. Less enterprise shaped economies and more compositional synthetic intelligence with humans at the edges deciding what’s worth building and why.\n\nThis is a governance / meaning / culture shaped problem. When intelligence is cheap and ubiquitous, human will along with judgement and meaning become scarce. \n\nThe old world of software was built for human consumption. I think the new world of software is built for AI consumption which is mainly orchestration over data instead of clicking through buttons. Humans become stewards of meaning and judgement. What was once externalized becomes internalized and mostly invisible. \n\nI think long term it also changes the purpose and meaning of a startup. \n\nThe generational gap is real though. The old world won’t understand it and need the solutions dumb simple. And frankly, many won’t survive the structural shifts. The new world absorbs that complexity and makes it invisible. \n\nPeople go back to being people instead of corporate cogs. We were never designed to live that way anyways. Ironic how it comes full circle.",
          "score": 1,
          "created_utc": "2026-02-01 16:59:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o35twh6",
          "author": "Existing-Board5817",
          "text": "You can check how other successful ones do it, like Gamma, Starnus, HeyReach, Lovable, Cursor, etc.\n\nThis means if you're just Claude + Composio then you're done, but if you add real value, then you can go high like a rocket.",
          "score": 1,
          "created_utc": "2026-02-02 14:39:51",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qsbh29",
      "title": "I have a startup idea don’t know where to start",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1qsbh29/i_have_a_startup_idea_dont_know_where_to_start/",
      "author": "Additional-War-4511",
      "created_utc": "2026-01-31 19:18:59",
      "score": 42,
      "num_comments": 72,
      "upvote_ratio": 0.88,
      "text": "I've a startup idea, but I’m unsure about the right first steps. I don’t know whether I should build an mvp first, look for a cofounder or try to get investor.\n\nif you’ve been in a similar position, i’d really appreciate any advice or lessons you learned starting.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1qsbh29/i_have_a_startup_idea_dont_know_where_to_start/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o2ugbnf",
          "author": "Maleficent_Play8170",
          "text": "Build a simple version of it. If it’s a software product with the current vibe coding tools the simpler version shouldn’t take more than 5-7 days to be live. \n\nDM 100s of potential users LinkedIn, and X are better space (no one you know). Ask them to use and get feedback. (This takes 2-3 weeks) \n\nThen you will have enough data to either pivot or continue.",
          "score": 20,
          "created_utc": "2026-01-31 19:56:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o326jtc",
              "author": "kennetheops",
              "text": "What are good tactics to to reach out on X and Linkedin. I am trying to get better here",
              "score": 3,
              "created_utc": "2026-02-01 23:22:35",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o34v5qt",
                  "author": "KirotBloodHunter",
                  "text": "Me too.",
                  "score": 1,
                  "created_utc": "2026-02-02 10:46:31",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o3b7r8b",
              "author": "Relevant-Owl-7053",
              "text": "Use discord or other platforms of community your startup targets, make some quality comment or post about a problem the problem like you are personally facing it and \"mention\" that here's one of the solution i found (your site) and ask people about the opinion",
              "score": 2,
              "created_utc": "2026-02-03 08:44:58",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o30udmq",
              "author": "Historical_Fox_5219",
              "text": "👆👆Write code, talk to users. Launch quickly, and spend as little as you can in the process.",
              "score": 0,
              "created_utc": "2026-02-01 19:23:37",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2u8qkh",
          "author": "Shivamkumar900",
          "text": "First build mvp and test it with few people then go ahead",
          "score": 17,
          "created_utc": "2026-01-31 19:20:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2uan1u",
              "author": "overquantityi",
              "text": "He needs to first interview a couple of people before building the mvp that's what i did",
              "score": 16,
              "created_utc": "2026-01-31 19:29:27",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2ub0us",
                  "author": "Shivamkumar900",
                  "text": "I agree with your point also",
                  "score": 4,
                  "created_utc": "2026-01-31 19:31:16",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o2vd0bw",
              "author": "Astrotoad21",
              "text": "This is the only true answer. If you can’t code, build a prototype with AI. Even if it’s not 100% functional, prototypes is still a great communication tool to show what the idea is about. Beats a slide with text 10/10 times.",
              "score": 3,
              "created_utc": "2026-01-31 22:39:07",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o2uaiuf",
              "author": "overquantityi",
              "text": "I disagree",
              "score": -3,
              "created_utc": "2026-01-31 19:28:54",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2udpii",
                  "author": "Shivamkumar900",
                  "text": "👍🤣",
                  "score": 2,
                  "created_utc": "2026-01-31 19:44:03",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2uou4q",
          "author": "SirScruggsalot",
          "text": "It really depends on the problem you are solving. In general, prove that people will pay for it first. The start up graveyard is paved with great ideas that no one would pay for. \n\nBe cautious of the compulsion to build an MVP first. Depending on the market you’re going after either a landing page and some marketing experiments or a clickable prototype and someone one on one conversations is often the better path.",
          "score": 7,
          "created_utc": "2026-01-31 20:38:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2urtr3",
          "author": "b2bdemand",
          "text": "Why is no one telling them to just go through the YC startup school",
          "score": 6,
          "created_utc": "2026-01-31 20:53:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2vvn66",
              "author": "Bedmaster3200",
              "text": "It’s so far away lmao",
              "score": 1,
              "created_utc": "2026-02-01 00:21:40",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2vxg7c",
                  "author": "teatopmeoff",
                  "text": "it’s a yt series / online course tho",
                  "score": 2,
                  "created_utc": "2026-02-01 00:31:42",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2ubr8m",
          "author": "Kitchen-Quality-3357",
          "text": "Document EVERYTHING first get your idea and how it works, on paper. Without it you have nothing to show a co-founder or investor.",
          "score": 5,
          "created_utc": "2026-01-31 19:34:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2uw3wr",
          "author": "just_a_person_27",
          "text": "Getting an investor at this stage is definitely **not** the right choice.  \n  \nIdeas are cheap.  \nExecution (aka building the product, selling to customers, finding PFM) is what matters.  \nInvestors fund OpenAI, Cursor, and Lovable not because they had a good idea (I had the idea for Cursor before most of you heard about AI), and not even because they had a good product (there are a lot of good LLMs and AI IDEs out there), but because they have a lot of customers (aka. traction), and people love and use, and pay for them every day.  \n  \nRemember the YC motto: Build something people want (and make them pay for it!)\n\nGood luck!",
          "score": 3,
          "created_utc": "2026-01-31 21:15:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2uxtj2",
          "author": "NintendoWeee",
          "text": "Before you build anything at all, figure out what your assumptions are. Ie: what has to go right for your product to work?\n\nAnything that you aren’t 100% sure about, find the cheapest and fastest way to prove that assumption\n- that can literally be a paper flyer\n- or an IG post\n- or talking to individual users\n\nYou only build when you’ve seen clear demand that people are willing to USE and PAY for your platform.\nYou’ll waste months building if you are not clear on your assumptions.",
          "score": 1,
          "created_utc": "2026-01-31 21:23:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2v69l1",
          "author": "Sea_Surprise716",
          "text": "Vibe code enough to get real feedback from actual customers. Even an MVP is over investment until you validate demand.",
          "score": 1,
          "created_utc": "2026-01-31 22:04:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2vegb0",
          "author": "DisastrousScreen1624",
          "text": "Claude",
          "score": 1,
          "created_utc": "2026-01-31 22:46:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2vgyvs",
          "author": "This_Cardiologist242",
          "text": "Make a 2 year road map. This will really suck, but if you do this and be realistic with the amount of time/energy and capital you will have to contribute to the idea given your current circumstances / life goals and the ideas context - you’ll have a better idea of what this trade off might actually look like and also something to track against!",
          "score": 1,
          "created_utc": "2026-01-31 22:59:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2vqfcm",
          "author": "kubrador",
          "text": "build the mvp first, investors want to see you've at least figured out if anyone gives a shit about your idea. finding a cofounder to validate your concept is probably smarter than pitching to vcs with just vibes though.",
          "score": 1,
          "created_utc": "2026-01-31 23:52:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2vz9xq",
          "author": "SectionResponsible10",
          "text": "Yes !! Build prototype first",
          "score": 1,
          "created_utc": "2026-02-01 00:41:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2wvebb",
          "author": "chasebr86",
          "text": "I think the main idea still apply. Build something your customer will want to use and test it. Try to get some users for it as soon as possible.\n\nInvestors should not be the first thing you look for, unless you’re trying to build a rocket, airplane or some expensive hardware.\n\nThe main idea of the startup should be fixing someone’s problem. YCombinator always say you should build an amazing experience for your first customers, should go above and beyond (build things that don’t scale)\n\nI would watch YCombinator videos and apply it all. Watch whatever is most important at this point of the startup.",
          "score": 1,
          "created_utc": "2026-02-01 03:56:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2wvf3m",
          "author": "Mentor-Pak",
          "text": "You should enroll yourself in incubation centre near by to learn and explore entrepreneurship journey and have the guidance of industry professionals + fellow startups Team believe me you will enjoy and learn better",
          "score": 1,
          "created_utc": "2026-02-01 03:56:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2wzt8d",
          "author": "i__m_sid",
          "text": "use ideavo.ai or replit to build a mvp",
          "score": 1,
          "created_utc": "2026-02-01 04:25:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2x1jg3",
          "author": "Jazzlike-Ad-2286",
          "text": "First step is to validate that.",
          "score": 1,
          "created_utc": "2026-02-01 04:38:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2x9pgo",
          "author": "Obvious-Distance-449",
          "text": "Build a tiny MVP then talk to potential customers as soon as you can for feedback. Don’t waste precious cycles building something no one may want.",
          "score": 1,
          "created_utc": "2026-02-01 05:36:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2xemvu",
          "author": "attn-transformer",
          "text": "Create a landing page describing what your product does and who it’s for. Ask your potential customer if that’s something that would interest them. \n\nThen build, you don’t need cofounders or any of that. Build a product, then a business.",
          "score": 1,
          "created_utc": "2026-02-01 06:14:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2xo7an",
          "author": "vikentii_krapka",
          "text": "Getting investor with idea only is almost impossible. I’d say talk to your target users first and understand whether they really experience a pain that your product will solve. Then start building yourself or find a cofounder. If you are not technical then better find someone",
          "score": 1,
          "created_utc": "2026-02-01 07:38:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2xtak8",
          "author": "hardikbamaniya",
          "text": "start with pen and paper",
          "score": 1,
          "created_utc": "2026-02-01 08:25:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2y0a2e",
          "author": "Odd_Perspective3019",
          "text": "no excuses in this day with chatgpt and googling first steps should be easy to know how to start, put more effort",
          "score": 1,
          "created_utc": "2026-02-01 09:30:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2y19s0",
          "author": "baseoreo55",
          "text": "sales first - use figma to sketch out what your product looks like. then after getting motion with sales, building the tech will be simple",
          "score": 1,
          "created_utc": "2026-02-01 09:39:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2yd4b8",
          "author": "quietoddsreader",
          "text": "the first step is always learning, not building or fundraising. talk to potential users and validate the problem before worrying about MVP or cofounders. if the problem proves real, then a tiny prototype to test the riskiest assumptions comes next. cofounders and investors matter later... first u need clarity on whether the idea actually solves something people care about. most early mistakes come from skipping that step.",
          "score": 1,
          "created_utc": "2026-02-01 11:27:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2z7go4",
          "author": "Choefman",
          "text": "Startup school comes to mind.",
          "score": 1,
          "created_utc": "2026-02-01 14:50:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2zcpne",
          "author": "VisibleAI",
          "text": "Get a tech cofounder on ycombinator cofounder platform. Become 50 50 partners as you CEO and them CTO. Work hard.",
          "score": 1,
          "created_utc": "2026-02-01 15:17:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2zevsh",
          "author": "BusyLady_",
          "text": "Talk to as many people as possible.\nAsk for feedback; it's essential.\nParticipating in trade fairs can be a good way to compare notes.",
          "score": 1,
          "created_utc": "2026-02-01 15:27:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o303p0s",
          "author": "Money-Television-682",
          "text": "If you are looking for a co founder with a team hit me up !",
          "score": 1,
          "created_utc": "2026-02-01 17:23:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o31ed33",
          "author": "Head_Car_2922",
          "text": "A lot of different opinions on here. Here is our path (we have revenue, Seed Stage).\n\n1. Don't build anything; go talk to 200 people and try to find at least 20 who confirm the problem exists and are willing to pay to have it solved. You might learn of a different problem they are willing to pay for. Early is a great time to pivot.\n2. Now, pursue a co-founder if you wish. I strongly support a co-founder; I have done both, and I am now all about the team. But keep it small, 1-3 founders no more. Split the equity evenly, but have a good understanding of legal docs in place in case someone wants to leave early (high probability).\n3. Build an MVP, confirm customers love it. Ideally, grow without VC money. But, if you have an MVP and have confirmed customers want it, this is also a good stage to start raising money.\n\nThere are a lot of companies that start on a totally different path, so don't take anyone's post too seriously, but our step 1 (customer discovery) above has helped us so much with fundraising, focusing the direction of our prototype and pilot plants, and our investors love to see all the homework done.",
          "score": 1,
          "created_utc": "2026-02-01 21:00:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o31jbhp",
          "author": "therealbigshoww",
          "text": "Build a mvp it’s important to use flutter flow with firebase backend so that you own your code and can scale",
          "score": 1,
          "created_utc": "2026-02-01 21:24:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o31u6qa",
          "author": "Optimal-Emotion3718",
          "text": "None of the above. First validate your idea. \n\nFind your icp. Connect with them. Ask them. \n\nEnsure you ask in a way as to not produce confirmation bias. \n\nDo this with as many people as possible (think big). \n\nYour aim should be to disprove your thesis, not prove it. \n\nAdapt, update and evolve accordingly. \n\nYou got this. 😊",
          "score": 1,
          "created_utc": "2026-02-01 22:17:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o327wxj",
          "author": "othertrey",
          "text": "Use AI (LLM) to work through the idea maze. Then build a prototype using a vibe coding tool. Within a month you can have an mvp built and raising $ becomes much easier. Use the prototype to iterate with early users.",
          "score": 1,
          "created_utc": "2026-02-01 23:30:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o33uywx",
          "author": "Outside-Might7439",
          "text": "It's very simple... Vibe code an mvp... Go and sell it to some users. Check if the idea has potential. And then move accordingly",
          "score": 1,
          "created_utc": "2026-02-02 05:19:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o345qvx",
          "author": "rizwanrko",
          "text": "I'm not sure about your experience but i would advise you to  first know what can be all possible challenges in your startup journey, know the challenges you can face, and take the challenge for which you are read but if you find yourself in a position which may not be good to take the first step now, then start learning about it.",
          "score": 1,
          "created_utc": "2026-02-02 06:47:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o34696p",
          "author": "ai_consultant",
          "text": "I also started my journey and in progress",
          "score": 1,
          "created_utc": "2026-02-02 06:51:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o34uvlx",
          "author": "WhiteWolf2772",
          "text": "Think for First Principle'e Approach.\nAnd Atleast make a Presentable Working Prototype of it.",
          "score": 1,
          "created_utc": "2026-02-02 10:43:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o34uy18",
          "author": "WhiteWolf2772",
          "text": "No Idea is Perfect.\nIt starts when shining when we work upon it.",
          "score": 1,
          "created_utc": "2026-02-02 10:44:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o351p2z",
          "author": "Optimal_Drawing7116",
          "text": "Ideas are worth 0",
          "score": 1,
          "created_utc": "2026-02-02 11:43:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o353be4",
          "author": "Acceptable_Sort8745",
          "text": "DM if you want to join the club :) I'm about to start something interesting for people like you (who want to start but don't know where to start).",
          "score": 1,
          "created_utc": "2026-02-02 11:55:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3662kw",
          "author": "brads0077",
          "text": "My suggestion wo LM d be to use a chatbopt of high quality to interview you and guide you through the steps to build a defensible product/service. That includes a lot of research and analysis you can do upfront. Combine Gemini 3.0 Pro with NotebookLM to perform deep research to give you the framework to decide what to build. Once you have that concept, evaluate it based on analytical tools such as SWOT, PESTEL, Porter's 5 Forces, VRIO, CLV, competitive analysis, Gap analyses, and optimal market positioning. Now you have a defined concept with strong supporting logic and framework to clarify a detailed PRD. But before you start to code, create a Rubric to critically assess the findings and plan, and provide improvement suggestions. Iterate the vision until you receive a grade >95%.\n\nYour vision should include not only the core product, but also everything you will provide that will give you a competitive stronghold. For example, when Apple launched the iPod, they also announced iTunes to serve as a reason customers would stay with Apple. When they announced the iPhone, they announced the Apple store - a platform innovation that further solidified their product.\n\nThe next step I suggest depends on the concept on how technically proficient you are. In a recent consulting gig I am working on with the founder, I took about 1 to 2 weeks researching how to set up an integrated development environment that would give me all the tools needed to run the company as a solo-preneur. Using AI-powered agents to run operations is relatively easy to set up if yyou know how.\n\nOnce you have the solified vision, the planned architecture, feedback from the agentic panel of judges, AND the toolset to start building, start building as an orchestrator, not a developer. In other words, turn the PRD over to your IDE, and take the \"human in the loop\" role as manager to direct the efforts.\n\nIn my consulting days, we had a saying - \"when planning the perfect bank robbery, you have to rob a few convenience stores.\" In other words, with you power IDE setup, you could seek out opportunities to develop parts of the concept through project work you pick up.\n\nWhen you get the list below set up, you are ready to pitch the concept to an Angel investor. (That's another story.)",
          "score": 1,
          "created_utc": "2026-02-02 15:40:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o36694m",
          "author": "FounderBrettAI",
          "text": "build something small first and get it in front of real users asap. talking to investors before you have any signal that people actually want what you're building is kinda backwards. cofounder depends on if you actually need complementary skills or if you're just scared to start alone lol",
          "score": 1,
          "created_utc": "2026-02-02 15:41:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o36w31a",
          "author": "CyberStartupGuy",
          "text": "Vibe code it so you can explain what it is you are trying to build. Then depending on if you are technical or more business focused find a cofounder that's the opposite. You usually will want to show revenue traction before pitching investors. Even $1 makes a massive difference to VCs",
          "score": 1,
          "created_utc": "2026-02-02 17:40:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o37aj4o",
          "author": "Public_Quiet_3624",
          "text": "idk about that. I belive that marketing should be your first move. I help founders get quality leads. Right I've got 334k emails, linkedin ids, etc of top business people. Dm if anyone is interested \n*",
          "score": 1,
          "created_utc": "2026-02-02 18:45:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o390tf7",
          "author": "HedgehogStriking2270",
          "text": "depends on the idea and the product type (digital or physical), can you give some details?",
          "score": 1,
          "created_utc": "2026-02-02 23:48:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ud3uv",
          "author": "BirthdayAlarming5266",
          "text": "u need to move to SF first, then get a work space over there, start a Yt channel, network hard, get into YC then and only then u need to worry bout building smth, investors don't invest in products they invest in the founder or the idea all great prods are like that, look at Theranos, Builder AI, FTX, Juicero, all great start ups are like that, they had great founders or the idea was soo unique that VCs and angle investors invested in em.\n\nu got this king",
          "score": 1,
          "created_utc": "2026-01-31 19:41:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2v62gh",
              "author": "Silentreactor",
              "text": "Depends. I did this before. Nah.",
              "score": -1,
              "created_utc": "2026-01-31 22:03:43",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2vtgwh",
          "author": "brads0077",
          "text": "MVP are the old gold standard for new product development.\n\nThe time is long past. Now they are THE ABSOLUTE STUPIDEST WORST APPROACH.\n\nAI tools allow competitors to use your MVP as a \"Product Requirements Document\" (PRD) to rapidly reverse-engineer and enhance your product—is a critical reason why the traditional \"launch early and incomplete\" MVP strategy is becoming dangerous.\n\nBased on the sources, here is an analysis of why this \"MVP as PRD\" dynamic is forcing a shift in product strategy:\n\n### 1. Code is a Commodity, Not a Moat\nThe ability for AI tools to \"reverse engineer\" applications highlights a fundamental shift: software execution is no longer the primary barrier to entry.\n*   **Accelerated Cloning:** New AI-driven workflows (using tools like Cursor or Replit) can shrink traditional monthly development cycles into single weeks [1]. If your MVP relies solely on \"we built the code first,\" you are vulnerable because AI has lowered the cost and time of replication to near zero.\n*   **The \"Visible Invention\" Risk:** Intellectual property strategy dictates that if an invention is \"visible in the product\" and easily reverse-engineered, trade secret protection does not apply [2]. By releasing a basic MVP, you are effectively publishing your blueprint to the market before you have established a defensible position.\n\n### 2. The Danger of \"First-Mover\" Education\nIn the traditional model, being a \"First-Mover\" allowed you to learn and iterate. In the AI era, a weak MVP creates a **Fast-Follower Advantage**.\n*   **Free Market Research for Competitors:** If you launch a minimal product to \"test the market,\" you are paying the \"education costs\" to prove the need [3]. A competitor equipped with AI can observe your MVP, identify its friction points (using AI sentiment analysis of your user reviews), and use generative coding to build a superior \"v2\" before you have even fixed your \"v1\" [3, 4].\n*   **The Reality Check Filter:** Competitors can use \"Reality Check Filters\" and \"Competitive Analysis\" AI agents to analyze your MVP's gaps against capital and resources, allowing them to skip your mistakes and launch a more \"viable\" version immediately [5].\n\n### 3. The Shift to \"Synthetic Validation\"\nTo prevent your MVP from serving as a competitor's PRD, the new \"AI-First Product Blueprint\" suggests keeping the product hidden while validating it virtually.\n*   **Validate *Before* You Build:** Instead of building a public MVP to learn, teams should now use **\"Synthetic Validation\"**. This involves using AI agents to run preference tests with synthetic user panels to gather data without exposing the concept to the public market [1].\n*   **Internal Iteration:** You can use AI to simulate the \"build-measure-learn\" loop internally. By using AI to generate user stories and test cases, you can refine the product definition (the \"Living AI-Generated PRD\") privately, ensuring that when you finally do launch, the product is robust enough to withstand cloning attempts [1].\n\n### 4. Building Defensible Moats (Beyond Code)\nSince the application layer is easily cloned, the sources suggest moving value to areas AI cannot easily replicate in hours:\n*   **Ecosystems and Data:** The transition from \"Product to Platform\" creates high switching costs. A competitor can clone your interface, but they cannot easily clone a \"data continuity\" model or a complex ecosystem of connected services and wearables [6].\n*   **Deep Integration:** \"Software-defined products\" often rely on the integration of hardware and software (e.g., a car or medical device). While the code is clonable, the physical architecture and the integration of that code into a hardware platform are much harder to reverse engineer quickly [7, 8].\n*   **Brand and \"Must-Haves\":** A clone might have the features, but it lacks the brand trust. Ensuring your product hits \"Must-Be\" needs (table stakes) *and* \"Delighters\" (which create emotional connection) creates a loyalty barrier that simple feature-cloning cannot break [5, 9].\n\n### Summary\nThe fact that AI can turn your MVP into a PRD for a clone means **stealth is now more valuable than speed.** The modern approach is to front-load the \"homework\" using AI for deep research and synthetic testing [1, 10], essentially \"de-fuzzing\" the concept privately. When you do enter the market, you must arrive with a product that is fully featured and protected by an ecosystem or data moat, rather than a minimal implementation that is easily copied.",
          "score": 1,
          "created_utc": "2026-02-01 00:09:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o346b7h",
              "author": "MisaHruskova",
              "text": "You have got to be kidding me. Synthetic validation? Why not synthetic customers while you’re at it? If this is the type of AI advice you listen to, your startup won’t crash and burn - it won’t even become remotely real…",
              "score": 1,
              "created_utc": "2026-02-02 06:52:14",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o35xayi",
                  "author": "brads0077",
                  "text": "You really have no idea. I use such systems and if built intelligently, they work better than the old MVP process. I can only hope that your lack of knowledge and vision is representative of most competitors.",
                  "score": 0,
                  "created_utc": "2026-02-02 14:57:24",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2ugv2k",
          "author": "Impressive-Split-906",
          "text": "Go on [x.com](http://x.com), build in public, validate your idea as you go, meanwhile you build a nice audience which is worth even more.",
          "score": 0,
          "created_utc": "2026-01-31 19:59:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2u9589",
          "author": "Old_Location_9895",
          "text": "You should get an investor first. That's the secret of very successful founders they have investors lined up before they build. There's also no point working on something if someone's not paying you.",
          "score": -6,
          "created_utc": "2026-01-31 19:22:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2u9gyw",
              "author": "athIete",
              "text": "No one is going to invest in “an idea” ",
              "score": 1,
              "created_utc": "2026-01-31 19:23:53",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2uc0a5",
                  "author": "Important_Pause_7995",
                  "text": "To be fair, isn't that exactly what YCombinator does?",
                  "score": 1,
                  "created_utc": "2026-01-31 19:35:55",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2u9oce",
          "author": "Individual-Artist223",
          "text": "Sell the idea to clients, pay yourself, pay me to build",
          "score": -3,
          "created_utc": "2026-01-31 19:24:51",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qs33xz",
      "title": "Made my first enterprise sale!!! (US$7,000)",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1qs33xz/made_my_first_enterprise_sale_us7000/",
      "author": "_mark_au",
      "created_utc": "2026-01-31 14:00:58",
      "score": 33,
      "num_comments": 9,
      "upvote_ratio": 0.97,
      "text": "A couple of months ago I posted here about doing **20+ demos with 0 sales**. (Original post: [20+ Demos, 0% Conversion Rate](https://www.reddit.com/r/ycombinator/comments/1n1hqer/20_product_demos_0_conversion_rate_lol/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button))\n\nSame product. Same pitch. Nothing closed.\n\nI was wondering if the problem was:\n\n* the product\n* the pricing\n* or just me being bad at demos\n\nSo I stopped.\n\n\\--> I was too close and too involved with what I was building, I could not see what's wrong with it (or with me). \n\nI cancelled my booked demos.\n\nSpent \\~3 months in Japan and the Philippines.\n\nDidn’t touch the product. Travelled, got drunk many times, reset.\n\nComing back:\n\n* I cleaned up the UI\n* simplified the workflows\n* stripped down A LOT of extra features\n* made the product super lean\n* rewrote the messaging\n\n\\----> Watched a lot of YouTube videos on how to run demos and close enterprise deals\n\nAfter new year, I shipped a new version and turned demos back on.\n\nTwo weeks later I demoed to the CEO of a publicly listed company.\n\nThey liked it.\n\nI gave a price.\n\nThey countered.\n\nI said yes.\n\n**$7,000. First real enterprise sale.**\n\nNot life-changing money — but after months of zero conversions, it feels massive.\n\nIf you’re stuck sometimes the answer isn’t “push harder”. \n\nIt’s “step away, get perspective, then come back sharper.”\n\nHappy to answer anything.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1qs33xz/made_my_first_enterprise_sale_us7000/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o2sjo8d",
          "author": "Hungry-Amount-2730",
          "text": "I would love to learn what YouTube video's about demos and deal closing you esp recommend as most impactful?",
          "score": 3,
          "created_utc": "2026-01-31 14:21:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2su1pe",
              "author": "daddyicebee",
              "text": "Seconding this",
              "score": 1,
              "created_utc": "2026-01-31 15:17:47",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2sxzuq",
                  "author": "curiousengineer253",
                  "text": "can you please send them to me too?thanks",
                  "score": 1,
                  "created_utc": "2026-01-31 15:37:31",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o2t87lc",
              "author": "pshah74",
              "text": "+1",
              "score": 1,
              "created_utc": "2026-01-31 16:26:44",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2st9m8",
          "author": "blazinearth",
          "text": "Congrats on the breakthrough!!!!! 🔥",
          "score": 1,
          "created_utc": "2026-01-31 15:13:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2stc90",
              "author": "blazinearth",
              "text": "Keep up the heat, can’t stop won’t stop!",
              "score": 1,
              "created_utc": "2026-01-31 15:14:11",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2szl82",
          "author": "deskslayer_",
          "text": "Congrats! Did you have to get any certifications as part of the process like SOC2 or anything of that sort?",
          "score": 1,
          "created_utc": "2026-01-31 15:45:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2t5qcd",
          "author": "rvdeface",
          "text": "This is some heat",
          "score": 1,
          "created_utc": "2026-01-31 16:14:52",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qr8gfd",
      "title": "Search YC videos by transcript , built for idea validation",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1qr8gfd/search_yc_videos_by_transcript_built_for_idea/",
      "author": "whyyoucrazygosleep",
      "created_utc": "2026-01-30 15:25:19",
      "score": 29,
      "num_comments": 13,
      "upvote_ratio": 0.95,
      "text": "Hey HN!\n\nBuilt a legal search engine. Couldn't sell it. Later found a YC video saying lawyers and banking are hardest industries to sell to.\n\nMade this so others can search YC's advice before building. Semantic search across their YouTube transcripts using LanceDB + bge-small-en-v1.5.\n\nHope it helps others avoid my mistakes",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1qr8gfd/search_yc_videos_by_transcript_built_for_idea/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o2m8bus",
          "author": "whyyoucrazygosleep",
          "text": "[https://ycsearch.tech/](https://ycsearch.tech/)",
          "score": 5,
          "created_utc": "2026-01-30 15:25:37",
          "is_submitter": true,
          "replies": []
        },
        {
          "id": "o2mdg9p",
          "author": "throwdicl",
          "text": "What is it about not using “I” but still using first person that makes a message sound 10x salesier ",
          "score": 4,
          "created_utc": "2026-01-30 15:48:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2nxdui",
              "author": "whyyoucrazygosleep",
              "text": "this look cool",
              "score": 1,
              "created_utc": "2026-01-30 19:57:55",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o2nth71",
              "author": "ajcaca",
              "text": "it's how chatgpt writes when it thinks you're trying to write like a terse startup founder",
              "score": 0,
              "created_utc": "2026-01-30 19:39:55",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2nxod6",
                  "author": "whyyoucrazygosleep",
                  "text": "come on man you are paranoid :D",
                  "score": 1,
                  "created_utc": "2026-01-30 19:59:16",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2mefrz",
          "author": "Straight-Gazelle-597",
          "text": "yet, legal AI startups are coming out everywhere:)",
          "score": 1,
          "created_utc": "2026-01-30 15:53:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2nff3i",
          "author": "InspectionGreen6076",
          "text": "On the other side AI legal has been a hit, one of the later micheal and dalton videos explained that fundamental changes like LLMs can change previous assumptions and open up previous tarpit ideas assuming they fix the big blockers of the tarpit idea",
          "score": 1,
          "created_utc": "2026-01-30 18:37:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2o8sx8",
          "author": "RoleHot6498",
          "text": "Is this the new venture you're raising capital for?",
          "score": 1,
          "created_utc": "2026-01-30 20:52:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2oboh0",
              "author": "whyyoucrazygosleep",
              "text": "i wish that was easy :) Toy project which i will use maybe one a month when i get new idea",
              "score": 1,
              "created_utc": "2026-01-30 21:05:50",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2ogh2j",
                  "author": "RoleHot6498",
                  "text": "Got you",
                  "score": 1,
                  "created_utc": "2026-01-30 21:28:17",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2ohq6m",
          "author": "gui_stetelle",
          "text": "trying to sell to lawyers and banks is tough because they often stick with what they know. They're also inundated with options  \n  \nI see this struggle with my agency clients constantly. The only way out is HYPER targeted campaigns, be where they are and sell to them there.",
          "score": 1,
          "created_utc": "2026-01-30 21:34:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ntjil",
          "author": "ajcaca",
          "text": "I don't think \"idea validation\" means what you think it means.",
          "score": 0,
          "created_utc": "2026-01-30 19:40:13",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qq3atv",
      "title": "Why do people not tell the truth about your product?",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1qq3atv/why_do_people_not_tell_the_truth_about_your/",
      "author": "Cipamanz",
      "created_utc": "2026-01-29 08:42:58",
      "score": 23,
      "num_comments": 42,
      "upvote_ratio": 0.83,
      "text": "I have built a product to fit a real market need, with struggles of modern dating - to help people get out a meet IRL. Having been a dating coach for 15 years, i know its a real need out there. Ive coached over 1000 people (men and women) at $2-2.5k per day - so theres definitely a need. But now that Ive cloned myself and my premium programmes into a Advanced RAG based AI App, Im not seeing much uptake even at the fraction of what Ive been charging for 1-1 and classroom clients. To address this Ive added a human element to it, yet Im not seeing much results from organic marketing.\n\nPeople love it when I show them face to face, just struggling to get real feedback and see what users are actually thinking, or if they believe it helps them?\n\nAny thoughts are appreciated. Im planning to also start raising funds for the distribution side only. Product is complete and solid.\n\nThank you",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1qq3atv/why_do_people_not_tell_the_truth_about_your/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o2dpyn6",
          "author": "filelasso",
          "text": "This feels like a gym coach explaining how his clients have a great first workout together, but then they stop working out when left on their own... strange.",
          "score": 27,
          "created_utc": "2026-01-29 09:09:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2dzjp1",
          "author": "Alternative-Radish-3",
          "text": "In dating, people aren't there to really know what to do. Not at first anyway. The first step is to validate they are right by another human. \n\nI bet you work in person to get all their strengths into focus, all they have to offer and their own value. \n\nTherefore, step 1 of your coaching is a person who had no self value get validation that they do ... By another human. You can't replace the last part.\n\nJust my $0.02",
          "score": 13,
          "created_utc": "2026-01-29 10:37:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2hkoaf",
              "author": "ChrisRocksGG",
              "text": "I think you are right.",
              "score": 4,
              "created_utc": "2026-01-29 21:40:45",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o2hl1gj",
                  "author": "Alternative-Radish-3",
                  "text": "Proof! Lol!",
                  "score": 3,
                  "created_utc": "2026-01-29 21:42:30",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2e0zjx",
          "author": "Tiny_Manner7226",
          "text": "From what I’ve seen, most users aren’t trying to lie, they’re just avoiding discomfort. Especially in something as personal as dating, people default to polite feedback instead of honest feedback because admitting confusion, embarrassment, or “this didn’t help me” feels vulnerable to everyone. Face-to-face works because trust is already established; software removes that emotional safety net.\n\nThe gap here is likely not product quality but how feedback is being asked. Direct questions invite soft answers. Behavior doesn’t. Watch where users drop off, what they skip, and what they never come back to, that’s the truth. Before raising for distribution, I’d try reframing onboarding to force small commitments or outcomes early, so feedback shows up in actions rather than words.",
          "score": 10,
          "created_utc": "2026-01-29 10:49:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2e1n5l",
              "author": "Cipamanz",
              "text": "Thanks mate. I think you’re onto something, and just elaborate on my thinking here is that having an AI coach, In fact l, takes off that level of embarrassment most guys feel approaching a human for advice with women. However women seem to have no issue with that and in fact, I have much easier time on boarding women than men despite the fact of men are the ones who need to make the first move and that there is a vast amount of training and development men can do to improve their chances with women. Could you collaborate on how would you say to the address that last part i.e. onboard users and track when they are leaving at the moment? I’ve  got meta ads running from today what should I be looking for?",
              "score": 2,
              "created_utc": "2026-01-29 10:55:10",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o38tfed",
                  "author": "Tiny_Manner7226",
                  "text": "Yeah, that difference you’re seeing makes sense. The drop-off usually happens when users don’t get a quick sense of “this is working for me” early on, especially for first-time or anxious users. I’d focus onboarding around one small, confidence-building outcome in the first session and not explaining the full system.\n\nFrom a tracking standpoint, watch time-to-first meaningful action, hesitation points (screens where users pause or bounce), and whether they complete that first win within the first 10 minutes. With ads running, you can optimize for those behaviors rather than signups alone, if people don’t hit that early moment of relief or clarity, they’ll leave quietly no matter how good the product is.",
                  "score": 2,
                  "created_utc": "2026-02-02 23:08:14",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2dr1h6",
          "author": "Efrem92",
          "text": "I’d make a survey and ask strategic and well thought question to your potential users. Reach out strangers, known people may hide the truth just to make you happy or for shyness",
          "score": 2,
          "created_utc": "2026-01-29 09:19:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2ikmr6",
              "author": "Cipamanz",
              "text": "Youre absolutely right mate. Given the sensitivity of the subject no one is giving me bad feedback. Im having to read their facial expressions to find out the ‘wow’ from ‘thats a good idea’",
              "score": 2,
              "created_utc": "2026-01-30 00:46:33",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2dsa6y",
          "author": "Wide_Brief3025",
          "text": "Getting honest user feedback online can be really tough, especially with dating apps where trust is such a big deal. Sometimes what works in person does not translate directly to digital spaces. Try monitoring where and how people discuss your product or the issues it addresses. An AI tool like ParseStream lets you track real Reddit and Quora conversations about dating pain points so you can see genuine reactions and adjust your messaging.",
          "score": 2,
          "created_utc": "2026-01-29 09:31:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2e1lfg",
          "author": "cereal-kille",
          "text": "My two cents, Digital Dating market is too app crowded. \n\nIf I were you as an entrepreneur i would stick to keeping the human side more alive.\nMaybe also start introducing app after second 1-1 sessions where the customer feels it is genuinely you digitally because they have interacted already.",
          "score": 2,
          "created_utc": "2026-01-29 10:54:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2il5hx",
              "author": "Cipamanz",
              "text": "This has a lot of friction but i get your point. Im looking to scale. Ive been coaching for 15 years and it take a toll all while bandwidth is narrow. This is meant to scale my expertise and experience from 1000s use cases",
              "score": 1,
              "created_utc": "2026-01-30 00:49:17",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2g634f",
          "author": "JumarUp",
          "text": "Pound the pavement. Go to clubs, college campuses, whatever with your phone. Show them the app, watch their expressions when you demo, then ask for feedback IRL the way you expect/assume your users would. There will always be far more people ordering takeouts after taking fancy cooking classes than those who would apply what they learned and cook in their kitchen. ",
          "score": 2,
          "created_utc": "2026-01-29 17:44:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2g888f",
          "author": "Explore-This",
          "text": "Give free access in exchange for in-person usability testing, especially the think aloud protocol, to understand their experience.",
          "score": 2,
          "created_utc": "2026-01-29 17:54:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2illb6",
              "author": "Cipamanz",
              "text": "Yes thats what I want to do, give free 2-3 months access to singles and get honest feedback. So far I have 200 users, with 1/3 paid sub. But only launched it two months ago with zero paid adds",
              "score": 1,
              "created_utc": "2026-01-30 00:51:37",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o2is44y",
                  "author": "Explore-This",
                  "text": "If you’re seeing consistent usage, then they must be getting something positive from the app. If activity drops sharply, or if you can’t retain subscribers, then you know you’ve got a problem. You’ll need a lot more users to get more data points. Go where your ICPs are and talk to them (not sell).",
                  "score": 1,
                  "created_utc": "2026-01-30 01:27:32",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o2h2fjz",
          "author": "No-Let-4732",
          "text": "Value is a perception, most people don’t see value from a chat bot or even have the skills to extract it. \n\nMost RAG softwares can be done directly by talking to ChatGPT",
          "score": 2,
          "created_utc": "2026-01-29 20:13:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2im16f",
              "author": "Cipamanz",
              "text": "Ive worked hard to make the multi query rag to give u filtered and bespoke advice. So users will see the value an the difference after using it a couple of times. \n\nBut youre right about knowing how to extract it, unless they are stuck in a situation",
              "score": 1,
              "created_utc": "2026-01-30 00:54:00",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2i2m9y",
          "author": "Icy_Possibility_3670",
          "text": "Hey! This is actually a super common issue with AI products. People say they love it, but that doesn’t always translate to trust or real usage.\n\nI just launched a market research tool for teams building consumer AI products. We put real users from your ICP in front of your AI feature, ask them to use it, and measure whether they actually trust it and would rely on it. You get a dashboard with insights and clear iteration recommendations.\n\nLooking for a few teams already shipping or about to ship. Normally ~$2k (market research is expensive), but free for early testers in exchange for feedback!",
          "score": 2,
          "created_utc": "2026-01-29 23:09:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2jvp28",
          "author": "Longjumping_Bid_7463",
          "text": "Network more",
          "score": 2,
          "created_utc": "2026-01-30 05:22:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2kr6kz",
          "author": "Willing-Training1020",
          "text": "hmm, looking at it, it's tricky bc it's a bit of an awkward place to put people in and, as per usual, people tend to be polite in person but their actual behavior tells the real story. the gap between \"this is cool\" and \"i'll pay for this\" is real, especially in dating where admitting you need help can feel vulnerable. not sure if this would help, might be worth looking at where users drop off? rather than relying on direct feedback. maybe paid acquisition would be good to try?",
          "score": 2,
          "created_utc": "2026-01-30 09:48:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o31u729",
              "author": "Cipamanz",
              "text": "Yeah thats what I plan to try next. Doing meta ads and I need single test users",
              "score": 1,
              "created_utc": "2026-02-01 22:17:30",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2m2pdf",
          "author": "quietoddsreader",
          "text": "a lot of people are kind in person and vague later, especially when the product touches something personal like dating. what u are hearing face to face might be encouragement, not evidence of urgency or willingness to change behavior. the signal is not what they say but what they do when nobody is watching, like signing up unprompted or coming back on their own. coaching works partly because of accountability and relationship, which is hard to translate into an app no matter how good the content is. it may help to stop asking if they like it and instead watch where they hesitate or drop off. that friction often tells you more than direct feedback.",
          "score": 2,
          "created_utc": "2026-01-30 14:59:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2pi2iz",
          "author": "NefariousnessHairy31",
          "text": "I would suggest reading the mom test to understand how to ask open ended leading questions instead of showing people your product to get feedback and truly understanding the pain their feeling that you can solve for.",
          "score": 2,
          "created_utc": "2026-01-31 00:44:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o37jpej",
          "author": "Optimal-Emotion3718",
          "text": "Because the questions founders ask are usually leading. \n\nYou should ask uncomfortable questions to get uncomfortable answers.",
          "score": 2,
          "created_utc": "2026-02-02 19:27:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o38u5pp",
              "author": "Cipamanz",
              "text": "Makes sense. Thanks",
              "score": 1,
              "created_utc": "2026-02-02 23:12:07",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2dqf4u",
          "author": "Cipamanz",
          "text": "Surprisingly so! But what I dont get is, this app is meant to help two kinds of people. The ones that are driven and want a change in their love life so they take up coaching (by whichever medium) and those who need to get unstuck in a situation, Text, Date Night etc.",
          "score": 1,
          "created_utc": "2026-01-29 09:13:36",
          "is_submitter": true,
          "replies": []
        },
        {
          "id": "o2dvg32",
          "author": "Difficult_Kale4602",
          "text": "Paying customers always tell the truth I believe,so try to get some, they'd be way more honest if they're spending some money!",
          "score": 1,
          "created_utc": "2026-01-29 10:00:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2e5bow",
          "author": "qqbbomg1",
          "text": "I did so cuz of the real human coach element, despite knowing everything is online. So, you may not be actually selling for what you are giving.",
          "score": 1,
          "created_utc": "2026-01-29 11:25:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2imj7j",
              "author": "Cipamanz",
              "text": "Could you elaborate?",
              "score": 1,
              "created_utc": "2026-01-30 00:56:42",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2ijenu",
          "author": "UniversityBrief320",
          "text": "You have a relational buisness, coaching is about deeply customized, luxury experience. It will never be replace by any sort of clanker. Would you pay for an AI therapist ? Probably not",
          "score": 1,
          "created_utc": "2026-01-30 00:40:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2im5lj",
          "author": "Wilshire3000",
          "text": "You need to read the book The Mom Test. It explains exactly your issue.",
          "score": 1,
          "created_utc": "2026-01-30 00:54:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2im98h",
          "author": "Cipamanz",
          "text": "Another question I have is, what do you guys think and how to make this a proactive AI coach rather than let the user extract advice?",
          "score": 1,
          "created_utc": "2026-01-30 00:55:13",
          "is_submitter": true,
          "replies": []
        },
        {
          "id": "o2kasoa",
          "author": "Aggressive_Bed7113",
          "text": "It’s a trust issue, I wouldn’t trust llm for any dating advice",
          "score": 1,
          "created_utc": "2026-01-30 07:20:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2tadv7",
          "author": "WebImpressive3261",
          "text": "You’ve validated that people want your consulting service not that they want an app.",
          "score": 1,
          "created_utc": "2026-01-31 16:37:02",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qu5xjr",
      "title": "I could use all the advice I could get.",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1qu5xjr/i_could_use_all_the_advice_i_could_get/",
      "author": "grazmakes",
      "created_utc": "2026-02-02 20:03:28",
      "score": 9,
      "num_comments": 28,
      "upvote_ratio": 0.8,
      "text": "Hey everyone,\n\nNew to this subreddit but I am looking for all the advice I can get. About 20 years ago, I had an idea for a social media website (sorry don’t want to give too much info away) while I was college and tried to learn as much web development as I could (design and database) and after awhile I just gave up as I had no connections to anyone in the development world and just gave up. Fast forward to today, with the help of Claude and Codex and about 6 months of time, I have the site just about fully working beyond just a proof of concept (beyond just an mvp I think). I know people always feel confident about their ideas and whatnot, but I feel this site has potential to make money from day one and the more people use it, the more money it could generate. I’m about as new to the startup world as you can get and looking for any advice I can to see how I can either find funding from investors, to perhaps try to keep going and get this idea off the ground myself? As I'm the only one navigating this path, I have so many questions but I’m finding it tough to find a course that will educate me to even ask the questions I need if that makes sense. Again my apologies for the lack of details as far as the site goes, but I'm just trying not to get burned. thank you in advance. I'm located in Boston if that help :-)",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1qu5xjr/i_could_use_all_the_advice_i_could_get/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o37tfle",
          "author": "quantumsequrity",
          "text": "Not to demotivate you but in YC interview I've seen this as a bad idea as we don't need another social media, and they said it's too broad like there are already too many startuo tried it so..",
          "score": 5,
          "created_utc": "2026-02-02 20:13:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o37u86x",
              "author": "grazmakes",
              "text": "I appricaite the input! i totally get the \"not another social media site\" but I do feel this is an idea that hasn't been properly done in the way this site works. again its tough to describe without giving too much away.",
              "score": 0,
              "created_utc": "2026-02-02 20:17:21",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o37uv02",
                  "author": "quantumsequrity",
                  "text": "TBH noone's gonna steal your idea cause people in here are busy with things they're building. Also you've to share it don't be afraid what ur building on. the idea will not be unique many would've thought about it before you and even after you, just share it Noone gonna judge or steal ur idea in here.",
                  "score": 9,
                  "created_utc": "2026-02-02 20:20:23",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o37tnp0",
          "author": "justgord",
          "text": "\nshow traction .. its really the thing investors care about, and will get you a better deal.\n\nie.  growth in views, signups, monthly subs.\n\nI wasted too much time talking to VCs pre-traction - plus you only get good terms when you are ramen-profitable and dont need them :]",
          "score": 5,
          "created_utc": "2026-02-02 20:14:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o37vc3p",
              "author": "grazmakes",
              "text": "I guess this is where im at a crossroad, right now it seems to be just about a working site, as I'm one person use AI with not a ton of knowledge about developing, I feel like that's not good enough/secure to open it to the public yet? Im about to send beta invites to friends to have them use and give me feedback on the site but beyond that is where i get a little gun-shy. For instance, having one or two people i can show and have them really give quality feedback/advice would help immensely",
              "score": 1,
              "created_utc": "2026-02-02 20:22:41",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3d8zyv",
                  "author": "Sea_Surprise716",
                  "text": "Why are you gun shy about having users, for a social media site? If it can make money from day 1, why not get to day 1 as fast as possible?\n\nIf it’s easy enough to copy that someone can “steal” it with just the idea before you launch, it is definitely easy enough for them to copy it after you launch. Especially since they’ll have development talent that you don’t.\n\nAnd if you’re not a developer, and using just Claude or lovable or something to code, the site is definitely not secure or stable enough to scale with actual users and their personal data. \n\nThat is not an investable picture. Either launch and prove traction, particularly prove that it can make money from day 1, or move on.\n\nThis all might come across as harsh, but it’s meant to encourage you to avoid over investing, so you can free yourself up to be successful. I really love entrepreneurial energy and dedication, but it always bothers me to see people get so in love with a particular idea that they waste months or years on building in private, instead of testing ideas actively until one genuinely solves a problem and resonates with actual customers.",
                  "score": 1,
                  "created_utc": "2026-02-03 16:41:52",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o3887k9",
          "author": "galvinw",
          "text": "Any network effect business is pitched based on the perceived benefit to the user of the business + the virality quotient. As such the best way to raise money is raise users",
          "score": 5,
          "created_utc": "2026-02-02 21:23:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o38h5qz",
              "author": "RoleHot6498",
              "text": "Music to my ears...on repeat",
              "score": 1,
              "created_utc": "2026-02-02 22:05:54",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o385sk5",
          "author": "AnonymousCrayonEater",
          "text": "We’ve all been there so I’m not trying to be judgmental or anything, but the idea is worth absolutely nothing. It’s mostly about distribution and execution.",
          "score": 4,
          "created_utc": "2026-02-02 21:12:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o38668u",
              "author": "grazmakes",
              "text": "thanks for the input!",
              "score": 1,
              "created_utc": "2026-02-02 21:13:49",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o39pvdn",
          "author": "NoFun6873",
          "text": "Sadly, this is a mature market with channel control by the majors. They invest so much it would be hard for you to launch a site. Now having said that, the majors need to compete and the bigger they get the less innovative they are. This means that you maybe able to sell your engine to them. I company I worked with several years ago sold their engine for $8 million. Now to investors that is small but if it were in your pocket, it would be life changing.",
          "score": 4,
          "created_utc": "2026-02-03 02:08:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o37yr3u",
          "author": "Content_Produce8783",
          "text": "Having a technical co founder will help a lot. Try reaching out on LinkedIn or even social media and try to find one. If a technical person is willing to develop your idea then your idea is def good.",
          "score": 2,
          "created_utc": "2026-02-02 20:38:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3801ub",
              "author": "grazmakes",
              "text": "thanks for the input!",
              "score": 1,
              "created_utc": "2026-02-02 20:45:05",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o38h0sp",
          "author": "RoleHot6498",
          "text": "Asking as someone who raises Capital for startups- Can you at least talk about the unique problem being solved or the common problem being uniquely solved? ",
          "score": 2,
          "created_utc": "2026-02-02 22:05:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o39u885",
          "author": "stellarknight_",
          "text": "Yc requires you to solve a problem that people really hate. also social media is a rly hard platform to Crack, u need ppl to make content for people to stay and for new people to come u need existing content. unless you make something very addictive like tiktok its not that easy to get people on the platform",
          "score": 2,
          "created_utc": "2026-02-03 02:33:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3a3iai",
          "author": "floppybunny26",
          "text": "Go through YC Startup school. It's free and about 20 hours of content. Once you've gone through that you'll have 90% of your questions answered and you can come back here with a better foundation. https://www.startupschool.org/",
          "score": 2,
          "created_utc": "2026-02-03 03:27:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3a69i4",
          "author": "Electrical-Space-398",
          "text": "You’re being entirely too secretive and the fact of the matter is you’ll launch and no one will care.\n\nYou’ll end up needing to scream this idea from the rooftops to get people to use it. Especially a social media.",
          "score": 2,
          "created_utc": "2026-02-03 03:44:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3a9zq7",
              "author": "speckiedee",
              "text": "I Agree with you",
              "score": 2,
              "created_utc": "2026-02-03 04:08:10",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3asiwl",
          "author": "IfBobHadAnUncle",
          "text": "“About 20 years ago” you had an idea? \nWhich is a “social media website”?\nThat you won’t share, and have not even let your friends try? \n\nAnd you are asking Reddit for advice, because you are so new to startups that you are struggling to find a course to educate you to even ask the right questions?\n\nStep 1: Move out of the cave you have been living in the last 20 years. \nStep 2: Ask your technical co-founder Claude, “what are the right questions to ask as a startup founder with a 20-year-old idea for a social media website with no experience and a phobia of sharing me idea who is seeking advice on Reddit about my startup idea?” \nStep 3: ask yourself if actually, living in that cave with an unfulfilled dream was a better existence than the harsh light of reality.",
          "score": 2,
          "created_utc": "2026-02-03 06:25:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3cl61p",
              "author": "grazmakes",
              "text": "um ok. first off, thanks for the input? secondly, yeah had an idea, didn't have the skills to fully develop it, life then gets in the way. fast forward 20 years, we live in a crazy time where certain AI's are actually helpful in realizing an idea, so i went for it. working on it for the last 6 months and try to debug and improve as much as i could, I surpassed the basic idea into something i feel might be pretty cool for people to use and to socialize on. while I've been working on it, I've been trying to do as much research as I can. that being said, there's a lot out there and, I dont know, I feel like asking people still yield the best results (sometimes). the idea doesn't really matter. what i was asking is more general advice about if someone has an idea and is very new in a scene that has changed significantly in the last 5 years, let alone 20. I have let me friends try, the problem with friends are they are usually going to be bias no matter if you say \"give me your honest opinion\". if I were to go by their feedback alone, Im sitting on the next instagram which i know is probably not correct.  the problem I'm currently encountering is that middle growth. beyond friends, but don't think its quite ready for a public beta. this is why I'm asking the questions from my original post. and yeah, Im currently a little gunshy at showing the site off as of now. I've yet to find a site that executes the idea the same way as the site and for the time being am holding it a little close to the chest.",
              "score": 1,
              "created_utc": "2026-02-03 14:47:43",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o38e5so",
          "author": "Voyager_Interceptor",
          "text": "Marketfit , we all been into locked up stage where speaking up freely about your idea = scary and fear of losing it .   \nTry to not get attached to the idea .\n\nThink about it this way, what if already you have competition and how you differentiate .   \nCan you onboard potential customers without telling them the key futures of your product ?? \n\nBy the way here you also can find your potential customers, and good feedback we are here for helping each other.\n\nThe best proven point ,if an idea has demand is people being ready for paying for it as you already read in the comments above.   \nBuilding something without  the market fit research is a high risk . I will not suggest that. \n\nWish you the best ! \n\n  \n",
          "score": 1,
          "created_utc": "2026-02-02 21:51:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o39jb64",
              "author": "Wide_Brief3025",
              "text": "Finding market fit is all about listening to real conversations and seeing where people actually have pain points. One thing that really helped me was tracking specific discussions on platforms like Reddit and Quora to spot recurring needs. If you want to get super targeted, using something like ParseStream makes it a lot easier to surface those relevant conversations, so you can join in at just the right time.",
              "score": 1,
              "created_utc": "2026-02-03 01:31:15",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o3c1yw4",
          "author": "TheIndieBuilder",
          "text": "The most important thing you need to know is this: \n\nThe value of a social media website is not in the code that runs the website, it is in how many people are using it. \n\nA functional social media platform with 100 users is worth basically nothing to anybody (except maybe those 100 users). A shoddy, crappy looking platform with 100,000 users is a viable business. Just look at how crappy craiglist and eBay are. But they are both valuable platforms.\n\nSo if you want to succeed with it, forget coding and work out how to get 100,000 people to use it.",
          "score": 1,
          "created_utc": "2026-02-03 13:00:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3c5iyg",
          "author": "attn-transformer",
          "text": "Try to get one random person to give a shit about your social media app. It will be difficult. \n\nI recommend you read zero to one by theil",
          "score": 1,
          "created_utc": "2026-02-03 13:22:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3cvc2a",
          "author": "itchyouch",
          "text": "The tried and true advice is that it's not the idea, it's the implementation and execution.\n\nSince we have neither idea nor MVP, there's nothing productive we can contribute.\n\nYour next biggest problem after building and MVP is gonna be shouting from the rooftops till you lose your voice for any sliver of attention you can try to get.  It's gonna basically be shouting into the void and developing marketing chops, a personal brand or something that enables you or your site to gain any traction.\n\nYou're in a tough spot. Not saying give up, but you need a technical dev to execute beyond what AI can do. AI basically breaks after 5k lines of code.  So then you need to segment the architecture to scale features beyond what you have.\n\nProblem is, it'll be hard to find a technical co-founder that wants to bet on your business skills.\n\nFrom what I can tell, the only way out is a lot of insane hours to become skilled at everything from marketing, sales, HR, seo, dev, etc etc etc etc etc etc etc etc etc etc etc.  Then executing on everything.  See Alex Hormozi's story.\n\nBut to start, you need to come up with targets you're trying to hit, whether it's dev goals, usage goals, finding funding, finding partnership, figuring out the next thing to learn.\n\nThis is basically the lonely and tough grind portion you're entering.  You have something, now you want to sell it (to users, investors, employees, partners) So go on and start selling or figure out how to sell your vision.",
          "score": 1,
          "created_utc": "2026-02-03 15:37:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3d2iw0",
          "author": "Mountain-Host409",
          "text": "Why not say the idea if ur already done? If ur worried about cloning, if it’s a good idea people should think it’s dumb. Thsts beside the point. The cold start problem is what your dealing with and if you have built this entire platform but have no users then no one will use it.",
          "score": 1,
          "created_utc": "2026-02-03 16:11:49",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qs3giu",
      "title": "How to search leads for B2B?",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1qs3giu/how_to_search_leads_for_b2b/",
      "author": "RushElectronic8541",
      "created_utc": "2026-01-31 14:15:29",
      "score": 7,
      "num_comments": 19,
      "upvote_ratio": 0.9,
      "text": "Hi folks,\n\nSay you’ve defined your ICP as “business that have raised seed to series B and have a main product offering that’s via an app or is subscription based”, how do you guys go about finding such companies?\n\nI’ve been doing research scouring sites like YC and also going on LinkedIn (which has very rigid search parameters) or going through lists of popular apps or subscription based sites like meal planners, for example. I’m curious what else I can use, I’ve seen Clay being mentioned in other subs, has anyone tried it?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1qs3giu/how_to_search_leads_for_b2b/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o2t0tca",
          "author": "Difficult_Kale4602",
          "text": "BOOST! so I can get an answer too.....",
          "score": 1,
          "created_utc": "2026-01-31 15:51:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2t2keq",
          "author": "ExplorerTop881",
          "text": "Traxn, pitchbook, crunchbase(kinda) if you want help dm me, we can get a lot more focused and even call these people to get more feedback.",
          "score": 1,
          "created_utc": "2026-01-31 15:59:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2ubt73",
          "author": "ZorroGlitchero",
          "text": "Usea apollo, or lusha, or lemlist, or zoominfo, or listkit, or linkedin, or clay, there are infinite software. But i recommend apollo + scraper to get many emails.",
          "score": 1,
          "created_utc": "2026-01-31 19:35:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2v7k2f",
              "author": "kimsart",
              "text": "Cool! I'm checking these out now.",
              "score": 1,
              "created_utc": "2026-01-31 22:11:13",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o2voucy",
              "author": "InspectionGreen6076",
              "text": "FYI clay is an enrichment tool(adds more info like company website summaries) it would be inefficient to use it to search leads.\n\nThe standard is a cheap tool like Apollo then use an enriched software like clay\n\nzoom info is enterprise info aka 10k+ a year",
              "score": 1,
              "created_utc": "2026-01-31 23:43:32",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o2wzzlh",
          "author": "Loose-Tackle1339",
          "text": "Use [dwite ai](https://app.dwiteai.com)",
          "score": 1,
          "created_utc": "2026-02-01 04:27:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2x7sxf",
          "author": "AdamProbolsky",
          "text": "[Seamless.ai](http://Seamless.ai) is pretty amazing for finding contact information, and a ton of other things you need to find you ICP and reach out to them",
          "score": 1,
          "created_utc": "2026-02-01 05:22:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2xubx1",
          "author": "Fun_Ostrich_5521",
          "text": "Practical approach:\n\n1. Start with funding → qualify manually Crunchbase / PitchBook / Tracxn → Seed–Series B SaaS. Then sanity-check: product type, hiring/shipping/marketing activity. No tool replaces judgment.\n2. Reverse-search the problem Look for posts like: We’re hiring for growth/lifecycle/retention, Just raised seed/Series A + launching, App store + B2B/team/enterprise keywords You surface intent earlier than databases.\n3. LinkedIn, beyond rigid searches Track founders, early employees, VCs resharing portfolio news. Build lists from signals, not filters.\n4. Beyond YC Techstars, Antler, EF, Sequoia Arc, a16z Speedrun....demo days are gold.\n5. Clay Scales a process you already understand. Doesn’t find magic leads.\n\nRule: If you can’t explain why this company should care today, no tool will help.  \nMost teams over-optimize tooling; under-optimize timing + intent. Get that right, and sources matter much less.",
          "score": 1,
          "created_utc": "2026-02-01 08:34:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2xxxhm",
          "author": "Horror-Sundae-9820",
          "text": "If you have to wonder where your first B2B customers are then I would be very worried that you actually dont have founder-market fit.",
          "score": 1,
          "created_utc": "2026-02-01 09:08:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2xz7y5",
          "author": "No-Refrigerator-5015",
          "text": "finding companies that match super specific criteria like that can be a real pain with basic linkedin filters. I've heard great things about sales dot co for this exact use case since they handle the whole lead gen process including finding companies that match your ICP and running the outreach campaigns for you, which might save you a ton of time vs doing it all manually.",
          "score": 1,
          "created_utc": "2026-02-01 09:20:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2yi7a9",
          "author": "Sainiaryan",
          "text": "I’ve actually tried Sophic Services for something very similar, and what helped was not relying on one source. We started with companies that had raised seed to Series B using funding data, then layered in product signals to check whether the core offering was app-based or subscription. \n\nThat included looking at Product Hunt, app stores, and tech-stack signals like Stripe or Chargebee. Clay was useful on top of that for enrichment and automation once the criteria were clear, but it didn’t replace defining the ICP. \n\nLinkedIn came in later just for contact discovery. The big difference with Sophic was having those funding, product, and tech signals stitched together, which saved a lot of manual back-and-forth.",
          "score": 1,
          "created_utc": "2026-02-01 12:09:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o310mgz",
          "author": "jello_house",
          "text": "crunchbase and linkedin searches get tedious af for tight ICPs like that ive been using ClientHunter, it nails funding stages + app/subscription filters across web/social then spits out qualified leads with personalized email drafts. saves hours vs manual digging, response rates actually went up for me.",
          "score": 1,
          "created_utc": "2026-02-01 19:53:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o33tl7t",
          "author": "kubrador",
          "text": "clay is just a data aggregator with a ui that makes you feel productive. you're already doing the hard part (knowing who to target), the real work is just... emailing them.\n\nif you want to get fancy: crunchbase + apollo + linkedin sales navigator, but honestly just make a list in a spreadsheet and start reaching out. the difference between using clay and not using clay is like 2 hours saved per week while costing you $500/month.",
          "score": 1,
          "created_utc": "2026-02-02 05:09:29",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o35dq5b",
          "author": "gsmartins",
          "text": "This is gonna be a bot fest",
          "score": 1,
          "created_utc": "2026-02-02 13:09:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o35idxc",
              "author": "RushElectronic8541",
              "text": "Yo, I didn’t even know it be like that. Bunch of losers trying to DM you their sh*tty toy and all, you can’t even ask questions on Reddit anymore",
              "score": 1,
              "created_utc": "2026-02-02 13:37:05",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o36lcau",
          "author": "salestoolsss",
          "text": "matching your ICP, research YC startups, LinkedIn, app directories, or subscription-based services. Scrape relevant lists, check funding announcements, and reach out via DMs for better engagement. For verified emails and easy outreach, Tomba.io works great.",
          "score": 1,
          "created_utc": "2026-02-02 16:50:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3863ln",
          "author": "grumpyp2",
          "text": "Here on Reddit with tools like subsignal",
          "score": 1,
          "created_utc": "2026-02-02 21:13:29",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qtgw10",
      "title": "Coding Agent Session: that’s such great question!",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1qtgw10/coding_agent_session_thats_such_great_question/",
      "author": "aspiringtroublemaker",
      "created_utc": "2026-02-02 01:12:32",
      "score": 7,
      "num_comments": 5,
      "upvote_ratio": 0.74,
      "text": "Optional: attach a coding agent session you're particularly proud of.\n\nThis is an experimental question for the Spring 2026 batch to give people a chance to show off their skills with Al coding tools.\n\nMany coding agents (i.e. Claude Code, Cursor, etc) have a /export command, or otherwise include a button allowing you to export a transcript. Can be text or markdown.\n\nI wonder what people came up with for this question?\n\n& whether you think that’s what we should be looking at when hiring new engineers ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1qtgw10/coding_agent_session_thats_such_great_question/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o32w2bv",
          "author": "SlowPotential6082",
          "text": "love this question. i think it reveals something more interesting than just coding ability.\n\nthe best sessions i've seen (and done myself) show how someone breaks down a problem, handles ambiguity, and course-corrects when the AI goes off track. it's less about the code quality and more about the \"conversation\" with the agent.\n\nfor hiring, i'd look for:\n- how clearly they spec out what they want before prompting\n- whether they catch hallucinations or just blindly accept output\n- how they recover when something breaks\n- whether they understand the code the agent wrote, or just copy paste and pray\n\nthe skill gap between people who use these tools well vs poorly is massive. someone who knows how to guide an agent effectively can build in hours what would take weeks to spec out and outsource.\n\nSource: non-technical founder who built an entire SaaS frontend in v0/Cursor",
          "score": 3,
          "created_utc": "2026-02-02 01:45:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o33e1qv",
          "author": "puddle-shitter",
          "text": "didnt give it much thought, I just exported a claude code session from like a few days ago where I was bullying opus into fixing something, and kept telling it where things are and what to touch and what not to do specifically. I think this question is great because its fairly easy to estimate your technical abilities from your prompts and your iterations to those outputs. definitely the most interesting thing to be looking for in engineers because its just the new reality of coding abstraction.",
          "score": 1,
          "created_utc": "2026-02-02 03:28:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o33jvvm",
          "author": "quietoddsreader",
          "text": "i’m a bit skeptical of raw transcripts as a hiring signal. a polished agent session can hide whether the engineer actually understands the tradeoffs or just knows how to prompt well. what i care more about is how someone frames the problem, decides what not to ask the agent to do, and catches subtle mistakes. coding agents are table stakes now, but judgment under pressure is still the scarce skill. if this question surfaces that, it’s useful. if it rewards theater, less so.",
          "score": 1,
          "created_utc": "2026-02-02 04:04:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o34feki",
          "author": "Forsaken_Lie_8606",
          "text": "ive been on the other side of the table, hiring engineers for my startup, and tbh, i dont think a coding agent session is the best way to gauge someones skills, at least not as a standalone metric. weve had candidates who aced these kinds of tests but struggled with the nuances of our codebase, and others who didnt do as well on the tests but were total rockstars when it came to collaborating with the team and writing clean, maintainable code. imo, its all about finding a balance between technical chops and soft skills, and thats something you cant always get from a coding agent session. ngl, id rather see a candidates github repo or a personal project theyre passionate about, that gives me way more insight into how they think and code hope that helps",
          "score": 1,
          "created_utc": "2026-02-02 08:15:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3brrab",
          "author": "ruibranco",
          "text": "This is basically YC asking \"show me how you think\" instead of \"show me what you built.\" A coding agent session reveals so much - how you decompose problems, whether you verify output or blindly accept it, how you recover when the agent goes sideways. It's closer to evaluating judgment than technical skill, which makes sense because that's what actually matters at the founder level. The best engineers I've worked with aren't the ones who write the cleanest code, they're the ones who know when to push back on the tool.",
          "score": 1,
          "created_utc": "2026-02-03 11:49:12",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qqiny7",
      "title": "Do your users still need a lot of hand-holding to get value?",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1qqiny7/do_your_users_still_need_a_lot_of_handholding_to/",
      "author": "casual_observer05",
      "created_utc": "2026-01-29 19:37:35",
      "score": 6,
      "num_comments": 8,
      "upvote_ratio": 0.88,
      "text": "In a few SaaS tools I’ve used, users understand what the product does, but still struggle with **how to actually do what they want**.\n\nThey end up reading docs, watching videos, or pinging support just to set up basic workflows.\n\nCurious how others here see this:\n\n* Is this just inevitable for complex products?\n* What have you seen work to reduce hand-holding without hiring more CS or writing endless docs?\n\nInterested in how people think about this from a PLG/scaling perspective.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1qqiny7/do_your_users_still_need_a_lot_of_handholding_to/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o2m3t4c",
          "author": "quietoddsreader",
          "text": "hmm, i’ve noticed that even with clear onboarding, there’s often a gap between understanding a tool conceptually and knowing how to act in it... sometimes small, contextual nudges, like inline tips or pre-built templates, help more than long docs or videos. i think the tricky part is anticipating the exact points where users get stuck, which isn’t always obvious until you watch a few real sessions. scaling that insight without burning the team seems like the real art",
          "score": 2,
          "created_utc": "2026-01-30 15:04:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o2n2qde",
          "author": "Camilla_for_business",
          "text": "Well, I may challenge you with this one: make it less complex. I've been working with B2B SaaS selling to government / Enterprise, and the best of them manage to achieve that intersection between ease of use and substance (aka: value provided).\n\nI wouldn't say this is a technology problem, but a customer journey one.\n\nP.S. from a customer perspective, avoid video tutorials at the start. Nobody watches them. Good luck!",
          "score": 2,
          "created_utc": "2026-01-30 17:41:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2r7hev",
              "author": "Doughnut_24",
              "text": "Could you share some examples for when you say ‘intersection between ease of use and substance’?",
              "score": 2,
              "created_utc": "2026-01-31 07:47:43",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o2rvod4",
              "author": "casual_observer05",
              "text": "But some tools are complex by nature and need some extent of learning to get the work done.\n\nSome, e.g., are low-code and automation platforms, GTM software, where you are supposed to build some automation workflow, and you have no idea how to build it, which modules, which parameters to map, etc., etc.\n\nThese are some of my observations.\n\nIn such cases, you most likely need to invest a lot of time with users to teach them and get them comfortable with the software.\n\nHow do such companies do that apart from investing in humans to teach the users?",
              "score": 1,
              "created_utc": "2026-01-31 11:34:57",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o2yef8x",
          "author": "ThreePedalsRequired",
          "text": "If you have a really good product, they do not need any hand holding. The examples are all around you.",
          "score": 2,
          "created_utc": "2026-02-01 11:38:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o2yiezl",
              "author": "casual_observer05",
              "text": "By hand holding, I mean getting to value quickly. \n\nSome products get complex as they evolve like CRMs, GTM tools, automation platforms, low or node platforms. \n\n\nIn such cases when a new user starts using it, he/she starts getting errors, might experience some confusion and wonder how to do X. \n\nMy question was regarding this. \n\n\nAnyway, your verdict makes sense totally. A user friendly product is a must.",
              "score": 1,
              "created_utc": "2026-02-01 12:11:37",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o3a7p71",
          "author": "hlabels_com",
          "text": "There’s only so much you can do.\nIf there’s a big imbalance between onboarding friction and the price of a subscription, you’re in trouble.",
          "score": 1,
          "created_utc": "2026-02-03 03:53:21",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qut4in",
      "title": "pitch decks",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1qut4in/pitch_decks/",
      "author": "ZealousidealRide7425",
      "created_utc": "2026-02-03 14:18:34",
      "score": 5,
      "num_comments": 5,
      "upvote_ratio": 0.86,
      "text": "I Reviewed Many pitch decks .\n\nHere’s the no-BS pitch deck playbook most founders get wrong.\n\nIf you’re raising capital and your deck isn’t landing…\nIf investors say “interesting” but never follow up…\nOr if you’re copying templates from Google and hoping for the best…\n\nThis might save you months.\n\n\nWe run a fractional CFO agency. Between our clients and my own deals, I’ve sat on both sides of the table — pitching investors and evaluating decks for funds.\n\nHere’s a straight brain dump on what actually works.\n\n1. Your deck is not a presentation. It’s a decision document.\nMost founders design decks like TED talks. Big mistake.\nInvestors skim. Fast. Your deck should make sense without you talking. If someone forwards it internally and it doesn’t hold up on its own, you’re done.\n\n2. The problem slide matters more than your product\nNobody invests because your product is “cool.”\nThey invest because the problem is painful, urgent, and expensive.\nIf your problem slide doesn’t make an investor slightly uncomfortable, it’s too weak.\n\n3. Your solution should feel obvious (in hindsight)\nIf you need 5 slides to explain what you do, that’s a red flag.\nGreat decks make investors think:\n“Why didn’t this exist already?”\n\n4. Traction beats storytelling. Every time.\nYou can have the prettiest narrative in the world — traction still wins.\nRevenue, growth rate, retention, pipeline, pilots.\nEven early signals beat vague vision.\n\nNo traction yet?\nShow momentum, not excuses.\n\n5. Your financials are silently killing deals\nThis is where most decks fall apart.\nUnrealistic hockey sticks.\nNo understanding of cash burn.\nNo link between growth and spend.\n\nInvestors don’t expect perfection — they expect financial literacy.\n\n6. Your “Ask” slide should be painfully clear\nHow much are you raising?\nWhat does it unlock?\nHow long does it last?\n\nIf an investor has to guess any of that, they usually just pass.\n\n7. Less slides. More clarity.\nMost winning decks are 10–14 slides.\nNot 25.\nNot 40.\n\nIf everything feels “important,” nothing is.\n\n8. Design won’t save bad logic\nClean design helps.\nBut no amount of visuals will fix a broken story or weak numbers.\n\nStrategy first. Slides second.\n\n9. Every deck should be built for its stage\nPre-seed decks shouldn’t look like Series B decks.\nYet founders copy whatever raised last on Twitter.\n\nContext matters. Stage matters. Investor mindset matters.\n\n10. The best decks don’t try to convince — they invite\nYour goal isn’t to “sell.”\nIt’s to make the investor want the next conversation.\n\nThat’s it.\n\nThis is exactly how we think about pitch decks inside our fractional CFO practice — combining strategy, numbers, and investor psychology, We create investor ready pitch deck for startups not just slides.\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1qut4in/pitch_decks/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o3cnbhg",
          "author": "MagicianMany1814",
          "text": "So great to see posts with real value, and not someone just trying to promote their SaaS!",
          "score": 1,
          "created_utc": "2026-02-03 14:58:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3cunuu",
          "author": "quantumsequrity",
          "text": "Hey introduce yourself, how will we know this advice is from a real experienced person.. it could be some nobody with AI written post or even a Bot",
          "score": 1,
          "created_utc": "2026-02-03 15:34:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3d5sln",
          "author": "BernoulliCat",
          "text": "AI slop!",
          "score": 1,
          "created_utc": "2026-02-03 16:26:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3dduid",
          "author": "Empty_Fig_8619",
          "text": "In venture, opinions tend to scale faster than experience, which is why your deck must be clear, concrete, and self-explanatory",
          "score": 1,
          "created_utc": "2026-02-03 17:04:19",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1quqtb4",
      "title": "How do you demo an AI product whose value is emotional, not transactional?",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1quqtb4/how_do_you_demo_an_ai_product_whose_value_is/",
      "author": "Lisa_Create2030",
      "created_utc": "2026-02-03 12:37:21",
      "score": 3,
      "num_comments": 2,
      "upvote_ratio": 1.0,
      "text": "I’m applying to YC with a startup that uses AI agents to turn global issues (climate, migration, inequality) into human-centered stories for organizations, communications teams, and creators ... things like spoken-word poems, short films, and advocacy campaigns.\n\nThe problem I’m running into is that our strongest demos aren’t “look how fast it generates text,” but “look how it makes people *feel*.”\n\nIn live sessions, youth, artists and NGOs have used it to turn things like water scarcity data into spoken-word poetry and short film scripts that move people in ways dashboards never do.  but that doesn’t fit neatly into a 30-second YC demo.\n\nFor people who’ve built non-obvious, creative, or impact-driven products: How did you show traction and product-market fit when what you were building wasn’t easily measured by clicks or conversions?\n\nWould love advice from anyone who’s been there.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1quqtb4/how_do_you_demo_an_ai_product_whose_value_is/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o3d0s4w",
          "author": "ruibranco",
          "text": "don't try to explain the emotion - just trigger it live. in your demo, take a real headline (something dry, like a UN water report) and show the output poem or film script in real time. let the room feel the difference between the raw data and what your tool creates from it. YC partners have seen a thousand dashboards. they haven't seen someone get goosebumps from a demo. your metric isn't clicks - it's the number of orgs that came back after the first session and asked for more. retention in creative tools IS the product-market fit signal.",
          "score": 1,
          "created_utc": "2026-02-03 16:03:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o3d3w0x",
              "author": "Lisa_Create2030",
              "text": "This is a great answer. This is the response were getting from users who take real big topics and find really beautiful and moving stories. This is perfect, THANK YOU!",
              "score": 1,
              "created_utc": "2026-02-03 16:18:12",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qu7a87",
      "title": "You don't sell in Silicon Valley, are you?",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1qu7a87/you_dont_sell_in_silicon_valley_are_you/",
      "author": "Illustrious_Slip331",
      "created_utc": "2026-02-02 20:51:52",
      "score": 2,
      "num_comments": 20,
      "upvote_ratio": 0.55,
      "text": "New to this sub, new to San Francisco.\n\nSo, half a year ago I moved to SF and became a founder. For me it was easier to start, because I had an experienced founder as a mentor and a couple teammates with whom we started this new, crazy journey. \n\nAt the beginning it was fun trying tons of ideas, examining them, trying to build MVPs without prior experience, searching for PMF and attending every event on Luma, trying to reach out to cool guys. It was literally like in Silicon Valley and I thought I would become Richard Hendricks.\n\nBut time goes by, I am trying to mature and find myself in a paradox:\n\nHow to show traction (sales, customers, leads and custdev) in a palace where everything is built on contributing value? \n\nEvery time I try to reach out to someone, even to ICPs, I get the feeling that I'm being annoying and intrusive. But without real feedback it’s nearly impossible to build anything really valuable. \n\nSo that’s really it. Just curious how you overcome this and deal with moving from -1 to 1. Are there any secrets or is it all about the number of attempts?\n\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1qu7a87/you_dont_sell_in_silicon_valley_are_you/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o38eih2",
          "author": "ruibranco",
          "text": "The feeling of being intrusive is the number one thing that kills early-stage sales. Here's the reframe that helped me: you're not selling, you're testing a hypothesis. When you reach out to an ICP, you're not asking them to buy - you're asking if the problem you think exists actually exists for them. That framing makes the conversation way more natural because you're genuinely curious instead of pitching. Also, most people in SV are used to getting cold outreach. The ones who respond are self-selecting into your target audience. It's a numbers game but the numbers are smaller than you think - 10 real conversations with ICPs will teach you more than 6 months of building in isolation.",
          "score": 3,
          "created_utc": "2026-02-02 21:53:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o38unxn",
              "author": "Illustrious_Slip331",
              "text": "Agree with you. I’ve tried this on events and conversation really became way more natural. And yet at the end I often hear just: great idea, you really should build this, push forward, SF is the best place for that, etc. I appreciate their support, but rarely see reasonable, grounded feedback. \n\nMaybe you are right about outreaching and I really try to win in this numbers game, but right now I am losing. Although you are right, even 10 real conversations will be tremendously helpful.",
              "score": 1,
              "created_utc": "2026-02-02 23:14:51",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o3coy2t",
                  "author": "Sea_Surprise716",
                  "text": "There’s a difference between “great idea” and “I need that, what are you charging and when are you launching?” The latter is a positive signal. The former is a false positive.",
                  "score": 1,
                  "created_utc": "2026-02-03 15:06:46",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o387efg",
          "author": "p1zzuh",
          "text": "If something isn't working, you have some signal there. You have to make a change and see what changes. If you've been doing the same thing every day and not getting to where you want to go, you have to change something if you want a different outcome.\n\n  \nEasier said than done. I'm in the same loop you're in now, and continuing to iterate daily.",
          "score": 2,
          "created_utc": "2026-02-02 21:19:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o38c8ow",
              "author": "stevengineer",
              "text": "This - feedback is often nuanced and hidden because nobody wants to say 'I don't get it\" \"why would I use that?\" \"Horrible idea!\" \n\nI log it all and keep it in a file for Claude to review. Sure helps find the connections - which can help kill or pivot the idea.",
              "score": 2,
              "created_utc": "2026-02-02 21:42:24",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o38dk48",
                  "author": "p1zzuh",
                  "text": "I'm also looking for people to get excited at an idea. If they aren't visibly excited, I move on",
                  "score": 2,
                  "created_utc": "2026-02-02 21:48:41",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o38t3y1",
                  "author": "Illustrious_Slip331",
                  "text": "That’s true, but sometimes it hard to get any feedback",
                  "score": 1,
                  "created_utc": "2026-02-02 23:06:32",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            },
            {
              "id": "o38swf6",
              "author": "Illustrious_Slip331",
              "text": "I totally understand you. I am always trying something new, looking further than obvious ideas, learning from others. Right now I just came to the point where I question myself: am I doing right? Is my previous experience enough to solve this puzzle? \n\nBasically that’s why I am here.",
              "score": 2,
              "created_utc": "2026-02-02 23:05:25",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o38u026",
                  "author": "p1zzuh",
                  "text": "im right there with you :) let me know if you figure it out!",
                  "score": 1,
                  "created_utc": "2026-02-02 23:11:17",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o38fxif",
          "author": "ivalm",
          "text": "Your ICPs should feel that your product is contributing value. if your ICPs don't want to use your product then you need to do something else.",
          "score": 1,
          "created_utc": "2026-02-02 21:59:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o38ii7p",
          "author": "reddit_user_100",
          "text": "Sales is just the binding agent that links people who have problems to solutions. If your product truly helps your ICP, your customers should be glad you told them about it.",
          "score": 1,
          "created_utc": "2026-02-02 22:12:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o38uwoy",
              "author": "Illustrious_Slip331",
              "text": "I am aiming to have such confidence in the product. But sometimes it's hard to push idea when you just started",
              "score": 1,
              "created_utc": "2026-02-02 23:16:10",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o38m9pm",
          "author": "RoleHot6498",
          "text": "The secret is \"warmth\" Either spend half your day immersed in the right network, asking for nothing or connect with someone who already is immersed ",
          "score": 1,
          "created_utc": "2026-02-02 22:31:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o38wglo",
          "author": "random-trader",
          "text": "They are hard but find teaching customers. You learn from them by doing shits for free. While doing shits ask yourself is this going to make a big company? Are others have the exact same problem. If not then stop doing anymore of that shits and ask for some other shits. You will end up in a place where there are tons of similar looking shit that needs to be cleaned up and done. That's when you find your PMF.",
          "score": 1,
          "created_utc": "2026-02-02 23:24:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o390cah",
          "author": "Tall-Log-1955",
          "text": "If you’re having trouble selling, pivot until you don’t.  The best way to fix sales challenges isn’t to be a better salesman.  The best way is to be solving a problem so painful, that a bad salesman can sell it",
          "score": 1,
          "created_utc": "2026-02-02 23:46:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o391i6y",
          "author": "Mompreneur1987",
          "text": "Marketing is key. Understand your audience, and solve their problem. Show them your product is the solution.",
          "score": 1,
          "created_utc": "2026-02-02 23:52:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o39crh6",
          "author": "baradas",
          "text": "Have you ever thought - all your MVP's are a prompt away?",
          "score": 1,
          "created_utc": "2026-02-03 00:53:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3a00rt",
          "author": "quietoddsreader",
          "text": "traction isn’t about convincing everyone, it’s about finding the few people who actually care and listening hard. cold outreach isn’t intrusive if it’s framed around understanding their pain, not selling. most learning comes from repeated, thoughtful conversations rather than “volume” alone. focus on real curiosity, documenting what u hear, and iterating ur product or approach based on that feedback.. numbers follow once the problem is sharp and the solution clicks.",
          "score": 1,
          "created_utc": "2026-02-03 03:06:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o3cmjyh",
          "author": "onahorsewithnoname",
          "text": "This is the work of finding pmf. At the same time many startups will leverage a vc to introduce them to portfolio companies or networks to help accelerate this process. After that many have significant ad spend with google/meta to get word out. Its a grind but if you find you hate the work then look to hire someone to help get those meetings. There are companies that specialize in setting up meetings with your icp.",
          "score": 1,
          "created_utc": "2026-02-03 14:54:47",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}