{
  "metadata": {
    "last_updated": "2026-02-23 17:19:57",
    "time_filter": "week",
    "subreddit": "ycombinator",
    "total_items": 18,
    "total_comments": 162,
    "file_size_bytes": 175242
  },
  "items": [
    {
      "id": "1r6yrrz",
      "title": "How are you guys doing marketing as a solo founder?",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1r6yrrz/how_are_you_guys_doing_marketing_as_a_solo_founder/",
      "author": "Delicious_Bed_4410",
      "created_utc": "2026-02-17 06:37:03",
      "score": 97,
      "num_comments": 68,
      "upvote_ratio": 0.97,
      "text": "I’m very strong technically. I can build fast, ship features, set up infra, automate workflows. I also run my own local service business, so I understand customer acquisition in a traditional sense.\nBut SaaS marketing feels like a different universe.\nThere’s so much noise:\n\n“Build in public”\n“Do SEO”\n“Post daily on LinkedIn”\n“Cold email at scale”\n“Run ads”\n“Start a community”\n“Hire influencers”\n\nAnd whenever I ask for advice, the default response is: “Get a cofounder.” “Hire a marketing person.”\n\nThat’s fine advice long-term. But I’m asking as a solo founder who wants to learn distribution properly not outsource the skill immediately.\n\nFor those who’ve grown a SaaS solo:\n\n1) What channel actually moved the needle ?\n2) How did you validate it before going all in?\n3) Did you focus on one channel aggressively or test multiple?\n4) Any specific tools or systems that helped you stay consistent?\n5) Im not afraid of hard work. I just don’t want to spray energy across 10 channels without a clear approach.\n\nIf anyone has a structured way of thinking about SaaS marketing as a technical founder, I’d genuinely appreciate it.\n\nFor context - we're building a B2C job platform focused on helping job seekers apply smarter and faster. It's not just a traditional job board; we're combining curated listings with automation tools that reduce friction in the application process and increase response rates.\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1r6yrrz/how_are_you_guys_doing_marketing_as_a_solo_founder/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o5trku3",
          "author": "narrow-adventure",
          "text": "I’m honestly just trying to get as much feedback as possible while learning more about what people like and dislike in my solution.\n\nI don’t think that there is a one size fits all, but my tool is an open source telemetry platform for engineers so having an open source community would be nice, I’ll definitely be working more on facilitating that. Maybe that wouldn’t apply to you as it’s a b2c.",
          "score": 14,
          "created_utc": "2026-02-17 07:00:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5x7hm7",
              "author": "eh-tk",
              "text": "As a product marketing consultant I agree with this! but with one small addition:\n\nRecord and write down as much feedback as possible. Every time someone tells you what they like about your product/feauture, you can use that to inform the words on your website.\n\nEvery time someone tells you about an issue with a competitor, same thing.\n\nThe best use of AI for marketing, is being able to transcribe every conversation and find trends and themes in them",
              "score": 6,
              "created_utc": "2026-02-17 19:51:20",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5xznfw",
                  "author": "narrow-adventure",
                  "text": "Oh wow that is really smart.\n\nI’ve realized that whenever I apply the feedback I also update the website but it never occurred to me to write all these progressions and original comments down to be able to both see the product evolution AND help focus on in the marketing materials in the future.",
                  "score": 2,
                  "created_utc": "2026-02-17 22:04:12",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o600vga",
              "author": "bersuku",
              "text": "hey! im actually bringing together 8 dev tool founders that are in similar stages for deep feedback. Lmk if youre interested! Secondly, for feedback in general im hosting an event right now (YC vs Indies) where users can choose a side, upload their product for the community to review:  [kaijubeam.com](http://kaijubeam.com) You're welcome to join this as well!",
              "score": 2,
              "created_utc": "2026-02-18 04:53:52",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5xd864",
          "author": "Livid-Savings-5152",
          "text": "Have a few solopreneur friends who sold their saas for millions.\n\nBefore building, they studied existing competitors marketing funnels and just copied them.\n\nFor example if you’re making a b2c app for college students, study succesful apps in that category to see what marketing channels are working.\n\nThe use those same chanels because they are already proven.",
          "score": 9,
          "created_utc": "2026-02-17 20:18:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5zwqng",
              "author": "diystateofmind",
              "text": "How? What did they do to study? ",
              "score": 1,
              "created_utc": "2026-02-18 04:25:25",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o603n9k",
                  "author": "Livid-Savings-5152",
                  "text": "Pick any company that’s already succeeding in your space. Then spy on their marketing funnels. For example, use the LinkedIn and Meta ads library to see if they are running ads.\n\nUse ahrefs to spy on their SEO strategy.\n\nKeep studying their funnels until you figure out what’s working for them.\n\nThen just copy it and put your own twist",
                  "score": 6,
                  "created_utc": "2026-02-18 05:13:33",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o6d4l0q",
              "author": "TheStackArchitect",
              "text": "It doesn't work that way buddy",
              "score": 1,
              "created_utc": "2026-02-20 03:56:28",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6dtem9",
                  "author": "Livid-Savings-5152",
                  "text": "I’ve been through 4 startup exits and achieved financial freedom a long time ago, so I know what works.\n\nYou are an engineering worker nerd who has no idea how business works. That’s why you’re not rich.\n\nGet back to work kid ❤️",
                  "score": -2,
                  "created_utc": "2026-02-20 07:15:07",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5tvw18",
          "author": "Aromatic-Trouble-580",
          "text": "You run into the problem of generic advice, mainly because most, if not all, the advice you are getting are from people who do not specialize in advice giving. Understanding a problem and being able to effectively help another solve it, is a skill, which is why consulting has been big business for so long. \nI have a question for you, have you tried taking the time to actually study marketing?",
          "score": 7,
          "created_utc": "2026-02-17 07:39:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6utyvn",
              "author": "Funder_Founder",
              "text": "Best answer in this thread 👏 …decades of working with business growth &  improvement has made me realise that most don't fully understand the problem and jump to solutions, sometimes they get lucky, but most spiral into chaos. IM if you want to discuss.",
              "score": 1,
              "created_utc": "2026-02-22 22:52:52",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5vwbsm",
          "author": "AnyExit8486",
          "text": "Pick one channel, not ten.\n\nGo where job seekers are already complaining (Reddit > LinkedIn > Discord).\n\nManually engage 20–30 people first. If they convert, double down. If not, fix the message.\n\nOptimize activation before traffic.\n\nOutcomes sell. Features don’t.",
          "score": 5,
          "created_utc": "2026-02-17 16:06:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5x3x3j",
          "author": "Popular-Penalty6719",
          "text": "Marketing for a SaaS product requires a focus on a few solid channels, not a dozen half-hearted attempts. Pick one or two channels where your target audience hangs out. Since your product targets job seekers, consider platforms like LinkedIn or Reddit.\n\nStart validating your ideas by talking directly to potential users. Get feedback on the concept and features before you sink time and resources into marketing. Early users can provide insights into what actually resonates.\n\nWhen it comes to consistency, create a content calendar. Regular, manageable posting beats occasional bursts of activity. Tools like Buffer or Hootsuite can help you schedule this without complicating your workflow. Automate only what needs automation, leaving room for direct engagement. \n\nSkip the push for “going viral” and focus on building genuine connections. Overcomplicating early marketing efforts often leads to frustration and wasted resources. Do less, but do it well.",
          "score": 4,
          "created_utc": "2026-02-17 19:34:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5zwnxz",
              "author": "diystateofmind",
              "text": "Your advice sounds good but in need of some gritty/granular details-ex: at what ratio? What is the conversion rate on LinkedIn? Is it better than 1%? 3%? What takes it up? Reddit? Are there other, more direct, options? What are your suggestions for identifying customers who will be more than 1% inclined to respond? Do you have metrics for posting? Methods/tactics/strategies? ",
              "score": 1,
              "created_utc": "2026-02-18 04:24:55",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o614lei",
                  "author": "Popular-Penalty6719",
                  "text": "The key sentence is this: \"Start validating your ideas by talking **directly** to potential users\".  \nIt's so important to have real contacts, not \"5000 LinkedIn contacts\", people you know, who know you well. Do you have 5 people you can share your product with? That's how it starts.  \nYeah, LinkedIn (or any other social media) conversion sucks when you start because nobody knows you there.\n\nIt compounds, it starts with a few, don't rush it, just learn from their feedback and make corrections, and that will attract more, not linearly but exponentially. Just don't expect thousands of people to throw money at you the first day.",
                  "score": 2,
                  "created_utc": "2026-02-18 10:38:48",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o5zznv5",
                  "author": "Wide_Brief3025",
                  "text": "Honestly LinkedIn conversion is usually under 3 percent unless you have a super targeted message and hit the right timing. Posting on Reddit can work but only if you find threads where people are already looking for solutions. Tracking conversations using keyword alerts across multiple platforms helps spot warm leads fast and saves a ton of manual searching. I use ParseStream for this and it surfaces really solid opportunities in real time.",
                  "score": 1,
                  "created_utc": "2026-02-18 04:45:25",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5z0ql0",
          "author": "HominidSimilies",
          "text": "Spend one week building, one week marketing and selling. Let the feedback inform your build and adoption.",
          "score": 3,
          "created_utc": "2026-02-18 01:23:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5uuarh",
          "author": "Gold_Emphasis1325",
          "text": "I like these tips because I have the same problem. I've just quietly been focused on making it good and reducing surface area for what I think might be complaints. I twist friends arms to get them to give me feedback and have to push them for negative feedback. Also I ask AI assistants to be critical (albeit based on my description of how the product works) and ask it to think of possible complaints and improvements. I'm hoping for word of mouth growth, because many platforms are blocking what used to be easy marketing via social media... they either shut down your marketing or try to charge you unrealistic amounts of money. Once I am ready, I'll try to do a video demo and hope it gets lots of attention.",
          "score": 2,
          "created_utc": "2026-02-17 12:41:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5v3uj9",
          "author": "Actual-Republic2219",
          "text": "I have worked for many SaaS companies ( based out of US and UK ) as a freelancer including YC backed startup. \n\nI can help you out with the same. Share your linkedin.",
          "score": 2,
          "created_utc": "2026-02-17 13:39:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o610vhz",
          "author": "quietoddsreader",
          "text": "solo, i’d pick one channel where your users already have intent and go deep.. for b2c job stuff that might mean niche communities or very specific seo around high intent queries, not generic “career advice” content.. test small with clear metrics, cost to acquire, activation, retention.. if a channel doesn’t move those, kill it fast.. distribution is just another system, but it needs tight feedback loops like code does..",
          "score": 2,
          "created_utc": "2026-02-18 10:05:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o65vuge",
          "author": "DylanFromCheers",
          "text": "Honestly the best thing I did was pick one channel, go deep, and ignore everything else for 90 days\n\nFor us it was cold outbound to a very specific ICP. Not \"spray 10,000 emails\" cold outbound. More like 20 hyper-researched emails a week where I actually looked at their business first. Closed our first 15 customers that way.\n\nThe \"post on LinkedIn / build in public / start a community\" stuff works for some people but it's a full time job on its own and the feedback loop is really slow. You post for 3 months and maybe get a few inbound leads. Versus 20 targeted cold emails where you know within a week if the messaging resonates.\n\nFor B2C though your channel mix is different than mine (we're B2B). Job seekers are high volume low intent so you probably want to think about where they already go when they're frustrated with job searching. Reddit would actually be a good one for you. r/jobs and r/careerguidance have people venting every day about application black holes. If your product actually reduces that friction you could answer those threads genuinely and build a reputation pretty fast.\n\nOne thing I wish someone told me earlier: the channel that works is usually the one that feels uncomfortable. If you're a builder you probably want to hide behind the product. The marketing that works for technical founders is usually the stuff that forces you to talk to people directly.",
          "score": 2,
          "created_utc": "2026-02-19 01:18:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o661ryd",
              "author": "Wide_Brief3025",
              "text": "Targeted cold outbound works so well for early traction especially if you personalize every message. If you ever decide to dip into conversation driven channels like Reddit or LinkedIn, using something like ParseStream can help track the right discussions so you only engage where it matters. That way you avoid spreading yourself thin and still catch leads in real time.",
              "score": 1,
              "created_utc": "2026-02-19 01:53:17",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o675d3m",
          "author": "Difficult-Gur-3222",
          "text": "I’ve been in that exact spot. Strong technically, shipping fast, but SaaS marketing feels like a completely different universe. The advice to “do everything” or “just get a cofounder” usually drains you before anything really works.\n\nThe biggest mistake I made was trying to be a generalist. Product, copy, design, distribution all at once. Burnout shows up quietly. What helped was realizing my real job wasn’t execution, it was direction. Being clear on the goal.\n\nI stopped trying to master Figma, ads, landing pages, and content systems. Instead, I leaned on an end-to-end AI setup to handle most of the design, dev iterations, and marketing grunt work. Not to think for me. Just to remove friction. Saves time. Keeps focus where it matters.\n\nFor channels, I didn’t spray everywhere. I stayed close to where users already talk, complain, and ask for help. Real conversations. Replies and DMs mattered more than reach. That’s how I knew it was working.\n\nBiggest takeaway as a solo founder: think like a visionary, not a department. Focus on the outcome. Let the machine handle execution.",
          "score": 2,
          "created_utc": "2026-02-19 06:13:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o679dqm",
              "author": "Wide_Brief3025",
              "text": "Sticking close to where your users actually talk is huge. I found that focusing on real conversations pays off way more than blasting generic content everywhere. If you want a shortcut to spot those active discussions, ParseStream has helped me pick up on actual lead opportunities across platforms without having to constantly check each one manually.",
              "score": 1,
              "created_utc": "2026-02-19 06:47:10",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o679htt",
              "author": "SeasonAlarming968",
              "text": "Totally feel this and honestly I think you nailed the real shift that’s happening. As technical solo founders, we used to think the answer was: Just work harder and learn every function.\n\nBut that model is quietly dying. The new edge isn’t being the best copywriter + designer + media buyer + SEO person all at once. That’s a burnout speedrun. The real leverage now is exactly what you said... direction over raw execution. AI (when used right) is basically becoming the solo founder’s force multiplier. Not a brain replacement, but a friction killer.\n\nWhat I’m seeing too: The winners aren’t the ones manually grinding every asset... They’re the ones setting tight feedback loops... Staying close to real user conversations And using AI to compress the execution time between idea - test - signal\n\nYour point about replies and DMs > vanity reach is especially underrated. For early-stage SaaS, distribution is way more about proximity than scale.,.. Honestly feels like we’re moving into an era where Small, sharp founders with good taste + AI leverage  \ncan compete with whole teams that are still operating 2019 playbooks.\n\nAppreciate you sharing this... more solo builders need to hear this perspective. 💯",
              "score": 1,
              "created_utc": "2026-02-19 06:48:08",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6a98ss",
          "author": "Informal-Virus4452",
          "text": "solo founder here. the biggest trap I fell into was trying 4–5 channels at once and convincing myself I was “doing marketing.” zero depth anywhere.\n\nwhat actually worked was picking one place where my users already were and going all in there for a few weeks. conversations > content volume.\n\nfor job seekers, I’d probably start with niche reddit communities or smaller groups before touching ads. you’ll feel pretty quickly if the pain is real.\n\nI just track experiments in notion, give each channel a fixed window, and only double down if usage sticks — not just signups.\n\nwhere are your first 50 users coming from right now?",
          "score": 2,
          "created_utc": "2026-02-19 18:31:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5uglki",
          "author": "Exciting-Living-8367",
          "text": "I think at the early days of a start up you should focus on doing \"things that don't scale\" and take care of your first users much as possible to know what they want. Try to contact them with personalised emails and build your image on X and LinkedIn (it prove you're not a scam). Like this you can validate product and if you're consistent have your first 100 users. Also open your DM on linkedIn and X and add a button in your app that link to it. When you see them using your app weekly you know you found your product market fit and can go forward on the platform where your users are (for job seeker linkedin I think) and post things that interest them. You can also continue emailing if it doesn't take to much time.\n\nAlso a tips I don't see often is to approach people in real life. Maybe go to your university and try to talk with seniors at the cafe shop. ",
          "score": 3,
          "created_utc": "2026-02-17 10:54:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5vi7qt",
          "author": "RealOrdinary1344",
          "text": "My solution was to build [a product ](https://tryrebelgrowth.com)that grows itself",
          "score": 3,
          "created_utc": "2026-02-17 14:56:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5vj596",
              "author": "AccordingWeird4596",
              "text": "yeah that's smart approach",
              "score": 0,
              "created_utc": "2026-02-17 15:01:17",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5tst73",
          "author": "Automatic_Outcome832",
          "text": "In similar shoes rn, mainly focusing on LinkedIn customers that have shown the pain through comments or posts which linkedin will sorta recommend to you if you view that stuff or search for it. \n\nCreating content can help but it can be a vanity metric in starting, takes time and trust to really start paying off so a much more long term strategy. \n\nApart from this looking for signals in companies that trigger the pain point you are solving for and reaching out. I'm focusing on this right now\n\nYou also have cold mail and cold LinkedIn dms but they might not be the best fit when starting out, due to lack of market research and customer validation your positioning and ICP can be weak if not you can try that.",
          "score": 2,
          "created_utc": "2026-02-17 07:11:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5wahsd",
          "author": "Juanx68737",
          "text": "What im doing is meeting with people of my targeted audience and asking what kind of problems you would like to see if you hypothetically used my product (despite if they will use it or not). 1 suggestion from someone is a solution for like 100 people without realizing it. just keep getting feedback from your audience and reaching out ",
          "score": 1,
          "created_utc": "2026-02-17 17:17:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5yl2go",
          "author": "MundaneBase2915",
          "text": "The biggest trap when you’re a technical founder is treating marketing like a checklist instead of a system to observe. You try things, but you don’t really know if it’s improving or not, so you switch too fast or lose confidence haha\n\n\n\nThe channel that really moved things for me was Reddit and targeted content, not generic content. Just replying to posts where the problem already exists. It’s way more effective than posting into the void.\n\n\n\nThe key isn’t choosing the “right channel”, it’s choosing a channel where your ICP is already active, then observing if your actions actually improve results. For example you post 10 times. Do impressions increase. Do visits increase. Do conversions increase. If yes you continue. If not you adjust.\n\n\n\nMost founders don’t fail because they do the wrong marketing, but because they can’t read what’s happening. So they navigate on instinct.\n\n\n\nThat’s exactly why I built Decimly. It lets you clearly see if your marketing is improving or not, and which channel actually deserves your energy. Once you can visually see what works, marketing becomes much simpler man",
          "score": 1,
          "created_utc": "2026-02-17 23:57:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5ym8m1",
              "author": "Delicious_Bed_4410",
              "text": "Thank you this shares a lot of insights and i see what you did here 🫂 led by an example",
              "score": 1,
              "created_utc": "2026-02-18 00:04:15",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o614016",
              "author": "Outrageous_Knee5785",
              "text": "🤣omg good one",
              "score": 1,
              "created_utc": "2026-02-18 10:33:36",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o61lsjf",
          "author": "Ash_Skiller",
          "text": "you're asking the right questions but here's what most people miss: as a solo technical founder, you don't need to master every marketing channel. You need to pick ONE channel where your ideal users are already actively searching for solutions, then show up consistently there. For B2C job platforms, Reddit is actually one of the best options because people constantly post in career subreddits asking for job search advice, complaining about application processes, looking for tools.\n\nThese are high-intent conversations where you can actually be helpful first and mention your product second. The trick is posting genuinely useful advice (templates, strategies, tips) and casually mentioning your tool when it's relevant. The reason most founders fail at Reddit isn't lack of time, it's that they don't understand the culture.\n\nYou get one slightly promotional comment wrong and you're shadowbanned from the subreddit. So validation becomes hard because you're risking your account every time you test. Here's the structured approach: spend 2 weeks just commenting helpful stuff in r/jobs, r/resumes, r/careerguidance without mentioning your product once.\n\nBuild some karma and learn what questions come up repeatedly. Then start occasionally mentioning your platform when it genuinely solves the exact problem someone posted about. Track clicks from your bio link or a simple tracking URL.\n\nIf you really don't want to do this yourself or already tried and got flagged, some B2B companies just use a done-for-you service that handles the research and posting without the spam risk. I've heard good things about Community Mentions for this kind of thing, they basically do Reddit engagement as a service so you don't have to worry about getting banned or spending hours finding the right threads. But even if you go solo on this, the key is committing to one channel for at least 90 days before judging results.\n\nReddit compounds over time becuase your old helpful comments keep getting found in search.",
          "score": 1,
          "created_utc": "2026-02-18 12:48:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o64oyjd",
          "author": "Proud-Macaroon-3667",
          "text": "Solo founder here - for me it was all about getting super skilled to where i knew the ins and outs of a certain channel. As a consumer app founder social media was something i dove head first into. i was trash at first but soon enough i was pulling in viral vids. as a result i got really skilled and started to bring in enough traffic where i could outsource it. But here is the key thing to note - i was constantly coaching up the person that i hired so that they could have the subject matter expertise and hit the mktg the right way. I think this is required for any hire tbh and had i not figured out how to handle that aspect of the business first i would have just been pouring away time and money",
          "score": 1,
          "created_utc": "2026-02-18 21:35:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o65u2ts",
          "author": "Flashy-Cat8050",
          "text": "We're actually using our own product to advertise and get customers. It's been pretty great so far [https://cambrian.ad/](https://cambrian.ad/) happy to chat more about it :) ",
          "score": 1,
          "created_utc": "2026-02-19 01:08:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o674psi",
          "author": "BusinessStrategist",
          "text": "Your obstacle is being very strong “technically.”\n\nIt usually means that your “people”skills are very poor and that you probably know very little about “business.”\n\nTech can be very challenging and can take up all of your valuable time.\n\nThe first question is so very simple.\n\nGoogle “Job To Be Done.”\n\nAsk AI to summarize the book.\n\nCan you put yourself in the shoes of YOUR “ideal” customer/client?\n\nWhat compelling “need or want” are you satisfying?\n\nBe VERY specific!",
          "score": 1,
          "created_utc": "2026-02-19 06:08:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6drjna",
          "author": "Background-Might3453",
          "text": "tbh SaaS marketing felt fake to me for a long time too. what finally helped was picking one channel that matched how users already behave and ignoring the rest.\n\nngl most advice is noise until you see even a tiny signal. i tested small, tracked one metric that mattered, then doubled down. everything else was a distraction.",
          "score": 1,
          "created_utc": "2026-02-20 06:58:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ii3kw",
          "author": "Suspicious_Syrup8694",
          "text": "j'avoue que c'est vraiment frustrant , surtout le syndrome de la page blanche,  quand tu ne sais pas par où commncer , mais perso j'utilise l'ia pour me guider Gemini pour me donner des conseils, mais l'outil numéro que je te recommanderais serait : (maark - AI marketing consultant) , il t'aide à créer ta strategie marketing de A à Z tu devrais l'essayer ça pourrait vous aider ",
          "score": 1,
          "created_utc": "2026-02-20 23:31:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6kmn1f",
          "author": "sluglime63",
          "text": "Idk but I think you should",
          "score": 1,
          "created_utc": "2026-02-21 08:44:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ltgdb",
          "author": "Suitable-Program-181",
          "text": "Marketing is my posion.",
          "score": 1,
          "created_utc": "2026-02-21 14:35:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6myl7d",
          "author": "ranger989",
          "text": "For the first 100 it’s personal outreach and sales. Hold every hand. \n\nAfter that I automate as much as possible. Your time is the critical resource so the more it can self optimize the better. Some tools I use:\n\n\t1.\tCakewalk.ai — Automated SEO and AEO content generation\n\t2.\tGojiberry AI — AI intent-based lead discovery and outreach\n\t3.\tInstantly.ai — Automated cold email at scale\n\t4.\tBuffer — Automated social media scheduling\n\t5.\tCustomer.io — Event-driven lifecycle messaging\n\t6.\tOpus Clip — AI video repurposing for social\n\t7.\tZapier — Workflow automation across your stack\n\t8.\tClaude Code — Build custom automations with MCPs: Slack, GitHub, Google Drive, Stripe, HubSpot, Notion, Linear, PostgreSQL, Puppeteer​​​​​​​​​​​​​​​​",
          "score": 1,
          "created_utc": "2026-02-21 18:06:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6nbq2s",
              "author": "Wide_Brief3025",
              "text": "Automating outreach and monitoring is a game changer once you go past the early manual stage. One thing that really helped me scale was using alerts for relevant conversations happening in real time across platforms. If you find yourself missing out on discussions, ParseStream can surface these opportunities so you can engage right when it matters.",
              "score": 2,
              "created_utc": "2026-02-21 19:10:53",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6szijr",
                  "author": "ranger989",
                  "text": "I like ParseStream. I’ll add to my list!",
                  "score": 1,
                  "created_utc": "2026-02-22 17:25:29",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6po17s",
          "author": "NoLanSym",
          "text": "learning loads - failing often. Also newcopy.ai",
          "score": 1,
          "created_utc": "2026-02-22 03:21:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6qlqnj",
          "author": "enthusiast_bob",
          "text": "To be honest sometimes you just need to get lucky. I think I've been in the same boat as you for the last 15 years. I've always been strong technically, but going on one podcast and talking about what I built literally tipped the scale.   \nI know this is not helpful advice per se, but the meta point is keep at it consistently. Don't give up, and you'll eventually figure out the techniques needed to luck out",
          "score": 1,
          "created_utc": "2026-02-22 07:54:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5txplq",
          "author": "ApprehensiveCry7955",
          "text": "Well Honestly as doing the marketing alone, we are doing some crazy ideas to just get to know about the product.\n\nEven one of the guy I'm talking to said, nice marketing tatic once he found out that this is marketing, but I would say 9/10 are not even able to find out whether this is marketing tactic and fall right under the crazy idea that we are doing & get to know about the product & even signup as well.",
          "score": 1,
          "created_utc": "2026-02-17 07:56:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5ubejv",
              "author": "Relevant-Scene6663",
              "text": "doing something crazy can give you some good results, as everyone knows even for reddit in the initial phase when it launched, the founders manually commented on real users post & comment from fake ones.\n\nso keep it up can you tell me what you are building, that you have to come up with crazy idea to market it ?\n\n",
              "score": 3,
              "created_utc": "2026-02-17 10:07:29",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5ublzw",
                  "author": "ApprehensiveCry7955",
                  "text": "yeh totally i heard about this & tbh this idea came from actually iterating a lot with my team and then we came up with this.",
                  "score": 2,
                  "created_utc": "2026-02-17 10:09:22",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o5uak3a",
              "author": "Wonderful_Joke_9953",
              "text": "Well This seems something interesting, I would like to know exactly what you are doing.",
              "score": 2,
              "created_utc": "2026-02-17 09:59:43",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5uapxn",
                  "author": "ApprehensiveCry7955",
                  "text": "Cool, let me know what are you working on & see you in chat",
                  "score": 1,
                  "created_utc": "2026-02-17 10:01:10",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o5uayji",
              "author": "Sweaty_Expert_9997",
              "text": "Well If 9/10 are not able to figure it out then this tactic must be good, curious to know how do you come up with it ?",
              "score": 2,
              "created_utc": "2026-02-17 10:03:23",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5ucw6e",
                  "author": "ApprehensiveCry7955",
                  "text": "Yup it's working fine for now, actually there is a little long story behind it, let's catchup in discussion will tell you there.",
                  "score": 2,
                  "created_utc": "2026-02-17 10:21:10",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1racv4y",
      "title": "post your app/startup on these subreddits",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1racv4y/post_your_appstartup_on_these_subreddits/",
      "author": "Ok-Engine-172",
      "created_utc": "2026-02-21 00:41:22",
      "score": 69,
      "num_comments": 14,
      "upvote_ratio": 0.85,
      "text": "post your app/startup on these subreddits:\n\nr/InternetIsBeautiful (17M)\nr/Entrepreneur (4.8M)\nr/productivity (4M)\nr/business (2.5M)\nr/smallbusiness (2.2M)\nr/startups (2.0M)\nr/passive_income (1.0M)\nr/EntrepreneurRideAlong (593K)\nr/SideProject (430K)\nr/Business_Ideas (359K)\nr/SaaS (341K)\nr/startup (267K)\nr/Startup_Ideas (241K)\nr/thesidehustle (184K)\nr/juststart (170K)\nr/MicroSaas (155K)\nr/ycombinator (132K)\nr/Entrepreneurs (110K)\nr/indiehackers (91K)\nr/GrowthHacking (77K)\nr/AppIdeas (74K)\nr/growmybusiness (63K)\nr/buildinpublic (55K)\nr/micro_saas (52K)\nr/Solopreneur (43K)\nr/vibecoding (35K)\nr/startup_resources (33K)\nr/indiebiz (29K)\nr/AlphaandBetaUsers (21K)\nr/scaleinpublic (11K)\n\n100+ Reddit self-promotion posts without a ban (Database) \n\nthank me after you get an additional 10k+ sign ups.\n\nBye!! \n\n\n\n\n\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1racv4y/post_your_appstartup_on_these_subreddits/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o6jylk8",
          "author": "-listnr",
          "text": "Lol, I got permabanned from r/InternetIsBeautiful thanks to this list.",
          "score": 7,
          "created_utc": "2026-02-21 05:07:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6iyxkx",
          "author": "hau5keeping",
          "text": "This sucks",
          "score": 10,
          "created_utc": "2026-02-21 01:09:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6izdpy",
              "author": "ultimate_bulter",
              "text": "why?",
              "score": 1,
              "created_utc": "2026-02-21 01:12:41",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6kjwrw",
                  "author": "Darius1182",
                  "text": "Moderators take posts down, that's why. And it depends on what subs you go to. Not all are open to promotion.",
                  "score": 3,
                  "created_utc": "2026-02-21 08:17:36",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6j28da",
          "author": "vivekghartan",
          "text": "The problem is not joining; things get difficult when people are not able to talk about their products. That's what a startup founder is looking to connect and discuss with other people.   \nIf you agree with me, you can comment. ",
          "score": 1,
          "created_utc": "2026-02-21 01:30:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6lh6qx",
          "author": "Minimum-Alps2753",
          "text": "Some of these subs are indeed useful, but it's not possible to mention your product on all the ones you added here. ",
          "score": 1,
          "created_utc": "2026-02-21 13:19:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ls9k8",
          "author": "thelionskywalker",
          "text": "It should be mentioned in the top that one have to read the rules and be very careful about following them. And that it takes a lot of time creating specific posts that suits the exact culture of that sub.",
          "score": 1,
          "created_utc": "2026-02-21 14:28:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6jq1yy",
          "author": "MingleMinds",
          "text": "Much appreciated.",
          "score": 0,
          "created_utc": "2026-02-21 04:04:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6k0es4",
          "author": "Love-story2025",
          "text": "Thank you! I'll definitely use these to post my app!!",
          "score": 0,
          "created_utc": "2026-02-21 05:21:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6iweg3",
          "author": "Ok-Engine-172",
          "text": "These are another 400+ places where you can list your product for backlinks and traffic. I also collected a database of 100 self-promo Reddit posts that weren't banned on Reddit, and some cool marketing templates to make marketing easy  [download](http://www.marketingpack.store)",
          "score": -6,
          "created_utc": "2026-02-21 00:54:21",
          "is_submitter": true,
          "replies": []
        }
      ]
    },
    {
      "id": "1r8zaht",
      "title": "How did you make your first dollar as a Startup Owner?",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1r8zaht/how_did_you_make_your_first_dollar_as_a_startup/",
      "author": "ChallengeExcellent62",
      "created_utc": "2026-02-19 13:32:20",
      "score": 56,
      "num_comments": 42,
      "upvote_ratio": 0.91,
      "text": "It's brutal, I have lived in my own dreamy world where if you solved a problem people would happily buy it.\n\nIt's not that easy, getting even 100 signups to a product which is a new concept is hard af. To me selling always felt easy but after I have actually shipped something it feels the hardest.\n\nHow did you earn your first dollar as a Founder?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1r8zaht/how_did_you_make_your_first_dollar_as_a_startup/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o69u8n8",
          "author": "AnyExit8486",
          "text": "first dollar usually comes from conversation, not conversion.\n\nmost people try to get 100 strangers to sign up.  \nthe founders who make their first dollar talk to 10 people directly.\n\nmy pattern has always been:\n\n– find 5–10 people with the problem  \n– don’t pitch the product  \n– ask how they’re solving it now  \n– offer to fix it manually\n\nsometimes that means doing it as a service first.  \nsometimes that means charging before the product is fully built.\n\nyour first dollar is rarely scalable.  \nit’s usually scrappy, manual, and slightly uncomfortable.\n\nalso new concepts are 10x harder. if you have to educate the market and sell at the same time, it’s brutal. positioning it as “this replaces x” instead of “this is a new thing” lowers friction a lot.\n\nwhat worked for you before when selling felt easy? was it because demand was already obvious?",
          "score": 25,
          "created_utc": "2026-02-19 17:20:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o69yp2j",
              "author": "ChallengeExcellent62",
              "text": "Selling felt easy in my mind.",
              "score": 1,
              "created_utc": "2026-02-19 17:41:43",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6e9w5u",
                  "author": "TheBlip1",
                  "text": "Depends on what you're selling. If people already want it then it's easy. If people can't see the value yet or it is a new thing then it is much harder.",
                  "score": 1,
                  "created_utc": "2026-02-20 09:50:10",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o69n666",
          "author": "Logical-Reputation46",
          "text": "Get a part time job to extend your runway as much as possible. The longer you stay in the game, the more likely you are to achieve success in your startup.",
          "score": 14,
          "created_utc": "2026-02-19 16:46:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o69lj9r",
          "author": "ReporterCalm6238",
          "text": "we just closed our first b2b contract worth $1250. We found our lead going to conferences and talking to people irl. Everything else (emails, linkedin, reddit, ads) did not work for us. I think all these channels are just saturated. I remember cold emailing 10 years ago I was getting 30% response rate. Now nothing. Wake up people, it's a distribution game. Partner up with influencers, go meet people, organize events, grow a huge audience, get backed by a famous VC that give you visibility. These are the channels that work.",
          "score": 11,
          "created_utc": "2026-02-19 16:38:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o69ytwy",
              "author": "ChallengeExcellent62",
              "text": "Oh that's a cool insight, what have you built?",
              "score": 1,
              "created_utc": "2026-02-19 17:42:22",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o68mez9",
          "author": "No_Month8031",
          "text": "I am in the same situation . My product is more for buisnesses so I go talk to them , but ngl close them is very hard . \n\nTry to focus on one acquisition canal and try to crack it and crack what ur customers wants to hear and what they wait from a product like urs.\n\nGood luck !",
          "score": 7,
          "created_utc": "2026-02-19 13:37:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o68mor5",
              "author": "ChallengeExcellent62",
              "text": "Saas is like a deathbed for me, you have to build the perfect product before anyone uses it. \n\nThat's why I'm building D2C",
              "score": 2,
              "created_utc": "2026-02-19 13:39:26",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o68mpe2",
              "author": "ChallengeExcellent62",
              "text": "Saas is like a deathbed for me, you have to build the perfect product before anyone uses it. \n\nThat's why I'm building D2C",
              "score": 1,
              "created_utc": "2026-02-19 13:39:32",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o68tjvj",
                  "author": "Alternative-Radish-3",
                  "text": "You need eyeballs on your product then, social media in particular. It's full of scammers and bait and switch, so not easy either, but it's the way to get in front of your customers. They won't be able to find you otherwise",
                  "score": 3,
                  "created_utc": "2026-02-19 14:17:41",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o68s76i",
          "author": "No_Month8031",
          "text": "I dont really agree with you cuz if you have a SaaS that resolves a real pain point u just need that feature that solves it and after by talking to customers change it until you create the \"perfect\" product.\nBtw what u buildin?",
          "score": 6,
          "created_utc": "2026-02-19 14:10:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6j33vz",
              "author": "vivekghartan",
              "text": "Even if you resolve a real pain point and you deliver a perfect product, you might not make money there. For example, we solved a problem of fraud and scam prevention using DefenceNet, you would agree that this is a big issue right now and some billion dollar industry.  \n   \nare there too many players - no..  \nis your product effective and working -- yes..  \nare people getting fraud incidents - almost daily (Canada lost 645M in 2024 only )  \n  \nWill people pay for the mobile app -- no, why   \nbecause they are looking for a freemium model.  ",
              "score": 2,
              "created_utc": "2026-02-21 01:36:08",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o695wn1",
          "author": "edkang99",
          "text": "I used to build then sell. Now for every startup I sell before I build. Thats how I make the first dollar. It may not hit my bank but it’s waiting. Or I sell the solution in another form like a book or manual consulting.",
          "score": 2,
          "created_utc": "2026-02-19 15:22:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ah6gj",
          "author": "CyberStartupGuy",
          "text": "Did you talk with prospective customers before you built whatever you shipped? Usually those design partners are the first to give you money after you build the thing they had a pain point for. ",
          "score": 2,
          "created_utc": "2026-02-19 19:08:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6al8hd",
          "author": "Forsaken_Lie_8606",
          "text": "tbh yeah, thats a common pain in getting those initial signups, i remember when i first launched my startup, it took us like 3 months to get our first 100 paid customers, and it was a huge struggle, we%shad to manually reach out to people, attend conferences, and do a ton of customer development to get feedback and iterate on our product, but the key thing that worked for us was identifying a specific niche within our target market and focusing all our efforts on that, we found that by solving a very specific pain point for a small group of people, we were able to get traction and then expand from there, ngl its still hard but it gets easier once you find that initial momentum",
          "score": 2,
          "created_utc": "2026-02-19 19:27:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6dua7o",
          "author": "SystemicCharles",
          "text": "I called 🤳🏽 the Federal Reserve and asked for instructions on how to make my first dollar at home\n\nOn a serious note, it's really not that hard. Get comfortable with shamelessly promoting your product or yourself. And get even more comfortable talking to strangers even if you get rejected a million times. Nobody is going to come to your house and make your dreams come true.",
          "score": 2,
          "created_utc": "2026-02-20 07:23:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o68ybcq",
          "author": "andynadal_",
          "text": "My app Pausa is an App with in-app subscriptions, so my priority was to get an MVP done as fast as possible with monetization ready, so when launched my family and friends subscribed, so that's how I made my first dollar, now you might be interested in the first person I didn't know who pay for my product, that actually came from SEO, so building a strong landing page was also very important",
          "score": 2,
          "created_utc": "2026-02-19 14:43:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o68zdq9",
              "author": "No_Month8031",
              "text": "Yep that is tru SEO helps a lot if you know how it works",
              "score": 0,
              "created_utc": "2026-02-19 14:49:02",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o69gz9v",
          "author": "Rishi_445",
          "text": "get your friends and family to actually pay for your product",
          "score": 2,
          "created_utc": "2026-02-19 16:16:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6jgul9",
              "author": "Just_Oil_2162",
              "text": "this is lwk a method",
              "score": 2,
              "created_utc": "2026-02-21 03:02:41",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6ahxvl",
          "author": "Costheparacetemol",
          "text": "Trade show exhibition w/ demo -> signups -> kept in contact and did more customer  development -> when had MVP, did online demo walkthroughs, about 10 months later on from trade show had fist paying customers.\nIn parallel we were cold calling and interview, doing research including customer onsite shadowing and even did a little work for some early pre-customers as we learned their workflows. \n\nBest of luck!",
          "score": 1,
          "created_utc": "2026-02-19 19:12:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6clvu2",
          "author": "laron290",
          "text": "Yes",
          "score": 1,
          "created_utc": "2026-02-20 01:58:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6d3plg",
          "author": "swapnilmanex",
          "text": "We built Booklane app for second hand books and we got sponsored books from authors. We sponsored them and then we have added admob so we got some earning from there and recently we have added delivery system as well in particular cities. Where as a co founder we deliver the books. This is how we making money in dollars...",
          "score": 1,
          "created_utc": "2026-02-20 03:50:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6dx1hx",
          "author": "nriques",
          "text": "I start to realize one has to chase users. Build in Public is overused and viewers got desensitized.",
          "score": 1,
          "created_utc": "2026-02-20 07:48:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6dz2u4",
          "author": "Harris04251998",
          "text": "yeah i felt the same after shipping my first thing, 100 signups sounded doable until i realized most \"problem\" posts are just people venting, not buying\n\nmy first dollar came from manually scanning subreddits for 3 hours a day spotting real intent signals like \"looking for tool x\" or budget mentions, then jumping in those threads with genuine comments that built trust before mentioning anything\n\ntalk to 5-10 of those high-intent folks directly instead of chasing cold signups, it flips the script fast",
          "score": 1,
          "created_utc": "2026-02-20 08:07:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6e8jjt",
          "author": "ApprehensiveCry7955",
          "text": "This hits hard.\n\nI used to believe the same thing, build something genuinely useful and people will automatically show up. Shipping completely breaks that illusion.\n\nBuilding is logic. Distribution is psychology. And psychology is messy.\n\nGetting even the first 50–100 signups for a *new* concept feels harder than writing the product itself, especially when there’s no existing category or demand to ride on. Selling in theory feels easy; selling *your own thing* is emotionally brutal because every “no” feels personal.\n\nMy first dollar didn’t come from scaling or funnels, it came from manually talking to users, understanding why they *didn’t* care yet, and reshaping the story until one person finally did.\n\nCurious to hear others’ stories too, first dollar moments are wildly different, but they all seem to involve discomfort.",
          "score": 1,
          "created_utc": "2026-02-20 09:37:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6fmcgz",
          "author": "PowerDue2448",
          "text": "B2B SMB VSaaS here. \n\nGot my „first euro“ by being me and authentic. (Offer aside duh) \n\nI thought theres a magic bullet by reading Hormozi and alike and you know … just ABC and Hustling. 🙄\n\nTurns out its a great starting point and an Important mindset for yourself. \n\nHowever being a decent human being, engaging in real conversations where Im not pushing for a sale but to geniuenly trying to figure out through thoughtful questions, if I can be of help to the other person has increased my chances of success way more than any framework or toolkit. \n\nAuthenticity sells in the age of AI slop and Quota Driven Sales-Orgs. \n\nStill trying to figure out how to scale „being a decent human“. \n\nMy 2 cents.",
          "score": 1,
          "created_utc": "2026-02-20 15:10:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6k30m8",
          "author": "quietoddsreader",
          "text": "my first dollar came from manually selling to one real person with a painful problem, not from signups, because revenue starts with conversations not traffic..",
          "score": 1,
          "created_utc": "2026-02-21 05:42:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6nqffy",
          "author": "Important_Winner_477",
          "text": "It fully depends on what kind of startup you are running. I own a 'high-trust' startup, which requires building a lot of trust with businesses before even talking about sales. I have to educate them, teach them, and actually solve some of their problems first by investing my time in them. I help them avoid the mistakes I’ve already learned from. After a lot of back and forth, I can eventually propose my service, but until then, I just let them know I run this type of business. The good part is that this only sucks at the very beginning. Once I have a solid reputation and real case studies, I won't have to spend nearly as much time convincing people the work will speak for itself.",
          "score": 1,
          "created_utc": "2026-02-21 20:27:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6sirre",
          "author": "ArtichokeFew6941",
          "text": "1997 - Valuebin.com. 🤟👀",
          "score": 1,
          "created_utc": "2026-02-22 16:09:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o696m8k",
          "author": "LunchZestyclose",
          "text": "Sending invoices.",
          "score": 0,
          "created_utc": "2026-02-19 15:26:05",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rbt5hy",
      "title": "have a rare autoimmune disease (MG). I couldn't find a decent tool to track it, so I built my own. Here is what I’ve learned in 4 days",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1rbt5hy/have_a_rare_autoimmune_disease_mg_i_couldnt_find/",
      "author": "AfternoonOne9957",
      "created_utc": "2026-02-22 18:18:57",
      "score": 20,
      "num_comments": 16,
      "upvote_ratio": 0.93,
      "text": "I wanted to share a project born out of necessity. Three years ago, I was diagnosed with **Myasthenia Gravis (MG)** a rare autoimmune condition affecting about 14 in 100,000 people.\n\nAs a developer, I was frustrated. Every tool I found for tracking symptoms was either clunky, ad-heavy, or lacked the specific medical assessments we actually need to show our neurologists.\n\nSo, I built a dedicated platform for the community. It is 100% free and non-commercial. I’m not here to sell anything; I’m here to share the reality of launching a niche, mission-driven project.\n\n**The \"Day 4\" Numbers:**\n\n* **Organic Growth:** 500+ unique visitors with $0 spent on marketing.\n* **Retention Signal:** Average session duration is 5**m 50s**.\n* **Bounce rate**: 30%\n\n**Why I’m sharing this here:** A lot of entrepreneurship is about finding a massive market, but there is something to be said for building deep for a small, underserved community.\n\n**I’d love to hear from other founders:**\n\n1. How do you build trust quickly when dealing with sensitive health data?\n2. If you’ve built for \"rare\" niches, how do you handle scaling when your market is physically limited?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1rbt5hy/have_a_rare_autoimmune_disease_mg_i_couldnt_find/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o6tbfau",
          "author": "Khushboo1324",
          "text": "Respect for turning something personal into a project idea. a lot of meaningful startups start exactly this way… frustration first, solution later.\n\nRare disease spaces especially feel underserved because information is scattered and most products optimise for common conditions. so even small tools that improve tracking, understanding, or community can have real impact.\n\nIf you haven’t already, talking to a few other MG patients could be huge. sometimes the problem you felt alone in turns out to be shared but unarticulated. those conversations often shape the product more than initial assumptions.\n\nAlso don’t underestimate lived experience as an advantage here. you understand nuances outsiders would miss.\n\nCurious what part of the journey made you feel “this needs to exist” the most.",
          "score": 2,
          "created_utc": "2026-02-22 18:20:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6tc8e1",
              "author": "AfternoonOne9957",
              "text": "There is no good tool to track and understand this disease, its very underserved and rare and it has no typical medication, it also has flactuations and it depends on what u ate, drink etc... So I wanted to build something where I could track all this and analyze patterns triggers etc.. ",
              "score": 1,
              "created_utc": "2026-02-22 18:24:06",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6tdtcz",
                  "author": "Khushboo1324",
                  "text": "really appreciable !!",
                  "score": 1,
                  "created_utc": "2026-02-22 18:31:20",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6tl57w",
          "author": "imsimchi",
          "text": "YC gonna love you bro😭",
          "score": 1,
          "created_utc": "2026-02-22 19:05:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6tnucr",
              "author": "AfternoonOne9957",
              "text": "Really?",
              "score": 1,
              "created_utc": "2026-02-22 19:18:10",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6tnxj6",
                  "author": "imsimchi",
                  "text": "Yeah especially because you understand the problem",
                  "score": 1,
                  "created_utc": "2026-02-22 19:18:36",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6ukpnd",
          "author": "imsimchi",
          "text": "w",
          "score": 1,
          "created_utc": "2026-02-22 22:03:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6uv7xy",
          "author": "CommonReasonable7287",
          "text": "Do you have a link to your app?? I have a cousin with the same condition, and I want to recommend it to him",
          "score": 1,
          "created_utc": "2026-02-22 22:59:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6we5tb",
              "author": "AfternoonOne9957",
              "text": "Its imulogy.com",
              "score": 1,
              "created_utc": "2026-02-23 04:33:58",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6vkgkv",
          "author": "Elegant_Mail",
          "text": "I would write the post without using ai",
          "score": 1,
          "created_utc": "2026-02-23 01:24:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6we8lu",
              "author": "AfternoonOne9957",
              "text": "I am using AI to polish my grammar mistake, english is not my first language :D but yeah I am working on it I also don’t like the structure of my story its a bit robotic. Thanks for advice!",
              "score": 1,
              "created_utc": "2026-02-23 04:34:32",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6whach",
                  "author": "Elegant_Mail",
                  "text": "That's fair. I kinda miss the time where even if it was a foreign speaker I knew I was hearing the direct thoughts of a person",
                  "score": 1,
                  "created_utc": "2026-02-23 04:56:53",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6xp0od",
          "author": "quietoddsreader",
          "text": "in sensitive health niches trust comes from radical transparency (who built it, how data is stored, why it’s free) and even if the market is small depth > scale because becoming the default tool for 10% of a rare community is already meaningful traction..",
          "score": 1,
          "created_utc": "2026-02-23 11:35:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6xzcg9",
              "author": "AfternoonOne9957",
              "text": "Thank you very much for the feedback! ",
              "score": 1,
              "created_utc": "2026-02-23 12:53:32",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1r76190",
      "title": "I’m doing international sales from scratch and nothing is working. how do people actually get clients?",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1r76190/im_doing_international_sales_from_scratch_and/",
      "author": "Ok-University-2605",
      "created_utc": "2026-02-17 13:29:48",
      "score": 17,
      "num_comments": 49,
      "upvote_ratio": 0.95,
      "text": "Hi everyone,\n\nI’m honestly stuck and dont know what to do.\n\nI started working 4 moths ago for a company based in Turkey that produces multiple industrial products. My role is to find international customers and generate sales. The problem is… I’m basically starting from zero, with no previous experiences, no training, and no one to guide me.\n\nI’ve been tried everything I know and learned so far:\n\n\\- Sending cold emails after using AI to find my targeted markets\n\n\\- Searching participants in the fairs that are related to our companies producs and email them (almost no replies)  \n\\- Finding and connecting with people on LinkedIn ( they werent interested )\n\n\\- i even tried reaching on other social media platforms. and most importantly i tried to be presistant and sent follow up emails and messages multiple times.\n\nI really don’t know what I’m doing wrong. But it starting to feel like i keep using the wrong strategies over and over again..\n\nThe company started pushing me recently to do something about it, and they are right. but I’m still trying to figure out how to even get my first serious conversation.\n\nfor now I’m supposed to sell different product categories, I’m responsible for selling stainless steel food production machinery and their manufactured confectionery products, as well as industrial systems for gas generation, air treatment, lazer weding machines, and coating/paint application equipments... and in the future it am expected to sell other products too.\n\nHow do I break this cycle and move up to the point where I can actually call myself a salesperson? what am i doing wrong and what do i need to work on to be successful in the field and get past the phase where everything is ignored to finally closing deals?\n\nI really need guidance here.\n\nThank you",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1r76190/im_doing_international_sales_from_scratch_and/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o5vavj9",
          "author": "UpperIndependence609",
          "text": "The problem is that you sound like a typical salesperson. **Focus not on what you want, but what the opposite person – or company wants.** Instead of saying: hey I got this nice product, want to buy it? Write: Hi, I noticed you're still using those old and expensive machines from our competitor. I can offer you better, cheaper products with a discount.",
          "score": 11,
          "created_utc": "2026-02-17 14:17:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5vdvzh",
              "author": "Ok-University-2605",
              "text": "Ohhhh okeyyyy that’s smarter",
              "score": 2,
              "created_utc": "2026-02-17 14:34:16",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5vhuat",
                  "author": "UpperIndependence609",
                  "text": "I recommend you read \"How to Win Friends and Influence People\" by Dale Carnegie. You will be surprised. It's also never wrong to just ask colleagues who have many sales or have more experience. They will teach you some tips and tricks you didn't know.",
                  "score": 4,
                  "created_utc": "2026-02-17 14:54:44",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5vfhe5",
          "author": "Important_Winner_477",
          "text": "starting from zero is brutal. I do Penetration Testing so I also deal with high trust sales where cold emails usually just get marked as spam.\n\nWhat started working for me is a 4-7-8 strategy. It is a slow burn but it actually gets people on the phone.\n\nBasically:\n\n4 Platforms: My ICP has to see me on 4 different spots. If they see you on LinkedIn, then a technical forum, then maybe a video of your machinery... you look like an authority, not a rando.\n\n7 Hours: They need to consume about 7 hours of your content. Since you sell machinery, maybe post technical videos of the laser welding or gas systems in action. Let them see the quality before you ask for a check.\n\n8 Touches: Interact with them 8 times. Do not just pitch. Comment on their posts, share a solution to a problem they mentioned, or send them a manual they might actually need.\n\nI havent closed a lead yet, but I went from 0 calls to 7 discovery calls just by switching to this. It is way better to have 7 people who actually want to talk to you than 1000 people ignoring your cold emails.",
          "score": 4,
          "created_utc": "2026-02-17 14:42:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5vhga4",
              "author": "Ok-University-2605",
              "text": "Thank you \nI will try this 🙏 \nGood luck to you too 🤗",
              "score": 1,
              "created_utc": "2026-02-17 14:52:46",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5vjh8a",
                  "author": "Important_Winner_477",
                  "text": "let knew your result because I want to knew do this only work for or will work for you as well",
                  "score": 1,
                  "created_utc": "2026-02-17 15:02:58",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o5x1hwh",
              "author": "Resident_Cookie_7005",
              "text": "I like that approach, how do you keep up with so many platforms and producing so much content?",
              "score": 1,
              "created_utc": "2026-02-17 19:23:11",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o5x8vva",
                  "author": "Important_Winner_477",
                  "text": "In the starting quality volume is key. currently in process of creating this into full actionnal framework for my company I will share that with if you want.",
                  "score": 1,
                  "created_utc": "2026-02-17 19:57:52",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o5vr9jj",
              "author": "Wide_Brief3025",
              "text": "The multi touch approach you use is spot on for building trust, especially in security sales. I found that staying consistent on platforms your clients actually use saves a ton of time. Having a tool like ParseStream to monitor conversations and get real time alerts when relevant topics come up let me jump into discussions I would have missed otherwise. It really helps with targeting those high trust opportunities without spamming people.",
              "score": 0,
              "created_utc": "2026-02-17 15:41:20",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5vb2vf",
          "author": "Fancy_Bake_4268",
          "text": "Hmm why should they buy?",
          "score": 2,
          "created_utc": "2026-02-17 14:19:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5vdnd8",
              "author": "Ok-University-2605",
              "text": "The food production machineries they sell come with competitive prices, and they’re installed in so many cities In turkey, they just want to make international. \nSame thing with the other product which works with gas systems, but it’s more innovative and has many more advantages to companies that uses them . \nReally these products are great, yet I fail to make one sale 🥲",
              "score": 0,
              "created_utc": "2026-02-17 14:32:58",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o63uj3d",
          "author": "Forsaken_Lie_8606",
          "text": "i was in a similar situation a few years ago, trying to get clients for my own startup, and i realized that the key is to focus on building relationships rather than just sending out cold emails or messages. i started attending industry events and conferences, and i made a point to actually talk to people and learn about their businesses, rather than just trying to pitch mine. its weird, but once you start to care about what theyre doing, they start to care about what youre doing too, lol. anyway, i think you might want to try to find some trade shows or conferences that are relevant to your industry and just go there to learn and meet people, its been a game changer for me good luck with it",
          "score": 2,
          "created_utc": "2026-02-18 19:13:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6976m4",
              "author": "Ok-University-2605",
              "text": "thank you so much",
              "score": 2,
              "created_utc": "2026-02-19 15:28:55",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o5w0y3x",
          "author": "Luangprebang",
          "text": "Setup OpenClaw and tell it to book you calls with potential customers. ",
          "score": 1,
          "created_utc": "2026-02-17 16:29:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5xcl88",
          "author": "Livid-Savings-5152",
          "text": "Do you have any evidence that the people you’re contacting have a strong desire to buy your product?",
          "score": 1,
          "created_utc": "2026-02-17 20:15:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o696gsg",
              "author": "Ok-University-2605",
              "text": "unfortunately no",
              "score": 1,
              "created_utc": "2026-02-19 15:25:20",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6dtmjc",
                  "author": "Livid-Savings-5152",
                  "text": "Speaking from experience here, next time, sell before you build. Otherwise you end up building something you can’t sell.",
                  "score": 1,
                  "created_utc": "2026-02-20 07:17:12",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5ypit1",
          "author": "kubrador",
          "text": "you're selling five completely different product categories to international markets with zero experience and wondering why nobody's picking up. that's like asking why your shotgun approach isn't working when you're aiming at five different targets.\n\n\n\npick one thing, get obsessed with it, and actually learn who buys it and why. then maybe call people instead of just emailing into the void.",
          "score": 1,
          "created_utc": "2026-02-18 00:22:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6971mp",
              "author": "Ok-University-2605",
              "text": "i try to not do them all at the same time, for example i dedicate day 1 for product A and day 2 for product B and so on.. but still i dont know what else im doing wrong",
              "score": 1,
              "created_utc": "2026-02-19 15:28:14",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o64bp71",
          "author": "Healthy_Library1357",
          "text": "you’re not bad at sales. you’re selling way too many unrelated products at once. stainless steel food machinery, gas systems, laser welding, coatings… that’s like 4 different ICPs with 4 different pains. no wonder cold outreach isn’t landing. pick one category. one specific buyer. one problem. then go deep. also stop pitching features. industrial buyers care about cost savings, downtime reduction, compliance, and ROI. if your email doesn’t clearly say how you make them more money or save them money, it goes straight to trash. before sending another cold email, answer this clearly for one product: who exactly feels the pain, what does it cost them today, and why should they trust a Turkish supplier over their current one. if you can’t answer that in one tight paragraph, that’s the real gap.",
          "score": 1,
          "created_utc": "2026-02-18 20:33:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6986wk",
              "author": "Ok-University-2605",
              "text": "i try to make the emails genunie and i make sure to include all the benefits you mentioned ..\n\nand im sorry i coudnt find answers to your questions",
              "score": 1,
              "created_utc": "2026-02-19 15:34:00",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o66c8v2",
          "author": "Dickskingoalzz",
          "text": "You don’t have any marketing?",
          "score": 1,
          "created_utc": "2026-02-19 02:53:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o698gap",
              "author": "Ok-University-2605",
              "text": "we do. the company is doing fine and it has many salespersons too. im just struggling by my self and no one cares to help \n\n",
              "score": 2,
              "created_utc": "2026-02-19 15:35:17",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6a1dun",
                  "author": "Dickskingoalzz",
                  "text": "That’s because you’re doing all your own lead gen aka marketing with no training. I’d find a better job.",
                  "score": 2,
                  "created_utc": "2026-02-19 17:54:29",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o67cd02",
          "author": "Alphaa__777",
          "text": "Depends on the region but what worked for me and others in my org is content led lead gen and then sales.",
          "score": 1,
          "created_utc": "2026-02-19 07:12:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o698jhn",
              "author": "Ok-University-2605",
              "text": "and is a led lead gen ?",
              "score": 1,
              "created_utc": "2026-02-19 15:35:45",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o69xpal",
          "author": "Leading_Nothing_6532",
          "text": "Can you start within your network? Or find some affiliation between you and your potential customer (e.g. same university, same city). If there's no one within your network that'll hear you out then it's going to be a steep mountain to climb",
          "score": 1,
          "created_utc": "2026-02-19 17:36:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6kbkn8",
              "author": "Ok-University-2605",
              "text": "Omg let me try to do that",
              "score": 1,
              "created_utc": "2026-02-21 06:57:43",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6aosmw",
          "author": "Fun_Dog_3346",
          "text": "What about their marketing strategy ? Do they actively using different channels ? Any ads ? Also have you studied the competitors deeply ?",
          "score": 1,
          "created_utc": "2026-02-19 19:44:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6kbrs3",
              "author": "Ok-University-2605",
              "text": "They are using social media to promote their work, soon they will do run ads both locally and globally. But none of that is going to help me. My job is find extra extra leads unfortunately which I’m stuck on",
              "score": 1,
              "created_utc": "2026-02-21 06:59:31",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6khzbm",
                  "author": "Wide_Brief3025",
                  "text": "Finding leads for international sales can be super tough, especially when social media and ads only go so far. Have you tried monitoring actual conversations where your ideal clients hang out? There are tools like ParseStream that track relevant discussions on platforms like Reddit and LinkedIn in real time, which can help you spot and jump into conversations when your target audience is already talking about what you offer.",
                  "score": 1,
                  "created_utc": "2026-02-21 07:58:49",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6p7s94",
          "author": "Stardust_Evi",
          "text": "Hey. I am doing sales as well. And here is the trick I learned from a friend of mine who is a super successful business woman. You have to make phone calls - emails, texts, messages don’t count. Typical conversion rate is 2%, so you have to make 100 calls and get rejected 98 times. So each no is bringing you closer to a yes, “no contact” also don’t count. In your industry it can be better. But the funny thing is, I personally hate doing sales calls, but something always shifting and I start to get interest from sources I didn’t reach out to. My old clients come back with more work each time I am in the middle of my phone calls. Good luck!",
          "score": 1,
          "created_utc": "2026-02-22 01:34:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5v7ck0",
          "author": "RavinderOberoiReal",
          "text": "Try offline marketing..visit the office of your ICP and try to show your product to them",
          "score": 1,
          "created_utc": "2026-02-17 13:58:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5v9njj",
              "author": "Ok-University-2605",
              "text": "My job is to find international clients, I can’t just get on a plane and go 🥲",
              "score": 2,
              "created_utc": "2026-02-17 14:11:16",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5v9tpi",
                  "author": "RavinderOberoiReal",
                  "text": "You can hire someone local to do it for you",
                  "score": -1,
                  "created_utc": "2026-02-17 14:12:12",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1r6i2wh",
      "title": "Skills to work on to be a better founder? (Advice on how to be more entrepreneurial)",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1r6i2wh/skills_to_work_on_to_be_a_better_founder_advice/",
      "author": "DurvalM",
      "created_utc": "2026-02-16 18:45:09",
      "score": 17,
      "num_comments": 22,
      "upvote_ratio": 1.0,
      "text": "Hi, I'm a student, I have good internships, consider myself good in the technical side, and I can get good tech jobs.\n\nEveryone in my family is a business owner pretty much, and I grew up with that, both in the country I used to live and now in the US.\n\nI don't like corporate that much and I think there's more out there for me, I see people who are really bright, ship products, have connections, raise money, do extremely nice technical work, marketing, etc...\n\nI want to be like that, and I would like advice from you guys on how people become that cracked as founders.\n\nI go to college in the suburbs of Florida and there's not much going on here in terms of tech, I barely know anyone here who can code and wtv, all the technical people I know are in other states, some of them started full time jobs, and I feel really disconnected from the silicon valley innovations and etc, even though I lived in the Bay before. \n\nI worked in multiple projects before, I'm a coder ever since high school, I have projects that companies used for 2 years+, I'm currently working on another project that's gonna help a lot of people, and I keep on doing that because my dream is to be a founder and have my own products and control of my own life and what I do.\n\nWith that being said, I feel sooo far behind from all these people who do it so easily, if you guys could give me some advice on what to work on, what skills that help people be better founders and ship higher quality and importance products, and how to get there, I would be really thankful for that kind of advice.\n\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1r6i2wh/skills_to_work_on_to_be_a_better_founder_advice/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o5qbtfz",
          "author": "isitaboat",
          "text": "\"Make something people want\" - go do that, and charge for it. Don't sell your time - make something. You'll learn that way.",
          "score": 6,
          "created_utc": "2026-02-16 18:54:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5qcm5e",
              "author": "Eric_emoji",
              "text": "yea just keep building, and dont expect things to work out immediately. could be years before something takes off",
              "score": 1,
              "created_utc": "2026-02-16 18:57:46",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o5qoyr6",
              "author": "DurvalM",
              "text": "But aside from that, what are some of the skills and secrets to learn that helps becoming a better maker?",
              "score": -1,
              "created_utc": "2026-02-16 19:56:53",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5rnv8h",
                  "author": "isitaboat",
                  "text": "No aside, just go do it until you're not failing at it",
                  "score": 2,
                  "created_utc": "2026-02-16 22:49:53",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5qu5n2",
          "author": "nvn1202",
          "text": "Will you be interested to be part of an early stage startup? Currently we plan to launch only in India. And then consider going international.",
          "score": 2,
          "created_utc": "2026-02-16 20:22:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5ta3um",
          "author": "Superb_Cherry1498",
          "text": "You are honestly not behind. You are just early and self aware.\n\nFrom what you wrote, you already have a strong base. Solid technical skills, real projects in production, and business exposure from your family. That is more than most students.\n\nIf you want to level up as a founder, here is what I would focus on beyond coding:\n\n1. Learn to pick better problems. A lot of engineers focus on building. Strong founders focus on problem selection. Is the problem painful? Are people already paying to solve it? Are current solutions weak?\n2. Get good at talking to non technical people. Sales, clear communication, and asking the right questions matter a lot. If you cannot explain your product clearly to someone who does not code, it is not ready.\n3. Think about distribution early. Most products do not fail because of bad code. They fail because nobody sees them. Before building, ask yourself how users will find you.\n4. Build emotional durability. The feeling that everyone else is ahead is normal. You are comparing your daily work to someone else's highlight reel. Every strong founder has many failed attempts behind the scenes.\n\nAlso, being outside Silicon Valley is not a major disadvantage anymore. Most valuable conversations happen online now.\n\nYou do not need to be exceptional today.  \nYou need to keep building, keep talking to users, and stay in the game long enough to compound your skills.\n\nThe founders who win are not the ones who looked impressive at twenty one.  \nThey are the ones who did not quit.",
          "score": 2,
          "created_utc": "2026-02-17 04:40:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o692vr8",
          "author": "PNW_Uncle_Iroh",
          "text": "Have you gone through the startup school curriculum? I’d start there to get the basics.",
          "score": 2,
          "created_utc": "2026-02-19 15:07:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6a7kqh",
          "author": "PrivilPrime",
          "text": "You may try YC Combinator",
          "score": 2,
          "created_utc": "2026-02-19 18:23:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5qrh6o",
          "author": "Ok-Initiative-4009",
          "text": "i was in a similar spot a few years ago. good tech job at a big company, coding since high school, wanted to build my own thing. quit about 3 months ago to go full time on my startup. here's what i've learned so far, and i'm still very early so take this with a grain of salt. the \"these people do it so easily\" thing is a trap. nobody does it easily. you're comparing your behind the scenes to their highlight reel. i felt the same way reading founder stories and then i actually started and realized everyone is just figuring it out in real time.\n\n skills that have mattered way more than i expected:\n\n 1. talking to people who aren't engineers. selling, pitching, explaining your idea to someone who doesn't care about the tech. this was the hardest adjustment for me coming from pure engineering.\n\n 2. being okay with not knowing things. i had no idea how to do customer research, how to write a cold email that gets replies, how to think about pricing. you just learn it as you go. nobody has all the skills before they start.\n\n 3. saying no to building. this sounds weird but the urge to just code something is strong. learning to validate before building has saved me from wasting months on stuff nobody wants.\n\nthe florida isolation thing is real but honestly i'm in denver and the local scene doesn't matter as much as you'd think. most of my useful conversations happen online. reddit, twitter, discord communities. you don't need to be in SF. you're already ahead of most people because you're building things and thinking about this stuff as a student. don't compare yourself to people 10 years into their careers. just ship stuff and talk to users. that's literally 90% of it.",
          "score": 1,
          "created_utc": "2026-02-16 20:09:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5qt4i6",
              "author": "DurvalM",
              "text": "Hey man, I really appreciate it, that's the kind of advice I was hoping to hear man.\n\nAnd how do you deal with the feeling that anything you look into building already exists, or you have some idea you think would be great but no idea ppl would use, how you find feasible ideas to work on and stuff, any advice on that idea side of things?",
              "score": 2,
              "created_utc": "2026-02-16 20:17:13",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o5qxlo3",
                  "author": "Ok-Initiative-4009",
                  "text": "honestly i deal with it badly lol. the \"everything already exists\" feeling is constant. but here's what helped me reframe it. everything existing doesn't mean everything is good. or that it works for everyone. the person who posted the one-trick pony saas in this sub earlier made sales specifically because the big tools overcomplicate things. the gap isn't \"nobody does this.\" the gap is \"nobody does this well for this specific type of person.\"\non the \"no idea if people would use it\" part, that's literally what i'm spending all my time on right now. customer interviews. i find people who might have the problem i'm thinking about and just ask them about their day, their workflow, what annoys them. not \"would you use my thing\" because everyone says yes to that and it means nothing. the book The Mom Test helped me a lot with this. the core idea is stop asking people if your idea is good and start asking about their actual behavior. what do they do today, what have they tried, what\ndid they pay for. the answers tell you way more than opinions. for finding ideas honestly i just pay attention to stuff that annoys me or people around me. my current thing came from a problem i kept seeing at my old job that nobody was solving well. not some big original insight, just a real pain point i experienced firsthand. the best advice i got was stop looking for a perfect idea and start looking for a real problem. ideas are cheap, problems that people will pay to solve are not.",
                  "score": 1,
                  "created_utc": "2026-02-16 20:39:32",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o5qvu3b",
          "author": "pagenotdisplayed",
          "text": "Be good at solving problems. In my experience, being a Founder has involved solving new problems every day for years and years.\n\nAlso get good at getting good at things. Be able to pick up on new tools quickly.",
          "score": 1,
          "created_utc": "2026-02-16 20:30:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5srum1",
          "author": "DylanFromCheers",
          "text": "The disconnected feeling is super normal and honestly might be an advantage. When I was at BYU I felt the same way. What actually moved the needle for me wasn't networking with SV people, it was just finding one real problem I cared about and talking to people who had it. The skills come a lot faster than you think once you have something to you're actually building toward.",
          "score": 1,
          "created_utc": "2026-02-17 02:42:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5uas96",
          "author": "Forsaken_Lie_8606",
          "text": "ngl im in a similar situation, not a whole lot of tech stuff going on in my area either, but ive found that attending online conferences and meetups has been super helpful in getting connected with other%speople in the industry, ngl its not the same as being there in person but its better than nothing, ive also been trying to read as much as i can about startups and entrepreneurship, paul grahams essays have been really insightful for me, and ive been trying to build my own projects just to get a feel for what its like to be a founder, even if theyre not huge successes, just the process of building something from scratch has been really valuable imo curious what others think",
          "score": 1,
          "created_utc": "2026-02-17 10:01:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o62dasb",
          "author": "reddit_user_100",
          "text": "Figure out what people want. That’s the core of business and much easier said than done.",
          "score": 1,
          "created_utc": "2026-02-18 15:14:54",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6cs0lq",
          "author": "Rishi_445",
          "text": "As a student, surround yourself with new people and learn how to get along with everybody. Value your time as a student and take advantage of the fact you will meet incredible people. You never know, in a few years those contacts will be the ones to help you out. Don't network for the sake of it, create long-term friendships",
          "score": 1,
          "created_utc": "2026-02-20 02:36:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6l1zc0",
          "author": "Most-Bell-5195",
          "text": "You could work on side projects or join a startup. If relocating isn't an option, remote's a solid alternative. ",
          "score": 1,
          "created_utc": "2026-02-21 11:15:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6qc4dk",
          "author": "WeaknessDisastrous31",
          "text": "I think the best approach is to actually work in the industry you want to build for. For example, when my co-founder and I decided to build an app for the beauty and wellness industry, we worked at a barbershop for a few months to truly understand how things operate. When we started expanding into other markets, we also spent time working at body shops and pet grooming businesses to learn their workflows firsthand.\n\nAnd when you’re working in those industries, you constantly hear complaints and frustrations from owners and staff. Those repeated pain points are real opportunities to build something that actually solves the problem.",
          "score": 1,
          "created_utc": "2026-02-22 06:25:13",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rcejv9",
      "title": "Garry Tan Emailed Me",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1rcejv9/garry_tan_emailed_me/",
      "author": "Sweaty-Ad-8987",
      "created_utc": "2026-02-23 11:04:15",
      "score": 14,
      "num_comments": 29,
      "upvote_ratio": 0.75,
      "text": "Anyone else this batch/prior batches receive an email from garry.tan address and were invited to interview? TLDR: \"Your background stood out as particularly promising, so I wanted to reach out to encourage you to finish it \\[your application\\]. Based on your background, you would have good odds of getting an interview, even if you’ve just started.\" and, \"While the official deadline to apply has passed now, I can extend it for you for another week, until Feb 21.\"\n\nI was wondering when invites for interviews are generally sent out if you applied late given this email? Had a friend who received this email but was not invited for an interview.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1rcejv9/garry_tan_emailed_me/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o6xs2if",
          "author": "pinklove9",
          "text": "Unless this is a weird flex, you should consider doing what the email says. Unless you don't have an idea.",
          "score": 13,
          "created_utc": "2026-02-23 12:00:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6xvk76",
              "author": "Sweaty-Ad-8987",
              "text": "not flexing boss, and I apologise if it came off that way, just want to know if anyone actually received an interview because my friend received it and got rejected anyway ;-;",
              "score": 5,
              "created_utc": "2026-02-23 12:26:50",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6xynnk",
                  "author": "SigmaIndianChad",
                  "text": "my co-founder has been receiving these emails for last couple of batches. Every time he applied he was rejected at application stage. He received the same last week, lets see what happens.\n\nWe noticed he has marketing emails turned on so it could be that too",
                  "score": 8,
                  "created_utc": "2026-02-23 12:48:57",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o6xxymr",
                  "author": "UpperIndependence609",
                  "text": "It's already the 23rd. What did you do? I hope you submitted an application. Also, just out of curiosity, are you some Olympiad? I am curious why Garry was so impressed by you.",
                  "score": 2,
                  "created_utc": "2026-02-23 12:44:14",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6yy4bf",
          "author": "captain_DA",
          "text": "Likely an automated reply based on applicant meeting certtain background criteria (i.e. FAANG, ivy League, etc)",
          "score": 6,
          "created_utc": "2026-02-23 16:01:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ya4y8",
          "author": "allstarheatley",
          "text": "I got this a few batches ago, didn't get an interview. We ended up getting pretty good ARR staying bootstrapped and forewent YC now that we are bigger but I feel we could have made it the batch afterwards",
          "score": 3,
          "created_utc": "2026-02-23 13:58:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6yingr",
              "author": "Sweaty-Ad-8987",
              "text": "I see I see, thank you for sharing - I really appreciate it! And many congrats on making it on your own, that's amazing!!",
              "score": 2,
              "created_utc": "2026-02-23 14:45:34",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6yvbiy",
                  "author": "allstarheatley",
                  "text": "Good luck to you!",
                  "score": 2,
                  "created_utc": "2026-02-23 15:48:37",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6xonuh",
          "author": "[deleted]",
          "text": "Funny, I didn't get any email even though I did not complete my application 😭",
          "score": 3,
          "created_utc": "2026-02-23 11:32:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6yvql7",
          "author": "Any_Emotion8287",
          "text": "I got an email like this in a previous batch, but it said that my application was in the top ten percent.And I did not get an interview, but I should definitely reapply.",
          "score": 3,
          "created_utc": "2026-02-23 15:50:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6xxkzr",
          "author": "overquantityi",
          "text": "Did he send you his dih",
          "score": 5,
          "created_utc": "2026-02-23 12:41:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6xzxpj",
              "author": "Sweaty-Ad-8987",
              "text": "I didn't make that list :(",
              "score": 5,
              "created_utc": "2026-02-23 12:57:25",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6y02iz",
                  "author": "overquantityi",
                  "text": "Damn ur not lucky",
                  "score": 1,
                  "created_utc": "2026-02-23 12:58:18",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6y7x8v",
          "author": "Dark_Angel4u",
          "text": "I also got an email, the CEO asked me to contribute to his repository and he might hire me 😐",
          "score": 2,
          "created_utc": "2026-02-23 13:46:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6ydi3r",
              "author": "Gabriel__Souza",
              "text": "That was funny. I got this email as well, looked at the repo, obviously the biggest meme bait ever.",
              "score": 1,
              "created_utc": "2026-02-23 14:17:47",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6y9gg7",
          "author": "Dull_Republic_7712",
          "text": "could u also share ur background?",
          "score": 2,
          "created_utc": "2026-02-23 13:55:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6yh4rn",
              "author": "Sweaty-Ad-8987",
              "text": "Senior at Ivy + Finance Intern building an investment/fintech app democratising/simplifying the strategies we use on the desk",
              "score": 4,
              "created_utc": "2026-02-23 14:37:33",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6yxog8",
                  "author": "ExAstrisDivitae",
                  "text": "Does YC care about these things? Not to bash on you personally, OP, but it seems neither ivy / R1 ties nor automated trading apps are unique enough in and of themselves to garner any special attention in this space. Real traction though (e.g. users, revenue, big LOIs), that is what accelerators and investors care about",
                  "score": 1,
                  "created_utc": "2026-02-23 15:59:35",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6y81ln",
          "author": "crazywhale0",
          "text": "What’s your background?",
          "score": 1,
          "created_utc": "2026-02-23 13:47:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6yh5xu",
              "author": "Sweaty-Ad-8987",
              "text": "Senior at Ivy + Finance Intern building an investment/fintech app democratising/simplifying the strategies we use on the desk",
              "score": 1,
              "created_utc": "2026-02-23 14:37:44",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6yiii7",
          "author": "Shivam6444",
          "text": "Curious, what’s your company?",
          "score": 1,
          "created_utc": "2026-02-23 14:44:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6yrmuu",
          "author": "sauxanhh",
          "text": "Its automatically reminder email.",
          "score": 1,
          "created_utc": "2026-02-23 15:30:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6yy55c",
          "author": "Aggressive_Bed7113",
          "text": "Thats not an interview invite at all, it’s telling you to complete your application, this post is 98% FAKE",
          "score": 1,
          "created_utc": "2026-02-23 16:01:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6z0msi",
              "author": "Sweaty-Ad-8987",
              "text": "my dude I didn't say it was an interview invite that's my literal question :'(",
              "score": 3,
              "created_utc": "2026-02-23 16:13:21",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6yz9ox",
          "author": "hduynam99",
          "text": "your project might on the same category with me, coool",
          "score": 1,
          "created_utc": "2026-02-23 16:07:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6z6983",
          "author": "DanielD2724",
          "text": "Just out of curiosity, do you mind posting what your background is and why they might be impressed? \nJust wanna get some inspiration and benchmark.",
          "score": 1,
          "created_utc": "2026-02-23 16:39:22",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r7d88r",
      "title": "Confession to make. I have built products but not really shipped them!",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1r7d88r/confession_to_make_i_have_built_products_but_not/",
      "author": "desparate_geek",
      "created_utc": "2026-02-17 17:51:22",
      "score": 13,
      "num_comments": 10,
      "upvote_ratio": 0.93,
      "text": "I know the simple answer for this would be simply to say \"just ship it\". Even when I have ended up shipping up projects, I have not given them enough views to conclude failure / success. \n\n  \nHow do you determine?\n\n\\- when to stop working on a project?  \n\\- how do I avoid burnouts and ensure my projects get enough views before shutting the shop! \n\nFor folks in this loop / cycle, what practical advice really helped?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1r7d88r/confession_to_make_i_have_built_products_but_not/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o5y03l7",
          "author": "Ok-Initiative-4009",
          "text": "this is interesting because i have the opposite problem. i'm 3 months into validating and haven't written a line of product code. every day i want to just build something but i keep telling myself to finish the research first. so in a weird way i get it. the building part feels safe. you're making progress, you can see the code, it's tangible. shipping means people might look at it and say \"this sucks.\" that's terrifying. things that have helped me with the validation side that might apply to shipping too:\n\n1. set a hard deadline. i told myself \"by month 4 i'm building no matter what.\" maybe for you it's \"by friday this goes live no matter what.\" deadlines force decisions.\n\n2. define what \"enough views\" means before you launch. if you say \"i'll launch and see what happens\" you'll always find a reason to say it didn't get a fair shot. pick a number. 100 signups, 500 visitors, 10 conversations, whatever. hit that number then decide.\n\n3. ship ugly. the version in your head will always be better than what you can build right now. that gap is what keeps people from shipping. just accept that v1 will be embarrassing and put it out anyway.\n\nthe burnout thing is real though. i think it comes from working on stuff without getting any signal back. building in isolation is draining. shipping even something small and getting feedback, even negative feedback, is energizing in comparison.",
          "score": 4,
          "created_utc": "2026-02-17 22:06:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o60wax9",
              "author": "Coconutcornhuskey",
              "text": "Real",
              "score": 1,
              "created_utc": "2026-02-18 09:23:13",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o5wioah",
          "author": "murzihk",
          "text": "Success for a product can be defined by change in behavior of end users, there can be ways to measure this dependent on your product. For e.g, if your product is a social media, you can track engagement metrics like Daus and Maus",
          "score": 2,
          "created_utc": "2026-02-17 17:56:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o606p3x",
          "author": "grewgrewgrewgrew",
          "text": "it's left foot, right foot. learn, build, learn, build.",
          "score": 2,
          "created_utc": "2026-02-18 05:36:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6107k7",
          "author": "quietoddsreader",
          "text": "not shipping is usually fear of clean feedback.. i set explicit kill criteria before starting, like “if no one uses this weekly after x weeks, i stop”.. without that, u’ll just keep polishing.. burnout often comes from building without users, so shorten the loop.. ship small, get signal, decide.. ambiguity drains more energy than failure..",
          "score": 1,
          "created_utc": "2026-02-18 09:59:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o615kn0",
          "author": "Popular-Penalty6719",
          "text": "The issue here boils down to the \"build it and they will come\" mentality. Without a clear understanding of your target audience and their needs, product development becomes a guessing game. \n\nConnect with users early on. Their feedback will help steer your efforts in a meaningful direction, rather than assuming you know what they want. This reduces wasted resources and time. Ensure there's a human connection involved; too much focus on automation can lead to losing sight of user needs.\n\nThink smaller and modular. Instead of trying to create an entire platform at once, launch iteratively. Test specific features or functionalities first, then expand based on real feedback. This pragmatic approach often leads to better outcomes with fewer headaches.",
          "score": 1,
          "created_utc": "2026-02-18 10:47:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o67ldu4",
          "author": "ApprehensiveCry7955",
          "text": "You’re not alone, this loop is super common. Building feels safe, shipping feels vulnerable.\n\nWhat helped me:\n\n* Decide *before building* what “success” and “failure” mean (e.g., 30 days live + real user feedback).\n* Separate building from distribution. If you don’t promote it, it didn’t really get a fair shot.\n* Ship ugly versions. Perfect is just procrastination in disguise.\n* Timebox projects so you don’t burn out (e.g., 2–4 weeks build, 2–4 weeks push).\n\nMost projects don’t fail because they’re bad, they fail because they never got enough real-world exposure.",
          "score": 1,
          "created_utc": "2026-02-19 08:37:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6tb18t",
          "author": "Shivam6444",
          "text": "DM’ed you!",
          "score": 1,
          "created_utc": "2026-02-22 18:18:36",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rcaiku",
      "title": "How to find a fertile idea space?",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1rcaiku/how_to_find_a_fertile_idea_space/",
      "author": "Scott_Jaeggi",
      "created_utc": "2026-02-23 06:58:25",
      "score": 12,
      "num_comments": 19,
      "upvote_ratio": 0.93,
      "text": "Hi everyone,\n\nMy co-founder and I quit our jobs last summer. Since then, we’ve been going through pivot hell.\n\nNow we want to change our approach, inspired by the Y Combinator video “How to Get Startup Ideas” (the one where they tell the story of AtoB). We’re wondering if we can copy that approach and search for a fertile “idea space” instead of chasing random concepts.\n\nSo far, we think a good idea space should be:\n\n* Targetable (clear ICP, easy to reach)\n* In a growing market\n* Preferably “boring” (not overcrowded or hyped)\n\nWe’re trying to define more attributes that make an idea space attractive before jumping into execution.\n\nHas anyone here intentionally searched for an idea space like this?  \nWhat criteria did you use?  \nAnd what worked (or didn’t work) in practice?\n\nWould really appreciate hearing about your experience.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1rcaiku/how_to_find_a_fertile_idea_space/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o6wxkav",
          "author": "random-trader",
          "text": "If you are going by YC route. Look at their last few batches. All ideas already exisi. Even some big players already exist too. The suggestion is idean conditions. \nFind where your wedge is. \n\nYou have skills only few people have\nYou have direct access to customers \nYou can built it etc\n\n\nDon't find problem none has solved yet. Find problem people already tried to solve it but their solution sucks.",
          "score": 10,
          "created_utc": "2026-02-23 07:12:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6x254e",
              "author": "InvestigatorLive1078",
              "text": "Totally agree, Duct taped solutions are a great space to target since the user has proven how much they value the solution by using a shitty version they put together themselves. One thing I wonder in the age of AI is how do you ensure you’re not 3 months from the big model companies making your product a vibe code away.",
              "score": 4,
              "created_utc": "2026-02-23 07:56:02",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6x9xrg",
                  "author": "random-trader",
                  "text": "Every internet company can be then vibe code away. \n\nIts the amount of effort it takes to vibe code everything and make sure all features implement and actually working.",
                  "score": 3,
                  "created_utc": "2026-02-23 09:12:44",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o6wy7ix",
              "author": "Scott_Jaeggi",
              "text": "Thanks for your comment. Totally see your point. It's just sometimes not easy to see if the solutions sucks, until you can interview people already using that solution...",
              "score": 2,
              "created_utc": "2026-02-23 07:18:47",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6wz9yu",
                  "author": "random-trader",
                  "text": "You are business background. This is what expected from a business background to do.",
                  "score": 2,
                  "created_utc": "2026-02-23 07:28:50",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6xo37x",
          "author": "quietoddsreader",
          "text": "a fertile space is where u have unfair access to users, painful problems with budget, and weak incumbents people tolerate rather than love, everything else is secondary.",
          "score": 7,
          "created_utc": "2026-02-23 11:27:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6x1ray",
          "author": "Livid-Savings-5152",
          "text": "having been through four exits as an early employee, all four founders followed the same formula\n\n1) enter an existing market instead of inventing something new\n\n2) find painpoints amongst a niche audience with the existing solutions\n\n3) build a UX that alleviates these painpoints.\n\nExample\nMarket: cold outreach automation \nNiche Audience: people who use cold calling, cold email, and cold LinkedIn outreach \n\nPainpoint: they bounce between different software tools which feel annoying . Too much manual work and context switching\n\nSolution: “all in one” cold outreach to automate cold calling, email, and LinkedIn workflow at scale.\n\n\nI’m not saying this is a good idea, it’s just an example of the type of thinking\n\n\nAlso, ignore most advice like “moat” and “network effect.”\n\nHoney was a simple chrome extension that finds online coupons. The type of idea founders scoff at because it seems too simple. They got acquired for $4B",
          "score": 10,
          "created_utc": "2026-02-23 07:52:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6ybogo",
              "author": "Scott_Jaeggi",
              "text": "Super helpful, thanks so much!",
              "score": 1,
              "created_utc": "2026-02-23 14:07:38",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6zbw7g",
                  "author": "Livid-Savings-5152",
                  "text": "you’re gonna win go get that MONEY 💰",
                  "score": 1,
                  "created_utc": "2026-02-23 17:05:37",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o6yvru0",
              "author": "alielknight",
              "text": "Thank you for validating my new approach!",
              "score": 1,
              "created_utc": "2026-02-23 15:50:43",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6wx0lt",
          "author": "Deep_Lifeguard_5039",
          "text": "talk to a select group of people and find common problems they have\n\nfilter your group of people by what you have outlined above, clear ICP, growing market (e.g., AI agents), etc.",
          "score": 3,
          "created_utc": "2026-02-23 07:07:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6wy219",
              "author": "Scott_Jaeggi",
              "text": "Thanks, we are gonna do that :)",
              "score": 1,
              "created_utc": "2026-02-23 07:17:23",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o6xpq7z",
              "author": "Competitive-Exit5298",
              "text": "ICP… Insane Clown Posse??",
              "score": 0,
              "created_utc": "2026-02-23 11:41:17",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6xsd8p",
          "author": "novaaiops",
          "text": "Think of a problem you experience daily go from there",
          "score": 3,
          "created_utc": "2026-02-23 12:02:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6xb27q",
          "author": "AnnaSaaS",
          "text": "One idea space I’d personally look at is boring B2B industries that are kind of being forced to modernize right now because of AI or compliance stuff. Like logistics brokers, small manufacturers, regional healthcare providers, even local government vendors. A lot of them are still running pretty serious operations on spreadsheets, email threads, and WhatsApp. Those spaces are usually:\n\n* Easy to define ICP\n* Not hyped\n* Have real budgets\n* And have a lot of messy workflows\n\nInstead of chasing something “innovative,” I’d probably look for industries where people are managing $5–10M+ businesses in Excel and constantly complaining about manual processes. That usually feels like a better signal than trying to invent something totally new.\n\nJust my take though  curious what direction you’re leaning toward.",
          "score": 2,
          "created_utc": "2026-02-23 09:24:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6xexwq",
          "author": "notrightnever",
          "text": "Go to subs where people are actively looking for a solution. \nI found my first problem while working as an electricians assistant, and now I’m developing modular electrical systems.\n",
          "score": 2,
          "created_utc": "2026-02-23 10:02:01",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rc1tzx",
      "title": "Networking in San Francisco",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1rc1tzx/networking_in_san_francisco/",
      "author": "foo_bar_baazigar",
      "created_utc": "2026-02-22 23:54:30",
      "score": 8,
      "num_comments": 7,
      "upvote_ratio": 0.91,
      "text": "Hello everyone. I’m relocating to San Francisco and would greatly appreciate your recommendations for places to stay.\n\nMy primary goal is to network with founders, entrepreneurs, venture capitalists, and build a strong and meaningful social circle.\n\nI’m open to sharing apartments or participating in coliving communities. Any suggestions you may have would be greatly appreciated.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1rc1tzx/networking_in_san_francisco/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o6vc7oz",
          "author": "Visual-Slip-969",
          "text": "Find hacker houses/coliving places. It's unconventional living but networking on steroids.",
          "score": 3,
          "created_utc": "2026-02-23 00:36:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6vcmfe",
              "author": "foo_bar_baazigar",
              "text": "Any recommendations?",
              "score": 1,
              "created_utc": "2026-02-23 00:38:25",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6vfvhh",
                  "author": "Visual-Slip-969",
                  "text": "Not lived in SF now for a number of years, so it's probably a whole new set of players. Check Craigslist or even airbnb.",
                  "score": 1,
                  "created_utc": "2026-02-23 00:57:10",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6vjh4g",
          "author": "Full-Leg-5435",
          "text": "Hey im considering moving to SF as well, but a little overwhelmed with the decision. What has been your motivation to do so? How much do you plan on spending monthly, and what do your next few months’ plans look like?",
          "score": 1,
          "created_utc": "2026-02-23 01:18:47",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r79ngz",
      "title": "Is there a vc-backed founder shutdown guide anywhere because cap table liquidation is a nightmare",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1r79ngz/is_there_a_vcbacked_founder_shutdown_guide/",
      "author": "itragers",
      "created_utc": "2026-02-17 15:51:28",
      "score": 7,
      "num_comments": 1,
      "upvote_ratio": 1.0,
      "text": "Winding down a venture with multiple investor classes is significantly more complex than the standard \"\"startup advice\"\" ever admits. The cap table math quickly becomes a nightmare when figuring out who gets what from remaining assets, especially when stacked liquidation preferences (like 1x participating vs. 1.5x non-participating) collide with a small cash pile.\n\nThe board inevitably demands watertight documentation, meaning checks cannot just be mailed out; legal approval on the distribution waterfall and individual sign-offs are mandatory. This is where the process stalls, investors often \"\"ghost\"\" because they are disappointed and disengaged, making it excruciatingly difficult to get the required signatures for dissolution.\n\nAdding to the chaos is the friction with option holders who never exercised but emotionally feel entitled to a payout. Explaining that unexercised options do not participate in distributions is a brutal conversation that repeats endlessly. It feels like an \"\"unspoken failure tax\"\" where founders are forced to navigate intense legal and interpersonal hurdles without a roadmap, all while trying to close a painful chapter.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1r79ngz/is_there_a_vcbacked_founder_shutdown_guide/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o5vwdsh",
          "author": "hau5keeping",
          "text": "[https://starcycle.ai/](https://starcycle.ai/)",
          "score": 0,
          "created_utc": "2026-02-17 16:06:20",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r8fe8m",
      "title": "What is the timeframe for the review on YC co-founder matching?\nIt's been almost a week, and I haven't heard back...",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1r8fe8m/what_is_the_timeframe_for_the_review_on_yc/",
      "author": "CrushTheDay",
      "created_utc": "2026-02-18 21:08:59",
      "score": 7,
      "num_comments": 8,
      "upvote_ratio": 0.83,
      "text": "",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1r8fe8m/what_is_the_timeframe_for_the_review_on_yc/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o6dc49m",
          "author": "susspectno1",
          "text": "they were pretty quick with mine. I think I got a response back in a couple days",
          "score": 1,
          "created_utc": "2026-02-20 04:50:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6dcupp",
          "author": "Great_Ad_3313",
          "text": "3 weeks no reply",
          "score": 1,
          "created_utc": "2026-02-20 04:55:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6fh6rw",
          "author": "Suitable-Fudge4577",
          "text": "I think that means it's a no",
          "score": 1,
          "created_utc": "2026-02-20 14:44:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6irs78",
          "author": "illseeutmrw",
          "text": "Ive shot like 40 DMS within the last month no replies but keep going they said it could take up to 6 months to find your Co-Founder its not a fast process and shouldnt be. You're gonna be spending more time with them than anyone else in your life",
          "score": 1,
          "created_utc": "2026-02-21 00:27:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6gulch",
          "author": "Khushboo1324",
          "text": "Totally normal to wonder about this 😅 YC timelines feel super opaque when you’re waiting.\n\nIf you applied before the deadline, YC usually gives a **latest decision date** (for example this batch says applicants will hear back by March 13). interview invites go out on a rolling basis before that, so silence doesn’t mean rejection.\n\nFrom what founders share, invites can come weeks after applying and sometimes even \\~1–2 months after the deadline, so the waiting window is pretty wide.\n\nAlso common experience is staying “in review” for 4–6 weeks with no updates, which people say is normal. you’re only rejected once you get the email.\n\ntbh best move is just keep building while you wait. YC decisions are binary but progress on the startup compounds regardless.",
          "score": -4,
          "created_utc": "2026-02-20 18:33:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6qpvze",
              "author": "pndjk",
              "text": "chatgpt ass reply",
              "score": 1,
              "created_utc": "2026-02-22 08:34:10",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6edrvy",
          "author": "Forsaken_Lie_8606",
          "text": "yeah, thats a common pain in the co-founder matching process, the uncertainty can be kinda frustrating. i went through it last year and it took them around 10 days to get back to me, so youre still within a pretty normal timeframe imo. one thing that might be helpful is to make sure youve got a pretty solid idea of what youre looking for in a co-founder, that can make the matching process a lot smoother. i ended up getting matched with someone whos been an amazing partner, so its definitely worth the wait lol lol hope that helps",
          "score": -1,
          "created_utc": "2026-02-20 10:25:48",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1r75yyx",
      "title": "Demand validation of a physical product, how?",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1r75yyx/demand_validation_of_a_physical_product_how/",
      "author": "Cortexial",
      "created_utc": "2026-02-17 13:27:00",
      "score": 6,
      "num_comments": 11,
      "upvote_ratio": 1.0,
      "text": "I've built a physical product we use in my family.\n\nIt works well, so I've thought about turning it into a business.\n\nBut YC-style, I obviously want to try to validate the demand before I start a production.\n\n**The Product**\n\nThe product is a tablet for speech-disabled, and it works well.\n\n*I know we have ourselves as proof, but I'd like some additional validation.*\n\n\n\nFor software, I can build an MVP within a few days, but for this, I'm not sure how I can cheap and fast validate the demand.\n\n1. Launch a discounted presale?\n2. E-mail waitlist and paid socials?\n3. Build a shitty off-the-shelf modified tablet, and sell it cheap on second hand sites?\n4. Other ideas?\n\nThanks a lot! :)",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1r75yyx/demand_validation_of_a_physical_product_how/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o60vb60",
          "author": "Coconutcornhuskey",
          "text": "Validate the demand by taking your device and doing a Study. Have speech impaired people use it, record their reaction. Do it with 100 people. Use that average and scale it up. \nIf it helps a high percentage of those people and they’re willing and able to pay for one, you can show a little more validation of the idea. \n\nStarting a waitlist helps too",
          "score": 2,
          "created_utc": "2026-02-18 09:13:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o611sa3",
          "author": "quietoddsreader",
          "text": "for hardware, i’d validate pain before product.. talk to 20 to 30 families dealing with speech disability and see if they’re hacking together alternatives.. if they’re already paying for workarounds, that’s signal.. a landing page with clear value and a real preorder, even refundable, can test willingness to pay.. presales hurt less than unsold inventory..",
          "score": 2,
          "created_utc": "2026-02-18 10:13:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5zecou",
          "author": "sailormars27x",
          "text": "For my product in the beginning just a list of people who think that they would actually use it is validation. X people said they would be interested or X people saw the demo and said it would be helpful. You can have an informal waitlist if you ask if they would want to use the first version. In your case probably seeing how much interest speech-disabled users have is the best validation. Try to get feedback like: this would help me do x better, this would make school easier for me, or learning x.  Try to ask other questions like what other products do you use that are like this/ to help with this. How do u solve the problem currently or navigate it( this will give valuable user input) how much would you pay for something like this etc and try to validate more than just demand like other parts of ur plan",
          "score": 1,
          "created_utc": "2026-02-18 02:33:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o64fyk1",
          "author": "VainVeinyVane",
          "text": "The same as how you validate any products\n\n1) find pain points, as another comment said. You need to prove it works as a business to yourself before it works to others, or you’re just wasting time.\n2) bootstrap a campaign. \n3) launch your campaign on kickstarter. The more money you get the more you know people want it. People speak with their dollars.\n\nAt this point on, you can possibly get funding. It’s up to you depending on how you want to scale and how much equity and oversight you’re willing to deal with.\n\n4) start selling prototypes, shipping out to beta users and influencers who can bring name to your product\n5) get feedback, iterate.\n\n6) if all of these cycles have gone well you should have the money to produce and meet your existing demand by now. If not then that means your business didn’t have the demand it needed, or you weren’t good enough at executing. Either way it means you wouldn’t have succeeded anyways so it’s time to give up and try again\n\n-> taken from the lean startup method\n\nThere really aren’t any shortcuts and there’s no quick way to validate the demand. That’s why being honest with yourself based on initial market feedback from raw interviews or surveys is so important. Also just so you know: circuit design and hardware takes a long time and a lot of money. I built hardware and exited last year and if you’re serious about this then you should be prepared for the launch cycle to take a year or two minimum before you even have a working MVP. \n\nEven the most basic designs have long wait times between finding a viable chip producer, finding viable PCB makers, waiting on fab times, finding manufacturers for your case/shell/glass or any materials you might have, and of course testing between each one to make sure they work.",
          "score": 1,
          "created_utc": "2026-02-18 20:53:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6f1y0n",
          "author": "CoolSnow01",
          "text": "In your case I can see 2 different things to validate:  \n\\- Demand (\"do people want this?\")  \n\\- Usability (\"does it work as they expect?\")\n\nDemand might be easier and cheaper. I.e.: Let's say you set up a landing page promoting the product, telling what it does, some pictures, maybe a video of someone using it. Share it with the customer segment you are targeting and see how many people reach out.  You dont need to get out of your house to do this, and avoids spending money in building any additional units.  \n  \nIt is just an example, there are other ways of doing this. But just to give you a quick idea of demand validation.  \n  \nThe other part is usability. Before launching to market it might be a good idea to test how it works with real users outside of your family. If you validate demand first, you probably will have a waiting list in place. You can build a few tablets, deliver them to people who showed interest, and see what feedback they have. Other option is asking them to record specific use cases, etc.\n\nHow does it sound when put this way?",
          "score": 1,
          "created_utc": "2026-02-20 13:23:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o5v9umh",
          "author": "UpperIndependence609",
          "text": "So why not just make it an app? Apple and Samsung dominate the tablet market. You can't beat their scale – mind you, that an iPad is 319 $.  Your physical product will definitely be less quality or much higher in price, both cases would be devastating in terms of business aspects. \n\nFamilies don't want to buy a second tablet. They already own one. The value your device provided your family was not the vehicle (the tablet) but the value (the communication).\n\nBy insisting on building hardware, you are actively choosing a worse business model with less margins and a smaller total addressable market.",
          "score": 1,
          "created_utc": "2026-02-17 14:12:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o5vd0tf",
              "author": "Cortexial",
              "text": "We're not exclusively building an app, because a key difference is that the tablet is purpose-built.\n\nIt's meant to be stationary, there are no apps, we have a bit of external hardware to control it, we need 100 % remote control of it (which general purpose tablets don't offer for good reasons) etc. etc.\n\nAnd, respectfully, I wasn't asking for advice on whether we should handle the hardware or not. I didn't build this myself as a SISP, I built it because there isn't any good options on the market at all, to cover our needs.\n\nWith the limited context, you also can't really determine whether it's a \"worse business model\". iPad or a Samsung tablets wouldn't be an alternative.\n\nWhat I'm asking is inputs on how to validate the demand, before I start a costly production. In our case, it's not an option to launch without a single piece of hardware. The hardware itself, the controls etc. is exactly our product.",
              "score": 1,
              "created_utc": "2026-02-17 14:29:22",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1rarwef",
      "title": "How I got 266 users, 2 paid customers, and $6 revenue in 14 days?",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1rarwef/how_i_got_266_users_2_paid_customers_and_6/",
      "author": "chacha_chu",
      "created_utc": "2026-02-21 14:03:47",
      "score": 4,
      "num_comments": 19,
      "upvote_ratio": 0.61,
      "text": "Hey everyone,\n\nI launched a tiny SaaS 2 weeks ago.\n\nNo audience.  \nNo Product Hunt launch.  \nNo Twitter following.  \nNo ads.\n\nJust shipped and started posting.\n\n# The numbers (first 14 days)\n\n* 266 signups\n* 2 paid users\n* $6 revenue\n* \\~0 refunds\n* A lot of lessons\n\nNot impressive revenue-wise.  \nBut very eye-opening.\n\n# What I built\n\nIt’s a tool that turns a website or text into a short promo-style video automatically.\n\nTarget users:\n\n* Indie hackers launching products\n* Course creators\n* Newsletter writers\n* Small SaaS founders\n\nBasically anyone who needs quick promo videos but doesn’t want to edit manually.\n\n# What actually brought the 266 users?\n\n1. Reddit comments (not posts)\n2. Answering questions in relevant threads\n3. Showing product in context (not “hey try my tool”)\n4. A small free usage model\n\nI avoided:\n\n* Cold DMs\n* Paid ads\n* “Check my startup” posts\n* Spammy links\n\nMost users came from conversations where video creation was the real problem being discussed.\n\n# What surprised me\n\n# 1.) Free users don’t convert just because they signed up\n\nMost users just try once and disappear.\n\nLesson:  \nSignups ≠ validation.\n\n# 2.) Pricing matters more than features\n\nMy pricing was messy in the beginning.\n\nWhen you’re small, simplicity > flexibility.\n\nToo many options confuses people.\n\n# 3.) Payment friction kills small revenue\n\nWhen someone is paying $1–$5, payment fees and failures matter a lot.\n\nMicro-payments are brutal.\n\n# 4.) 2 paying users felt bigger than 266 signups\n\nBecause that means:\n\nSomeone saw value.  \nSomeone trusted enough to enter card details.  \nSomeone actually needed the product.\n\nThat changes mindset completely.\n\n# Biggest learning\n\nGetting users is easier than getting paid users.\n\nPeople will try tools.  \nVery few will pay.\n\nThe real game starts after first revenue.\n\n# What I’m experimenting next\n\n* Simpler pricing (maybe one plan only)\n* Limited free usage instead of generous credits\n* Talking directly to paid users to understand why they converted\n* Improving positioning (less “cool tech”, more “clear outcome”)\n\nIf you’ve gone from 0 → first paying customers recently,  \nwhat changed for you?\n\nWould love to learn from others building in this stage.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1rarwef/how_i_got_266_users_2_paid_customers_and_6/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o6mendw",
          "author": "Due_Researcher3729",
          "text": "Could you please drop a link in DM?",
          "score": 1,
          "created_utc": "2026-02-21 16:26:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6m26oq",
          "author": "jspandher",
          "text": "Motivation I needed right now, thanks bud 🙏\n\nI built this product for photographers (I’m a photographer too) because I was running into issues with the current services out there.\n\nI’ve been reaching out to photographers to try it, but honestly it hasn’t worked so far.\n\nI’m going to try the steps you mentioned. I’m not really great at marketing or posting consistently, but I’ll give it a shot this time.",
          "score": 1,
          "created_utc": "2026-02-21 15:23:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6lorfd",
          "author": "Ok_Worldliness_2291",
          "text": "mate I'm at 17k mrr with [grepped.ai](http://grepped.ai) in 2 months, you can do better lmao",
          "score": -13,
          "created_utc": "2026-02-21 14:07:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6lp6qs",
              "author": "RosesandPeaches20",
              "text": "Let us appreciate people",
              "score": 10,
              "created_utc": "2026-02-21 14:10:10",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6lpmnf",
                  "author": "Ok_Worldliness_2291",
                  "text": "of course, but let us not celebrate things unworthy of celebration\n\ninstead of spending time writing his post he could've gotten to atleast $10 😂",
                  "score": -7,
                  "created_utc": "2026-02-21 14:12:52",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o6ls14g",
              "author": "hau5keeping",
              "text": "Mate im at $100k mrr with my startup in 2 hours, you can do better lmao",
              "score": 4,
              "created_utc": "2026-02-21 14:27:11",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6ltvmn",
                  "author": "RosesandPeaches20",
                  "text": "This is so funny😂😂😂",
                  "score": 3,
                  "created_utc": "2026-02-21 14:37:58",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o6lv4qb",
                  "author": "Ok_Worldliness_2291",
                  "text": "now thats impressive!",
                  "score": -1,
                  "created_utc": "2026-02-21 14:45:10",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o6majd8",
                  "author": "overquantityi",
                  "text": "Yes u probably do of",
                  "score": -1,
                  "created_utc": "2026-02-21 16:05:51",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o6lwk4s",
              "author": "hourself_24",
              "text": "Very meta. Using the same playbook in the post of plugging your startup in a Reddit comments section. \n\nI see you…",
              "score": 3,
              "created_utc": "2026-02-21 14:53:13",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6lxmo9",
                  "author": "Ok_Worldliness_2291",
                  "text": "you've caught me ;)",
                  "score": -2,
                  "created_utc": "2026-02-21 14:59:12",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o6ls2m8",
              "author": "chacha_chu",
              "text": "Yes I could have done better..any suggestions how?",
              "score": 1,
              "created_utc": "2026-02-21 14:27:25",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6lv8po",
                  "author": "Ok_Worldliness_2291",
                  "text": "I quite literally know nothing of your business \n\nsend me your website and I will take a look :)",
                  "score": -3,
                  "created_utc": "2026-02-21 14:45:48",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1r8eaui",
      "title": "Build the product after sales",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1r8eaui/build_the_product_after_sales/",
      "author": "Yersyas",
      "created_utc": "2026-02-18 20:28:09",
      "score": 4,
      "num_comments": 13,
      "upvote_ratio": 1.0,
      "text": "Our product is not software. It’s connection. When my customers expand into a new country, we handle third party vendors for them. You can think that we handle the electricity, gas, and water vendor contract in the new country in advance for them as an analogy to make them expand faster.\n\nTherefore, without the customers saying yes, I can’t really build the “product”, which is preparing the electricity, gas, and water supply for them. In this case, how would you approach the customers with no product?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1r8eaui/build_the_product_after_sales/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o64bsw3",
          "author": "Local-Explanation677",
          "text": "1. By asking them ?",
          "score": 2,
          "created_utc": "2026-02-18 20:34:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o64kzdv",
          "author": "theabhster",
          "text": "You approach the customer by approaching them",
          "score": 1,
          "created_utc": "2026-02-18 21:16:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o64m1ar",
          "author": "AroxCx",
          "text": "sell them the idea",
          "score": 1,
          "created_utc": "2026-02-18 21:21:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o68nvek",
          "author": "Fun_Ostrich_5521",
          "text": "You don’t build the infrastructure first.  \nyou sell the outcome first.\n\nin your case, the product isn’t electricity/gas setup.  \nit’s expansion without operational drag.\n\napproach customers with: a clear promise (we reduce country expansion time by x%), structured process (even if manual at first), paid pilot\n\nyou don’t need full vendor integrations upfront. you need: a specific icp (e.g., saas companies expanding into latam) a repeatable playbook, 2–3 design partners willing to pay for speed\n\nyour first version will be highly manual. that’s fine.  \nyou’re validating demand + pricing + urgency.\n\nonly after 5–10 expansions do you automate.\n\nif you wait to build product, you’ll build assumptions. sell the transformation. then operationalize it.",
          "score": 1,
          "created_utc": "2026-02-19 13:46:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6dg3gu",
          "author": "SaintMichael415",
          "text": "This is how software was built in the 1990s. Everything was custom.",
          "score": 1,
          "created_utc": "2026-02-20 05:20:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6k3g3l",
          "author": "quietoddsreader",
          "text": "if the product is execution, sell the outcome first with clear scope and pilot commitments, then deliver manually before thinking about scale..",
          "score": 1,
          "created_utc": "2026-02-21 05:46:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ltkps",
          "author": "Suitable-Program-181",
          "text": "If you target providing value first, you will do ok.",
          "score": 1,
          "created_utc": "2026-02-21 14:36:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6u6qtg",
          "author": "imsimchi",
          "text": "Validate the idea first\n\n",
          "score": 1,
          "created_utc": "2026-02-22 20:53:07",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1ran7i4",
      "title": "Remote Internship",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1ran7i4/remote_internship/",
      "author": "PlanktonSpecific371",
      "created_utc": "2026-02-21 09:46:55",
      "score": 3,
      "num_comments": 1,
      "upvote_ratio": 0.81,
      "text": "I've been trying to land remote YC internships but am having difficulty doing so. Have applied to a bunch of places on YC portal, sent cold emails, LinkedIn notes for a connection and far from getting rejected, I am not getting responses itself. \n\n  \nWhat more can I do to land a remote internship over the semester?\n\n  \nStats: Junior, 1 ML Internship at a relatively small startup",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1ran7i4/remote_internship/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o6lryk6",
          "author": "mickayee",
          "text": "They may not be checking the platform/reading applications. Keep reaching out to founders themselves on LinkedIn and reach out to other higher ups/ workers at the company if you’re really passionate\n\nMake sure messages are personalized, enthusiastic, easy to read, and most of all, not AI slop",
          "score": 1,
          "created_utc": "2026-02-21 14:26:46",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1raqrn8",
      "title": "What U.S. cities have thriving but overlooked startup scenes?",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1raqrn8/what_us_cities_have_thriving_but_overlooked/",
      "author": "ankonia",
      "created_utc": "2026-02-21 13:11:17",
      "score": 3,
      "num_comments": 10,
      "upvote_ratio": 1.0,
      "text": "I'm curious to hear what founders in Y Combinator are hearing about what U.S. cities have the most legitimate startup communities right now. I'm asking about U.S. cities outside of San Francisco, New York City, Boston, or Seattle.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1raqrn8/what_us_cities_have_thriving_but_overlooked/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o6lio8q",
          "author": "Ok-Afternoon-9268",
          "text": "Idk about overlooked but I’d say Austin",
          "score": 4,
          "created_utc": "2026-02-21 13:29:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6lgb1n",
          "author": "DankKid2410",
          "text": "San Diego for biotech and defense tech",
          "score": 2,
          "created_utc": "2026-02-21 13:13:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ltjv3",
          "author": "Coconutcornhuskey",
          "text": "Phoenix",
          "score": 1,
          "created_utc": "2026-02-21 14:36:03",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6lw1xg",
              "author": "ankonia",
              "text": "Do you mean downtown Phoenix or communities around it like Scottsdale?",
              "score": 1,
              "created_utc": "2026-02-21 14:50:23",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6lveyn",
          "author": "ankonia",
          "text": "Does anyone have any insight into Portland or Denver?",
          "score": 1,
          "created_utc": "2026-02-21 14:46:46",
          "is_submitter": true,
          "replies": []
        },
        {
          "id": "o6lzqfp",
          "author": "ShilpaMitra",
          "text": "What about Rayleigh NC? Anyone know how’s the startup scene there? \nHeard a lots of good stuff about it.",
          "score": 1,
          "created_utc": "2026-02-21 15:10:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6m8mm3",
          "author": "Basic_Wind_8549",
          "text": "Sf",
          "score": 1,
          "created_utc": "2026-02-21 15:56:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6mb4bw",
          "author": "overquantityi",
          "text": "Yc fell off",
          "score": 1,
          "created_utc": "2026-02-21 16:08:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6mcb4p",
          "author": "abebrahamgo",
          "text": "Long Beach for space tech. The ex CEO of Google is now CEO of relativity space.",
          "score": 1,
          "created_utc": "2026-02-21 16:14:41",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rcjihy",
      "title": "How would you split equity when one founder did 2 years of groundwork but now both will work equally?",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1rcjihy/how_would_you_split_equity_when_one_founder_did_2/",
      "author": "Purple-Education4751",
      "created_utc": "2026-02-23 14:52:45",
      "score": 2,
      "num_comments": 17,
      "upvote_ratio": 0.63,
      "text": "I’m trying to decide a fair equity split for a very early-stage startup and I’d like neutral opinions.\n\nFounder A:\n\n\\- Came up with the idea\n\n\\- Has spent almost 2 years working on it (market analysis, flows, requirements, feature design, concept validation)\n\n\\- Built a waitlist of \\~1,000 users already\n\n\\- No product yet, but groundwork is pretty structured\n\nFounder B:\n\n\\- Joined originally to build the backend for 30%\n\n\\- After seeing the potential, now wants to be involved in everything (product, decisions, strategy, etc.)\n\n\\- Proposes a \\~45% split\n\nFrom this point forward, both of us would work equally: development, marketing, operations, everything.\n\nMy concern is whether 45% properly reflects the difference between:\n\n\\- past contribution (time + validation + traction)\n\n\\- future equal effort\n\nHow would you approach this?\n\nWould you:\n\n1) Keep unequal equity because of prior work?\n\n2) Move toward near-equal since future effort is equal?\n\n3) Use vesting / dynamic equity instead?\n\nI’m trying to be fair but also not ignore 2 years of risk and early traction.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1rcjihy/how_would_you_split_equity_when_one_founder_did_2/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o6ym8fr",
          "author": "ryan-plucky",
          "text": "There's an equivalent of 2 years of salary you've put into the capital of the company, plus the early stage risk.\n\nWhatever you do, make sure you have at least a 4 year vesting schedule with a 1 year cliff.",
          "score": 6,
          "created_utc": "2026-02-23 15:04:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6z8kbr",
              "author": "LtArson",
              "text": "With the work Founder A is describing, there's no way that was a full-time job for them for 2 years. If they spent two years on that it was a couple hours per week max.",
              "score": 3,
              "created_utc": "2026-02-23 16:50:03",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6zc9yx",
                  "author": "ryan-plucky",
                  "text": "Yeah upon further reading I agree. Divide by X amount of value/time/risk then.",
                  "score": 1,
                  "created_utc": "2026-02-23 17:07:24",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o6yu9u6",
              "author": "stellarknight_",
              "text": "yup 4yrs vesting and 1yr cliff is standard never go below this! especially considering what you've done",
              "score": 1,
              "created_utc": "2026-02-23 15:43:38",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6ynfws",
          "author": "SigmaIndianChad",
          "text": "\\> Has spent almost 2 years working on it (market analysis, flows, requirements, feature design, concept validation)  \n\\> No Product\n\nThis has to be satire. All this can be done in a week or days for any idea. 2 years of procrastination, that's what it is.\n\nFor 2 years you raised $0 towards your product. For 2 years you took 0 steps to actually build the product. Now you're worried about founder equity split lol what a joke.",
          "score": 11,
          "created_utc": "2026-02-23 15:10:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6ypt6f",
              "author": "Purple-Education4751",
              "text": "There's no reason to be so aggressive. This isn't a to-do list; it requires certifications, permissions, and more. So, is that worth zero then?",
              "score": -6,
              "created_utc": "2026-02-23 15:22:02",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6yxpyb",
                  "author": "DazzlingPurpose",
                  "text": "No, but all you had was probably worth nothing without the work the other person did. \n\nIf you’re having thoughts about it now, two of you are not a good match",
                  "score": 2,
                  "created_utc": "2026-02-23 15:59:46",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6yoilg",
          "author": "Aromatic-Trouble-580",
          "text": "Founder equity is not about what work has been done in the past, but what theoretical work will be done in the future. It dosent matter how much work you onece did, if the founder you are bringing on is going to do all the work hence forth, then they deserve more than 50% equity, and vise versa. You should ask yourself this, if their future contributions arent worth a lot of equity, then why bring them on at all, could you not outsource their duties? \n\nLook to the future, not the past.",
          "score": 3,
          "created_utc": "2026-02-23 15:15:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6yq124",
              "author": "Purple-Education4751",
              "text": "This isn't a to-do list; it requires certifications, permissions, and more. So, is that worth zero then?",
              "score": -6,
              "created_utc": "2026-02-23 15:23:06",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6yx7t7",
                  "author": "Hot-Rip9222",
                  "text": "Not the answer you want to hear but yeah. It’s worth zero.",
                  "score": 5,
                  "created_utc": "2026-02-23 15:57:26",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6ysbbc",
          "author": "Loud_Bathroom_8023",
          "text": "You accomplished far less than you think over those two years, and it sounds like you’re going nowhere without your partner. His proposal is fine as long as you have some time vesting components",
          "score": 3,
          "created_utc": "2026-02-23 15:34:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6z3fha",
          "author": "Golandia",
          "text": "Founder A is full of it.\n\nJust do equal shares, everyone gets a cliff. \n",
          "score": 2,
          "created_utc": "2026-02-23 16:26:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6yquoz",
          "author": "CanadianRaikage",
          "text": "Look into slicing pie. It’s a different approach to splitting equity by money & time put into the startup",
          "score": 1,
          "created_utc": "2026-02-23 15:27:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6z3ot5",
          "author": "No_Drive2275",
          "text": "If you didnt do any sales or raised without him, it will be hard to justify smth far from 50/50 or 55/45",
          "score": 1,
          "created_utc": "2026-02-23 16:27:32",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}