{
  "metadata": {
    "last_updated": "2026-01-26 08:59:58",
    "time_filter": "week",
    "subreddit": "ycombinator",
    "total_items": 9,
    "total_comments": 119,
    "file_size_bytes": 126863
  },
  "items": [
    {
      "id": "1qi0ac5",
      "title": "Co-founder unresponsive, equity not fully vested, investors involved. What’s the right move?",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1qi0ac5/cofounder_unresponsive_equity_not_fully_vested/",
      "author": "octaviall",
      "created_utc": "2026-01-20 12:52:04",
      "score": 69,
      "num_comments": 63,
      "upvote_ratio": 0.97,
      "text": "\\*None of the equity is vested yet, in 1 year cliff.\n\nI’m looking for some outside perspectives because I feel like I’m stuck in a situation with no clear way forward.\n\nMy technical cofounder and I started building a few months ago, we raised our first round quickly and our user base is growing fast. Then he suddenly got sick last December. At the time, I was fully understanding and supportive. Health comes first. We slowed things down and I took all the operational work.\n\nNow it’s late January 2026.\n\nIn the past 2 months, he’s told me multiple times that he can work, that he’ll finish things “today”, this week” or “soon,” but in practice he keeps disappearing and got nothing done. I messaged him many times to understand what’s going on and what I should be expecting, but he just ignored all those messages. There’s no response, explanation, no progress, no clear timeline, and no real handoff of the tech stack or decision-making authority.\n\nMore recently, he disappeared for over a week and I was worried. Yesterday he finally texted me back and told me that he went back to his home country for treatment. Plus he said that the stress is what caused his health issues and blamed me for not having any empathy. I feel really bad and I’m being left in a position where I can’t move the company forward at all cuz he refused to handoff the tech stack to new hires.\n\nWe do have investors. The company still exists. Bills, responsibilities, and expectations still exist.\n\nI sent him a formal email laying out decision-making, accountability, and asking for clarity on whether and when he plans to return and be actively involved. He didn’t respond to the substance of it and instead said he can’t check his email right now.\n\nThat’s the part that really worries me: it feels like I’m being held indefinitely. Not a no, not a yes, just…nothing concrete.\n\nI’m willing to keep operating the company if there’s clarity and a workable structure. I’m not trying to screw him over or take advantage of his illness. But I also can’t just pause my life, career, and responsibilities forever while someone else holds more equity and is intermittently unavailable.\n\nOne additional detail that complicates this: neither of our founder equity has vested yet (we are in the 1-year cliff). Given the lack of participation and clarity, I’m trying to decide whether it’s appropriate to formally issue notice around vesting and continued service, or whether that would be premature or unnecessarily aggressive in a situation involving health issues.\n\nSo at what point does “being understanding” turn into being stuck? If you were in my position, would you issue formal notice regarding vesting, or wait longer?\n\nI’m trying to sanity-check whether this situation is as unworkable as it feels, or if there’s something I’m missing.\n\nWould really appreciate hearing how others have handled similar founder situations.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1qi0ac5/cofounder_unresponsive_equity_not_fully_vested/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o0nr78y",
          "author": "Desperate_Quit_5433",
          "text": "The longer you wait the harder it becomes.\nJust peel the bandaid and you feel relieved.",
          "score": 55,
          "created_utc": "2026-01-20 13:01:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0oqd5b",
              "author": "Emma_3479",
              "text": "This. Take it from someone who went through exactly this. If they can't deal with the stress and workload of starting a startup, they really CAN'T. It won't change and will make things worse for both of you.",
              "score": 15,
              "created_utc": "2026-01-20 16:04:55",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0oran1",
                  "author": "Desperate_Quit_5433",
                  "text": "💯",
                  "score": 1,
                  "created_utc": "2026-01-20 16:09:12",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0nx0n9",
          "author": "UpperIndependence609",
          "text": "this is one of the hardest parts of the job, but you are confusing empathy with negligence.\n\nillness is real, but ghosting and holding the tech stack hostage is a choice. unvested equity is compensation for future work; right now you are letting him consume the budget you need to hire his replacement.\n\ncall your investors. they will back the person who is actually showing up. issue the notice immediately. if the company dies because you were too polite to make the hard call, everyone loses.",
          "score": 17,
          "created_utc": "2026-01-20 13:36:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0nr9d9",
          "author": "_4k_",
          "text": "Fire him.",
          "score": 30,
          "created_utc": "2026-01-20 13:01:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0nrnkg",
              "author": "octaviall",
              "text": "He’s holding more equity tho, will that be a problem.",
              "score": 3,
              "created_utc": "2026-01-20 13:04:23",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0nw4rk",
                  "author": "Costheparacetemol",
                  "text": "How many founders are there and what is the equity split? He needs to be fired. But whose decision is it to fire him?",
                  "score": 6,
                  "created_utc": "2026-01-20 13:31:14",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o0nslqh",
                  "author": "Desperate_Quit_5433",
                  "text": "Then you??",
                  "score": 0,
                  "created_utc": "2026-01-20 13:10:16",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0o3tyf",
          "author": "Portfoliana",
          "text": "Tough situation but the vesting cliff is actualy working in your favor here. If he hasn’t hit 1 year, he hasn’t vested anything yet.\n\nYou need to have a direct conversation with your investors asap. Be factual: cofounder is unresponsive, no code handoff, company is stuck. They’ve seen this before and can advise on next steps - potentially accelerating a seperation before the cliff hits.\n\nAlso document everything. Every missed deadline, every ignored message. If this goes legal later you’ll need it.\n\nThe blaming you for his health issues is a red flag btw. Thats not how healthy cofounder relationships work. You were supportive, slowed things down, took on extra work. Don’t let guilt cloud your judgement here.\n\nHard truth: you might need to find a new technical cofounder or hire a senior dev to take over. The company cant stay frozen forever.​​​​​​​​​​​​​​​​",
          "score": 17,
          "created_utc": "2026-01-20 14:13:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0o41nq",
              "author": "octaviall",
              "text": "Thank you so much. This is really helpful.",
              "score": 1,
              "created_utc": "2026-01-20 14:14:34",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0p0ux6",
          "author": "Sketaverse",
          "text": "Reality check:  he/she is stressed out big time and feeling trapped because they know you're dependant on them and you have investor commitments. They're in a real bad place and not sharing it with you.\n\nHave the open conversation with them as soon as possible and let them know it's okay for them to want out.\n\nOnce they confirm they do want out, followed by \"are you sure you're okay with it?\" (which you say \"yes of course, your health is priority here\"), then have the conversation about the non-vested stock - which obviously you keep.\n\nBreathe. Give yourself a chance to recover mentally by taking a week off - after that week it won't feel as bad as the anxiety of the unknown outcome currently feels..\n\nThis is the most important thing to deal with.\n\nGo deal with it.\n\nThen, while recruiting your new Tech Lead (note: \"Tech Lead\" NOT new Co-founder because you shouldn't rush that) start experimenting with Claude/Code/Co-Work automation if you're not already. Use the lack of resource as an opportunity to increase productivity:headcount ratio.\n\nDeal with it today.\n\nTake a week off tomorrow.",
          "score": 3,
          "created_utc": "2026-01-20 16:53:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0p4196",
              "author": "octaviall",
              "text": "I tried to talk to him many times but apparently he refused to do so. I told him that he can be out or just let me know what his plan is so that I can plan next steps, but he just ignored all these messages and emails.",
              "score": 0,
              "created_utc": "2026-01-20 17:08:09",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0ph6sn",
                  "author": "PuddyComb",
                  "text": "What am I doin here",
                  "score": 1,
                  "created_utc": "2026-01-20 18:08:40",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0nzmuh",
          "author": "ReporterCalm6238",
          "text": "Don't you have vesting? Either him or you should be able to quit without keeping shares.",
          "score": 2,
          "created_utc": "2026-01-20 13:50:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0os1nj",
          "author": "Full_Garage3801",
          "text": "No expert here, but I would just go where he is. Talk to him. Express your feelings. See what he thinks and hear what he says. There is a reason maybe that you already know or not in why he does that. And come to a solution together. \n\n\nIt's like fixing a relationship or a marriage. There are things that needs to be talked about in person. Also, this will also help you to. I see frustration and emotions that you have keep. This can help you to be more calm and have less anxiety. ",
          "score": 2,
          "created_utc": "2026-01-20 16:12:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0ota2x",
              "author": "Full_Garage3801",
              "text": "The problem its not vesting or finanncial. Its a human problem. And those are resolved best when are talked in person.\n\n\nHope this helps.",
              "score": 2,
              "created_utc": "2026-01-20 16:18:20",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o0p35eu",
              "author": "octaviall",
              "text": "Thank you. I really tried but he refused to talk to me, not even on a call.",
              "score": 2,
              "created_utc": "2026-01-20 17:04:00",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0yyuzb",
          "author": "Ok-Establishment-319",
          "text": "I recently helped another founder out of an almost identical situation. I can’t help with the equity issue- talk to your lawyer- but if you need someone to evaluate the code base and tell you what kind of person you need to go hire to replace your tech side, I’m happy to help. \n\nI’m thinking of building a public webapp that performs this service for people. I have a private one that just performed a code quality assessment and board-ready report on a code base I’d never seen before, took me an hour to put it all together. In the past this would’ve taken multiple developers multiple days and over $1k.\n\nSo dm if you want help, you can beta test my app, but I’ll also consult you for free briefly alongside it (just enough to produce the report, then you gotta go hire someone new).",
          "score": 2,
          "created_utc": "2026-01-22 01:58:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0uco75",
          "author": "gui_stetelle",
          "text": "equity is meant to ensure contribution. If he can't deliver anything concrete, you need to protect your investment and future.   \n  \nJust make sure to document everything for accountability. don't let the situation drag your whole operation down.   \n  \nyou've got responsibilities, and it's okay to prioritize moving forward.",
          "score": 2,
          "created_utc": "2026-01-21 12:19:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0p4iwt",
          "author": "jasonhon2013",
          "text": "break up sooner is better than later",
          "score": 1,
          "created_utc": "2026-01-20 17:10:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0p8ubw",
          "author": "Odd_Brother_5635",
          "text": "This sounds incredibly hard, and I’m really sorry you’re in this position.\nI think the core issue here isn’t even the health situation, it’s the lack of clear communication and handoff. Illness can explain reduced capacity, but it doesn’t justify leaving a company, investors, and a cofounder in total uncertainty.\nSince neither of you has vested yet and you have external responsibilities, I don’t think it’s unreasonable to ask for a clear yes/no and a concrete timeline, or to formalize expectations around continued service. Being compassionate shouldn’t mean putting the entire company in limbo indefinitely.\nIf I were in your place, I’d involve investors sooner rather than later and move toward a structure that lets the business operate, whether that’s redefining roles or preparing for a founder transition.",
          "score": 1,
          "created_utc": "2026-01-20 17:30:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0pd9bi",
          "author": "Sufficient_Ad_3495",
          "text": "The very minimum he can do is be straightforward with you the fact that you don’t know is a problem and the duties of a person who has received funding in a start-up is heavy.\n\nGive him one more last chance tell him everything that’s about to happen. See if it changes if he doesn’t that’s it this isn’t going to improve unless he does immediately.",
          "score": 1,
          "created_utc": "2026-01-20 17:50:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0plc3w",
          "author": "speckiedee",
          "text": "Document everything, emails, calls, msgs, voice mails, his response, your msgs, time stamps, dates, every single thing you can gather, and keep it aside. If things don’t improve, this documentation can atleast save you and get you out of it.",
          "score": 1,
          "created_utc": "2026-01-20 18:27:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0po2yn",
          "author": "realbrownsugar",
          "text": "Your cofounder needs to grow up and realize that it's okay to be optimistic about timelines, and if they don't meet it, it's okay to be honest about it... than think that they would look bad, and lie about status, and take up more work, and now you have n + 1 things that you can't deliver, and be stressed about it, and wish it away by not reading emails.\n\nSit down with your cofounder like an adult and have a list of things that they wanted to deliver and go line by line and ask them to be honest about the status. Let them get it off their chest... and then you two can decide whether you want to continue down this path. You will need to understand their mental model of deliverables, and they will need to know your mental model of how hard these requirements are... and vice versa with things you are accountable for.\n\nIn the end you may realize you can't work with their way of work. Or, you may thing thats okay.\n\nSource: I did this in my very first job 25 years ago, and yes, I physically got sick from the stress.",
          "score": 1,
          "created_utc": "2026-01-20 18:39:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0q2vay",
          "author": "Livid-Car-4609",
          "text": "Have you tried confiding in investors? I believe if you take them in confidence then they would help you out in pushing him out. And btw, he has to go. 100%. No ifs and buts about it. The earlier you do this better it is.",
          "score": 1,
          "created_utc": "2026-01-20 19:46:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0r8rk2",
          "author": "voycey",
          "text": "That is not a good cofounder match, health is one thing but lack of accountability and path forward is something else altogether.\n\nI would just ensure that you are covered by contracts etc",
          "score": 1,
          "created_utc": "2026-01-20 23:06:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0rd8wx",
          "author": "MelMentalHealthAI",
          "text": "Never been in this situation but my first instinct is also talk go investors and hopefully everyone can talk it out.",
          "score": 1,
          "created_utc": "2026-01-20 23:30:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0rs562",
          "author": "rt2828",
          "text": "Great lesson for all that this situation should have been anticipated in the original founders agreement.",
          "score": 1,
          "created_utc": "2026-01-21 00:51:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ru7n5",
          "author": "kimsart",
          "text": "Here's what's alarming me in your situation. Your tech founder isn't just ill. They are not communicating. I'm concerned if you send that letter, they might refuse to turn over whatever works been done so far. \n\nWithout the letter, Can you convince them to give you owner access to the work they have already done, so you can somehow keep moving forward while they recover? After you have access and if they don't show up by end of month start the process. \n\nHave they said what their illness is? Is this a flare of an existing condition or something new? I hear them when they say that it's stress induced but they are the one who signed onto this project. Their avoidance response is causing you stress.",
          "score": 1,
          "created_utc": "2026-01-21 01:03:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0s9yqd",
          "author": "an_albino_rhino",
          "text": "Completely unacceptable behavior from a cofounder. There’s no coming back from this - if you’re serious about your business you need to get rid of him ASAP.\n\nDo this:\n- Talk to company counsel and tell them you want to terminate your cofounder. They should know what to review to make sure your bases are covered (bylaws, EIP, employment contract, etc).\n- Reach out to cofounder for conversation. Fire him - keep convo short, objective. Expect him to be emotional, don’t budge. Make an earnest effort to have the conversation in person. If he’s unwilling, phone is next best, worst case you send an email.\n- Notify key investors (leads, biggest checks). Explain the decision you made. Answer questions, then enlist their help to find a replacement.\n- Go find a replacement (if you need one).\n\nYour investors will respect you for making the tough decision that’s best for the company. Your cofounder won’t be happy, and you’ll likely burn that bridge - that’s unfortunately the nature of this beast, and a very real possibility when you get into business with someone you know.\n\nFeels awful; believe me, I know - I’ve had to fire very close friends, employees who sacrificed a ton and had been with the company for years and done great work, and employees with complicated personal situations that make me deeply empathetic for them. All of them have been terrible experiences that I’ll remember forever, but I regret none of them.\n\nGood luck.",
          "score": 1,
          "created_utc": "2026-01-21 02:33:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ybbi2",
          "author": "glowandgo_",
          "text": "this is one of those cases where empathy and governance collide... health issues explain absence, they dont remove the need for clarity, esp with investors involved. in my exp silence is the real problem here, not reduced output. issuing notice isnt aggressive, its creating a forcing function so you arent frozen indefinitely. id frame it as protecting the company, not punishing him.,.",
          "score": 1,
          "created_utc": "2026-01-21 23:48:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0z02j4",
          "author": "rtx097",
          "text": "It’s clear. He’s got to go. This is exactly what the cliff is for.",
          "score": 1,
          "created_utc": "2026-01-22 02:05:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0zjbhl",
          "author": "Plenty_Object_4826",
          "text": "this is a board decision - who is on the board?",
          "score": 1,
          "created_utc": "2026-01-22 03:56:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0zwq5b",
              "author": "octaviall",
              "text": "Only two of us lol",
              "score": 1,
              "created_utc": "2026-01-22 05:27:07",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o133z9n",
                  "author": "Plenty_Object_4826",
                  "text": "i'd talk to my lead investor to figure out how to pause vesting. be honest about what is going on.",
                  "score": 1,
                  "created_utc": "2026-01-22 17:55:16",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0zjo2v",
          "author": "Bonnie-Chamberlin",
          "text": "Fire him and select the new CEO if he is the CEO now. We just recently fired our CMO. Similar situation, the guy never got things done although promised thousands of times.",
          "score": 1,
          "created_utc": "2026-01-22 03:59:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o105uku",
          "author": "buildwithkarl",
          "text": "I would move to fire him. I saw that you said he has more equity. When the company was formed what were the terms outlined for how removing a cofounder would be carried out?\n\nIs a board formed? I saw you have investors. Are they on the board as well?",
          "score": 1,
          "created_utc": "2026-01-22 06:39:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o12hsgb",
              "author": "octaviall",
              "text": "Only two of us are on the board so far. I am not sure if he will come after me if I “fire” him due to the lack of continuous service.",
              "score": 1,
              "created_utc": "2026-01-22 16:15:34",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o15xw5x",
          "author": "DylanFromCheers",
          "text": "I went through YC and had a cofounder breakup. Breakups suck. Bad. But it's always better earlier than later if it's unavoidable.",
          "score": 1,
          "created_utc": "2026-01-23 02:21:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o16t56b",
          "author": "Willing-Training1020",
          "text": "this is a really tough spot and i don't think you're being unreasonable at all. health issues are serious and deserve empathy, but so does the reality that you have investors, users, and a company that needs to keep moving. being understanding doesn't mean being indefinitely paralyzed.\n\na few thoughts: 1) the vesting cliff exists for exactly this kind of situation — if he's not actively contributing, it's fair to have a direct conversation about what happens if he can't return. that's not aggressive, it's just how founder agreements are supposed to work. 2) loop in your investors now if you haven't already — they've seen this before and can help mediate or at least give you cover for making hard decisions. 3) document everything in writing, even if he's not responding. you want a clear paper trail if this gets messy later.\n\nalso practically speaking — if you need to keep the product moving, you might need to bring in contract dev help or even a fractional cto to bridge the gap. i've seen founders in similar spots hire senior remote devs from latam or sea on short notice just to keep things from stalling while they figure out the cofounder situation. not a permanent fix but buys you time without burning runway. good luck, this stuff is never easy but you're not wrong for wanting clarity 🤞",
          "score": 1,
          "created_utc": "2026-01-23 05:32:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o17fcwv",
          "author": "Kitchen-Teach9326",
          "text": "You are fuked. Gg",
          "score": 1,
          "created_utc": "2026-01-23 08:38:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1bekvv",
          "author": "Timberpos",
          "text": "Sounds like you need another co founder",
          "score": 1,
          "created_utc": "2026-01-23 21:48:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1do7dd",
          "author": "Lucky__6147",
          "text": "Did you form a board? Talk to your investors about firing him",
          "score": 1,
          "created_utc": "2026-01-24 05:39:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1ev4gw",
          "author": "NoFun6873",
          "text": "Sadly, large companies are the place where you have the funding and volume of people to fund this type of situation. He needs to go and not only because he is not getting his work done but he is not communicating to you. I would get a lawyer and make sure the details such as NDA’s and assignment of invention are in order first. Also, do not let him cross the 1 year clip, you need that for the next person.",
          "score": 1,
          "created_utc": "2026-01-24 11:58:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1fnkxq",
          "author": "venturly",
          "text": "If you want some 1-1 advice I’d be happy to have a chat. I dealt with this same thing but on hard mode because mine had pretty much unlimited resources for court.\n\nYou need to at the very least immediately stop the vesting, he is not doing the work therefore no vesting. It’s not an attack on him, it’s just the reality of the situation. If he was a good partner at some point you can give him a chance to come back within a certain period of time and prove that he’s in it with you.\n\nNext, you need to discretely start having conversations with your investors. Some might disagree but if this turns into an actual dispute, this step is what’s going to save you. Frame it as concern for the company as a whole. Be fair to him when having those discussions.",
          "score": 1,
          "created_utc": "2026-01-24 14:59:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1rq0mq",
          "author": "Fit-Tumbleweed-2426",
          "text": "Hey, I faced the exact same issues, except the involvement of investors and legal entity formation due to which I had the courage to ask him to part. It's very tough, I understand. After someone gets familiar with ideas and codebase, it's tough to find a replacement. But you have to find a replacement first, add him and teach him and then you have to let go of your co-founder. There's no other way out here other than letting that person go. I faced the same, I know it.",
          "score": 1,
          "created_utc": "2026-01-26 05:43:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0or60h",
          "author": "Dangerous_Session612",
          "text": "Hi Pal,\n\nTake it with a grain of salt 🧂 \n\nThat’s the way it is - very common \na) he can’t finish it (or)\nb) he’s lazy / procrastinating \n\nEither way it’s not getting done.\n\nSomeone has to take responsibility - document things - \n\nProtect the investors & your reputation and hire someone “to get it done”…. \n\nDeal with whoever it is that’s dragging their feet down the road - when it’s making money or about to go big - you can bet your butt, he’ll show up and want to honour the contract.\n\nIt’s just the way it is - marriage is the same way - someone is always putting in more work than the other, and you hope it balances out in the long run.\n\nDon’t get cynical - you’re not alone - it’s a relationship and it’s just the way it is.\n\n\n Now get back to work, be professional, be polite, protect your money and get results 😎\n\nMake sure you swing back and help another startup founder down the road.",
          "score": 0,
          "created_utc": "2026-01-20 16:08:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0oxakx",
          "author": "PuddyComb",
          "text": "ok well; if you look at the numbers.  \nyou have like 25,000 other people who actually need that job, and would\\* in fact be working and building. He's a disappointment to like, a tenth of the country. Congratulate him for me.",
          "score": 0,
          "created_utc": "2026-01-20 16:36:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ogtou",
          "author": "MrMiougi",
          "text": "I’m sorry you’re in this — and I’ll be blunt: the biggest issue here isn’t even the illness, it’s the lack of clear communication and accountability.\n\nIf someone is genuinely sick, that’s real. But going dark for weeks, repeatedly promising “today/this week,” ignoring your attempts to clarify expectations, and then flipping it into “you have no empathy” when you ask for basics… that’s not a workable partnership dynamic. Whatever the cause (health, burnout, avoidance, conflict), you can’t run a company in limbo.\n\nA few things stand out:\n\n* **You have investors and a living company.** Bills, obligations, and momentum don’t pause because a cofounder disappears.\n* **Neither of you has vested yet (1-year cliff).** That’s not a technicality — it’s literally designed for situations where the founding team doesn’t end up functioning.\n* **You’ve already tried the empathetic route.** You slowed down, carried ops, reached out repeatedly, and asked for clarity. You didn’t jump straight to legal threats.\n\nAt this point, I’d stop treating this as “how long do I wait?” and start treating it as **“how do I get the company out of hostage mode?”**\n\nIf it were me, I’d do two things in parallel:\n\n1. **Get a real decision deadline on the table.** Not “when you feel better,” but something like: *Are you able to actively contribute X hours/week and be reachable within 24–48h? If not, we need to restructure immediately (leave of absence / reduced role / separation).* This isn’t cruel — it’s operational reality.\n2. **Bring investors into the loop now (measured, not dramatic).** Not as a threat, but as transparency: *“Here’s what’s happening, here’s what I’ve tried, here’s the risk to the business, here are the options.”* Don’t frame it as “he’s a bad person.” Frame it as **the business can’t be blocked indefinitely**. Most investors would rather help you solve it than watch the company drift into a slow failure with money trapped inside.\n\nRe: **formal notice / vesting** — I think it’s reasonable. The cliff exists for a reason. You’re not “screwing him over” by acknowledging that continued service and participation matter. Illness can explain reduced capacity, but it doesn’t justify holding the company hostage with zero clarity.\n\nPossible outcomes you can propose (so it doesn’t feel like an attack):\n\n* Medical leave + temporary transfer of decision-making + clear check-in cadence\n* Role change (advisor) + equity adjustment\n* Separation (unvested equity returns to the company) + you recruit a new technical cofounder/CTO\n\nYou’re allowed to be compassionate **and** set boundaries. Empathy isn’t “I accept indefinite ambiguity while the company dies.”\n\nOne practical note: talk to a startup lawyer before sending anything that sounds like legal notice. But yes — from the outside, this situation already reads unworkable unless he can immediately re-engage with clear commitments.\n\nIf you want to talk it through, feel free to DM — I’ve been in a similar seat before and I’m happy to sanity-check next steps. And seriously: take care of your health too.",
          "score": -7,
          "created_utc": "2026-01-20 15:19:52",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0q31mu",
              "author": "Livid-Car-4609",
              "text": "Bro is this chatgpt? WTF is this reply man",
              "score": 2,
              "created_utc": "2026-01-20 19:47:40",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o14bq68",
                  "author": "MrMiougi",
                  "text": "wow on the hate. of course it's chatgpt. I'm not a native English speaker so run everything through chatgpt.",
                  "score": 1,
                  "created_utc": "2026-01-22 21:14:10",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0o4red",
          "author": "Any-Club-2535",
          "text": "Hey I am a sr dev, I will be happy to help you understand your setup and guide you if need help. I won’t be able to join your team tho.",
          "score": -4,
          "created_utc": "2026-01-20 14:18:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ordv7",
          "author": "HelpfulSource7871",
          "text": "we supported and are supporting multiple startups, acting as interim CTO and shipped MVPs with reasonable costs. DM if interested.",
          "score": -5,
          "created_utc": "2026-01-20 16:09:37",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qi572l",
      "title": "Are B2B SaaS becoming harder to defend in the age of AI?",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1qi572l/are_b2b_saas_becoming_harder_to_defend_in_the_age/",
      "author": "Careful-Cup4161",
      "created_utc": "2026-01-20 16:08:38",
      "score": 37,
      "num_comments": 39,
      "upvote_ratio": 0.86,
      "text": "I launched a product about a year ago. At one point, we were relying on 4 different third-party partners for fairly specific features. Recently, with tools like Claude, my CTO rebuilt most of what those partners were providing, and at a fraction of the cost.\n\nInitially, we were a niche product and struggled to scale, which led us to consider turning it into a more traditional B2B SaaS. But with Claude and the current wave of AI tools, it feels like the barrier to building SaaS products has dropped dramatically. A lot of things that used to justify standalone tools can now be built in weeks.\n\nBecause of that, we decided to expand our market and focus on a segment that seems harder to clone with AI: payments, with a very specific value proposition and real operational complexity.\n\nCurious how other founders here think about building defensible B2B SaaS today.  \nWhat kinds of moats still make sense in your experience?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1qi572l/are_b2b_saas_becoming_harder_to_defend_in_the_age/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o0ovpwg",
          "author": "clr0101",
          "text": "The bareer has definitely dropped - now I think the main differentiation is your GTM / ability to build a standard and a community around your product.  \nI also agree that going into more niche products - that AI agents are worst at like payments - or where security is sensitive and you can't rely on AI-generated code, is a good strategy",
          "score": 9,
          "created_utc": "2026-01-20 16:29:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0p7fhv",
              "author": "Careful-Cup4161",
              "text": "yes a community is the best way to do it because you've you're gtm  \nbut depending on the niche it's pretty difficult to build one",
              "score": 3,
              "created_utc": "2026-01-20 17:23:57",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o0szi7z",
              "author": "theregoesmyfutur",
              "text": "how do you build a standard in big b2b industries ? what size biz are you thinking about",
              "score": 1,
              "created_utc": "2026-01-21 05:14:18",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0tine8",
                  "author": "clr0101",
                  "text": "I’m not sure it’s a question of size - meaning size of team of revenue - you can have small team of open source products that can build fundamental tech frameworks for others to use",
                  "score": 2,
                  "created_utc": "2026-01-21 07:54:03",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0q0dze",
          "author": "-night_knight_",
          "text": "ive just watched an interview with a founder of a huge local ecom shop, and he mentioned that they just replaced a $300k/year software with an alternative they built in-house in <4 months",
          "score": 11,
          "created_utc": "2026-01-20 19:35:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0tzzn7",
              "author": "totally_random_man",
              "text": "300k/year is totally extortionate. However building and maintaining your own software is also hard.",
              "score": 8,
              "created_utc": "2026-01-21 10:38:17",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o0tpe1n",
              "author": "Careful-Cup4161",
              "text": "it's huge, what's the company?",
              "score": 3,
              "created_utc": "2026-01-21 08:57:52",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0tpwhs",
                  "author": "-night_knight_",
                  "text": "GymBeam",
                  "score": 3,
                  "created_utc": "2026-01-21 09:02:47",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0r3lys",
          "author": "procky10178",
          "text": "Build a very niche product where implementation is a challenge. I’m building a customisable internal audit analytics platform (purely b2b SaaS) and have found that most companies do not have any analytics in audit because they tried and realised that ideation of easy but implementation is a bitch!",
          "score": 3,
          "created_utc": "2026-01-20 22:39:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0tpkzw",
              "author": "Careful-Cup4161",
              "text": "And how is your company doing?",
              "score": 1,
              "created_utc": "2026-01-21 08:59:43",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0u3qrq",
                  "author": "procky10178",
                  "text": "Hands are full.",
                  "score": 2,
                  "created_utc": "2026-01-21 11:10:54",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0rby40",
          "author": "glowandgo_",
          "text": "i think ai mostly kills thin feature moats, not real businesses. anything that’s just glue code or a nice ui is easier to replicate now. what still holds up is deep domain mess, data, workflows, and ops pain that takes time to learn. payments makes sense for that reason, the complexity isnt just technical.,,.",
          "score": 5,
          "created_utc": "2026-01-20 23:23:08",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0szv05",
              "author": "theregoesmyfutur",
              "text": "any examples outside of payments?",
              "score": 3,
              "created_utc": "2026-01-21 05:16:53",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o0tpmhu",
              "author": "Careful-Cup4161",
              "text": "agree",
              "score": 1,
              "created_utc": "2026-01-21 09:00:07",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0s8lkv",
          "author": "luketron",
          "text": "It depends a bit on what the other \"B\" in \"B2B\" SaaS entails — if it's SaaS supporting SaaS, then yeah that's going to be a harder sell because the buy vs build equation has changed, especially at the cost-sensitive end of the spectrum.\n\nFor larger companies though, it's still usually preferable to buy rather than build simply because focus matters and spending on growth trumps spending on optimising costs.\n\nThe biggest mindset shift though IMO is extrapolating what's happened to coding to what's happening/going to continue to happen to almost all white-collar work everywhere. That's the massive opportunity that's well underway. Added some more thoughts here: https://www.reddit.com/r/ycombinator/comments/1qil3jo/mindset_shift_for_b2b_founders_deliver_the_work/",
          "score": 5,
          "created_utc": "2026-01-21 02:25:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0tpzri",
              "author": "Careful-Cup4161",
              "text": "hanks for sharing, I agree, these are exciting times to build because everything is easy to build, but what’s hard is distribution. AI can help with that, but you still need to try and fail to understand what works. It’s not on autopilot.",
              "score": 2,
              "created_utc": "2026-01-21 09:03:42",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0twk0c",
                  "author": "luketron",
                  "text": "For sure, there’s still only a fixed amount of human attention to go around!",
                  "score": 1,
                  "created_utc": "2026-01-21 10:06:43",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0q03ie",
          "author": "CoolSnow01",
          "text": "Back to the basics: Porter 5 forces\n\n\nIf building standalone solutions becomes easier and cheaper:\n- More competitors pop up.\n- Clients have more options to choose from.\n- Alternative paths like clients going in-house become more usual.\n\n\nIn other words, the more you depend on features, the more replaceable you are.",
          "score": 3,
          "created_utc": "2026-01-20 19:34:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0szokq",
              "author": "theregoesmyfutur",
              "text": "if not features, then what do you depend on, data?",
              "score": 2,
              "created_utc": "2026-01-21 05:15:35",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o0vlf14",
                  "author": "CoolSnow01",
                  "text": "Data is only as good as what you can do with it. Read my response to the other comment.",
                  "score": 1,
                  "created_utc": "2026-01-21 16:15:48",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o0tpi5o",
              "author": "Careful-Cup4161",
              "text": "if features are replaceable, what isn’t it?",
              "score": 1,
              "created_utc": "2026-01-21 08:58:58",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0vl7x0",
                  "author": "CoolSnow01",
                  "text": "In building lasting advantages that competitors can't replicate in a weekend.\n\n\nI.e.: Being the only that can do X in Z way, being the gatekeeper of a resource, having a differentiated brand, presence on X distribution channels, suite/bundle of products with reinforcing benefits, etc.\n\n\nThe key concept is \"uniquely positioned to solve X\".\n\n\nDoes that make sense framed this way?",
                  "score": 2,
                  "created_utc": "2026-01-21 16:14:55",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o0sfkui",
          "author": "worldprowler",
          "text": "Yes, much harder, but not unlike when everything went \"mobile-first\", it just became a minimum requirement. Same when everything went \"cloud\". It used to be hard to build mobile-first in the cloud, until it was not.",
          "score": 3,
          "created_utc": "2026-01-21 03:05:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0tq0ub",
              "author": "Careful-Cup4161",
              "text": "agree with you",
              "score": 1,
              "created_utc": "2026-01-21 09:03:59",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o0rjk0y",
          "author": "Asleep-Boat7059",
          "text": "And on top of what everyone says, the whole differentiation of a SaaS system is its price, SLA and scale.",
          "score": 2,
          "created_utc": "2026-01-21 00:04:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0tpomi",
              "author": "Careful-Cup4161",
              "text": "agree with you",
              "score": 1,
              "created_utc": "2026-01-21 09:00:41",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1dsi0a",
          "author": "Hey_girl-hey",
          "text": "I just launched a B2B SaaS application that is a Governed Workflow. I literally launched it today. I had to make some fixes but it is launched.",
          "score": 2,
          "created_utc": "2026-01-24 06:13:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0oypg6",
          "author": "macromind",
          "text": "I think you are right that pure feature moats are getting thinner fast. The stuff that still feels defensible (even with AI) is distribution, data that compounds, workflow embedding, and messy operational complexity (payments is a good example).\n\nOne lens thats helped me is: can a copycat ship it, but still not get adopted because switching costs and trust are the real barrier?\n\nIf youre thinking through positioning and go to market for B2B SaaS, Ive seen some solid discussions around this in https://www.reddit.com/r/Promarkia/ too.",
          "score": 4,
          "created_utc": "2026-01-20 16:43:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0p79f8",
              "author": "Careful-Cup4161",
              "text": "thanks!",
              "score": 1,
              "created_utc": "2026-01-20 17:23:09",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o0szq2k",
              "author": "theregoesmyfutur",
              "text": "can you eli5 workflow embedding?",
              "score": 1,
              "created_utc": "2026-01-21 05:15:53",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o0u0kbb",
          "author": "FrontTap8510",
          "text": "I think the mistake is assuming “hard to build” ever meant “defensible.” Most SaaS wasn’t protected by code, it was protected by everything around it. AI makes it easy to rebuild features, but it doesn’t make it easy to:  \n  \n\\- Own a workflow people depend on daily  \n\\- Earn trust where mistakes actually hurt  \n\\- Deal with edge cases and reliability long term\n\nWhat Claude replaced for you sounds more like partner features than the real product. Payments is defensible not because it’s hard to code, but because errors are expensive and switching is painful.\n\nMoats that still feel real imo:  \n  \n\\- Workflow lock-in, not features  \n\\- Trust and distribution  \n\\- Data that compounds through usage",
          "score": 1,
          "created_utc": "2026-01-21 10:43:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0ynts1",
          "author": "Willing-Training1020",
          "text": "yeah this is something i think about a lot lately. the \"build vs buy\" math has completely shifted — stuff that used to take months and justify paying for a tool can now be hacked together in a weekend with claude or cursor lol. honestly terrifying if you're building pure software plays without much else going for you.\n\nfrom what i've seen, the moats that still hold up are things ai can't easily replicate: network effects, proprietary data, deep integrations that are painful to rip out, and honestly... operational complexity like you mentioned with payments. also think there's something to be said for trust/brand in regulated spaces — healthcare, fintech, legal — where people won't just switch to some new ai-generated tool overnight. curious what made you land on payments specifically, and how you're thinking about the go-to-market there?",
          "score": 1,
          "created_utc": "2026-01-22 00:55:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o119wps",
          "author": "CountBubbly7592",
          "text": "People are confusing cheap feature cloning with real defensibility. AI wrappers don’t replace reliability, accountability, or ops. Copilot and AI support have already made critical infra worse, not cheaper. LLMs are unfinished, savings are fake, and the backlash is coming once buyers notice.",
          "score": 1,
          "created_utc": "2026-01-22 12:26:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o11f8j2",
              "author": "Careful-Cup4161",
              "text": "yes 100% agree",
              "score": 1,
              "created_utc": "2026-01-22 13:01:10",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o11g8y9",
          "author": "GetNachoNacho",
          "text": "AI tools like Claude are lowering the barriers for building new products. You’re absolutely right any features that used to require specialized third-party integrations can now be built in-house, which definitely impacts how SaaS companies think about defensibility. Focusing on payments with a complex value proposition seems like a good move, especially when you can offer something AI can’t easily replicate",
          "score": 1,
          "created_utc": "2026-01-22 13:07:17",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o163211",
          "author": "arpansac",
          "text": "I agree that this has happened. On the other hand, there are multiple factors:\n\n1. The business goal of the company\n2. The tool is it that crucial for them so that they would want to build it in-house\n3. Is the tool very costly? Then probably they could save a lot of money. In the age of AI, people are constantly pushing towards saving that money by spending on AI\n4. How well or deeply is it integrated in the customer's stack\n\nYou can see tools like task management ones are still very much needed on the company level. A company might not go and start building their own task management tool immediately, but they might build their own lead management or market reporting tool for which they were collecting data from different sources and it was getting displayed on a dashboard for which they might be paying a few thousand dollars a year.",
          "score": 1,
          "created_utc": "2026-01-23 02:50:02",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qjrabb",
      "title": "Need advice on how to protect the idea while hunting for a technical co founder",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1qjrabb/need_advice_on_how_to_protect_the_idea_while/",
      "author": "original4040",
      "created_utc": "2026-01-22 10:40:38",
      "score": 35,
      "num_comments": 78,
      "upvote_ratio": 0.71,
      "text": "Hi, I have a solid business plan/idea and am looking for a technical co founder to apply for the next batch of Ycombinator. I have spoken to a few people who are interested in getting on board but they want to know the full idea and USP of the product/service.\n\nDoes anyone have experience with similar situations and the best way to deal with it? Some of these people are already very well connected as they have been working with for startups longer than me, so I am not certain wether its appropriate to share, kind of sucks trying to build something without being a techie.\n\nEDIT: Thank you everyone for your criticism,feedback,advice and most of all sharing your experiences. This thread has been so helpful and I am sure it will help many people. I believe there are enough comments stating “IDEAS ARE WORTHLESS” so unless you have anything new to add you should probably refrain from commenting. Try and stay positive guys, cheers!",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1qjrabb/need_advice_on_how_to_protect_the_idea_while/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o117kka",
          "author": "hau5keeping",
          "text": "Ideas are worthless at your stage",
          "score": 165,
          "created_utc": "2026-01-22 12:10:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o121d7a",
              "author": "Scary_Panic3165",
              "text": "OP should consult to his father. Just listen your father if your idea worth something then he would help. If it worths nothing he would tell you directly “this shit is trash spend ur time on something else.” Most transparent reviews comes from fathers. Never open to market with an idea which has not been approved by your father. It may sound stupid but your father is the only guy who can give you most transparent reviews without adding fancy words to make you happy.",
              "score": 4,
              "created_utc": "2026-01-22 14:58:51",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o125lhr",
                  "author": "hau5keeping",
                  "text": "\\> your father is the only guy who can give you most transparent reviews without adding fancy words to make you happy.\n\nThis is not universally true, at all.",
                  "score": 19,
                  "created_utc": "2026-01-22 15:19:17",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o15p477",
                  "author": "Crowley-Barns",
                  "text": "That may depend on how old your dad is lol. \n\nIf you’re 60 and he’s 80 he may no longer be The Man. \n\n(If you’re 12 and he’s 30, he probably knows better.)",
                  "score": 2,
                  "created_utc": "2026-01-23 01:32:36",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o12lign",
                  "author": "original4040",
                  "text": "Is this satire? 😂",
                  "score": 6,
                  "created_utc": "2026-01-22 16:32:06",
                  "is_submitter": true,
                  "replies": []
                },
                {
                  "id": "o12tm1r",
                  "author": "KlutzyBiscotti807",
                  "text": "True in my experience",
                  "score": 0,
                  "created_utc": "2026-01-22 17:08:32",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o14jbfk",
              "author": "b1-88er",
              "text": "At any stage.",
              "score": 2,
              "created_utc": "2026-01-22 21:50:36",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o13xfj7",
              "author": "easyEggplant",
              "text": "Oh no, someone is going to steal my tar pit!\n*clutches pearls*",
              "score": 0,
              "created_utc": "2026-01-22 20:07:03",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o118tky",
          "author": "Wonderful-Pie6185",
          "text": "I used to think the same way tbh. Once I actually started building, I realised the product keeps changing every week anyway what you imagine rn won’t be what you ship. So it aint worth protecting rn before any validation. Also, if someone needs the entire plan before they even consider joining, that usually means they require whole picture and execution that you have in ur mind instead of vague explanations.",
          "score": 42,
          "created_utc": "2026-01-22 12:19:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o11d9qq",
              "author": "original4040",
              "text": "Thats well put,thanks!",
              "score": 2,
              "created_utc": "2026-01-22 12:48:56",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1183r4",
          "author": "Willing-Training1020",
          "text": "tbh ideas are rarely as protectable (or as valuable) as founders think early on — execution is what actually matters, and any decent technical cofounder will want to understand the full picture before committing. that said, i get the hesitation, especially with well-connected folks who could theoretically run with it.\n\na few things that helped me: 1) talk to a lot of people so no single convo feels high-stakes, 2) share the problem and approach but maybe hold back the super specific distribution/GTM angle if that's your edge, and 3) trust your gut — if someone feels off, move on. also fwiw, most techies are too busy with their own stuff to steal ideas lol. the bigger risk is usually not finding anyone willing to build it with you. good luck with yc! 🤞",
          "score": 25,
          "created_utc": "2026-01-22 12:14:12",
          "is_submitter": false,
          "replies": [
            {
              "id": "o11dda0",
              "author": "original4040",
              "text": "Appreciate it, thanks!",
              "score": 0,
              "created_utc": "2026-01-22 12:49:34",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o11wku1",
          "author": "quietoddsreader",
          "text": "this comes up a lot, but the uncomfortable truth is that if you can’t share the idea, you’re not ready to recruit a cofounder. at seed stage, the idea is the least defensible part. execution, speed, and founder quality matter far more. strong technical people aren’t looking to steal concepts, they’re deciding whether the problem is real and whether you’re someone they want to grind with for years.\n\nwhat you should protect is leverage, not secrecy. that means having real insight into the problem, early user context, or momentum that can’t be copied from a doc. if someone hearing the full idea is enough to sink you, the risk isn’t them, it’s the fragility of the plan.",
          "score": 7,
          "created_utc": "2026-01-22 14:35:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o11ldgk",
          "author": "ComprehensiveUse5627",
          "text": "The thing is most people can’t stay consistent. Maybe they'll start working on it after you tell them, but they’ll most certainly stop a few months later anyway because they have no faith or obsession in it.\n\nSo don’t hold back. Talk as much as you want and keep building it incrementally to build a great team. It’s going to take a lot more than you think.",
          "score": 3,
          "created_utc": "2026-01-22 13:36:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o11w833",
          "author": "Own-Claim-6577",
          "text": "Your idea is worthless basically. Only time you ever need protection is if you genuinely built a novel technical product. Also, why not vibe code it, easier to get technical people on board when you already started working on the project.",
          "score": 3,
          "created_utc": "2026-01-22 14:33:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o11glf7",
          "author": "Anonymous-Gu",
          "text": "People talk a lot about product market fit but not enough about idea founder fit. It’s not because you had a great idea that you are the best person to execute it. If you bring something else to the table like some knowledge about the market, a network, ability to fundraise, attract customers, communicate, etc. then a technical cofounder will want to collaborate with you as he’ll see value on what you will be contributing on",
          "score": 8,
          "created_utc": "2026-01-22 13:09:21",
          "is_submitter": false,
          "replies": [
            {
              "id": "o11ime1",
              "author": "original4040",
              "text": "Yeah I have all of those figured out and also know what value i bring to the table in terms of my experience with marketing, end to end operations and most importantly networks. Although your insights are helpful, It would be great if you answer my question.",
              "score": 1,
              "created_utc": "2026-01-22 13:21:05",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o11juyj",
                  "author": "Anonymous-Gu",
                  "text": "My point is clear: don’t be afraid to share your idea with everyone if you’re confident in the value you’ll bring to the table besides the idea",
                  "score": 4,
                  "created_utc": "2026-01-22 13:28:02",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o1222r8",
          "author": "kube1et",
          "text": "Ideas are like assholes. Everybody's got one.\n\n\\~ Kevin O’Leary, Frank Zappa",
          "score": 7,
          "created_utc": "2026-01-22 15:02:20",
          "is_submitter": false,
          "replies": [
            {
              "id": "o122x7h",
              "author": "original4040",
              "text": "Beautiful❤️",
              "score": 1,
              "created_utc": "2026-01-22 15:06:27",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1302aj",
          "author": "Pretend_Intern5670",
          "text": "Ideas are worth a dime a dozen! At this stage tell as many people as possible about your idea - you will only refine it. 2 things may happen - \n1. Someone will validate it and say this is good.\n2. Someone will say its bs, dont bother me.\n\nYou'll get your answer.\n\nIf someone can be a millionaire with your idea then why are you not? Because it takes time and effort. \n\nEvery person will be ready to preach lessons on how and what to do! But no one will take the time and effort to actually execute. \n\nThe idea doesn't matter at this stage - effort does. \n\nAnd if you are not willing to put in enough effort in the right direction then someone else will definitely move faster than you and you will be left behind insecure thinking he became a millionaire!\n\nBro history doesn't care who's idea was it! it cares who made it! And who was the powerful one who wrote the history. \n\nThink how you can be that millionaire with the same idea and then just execute! Tirelessly execute!",
          "score": 3,
          "created_utc": "2026-01-22 17:37:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1lqxwr",
          "author": "Efrem92",
          "text": "Look at it this way:\nsince everyone has ideas, chances are that someone has already had yours.\nAnd yet, the product doesn’t exist.\n\nWhy? Because execution matters more than the idea itself.\n\nDon’t be afraid of others stealing your idea. Even if that unlikely scenario happens, they might build a similar solution to the same problem, but never the same product. As you’ll see, a product constantly evolves over time: features, design, positioning, and much more.\n\nWhat should you do instead?\nValidate the problem, refine your vision and product, define the next steps required to turn your idea into a successful business. \nPerhaps just determine what information should remain confidential (and to whom it may be disclosed) when seeking a co-founder.\n\nIf you do this, you have no reason to be afraid of someone stealing your idea.\n\nOnce again: execution > idea.",
          "score": 3,
          "created_utc": "2026-01-25 11:52:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o11z0gv",
          "author": "okabe_steins",
          "text": "noone cares about your idea.",
          "score": 6,
          "created_utc": "2026-01-22 14:47:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o13595c",
          "author": "Classic_Chemical_237",
          "text": "Ideas are worth nothing.\n\nIf it is a generic idea that everyone can do, it is worth nothing even if you protect it, because anyone can copy it.\n\nIf it requires special knowledge that you have, then you can tell everyone and still nobody can copy it.",
          "score": 2,
          "created_utc": "2026-01-22 18:00:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o13878h",
          "author": "melodyze",
          "text": "I have given away ideas in nearly every conversation I've had for a decade. I explain business ideas pretty much every time I talk to people, at least hundreds of ideas. I tell people to take them. I want them to. I want to see them become real and I don't have time to build them all.\n\nAs far as I can tell, people have taken a nontrivial idea and built an actual product they shipped as a business twice, and both of them were friends who just already had the same interests as me and were very high agency, and they still required nudging to get them to do it.\n\nSome of those other ideas went on to become big businesses, they weren't all trash. Like for a while in 2020 I talked about llm driven evals and the need for an open source platform for managing them almost constantly. Langfuse, etc, all exist now, but none did then. I'm almost certain I had nothing to do with it. I did the same thing with vector search starting in 2018, wanting a prediction market with open ended resolution criteria that can apply to any outcome that worked with crypto to avoid banking regs, etc, which is now a thing called polymarket. I told countless people these ideas.\n\nSome people thought they were interesting, but ultimately no one really cared beyond a conversation. Very few people have the level of agency and motivation to build even their own most deeply cherished ideas. ~No one has the agency and motivation to build an idea that is just randomly given to them. Even if they agree it's a good idea, if they cared enough about the problem to build a business, they would have already thought about the space and arrived at the idea. Building a business requires that kind of obsession. \n\nThen when building my current business, I talked about the idea constantly for months completely openly, and I met three different people who were already working on the same idea, even though there are no existing public products for it. I picked one to work with.\n\nWe will beat the other ones because we care more, work harder, learn faster, and understand the underlying problem space better. The idea is a commodity.",
          "score": 2,
          "created_utc": "2026-01-22 18:13:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o13zo1m",
          "author": "Hot-Spicy-Potato",
          "text": "Funny how everyone keep insist on that ideas are worthless, when every second post in business subs is about trying to find ideas. \n\nAlso, when went for innovation support, their first advise was to protect before anything at all, they see startups collapsing every day because someone with better resources took their IP. \n\nI always have the urge when someone is saying that ideas are worthless to repsond with saying: \"yours might be but mines are pretty solid\"",
          "score": 2,
          "created_utc": "2026-01-22 20:17:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o14fxtf",
              "author": "BiteyHorse",
              "text": "That's precious of you, but guys who are actual builders with a successful track record get pitched a neverending succession of ideas needing someone good to build them.  Some great, some bad, but you choose what to tackle based on the person pitching it.",
              "score": 0,
              "created_utc": "2026-01-22 21:34:13",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o16szjt",
          "author": "Glum_Ad_6823",
          "text": "If you have an idea, share it. Don’t be afraid, many people won’t even interested and think it’s not a good idea. Execution and commitment to building something valuable and durable is the moat. Netflix, Block Buster thought it wasn’t even worth a million dollars when offered to acquire. Even the “smartest” executives think brilliant ideas are worthless. The fastest way to build is to express it. Don’t let fear stop you from building.",
          "score": 2,
          "created_utc": "2026-01-23 05:31:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1envqd",
          "author": "UpperIndependence609",
          "text": "Sam Altman said something that stood out to me. He said that great startup ideas usually sound stupid and worthless, which is why, at the early stage, it's not really important to protect your idea. It will sound terrible for people anyway. However, if it sounds like the next NVIDIA and a trillion-dollar opportunity, you probably should be concerned. These are the company ideas that frequently fail.",
          "score": 2,
          "created_utc": "2026-01-24 10:55:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o12nizm",
          "author": "JohnnyKonig",
          "text": "As an advisor and technical cofounder I am often asked to sign NDAs. While I appreciate the intent, it's not practical for people in the industry to sign an NDA just to have a conversation. After a year of signing NDAs I pretty much wouldn't be able to advise anymore because everyone would be considered a competitor.\n\nHowever, there are times where it makes sense to protect information. Here's my general strategy for what it's worth:\n\n**Patents**  \n If a startup has a patentable concept/invention then there's something to protect, if not then generally speaking don't bother. Keep in mind that legally a patent protects an idea by **publicly disclosing it**. So, if you plan on patenting and idea I would use an NDA until the patent is filed - otherwise don't bother.\n\n**Implementation Specifics**  \nYou can generally discuss an idea without going into too much detail about \"how\". I like to use the analogy here of a restaurants \"secret sauce\". Everyone basically knows what's in a restaurants sauce, but they still can't quite reproduce it because there are details left out. Feel free to withhold some details if you don't feel comfortable - there are always key pieces that simply don't have to be explained until later.\n\n**Brevity**   \nIn general, don't offer more detail than is needed for the current conversation. This is not only to protect your advantages, but will go far with people that value their time. For example, if I were working with a startup that had LOIs I wouldn't share any of name of any customers because it's not important. You can say, \"I have a fortune 100 company with a signed LOI\" - don't have to give a name. Individual customers can actually be poached.\n\n**Gut**  \nAt the end of the day, trust your gut. If you are speaking to someone that you think has great intentions and is earnestly offering to help - maybe you offer more info than usual. If the opposite is true then wall-up, smile, and get out. Trust is reciprocal, so be sure that you don't just end up working with people that don't trust you because you couldn't trust them.",
          "score": 2,
          "created_utc": "2026-01-22 16:41:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o12ung8",
              "author": "original4040",
              "text": "Thanks, yeah I am not asking people to sign NDAs as it doesn’t make any sense at this point. Appreciate the originality!",
              "score": 2,
              "created_utc": "2026-01-22 17:13:15",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o117ynj",
          "author": "Silver-Plankton8608",
          "text": "Ideas are easy, execution is the monster!\ncheck cto . monster",
          "score": 1,
          "created_utc": "2026-01-22 12:13:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o11cp2u",
          "author": "HelpfulSource7871",
          "text": "You can ship a MVP without a tech co-founder, there're plenty of tools and plenty other solutions.",
          "score": 1,
          "created_utc": "2026-01-22 12:45:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o14f0yn",
              "author": "BiteyHorse",
              "text": "What an awful approach.  It's building on a foundation of dust and sand.  If you can't persuade a competent tech co-founder to help, its because either you suck or the idea sucks.  Building a shitty MVP without anyone competent guiding development is a red flag for anyone looking in, especially investors.  Deservedly so.",
              "score": 1,
              "created_utc": "2026-01-22 21:29:49",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o17fp55",
                  "author": "original4040",
                  "text": "Agreed!",
                  "score": 1,
                  "created_utc": "2026-01-23 08:41:30",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o125upy",
          "author": "Mompreneur1987",
          "text": "Don’t even bother with YC, without having real numbers. Go vibe code your MVP by yourself, launch, and get your numbers in.",
          "score": 1,
          "created_utc": "2026-01-22 15:20:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o12e4x0",
          "author": "ChrisRocksGG",
          "text": "Well, whatever idea you have it takes a lot of time and dedication to push through (especially distribution). I wouldn’t be afraid. \n\nBeside of that I see low to zero chances if YC reads you never worked together.",
          "score": 1,
          "created_utc": "2026-01-22 15:59:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o12enfo",
          "author": "PuzzleheadedStay4815",
          "text": "Is your idea based on a secret?\n\n(I am referring to Chapter 8 of Zero to One)",
          "score": 1,
          "created_utc": "2026-01-22 16:01:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o12hk2b",
          "author": "No-Highlight1287",
          "text": "noone really cares nowadays just build the product",
          "score": 1,
          "created_utc": "2026-01-22 16:14:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o12il5q",
          "author": "Significant-Level178",
          "text": "You can’t protect your idea. Don’t afraid to share it to the world and especially to people who can be part of your team and potential success. \n\nJust a question for you to think about. Imagine you protected your idea, what’s next? Ok you built a product. What’s next? Will you protect it further or let people know about it? \n\nWho will stop someone to copy your product at that stage?",
          "score": 1,
          "created_utc": "2026-01-22 16:19:11",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o13ente",
          "author": "attn-transformer",
          "text": "When you finally GTM with your idea everyone will see it, then what will stop a better funded team from building a better one, with better distribution? If that’s an issue then don’t build it. \n\nThis is what moat is all about, and the definition of moat changes depending on your stage.\n\nAre you building a dating app? Very hard to have moat early on.\n\nIf what you’re building can easily be copied then don’t build it.",
          "score": 1,
          "created_utc": "2026-01-22 18:42:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o13stq7",
          "author": "GeeBrain",
          "text": "Just build an MVP. In this day and age, if it’s software you should be able to do it with Claude code. \n\nIf it’s hardware, or deep tech, then even more so, you want to sell yourself as capable of executing on the business side, so focus more on actually getting client convos going, confirm the need, sign some LOIs…\n\nIf you don’t have the tech, but have users waiting with a contract in hand, it’ll be a lot more convincing to the technical person. \n\nMost of the time, if the technical person “steals” your idea, and can build + execute on it, then you weren’t really going to provide any value to the product to begin with",
          "score": 1,
          "created_utc": "2026-01-22 19:45:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o13ypmf",
          "author": "CountBubbly7592",
          "text": "Ideas aren’t the problem. Execution and communication are. I’ve onboarded three CTOs in rapid succession and what actually matters is whether you can speak their language and present yourself with clarity and momentum. Technical founders don’t get impressed by secrecy, they get impressed by someone who keeps moving forward no matter what. I didn’t stop when I had a fractured hand, a mental breakdown, co-founders leaving, or when my immigration status was at risk. I keep moving. That’s the signal. If you stop, you’re done. Giving up isn’t an option when you have nothing to lose and everything to gain.",
          "score": 1,
          "created_utc": "2026-01-22 20:13:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o14dyfv",
          "author": "BiteyHorse",
          "text": "Ideas are plentiful, and almost certainly no one cares to \"steal your idea\".  Your only task is to have enough credibility to convince someone good to do all the work, and that you bring enough to the table to be an equal partner.",
          "score": 1,
          "created_utc": "2026-01-22 21:24:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o14ltgz",
          "author": "pizzababa21",
          "text": "think carefully about all of the great ideas which are much better than yours which you never bothered to steal. You'll realise nobody cares to steal your idea. even if they do, and they move quickly, that will only help you by validating it for free. competition isnt a big deal at this stage.\n\nJudging by the fact that you are non technical, i would bet that your idea is probably not as good as you think and you are not a good fit to build it, or if it actually depends a lot on a non technical person with expertise then it is extremely unlikely to be stolen.",
          "score": 1,
          "created_utc": "2026-01-22 22:02:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o15ckmj",
          "author": "glowandgo_",
          "text": "ideas are cheap, execution isnt. if someone can steal it just by hearing it, it probably wasnt defensible anyway. what matters more is whether you trust them and if youre aligned on how to build, not the usp slide. in my exp, strong technical cofounders care way more about problem depth than secrecy.",
          "score": 1,
          "created_utc": "2026-01-23 00:23:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o15wkeb",
          "author": "Heavy-Mongoose1561",
          "text": "No one cares about your idea. Ideas are cheap. People are what is valuable.",
          "score": 1,
          "created_utc": "2026-01-23 02:14:31",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o160690",
          "author": "arpansac",
          "text": "Instead of getting a co-founder immediately, consider hiring a tech lead or a lead developer or head of engineering once you gain confidence. You could step them up into the leadership role.",
          "score": 1,
          "created_utc": "2026-01-23 02:34:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o16xz17",
          "author": "Available_Doughnut71",
          "text": "Create a doc explaining your idea at a high level. Keep focus on problem, problem size, persona and outcomes to have the discussion. And also 1-2 high level USP. That's it. This should allow you to talk freely with multiple prospects as this will avoid any specifics while giving enough information for the co-founder to be interested.\n\nI am also a non-coder solo founder so understand your concern.",
          "score": 1,
          "created_utc": "2026-01-23 06:08:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o17gfcm",
              "author": "original4040",
              "text": "Thanks, appreciate the insights!",
              "score": 1,
              "created_utc": "2026-01-23 08:48:13",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o19ecik",
          "author": "FriscoFrank98",
          "text": "Used to think I needed to “protect my idea”.\n\nThe reality building a company is really really hard. Anyone not building a company, even if they “stole it” probably won’t stick with it.\n\nAnyone building one is too busy with their own shit to worry about yours.",
          "score": 1,
          "created_utc": "2026-01-23 16:15:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o19h4iq",
          "author": "Alarmed-End8826",
          "text": "Great comments and valuable insight in this string. If you’re worried about IP protection, file a provisional patent and be the “first to file”. If/when your idea / product takes off, you have one year to file a non-provisional patent and make changes over a year, or, don’t file and move on. 70% of provisional patents never file a non provisional patent. Ideas are everywhere as stated above, but can you execute and build it?",
          "score": 1,
          "created_utc": "2026-01-23 16:28:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1a7vc9",
          "author": "HominidSimilies",
          "text": "In YC some startup school cofounders definitely steal ideas from the meet and greets.\n\nAt the same time, having a one night stand startup marriage isn’t easy.\n\nWhat’s left?\n\nTalk about the problem space you’re looking to solve but not how.\n\nBuild a sample project together to see if you can even get along and deliver first.\n\nIt separates the talkers from the doers, not just technical cofounder wise but you as well.\n\n If you are worried about it now it’s probably highly copyable and someone’s probably already building it. Ideas are worthless. Execution is everything and leads you to where you’re supposed to be.",
          "score": 1,
          "created_utc": "2026-01-23 18:29:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1effpt",
          "author": "curious_soul_lon",
          "text": "They are right- anyone will want to know the full idea, actually a prototype you have built, your USP, your competitive advantage, market size, your credibility and your ability to deliver on sales etc. \n\nA biggest irony in all this is that after someone has built it, they need to shout it from the rooftop and they’ll find not many people care to check it out. \n\nWorrying about protecting something before validating if it’s worth protecting is a common mistake. Do many prospects care about it to pay for it should be the first question- all other questions are next level. \n\nGood luck 👍🏼",
          "score": 1,
          "created_utc": "2026-01-24 09:38:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1eim0t",
          "author": "udoy1234",
          "text": "Do not try to protect ideas. share them and discuss with smart people. Most ideas don't survive the contact with reality, you need to keep coming up with new ideas anyway, maybe even every week as you iterate. Discussing the best ideas is the way you get the best people hooked.\n\nDon't treat ideas like a scarce resource. Think of ideas like air not gold. It is the execution and PMF that matters the most.",
          "score": 1,
          "created_utc": "2026-01-24 10:07:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1hh87c",
          "author": "canna_queen_1982",
          "text": "I'm in the same boat here. I applied to the YC co-founder matching to see if I could find a technical partner. It's been helpful. If you're really worried about someone taking your IP, draw up some sort of NDA for them to sign. It may help your peace of mind. \n\n  \nGood luck!",
          "score": 1,
          "created_utc": "2026-01-24 19:54:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1hke0k",
          "author": "drivenbilder",
          "text": "In my experience I found that if you aren't brave enough to share your idea, it means you don't believe in your idea enough. The lie we tell ourselves is that we're afraid of it being stolen.\n\nMany people have likely come up with your idea by now and there isn't any way to protect your idea other than by keeping it to yourself. If someone tried to pitch me as vaguely as you are saying you did, I wouldn't want to continue with that conversation either. It's a red flag.",
          "score": 1,
          "created_utc": "2026-01-24 20:08:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1i5zsc",
          "author": "sushantshah-dev",
          "text": "Talk about it. Let's say you build it on your own, you launch, well then the idea is public anyways.",
          "score": 1,
          "created_utc": "2026-01-24 21:51:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1isw9g",
          "author": "SKDPro420",
          "text": "I think you should share your ideas with as many people as possible and partner with as many of them as you can, people who steal your idea wont make it big, but merged with you even multiples guys coming together, with a good mesh of skills can make a difference and grow the business \n\nAlone you can't do it, alone i cant do it, you always need more people passionate about the same idea coming together.\n\nDo you wanna build with me?\n\nDM me lets share ideas!",
          "score": 1,
          "created_utc": "2026-01-24 23:45:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1jsy5x",
          "author": "Sad_Divide4271",
          "text": "Ideas are free.\nIn the world have more then 500 million people and everyone have idea.\nSo execution is king. And you know what you want to build.",
          "score": 1,
          "created_utc": "2026-01-25 03:00:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1rsqo7",
          "author": "Any-Emphasis824",
          "text": "Literally don’t worry about it. Execution matters, not ideas protection.",
          "score": 1,
          "created_utc": "2026-01-26 06:03:13",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1766w8",
          "author": "SkyNetLive",
          "text": "ideas are like a\\*\\*holes. everyone has one",
          "score": 1,
          "created_utc": "2026-01-23 07:16:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o184fw7",
              "author": "Avansear",
              "text": "wise words",
              "score": 1,
              "created_utc": "2026-01-23 12:14:33",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o12xv74",
          "author": "AbbreviationsFun9202",
          "text": "Idea without any execution is *****. I hope you can fit the word.",
          "score": 0,
          "created_utc": "2026-01-22 17:27:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o132g0j",
              "author": "original4040",
              "text": "Thanks for the positivity!",
              "score": 1,
              "created_utc": "2026-01-22 17:48:30",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o147u2e",
          "author": "quang-vybe",
          "text": "bet there are 100 more people who have the same idea as you right now. What'll make the difference is execution (and just doing it, actually)",
          "score": 0,
          "created_utc": "2026-01-22 20:55:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1514ls",
          "author": "Specific_Nebula2760",
          "text": "Every idea under the sun has been thought of, but not all ideas have been acted upon. I was the same way, but thankfully, I realized I don't need much technical help to get started and gain traction.",
          "score": 0,
          "created_utc": "2026-01-22 23:23:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o15k0an",
          "author": "beejee05",
          "text": "Just tell us what you're vibe coding bro, it's not that serious",
          "score": 0,
          "created_utc": "2026-01-23 01:03:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1k2mdz",
          "author": "Best-Management-9679",
          "text": "Ideas mean nothing no matter how strong you feel of succeeding. Currently there are many no code ai agents are present use then and bike MVP and then try to get a tech founder.",
          "score": 0,
          "created_utc": "2026-01-25 03:56:39",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1mmk7y",
          "author": "Representative-Pea30",
          "text": "Realizing ideas are worthless without implementation. There are steps you can take to lay claim to an idea even a unique implementation of code but you want to validate customer demand before you even do that",
          "score": 0,
          "created_utc": "2026-01-25 15:07:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1m3whh",
          "author": "SubstantialCouple389",
          "text": "Sign an nda",
          "score": -1,
          "created_utc": "2026-01-25 13:25:47",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qmudn5",
      "title": "YC founder’s take: go after markets where you’ve got an unfair advantage",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1qmudn5/yc_founders_take_go_after_markets_where_youve_got/",
      "author": "agreea",
      "created_utc": "2026-01-25 20:27:35",
      "score": 33,
      "num_comments": 4,
      "upvote_ratio": 0.8,
      "text": "I'm Agree Ahmed, cofounder of [Flowglad](https://flowglad.com/), an open-source payments provider that handles the entire entire job to be done without any glue code. My entrepreneurial journey started when my coworker and I decided to quite our jobs at a San Francisco fintech and book one way plane tickets to Kenya to start a startup there. Before we had given notice at work, we had already secured one of the first ever permits issued by the Kenyan Central Bank to start a fintech there. We built for a few years there, eventually launching an on-demand grocery app that was the largest in East Africa in 2019. I then started [NUMI.tech](http://NUMI.tech) with the same cofounder. It was a design agency that scaled to $2m annualized revenue on its own balance sheet. We promoted a CEO from within the company to run it so we could focus on Flowglad.\n\nBased on my experiences, here's what I've learned you need to go far in a startup:\n\n1.  Genuine passion in the space. Otherwise you will burn out because startups take a while to make significant revenue, and until then the money won't be able to drive you. I've heard of 2 YC cofounders pivot during a batch, but the sales cofounder didn't love the space and therefore didn't put in the effort to sell the product. You can't sell what you don't love. They closed shop soon after the batch.\n    \n2.  An unfair advantage. This can be your network, a network you have easy access to in the space (through a close friend or family member), or domain expertise that gives you an unique insight most others do not. I have one friend in energy who recently closed his startup despite loving the space. The space was ripe for innovation, but he had no past background in it and was solo. 2 of his competitors were startups with 2 industry cofounders each, who ironically all came from the same company before they left to do a startup. He knew he couldn't compete with their networks. A network takes a long time to create.\n    \n3.  The space must be very early or rapidly growing. Look for spaces where demand for a product is greater than its supply. LLMs maturing in the past 3y are a great example of this as many uses are now possible that weren't before. And a slew of startups popped up as a result. A friend of mine made AI receptionists for medspas last year, and he grew like gangbusteres because AI solved last mile issues for his customers. Being early is also great because there's a lot of uncaptured market share up for grabs.\n    \n\nSo what advantage do my cofounder and I have? Well we've spent the last 7 years building businesses with high variable costs. Every single business we've built has had a complex cross border flows of funds. We had to learn how to price in risk, and make commerce seamless--whether it was shipping eggs and carrots down the street in Nairobi or connecting startups and designers from across the world. We've had to build robust systems of record to map feature access to customer billing state. While it sounded extreme while we were doing it, it's pretty common now: people want to sell borderlessly online. And they want to integrate complex pricing models quickly. We knew from our firsthand experience just how much better the tooling could be.\n\n# The long story about our unfair advantage\n\nTo detail our backstory, Harrison and I worked on mobile payments back in 2019 Kenya. At the time we were running what was, that year, the largest on demand grocer in East Africa. This was before the growth-at-all-cost blitzscalers came in and burned tens of millions on the category. Our payments ran on M-Pesa: a mammoth payment network run by Kenyan telco Safaricom. The majority of the adult population of Kenya are on M-Pesa, and its adoption lifted something like 1 million people out of poverty. It is without exaggeration one of the most staggering accomplishments of human ingenuity in the last 50 years.\n\nM-Pesa launched in 2007 and allowed residents to top up mobile minutes on their SIM cards by visiting a participating convenience store. There are 250k (!) such shops in Kenya, about 1 for every 1,000 people. The same flows used to change cash into minutes could change cash into mobile money. And the same accounting systems built to maintain a massive ledger of pay-go plans could now maintain a ledger of mobile money wallets.\n\nIn 2018, M-Pesa’s developer team opened beta access for a new API to issue payment requests to customers programmatically. Called STK Push, it allowed merchants to initiate a request to pop open the M-Pesa USSD confirmation screen on a customer’s phone. It was Kenya’s answer to the 3DS flow that European credit card users know so well.\n\nWe were proudly one of the first production deployments of STK Push. When we launched, most of our competitors hadn’t even implemented STK Push yet in their native checkout flows. Their wisdom and restraint - holding off on adopting unproven infrastructure - was the opposite of our boundless, earnest naivety.\n\nAs an early adopter, we had a front row seat to watch the proverbial cement dry. My friends and I invoke “cement drying” as a reference to the opening of Disneyland, where Disney was building so maniacally to the last minute that it had to bring in helicopters to dry the cement, still wet, as the first guests streamed into the park.\n\nFor most of my founder life I've always something better. Now we're bringing our hard-earned lessons about building payments infra to Flowglad. Our expertise allows us to offer the same delightful DX we created for ourselves in Kenya, to other founders and companies integrating payments in their products.\n\nCombine this with a relentless focus on customers, where Stripe has slipped. You can hop on a call with me or my cofounder anytime.\n\nThis is our unfair advantage. Stripe pioneered payments infrastructure, but now it's time for someone else to lead the future of payments.\n\nIf you're curious, here's a [longer version](https://substack.com/home/post/p-141100596) of our time in Kenya. Thanks for reading. Happy to answer to answer any questions below!",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1qmudn5/yc_founders_take_go_after_markets_where_youve_got/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o1pao45",
          "author": "Real-Ground5064",
          "text": "“Yc founders take”\n\nThis is literally just Peter Thiel lmao",
          "score": 12,
          "created_utc": "2026-01-25 22:04:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1pbs8g",
              "author": "agreea",
              "text": "And Paul Graham's, and Garry Tan's, and a whole bunch of others's. Sincerely follow your curiosity to the frontier of an unsolved open problem space, form opinions based on your lived experience, encode those opinions into a product, share that product with the world.",
              "score": 8,
              "created_utc": "2026-01-25 22:08:52",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qijj7b",
      "title": "What's everyone's operational Saas stack?",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1qijj7b/whats_everyones_operational_saas_stack/",
      "author": "promptenjenneer",
      "created_utc": "2026-01-21 01:01:16",
      "score": 16,
      "num_comments": 7,
      "upvote_ratio": 0.95,
      "text": "I'm doing an audit of our current subscriptions to Saas and holy heck there are a lot of them. Was just wondering what everyone else was using?\n\nHere's our current one for our 10 person team:\n\nFigma - Designs for our app and website  \nLoops - Email marketing  \nLinear - Project management  \nGoogle Workspace - Critical and official documents  \nNotion - All other documents and also hosts our help docs  \nSuperhuman - Email service (just more productive than Gmail)  \nTypeform - Early access requests  \nPostHog - Analytics tracking  \nSupabase - Database hosting  \nStripe - Payments  \nExpanse - LLMs and general AI tools  \nClaude Code - IDE assisted coding and workflows\n\nWe're considering switching out a few of these but was curious to see what others are using.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1qijj7b/whats_everyones_operational_saas_stack/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o0rwcj7",
          "author": "Free_Afternoon_7349",
          "text": "Some of those seem critical while others are mostly productivity and collaboration stuff. \n\nIf you're not using you can probably cut some productivity stuff, but with 10 people it is very possible they are actually useful.",
          "score": 3,
          "created_utc": "2026-01-21 01:15:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0s6kxa",
          "author": "Silent-Treat-6512",
          "text": "What’s your cloud provider other than Supabase?",
          "score": 1,
          "created_utc": "2026-01-21 02:14:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0tj2l2",
          "author": "clr0101",
          "text": "For a 5 persons team we have also\nFigma, Google workspace, posthog, stripe, cursor and Claude code \nBut we have Brevo for email marketing, combined with zapier to automate lead sending\nWe use notion as our kanban board so no linear \nAlso have Canvas for designing visuals and videos \nOn the data side we use Looker Studio to visualize analytics",
          "score": 1,
          "created_utc": "2026-01-21 07:57:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0udb96",
          "author": "gui_stetelle",
          "text": "My approach is radical simplicity:  \n  \nGoogle Workspace (Gemini, gmail, everything)  \nFramer (website)  \nSlack  \nHubspot\n\nEverything else is a cost in my bottom line. We sign for tools and cancel them in 1 or 2 months after.",
          "score": 1,
          "created_utc": "2026-01-21 12:24:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o0vxzra",
          "author": "Ok_Rough5794",
          "text": "My recommendation: don't spend a lot of time on this.",
          "score": 1,
          "created_utc": "2026-01-21 17:12:22",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1qjh0oh",
      "title": "PAYG + Subscription hybrid. Am I an idiot or a genius?",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1qjh0oh/payg_subscription_hybrid_am_i_an_idiot_or_a_genius/",
      "author": "P-S-E-D",
      "created_utc": "2026-01-22 01:36:28",
      "score": 7,
      "num_comments": 11,
      "upvote_ratio": 1.0,
      "text": "I’m building an app for tennis players. People like to record their matches, but watching it back is a torture. Tennis videos are \\~2 hours, but >50% of it is ball pickup and water breaks. So my app cuts it down and creates a clean video (or a highlight reel) automatically.\n\nUnder the hood it’s basically video storage + inference + export/rendering. It’s the kind of thing I’d happily keep as a nerd project… except server, storage, and traffic costs will run through the roof. So I’m being \"forced\" to become a business just to not light my own money on fire.\n\nI’m trying to pick a pricing model that:\n\n* covers hard costs (inference + video bytes moved/stored),\n* doesn’t punish light users,\n* doesn’t surprise power users with massive bills,\n* and doesn’t create a support nightmare (super important haha)\n\n\n\n**Current pricing idea (PAYG + subscription hybrid)**\n\n**1) Tier 1: PAYG.** I'm calling this the \"Love\" plan as in tennis scoring.\n\n* **Love:** $0/mo, but buy credits. **$10 = 15 hours of video processing**\n* Limits: **720p max export**, **off-peak priority**\n* Signup bonus: 3-5 hours to try it out.\n* No additional features.\n\n**2) Tier 2/3/4: monthly sub**\n\n* **Fifteen**: **$5.99/mo** includes **15 hours** (720p max export)\n* **Thirty**: **$9.99/mo** includes **30 hours** (1080p max export)\n* **Forty**: **$13.99/mo** includes **60 hours** (4k max export)\n* Higher tiers get higher processing priority and more features (share links, create highlight reels, etc.).\n\n\n\n**The actual question**\n\nHas anyone here shipped (or regretted shipping) a **hybrid PAYG + subscription** model like this?\n\n* Did users **understand** it, or did it confuse the hell out of them?\n* Any gotchas around **rollover**, **grace**, and **overages** (especially when your COGS are real-time and spiky)?\n* How would you deal with **refund/cancel requests**? I plan to offer 30-day money back. How do I apply this to the PAYG users?\n* If you did this again, would you:\n   * make PAYG only (and ditch subs),\n   * make subs only (and ditch PAYG),\n   * or keep both but change the packaging?\n\n",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1qjh0oh/payg_subscription_hybrid_am_i_an_idiot_or_a_genius/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o0z0ewx",
          "author": "AnonymousCrayonEater",
          "text": "This is pretty common. The way to handle it is to announce to users that they will be moved to the PAYG love plan starting next month. Then include the other tiers as an option to “save”.\n\nMost won’t read it, so the real secret is displaying a popup when they are “5 hours” of processing away from running out of credits to “subscribe and save” with the tier 2 plan.\n\nHow many users do you have though? Can you just chat with them directly and explain the situation you are in. Most people are exceptionally reasonable when you bring them into the fold.",
          "score": 2,
          "created_utc": "2026-01-22 02:07:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o0zokxk",
              "author": "P-S-E-D",
              "text": "Thanks for the response! I'm pre-launch and just have a few test users. Sorry. I should have made this clear. So the question was mainly about whether this hybrid plan makes sense at all.\n\nI do agree that the pop up will be important. Right now I just have a \"video hour counter\" located in the menu bar.",
              "score": 1,
              "created_utc": "2026-01-22 04:30:45",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o0zzsvc",
                  "author": "AnonymousCrayonEater",
                  "text": "If you only have a few test users just explain the financial situation and tiers and you should be fine. Adding all of the other UX stuff is probably over engineering for now until you have more users.",
                  "score": 1,
                  "created_utc": "2026-01-22 05:50:25",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o112x82",
          "author": "thrarxx",
          "text": "Sounds pretty clear to me. PAYG with some form of credit (in your case hours) and a subscription providing X monthly credits is common.\n\nI assume that by \"hours of video processing\" you mean input video length, not processing time. Video length is great because it's immediately obvious. Processing time would be bad because the user has no transparency at all.\n\nThe 15/30/40 naming is clever but may lead to confusion since the 40 tier doesn't correspond to 40 hours. People who don't read the fine print (i.e. most) will just see the plan name and think it's poor value.\n\nMoney back with credits (hours) is tricky. Would you let them buy and use 100 hours within a month, then ask for all their money back at the end? I would just not offer it and maybe do a very small free trial, like 2 free hours (one match) on account signup.\n\nWhy do you think your COGS is spiky? Shouldn't processing 1 hour of video cost more or less the same every time? If some matches have a higher density of events (fewer breaks) than others, you can price to ensure profitability based on highest expected density and anything else is extra margin for you.",
          "score": 1,
          "created_utc": "2026-01-22 11:35:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o11r4al",
              "author": "P-S-E-D",
              "text": "Really good insights. Thanks.\n\nGood to hear this PAYG+subs hybrid plan is not overly confusing.\n\nYes I'm charging based on the \\*input\\* video duration. That's actually the most important determinant of the backend workload as well!\n\nI agree the 'Forty' plan offering 60 hours is confusing. Maybe I should just call it 'Advantage'\n\nAgreed with the money back is tricky with the PAYG plan. So my plan at the moment is: (1) everyone is at the PAYG tier at sign up. They get X hours of signup bonus. (2) They can upgrade to monthly subs. Subs come with money back guarantee... which is supposed to boost user confidence... but then they would have experienced this as a PAYG user already. Maybe I don't need this at all..\n\nAnswering this made me realize: users might have remaining PAYG credits but still want to upgrade to monthly subs. I should maybe calculate the remaining portion of their credit and discount accordingly?  Ugh so many cases!\n\nCOGS could be spiky in a sense that job submissions could be highly concentrated around weekends & spring/fall. So I might need to scale up my backend, potentially using more expensive VPSs. I know I'm way too early to worry about this. You're right that the backend workload itself won't vary by much.",
              "score": 1,
              "created_utc": "2026-01-22 14:06:54",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o11d2ef",
          "author": "HelpfulSource7871",
          "text": "Tennis player here. Not sure about the claim that people like to register their matches😢. Anyhow, if it's an app for sports, why only tennis?",
          "score": 1,
          "created_utc": "2026-01-22 12:47:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o11rusf",
              "author": "P-S-E-D",
              "text": "There are only 2 types of tennis players: those who record their matches, and those who overestimate their footwork :)   \nJokes aside, I know not everyone records, but there's a large subgroup that records religiously. \n\nI might consider expanding to other net sports. But I first need to understand what other sports have the same problem and if their video style is as consistent as tennis videos.",
              "score": 1,
              "created_utc": "2026-01-22 14:10:42",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o11mzsc",
          "author": "jack_belmondo",
          "text": "In my opinion: it's too confusing.\n\nHaving different pricing models could be a bottleneck for conversion.\n\nWhy don't you offer the first 10/15hrs and then it's a subscription?",
          "score": 1,
          "created_utc": "2026-01-22 13:45:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o11s241",
              "author": "P-S-E-D",
              "text": "Thanks for your feedback. What you said is exactly my concern.\n\nThis is my (preliminary) pricing page. I tried to make things as clear as possible. Still too complicated?\n\n[https://www.rallyflowapp.com/en/pricing](https://www.rallyflowapp.com/en/pricing)",
              "score": 1,
              "created_utc": "2026-01-22 14:11:45",
              "is_submitter": true,
              "replies": []
            }
          ]
        }
      ]
    },
    {
      "id": "1qjske7",
      "title": "We built QuickV to solve a very real problem with quick-commerce apps.",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1qjske7/we_built_quickv_to_solve_a_very_real_problem_with/",
      "author": "Meg_3832",
      "created_utc": "2026-01-22 11:54:09",
      "score": 5,
      "num_comments": 0,
      "upvote_ratio": 0.86,
      "text": "We developed QuickV because comparing prices on quick-commerce apps is a lot more painful than it should be.\n\nSo if you are asking for the cheapest delivery place, then you are stuck with a rotation of delivery services like Blinkit, Zepto, Instamart, BigBasket. and searching for the same object over and over again while forgetting prices.\n\nSo we attempted to remedy that.\n\nQuickV allows comparison of products and prices for Blinkit, Zepto, Instamart, and BigBasket in a single application (JioMart coming soon).\n\nWhat it does:\n\n1.Search Once, View Results from All Suppliers\n2.Prices and Availability Compared Immediately\n3.Location set once for all platforms and can be changed later with one tap\n4.Look around: categories and hot deals\n5.See full product details within the chosen platform\n6.Each provider will maintain a separate cart.\n7.Add items to all carts in one tap and checkout at the provider\n\nIn short, no more app hopping. It all happens in one spot, and you decide where to purchase.\n\nPlay Store\nhttps://play.google.com/store/apps/details?id=com.quickV.app\n\nWould love honest feedback – what works, what doesn’t, and the next piece you’d like!",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1qjske7/we_built_quickv_to_solve_a_very_real_problem_with/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": []
    },
    {
      "id": "1ql3yis",
      "title": "How do individual investors evaluate very early startup opportunities?",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1ql3yis/how_do_individual_investors_evaluate_very_early/",
      "author": "asupertram",
      "created_utc": "2026-01-23 21:44:26",
      "score": 3,
      "num_comments": 8,
      "upvote_ratio": 0.81,
      "text": "For people who’ve invested in startups early (even small checks):\n\nHow do you find deals in the first place?\n\nWhat signals matter most before there’s meaningful traction?\n\nWhat are your immediate red flags?\n\nI’m an operator (10+ years in tech/startups) trying to understand investor decision-making and what creates trust at the earliest stage. Not fundraising, just learning from those with experience.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1ql3yis/how_do_individual_investors_evaluate_very_early/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o1be5pa",
          "author": "HappyCraftCritic",
          "text": "Team, hype, market size, product ( in that order)",
          "score": 1,
          "created_utc": "2026-01-23 21:46:15",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1ccky3",
              "author": "Individual-Treat24",
              "text": "What do you mean by hype? Traction?",
              "score": 1,
              "created_utc": "2026-01-24 00:44:30",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o1beibw",
              "author": "asupertram",
              "text": "What if solo and bootstrapped founders? Assuming you’re looking to bet on a lot of diversified SaaS or small businesses and not looking for a big exit / IPO?",
              "score": 0,
              "created_utc": "2026-01-23 21:47:52",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o1bob1e",
          "author": "Adjudica",
          "text": "That's a great question.  I'll tell you in 2 years when my SaaS blows up and I start investing 🤣🤣",
          "score": 1,
          "created_utc": "2026-01-23 22:35:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o1bh0ef",
          "author": "alex-clovegrid",
          "text": "YC favors teams in their early 20s from top schools or with FAANG experience.",
          "score": 1,
          "created_utc": "2026-01-23 21:59:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o1biwcu",
              "author": "asupertram",
              "text": "Alright, thank you! Whats in your opinion the best way to get introduced to or plugged into the group of people who typically write these small early-stage checks?\n\nTo clarify, I’m not asking for funding. I’d genuinely value feedback from investors who do this regularly. We’ve built a marketplace that connects startup founders with early-stage micro-investors, and I’d love to better understand their workflow and pain points so we can solve and automate them.",
              "score": 1,
              "created_utc": "2026-01-23 22:08:38",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o1brrie",
              "author": "keyUsers",
              "text": "Source for this statement? Based on what research?",
              "score": 1,
              "created_utc": "2026-01-23 22:52:58",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o1c8zhx",
                  "author": "splittestguy",
                  "text": "It’s just not true. \n\nWhat is true, is the qualities that get you into top schools, has a great deal of overlap with YCs criteria.",
                  "score": 2,
                  "created_utc": "2026-01-24 00:25:09",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1qmvmut",
      "title": "Seeking GTM Advice: Professional/College Social App",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1qmvmut/seeking_gtm_advice_professionalcollege_social_app/",
      "author": "snaccmate",
      "created_utc": "2026-01-25 21:13:45",
      "score": 3,
      "num_comments": 1,
      "upvote_ratio": 0.72,
      "text": "I have built and It's live right now - an \"Authentic moments\" social platform targeting college students and working professionals. \n\nLooking for GTM advice based on the YC founder's playbook.\n\nThe Product\n\nVerification: Users authenticate via work/college email (emails are not stored).\n\nAuthenticity: Live camera capture only; no gallery uploads allowed.\n\nIRL Loop: Users can send physical \"cookies\" as a gesture to invite others to meet offline.\n\nThe Strategy\n\nPhase 1: Focused exclusively on fashion/engineering/MBA colleges.\n\nGoal: Solve the \"authenticity\" problem in current social media while bridging the gap to real-world networking.\n\nThe Ask\n\nDoes anyone have insights from the YC curriculum (or personal experience) on the best GTM strategy for a high-friction (verified) social network? Specifically, how to nail the initial \"atomic network\" in a campus setting?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1qmvmut/seeking_gtm_advice_professionalcollege_social_app/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o1q1ar8",
          "author": "yourbeefysalad",
          "text": "Correct me if I’m misinterpreting but isn’t this just BeReal?",
          "score": 1,
          "created_utc": "2026-01-26 00:06:25",
          "is_submitter": false,
          "replies": []
        }
      ]
    }
  ]
}