{
  "metadata": {
    "last_updated": "2026-02-28 08:49:57",
    "time_filter": "week",
    "subreddit": "ycombinator",
    "total_items": 20,
    "total_comments": 222,
    "file_size_bytes": 242362
  },
  "items": [
    {
      "id": "1rcaiku",
      "title": "How to find a fertile idea space?",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1rcaiku/how_to_find_a_fertile_idea_space/",
      "author": "Scott_Jaeggi",
      "created_utc": "2026-02-23 06:58:25",
      "score": 71,
      "num_comments": 46,
      "upvote_ratio": 0.94,
      "text": "Hi everyone,\n\nMy co-founder and I quit our jobs last summer. Since then, we’ve been going through pivot hell.\n\nNow we want to change our approach, inspired by the Y Combinator video “How to Get Startup Ideas” (the one where they tell the story of AtoB). We’re wondering if we can copy that approach and search for a fertile “idea space” instead of chasing random concepts.\n\nSo far, we think a good idea space should be:\n\n* Targetable (clear ICP, easy to reach)\n* In a growing market\n* Preferably “boring” (not overcrowded or hyped)\n\nWe’re trying to define more attributes that make an idea space attractive before jumping into execution.\n\nHas anyone here intentionally searched for an idea space like this?  \nWhat criteria did you use?  \nAnd what worked (or didn’t work) in practice?\n\nWould really appreciate hearing about your experience.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1rcaiku/how_to_find_a_fertile_idea_space/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o6wxkav",
          "author": "random-trader",
          "text": "If you are going by YC route. Look at their last few batches. All ideas already exisi. Even some big players already exist too. The suggestion is idean conditions. \nFind where your wedge is. \n\nYou have skills only few people have\nYou have direct access to customers \nYou can built it etc\n\n\nDon't find problem none has solved yet. Find problem people already tried to solve it but their solution sucks.",
          "score": 20,
          "created_utc": "2026-02-23 07:12:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6x254e",
              "author": "InvestigatorLive1078",
              "text": "Totally agree, Duct taped solutions are a great space to target since the user has proven how much they value the solution by using a shitty version they put together themselves. One thing I wonder in the age of AI is how do you ensure you’re not 3 months from the big model companies making your product a vibe code away.",
              "score": 7,
              "created_utc": "2026-02-23 07:56:02",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6x9xrg",
                  "author": "random-trader",
                  "text": "Every internet company can be then vibe code away. \n\nIts the amount of effort it takes to vibe code everything and make sure all features implement and actually working.",
                  "score": 3,
                  "created_utc": "2026-02-23 09:12:44",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o6wy7ix",
              "author": "Scott_Jaeggi",
              "text": "Thanks for your comment. Totally see your point. It's just sometimes not easy to see if the solutions sucks, until you can interview people already using that solution...",
              "score": 2,
              "created_utc": "2026-02-23 07:18:47",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6wz9yu",
                  "author": "random-trader",
                  "text": "You are business background. This is what expected from a business background to do.",
                  "score": 2,
                  "created_utc": "2026-02-23 07:28:50",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o73nmct",
              "author": "TangerineExternal176",
              "text": "Agree, but jumping into a saturated market isn’t a good move",
              "score": 0,
              "created_utc": "2026-02-24 07:57:58",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6x1ray",
          "author": "Livid-Savings-5152",
          "text": "having been through four exits as an early employee, all four founders followed the same formula\n\n1) enter an existing market instead of inventing something new\n\n2) find painpoints amongst a niche audience with the existing solutions\n\n3) build a UX that alleviates these painpoints.\n\nExample\nMarket: cold outreach automation \nNiche Audience: people who use cold calling, cold email, and cold LinkedIn outreach \n\nPainpoint: they bounce between different software tools which feel annoying . Too much manual work and context switching\n\nSolution: “all in one” cold outreach to automate cold calling, email, and LinkedIn workflow at scale.\n\n\nI’m not saying this is a good idea, it’s just an example of the type of thinking\n\n\nAlso, ignore most advice like “moat” and “network effect.”\n\nHoney was a simple chrome extension that finds online coupons. The type of idea founders scoff at because it seems too simple. They got acquired for $4B",
          "score": 38,
          "created_utc": "2026-02-23 07:52:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6ybogo",
              "author": "Scott_Jaeggi",
              "text": "Super helpful, thanks so much!",
              "score": 2,
              "created_utc": "2026-02-23 14:07:38",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6zbw7g",
                  "author": "Livid-Savings-5152",
                  "text": "you’re gonna win go get that MONEY 💰",
                  "score": 2,
                  "created_utc": "2026-02-23 17:05:37",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o6yvru0",
              "author": "alielknight",
              "text": "Thank you for validating my new approach!",
              "score": 1,
              "created_utc": "2026-02-23 15:50:43",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o7mptdb",
              "author": "Haroombe",
              "text": "wasn't honey a scam though? still impressive that they got acquired",
              "score": 1,
              "created_utc": "2026-02-27 02:26:58",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6xo37x",
          "author": "quietoddsreader",
          "text": "a fertile space is where u have unfair access to users, painful problems with budget, and weak incumbents people tolerate rather than love, everything else is secondary.",
          "score": 13,
          "created_utc": "2026-02-23 11:27:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6wx0lt",
          "author": "Deep_Lifeguard_5039",
          "text": "talk to a select group of people and find common problems they have\n\nfilter your group of people by what you have outlined above, clear ICP, growing market (e.g., AI agents), etc.",
          "score": 4,
          "created_utc": "2026-02-23 07:07:51",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6wy219",
              "author": "Scott_Jaeggi",
              "text": "Thanks, we are gonna do that :)",
              "score": 1,
              "created_utc": "2026-02-23 07:17:23",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o6xpq7z",
              "author": "Competitive-Exit5298",
              "text": "ICP… Insane Clown Posse??",
              "score": 1,
              "created_utc": "2026-02-23 11:41:17",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o71cxhb",
                  "author": "PNW_Uncle_Iroh",
                  "text": "TAJ = Total Addressable Juggalos",
                  "score": 3,
                  "created_utc": "2026-02-23 22:53:57",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6xsd8p",
          "author": "novaaiops",
          "text": "Think of a problem you experience daily go from there",
          "score": 4,
          "created_utc": "2026-02-23 12:02:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6zel2t",
          "author": "yonko-12",
          "text": "We tried chasing “big markets” before and kept pivoting. What finally worked was picking a niche we could reach directly and talking to 20 people in that space before building anything. Fertile > flashy.",
          "score": 4,
          "created_utc": "2026-02-23 17:18:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7064dj",
              "author": "Scott_Jaeggi",
              "text": "Thanks for sharing that!",
              "score": 1,
              "created_utc": "2026-02-23 19:24:49",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6zqrm4",
          "author": "ximillianoh",
          "text": "Step 1. Don’t build anything. Resist the urge.\n\nStep 2. no BS – recall your personal experiences or the personal experiences of those close to you (brownie points if they seem esoteric, random to the typical tech person)\n\nStep 3. Find a problem those people are experiencing (e.g. i had 100 30-min conversations with people in my domain)\n\nStep 4. Figure out a solution to that problem. THEN think about how technology makes that solution defensible and advantageous\n\nStep 5. Build something and iteratively repeat steps 2-5",
          "score": 4,
          "created_utc": "2026-02-23 18:14:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7001nt",
          "author": "AnyExit8486",
          "text": "good shift in thinking.\n\ninstead of chasing ideas, look for **stress** in systems.\n\nstrong idea spaces usually have:\n\n– people already spending money  \n– obvious inefficiencies everyone complains about  \n– ugly workflows held together by spreadsheets + email  \n– regulatory or operational complexity (hard to build = defensible)  \n– high switching pain once solved\n\nyc’s “fertile space” is usually where:  \nsmart operators are stuck with bad tools but too busy to fix them.\n\npractical way to search:\n\n1. pick an industry you can access\n2. interview 20 operators\n3. look for repeated emotional frustration\n4. map where money + friction intersect\n\nboring is good.  \ngrowing is good.  \nbut **bleeding pain + budget** is better.",
          "score": 4,
          "created_utc": "2026-02-23 18:56:41",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ze1ge",
          "author": "karmean212",
          "text": "I’d add one more attribute: painful workflow. If you can observe people hacking spreadsheets, duct-taping tools together, or manually fixing the same issue every week, that’s usually a fertile space. Growth matters, but friction matters more.",
          "score": 3,
          "created_utc": "2026-02-23 17:15:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o705zg6",
              "author": "Scott_Jaeggi",
              "text": "Great point!",
              "score": 1,
              "created_utc": "2026-02-23 19:24:11",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6zf09w",
          "author": "joo_2000",
          "text": " If you can’t clearly define who you’ll talk to in week one, it’s probably not fertile yet. Reachability is underrated.",
          "score": 3,
          "created_utc": "2026-02-23 17:20:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6xb27q",
          "author": "AnnaSaaS",
          "text": "One idea space I’d personally look at is boring B2B industries that are kind of being forced to modernize right now because of AI or compliance stuff. Like logistics brokers, small manufacturers, regional healthcare providers, even local government vendors. A lot of them are still running pretty serious operations on spreadsheets, email threads, and WhatsApp. Those spaces are usually:\n\n* Easy to define ICP\n* Not hyped\n* Have real budgets\n* And have a lot of messy workflows\n\nInstead of chasing something “innovative,” I’d probably look for industries where people are managing $5–10M+ businesses in Excel and constantly complaining about manual processes. That usually feels like a better signal than trying to invent something totally new.\n\nJust my take though  curious what direction you’re leaning toward.",
          "score": 2,
          "created_utc": "2026-02-23 09:24:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6xexwq",
          "author": "notrightnever",
          "text": "Go to subs where people are actively looking for a solution. \nI found my first problem while working as an electricians assistant, and now I’m developing modular electrical systems.\n",
          "score": 2,
          "created_utc": "2026-02-23 10:02:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6zea7e",
          "author": "luna_242p",
          "text": "There’s a point James Sinclair makes in Starting a Startup good idea spaces are often hidden in plain sight because they feel boring or unsexy. The signal is usually repetition of a problem, not hype around a market.",
          "score": 2,
          "created_utc": "2026-02-23 17:16:50",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o70e4sa",
          "author": "Syclone1991",
          "text": "One thing id add to your list are industries where the buyers are desperate but the software is old/terrible. Usually means legacy players with not super high incentives to innovate, and customers who have sometimes just accepted the pain. Boring + bad existing solutions + clear buyers is an underrated combo if you can find the niche. There some growing competition in these areas, but some that come to mind are construction, trucking, freight, ag, healthcare admin, legal, auto dealerships etc.",
          "score": 2,
          "created_utc": "2026-02-23 20:02:22",
          "is_submitter": false,
          "replies": [
            {
              "id": "o70h8jk",
              "author": "Scott_Jaeggi",
              "text": "Thanks for that addition!",
              "score": 1,
              "created_utc": "2026-02-23 20:17:18",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o715rg2",
              "author": "tartar9584",
              "text": "I see so many AI startups in the healthcare and legal domain these days.",
              "score": 1,
              "created_utc": "2026-02-23 22:16:55",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o70g3tu",
          "author": "kou_pou",
          "text": "So I use a 2 step process to lock an idea to step in .\n\nIs it going to solve my problem? \n\nTalk to people in that particular segment if they are willing to pay for this solution .",
          "score": 2,
          "created_utc": "2026-02-23 20:11:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o70tdjt",
          "author": "Betaglutamate2",
          "text": "1. read the mom test and other books on how to talk to people.\n\n2. Find your edge. What is your background and you co-founder. What makes you unique.\n\n3. Do not come up with an idea find a problem in your target space that you want to solve.\n\nFor example I work in Biotech. I got approached by people that spent a while building some really interesting ideas. I had 0 use for it and they never raised any money.\n\nWhat problems do I have? I need to take documents from three different data sources, Benchling, share point, and confluence and use them to write  a technical report.\n\nClaude can help write this report but our data is super dirty badly annotated.\n\nHere is what I need. A tool that automatically scans files using LLMs categorizes them and makes the available to be loaded into AI tools so they can be easily used by Claude or ChatGPT to write technical reports.\n\nWarning I have done no research on this problem just giving you an example. Also never ask what somebody needs. Instead  ask what problem people have then if you see a problem and you are like huh I could solve that then you double down and get a commitment from them.\n\nHey I would like to solve your problem, can i give you a demo in 2 weeks. If they commit more time or even better money then you know you are solving a real problem.\n\n  \nUnless you are building in deep tech never build something without a commitment from a customer.\n\n",
          "score": 1,
          "created_utc": "2026-02-23 21:17:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o71hu3q",
          "author": "Trytolive_HAPPYLIFE",
          "text": "Iknow this video and it impressed me too.\n\nTo me the most valuable thing in it is that they for the first time shifted the focus from \"is this a good idea?\" to \"idea space\" for which what matters is both the expertise of one of the founders in that space and IMPORTANT- market growth carries more weight than its size, existing competitors, and so on\n\nMy friend (honestly a technical nerd) is building the automated market research  now with this mindset- it would be without friends product promote here)))) But what is very important and that focuses specifically on choosing a niche (in which founders already have experience or solid knowledg, maybe have a big interest) and within it runs a whole series of objective measurements: trend, competitors, customer, market size, pricing and others. \n\nAnd the most important thing, focus on the Problem, not on your own desire.\nIf I remember correctly the video need to notice the most common mistake being that a startup that doesn't solve a problem, and that just going out to talk and ask isn't really an option, because we as people often confuse wishful thinking with reality. \n\nSo I believe the best way to gather pain points in a niche and turn them into an opportunity for your project is analyzing conversations from social media and measuring how much it actually hurts people (Severity) and their willingness to pay for a solution to the problem (WTP).\n\nI mean, not just idea. Niche-Problem-Solution + all metrics, and after thatGo/no go or better - quickly go to market, and made decision depends of amount of preorders.",
          "score": 1,
          "created_utc": "2026-02-23 23:20:56",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o72z48j",
          "author": "jesusonoro",
          "text": "look for industries where people still email spreadsheets to each other. thats where the money is. boring industries with bad software pay way better than sexy markets with 50 competitors.",
          "score": 1,
          "created_utc": "2026-02-24 04:36:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o73r5wy",
          "author": "Informal-Virus4452",
          "text": "been there. “idea space hunting” sounds smart but you can over-intellectualize it fast.\n\nwhat worked for me wasn’t picking a growing market on paper — it was hanging around a niche long enough to notice repeated complaints. boring industries are gold because the problems are loud and ignored.\n\nI’d add one filter: are people already hacking together ugly solutions in spreadsheets / zapier / google docs? that’s usually a fertile sign.  \nmarkets don’t have to be huge. they just need pain + money + access. everything else you figure out while building.\n\n",
          "score": 1,
          "created_utc": "2026-02-24 08:31:19",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o73skkt",
          "author": "WizardFish77",
          "text": "The other comments here are all spot on.\n\n  \nBasically, find a problem you already know exists, use the existing solutions, and build something that fills the gaps between those other solutions. This will endear you to a specific set of people who have that problem and also see problems with the solutions",
          "score": 1,
          "created_utc": "2026-02-24 08:44:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o77ujqn",
          "author": "robertfrompylon",
          "text": "find tools everyone uses, no one loves",
          "score": 1,
          "created_utc": "2026-02-24 22:04:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o77wbzg",
          "author": "erickrealz",
          "text": "Stop searching for the perfect idea space from your desk. You quit your jobs months ago and you're still theorizing instead of talking to people. That's the real problem.\n\nPick any industry where you have existing connections or domain knowledge and go have 50 conversations with people who run businesses in that space. The best startup ideas come from hearing someone describe a painful manual process they'd pay money to fix, not from frameworks about what makes a good market.\n\nYour criteria list is fine but useless without real world input. Every \"boring\" profitable niche looks invisible until someone doing the work tells you where it hurts. Go find that pain instead of trying to logic your way into a damn business.",
          "score": 1,
          "created_utc": "2026-02-24 22:13:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o78fjfn",
          "author": "alexanderthechamp",
          "text": "I have an idea for a government software application. I have roughly 5 years of experience with that type of software and im interested in starting a new company. If your interested, lets connect.",
          "score": 1,
          "created_utc": "2026-02-24 23:53:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ntsuy",
          "author": "Jordan443",
          "text": "look at YC’s request for startups",
          "score": 1,
          "created_utc": "2026-02-27 07:02:59",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1re18ti",
      "title": "Founders, how did you actually solve distribution?",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1re18ti/founders_how_did_you_actually_solve_distribution/",
      "author": "DeskJolly9867",
      "created_utc": "2026-02-25 02:49:55",
      "score": 50,
      "num_comments": 40,
      "upvote_ratio": 0.96,
      "text": "I keep hearing “build something people want” and distribution will follow.\n\nIn my experience, it does not.\n\nGetting attention is possible. Getting the right people to care is much harder.\n\nI have tried emails, cold emails, some paid ads. Each works a little, but nothing feels truly repeatable yet.\n\nFor those who got from zero to real traction, what actually worked for you?\n\nWhat was the first channel that moved the needle in a consistent way? And how long did it take before it felt predictable?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1re18ti/founders_how_did_you_actually_solve_distribution/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o7adosp",
          "author": "praneethb7",
          "text": "build something people want is incomplete advice\n\nits build something a specific group urgently wants and already gathers somewhere\n\ndistribution clicked for me when i stopped chasing channels and started chasing audience concentration\n\nwhere do they already hang out  \nwhat are they already searching  \nwhat tools are they already using\n\nfirst predictable traction usually comes from one narrow channel not five\n\nfor some its niche communities  \nfor some its high intent seo  \nfor some its outbound with tight targeting  \nfor some its partnerships inside existing workflows\n\nrepeatable means you know the input to output ratio\n\nsend 50 targeted emails → book 5 calls  \npublish 3 posts → get 10 demos\n\nuntil you can map that, youre experimenting not distributing\n\nalso distribution isnt marketing its system design. some founders even map outreach, follow ups and content loops inside tools like Runable so it becomes process not random effort. but tool isnt the magic the clarity is.\n\nmost people quit right before pattern emerges. it usually takes months of boring iteration before it feels predictable.",
          "score": 40,
          "created_utc": "2026-02-25 07:21:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7bsd7u",
              "author": "Similar_Past8486",
              "text": "Real. The only comment needed. It’s funny you can read comments here and instantly know who has been through the fires 🤣",
              "score": 11,
              "created_utc": "2026-02-25 14:01:41",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o7czawo",
              "author": "Low-Associate2521",
              "text": "this",
              "score": 1,
              "created_utc": "2026-02-25 17:26:29",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o7d6gqh",
              "author": "Dry-Complaint7089",
              "text": "this and kudos to you for sounding human (not AI)",
              "score": 1,
              "created_utc": "2026-02-25 17:58:46",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o7ai8dv",
              "author": "Wide_Brief3025",
              "text": "Focusing on audience hotspots rather than spreading yourself thin really is the move. Zeroing in where the conversations happen makes everything more predictable and measurable. If you want an easier way to monitor when the right discussions pop up across platforms, ParseStream can send you real time alerts so you never miss those moments to engage.",
              "score": 0,
              "created_utc": "2026-02-25 08:03:10",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o79fwv7",
          "author": "Delicious_Bed_4410",
          "text": "I had same questions and i received ton of help heres the post : [https://www.reddit.com/r/ycombinator/comments/1r6yrrz/how\\_are\\_you\\_guys\\_doing\\_marketing\\_as\\_a\\_solo\\_founder/?utm\\_source=share&utm\\_medium=web3x&utm\\_name=web3xcss&utm\\_term=1&utm\\_content=share\\_button](https://www.reddit.com/r/ycombinator/comments/1r6yrrz/how_are_you_guys_doing_marketing_as_a_solo_founder/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)",
          "score": 3,
          "created_utc": "2026-02-25 03:16:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o79leys",
              "author": "DeskJolly9867",
              "text": "thanks a lot!",
              "score": 1,
              "created_utc": "2026-02-25 03:49:16",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o79kzpx",
          "author": "Tall-Log-1955",
          "text": "How are you sure that you’ve built something people want if no one is buying it?",
          "score": 3,
          "created_utc": "2026-02-25 03:46:40",
          "is_submitter": false,
          "replies": [
            {
              "id": "o79nukg",
              "author": "hiaryanm",
              "text": "If buying is the only proof, then absolutely no product is what people want initially.",
              "score": 2,
              "created_utc": "2026-02-25 04:04:26",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o79o7y5",
                  "author": "Tall-Log-1955",
                  "text": "Plenty of products sell before they are built",
                  "score": 2,
                  "created_utc": "2026-02-25 04:06:49",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o79sril",
          "author": "Dry_Ninja7748",
          "text": "Real Problem and Correct Solution will give you retention and referrals = organic distribution, most of the time solution isn't elegent or novel enough compared to existing and the rest of the time the problem doesn't really need solving.",
          "score": 3,
          "created_utc": "2026-02-25 04:37:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7byo1p",
          "author": "Background-Might3453",
          "text": "Distribution never “follows” on its own. What worked for me was finding one place where the problem was already being talked about and showing up there consistently.\n\nIt took months before it felt predictable. Before that, everything felt random even when it technically worked.",
          "score": 2,
          "created_utc": "2026-02-25 14:35:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7bzgma",
          "author": "greyzor7",
          "text": "Build a cross-channel mix relevant to where your target users/customer (called ICP) is.\n\nTry launching your app on a combo of social media: X/Twitter, Reddit + launch platforms: Product Hunt, Microlaunch. And any channel relevant to your ICP.\n\nRun campaigns, measure all ROIs, then simply double down on what worked. Then keep doing this until you get users & customers.\n\nFix conversions, channel selection, targeting when necessary.",
          "score": 2,
          "created_utc": "2026-02-25 14:39:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7axgik",
          "author": "ApprehensiveCry7955",
          "text": "We are building {{Name}}, and I had the same belief early on that if the product is good, distribution will follow. That did not happen.\n\nWe built a solid product, shipped fast, and then hit the wall you are describing. Attention was easy. Relevance was not. Cold emails worked sometimes. Paid ads brought traffic but not real users. Nothing felt repeatable.\n\nThe first channel that moved the needle for us was talking to founders where they already complain about support, chat, and lead drop offs. Reddit threads, indie hacker type communities, and a few founder Slack groups. I did not pitch. I helped debug their funnel or onboarding and only mentioned {{Name}} when it was genuinely relevant.\n\nIt took around 6 to 8 weeks before this felt predictable. The lesson for me was that distribution is less about channels and more about language. Once we matched how users describe their pain, even cold outreach started working better.\n\nEDIT:-\n\n{{Name}} = Widgetkraft",
          "score": 2,
          "created_utc": "2026-02-25 10:25:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7b28cj",
              "author": "Wide_Brief3025",
              "text": "Finding those early conversations where your target users hang out is clutch. I found that listening in on discussions and really identifying how people frame their problems made a huge difference. If you want to catch relevant threads as soon as they happen, ParseStream can help you monitor key platforms for those signals so you never miss the right moment to engage.",
              "score": 1,
              "created_utc": "2026-02-25 11:07:43",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o79zp9x",
          "author": "hduynam99",
          "text": "I created my own saas sub, post as much as i can, try to growth my organic user first.",
          "score": 1,
          "created_utc": "2026-02-25 05:26:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7a3m62",
          "author": "CarpetNo5579",
          "text": "for b2b, cold outreach, or better if u can do talk to founders who already know you - get them to pay even without having a product yet. these days, this usually means going \"forward deployed\" which is fancy PR for agency work.\n\nfor b2c, no way around it, short form content.",
          "score": 1,
          "created_utc": "2026-02-25 05:56:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7a4yxx",
          "author": "John_Lins",
          "text": "The only time you can build something and it just spread quickly on it's own is if the idea is funny or provocative. Otherwise you have to just put in the work to do sales manually. \nJust remember that sales is about asking questions and deeply understanding the lead, not *trying* to sell to them",
          "score": 1,
          "created_utc": "2026-02-25 06:07:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7bdo85",
          "author": "smarkman19",
          "text": "Predictable distribution came for me only after I got painfully specific about who I was for and what exact moment they were in. The channel mattered less than that clarity. I picked one ICP, wrote down their “oh shit” moment (what’s happening on their screen when they need me), then reverse‑searched for that: Reddit threads, niche Slack/Discords, and support forums where they were already ranting about it. Instead of “campaigns,” I did 15–20 1:1 rescues: “I’ll fix X this week if you let me watch and ask questions.” Those became testimonials, case studies, and very narrow landing pages that finally made paid and outbound work. Tools like SparkToro, F5bot, and later Pulse for Reddit helped me systematically find those complaint threads instead of guessing. Distribution felt repeatable once I could describe my buyer in a sentence and show them three stories of people just like them who already won with my thing.",
          "score": 1,
          "created_utc": "2026-02-25 12:34:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7cwvvg",
          "author": "galvinw",
          "text": "I always hear \"build something people want\" and they still won't come lol.   \nFor us it was email campaigns in the order of about 30,000 emails to the first few closes. But the trick is that we're in the high LTV industry with lots of overlaps between customers.\n\nThe other was lighthouse customers as a starting point, but every industry is different",
          "score": 1,
          "created_utc": "2026-02-25 17:15:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ex9tj",
          "author": "RemarkableFold888",
          "text": "I just paid this girl to find me customers and they even gave me dm/email templates, just closed a deal. They basically make a whole list of all the potential customers and that really helped me a lot.",
          "score": 1,
          "created_utc": "2026-02-25 22:51:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7eylte",
          "author": "Scared_Yak5572",
          "text": "thats the tough part, build something people want rarely makes distribution automatic, you need a repeatable sequence that finds the few people who actually care and pulls them through a tiny funnel. start by naming one narrow audience and where they already hang out, pick one channel to test for 6 to 12 weeks, make a tiny sequence that mixes one valuable public post, 2 follow up comments or touches, and one direct outreach message that sounds like you, run it against 30 to 50 targets, track replies per touch and the time to first meaningful convo, iterate the message or timing until you can predict replies per 50 sends. trade off is it will feel slow and boring at first, but you will stop chasing vanity metrics and actually get reproducible leads. mistake to avoid is scaling before the sequence is proven, or trying five channels at once. youre not failing, youre experimenting, this is the grind. if you want a short 3 step sequence i use for founders, i have one i can paste. also, i have used Depost AI to make linkedin a repeatable system for founders, it helped focus content and outreach into one workflow.",
          "score": 1,
          "created_utc": "2026-02-25 22:58:33",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7f1hrs",
              "author": "Wide_Brief3025",
              "text": "Solid framework you shared here. Making sure to track not just replies but also the specific platforms and timing can make a big difference in finding what converts best. If tracking conversations across multiple sites gets tedious, ParseStream can help automate that part so you catch leads as soon as they pop up. Keeps things efficient without losing the personal touch.",
              "score": 1,
              "created_utc": "2026-02-25 23:13:49",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7f6wuk",
          "author": "agm_93",
          "text": "My game plan would be:\n\n1. Write the channels you want to test\n2. Score each based on impact x time required / money required\n3. Start with a hypothesis on each\n4. Repeat\n\nmy favorite channel so far is using [inreach](https://useinreach.com/?utm_source=reddit.com&utm_medium=organic&utm_campaign=comments) to find reddit leads and responding to them in a helpful way to start dialogue and share the url.\n\noverall just think like a marketing expert, read credible people's work (not blogs or just youtube) and be ready to determine your product is the problem if the data speaks loud enough",
          "score": 1,
          "created_utc": "2026-02-25 23:43:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7kx38w",
              "author": "DueLingonberry8925",
              "text": "That's a solid framework. I've automated that exact Reddit inreach process with Leadmatically. It handles the monitoring and drafts helpful replies, so I can focus on the dialogue part. The free trial let me test if it fit my workflow before committing",
              "score": 1,
              "created_utc": "2026-02-26 20:43:39",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7im7k1",
          "author": "Imaginary-Court1058",
          "text": "According to me the only method that works is the old school system, go door to door to pitch your product if people like it rest will come from word of mouth",
          "score": 1,
          "created_utc": "2026-02-26 14:12:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7nwm10",
          "author": "backflipbail",
          "text": "Same boat. 20+ years engineering and I still struggle with the “now go sell it” part.\n\nThe stuff that’s resonating in this thread is the “pick one tight ICP + one place they already congregate + measure inputs/outputs” idea. Right now my problem is I’ve tried a bit of everything (cold email, some ads, posting) but I can’t map any of it to a predictable ratio yet.\n\nCurious what channel you’re testing hardest right now and what your rough numbers look like (reply rate, calls booked, etc). Also what felt like total wasted effort for you?",
          "score": 1,
          "created_utc": "2026-02-27 07:27:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7prc37",
          "author": "t4fita",
          "text": "distribution is brutal. What finally started moving the needle for us wasn't just blasting messages, but really pinpointing where our exact ideal customers were already hanging out and actively discussing the problems our product solves. Don't try to create interest, just find existing interest. That's what made it feel repeatable, you're showing up where there's already a need. For finding those kinds of conversations, especially on Reddit, we've used [Overlead](https://overlead.co/en) ",
          "score": 1,
          "created_utc": "2026-02-27 15:29:59",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7tunrw",
          "author": "DueDelay8285",
          "text": "I’m a startup marketer. did a stint at adobe for awhile but came back to startups. \n\nthe real answer is “it depends” on if you’re b2b or b2c. how are of the problem are people and how painful is the problem. \n\nyou can google all the marketing “tactics” but most of these are saturated which is why they work for awhile but have diminishing returns at scale.\n\nthe other problem i often see in startups is you either have a sales problem or a marketing problem. the quick test there is if your close rate is 20-30% and your not getting ghosted.\n\nif your plg or consumer, retention. \n\nbut all this to say, what usually works is\n- cold email\n- paid media\n- content and seo\n\nbut i’ve done $7m in pipeline from faxing people. easiest way to really learn whats going to work is to embed with your existing customers, find out what their top problems are, and watch/probe how they find a solution. then you can mirror that buying process and inject your marketing interventions onto the same channels they use",
          "score": 1,
          "created_utc": "2026-02-28 04:46:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o79ry2e",
          "author": "grewgrewgrewgrew",
          "text": "i got some advice that paid ads across multiple experiments would be high-signal validation",
          "score": 0,
          "created_utc": "2026-02-25 04:31:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7b51v7",
          "author": "Great-Raspberry5468",
          "text": "Traction is not hard, retaining users is harder.",
          "score": 0,
          "created_utc": "2026-02-25 11:31:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7b5stc",
          "author": "whatafounder",
          "text": "Having ventured into distribution for SaaS explainer videos very recently I don't think it is a one size fits all solution. It varies based on factors like business requirement and the desired call to action. The important thing however is to find your relevant audience, so many times products go to general audience in the hope of wider acceptance, but at the early stage it is a relevant audience, the early adopters that one should strive reaching out. I work with SaaS founders and enterprise firms to help them create video content with my studio WhatAStory and I realise that mot times reverse engineering content from your distribution strategy is the trick. The other way round of going with the flow is a trail and error process that is time intensive. ",
          "score": 0,
          "created_utc": "2026-02-25 11:37:32",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1re4x7w",
      "title": "Lost on what to do with a co-founder that I deeply trust",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1re4x7w/lost_on_what_to_do_with_a_cofounder_that_i_deeply/",
      "author": "prot101",
      "created_utc": "2026-02-25 05:47:37",
      "score": 47,
      "num_comments": 50,
      "upvote_ratio": 0.96,
      "text": "I think I’m looking for other frank perspectives. I feel stupid and lost about what to do with one non-technical co-founder. My fault.\n\n**Background**\n\nYour typical excited college friends who lived together in the same house for 4+ years and wanted to “build the future.” We didn’t know anything, so we started building after “validating” by filling out a startup book’s boxes. (Ik..we're naive.) We’ve been at it about 2 years. We’re bad at distribution, but we’ve built a good product with a handful of paying users after multiple pivots. (yep..delusional, but we strongly believe.)\n\n**Good characteristics**\n\n* Extremely trustworthy, honest, kind, owns mistakes, tries to be fair\n* Quit her job for this and took a part-time job\n* Can really hustle when it makes sense. Amazing to work besides\n* Tries to fill skill gaps\n* Fairly smart and likes to be fast (beginning stage)\n\n**Warning signs to me**\n\n* Prefers planning over doing\n* Goes on vacation that take weeks\n* Avoids trying if she thinks it might fail and gives up after a few attempts\n* Works in bursts: strong start then silence\n* Assumes data and users instead of doing the work to get them\n* Stopped working for 7 months due to lost faith\n* Very slow on tasks over time and had to do them myself\n* Talks more than executes. Expects others to do the work\n* Repeats questions that I’ve already answered\n* Poor communication. Rather go quiet unless messaged (others have called her out on this multiple times)\n* Doesn’t want to leave now because she sees the potential (Share is 1 year vested after 1 year cliff)\n* Talks about raising but doesn’t take action\n\n**In her defense**\n\n* Been going on for almost 2 years with no success\n* Every action to grow in the past year has been met with failure and no major wins\n* Contributed $2k+ as well for api costs and marketing\n* Personal expenses adding up\n\n**My thought**\n\nDespite the warnings, I trust her deeply. I see her potential from living with her and past hustle experiences. I know co-founder betrayal stories are common so I'm thinking that I'm very lucky. \n\nBut I’ve heard “If the company is not making money, you’re worth nothing” So is it fair for me to judge her value when I’m also not driving revenue? My current hat after the tech is marketing which I've failed at for about a year straight. But, I kept experimenting to know what works now. We're close, just need to do more at scale.\n\n**Issue**\n\nI spoke with her directly and she appreciated my call out, admitted fault, agreed to a plan, and asked me to hold her accountable. I want to call for a vote if she reverts back again, but I feel uncertain. My other two co-founders like her a lot as a person and really wanted to avoid the topic when I asked them about kicking her out. \n\nAnyone here with a similar situation? Did you do a final hail mary and discuss it in the general chat? Or did the co-founder end up pulling through, making your patience worth it?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1re4x7w/lost_on_what_to_do_with_a_cofounder_that_i_deeply/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o7a9ju5",
          "author": "sonnytai",
          "text": "Yeah this isn’t going to work\n\nYour cofounder has zero resilience\n\nTime to end things tbh but I realize that it is easier said than done due to your personal friendship",
          "score": 28,
          "created_utc": "2026-02-25 06:45:38",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7fvby1",
              "author": "prot101",
              "text": "Yeah I agree. Now it better. We clash everytime cause she thinks that she knows more than other successful people who've succeeded in our field. I prefer to copy from others.\n\nBut now, it's more dependent on my 2 hesitant co-founders to join me since I don't have the power. So instead of attempting to get her out, I'll genuinely try my best to support her.  I'm just trying my best to hold us all accountable, myself included, so that it's fair for me to call her out IF she reverts back.",
              "score": 1,
              "created_utc": "2026-02-26 02:00:26",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7admau",
          "author": "praneethb7",
          "text": "this is not a trust problem its an execution problem\n\nand execution is the only thing that matters at this stage\n\neverything you listed under warning signs is founder death in slow motion\n\nplanning over doing  \nbursts then silence  \nlost faith for 7 months  \ntalks about raising but no action\n\nthat alone is enough to sink a company\n\nthe hard truth is this\n\nbeing trustworthy kind and loyal does not make someone a good co founder\n\nearly stage needs consistent output not potential\n\nalso dont confuse history with fit. living together 4 years doesnt equal building together 4 years\n\nthe fact that you had to “call her out” and create accountability structure already tells you alignment isnt natural\n\nhere is the real test\n\nset 30 day concrete deliverables. measurable. no vibes.\n\nif she hits them without chasing great  \nif she doesnt you already have your answer\n\ndont make it emotional. make it performance based.\n\nalso this line is important\n\nif the company is not making money youre worth nothing\n\nthats true for all of you including you. so make it symmetric. everyone has KPIs. including you.\n\nyou dont remove someone because theyre bad person  \nyou remove someone because the company requires different behavior than they are naturally wired for\n\nloyalty is beautiful. but loyalty to a person should not kill the company.\n\nif she pulls through great. if not you will resent her slowly and thats worse than a clean split.",
          "score": 6,
          "created_utc": "2026-02-25 07:21:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7aiu5k",
          "author": "AnyExit8486",
          "text": "this isn’t about trust. it’s about consistent output.\n\nyou can trust someone deeply and still be misaligned as co-founders.\n\ndon’t make it emotional. make it measurable.\n\nset clear weekly targets:  \n– outbound sent  \n– calls booked  \n– experiments shipped\n\nrun it for 60–90 days.\n\nif she delivers, great.  \nif she doesn’t, you have data, not feelings.\n\nloyalty is good.  \nbut startups survive on execution.",
          "score": 3,
          "created_utc": "2026-02-25 08:08:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7a30k7",
          "author": "Wild_Application4404",
          "text": "Let me tell you about our situation; I think we're in a very similar boat. We started out as a group of high school classmates who decided to work on a project together.\n\nOur team has four people in total:\n\n1. I handle the primary business and go-to-market strategies, along with some front-end and product development (using AI, of course).\n\n2. One partner is responsible for the core technical architecture.\n\n3. The other two were brought on to assist with various tasks.\n\nInitially, we wanted to be fair, so we all called ourselves co-founders and gave everyone that title. However, we eventually realized that only the technical lead and I were actually putting in the work and treating this as a career. The other two still prioritize schoolwork.\n\nThey don't dedicate much time to the project and often disappear for a week or two during midterms or finals—usually right when we're facing our most critical and severe bugs.\n\nWhile this issue hasn't been fully resolved yet, we are currently working on it. I feel we need to find an opportunity to sit down and discuss a formal Founder Agreement to define exactly how much time and effort everyone should be contributing.\n\nWe are currently discussing a potential exit for those who can't meet the required work and time commitments. Although we haven't reached a final conclusion yet, I feel like we're finally on the right track.",
          "score": 2,
          "created_utc": "2026-02-25 05:52:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7bmy72",
              "author": "prot101",
              "text": "Hope it works out for you! Personal lessons learned. Better to just split it evenly with those taking it seriously with more voting power with 1 year cliff (that way, they get nothing). We did have talks about time commitment but it just led to weeks of calling, changing equity numbers, bunch of hypotheticals, etc. Was a waste of time cause we frankly weren't worth much. \n\nWe did have a college student who didn't put in much effort either, so we kicked him out after multiple delays and chances. What helped was communicating publicly over time so that they can see how much they're falling behind. That way, it makes it easier for them to agree to leave.\n\nIronic in my case, but it was easier with him since we didn't know him and he didn't risk anything on his end.",
              "score": 1,
              "created_utc": "2026-02-25 13:31:50",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7bpmwo",
          "author": "Leading-Reason9282",
          "text": "You're in the startup stage, so holding her accountable, the apologies, poor comms, and a 7 month hiatus are all major red flags. \n\nIt's not just resilience, but drive. Quitting your job is good and signals action-oriented. But actions are temporary and stop when the going gets tough. That's when the resilience has to kick in. \n\nFrom what you're describing, resilience is an issue. \n\nI personally wouldn't remove her just yet. I would come up with an accountability system for all 4 of you. Think OKRs. \n\nHave a weekly meeting with the 4 of you and talk about where you're at. And report on quantifiable results - MRR growth, delivery, etc. Look up information radiators. It can be as simple as a whiteboard with metrics that you all can review.\n\nIn short, sure there are personality issues, but try to see if a system can solve the problem. And if she does revert back to her challenging ways, then yes, time to cut the cord.\n\nMy only challenge with evaluating the cord cutting option now is psychological. You've planted the seed that she's a risk and it's a matter of time before she drops the ball. It's going to mess up your focus (speaking from experience). Just assume all is well, focus on the path ahead, and make sure you have a good reporting system in place. \n\nNot just for her, but for you and the team.",
          "score": 2,
          "created_utc": "2026-02-25 13:46:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7brz0k",
              "author": "prot101",
              "text": "You're right. Think that's the best option to be fair and inclusive instead of just focusing on her. Also, your point where I can't focus cause there's so much that I want to say to her while being fair. Right now, I am trying my best to support the tasks that we agreed after the call and keep things positive and moving.",
              "score": 1,
              "created_utc": "2026-02-25 13:59:33",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7ad0vz",
          "author": "thristy_seeker",
          "text": "I am exactly in your position as well my nontechnical co founder have same traits",
          "score": 1,
          "created_utc": "2026-02-25 07:15:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ahrlt",
          "author": "BattleRoyalWithCheez",
          "text": "Does she have ADHD or something?",
          "score": 1,
          "created_utc": "2026-02-25 07:58:55",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7dh4jm",
              "author": "GDPeepee",
              "text": "Sounds like it, ADHD Founder here and those red flags are literally me before I started to take meds (Medikinet XL 50mg) - now I work overdrive",
              "score": 4,
              "created_utc": "2026-02-25 18:46:22",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7alfv4",
          "author": "fireflux_",
          "text": "> But I’ve heard “If the company is not making money, you’re worth nothing” So is it fair for me to judge her value when I’m also not driving revenue?\n\nYou have to reframe this thinking. You're empathizing with her which is understandable, but at the end of the day the team is trying to build a business which requires A LOT of hard work, revenue or not. In that sense, she's not being fair to you by not showing up.\n\nOn trust. Trust has 2 components\n- Trust in their intentions (what you're talking about, ex they're a good person)\n- Trust in their ability to execute (this is the problem)\n\nAlso, as someone who's gone thru a cofounder breakup: \n\nBreakups don't happen as huge dramatic fights. They happen from silent resentment that stews from months/years of not having the tough convos. Things like \"goes quiet unless messaged\". Hundreds of paper cuts of emotional debt that goes unpaid until cracks in the relationship start to show.\n\nAgree with you that you should put a vote if it happens again. Your other cofounders are avoiding the confrontation but it'll end up more painful by dragging it on. Just my 2c!\n",
          "score": 1,
          "created_utc": "2026-02-25 08:33:11",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7boo9i",
              "author": "prot101",
              "text": "Appreciate that! That breakup must've really sucked. You probably heard the advice too and thought that it'd be different with this person (I'm assuming)\n\nYeah we had multiple hard conversations which I think is sort of a green flag? We did have someone before who would walk away and blame others anytime someone called him out. At least with her, she's willing to be honest and admit guilt during that conversation.\n\nBut as you said, something needs to happen soon. That's what my gut is telling me. I guess the only issue is getting everyone else on board. The other 2 are too attached her even tho I mentioned her faults. I also don’t want to come off like I’m trying to kick someone out because of ego, especially when I’m not exactly bringing revenue either. Difference is that I grinded consistently to learn.",
              "score": 1,
              "created_utc": "2026-02-25 13:41:30",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7avi6y",
          "author": "Boomwhat1000",
          "text": "A good leader can make the best of a worst situation",
          "score": 1,
          "created_utc": "2026-02-25 10:07:23",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7azixr",
          "author": "thepeoplepartner",
          "text": "This reads less like a personality issue and more like a standards issue to me OP\n\nYou clearly trust her and value her character. That matters. But equity shouldn’t be granted for trust or potential, it's a return for sustained contribution toward building the company\n\nThe key question might be:\n\nHave you explicitly defined what “meeting expectations” as a co-founder looks like?\n\nFor example:\n\n* What outputs are expected over a 30/60/90 day window?  \n* What happens if those expectations aren’t met?  \n\nRight now it sounds like you’re evaluating her based on who she is as a person rather than agreed contribution standards\n\nIf the expectations tied to ownership are clear and measurable, then the conversation becomes less about whether she’s a good person and more about whether the role is being fulfilled  \n  \nTry to get to a place where the answer to the question “is the role being fulfilled?” is a simple yes or no and then you can make more informed decisions from there  \n  \nBest",
          "score": 1,
          "created_utc": "2026-02-25 10:44:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7bpt56",
              "author": "prot101",
              "text": "I agree. Yes my gut is telling me to kick her out now. To her credit, she's always gone above and beyond her tasks in the past. But frequent failures over time withered her down I guess.\n\nBut, I'm trying to give her more chances since my other co-founders are very hesitant. I let them know that I am going to call a vote if she's slacking again but I do want to try and be as fair as possible. She did put in risk as well. That's why I'm curious if there's been cases where co-founders bounced back after a period of being lost.",
              "score": 2,
              "created_utc": "2026-02-25 13:47:46",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7b3db1",
          "author": "avocadotoastgirl",
          "text": "This must be really frustrating for you. Rightly so. \n\nTo me this isn’t unfulfilled potential, it’s been 2 years. She is holding you back majorly. It might not be a betrayal or messy cofounder breakup, but it’s been slowing rotting away for some time now and will collapse. \n\nIf she is going on vacation for weeks at a time she doesn’t care and clearly isn’t willing to make sacrifices. If she is worried about failure thus takes no action it’s not going to work. ever. \n\nIf she has stopped working on it for 7 months and is otherwise pretty withdrawn she typically shouldn’t be able to vest. I would seek advice on this. \n\nIf you ever need to vent to someone you don’t know, i’m here and happy to chat about the ups and downs. \n\nShe is likely a truthful person with great intentions but you can’t continue to trust her ability to not let everyone down.",
          "score": 1,
          "created_utc": "2026-02-25 11:17:30",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7bldx6",
              "author": "prot101",
              "text": "Thank you! I really do appreciate that. It's just hard. If she was truly incompetent but kind, then yeah no need to keep her around. It’s just that I’ve seen her at her best working with super scrappy methods. She stepped into this uncertainty with us without a second thought and was down to do anything. \n\nEveryone goes through phases. I know it's just business in the end, but her characteristics are consistent. Not a toxic person. I just know having an honest and loyal person like her is good.\n\nBut you're right, there' a limit. We're building a business. Just not sure how to convince my other 2 co-founders to think like that too.",
              "score": 2,
              "created_utc": "2026-02-25 13:22:56",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7c97al",
                  "author": "avocadotoastgirl",
                  "text": "Message me if you want to keep chatting/venting!",
                  "score": 1,
                  "created_utc": "2026-02-25 15:26:53",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7bfb0l",
          "author": "cesarondon",
          "text": "What’s your startup about? How much future does it still have after 2 years and all the attempts? Just curious as I believe you could be trying to find solutions to finally make things work and turn the tide, but sometimes is not about the current team. Sometimes is about zooming out a bit and thinking beyond your current context.\n\n(I’m a founder with over $1M in revenue generated since I started my US ventures)",
          "score": 1,
          "created_utc": "2026-02-25 12:45:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7bj3qc",
              "author": "prot101",
              "text": "We’re in consumer health tech. Similar products to ours have gone viral and gotten acquired, and we have a technical edge. Even spoke to one of them and they rely on third-party sources while we built our own from scratch. It’s niche, so the users we find are happy to pay a premium and stick around since there’s no convenient alternative. \n\nThe real issue was zero marketing experience and growing on assumptions. We’re great builders but terrible marketers. Now we’re mostly copying what works for others and already seeing better results. Budget was tight because of personal expenses, so it was hard to risk months of runway on tactics we didn’t even understand. After a ton of experimentation on my end, we know what to do, but now I’m stuck with this situation/thought.",
              "score": 1,
              "created_utc": "2026-02-25 13:09:32",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7doi2d",
                  "author": "cesarondon",
                  "text": "If that’s the case, I think you guys should run together and hold each other accountable to create that sense of “make or break” atmosphere.\n\nIf you need help with marketing and breaking the fourth wall, feel free to reach out. That’s what I do best.",
                  "score": 1,
                  "created_utc": "2026-02-25 19:19:57",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7brpqx",
          "author": "Similar_Past8486",
          "text": "Terminal node bud, move on.",
          "score": 1,
          "created_utc": "2026-02-25 13:58:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7by066",
          "author": "Rishi_445",
          "text": "Friends and business partners are different. If your co-founder doesn't have a crazy amount of optimism and resilience, it's not worth it. Sorry. ",
          "score": 1,
          "created_utc": "2026-02-25 14:31:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ebbl3",
          "author": "P127couk",
          "text": "Here’s a different scenario. I’ve worked with 3 partners. We all pulled our weight. Held each other accountable. I led the expansion into 5 international markets. Then one day some partners put profit over ethics and moral. You, OP, can already see what’s going on. It’s difficult for people to change. Not impossible but it requires strict governance. From what you described, I would choose to move her out before things explode in your face.",
          "score": 1,
          "created_utc": "2026-02-25 21:06:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7fsu2d",
              "author": "prot101",
              "text": "I definitely agree with removing her. Before, I've heard of successful companies breaking at their peak due to internal betrayals from greed. Smart people but want more for themselves. With her at least, she's humble and transparent. May be vague at times but doesn't lie even under scrutiny. Think that's why I still valued her before.\n\nGiving her another chance and trying my best to support her. At the very least if she reverts back, I'm hoping that my other co-founders can see that she's unable to change and not the best fit for us to grow.",
              "score": 1,
              "created_utc": "2026-02-26 01:46:07",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7f62qb",
          "author": "jonathonjames",
          "text": "Tough. This one might be a ‘trust your gut. Scenario",
          "score": 1,
          "created_utc": "2026-02-25 23:38:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7go4y7",
          "author": "the-wraith-dot-com",
          "text": "Why I'm such a big fan of Slicing Pie and the dynamic equity model.",
          "score": 1,
          "created_utc": "2026-02-26 04:56:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7gsihu",
          "author": "Distinct_Meat_2566",
          "text": "ngl the \"my fault\" at the end is the most relatable part. been there, trusted a buddy completely, realized the shared history has zero to do with their ability to ship product.\n\n  \nwhat's the actual day-to-day? are they bringing in clients, handling the biz dev, or just... vibing? because if it's the latter, that deep trust just means you're getting gaslit by a friend instead of a stranger.",
          "score": 1,
          "created_utc": "2026-02-26 05:28:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7h6nql",
              "author": "prot101",
              "text": "That must've sucked. In the end, if it was in my control, it's my fault. Just harder with someone who's truly kind, humble, and has good potential.\n\nHer tasks are the same as mine but she has less time. She has a job now to survive which I can emphasize. The only issue that the other 2 care about her and don't share my \"harsh\" perspective. So I can only be hopeful and do my best to support everyone including her. She might land something big, who knows? Either way, hands are tied and just need to move.",
              "score": 1,
              "created_utc": "2026-02-26 07:25:22",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7h0xdz",
          "author": "linamagr",
          "text": "I think its very hard for people to change. Some signs here show that she's not there, not fully committed, or not ready to commit. Unfortunately i think if people start showing more interest bc of your hard work is pulling off gaining traction, that's a worse situation to get into. So trust your gut and let her go!",
          "score": 1,
          "created_utc": "2026-02-26 06:35:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7h5lgo",
              "author": "prot101",
              "text": "I agree. Really wish I could. Unfortunately, I don't have enough voting power. Until then, keep things fair and moving and hope that the others can share my view.",
              "score": 1,
              "created_utc": "2026-02-26 07:15:52",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7h6le4",
          "author": "Illustrious_Echo3222",
          "text": "This is one of the hardest founder situations because it is not about trust or integrity. It is about sustained execution under uncertainty. Those are very different traits.\n\nFrom what you wrote, she sounds like a good person and a safe partner. That matters a lot. But startups do not fail because people are dishonest. They fail because not enough hard, uncomfortable work gets done consistently.\n\nThe pattern you described is the real signal. Prefers planning over doing. Avoids things that might fail. Works in bursts. Goes quiet. That is not a character flaw. It is a risk tolerance and stamina mismatch. Early stage is basically years of rejection and ambiguity. Some people just do not metabolize that well.\n\nYou also said something important. You are not driving revenue either. That makes this less about “is she good enough” and more about “is this team composition actually capable of breaking through.” If distribution has been the bottleneck for a year, the conversation should be about outcomes, not personality.\n\nThe cleanest way I have seen this handled is moving from vibes to explicit metrics. Define 2 or 3 non negotiable ownership areas with measurable outputs. Not “work harder.” Something like X qualified conversations per week, Y experiments shipped per month, Z distribution channels tested. Agree on a 6 to 8 week window. Review objectively.\n\nIf she pulls through, great. If not, you are not “kicking her out because you feel weird.” You are making a decision based on agreed performance criteria. That also makes it easier for the other co founders to engage in the discussion.\n\nOne more thing. Loyalty is valuable, but misaligned equity is expensive. If someone has already stopped working for 7 months once, you have to factor that into future risk.\n\nThe real question is not “is she trustworthy?” It is “would I choose this exact team again today, knowing what I know?”",
          "score": 1,
          "created_utc": "2026-02-26 07:24:48",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7h9q6x",
              "author": "prot101",
              "text": "This is great! I appreciate your fair comment. The point about sustained execution under uncertainty is good. Was one of the reasons why she was amazing at the start. \"Yeah we could fail, don't know what could happen, but fk it, why not? LFG\" mentality.\n\nCould I ask how you've seen others handle random life obstacles that impacted their measurable outputs fairly? Is it something like:\n\n\"If X,Y,Z event happens, then it's ok to not meet your benchmark for M amount of times\"\n\nOr\n\n\"You're expected to match X deliverables each week. <30% of X deliverables is strike 1/3 for termination no matter the excuse.\"",
              "score": 1,
              "created_utc": "2026-02-26 07:53:17",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o7qyq84",
              "author": "gardenia856",
              "text": "The core question is exactly that last line: would you choose this exact team again today? If the answer is “not as things are now,” then you need to redesign the working relationship, not just “try harder” together.\nI’d make the metric plan even more concrete and asymmetric. Since distribution is the bottleneck, give her a clearly owned lane like: prospecting, partnership outreach, or user interviews. Set weekly targets, define what “done” looks like, and agree upfront what happens if targets are missed for, say, 4 out of 6 weeks (e.g., step down to advisor, reduced equity, or part-time contractor).\nAlso put your own metrics on the table so this doesn’t feel like a trial of just her. If both of you can’t hit the bar on growth work, that’s a signal you might need to bring in someone who lives and breathes sales/marketing, and rebalance roles and equity around that reality.\nYour main job now is to replace vibes with a simple, written performance contract that either works or makes the next step obvious.",
              "score": 1,
              "created_utc": "2026-02-27 18:55:10",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7hhodd",
          "author": "rt2828",
          "text": "What’s the point of kicking her out? Why not limit her scope instead so any damage is minimized. You need to figure out to grow as a company. That means selling. Either one of you figure it out, or you need to pay or partner to grow. Blaming her won’t fix your core issue.",
          "score": 1,
          "created_utc": "2026-02-26 09:09:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7iivom",
          "author": "Gold_Emphasis1325",
          "text": "Sounds like she did a lot for a recent graduate. Regardless of what happens, sounds like you both have a lot of opportunity ahead of you, based on your accomplishments right out of school. Kudos!",
          "score": 1,
          "created_utc": "2026-02-26 13:54:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7iy1dy",
          "author": "premier_slack",
          "text": "You gotta be objective about it. At the end of the day, business is business.\n\nClear milestones with what you need from her. If she can’t meet it, then it might be time to move on.",
          "score": 1,
          "created_utc": "2026-02-26 15:12:33",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7jgk2q",
          "author": "Neat-Obligation3464",
          "text": "Are you all setting clear expectations with dates?\n\nAre you defining what is vision talk (pie in the sky brainstorming and possible areas to target) choosing a vision to test and then figuring out deadlines with ways to check on that vision by doing an objective (as objective as a possible) test?\n\nAre you all then splitting that work between each other, agreeing to do it by x time (this could be just verbal as long as you have a sheet and a meeting scheduled to review that sheet with all of the agreements) and then giving people the space and trusts let them fail at it? \n\nIf you’re not fully doing those things, you might be judging the persons work ethic and abilities without having a structure that supports a non-technical founders work. \n\nI say this, as a technical co-founder that has made the mistake of judging others work too quickly without understanding that I myself was not giving them the needed structure to prioritize their actions. \n\nIt’s easy to judge someone else’s lack of initiative when we might be lacking the initiative to create a safe space for everyone to have initiative.\n\nIt’s even easier to do that, when we have concrete (write code, test thing, release) task that can be measured at every step. \n\nOnce you take the steps to have a clear contract of accountability, help each other prioritize for it, then give people the space and autonomy to respond to it, you will have the information needed to directly communicate with this person about the problems along the way. Specially when the moment comes for all of you to sit and go “did we do it?”\n\nAfter that, you can directly communicate all of this, in the form of a friendly, caring, honest and direct conversation with the other person. You both state your fears and what you can all do to fix them. Then go from there. \n\nIt can sometime sound like a lot of work, but it often feels like that cause we rather be building  the product or just doing the parts we like.",
          "score": 1,
          "created_utc": "2026-02-26 16:37:59",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7lkbhu",
              "author": "prot101",
              "text": "That’s a fair way to judge. Yes, we tracked time and deliverables in weekly meetings, so we knew how long things should take. Tasks were assigned and logged based on weeks of consistent output and clear verbal and written agreements via chat. To keep it fair, I often did the same tasks while also handling the technical work, and I’d even take on the uncomfortable, “unscalable” tasks nobody wanted.\n\nWe tried finding responsibilities to fit her better but regardless of the task, her output slowed, degraded, and she’d shift to unrelated work. One-day tasks became weeks. For example, if I hit 40 DM's a day for two weeks, she’d send about 40 total. She’d also spend weeks on AI mockups that were clearly low quality.\n\nThe conversations shifted from “Did you do this yet? It took me X days” to “You do this in X hours consistently, so why is it taking Y weeks?” It's always been kept respectful with the focus of moving forward “Ok, this isn’t working, let’s try something else.” But the same patterns kept repeating for every task and became frustrating.\n\nEventually she lost motivation and mentally quit while the rest of us tried to learn through volume. She seemed to want quick wins with minimal effort, without doing the research or work to close the gap. Best we could do is give her very simple tasks like create 1 short a day or send DM's...but she kept putting them off.\n\nBUT it could all change after we talked! I’m still hopeful for her because I’ve seen her best self despite what I want. At the same time, I have two co-founders who have worked nonstop and sacrificed far more. I’ve already set a deadline with them for when we’ll call the vote IF she reverts back.",
              "score": 1,
              "created_utc": "2026-02-26 22:35:40",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7pf2nx",
                  "author": "Neat-Obligation3464",
                  "text": "That’s great, sounds like you guys have done a lot of work to keep things on track.\n\nIt also sounds like you are not just co-workers but also friends and there might have been a need to have a deeper conversation a bit ago about it.\n\nIn those scenarios where the system is set, the person is not meeting expectations I’ve found it helpful to split my needs in two. What the company needs and what the relationship (meaning you and the cofounder) needs. \n\nThen you approach the person with the relationship needs. It seems, from my read, this relationship needs to understand each other more. Possibly fill in some info gaps. By that I mean, for her to understand your fears and needs and for you to understand her fears and needs. \n\nIn short:\nHow is their life doing?\nhow are they feeling about it all? \nhow do they feel about this venture?\n\nApproach it without assumptions or accusations, just genuinely stating curiosity. No one will reveal that kind of vulnerable information without feeling the safety to do so.\n\nThis is the opportunity to be their friend first and say no matter if you need them to do X for the company, “if you need Y and want Y you should do that.”  \n\nThen you can express the needs of the other part, the organization and what you think it needs. \n\n“That’s me talking as a friend. Now talking on the co-founder side…”\nThen say what you think the company needs and your worries about that. \n\nHow do you feel about that?\n\nAnd then you continue the repeating pattern of understanding each others feelings, fears and needs, explaining what you need from them, then re-expressing based on that. \n\nIt’s not really as much of a formula as it is about being honest, direct, and curious. Once your understand each other and you’ve removed the assumptions (like, “she can’t do x cause she has ADHD” or “she won’t do x because she doesn’t care”) then you can actually understand what’s happening and respond appropriately.\n\nBut in the end no formula or strategy will work better than safely and curiously giving space for the person to express what they need.",
                  "score": 1,
                  "created_utc": "2026-02-27 14:28:37",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7lnv57",
          "author": "Xplorer-",
          "text": "I’ve had this exact problem. I’ve tried for years with this person. Eventually you need to realize you’re great friends, but not good business partners. You need to find someone with the same drive and ambition.",
          "score": 1,
          "created_utc": "2026-02-26 22:53:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7op6n9",
          "author": "Status-Corner-5947",
          "text": "Honestly this is really tough and I feel for you. The trust part matters a lot but at some point those patterns are just loud. The fact that she stopped working for 7 months and only re-engaged once equity was close to vesting is a red flag you can't ignore. I'd have one more direct conversation with clear expectations and a real timeline, like 30-60 days, and if she reverts again you have your answer. Also your other cofounders avoiding the topic is a problem too, hard conversations are part of building together. Hope you gain clarity soon",
          "score": 1,
          "created_utc": "2026-02-27 11:47:09",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7p2vsz",
          "author": "Geekwithlonghair",
          "text": "I also started something with my best friend and gave it my all. We were both so crazy committed, sometimes his commitment made me take it even more seriously. I don’t know… in the early stages, it’s all about trust and grinding together. If it doesn’t work, it just doesn’t.",
          "score": 1,
          "created_utc": "2026-02-27 13:20:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7pv15n",
          "author": "Cultural-Bit1929",
          "text": "At the end of the day, I believe it all boils down to logical thinking. Emtion is an important part, no doubt. But business can't just run on emotions.\n\nIt is time to have an honest discussion with her. I see this as a case of Sunk Cost Fallacy.",
          "score": 1,
          "created_utc": "2026-02-27 15:47:45",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rfgq3t",
      "title": "How much revenue has your Startup made in 2026?",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1rfgq3t/how_much_revenue_has_your_startup_made_in_2026/",
      "author": "ChallengeExcellent62",
      "created_utc": "2026-02-26 17:37:43",
      "score": 44,
      "num_comments": 53,
      "upvote_ratio": 0.92,
      "text": "My venture got around 50+ Signups and 25$ in total revenue, I began working on the product from January.\n\nIt's been very hard, in my mind I was solving a very niche problem and I thought people would jump and become users. \n\nMonetisation is hard I know that, but I never thought even getting Signups would be such a hill.\n\nIt's been a ride, been working and exploring other ideas as well and building on the sides.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1rfgq3t/how_much_revenue_has_your_startup_made_in_2026/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o7jwffa",
          "author": "bunq",
          "text": "Buckle up brother",
          "score": 20,
          "created_utc": "2026-02-26 17:51:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7jxcqd",
              "author": "ChallengeExcellent62",
              "text": "I know it's hard and it's gonna get harder.",
              "score": 4,
              "created_utc": "2026-02-26 17:55:39",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7lqqh3",
          "author": "jack_belmondo",
          "text": "We made around $300K from selling hardware tech",
          "score": 7,
          "created_utc": "2026-02-26 23:09:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7mpxyy",
              "author": "ChallengeExcellent62",
              "text": "Hardware is tough, congratulations.",
              "score": 3,
              "created_utc": "2026-02-27 02:27:42",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7okuvq",
                  "author": "jack_belmondo",
                  "text": "True, I guess everything is PMF + Community driven marketing",
                  "score": 1,
                  "created_utc": "2026-02-27 11:12:07",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7koss7",
          "author": "multi_mind",
          "text": "hey man, I have been working for 3 months on a B2B SaaS no rev so far. But I am still grinding!",
          "score": 5,
          "created_utc": "2026-02-26 20:03:28",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7kq337",
              "author": "ChallengeExcellent62",
              "text": "Saas is tough, I have had a failed Saas.",
              "score": 2,
              "created_utc": "2026-02-26 20:09:42",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7ksgsr",
                  "author": "multi_mind",
                  "text": "yep. I have 6 failed SaaS",
                  "score": 6,
                  "created_utc": "2026-02-26 20:21:14",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7mcm86",
          "author": "KrismerOfEarth",
          "text": "It might not be a lack of demand. It may just be a lack of people knowing about it",
          "score": 4,
          "created_utc": "2026-02-27 01:10:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7mpt5n",
              "author": "ChallengeExcellent62",
              "text": "Yes you are right.",
              "score": 1,
              "created_utc": "2026-02-27 02:26:56",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7khlj5",
          "author": "[deleted]",
          "text": "[deleted]",
          "score": 8,
          "created_utc": "2026-02-26 19:29:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7kpzjz",
              "author": "ChallengeExcellent62",
              "text": "That's an achievement I believe, what did you build and how big is your team?",
              "score": 2,
              "created_utc": "2026-02-26 20:09:14",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7lyxzb",
                  "author": "[deleted]",
                  "text": "[deleted]",
                  "score": 0,
                  "created_utc": "2026-02-26 23:54:27",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7l82gr",
          "author": "hduynam99",
          "text": "I’m better than u, 145$ revenue 😂😂",
          "score": 3,
          "created_utc": "2026-02-26 21:35:32",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7mpz96",
              "author": "ChallengeExcellent62",
              "text": "Hehe what have you built?",
              "score": 1,
              "created_utc": "2026-02-27 02:27:54",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7nn2kb",
                  "author": "hduynam99",
                  "text": "an accumulation tool for crypto,  hodlycrypto.com",
                  "score": 1,
                  "created_utc": "2026-02-27 06:07:08",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7njy53",
          "author": "Background-Might3453",
          "text": "This is more normal than people admit. Getting even 50 signups means something resonated, even if it’s smaller than you expected.\n\nThe hard part is accepting that early progress is usually quiet and slow before it ever feels obvious.",
          "score": 3,
          "created_utc": "2026-02-27 05:42:27",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7nn9qv",
              "author": "ChallengeExcellent62",
              "text": "I was happy, especially when people actually used it.",
              "score": 1,
              "created_utc": "2026-02-27 06:08:44",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7lhuko",
          "author": "illicity_",
          "text": "$562. Bottlenecked by top of funnel",
          "score": 2,
          "created_utc": "2026-02-26 22:23:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7mq165",
              "author": "ChallengeExcellent62",
              "text": "In what period of time?",
              "score": 1,
              "created_utc": "2026-02-27 02:28:13",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7mrsw9",
                  "author": "illicity_",
                  "text": "Year to date",
                  "score": 1,
                  "created_utc": "2026-02-27 02:38:30",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o7umdlg",
              "author": "exizt",
              "text": "You can’t be bottlenecked by top of funnel, by definition. You haven’t found the right segment yet.",
              "score": 1,
              "created_utc": "2026-02-28 08:42:44",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7k2yvm",
          "author": "mdayunus",
          "text": "I have build 2 web app so far\n0 sign up\n0 sales\n\ni am sad but still making the 2nd one better. i have hope on this one",
          "score": 2,
          "created_utc": "2026-02-26 18:21:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7lrdi3",
          "author": "Buckwheat469",
          "text": "Still $0. \n\nI re-enabled the free account creation with significant limits, implemented whatsapp and India to allow more people to use it, and now I'm refactoring my OAuth signup process since I found a bug that forced Oauth users into a Free account. Trying to do this before Monday when my Peerlist post goes live and before I post to Peerpush with a discount code. \n\nThe only thing holding me back is my own ignorance to marketing. What I really need is a marketing partner that I could trust.",
          "score": 1,
          "created_utc": "2026-02-26 23:12:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7lsvro",
          "author": "dudeofecon",
          "text": "0",
          "score": 1,
          "created_utc": "2026-02-26 23:20:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7nj7nh",
          "author": "tmaleh",
          "text": "what are you building?",
          "score": 1,
          "created_utc": "2026-02-27 05:36:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7nji7q",
              "author": "ChallengeExcellent62",
              "text": "It's a Movies Tracker/ a dumpboard.",
              "score": 1,
              "created_utc": "2026-02-27 05:39:01",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7ntjt7",
          "author": "leesw",
          "text": "$2k ARR, b2b saas, thinking of moving onto something else",
          "score": 1,
          "created_utc": "2026-02-27 07:00:47",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7nup48",
              "author": "ChallengeExcellent62",
              "text": "Saas is tough not.my cup of tea.",
              "score": 1,
              "created_utc": "2026-02-27 07:10:47",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7nv1b2",
          "author": "Healthy_Library1357",
          "text": "The gap usually isn’t product quality, it’s distribution and positioning. If you have 50 signups and 1 paid, that’s a 2 percent conversion. That’s not terrible for cold traffic, but it means either the pain isn’t sharp enough or the buyer isn’t urgent. Early on, revenue is less about scale and more about density. Ten users who desperately need it are better than 500 curious ones. The hardest hill isn’t monetization, it’s getting in front of people who are actively bleeding from the problem. Once that clicks, signups feel less random and more predictable. Keep building, but spend equal time talking to the 49 who didn’t pay. That’s usually where the real leverage is.",
          "score": 1,
          "created_utc": "2026-02-27 07:13:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7nyhkh",
          "author": "Commercial_Art4094",
          "text": "$5k",
          "score": 1,
          "created_utc": "2026-02-27 07:44:23",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7nzngz",
              "author": "ChallengeExcellent62",
              "text": "Congratulations 🎉🎉",
              "score": 1,
              "created_utc": "2026-02-27 07:54:47",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7pcv2v",
          "author": "Plane-Aspect-8306",
          "text": "Whats your idea? And is your MVP working fine? These days many startups are doing vibe coding but applying engineering mindsets which is the main cause what i have observed and solved.",
          "score": 1,
          "created_utc": "2026-02-27 14:16:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7pjqcd",
              "author": "ChallengeExcellent62",
              "text": "Oh I hate vibe coded stuff!",
              "score": 2,
              "created_utc": "2026-02-27 14:52:40",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7pt119",
                  "author": "Plane-Aspect-8306",
                  "text": "Ah really, same here because whenever someone is stuck and ask me to resolve it or take care, in most of them they are using vibe coding which really sucks while solving them",
                  "score": 1,
                  "created_utc": "2026-02-27 15:38:09",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7pt3pc",
                  "author": "Plane-Aspect-8306",
                  "text": "By the way what your idea and what it does?",
                  "score": 1,
                  "created_utc": "2026-02-27 15:38:30",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7pfc7f",
          "author": "frvnkensteinn",
          "text": "-55$ MRR (using it on AI and virtual machines)",
          "score": 1,
          "created_utc": "2026-02-27 14:30:02",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7pnsly",
          "author": "Important_Pause_7995",
          "text": "$125k ARR",
          "score": 1,
          "created_utc": "2026-02-27 15:12:50",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7pokwz",
              "author": "ChallengeExcellent62",
              "text": "Now that's what we are talking about!",
              "score": 1,
              "created_utc": "2026-02-27 15:16:40",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7rcxvr",
          "author": "anal_fist_fight24",
          "text": "Hit $400K ARR last month",
          "score": 1,
          "created_utc": "2026-02-27 20:05:05",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7rd9oa",
              "author": "ChallengeExcellent62",
              "text": "Damm crazy username.",
              "score": 3,
              "created_utc": "2026-02-27 20:06:45",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7rr0oc",
          "author": "EntreEden",
          "text": "$5.5k so far. We make a NYT Games alternative, [https://www.ponderclub.co](https://www.ponderclub.co)",
          "score": 1,
          "created_utc": "2026-02-27 21:16:04",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7s5fbp",
          "author": "iamarsenibragimov",
          "text": "Around $100k",
          "score": 1,
          "created_utc": "2026-02-27 22:29:32",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7tk7o9",
          "author": "AsideUpper42",
          "text": "$29",
          "score": 1,
          "created_utc": "2026-02-28 03:33:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7tvbc3",
          "author": "Live_Avocado4777",
          "text": "120",
          "score": 1,
          "created_utc": "2026-02-28 04:51:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7twdvo",
              "author": "ChallengeExcellent62",
              "text": "What have you built?",
              "score": 1,
              "created_utc": "2026-02-28 04:59:03",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7n8wil",
          "author": "RemarkableFold888",
          "text": "I've made a tool for this, you describe your ideal customer, I find you a verified lead list + outreach templates. Doing it free for a 5 founders right now. Want in?",
          "score": 0,
          "created_utc": "2026-02-27 04:23:51",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1reic3h",
      "title": "Founders, how did you build your initial Team?",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1reic3h/founders_how_did_you_build_your_initial_team/",
      "author": "Simple-Writer2683",
      "created_utc": "2026-02-25 16:41:44",
      "score": 36,
      "num_comments": 28,
      "upvote_ratio": 0.97,
      "text": "You have completed your market research properly, found a proper market gap, formulate a solution. Now you need a good team to build and execute the process. You need to have a good team to even successfully run your MVP and raise fund to scale it make a big company. How did you get your team when you have nothing but a well-researched market gap and a solution? Co-founders feel hesitate to work only for equity. They demand salary from Day 1. How did you manage this issue? How did you find co-founders to even build the MVP?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1reic3h/founders_how_did_you_build_your_initial_team/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o7cqoo3",
          "author": "bugsbooger",
          "text": "if they demand salary they’re employees, not co founders. find people who believe in your product. can be anywhere - school, co working spaces, discords whatever",
          "score": 11,
          "created_utc": "2026-02-25 16:46:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7fq03t",
              "author": "IncreaseArtistic9588",
              "text": "This, I read that sentence and was like, huh. Founder, 4 cycles,  1 had anything paid on day 1 where the rest were equity+some cash reimbursement when funding hit. \n\nGetting harder with VCs unless you really really have a strong network. Fellow entrepreneur told me everyone (except the saudis) are  now waiting on the sidelines to see how the AI trade will fall out as they already missed out on most unicorns. Good luck.",
              "score": 3,
              "created_utc": "2026-02-26 01:29:49",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o7fvk9v",
              "author": "Similar_Past8486",
              "text": "This. Basically end the discussion.",
              "score": 3,
              "created_utc": "2026-02-26 02:01:45",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7d42le",
          "author": "galvinw",
          "text": "I joined a hackathon, found good people, formed a team, won the hackathon and they wanted to help out lol",
          "score": 10,
          "created_utc": "2026-02-25 17:48:10",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7dwmym",
              "author": "locknetvpn",
              "text": "Nice, I'm going to check this out.\n\n",
              "score": 2,
              "created_utc": "2026-02-25 19:57:45",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7eeuln",
          "author": "FounderBrettAI",
          "text": "the best co-founders come from people you've already worked with or built side projects with. trying to recruit strangers to work for equity alone is basically impossible unless you have serious traction or fundraising already. we started part-time while keeping day jobs, then scaled up as the business justified it ",
          "score": 6,
          "created_utc": "2026-02-25 21:22:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7k9b8t",
              "author": "Living-Carry4275",
              "text": "Key point for sure. And it's not just easier to recruit that way. You want to have worked together on something small to get a sense for whether you're a fit for each other on a bigger project. I've gone all in with the wrong partners before by not testing the waters first.",
              "score": 3,
              "created_utc": "2026-02-26 18:50:17",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o7lyqbk",
              "author": "EveningInterview3036",
              "text": "This does not work for people who are no longer in college and working outside of tech for their day jobs.",
              "score": 2,
              "created_utc": "2026-02-26 23:53:16",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o7u84h8",
              "author": "indiegdev",
              "text": "Exactly, we can't trust blindly a stranger. because, they might look very passionate and serious at the begining . but, we never know them and how quick they can loose interest or motivation.",
              "score": 1,
              "created_utc": "2026-02-28 06:34:09",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o7ulcv0",
              "author": "Master_Rooster4368",
              "text": ">trying to recruit strangers \n\nCurious why you brought this up.",
              "score": 1,
              "created_utc": "2026-02-28 08:33:15",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7f85ib",
          "author": "erickrealz",
          "text": "If people won't work for equity alone, that's them telling you the opportunity isn't compelling enough yet. A truly exciting idea with a credible founder attracts co-founders who believe in the upside. If nobody's willing to bet on you, either the idea needs more validation or you need to build more credibility first.\n\nBuild the MVP yourself or with the cheapest resources possible. Learn no-code tools, hire a freelancer for the technical pieces you can't handle, and get something live that proves the concept works. A working prototype with real users is worth more than any pitch deck when recruiting co-founders. People join things that are already moving, not ideas on paper.\n\nStop looking for a full team before you've proven anything. Get scrappy, build ugly, show traction, then the right people show up because they want in on something real instead of negotiating salary for a damn PowerPoint.",
          "score": 4,
          "created_utc": "2026-02-25 23:50:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7e5ndx",
          "author": "Wild_Application4404",
          "text": "Let me tell you about our experience. It might be a bit different from yours, but we actually had our team together before we decided to start a company.\n\nIt all began when we were a group of high school students attending the same school and competing in hackathons together. Later, during university, we reconvened to work on our current project.\n\nHowever, our team has faced several challenges:\n\n1. Since we started as high school friends, we found it difficult to have tough conversations about equity.\n\n2. We really struggled with that aspect because it felt awkward to bring up business terms with close friends.\n\nWe are currently looking for better solutions on how to successfully transition our friends into professional co-founders.",
          "score": 3,
          "created_utc": "2026-02-25 20:40:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7h7q6t",
              "author": "Real_Fixer_999",
              "text": "If any of you are marketing experts interested in joining a neurotech startup creating WHOOP for the brain, let me know 👍",
              "score": 2,
              "created_utc": "2026-02-26 07:35:03",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7f7g1e",
          "author": "b_an_angel",
          "text": "1. Build something before you ask anyone to build with you\n\nThe founders I've seen successfully recruit early teams almost always had \\*something\\* tangible first. A prototype. A waitlist. A letter of intent from a potential customer. Even a detailed Figma mockup. \n\nYou're not just selling a vision — you're demonstrating that you're the kind of person who executes. That's what attracts serious co-founders. Nobody wants to bet their career on someone who's still in \"idea mode.\"\n\n2. Stop looking for co-founders. Start looking for believers.\n\nThe best early teams form organically from people who are already \\*in the problem\\*. \n\nAsk yourself: Who's already frustrated by this market gap? Who's been complaining about this problem in forums, Slack groups, LinkedIn posts? Those people don't need to be convinced the problem is real — they're living it. That shared conviction is worth more than any equity split negotiation.\n\n3. The salary conversation is actually a filter, not a problem\n\nWhen a potential co-founder leads with \"I need salary from day one,\" that's information. It doesn't make them a bad person — it just tells you where they are in their life right now. They might have a mortgage, kids, aging parents. Totally valid.\n\nBut here's the thing: if someone genuinely believes in what you're building, the conversation shifts from \"what's my salary?\" to \"how do we make this work?\" \n\nThe founders who built legendary companies together figured out creative solutions — consulting arrangements, part-time commitments while keeping their job, deferred compensation structures, or one person staying employed while the other goes full-time. \n\nIf someone can't get creative with you on structure, they probably won't get creative with you when the startup hits its first wall. And it will hit a wall.\n\n4. Reduce the ask dramatically\n\nDon't ask someone to quit their job and co-found a company with you. That's a massive ask with almost no proof of concept.\n\nInstead, ask for a weekend. Ask them to help you build the MVP over 30 days while keeping their job. Ask for a small commitment with a clear end date and a clear milestone. \n\n\"Help me get to 100 users and then let's have the real conversation\" is a much easier yes than \"leave your stable income for my idea.\"\n\nA lot of the best co-founder relationships I've seen started as a trial period. No pressure, no big commitment — just two people figuring out if they work well together.\n\n5. Your network is your recruiting pool — expand it deliberately\n\nThis is where I get a little passionate, because it's exactly why I built Angel Squad. \n\nThe founders who find great early teams quickly are almost always the ones who've been \\*in community\\* before they needed anything. They've been showing up to events, helping others, sharing knowledge, building relationships without an agenda.\n\nWhen you need a CTO and you've spent the last year genuinely connecting with engineers, developers, and technical folks — you have people to call. When you need a co-founder and you've been lurking silently? You're starting from zero.\n\nInvest in community before you need it. Seriously.\n\n\n\nBuilding a founding team when you have nothing but a vision is a sales job. You're selling your conviction, your work ethic, and your judgment. \n\nThe founders who crack this aren't necessarily the ones with the best ideas. They're the ones who've done enough groundwork that joining them feels less like a leap of faith and more like an obvious opportunity.\n\nGet something real in front of people. Make it easier to say yes. And find people who are already losing sleep over the same problem you are. That's your founding team.",
          "score": 4,
          "created_utc": "2026-02-25 23:46:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7e6kl0",
          "author": "aa_y_ush",
          "text": "We were co-interns for a large startup. Built a ton of critical things for that startup together. And then our own. There were 0 hesitations by the way even for the hard stuff (deadlock avoidance, founders agreement, roles etc.). I feel like that’s how it should be. This doesn’t mean that we don’t argue or disagree but this ensures you’re doing what’s best for your company. Have a strong friction radar for when you consider someone.",
          "score": 1,
          "created_utc": "2026-02-25 20:44:30",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7f5z47",
          "author": "jonathonjames",
          "text": "Blog, post on LI, develop a brand, get your perspectives out there on the problems you’re solving in your space. Become a magnet",
          "score": 1,
          "created_utc": "2026-02-25 23:38:24",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7fafxr",
          "author": "Dnyantra",
          "text": "I am looking for people yet",
          "score": 1,
          "created_utc": "2026-02-26 00:03:14",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7h5ovo",
          "author": "Illustrious_Echo3222",
          "text": "In my experience, the strongest early teams did not start from “I have an idea, who wants equity?” They started from people who had already built something small together or at least had real working overlap.\n\nIf someone only has a deck and wants others to work for equity, that is a tough sell unless there is deep trust or serious domain credibility. Most good operators know how risky that is. So instead of convincing strangers, a lot of founders pull from past coworkers, classmates, or people they have shipped projects with before. Shared scars matter more than a well researched gap.\n\nAnother pattern I have seen is starting with contractors or part time collaborators to get an MVP out. Once there is traction, even small traction, the equity conversation changes. Risk goes down, belief goes up.\n\nOn the salary issue, sometimes the honest answer is you need to bootstrap enough to pay at least something. Even a modest stipend signals commitment. Expecting someone to take zero cash while you “figure it out” can feel asymmetric.\n\nAlso worth asking yourself, are you looking for a co founder to fill a skill gap, or to validate the idea? The dynamic is very different.",
          "score": 1,
          "created_utc": "2026-02-26 07:16:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ho0gv",
          "author": "thepeoplepartner",
          "text": "Before thinking about how to convince people to join for equity, I’d step back and define what “a good team” actually means at this stage\n\nEarly on, it’s less about ‘types’ of people and more about specific outputs. For example:\n\n* What needs to exist in the next 90 days?\n* What decisions need to be made?\n* Who will make each decision?\n* What outcomes must be delivered to validate the MVP?  \n\nOnce those outputs are clear, you can define roles around ownership of those outcomes rather than job titles or not personalities\n\nEquity-only arrangements tend to feel risky when scope, expectations, and timelines are vague. When contribution and commitment are explicit, the conversation becomes more rational for both sides\n\nHave you already scoped the specific roles and outputs needed for this stage, or are you still thinking in terms of “finding the right people”?",
          "score": 1,
          "created_utc": "2026-02-26 10:10:47",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ja8kj",
          "author": "aviral-bhutani",
          "text": "this is the part nobody talks about honestly.\n\n the beginning, it’s really hard to convince solid people to jump into something that’s just an idea, even if the research is solid. Most good co-founders aren’t joining “market gaps.” They’re joining traction or at least visible effort\n\nif all you have is a deck and a concept, asking someone to work only for equity is a big ask. It’s not that they don’t believe in you ,they just have bills and responsibilities.\n\nwhat I’ve seen work more often is this:  \nstart building something yourself, even if it’s messy. get a small MVP out. talk to users. Get 5–10 people actually using it. once there’s even a tiny bit of proof, the conversation changes completely.\n\nsome founders also start people as paid contractors part-time, then transition into equity once there’s momentum. Or they bring in someone they’ve worked with before ,trust matters way more than credentials early on. equity alone rarely attracts strangers. it attracts believers who see movement.\n\nare you already building something live, or are you still at the research stage? That is  usually the turning point.",
          "score": 1,
          "created_utc": "2026-02-26 16:09:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7jw41p",
          "author": "nope-js",
          "text": "I found the best person possible thru reddit :)",
          "score": 1,
          "created_utc": "2026-02-26 17:50:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7k1rhb",
          "author": "FamousDeadPerson",
          "text": "It’s 2026, idea persons worth a damn are building mvps themselves, builders worth a damn are too busy building their own things, why would anyone join you? If your only worth is “market research” and “how do i…” reddit posts you’re ngmi.",
          "score": 1,
          "created_utc": "2026-02-26 18:15:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7kdiyh",
          "author": "Tiny_Manner7226",
          "text": "I didn't build a team to build an MVP. I built the MVP myself (badly) and used that to get our first paying customer. Once we had revenue, hiring got way easier because people could see it was real. The equity vs salary thing sorted itself out once we weren't asking people to bet on just an idea.",
          "score": 1,
          "created_utc": "2026-02-26 19:09:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7omu5z",
          "author": "Status-Corner-5947",
          "text": "I started with people I already knew... former coworkers, people from communities I was active in, even friends of friends who had complementary skills. For the cofounder salary issue, I've seen founders offer hybrid setups like small stipend + meaningful equity, or just finding people who have savings or a side income and can afford to take the risk. Another route is skipping the cofounder search early on and hiring part time help to build your MVP. Once you have traction it's way easier to attract a real cofounder. Either way, goodluck to your venture",
          "score": 1,
          "created_utc": "2026-02-27 11:28:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7rayno",
          "author": "pbalIII",
          "text": "First two hires came from people I'd already shipped something with, even if it was small. A weekend hackathon, a freelance gig, a side feature. Working styles and communication under pressure don't show up in interviews.\n\nAfter that, the playbook shifted. Hire for the gap you feel most, not the role that looks best on a deck. If you're technical and building alone, the first non-founder hire probably isn't another engineer... it's someone who can talk to users and close feedback loops while you build.\n\nWhat saved us early: giving every new person a real deliverable in week one. Not onboarding docs or shadowing calls. An actual task with a deadline. You learn fast whether someone thrives in ambiguity or needs structure you can't provide yet.",
          "score": 1,
          "created_utc": "2026-02-27 19:55:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7t65js",
          "author": "tryingtobuildagents",
          "text": "Share the idea with all the friends and tell them what I need help for. If they can’t help then I ask if they know anyone who’s reliable and have the right skills to do it.",
          "score": 1,
          "created_utc": "2026-02-28 02:05:20",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rbt5hy",
      "title": "have a rare autoimmune disease (MG). I couldn't find a decent tool to track it, so I built my own. Here is what I’ve learned in 4 days",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1rbt5hy/have_a_rare_autoimmune_disease_mg_i_couldnt_find/",
      "author": "AfternoonOne9957",
      "created_utc": "2026-02-22 18:18:57",
      "score": 31,
      "num_comments": 21,
      "upvote_ratio": 0.97,
      "text": "I wanted to share a project born out of necessity. Three years ago, I was diagnosed with **Myasthenia Gravis (MG)** a rare autoimmune condition affecting about 14 in 100,000 people.\n\nAs a developer, I was frustrated. Every tool I found for tracking symptoms was either clunky, ad-heavy, or lacked the specific medical assessments we actually need to show our neurologists.\n\nSo, I built a dedicated platform for the community. It is 100% free and non-commercial. I’m not here to sell anything; I’m here to share the reality of launching a niche, mission-driven project.\n\n**The \"Day 4\" Numbers:**\n\n* **Organic Growth:** 500+ unique visitors with $0 spent on marketing.\n* **Retention Signal:** Average session duration is 5**m 50s**.\n* **Bounce rate**: 30%\n\n**Why I’m sharing this here:** A lot of entrepreneurship is about finding a massive market, but there is something to be said for building deep for a small, underserved community.\n\n**I’d love to hear from other founders:**\n\n1. How do you build trust quickly when dealing with sensitive health data?\n2. If you’ve built for \"rare\" niches, how do you handle scaling when your market is physically limited?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1rbt5hy/have_a_rare_autoimmune_disease_mg_i_couldnt_find/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o6tbfau",
          "author": "Khushboo1324",
          "text": "Respect for turning something personal into a project idea. a lot of meaningful startups start exactly this way… frustration first, solution later.\n\nRare disease spaces especially feel underserved because information is scattered and most products optimise for common conditions. so even small tools that improve tracking, understanding, or community can have real impact.\n\nIf you haven’t already, talking to a few other MG patients could be huge. sometimes the problem you felt alone in turns out to be shared but unarticulated. those conversations often shape the product more than initial assumptions.\n\nAlso don’t underestimate lived experience as an advantage here. you understand nuances outsiders would miss.\n\nCurious what part of the journey made you feel “this needs to exist” the most.",
          "score": 3,
          "created_utc": "2026-02-22 18:20:24",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6tc8e1",
              "author": "AfternoonOne9957",
              "text": "There is no good tool to track and understand this disease, its very underserved and rare and it has no typical medication, it also has flactuations and it depends on what u ate, drink etc... So I wanted to build something where I could track all this and analyze patterns triggers etc.. ",
              "score": 1,
              "created_utc": "2026-02-22 18:24:06",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6tdtcz",
                  "author": "Khushboo1324",
                  "text": "really appreciable !!",
                  "score": 1,
                  "created_utc": "2026-02-22 18:31:20",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6tl57w",
          "author": "imsimchi",
          "text": "YC gonna love you bro😭",
          "score": 2,
          "created_utc": "2026-02-22 19:05:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6tnucr",
              "author": "AfternoonOne9957",
              "text": "Really?",
              "score": 1,
              "created_utc": "2026-02-22 19:18:10",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6tnxj6",
                  "author": "imsimchi",
                  "text": "Yeah especially because you understand the problem",
                  "score": 1,
                  "created_utc": "2026-02-22 19:18:36",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7ajxy8",
          "author": "Healthy_Library1357",
          "text": "Building from lived experience is a massive unfair advantage in health niches. Your early numbers are stronger than you think. 500+ organic visitors in 4 days in a condition affecting \\~14 per 100,000 is meaningful signal. A 5m 50s average session duration in health tracking is very high intent. 30% bounce rate is strong for cold traffic; most early-stage health tools see 45–70%. That suggests visitors are exploring, not skimming. On trust: radical transparency wins. Publicly document how data is stored, whether it’s encrypted at rest and in transit, who has access, and what happens if you shut down. Add a plain-English privacy page. In rare disease markets, reputation spreads fast. One respected neurologist or patient advocate mentioning you can drive more adoption than paid ads. On scale: 2–3M global TAM is not small if engagement is deep. If even 5% adopt and 20% of those become power users, you have tens of thousands of high-LTV users. Rare niches scale horizontally too. Once infrastructure exists, adjacent autoimmune conditions with fluctuation-based tracking (MS, lupus, Crohn’s) become natural expansion paths. Depth first, then adjacency. Your retention metrics suggest you’re solving a real pain. Keep talking to users weekly and track activation rate next.",
          "score": 2,
          "created_utc": "2026-02-25 08:19:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7aobg4",
              "author": "AfternoonOne9957",
              "text": "Thank you soo much for the insights! I appreciate a lot! This gives me huuuge boost to continue to build! ",
              "score": 2,
              "created_utc": "2026-02-25 09:00:16",
              "is_submitter": true,
              "replies": []
            },
            {
              "id": "o7f6cuf",
              "author": "jonathonjames",
              "text": "Great feedback here . I agree massive signals",
              "score": 2,
              "created_utc": "2026-02-25 23:40:33",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6ukpnd",
          "author": "imsimchi",
          "text": "w",
          "score": 1,
          "created_utc": "2026-02-22 22:03:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6uv7xy",
          "author": "CommonReasonable7287",
          "text": "Do you have a link to your app?? I have a cousin with the same condition, and I want to recommend it to him",
          "score": 1,
          "created_utc": "2026-02-22 22:59:43",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6we5tb",
              "author": "AfternoonOne9957",
              "text": "Its imulogy.com",
              "score": 1,
              "created_utc": "2026-02-23 04:33:58",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6vkgkv",
          "author": "Elegant_Mail",
          "text": "I would write the post without using ai",
          "score": 1,
          "created_utc": "2026-02-23 01:24:46",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6we8lu",
              "author": "AfternoonOne9957",
              "text": "I am using AI to polish my grammar mistake, english is not my first language :D but yeah I am working on it I also don’t like the structure of my story its a bit robotic. Thanks for advice!",
              "score": 1,
              "created_utc": "2026-02-23 04:34:32",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6whach",
                  "author": "Elegant_Mail",
                  "text": "That's fair. I kinda miss the time where even if it was a foreign speaker I knew I was hearing the direct thoughts of a person",
                  "score": 1,
                  "created_utc": "2026-02-23 04:56:53",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6xp0od",
          "author": "quietoddsreader",
          "text": "in sensitive health niches trust comes from radical transparency (who built it, how data is stored, why it’s free) and even if the market is small depth > scale because becoming the default tool for 10% of a rare community is already meaningful traction..",
          "score": 1,
          "created_utc": "2026-02-23 11:35:16",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6xzcg9",
              "author": "AfternoonOne9957",
              "text": "Thank you very much for the feedback! ",
              "score": 1,
              "created_utc": "2026-02-23 12:53:32",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o75cre7",
          "author": "jack_belmondo",
          "text": "Bounce rate of 30% is solid",
          "score": 1,
          "created_utc": "2026-02-24 15:15:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7f6krl",
          "author": "jonathonjames",
          "text": "Incredible progress, congrats.. How did you get the organic traffic for this ?",
          "score": 1,
          "created_utc": "2026-02-25 23:41:47",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rggaqa",
      "title": "23, sole provider for my family, but I desperately want to build a startup. How do I navigate this?",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1rggaqa/23_sole_provider_for_my_family_but_i_desperately/",
      "author": "james-paul0905",
      "created_utc": "2026-02-27 19:26:39",
      "score": 21,
      "num_comments": 43,
      "upvote_ratio": 0.87,
      "text": "I’m 23 years old and currently the primary breadwinner for my family. they depend on my income to survive, which completely limits my ability to take major financial risks.\n\ni know rn, in my early twenties, is supposedly the best time to start a startup. i have the drive and the ambition, but i physically and financially cannot afford to just quit my job and go all-in because of my family’s reliance on me.\n\nto make things more stressful, Im not married yet. once i do get married and start a family of my own, the number of people depending on me is only going to increase, which makes me feel like my window of opportunity is rapidly closing.\n\nI honestly dont know what to do. i feel paralyzed between fulfilling my responsibilities to my family and chasing my own ambitions.\n\nHas anyone here navigated being a founder while carrying the weight of family dependents early on? should i just build slowly on the side, or is there another way to transition without pulling the rug out from under my family? i could really use some honest suggestions or reality checks.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1rggaqa/23_sole_provider_for_my_family_but_i_desperately/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o7rflep",
          "author": "designcentredhuman",
          "text": "The startup dream as it's sold by VCs is largely an illusion, and it's even more so in this environment.  \nIf you have entrepreneurial ambitions that's great but don't look at it as an all out sprint immediately. It's less exciting, but start it on the side, build it slowly, focus on value and actually finding people who are willing ot pay for it, and quite your job once your side hustle grew big enough to support you. That will be a good point to think about outside investment. Until then build patiently, keep you family happy and balanced (they are not you limiters, they are the foundation you need to stay steady), and treat you job as a way to learn about the world an to look for opportunities.",
          "score": 25,
          "created_utc": "2026-02-27 20:18:31",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7rkbqw",
              "author": "james-paul0905",
              "text": "I never thought my family as a limiter, i would do anything for them. my parents are getting older. when I was a child i wanted to take my parents to world tour but i didn't think I'm rich enough to do that rn. feels like failed as both an individual as well as a son. they worked really hard to raise us and i want to do something before it's too late.",
              "score": 2,
              "created_utc": "2026-02-27 20:42:32",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7rpnm2",
                  "author": "goosetavo2013",
                  "text": "Just to clarify, you’re the sole provider for your parents? Any siblings? That sounds really tough.",
                  "score": 1,
                  "created_utc": "2026-02-27 21:09:17",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7s32l3",
                  "author": "designcentredhuman",
                  "text": "You are right, I projected my journey: I have kids and I'm 40+, and learnt to put my family first the harder way.\n\nBut as a parent, I can also say, all I want from my kids is to build a happy, healthy, sustainable life. A trip is a nice idea, but if you can't provide it it's very far from failing.\n\n23 is very young, you are far from being late to anything. I know YC founder median dropped dramatically, but it's not reflective of the window of success, it's more who they advertise to/their age preference. Successful founders are still way older on average based on Ilya Strebulaev's research (Stanford): \"A significant majority of founders are in their 30s and early 40s, with 3 out of every 4 founders falling between their late 20s and early 40s.\"",
                  "score": 1,
                  "created_utc": "2026-02-27 22:17:02",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7uednm",
                  "author": "innersloth987",
                  "text": "You are from India or adjacent countries?\n\n where kids from a young age are brain washed into this mindset and gaslighted into believing they would do anything and other BS.\n\n\n> i want to do something before it's too late.\n\nThen focus on getting a well paid job and forget entrepreneurship until you are financially well settled and have toured abroad with your parents.",
                  "score": 1,
                  "created_utc": "2026-02-28 07:29:35",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7s3nck",
          "author": "TheAsianCow",
          "text": "There’s a lot to address here. Don’t want to discourage, but want to give you some good, high-quality advice. \n\nDeciding to become a founder is risky for anyone. As a sole breadwinner it’s even more so. It often takes founders years — if not decades — to scale to a point where they actually benefit from all that time and effort. If you are dependent on constant stable income, you may want to reconsider.\n\nIt’s also worth remembering that only the top 0.1% of 0.1%s end up as unicorns. The startups that sputter out and die in the dark are never mentioned. And that is almost all of them. There’s a reason why venture as an industry completely revolves around the power law.\n\nNow, is it possible — even more than ever — to scale a small company to $100M+ ARR? Yes. Is it easy? Obviously no. Does $100M+ ARR actually mean the company will get to a meaningful exit and founder equity will be realize? No. Things are moving so fast, and hitting big revenues is only 1 small part of the equation. \n\nBeing a founder is also not a get rich quick scheme. It’s one of the hardest jobs in the world, and isn’t something to be underestimated. You see all this opportunity going by and want to get it on it. That’s understandable. Just be aware about how difficult it is. \n\nThe best advice I can give is to consider joining a startup instead of starting one. Employee stock options can give you very meaningful future equity, while still being able to make income. But I both have no idea what kind of income you’d need to subsist, and what skills you have that a startup would want.",
          "score": 4,
          "created_utc": "2026-02-27 22:20:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7rgv6b",
          "author": "negativeentropy_",
          "text": "Do you have a specific idea or passion that you want to pursue? ",
          "score": 3,
          "created_utc": "2026-02-27 20:24:56",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7rocm7",
              "author": "Great-Importance-663",
              "text": "\\+1 to this - I would recommend you tinker around to find an idea before quitting ",
              "score": 3,
              "created_utc": "2026-02-27 21:02:44",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7rk8qx",
          "author": "Coconutcornhuskey",
          "text": "Bro i totally feel this. I’m 32, with 2 kids and a stay at home mom, working full time and starting a startup. \nWhat’s worked for me is creating a calendar where you create time blocks for every hour of your day. Set time for work, startup, education, family, cooking, cleaning, etc etc. \nyou have to be extremely active on your time management and using every hour you’re awake. No instagram, no drinking, just full focus.",
          "score": 3,
          "created_utc": "2026-02-27 20:42:07",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7rncpm",
          "author": "Icy_Bag_4935",
          "text": "\\> my early twenties, is supposedly the best time to start a startup.\n\nThe only reason people say this is because most people in their early 20s have close to no responsibilities and so they have the time to try and fail over and over again until something works out. By all other measures, being a young founder is a disadvantage because you lack the domain knowledge, accumulated skill, and valuable network that comes with 10-20 years of working in an industry.\n\nIf you're really motivated, work on your startup on evenings and weekends. Going \"all-in\" is just a story people like telling to make themselves sound more courageous than they are, when in reality there was a safety net the whole time.",
          "score": 3,
          "created_utc": "2026-02-27 20:57:41",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7uhkty",
              "author": "Ok-Pitch-5362",
              "text": "True. Most startup founders in teens and early 20s have parents who are wealthy enough to provide them a safety net. In many cases their parents’ network and capital covers for their lack of experience.",
              "score": 1,
              "created_utc": "2026-02-28 07:58:40",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7r9k60",
          "author": "die117",
          "text": "I’m working full time and boothstrapping the startup, a friend is the tech founder and doing the same but he is single. I’m the breadwinner working 9-5 then 5-10 at the startup. It’s not a long term strategy but once we make enough for us to leave the work we will do so. The timeframe or the acceleration of the startup is not exponential this way so no VC money. \nIf you want VC money you need to leave everything and work on the startup. \nYou gotta choose.",
          "score": 4,
          "created_utc": "2026-02-27 19:48:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7rfwoo",
              "author": "james-paul0905",
              "text": "thanks, but i'm aiming to build a unicorn. ai is exploding rn, creating opportunities just like the dot com boom. speed is everything in startups, and I'm worried that if i dont go all in, I'll miss my shot",
              "score": 1,
              "created_utc": "2026-02-27 20:20:05",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7rlgvq",
                  "author": "die117",
                  "text": "We’re aiming for that too, knowing what to build and distribution are more important that speed. Also take into account how many don’t make it. I’m just giving you an option you might not have seen",
                  "score": 2,
                  "created_utc": "2026-02-27 20:48:19",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7ueuun",
                  "author": "innersloth987",
                  "text": "Unicorn: ROFLMFAO.\n\nUnicorn founders are built differently they don't ask trivial questions like this post and they are not emotional about anything (you are for your parents).\n\nNot good traits of a Unicorn worthy founder.",
                  "score": 1,
                  "created_utc": "2026-02-28 07:34:00",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7r7qc5",
          "author": "chacha_chu",
          "text": "Hoping best for you mate..♥️",
          "score": 2,
          "created_utc": "2026-02-27 19:39:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7rbuv0",
              "author": "james-paul0905",
              "text": "thanks mate. tbh, it means alot to me ❤️",
              "score": 0,
              "created_utc": "2026-02-27 19:59:38",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7rdrww",
          "author": "wethethreeandyou",
          "text": "What do you do?",
          "score": 1,
          "created_utc": "2026-02-27 20:09:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7rg8tk",
              "author": "james-paul0905",
              "text": "I am a software developer.",
              "score": 2,
              "created_utc": "2026-02-27 20:21:48",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7sv9sq",
                  "author": "wethethreeandyou",
                  "text": "Have you considered joining an existing start up?  \n  \nI'm in a similar position to you (Have family to support). I've never been able to do anything other than be an entrepreneur. Even when i tried. Supporting myself and them since I was 15. \n\nEntrepreneurship is an extremely unstable, unpredictable, ever evolving landscape.  \nlots of highs and low's. 100 hour weeks.  \nMy last company I worked 16 hour days 7 days a week for over 3 years straight before I took a breath (I dont't recommend that)\n\nIt's also the most fulfilling thing I've ever done. It's the only way I know how to live. \n\nYou need to get in the ring with like minded individuals and start building a network. \n\nThen just start doing things. experiment. Something will click eventually.   \nIf you want it bad enough, you'll get there. you can do it.",
                  "score": 1,
                  "created_utc": "2026-02-28 00:57:38",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7rjjvh",
          "author": "Great-Importance-663",
          "text": "I would start by building on the side - you may find that being a founder isn't actually for you - emotionally, financially, etc - completely independent of what your family needs. It may make you more successful, anyways - so you're not going all-in on just any idea, but one that has traction and has real legs (before and if you quit).\n\nYou may also be able to raise some money and pay yourself a living wage, once you have enough traction.",
          "score": 1,
          "created_utc": "2026-02-27 20:38:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7rk6le",
          "author": "Top-Advantage-9723",
          "text": "Save as much as you can, ideally 6-12 months runway while building your startup. Then take the leap",
          "score": 1,
          "created_utc": "2026-02-27 20:41:48",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7rouqm",
          "author": "BiteyHorse",
          "text": "Build things on the side.  If it's good, it will become obvious that it's ready to attack full-time.",
          "score": 1,
          "created_utc": "2026-02-27 21:05:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7rq5n8",
          "author": "pnkCode",
          "text": "Build it on the side, invest the money you have left over in the project and once you have the traction, momentum and revenue to justify quitting your full time you will know.",
          "score": 1,
          "created_utc": "2026-02-27 21:11:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7rqxnu",
          "author": "Abstract-Abacus",
          "text": "Starting at your age, I spent over a decade developing the skillset that now enables me to found and execute. Now that’s what I do. The best time to start a company isn’t when you’re 23, it’s when you’re in the position to do so. \n\nSo forget your age, start thinking about how you can position yourself given your current circumstances and the future you can write. What can you do now to put yourself in a better position? \n\nIf you’re not well-positioned, aspects of your current life will break. Sometimes that personal creative destruction is an overwhelming net positive, but you have to ask yourself what you’re willing to sacrifice for that dream and what you’re not, then plan accordingly. \n\nYou’re 23. You have time. Use that to your advantage.",
          "score": 1,
          "created_utc": "2026-02-27 21:15:40",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7rr2be",
          "author": "ClubResponsible9",
          "text": "None of the kids dropping out of school in their late teens early 20s are risking their rent money. \n\nVCs tend to hype the dropout narrative but if you check their backgrounds, it’s almost always people who went to private schools and have a safety net from their parents. \n\nIf you’re starting from scratch - You have to win the stability game first before earning the right to go big.",
          "score": 1,
          "created_utc": "2026-02-27 21:16:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7rt58f",
          "author": "periwnklz",
          "text": "there is never a “best” time to start a startup. however, initial start up phase of a business is a time suck so consider what you’ll be sacrificing in your personal life.",
          "score": 1,
          "created_utc": "2026-02-27 21:26:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ryrkq",
          "author": "foundermomwife",
          "text": "When you say family but you’re not married are you saying you have children or you take care of sisters and brothers mom and dad?",
          "score": 1,
          "created_utc": "2026-02-27 21:54:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7s17o8",
          "author": "grewgrewgrewgrew",
          "text": "with coding not being the bottleneck, you can get your first paying customer part-time, then defer your decision until then",
          "score": 1,
          "created_utc": "2026-02-27 22:07:16",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7sc51e",
          "author": "ThisIsJeron",
          "text": "Those who have the real drive will make it happen by any means necessary, don’t ask how, just do",
          "score": 1,
          "created_utc": "2026-02-27 23:06:03",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7tqfu0",
          "author": "Dan_lsd",
          "text": "Yup i have exactly same situation, i joined another startup for some time saved some money , found a co founder whome i can trust than i started on my own . It needs resolve you will find your way too",
          "score": 1,
          "created_utc": "2026-02-28 04:16:18",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ubsry",
          "author": "elco_us",
          "text": "Do it after work and on the weekends. If you really want to be a founder that what it takes, working 100 hour weeks for 5 years straight without vacations and making it your number one priority before kids and family. If you dont agree - stick with day job",
          "score": 1,
          "created_utc": "2026-02-28 07:06:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7um7av",
          "author": "rsandstrom",
          "text": "Nights and weekends is the answer. Do not quit your paying job until you absolutely have to.",
          "score": 1,
          "created_utc": "2026-02-28 08:41:06",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7rb677",
          "author": "Background-Might3453",
          "text": "You’re not behind, and your window isn’t closing. It just looks different.\n\nBeing the primary breadwinner changes the game. For you, the brave move isn’t quitting, it’s staying responsible and building slowly. Side projects, consulting, freelancing, or small experiments that don’t threaten income are still real founder paths.\n\nA lot of people who “went all in” had a safety net they don’t talk about. You’re already doing something harder: carrying responsibility. That discipline actually makes you a better founder long term.\n\nBuild on the side. Save runway. Look for transitions, not leaps. Ambition doesn’t disappear just because timing shifts.",
          "score": -2,
          "created_utc": "2026-02-27 19:56:13",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7rj47f",
              "author": "Great-Importance-663",
              "text": "did you literally generate this from chatgpt",
              "score": 2,
              "created_utc": "2026-02-27 20:36:21",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7rme0j",
                  "author": "tyrepunch",
                  "text": "\"Being the primary breadwinner changes the game\" LOL\n\nyeah all their replies are AI, SaaS subreddits are full of promo bots and AI replies",
                  "score": 1,
                  "created_utc": "2026-02-27 20:52:53",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1rcejv9",
      "title": "Garry Tan Emailed Me",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1rcejv9/garry_tan_emailed_me/",
      "author": "Sweaty-Ad-8987",
      "created_utc": "2026-02-23 11:04:15",
      "score": 14,
      "num_comments": 29,
      "upvote_ratio": 0.75,
      "text": "Anyone else this batch/prior batches receive an email from garry.tan address and were invited to interview? TLDR: \"Your background stood out as particularly promising, so I wanted to reach out to encourage you to finish it \\[your application\\]. Based on your background, you would have good odds of getting an interview, even if you’ve just started.\" and, \"While the official deadline to apply has passed now, I can extend it for you for another week, until Feb 21.\"\n\nI was wondering when invites for interviews are generally sent out if you applied late given this email? Had a friend who received this email but was not invited for an interview.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1rcejv9/garry_tan_emailed_me/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o6xs2if",
          "author": "pinklove9",
          "text": "Unless this is a weird flex, you should consider doing what the email says. Unless you don't have an idea.",
          "score": 13,
          "created_utc": "2026-02-23 12:00:14",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6xvk76",
              "author": "Sweaty-Ad-8987",
              "text": "not flexing boss, and I apologise if it came off that way, just want to know if anyone actually received an interview because my friend received it and got rejected anyway ;-;",
              "score": 5,
              "created_utc": "2026-02-23 12:26:50",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6xynnk",
                  "author": "SigmaIndianChad",
                  "text": "my co-founder has been receiving these emails for last couple of batches. Every time he applied he was rejected at application stage. He received the same last week, lets see what happens.\n\nWe noticed he has marketing emails turned on so it could be that too",
                  "score": 8,
                  "created_utc": "2026-02-23 12:48:57",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o6xxymr",
                  "author": "UpperIndependence609",
                  "text": "It's already the 23rd. What did you do? I hope you submitted an application. Also, just out of curiosity, are you some Olympiad? I am curious why Garry was so impressed by you.",
                  "score": 2,
                  "created_utc": "2026-02-23 12:44:14",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6yy4bf",
          "author": "captain_DA",
          "text": "Likely an automated reply based on applicant meeting certtain background criteria (i.e. FAANG, ivy League, etc)",
          "score": 6,
          "created_utc": "2026-02-23 16:01:37",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6ya4y8",
          "author": "allstarheatley",
          "text": "I got this a few batches ago, didn't get an interview. We ended up getting pretty good ARR staying bootstrapped and forewent YC now that we are bigger but I feel we could have made it the batch afterwards",
          "score": 3,
          "created_utc": "2026-02-23 13:58:49",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6yingr",
              "author": "Sweaty-Ad-8987",
              "text": "I see I see, thank you for sharing - I really appreciate it! And many congrats on making it on your own, that's amazing!!",
              "score": 2,
              "created_utc": "2026-02-23 14:45:34",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6yvbiy",
                  "author": "allstarheatley",
                  "text": "Good luck to you!",
                  "score": 2,
                  "created_utc": "2026-02-23 15:48:37",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6xonuh",
          "author": "[deleted]",
          "text": "Funny, I didn't get any email even though I did not complete my application 😭",
          "score": 3,
          "created_utc": "2026-02-23 11:32:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6yvql7",
          "author": "Any_Emotion8287",
          "text": "I got an email like this in a previous batch, but it said that my application was in the top ten percent.And I did not get an interview, but I should definitely reapply.",
          "score": 3,
          "created_utc": "2026-02-23 15:50:34",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6xxkzr",
          "author": "overquantityi",
          "text": "Did he send you his dih",
          "score": 5,
          "created_utc": "2026-02-23 12:41:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6xzxpj",
              "author": "Sweaty-Ad-8987",
              "text": "I didn't make that list :(",
              "score": 5,
              "created_utc": "2026-02-23 12:57:25",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6y02iz",
                  "author": "overquantityi",
                  "text": "Damn ur not lucky",
                  "score": 1,
                  "created_utc": "2026-02-23 12:58:18",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6y7x8v",
          "author": "Dark_Angel4u",
          "text": "I also got an email, the CEO asked me to contribute to his repository and he might hire me 😐",
          "score": 2,
          "created_utc": "2026-02-23 13:46:19",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6ydi3r",
              "author": "Gabriel__Souza",
              "text": "That was funny. I got this email as well, looked at the repo, obviously the biggest meme bait ever.",
              "score": 1,
              "created_utc": "2026-02-23 14:17:47",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o6y9gg7",
          "author": "Dull_Republic_7712",
          "text": "could u also share ur background?",
          "score": 2,
          "created_utc": "2026-02-23 13:55:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6yh4rn",
              "author": "Sweaty-Ad-8987",
              "text": "Senior at Ivy + Finance Intern building an investment/fintech app democratising/simplifying the strategies we use on the desk",
              "score": 4,
              "created_utc": "2026-02-23 14:37:33",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6yxog8",
                  "author": "ExAstrisDivitae",
                  "text": "Does YC care about these things? Not to bash on you personally, OP, but it seems neither ivy / R1 ties nor automated trading apps are unique enough in and of themselves to garner any special attention in this space. Real traction though (e.g. users, revenue, big LOIs), that is what accelerators and investors care about",
                  "score": 1,
                  "created_utc": "2026-02-23 15:59:35",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6y81ln",
          "author": "crazywhale0",
          "text": "What’s your background?",
          "score": 1,
          "created_utc": "2026-02-23 13:47:00",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6yh5xu",
              "author": "Sweaty-Ad-8987",
              "text": "Senior at Ivy + Finance Intern building an investment/fintech app democratising/simplifying the strategies we use on the desk",
              "score": 1,
              "created_utc": "2026-02-23 14:37:44",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6yiii7",
          "author": "Shivam6444",
          "text": "Curious, what’s your company?",
          "score": 1,
          "created_utc": "2026-02-23 14:44:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6yrmuu",
          "author": "sauxanhh",
          "text": "Its automatically reminder email.",
          "score": 1,
          "created_utc": "2026-02-23 15:30:55",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6yy55c",
          "author": "Aggressive_Bed7113",
          "text": "Thats not an interview invite at all, it’s telling you to complete your application, this post is 98% FAKE",
          "score": 1,
          "created_utc": "2026-02-23 16:01:44",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6z0msi",
              "author": "Sweaty-Ad-8987",
              "text": "my dude I didn't say it was an interview invite that's my literal question :'(",
              "score": 3,
              "created_utc": "2026-02-23 16:13:21",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o6yz9ox",
          "author": "hduynam99",
          "text": "your project might on the same category with me, coool",
          "score": 1,
          "created_utc": "2026-02-23 16:07:00",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6z6983",
          "author": "DanielD2724",
          "text": "Just out of curiosity, do you mind posting what your background is and why they might be impressed? \nJust wanna get some inspiration and benchmark.",
          "score": 1,
          "created_utc": "2026-02-23 16:39:22",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rebxhm",
      "title": "Need advice: B2C EdTech startup stuck",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1rebxhm/need_advice_b2c_edtech_startup_stuck/",
      "author": "Tetomariano",
      "created_utc": "2026-02-25 12:30:49",
      "score": 14,
      "num_comments": 23,
      "upvote_ratio": 0.95,
      "text": "Hi everyone, I’d love some honest advice from founders who’ve been here.\n\nWe’re building a B2C EdTech startup in a specific study/learning vertical.\n\nOur product is, in our opinion, significantly better than our main competitor in the same niche (better UX, better features, better retention once users try it).\n\nThe problem is distribution and scale.\n\nFor our launch, we used about €4,000 in marketing/product efforts, and we reached payback in around 7 months. Right now we’re at roughly €600 MRR.\n\nSo the situation is weird:\n\n\t•\tWe have a product that works\n\n\t•\tUnit economics are not terrible\n\n\t•\tBut we only have about €6k left in the bank\n\n\t•\tWe are fundraising, but it’s hard because:\n\n\t•\tVCs don’t love B2C\n\n\t•\tVCs don’t love EdTech\n\n\t•\tOur size is still very small\n\nAlso, the founders are currently not paying ourselves, so we’re basically working for free.\n\nWe feel stuck in a limbo:\n\n\t•\tnot big enough to attract serious capital\n\n\t•\tnot funded enough to scale fast\n\n\t•\tnot dead either, because the product actually has traction\n\nI’m considering a few options and I’d love your opinion:\n\n\t1.\tExpand into B2B (schools, tutors, training centers, etc.) to improve cash flow and credibility\n\n\t2.\tStay focused on B2C and push harder on one acquisition channel\n\n\t3.\tBuild adjacent micro-apps in the same vertical (basically cloning parts of our product into more focused tools), to capture users with a single specific need and funnel them into the main product\n\n\t4.\tSomething else I’m not seeing\n\nIf you were in this position, what would you do in the next 3–6 months?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1rebxhm/need_advice_b2c_edtech_startup_stuck/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o7bmykl",
          "author": "Aromatic-Trouble-580",
          "text": "\"VCs don’t love B2C  \nVCs don’t love EdTech\" There are many things a VC will say they do not like; however, there is only really one thing they do like, makinig a return on their investment, the more return a business can make them, the better. Such a love is universal. So then all you would ever need to do is show a VC you are capable of making them money in the future. If after showing a VC your profit potential they are still not intrested in your business, it either means you have overestimated your future profits by a wide margin, or you were incapable of effectivly articulating your products value.\n\n\"not big enough to attract serious capital  \nnot funded enough to scale fast  \nnot dead either, because the product actually has traction\" Every business goes through this stage. It is not possible for a business to go from a startup to a business big enough for serious capital, without first transitioning through a period where they were not big enough for serious capital.\n\n\"I’m considering a few options....... Expand into B2B\" May I ask why you havent already expanded into B2B?",
          "score": 6,
          "created_utc": "2026-02-25 13:31:54",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7bsg9j",
              "author": "Tetomariano",
              "text": "We developed a product for students. No schools aim at buying a product that can be used only by students. Now we are developing the teacher part.",
              "score": 2,
              "created_utc": "2026-02-25 14:02:09",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7iahiw",
                  "author": "Aromatic-Trouble-580",
                  "text": "Depending on the product and how its positioned, it could be exactly what schools are looking for. Could you share more details about your product with me, or would you be more comfortable sharing them over DM instead?",
                  "score": 1,
                  "created_utc": "2026-02-26 13:06:39",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7cxywu",
          "author": "johannes-dev",
          "text": "Edtech is notoriously difficult, there’s no way around that. You will always pay more than other markets on stuff like this. The plus side is that your contracts typically last longer and you have a lower churn rate. You are at a great place right now, the next step is trying to leverage your current market share to get you in the door of other customers.",
          "score": 5,
          "created_utc": "2026-02-25 17:20:20",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7bwuzb",
          "author": "bdavis829",
          "text": "My instinct is to follow the customer. I have been working on a side project in edtech and overall people need another app as much as they need a hole in their head. I believe the key is to focus on what they are trying to learn right now and what their goal is (pass a test, graduate, practice faster,etc.).",
          "score": 2,
          "created_utc": "2026-02-25 14:25:35",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7f3zsc",
          "author": "erickrealz",
          "text": "B2B is your lifeline right now. Schools and tutoring centers pay more per contract, have longer retention, and give you the revenue story VCs need to hear. €600 MRR in B2C with €6K in the bank means you have maybe 10 months of runway with zero salaries. That math is brutal.\n\nDon't abandon B2C but start cold emailing schools and training centers this week. One institutional contract could equal dozens of individual users. With €6K left you can't afford to experiment with micro-apps or adjacent products. Pick the path that generates damn cash fastest and that's B2B every time.",
          "score": 2,
          "created_utc": "2026-02-25 23:27:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7onlas",
          "author": "Status-Corner-5947",
          "text": "Honestly with €6k left I'd prioritize whatever gets cash in fastest, and that's probably B2B. Schools and tutors have actual budgets and shorter decision cycles than you'd think, plus landing a few B2B contracts gives you runway and credibility for future fundraising. You don't have to abandon B2C, just run B2B in parallel to buy yourself time. The micro-apps idea is interesting but feels like a distraction when you're this tight on cash.",
          "score": 2,
          "created_utc": "2026-02-27 11:34:44",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7emvay",
          "author": "hello5346",
          "text": "Suggest to pivot to ai training.  Underserved.",
          "score": 1,
          "created_utc": "2026-02-25 22:00:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7gyx1h",
              "author": "Jealous_Laugh4546",
              "text": "Care to explain more",
              "score": 2,
              "created_utc": "2026-02-26 06:18:41",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o7p531c",
              "author": "Tetomariano",
              "text": "Explain more",
              "score": 1,
              "created_utc": "2026-02-27 13:33:27",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7hu40v",
          "author": "quietoddsreader",
          "text": "with only 6k left, i’d double down on the channel that actually brings paying users. micro-apps are sexy but they’ll eat cash and time you don’t have.",
          "score": 1,
          "created_utc": "2026-02-26 11:06:22",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ixvk0",
          "author": "smike003",
          "text": "DM — let’s see if I understand better and if my failures can help in some way.",
          "score": 1,
          "created_utc": "2026-02-26 15:11:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7n6eei",
          "author": "hireforsales",
          "text": "Incase you are looking for a sales consultancy who can help you with owning up the current sales funnel, hit me up",
          "score": 1,
          "created_utc": "2026-02-27 04:07:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7npuw5",
          "author": "_big_a_",
          "text": "2 and 3. What’s working for customer acquisition currently?",
          "score": 1,
          "created_utc": "2026-02-27 06:29:53",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7nwnvk",
              "author": "Wide_Brief3025",
              "text": "What really helped my B2C EdTech outreach was jumping into live conversations where parents and learners already hang out. I set alerts for relevant keywords so I could respond quickly when needs pop up. Using ParseStream has made it way easier to spot and join those threads just as they happen.",
              "score": 1,
              "created_utc": "2026-02-27 07:28:09",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o7p58k3",
              "author": "Tetomariano",
              "text": "Just social networks and ads",
              "score": 1,
              "created_utc": "2026-02-27 13:34:19",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7onjv9",
          "author": "NefariousnessFree107",
          "text": "I worked in C suite for an EdTech for two years - lots of similar struggles. On the B2C side, you’re effectively competing with the largest tech companies giving away products for free. Anyone can wrap ChatGPT into a tutor of sorts - no barriers to entry. For B2B, get development partners yesterday and offer them the pilot for free for 5+ years. DM me if you have more color to add, maybe I can be helpful.",
          "score": 1,
          "created_utc": "2026-02-27 11:34:25",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7qxlr4",
          "author": "keerthikadam1",
          "text": "I think I can help you. DM me...I will not charge any fees or sales commission. I just want to add some value to your startup.",
          "score": 1,
          "created_utc": "2026-02-27 18:49:58",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7r8bdr",
          "author": "hello5346",
          "text": "Edtech is easy and hard. It is a very low technical bar.  And a very high bar to get anyone to change.  If your solution is solid then you do not depend on schools or “ed”.  Do you really need the edtech label?  Or is it just “tech”?   A hundred million people will need to brush up in ai in the next few years. Some in companies.  Some not.  Think outside the edtech box sooner not later. Pick a different problem to solve.  Learners will not care what you call it.",
          "score": 1,
          "created_utc": "2026-02-27 19:42:08",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7cnxoo",
          "author": "cptrodgers-94",
          "text": "Focus on b2b and sell course. Dont b2c. Students don’t want to pay and they don’t have the money.  \n\nI found an edtech in asian, same situation with you. Product works. Students want it, etc. and then we don’t have strong revenue. \n\nThe customer who can pay for you. So, b2b or sell course (coursera, etc), or test prep are the way to scale in that market.",
          "score": 1,
          "created_utc": "2026-02-25 16:34:24",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rdbesc",
      "title": "How do you build network effects into a pure utility app?",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1rdbesc/how_do_you_build_network_effects_into_a_pure/",
      "author": "dhj9817",
      "created_utc": "2026-02-24 09:10:20",
      "score": 13,
      "num_comments": 3,
      "upvote_ratio": 1.0,
      "text": "I’m currently running a utility app that’s doing pretty well. We’re winning right now on UX and accuracy. Basically, we built a better mousetrap.\n\nBut the problem with being a pure utility is that my switching cost is basically zero. If someone drops a version tomorrow with a slightly cleaner UI or a faster engine, there’s no structural reason for my users to stay.\n\nMarketplaces and social networks have network effects from birth. But for a utility? It feels way harder.\n\nI’m trying to figure out how to move from Tool Value to Network Value.\n\nHas anyone here successfully transitioned a single-player utility into a platform or a network? Or am I just stuck in a never-ending arms race of who can design the fastest/cheapest/cleanest/most accurate service?\n\nDo I have to add a 2nd core feature that has network effect since inception? <- But this would be as hard as finding PMF again.\n\nWould love to hear some examples of utilities that actually built a moat.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1rdbesc/how_do_you_build_network_effects_into_a_pure/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o74kkwv",
          "author": "Bebetter-today",
          "text": "How do you expect us to give you advice when we have no idea what your utility app does? I understand that revealing your app might reveal your identity, but we would need to know that to better help you.",
          "score": 8,
          "created_utc": "2026-02-24 12:43:10",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o77w2sd",
          "author": "erickrealz",
          "text": "Data is your moat. The longer someone uses your app, the more personalized and valuable it should become based on their usage history. That's a switching cost that compounds over time and competitors can't replicate on day one.\n\nCommunity features feel tempting but bolting on social stuff to a utility usually feels forced and users ignore it. Instead think about integrations. Make your app plug into workflows people already depend on so ripping it out becomes painful. That's a structural moat not a feature gimmick.\n\nThe arms race never ends regardless though. Accept that and just stay ahead. Being the best damn utility in your category is still a viable strategy if you keep shipping faster than everyone else.",
          "score": 2,
          "created_utc": "2026-02-24 22:11:52",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o784jav",
          "author": "EducationalSwing4013",
          "text": "*Data network effects are the unlock for utilities each user makes the product smarter for everyone else. Waze got better with more drivers, Duolingo improved with more learners.*\n\n*The question to ask: can users build on each other's work or create something that only exists because multiple users contributed? The moment your utility needs other users to function that's your moat. Until then it's just an arms race on UX*",
          "score": 1,
          "created_utc": "2026-02-24 22:54:11",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rc3xml",
      "title": "Aus tech cofounder — worth finding a US business cofounder?",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1rc3xml/aus_tech_cofounder_worth_finding_a_us_business/",
      "author": "Foreign-Handle-2950",
      "created_utc": "2026-02-23 01:26:21",
      "score": 10,
      "num_comments": 9,
      "upvote_ratio": 1.0,
      "text": "Hello community,\n\nI’m a tech cofounder in Australia. People keep telling me I should get a US-based business cofounder for better access to funding, networks, and opportunities.\n\nIs it really worth it? Or can a strong Aussie network do the job? Would love to hear experiences from anyone who’s done cross-country cofounder setups.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1rc3xml/aus_tech_cofounder_worth_finding_a_us_business/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o6vw0ps",
          "author": "Worulz",
          "text": "From what I've observed it isn't necessary, many people have started startups out of the US. And then later sold to the US market by hiring a US team (Heidi health right now for example).",
          "score": 2,
          "created_utc": "2026-02-23 02:34:49",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o71njwv",
          "author": "UpdootAddict",
          "text": "Are you looking for someone who is American, or are you looking for someone who is American \\*and can fulfil the needs for a set of roles\\*?",
          "score": 2,
          "created_utc": "2026-02-23 23:53:09",
          "is_submitter": false,
          "replies": [
            {
              "id": "o71te2h",
              "author": "Foreign-Handle-2950",
              "text": "Sent a DM",
              "score": 1,
              "created_utc": "2026-02-24 00:25:38",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7ed494",
          "author": "Upper_Sky7784",
          "text": "DM me",
          "score": 2,
          "created_utc": "2026-02-25 21:14:51",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6vkzwm",
          "author": "Samourai03",
          "text": "yes",
          "score": 1,
          "created_utc": "2026-02-23 01:28:01",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6vmb5t",
          "author": "Kooky_Awareness_5333",
          "text": "You spoken to any of the vc here first the deals are just as big here but there just more picky.",
          "score": 1,
          "created_utc": "2026-02-23 01:36:05",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o70kfx2",
          "author": "Darijan__",
          "text": "let's connect on linkedin: darijan ducic",
          "score": 1,
          "created_utc": "2026-02-23 20:32:39",
          "is_submitter": false,
          "replies": [
            {
              "id": "o71fasx",
              "author": "Foreign-Handle-2950",
              "text": "Invitation sent",
              "score": 1,
              "created_utc": "2026-02-23 23:06:53",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7jti8m",
          "author": "ProPreet10",
          "text": "It's not about the country it's about him or her passion and intelligence to scale the business",
          "score": 1,
          "created_utc": "2026-02-26 17:37:58",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rc1tzx",
      "title": "Networking in San Francisco",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1rc1tzx/networking_in_san_francisco/",
      "author": "foo_bar_baazigar",
      "created_utc": "2026-02-22 23:54:30",
      "score": 8,
      "num_comments": 7,
      "upvote_ratio": 0.91,
      "text": "Hello everyone. I’m relocating to San Francisco and would greatly appreciate your recommendations for places to stay.\n\nMy primary goal is to network with founders, entrepreneurs, venture capitalists, and build a strong and meaningful social circle.\n\nI’m open to sharing apartments or participating in coliving communities. Any suggestions you may have would be greatly appreciated.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1rc1tzx/networking_in_san_francisco/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o6vc7oz",
          "author": "Visual-Slip-969",
          "text": "Find hacker houses/coliving places. It's unconventional living but networking on steroids.",
          "score": 3,
          "created_utc": "2026-02-23 00:36:06",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6vcmfe",
              "author": "foo_bar_baazigar",
              "text": "Any recommendations?",
              "score": 1,
              "created_utc": "2026-02-23 00:38:25",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6vfvhh",
                  "author": "Visual-Slip-969",
                  "text": "Not lived in SF now for a number of years, so it's probably a whole new set of players. Check Craigslist or even airbnb.",
                  "score": 1,
                  "created_utc": "2026-02-23 00:57:10",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o6vjh4g",
          "author": "Full-Leg-5435",
          "text": "Hey im considering moving to SF as well, but a little overwhelmed with the decision. What has been your motivation to do so? How much do you plan on spending monthly, and what do your next few months’ plans look like?",
          "score": 1,
          "created_utc": "2026-02-23 01:18:47",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rgbnvt",
      "title": "Three cofounders: one builds, the second does GTM, what does the third do?",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1rgbnvt/three_cofounders_one_builds_the_second_does_gtm/",
      "author": "ReporterCalm6238",
      "created_utc": "2026-02-27 16:40:11",
      "score": 7,
      "num_comments": 14,
      "upvote_ratio": 1.0,
      "text": "I tend to think that third one should also do GTM, at least in the early stages. We all know that GTM is the bottleneck so it requires more resources. But I'm curious to hear from startups with three co-founders: how did you divide the roles?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1rgbnvt/three_cofounders_one_builds_the_second_does_gtm/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o7q8ge4",
          "author": "edkang99",
          "text": "If you’re asking that question you probably have too many cofounders TBH. It should be pretty apparent what they bring to the table without too much overlap. If you’re raising capital be prepared to defend the team if this isn’t clear.",
          "score": 15,
          "created_utc": "2026-02-27 16:51:07",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7q9sr7",
              "author": "ReporterCalm6238",
              "text": "This is exactly my fear, that the third cofounder is not needed. ",
              "score": 3,
              "created_utc": "2026-02-27 16:57:20",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7qbz31",
          "author": "suchsuchsuchsuch",
          "text": "You can have one person manage operations.",
          "score": 5,
          "created_utc": "2026-02-27 17:07:35",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7qceh2",
              "author": "ReporterCalm6238",
              "text": "What does that entail precisely?",
              "score": 2,
              "created_utc": "2026-02-27 17:09:38",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7rrfac",
                  "author": "pnkCode",
                  "text": "depends on what you do - I would assume there is no shortage of work to do so make a rule where their work fills any gaps ",
                  "score": 2,
                  "created_utc": "2026-02-27 21:18:05",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7r9ldn",
          "author": "Tall-Log-1955",
          "text": "Ideally, whatever needs to be done.  Early startups don’t have formal roles you just all move things forward as well as you can.  If the best way to move the biz forward is to have the engineers cold calling, then do that.",
          "score": 4,
          "created_utc": "2026-02-27 19:48:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7rdj14",
          "author": "TangerineExternal176",
          "text": "In a few of the startups I’ve seen, one co-founder handled product and tech, another did GTM and customer development, and the third kind of floated between ops and fundraising. The tricky part is GTM often ends up taking more time than anyone expects, especially early on.\n\nOut of curiosity, did your team try splitting GTM responsibilities between two people or have one full-time owner? I’ve noticed that approach either kills bottlenecks or creates constant friction depending on the founders’ skillsets.",
          "score": 3,
          "created_utc": "2026-02-27 20:08:04",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7rerav",
              "author": "ReporterCalm6238",
              "text": "we'll discuss splitting GTM for sure. I was thinking that one can focus on email/linkedin/calls outreach and another one can focus on ads/making content/building audience/spotting leads-dense communities",
              "score": 1,
              "created_utc": "2026-02-27 20:14:18",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7rf0cy",
                  "author": "TangerineExternal176",
                  "text": "Do you feel GTM should always be a dedicated role from day one, or can it be rotated early on?",
                  "score": 1,
                  "created_utc": "2026-02-27 20:15:34",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7qmez6",
          "author": "No_Drive2275",
          "text": "Everyone should build",
          "score": 2,
          "created_utc": "2026-02-27 17:57:25",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7qrsv4",
              "author": "ReporterCalm6238",
              "text": "You talking about software company? Absolutely disagree. This was true maybe 1 year ago. You can spin up an MVP in 1 day with Claude Code. Bottleneck is GTM 100%.",
              "score": 2,
              "created_utc": "2026-02-27 18:22:41",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7s7i7y",
          "author": "NordicLard",
          "text": "For us someone is GTM, someone is CTO, someone leads the research and science part. \n\nWe generally help out with eachother but that’s the defined roles.",
          "score": 1,
          "created_utc": "2026-02-27 22:40:46",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7shu9i",
          "author": "CHTheAssassin",
          "text": "You could always use more building or more GTM",
          "score": 1,
          "created_utc": "2026-02-27 23:38:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7t5gn5",
          "author": "tmaleh",
          "text": "fundraises?!",
          "score": 1,
          "created_utc": "2026-02-28 02:01:00",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rfrgrq",
      "title": "AI has made the idea maze trivially easy to navigate. The actual competitive advantage in 2026 is something much harder to copy",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1rfrgrq/ai_has_made_the_idea_maze_trivially_easy_to/",
      "author": "goxper",
      "created_utc": "2026-02-27 00:22:24",
      "score": 6,
      "num_comments": 6,
      "upvote_ratio": 0.75,
      "text": "Paul Graham's \"idea maze\" concept: the best founders have thought so deeply about their space that they've mentally mapped every path, dead end, and why competitors before them failed. For the last decade, getting through the maze required months of research, customer interviews, and pattern recognition that took real time to accumulate. Now you can prompt your way through a surprisingly complete version of the maze in a weekend. Competitive landscape, failure modes of previous attempts, regulatory considerations, unit economics benchmarks. It's all there. Which means the maze is no longer the moat  \nWhat's actually hard to replicate now: founder-market fit that goes beyond research. The kind that comes from having lived inside a problem for years. Distribution relationships built over time. The willingness to do the specific unglamorous thing that makes a market work before it's obvious\n\nIntelligence and information are increasingly commoditized. What's your theory of what actually differentiates founders now?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1rfrgrq/ai_has_made_the_idea_maze_trivially_easy_to/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o7md1ns",
          "author": "RavenLLevitt",
          "text": "I'd completely disagree, while it can certainly speed up the process of exploration true mapping of the maze is still absolutely a deeply complex problem that takes extensive time to solve.",
          "score": 13,
          "created_utc": "2026-02-27 01:13:02",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7mj7if",
              "author": "Zealousideal-Run9530",
              "text": "true",
              "score": 1,
              "created_utc": "2026-02-27 01:48:49",
              "is_submitter": false,
              "replies": []
            },
            {
              "id": "o7mj973",
              "author": "Zealousideal-Run9530",
              "text": "true",
              "score": 1,
              "created_utc": "2026-02-27 01:49:05",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7ml9q7",
          "author": "CoolSnow01",
          "text": "I don't know if the post is bait or not, but regardless of that I'd say that throwing a few prompts to speculate about how market would behave differs a lot from actually doing research and figuring out \"the maze\".",
          "score": 4,
          "created_utc": "2026-02-27 02:00:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7mroha",
          "author": "suss_ann",
          "text": "personality, self-belief, and unwavering focus. mind/matter",
          "score": 1,
          "created_utc": "2026-02-27 02:37:47",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rfipsb",
      "title": "Meeting people in sfo",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1rfipsb/meeting_people_in_sfo/",
      "author": "Street_You2981",
      "created_utc": "2026-02-26 18:49:25",
      "score": 5,
      "num_comments": 8,
      "upvote_ratio": 1.0,
      "text": "I’m moving to San Francisco for a month at the start of summer and want to use the time properly. I’m a UK corporate lawyer transitioning into startups (building in legal/AI) and I’m keen to meet strong operators, engineers, and potentially find a co-founder.\n\nI know the obvious advice: go to AI meetups, YC events, demo nights, hackathons, etc. I’ll definitely do that. But I’m more interested in how people actually build meaningful connections in SF rather than just surface-level networking.\n\nIs cold outreach on LinkedIn or X (Twitter) worth doing before I arrive? If so, what’s the best way to structure it so it doesn’t feel spammy? Do founders actually respond to “coffee while I’m in town” messages?\n\nAre there specific communities, Slack groups, founder houses, or smaller curated events that are higher signal than big public meetups?\n\nFor those who’ve successfully found a co-founder in SF, how did it happen in practice? Was it through events, mutual intros, working on a small project together first, or something else entirely?\n\nIf you had one month in SF and your goal was to build real relationships (not just collect LinkedIn connections), how would you structure your time?\n\nAppreciate any practical, experience-based advice.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1rfipsb/meeting_people_in_sfo/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o7nar5l",
          "author": "Firefight41",
          "text": "Great advice I heard was to sit at Starbucks near the entrance with a small sign that says “let me tell you about my startup and I’ll buy your coffee.”",
          "score": 3,
          "created_utc": "2026-02-27 04:36:21",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7len1h",
          "author": "RubNo8609",
          "text": "I’m in similar situation, building my startup in UK and planning to move to SF. Let’s connect 👋",
          "score": 2,
          "created_utc": "2026-02-26 22:07:17",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7lgj6d",
              "author": "Street_You2981",
              "text": "Yes let’s chat mate",
              "score": 1,
              "created_utc": "2026-02-26 22:16:41",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o7pm2kf",
                  "author": "Altruistic_Order1993",
                  "text": "I am thinking the same, can we connect ?",
                  "score": 1,
                  "created_utc": "2026-02-27 15:04:23",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7l6935",
          "author": "Best-Objective-8948",
          "text": "Go to events. Check out Cerebral Valley and Luma",
          "score": 1,
          "created_utc": "2026-02-26 21:26:53",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7ni4ba",
          "author": "AnyExit8486",
          "text": "definitely worth cold reaching out to specific people whose work you admire. most founders have some version of imposter syndrome so a thoughtful message about why you want to connect matters. skip the generic coffee asks. show youve done your homework. sf is all about who you know but also about what youre building so have a solid pitch ready",
          "score": 1,
          "created_utc": "2026-02-27 05:28:36",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7or1hy",
          "author": "Background-Might3453",
          "text": "One month goes fast in SF. The highest-signal connections I’ve seen came from small, repeat interactions not one-off events.\n\nCold outreach can work if it’s specific and low-pressure. Less “coffee chat?” and more “I’m exploring X, saw you built Y, would love 15 mins to learn.” Co-founders usually emerge from working together, not networking alone.",
          "score": 1,
          "created_utc": "2026-02-27 12:00:57",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7kmb2e",
          "author": "salespire",
          "text": "Cold outreach in SF does work, but the key is to avoid generic \"coffee chat\" asks and instead lead with curiosity or value. When reaching out before you arrive, keep it personal and specific. Rather than a mass message, reference something they’ve built or written that connects to your background or goals. Point out exactly why you’re reaching out to them, not just any founder. I’ve met people in SF who genuinely enjoy making connections if there’s a shared sense of purpose or an interesting angle, especially if you are coming from a field like law intersecting with AI. Also, DM groups on Twitter/X can be surprisingly high signal, and founder specific Slack communities like Launch House, On Deck, and South Park Commons are worth applying to, even for a short stay. A lot of the best relationships I’ve seen form from working on a small side project together, or serendipitous intros through mutual friends after a few in person meetings.\n\nStructuring your month, I’d spend your first week meeting as many people as possible (intros, events, walks, dinners), then double down with follow ups for deeper conversations with people who seem aligned. If you’re interested, I actually just opened my AI agent platform’s waitlist at [https://salespire.io](https://salespire.io) for early users building at this intersection. Happy to chat if you want to see how it works or just swap notes about navigating SF as a builder.",
          "score": -1,
          "created_utc": "2026-02-26 19:51:34",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rg81ce",
      "title": "What is the best way to learn the latest jargon quickly?",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1rg81ce/what_is_the_best_way_to_learn_the_latest_jargon/",
      "author": "TheBigCicero",
      "created_utc": "2026-02-27 14:23:51",
      "score": 5,
      "num_comments": 4,
      "upvote_ratio": 0.86,
      "text": "I haven’t been in the start up space in 15 years and suddenly find myself back in it. I heard the terms “default dead” and “default alive” for the first time yesterday. \n\nWho has the cheat code to learn the lingo from the past 10 years???\n\nThank you! ",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1rg81ce/what_is_the_best_way_to_learn_the_latest_jargon/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o7pi48j",
          "author": "Background-Might3453",
          "text": "You’re not alone 😅 the vocabulary definitely evolved.\n\nQuick decode:\n• Default dead = if nothing changes, you’ll run out of money\n• Default alive = if you do nothing, you still survive\n• PMF, GTM, burn, runway, ICP, wedge = everywhere now\n\nHonestly, the fastest cheat code isn’t blogs, it’s lurking in founder Twitter/X, YC content, and startup subreddits for a few weeks. The terms repeat fast and click quickly once you see them in context.",
          "score": 3,
          "created_utc": "2026-02-27 14:44:29",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7psnu6",
              "author": "TheBigCicero",
              "text": "Thank you for the tip! And yes, wedge is a new one for me, too!",
              "score": 1,
              "created_utc": "2026-02-27 15:36:23",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7rdd94",
          "author": "HatchedLake721",
          "text": "ask ChatGPT",
          "score": 1,
          "created_utc": "2026-02-27 20:07:15",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7q9dl1",
          "author": "BugHunterX99",
          "text": "honestly the cheat code isn’t a glossary\n\nit’s immersion\n\nhere’s the fastest way back in:\n\n1. read fund memos and founder essays paul graham, lenny’s newsletter, and a16z blog. you’ll absorb \"default alive,\" \"venture scale,\"\"power law,\" \"founder mode\" naturally in context.\n2. lurk on startup twitter / x for 2 weeks the jargon shows up repeatedly. repetition is how it sticks.\n3. ask dumb questions publicly seriously. half the terms are recycled ideas with new branding.\n\nfor example:  \ndefault alive = you can survive without raising  \ndefault dead = you need outside capital to live\n\nsounds fancy. it’s just burn vs runway.\n\nstartup jargon is mostly repackaged finance + growth concepts with better marketing.\n\nbest mindset:  \ndon’t try to memorize the words  \nunderstand the incentives behind them\n\nthe language changes every 5 years  \nthe game doesn’t.",
          "score": 0,
          "created_utc": "2026-02-27 16:55:23",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rdzi5t",
      "title": "Tech Startup or Family Business in CPG",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1rdzi5t/tech_startup_or_family_business_in_cpg/",
      "author": "HongKongRad",
      "created_utc": "2026-02-25 01:32:08",
      "score": 4,
      "num_comments": 4,
      "upvote_ratio": 0.84,
      "text": "Hi guys I wanted to ask for help on career advice that maybe some of you can relate to.\n\nI am a couple years out of undergrad where I studied computer engineering, and interned at big tech and startup in the West Coast. Right after college I joined my family business (manufacturing and wholesale of CPG), and I’ve done decently well. At this point I am done following my family’s footsteps and I am interested in pursuing working in the tech industry again, esp with all of the exciting AI Startups now (would be a dream to get into YC and start a software startup of my own).\n\nI have been experimenting with vibe coding tools like cursor and Claude, and I have been making some prototypes for a B2B saas idea. I understand that for it to truly be a legit software startup, I am nowhere close to that.\n\nI was thinking that I should get a job within a tech startup/corporate first in order to learn the ropes so that I would have the right experience to start my own thing. I have a few classmates from college in YC but I personally don’t feel I have the chops they’re hiring for, since they’re hiring ppl from big tech. It’s been several years so I’ve incredibly rusty in my technical skills, and I have high doubts about my employability since ive only worked in B2B sales and distribution in the physical product space, and idk how transferable any of my skills are from my family business. I know that currently the tech industry is not doing well in terms of hiring people.\n\nShould I go to grad school and get enough technical skills for me to start my own startup, or am I just fantasizing about the AI boom at the moment and I should just be realistic and stick with my family business that is already doing well? I am just so fascinated by all the advancements of AI that I would honestly love to be part of this societal growth and I do not have much interest in my family industry at all.\n\nAny feedback or advice is absolutely appreciated. I understand this sort of post is a bit different from the other posts and I will accept the hate but this is a genuine struggle that I have been dealing with for months. Thank you so much",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1rdzi5t/tech_startup_or_family_business_in_cpg/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o7958w5",
          "author": "slow_start_1990",
          "text": "Join the family business and learn it inside out. That’s your unfair advantage. You’ll start noticing how many things are still done the old way, and chances are the same problems exist across the entire industry. Solving those problems can become your side project — and potentially something much bigger.",
          "score": 9,
          "created_utc": "2026-02-25 02:16:38",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7adrf2",
          "author": "praneethb7",
          "text": "youre not fantasizing youre just romanticizing one path and underestimating the other\n\nfirst thing\n\nrunning a real CPG business is not small experience. operations sales distribution cash flow inventory supplier negotiation all of that is founder training most YC kids dont have\n\nyou feel rusty technically but youre not inexperienced. youre differently experienced.\n\ngrad school will not magically make you startup ready. most startups are not won by deepest theory theyre won by distribution speed and problem insight\n\nalso you dont need to quit everything to test this\n\nyou can  \nkeep family biz income  \nship small ai tools nights/weekends  \ntalk to 20 real customers  \nsee if anyone pays\n\nif no one pays its signal not failure\n\nif someone pays now youre not fantasizing anymore\n\nalso big tech job first is fine but not required. lots of founders didnt go back to school or big tech they just built and learned in public\n\nhonestly your unfair advantage might be combining CPG + AI. most ai founders have zero real world industry exposure.\n\ndont choose identity. choose experiments.\n\nstick with stable cash flow while you validate. excitement is good but runway is better.\n\nyou dont need permission to build. you need proof someone cares.",
          "score": 3,
          "created_utc": "2026-02-25 07:22:26",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7f8dxi",
          "author": "erickrealz",
          "text": "You're sitting on something most tech founders would kill for, actual B2B sales experience and a real understanding of physical supply chains. That's not a weakness, that's your unfair advantage. The best SaaS companies are built by people who deeply understand the industry they're serving.\n\nDon't go to grad school and don't quit your family business yet. Build your B2B SaaS prototype nights and weekends using the vibe coding tools you're already experimenting with. Target the CPG or wholesale space because you literally know the problems firsthand. Your YC friends have technical skills but they're guessing at market problems. You already know which ones are damn real.",
          "score": 2,
          "created_utc": "2026-02-25 23:51:52",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1rarwef",
      "title": "How I got 266 users, 2 paid customers, and $6 revenue in 14 days?",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1rarwef/how_i_got_266_users_2_paid_customers_and_6/",
      "author": "chacha_chu",
      "created_utc": "2026-02-21 14:03:47",
      "score": 4,
      "num_comments": 19,
      "upvote_ratio": 0.61,
      "text": "Hey everyone,\n\nI launched a tiny SaaS 2 weeks ago.\n\nNo audience.  \nNo Product Hunt launch.  \nNo Twitter following.  \nNo ads.\n\nJust shipped and started posting.\n\n# The numbers (first 14 days)\n\n* 266 signups\n* 2 paid users\n* $6 revenue\n* \\~0 refunds\n* A lot of lessons\n\nNot impressive revenue-wise.  \nBut very eye-opening.\n\n# What I built\n\nIt’s a tool that turns a website or text into a short promo-style video automatically.\n\nTarget users:\n\n* Indie hackers launching products\n* Course creators\n* Newsletter writers\n* Small SaaS founders\n\nBasically anyone who needs quick promo videos but doesn’t want to edit manually.\n\n# What actually brought the 266 users?\n\n1. Reddit comments (not posts)\n2. Answering questions in relevant threads\n3. Showing product in context (not “hey try my tool”)\n4. A small free usage model\n\nI avoided:\n\n* Cold DMs\n* Paid ads\n* “Check my startup” posts\n* Spammy links\n\nMost users came from conversations where video creation was the real problem being discussed.\n\n# What surprised me\n\n# 1.) Free users don’t convert just because they signed up\n\nMost users just try once and disappear.\n\nLesson:  \nSignups ≠ validation.\n\n# 2.) Pricing matters more than features\n\nMy pricing was messy in the beginning.\n\nWhen you’re small, simplicity > flexibility.\n\nToo many options confuses people.\n\n# 3.) Payment friction kills small revenue\n\nWhen someone is paying $1–$5, payment fees and failures matter a lot.\n\nMicro-payments are brutal.\n\n# 4.) 2 paying users felt bigger than 266 signups\n\nBecause that means:\n\nSomeone saw value.  \nSomeone trusted enough to enter card details.  \nSomeone actually needed the product.\n\nThat changes mindset completely.\n\n# Biggest learning\n\nGetting users is easier than getting paid users.\n\nPeople will try tools.  \nVery few will pay.\n\nThe real game starts after first revenue.\n\n# What I’m experimenting next\n\n* Simpler pricing (maybe one plan only)\n* Limited free usage instead of generous credits\n* Talking directly to paid users to understand why they converted\n* Improving positioning (less “cool tech”, more “clear outcome”)\n\nIf you’ve gone from 0 → first paying customers recently,  \nwhat changed for you?\n\nWould love to learn from others building in this stage.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1rarwef/how_i_got_266_users_2_paid_customers_and_6/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o6mendw",
          "author": "Due_Researcher3729",
          "text": "Could you please drop a link in DM?",
          "score": 1,
          "created_utc": "2026-02-21 16:26:27",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6m26oq",
          "author": "jspandher",
          "text": "Motivation I needed right now, thanks bud 🙏\n\nI built this product for photographers (I’m a photographer too) because I was running into issues with the current services out there.\n\nI’ve been reaching out to photographers to try it, but honestly it hasn’t worked so far.\n\nI’m going to try the steps you mentioned. I’m not really great at marketing or posting consistently, but I’ll give it a shot this time.",
          "score": 1,
          "created_utc": "2026-02-21 15:23:42",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o6lorfd",
          "author": "Ok_Worldliness_2291",
          "text": "mate I'm at 17k mrr with [grepped.ai](http://grepped.ai) in 2 months, you can do better lmao",
          "score": -13,
          "created_utc": "2026-02-21 14:07:36",
          "is_submitter": false,
          "replies": [
            {
              "id": "o6lp6qs",
              "author": "RosesandPeaches20",
              "text": "Let us appreciate people",
              "score": 10,
              "created_utc": "2026-02-21 14:10:10",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6lpmnf",
                  "author": "Ok_Worldliness_2291",
                  "text": "of course, but let us not celebrate things unworthy of celebration\n\ninstead of spending time writing his post he could've gotten to atleast $10 😂",
                  "score": -7,
                  "created_utc": "2026-02-21 14:12:52",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o6ls14g",
              "author": "hau5keeping",
              "text": "Mate im at $100k mrr with my startup in 2 hours, you can do better lmao",
              "score": 4,
              "created_utc": "2026-02-21 14:27:11",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6ltvmn",
                  "author": "RosesandPeaches20",
                  "text": "This is so funny😂😂😂",
                  "score": 3,
                  "created_utc": "2026-02-21 14:37:58",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o6lv4qb",
                  "author": "Ok_Worldliness_2291",
                  "text": "now thats impressive!",
                  "score": -1,
                  "created_utc": "2026-02-21 14:45:10",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o6majd8",
                  "author": "overquantityi",
                  "text": "Yes u probably do of",
                  "score": -1,
                  "created_utc": "2026-02-21 16:05:51",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o6lwk4s",
              "author": "hourself_24",
              "text": "Very meta. Using the same playbook in the post of plugging your startup in a Reddit comments section. \n\nI see you…",
              "score": 3,
              "created_utc": "2026-02-21 14:53:13",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o6lxmo9",
                  "author": "Ok_Worldliness_2291",
                  "text": "you've caught me ;)",
                  "score": -2,
                  "created_utc": "2026-02-21 14:59:12",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            },
            {
              "id": "o6ls2m8",
              "author": "chacha_chu",
              "text": "Yes I could have done better..any suggestions how?",
              "score": 1,
              "created_utc": "2026-02-21 14:27:25",
              "is_submitter": true,
              "replies": [
                {
                  "id": "o6lv8po",
                  "author": "Ok_Worldliness_2291",
                  "text": "I quite literally know nothing of your business \n\nsend me your website and I will take a look :)",
                  "score": -3,
                  "created_utc": "2026-02-21 14:45:48",
                  "is_submitter": false,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "id": "1rfkqa4",
      "title": "How are fast growing YC Startups hiring fast?",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1rfkqa4/how_are_fast_growing_yc_startups_hiring_fast/",
      "author": "iambuildin",
      "created_utc": "2026-02-26 20:03:22",
      "score": 4,
      "num_comments": 12,
      "upvote_ratio": 0.7,
      "text": "I guess using AI coding agents would be a default expectation. What is the nature of screening and evaluation to source the right candidates who can think and design well ?\n\nAlso, are you hiring remote to increase the conversion rate?",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1rfkqa4/how_are_fast_growing_yc_startups_hiring_fast/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o7ll4bn",
          "author": "kittykat87654321",
          "text": "i interviewed with a bunch of YC startups recently and most of them had me do a live coding session/project using any AI tools i wanted. one or two had me do a leetcode adjacent problem before that. one of them gave me a take home project (basically have claude code do it)",
          "score": 6,
          "created_utc": "2026-02-26 22:39:45",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7orxkg",
          "author": "Background-Might3453",
          "text": "AI agents are table stakes now. What I screen for is how people think, not how fast they ship.\n\nSmall take-home problems, design tradeoff discussions, and async written explanations reveal way more than resumes. Remote hiring definitely widens the funnel, but the bar has to be very explicit.",
          "score": 3,
          "created_utc": "2026-02-27 12:07:28",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7oyui5",
          "author": "That-Angle-7708",
          "text": "We are using [Langos.io](http://Langos.io) for this reason ",
          "score": 3,
          "created_utc": "2026-02-27 12:55:45",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7qeijl",
              "author": "bicx",
              "text": "Can you give any insight as to the cost of this?",
              "score": 1,
              "created_utc": "2026-02-27 17:19:39",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7rrwye",
                  "author": "iambuildin",
                  "text": "https://www.langos.io/#pricing",
                  "score": 1,
                  "created_utc": "2026-02-27 21:20:30",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        },
        {
          "id": "o7npvfs",
          "author": "poseidon9052",
          "text": "!remind me 24 hours",
          "score": 1,
          "created_utc": "2026-02-27 06:30:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7npzse",
              "author": "RemindMeBot",
              "text": "I will be messaging you in 1 day on [**2026-02-28 06:30:01 UTC**](http://www.wolframalpha.com/input/?i=2026-02-28%2006:30:01%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/ycombinator/comments/1rfkqa4/how_are_fast_growing_yc_startups_hiring_fast/o7npvfs/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fycombinator%2Fcomments%2F1rfkqa4%2Fhow_are_fast_growing_yc_startups_hiring_fast%2Fo7npvfs%2F%5D%0A%0ARemindMe%21%202026-02-28%2006%3A30%3A01%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201rfkqa4)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
              "score": 1,
              "created_utc": "2026-02-27 06:30:58",
              "is_submitter": false,
              "replies": []
            }
          ]
        },
        {
          "id": "o7ozgt1",
          "author": "quietoddsreader",
          "text": "fast teams hire for learning speed and ownership, not perfect resumes. short trials on real problems filter better than interviews, and remote just increases surface area while the bar stays high.",
          "score": 1,
          "created_utc": "2026-02-27 12:59:43",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7q9wf0",
          "author": "BugHunterX99",
          "text": "they’re not “hiring fast” the way you think\n\nthey’re **deciding fast**\n\nbig difference\n\nmost YC startups don’t run 6 round interview loops. they:\n\n* source heavily from warm networks\n* test with a real problem\n* look for speed + ownership, not polish\n\nscreening usually isn’t leetcode circus. it’s:\n\n“here’s a real feature / bug / design problem. show me how you think.”\n\nthey care about:\n\n* can you ship without babysitting\n* can you reason from first principles\n* do you default to action\n\nAI coding agents aren’t the filter. judgment is.\n\nand no, remote doesn’t automatically increase conversion. early YC companies often prefer in-person because speed > flexibility at that stage.\n\nharsh truth:\n\nfast growing startups don’t optimize for “best candidate”  \nthey optimize for “will this person increase velocity next week”\n\nif you can’t move the product fast, pedigree doesn’t matter.",
          "score": 0,
          "created_utc": "2026-02-27 16:57:48",
          "is_submitter": false,
          "replies": []
        }
      ]
    },
    {
      "id": "1retwb8",
      "title": "When is best to incorporate for B2B? Timing, $ runway, early clients..",
      "subreddit": "ycombinator",
      "url": "https://www.reddit.com/r/ycombinator/comments/1retwb8/when_is_best_to_incorporate_for_b2b_timing_runway/",
      "author": "jonathonjames",
      "created_utc": "2026-02-25 23:37:30",
      "score": 3,
      "num_comments": 10,
      "upvote_ratio": 0.81,
      "text": "We’ve  been bootstrapping a B2B SaaS and working closely with first potential enterprise pilot client - came thru their accelerator.\n\nTheyre willing to move forward, but they want to see us setup as a C-corp, funded and they want equity as well as pilot payment (pilot payment is common).\n\nWe have no investors (yet, but handful on the hook). If we open a C-Corp, raise a round, issue equity, and proceed…GREAT if it works. But if startup fails, we’ve escalated structure and dilution earlier than we might otherwise.\n\nHesitation isn’t about belief in the product. It’s about timing and structure.\n\nQuestions for founders who’ve been here:\n\n1.\tIs converting to a C-Corp and accepting early dilution justified at this stage for an anchor partner? What if they don’t actually proceed (they know how early we are)\n\n2 should we say ‘bye’ to this prospect and find first clean enterprise pilot client (no equity loss) to get more leverage with investors?\n\n3 what if we can’t close with investors and we’re stuck with this C-corp?\n\n4 How painful (and costly) is it realistically if a C-Corp needs to be shut  down and you’ve issued stock?\n\n5 Both founders financial runway is low, what if we get freelance or full time jobs, can/should we still operate a c corp?\n\nLooking for grounded feedback from people who’ve navigated this fork.",
      "is_original_content": false,
      "link_flair_text": null,
      "permalink": "https://reddit.com/r/ycombinator/comments/1retwb8/when_is_best_to_incorporate_for_b2b_timing_runway/",
      "domain": "self.ycombinator",
      "is_self": true,
      "comments": [
        {
          "id": "o7f8c25",
          "author": "b_an_angel",
          "text": "On the C-Corp timing question:\n\nIncorporating as a C-Corp is inevitable if you're going to raise VC money and scale. The question is just \\*when\\*. The cost of incorporating (Stripe Atlas, Clerky, etc.) is like $500-2k. That's not the scary part. The scary part is issuing equity before you have clarity on valuation and terms.\n\n\n\nOn the anchor partner wanting equity:\n\nThis is a yellow flag for me. Pilot customers paying for pilots = normal. Pilot customers taking equity = complicated. A few things to think through:\n\n\\- What % are they asking for? If it's meaningful, that's a problem for future investors who will see that cap table and ask questions\n\n\\- Is this actually their standard ask, or is this an accelerator trying to extract value from their portfolio companies?\n\n\\- Have you talked to other founders who went through this same accelerator?\n\n\n\nOn your specific questions:\n\n1. Early dilution to an anchor partner is only justified if they're a genuine reference customer who will actively sell for you, not just use you. \"Willing to move forward\" is not the same as \"will be our champion and close our next 10 deals\"\n\n2. I wouldn't say bye yet, but I'd push back hard on the equity piece. Negotiate. The pilot payment should be enough for a stage-appropriate relationship. If they won't move without equity, that tells you something about how they see the power dynamic here.\n\n3. Stuck with a C-Corp and no investors is annoying but manageable. You can keep it dormant cheaply. Delaware franchise taxes are the main cost (\\~$400/yr minimum). Not a catastrophe.\n\n4. Shutting down a C-Corp with issued stock requires consent from stockholders, filing dissolution paperwork, and potentially some legal fees. Painful? Moderate. Expensive? A few thousand dollars if it's clean. The messier the cap table, the messier the wind-down.\n\n5. Yes, absolutely you can hold jobs and operate a C-Corp. Tons of founders do this. Just make sure your employment agreements don't have IP assignment clauses that would conflict. Read those carefully.\n\n\n\nThe real risk here isn't the C-Corp structure. It's anchoring your entire fundraising narrative to one client who is giving you conditional signals. Investors are going to ask \"what's the status with your anchor customer?\" and \"we're in conversations\" is a weak answer that can actually hurt you.\n\nIf you're going to go down this path, get something in writing from them first. An LOI, a signed pilot agreement, \\*something\\* before you restructure your company around their requirements.",
          "score": 3,
          "created_utc": "2026-02-25 23:51:34",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7fbqah",
              "author": "jonathonjames",
              "text": "incredible feedback. Thank you.. here goes:\n\non the anchor partner wanting equity: they haven't given the number yet. But its a risk thing for them. Also they see it as an opportunity cost for leveraging their name/reputational value. And its them seeing the future value and wanting a piece. Its an accelerator/incubator piece of a large institution. I have not talked to others who went through it, but will look and see if I can find.\n\n1. they will be genuine reference partner. Will negotiate hard to get several ideas in writing for this. They will not sell for us, but I'd want them in the sales process as reference/case study on calls etc\n\n2. Will push hard / negotiate.\n\n3. Good to know, I've heard similar.\n\n4. Great insight.. so if for some reason a stockholder says no then you cannot shut it down? and you're stuck with operational fees each year because of it? unless you have a smart clause in a contract.\n\n5. ok got it. \n\nThis anchor prospect is the furthest along .. we have others in the pipeline we're warming up. No surprise, but what we do need is data / case study as soon as possible to leverage with others. Am going to ask for an LOI yes..\n\n  \n",
              "score": 1,
              "created_utc": "2026-02-26 00:10:21",
              "is_submitter": true,
              "replies": []
            }
          ]
        },
        {
          "id": "o7jdbso",
          "author": "Infamous_Spite_7715",
          "text": "ngl this is more of a strategic decision than a finance one but if runway is tight id definitely model out the cash burn scenarios before committing. maybe check out AsteroCFO.Ai for quick scenario planning.",
          "score": 2,
          "created_utc": "2026-02-26 16:23:12",
          "is_submitter": false,
          "replies": []
        },
        {
          "id": "o7gq5us",
          "author": "Fun_Ostrich_5521",
          "text": "You’re thinking about the legal structure.\n\nThe real question is leverage.\n\nEarly equity to a pilot customer only makes sense if one of these is true:\n\n\\*They materially accelerate distribution (intros, co-selling, logo gravity)\n\n\\*They materially de-risk fundraising (credible brand signal)\n\n\\*They materially shape product in a way others will copy\n\nIf it’s just we’ll run a pilot and maybe be a reference, equity is expensive currency.\n\nPilots are transactional.\n\nEquity is permanent.\n\nAlso: enterprise teams often overestimate how much their “logo value” helps at your stage. Investors care more about repeatability than a single anchor.\n\nOn the C-corp fear incorporating early isn’t the real risk.  \nMisallocating early cap table is.\n\nIf you do proceed, I’d structure it so: equity vests on successful pilot milestones, or is tied to multi-year commercial commitment, or is a warrant tied to revenue thresholds\n\nMake it performance-linked, not goodwill-linked.\n\nOtherwise you’re paying in ownership for conditional intent.\n\nThe fact that they haven’t given a % yet is signal. Get clarity before restructuring anything.",
          "score": 1,
          "created_utc": "2026-02-26 05:11:01",
          "is_submitter": false,
          "replies": [
            {
              "id": "o7ndndi",
              "author": "Available_Ad_5508",
              "text": "Get out of here with this ai slop. \n\nYou don’t give customers equity. Customers give you cash. That’s what being a customer is.",
              "score": 2,
              "created_utc": "2026-02-27 04:56:12",
              "is_submitter": false,
              "replies": [
                {
                  "id": "o7noval",
                  "author": "Fun_Ostrich_5521",
                  "text": "I generally agree; customers should pay cash.  \nEquity for pilot as a default is a bad trade.\n\nThe nuance is that in rare cases, strategic partners (not just customers) can justify structured equity if they materially change distribution or de-risk fundraising. That’s very different from giving up ownership for a paid pilot and most early founders conflate those two.\n\nIf it’s just a customer relationship, cash > equity every time.",
                  "score": 2,
                  "created_utc": "2026-02-27 06:21:47",
                  "is_submitter": false,
                  "replies": []
                },
                {
                  "id": "o7sux5p",
                  "author": "jonathonjames",
                  "text": "It’s not a customer initially.. it’s a pilot client . If we can prove the model then great, other customers will come. This is healthcare enterprise, so need that first one.",
                  "score": 2,
                  "created_utc": "2026-02-28 00:55:30",
                  "is_submitter": true,
                  "replies": []
                }
              ]
            }
          ]
        }
      ]
    }
  ]
}